[
  {
    "selfpaced": false, 
    "instructors": "Vladimir Avtonomov, Oleg Ananyin, Natalia Makasheva", 
    "description": "Все мы отдаём себе отчёт в том, что в наши дни непонимание процессов, происходящих в экономике, непростительно для людей, которые хотят добиться успеха в своей профессии, даже если она не связана напрямую с экономикой. История экономической мысли – это квинтэссенция опыта решения сложных проблем хозяйственной жизни; опыта, который складывался в борьбе идей, отражавших конфликтующие социальные интересы. Помимо того, что данный курс даст вам представление о том, как эволюционировала важнейшая наука, он призван развить критическое экономическое мышление, а также кругозор и общую эрудицию, что крайне высоко ценится в современном мире и обязательно будет отмечено на собеседовании в любой компании.\n\nВ нашем курсе обобщаются уроки выдающихся экономических мыслителей: Адама Смита и Карла Маркса, Леона Вальраса и Йозефа Шумпетера, Торстейна Веблена и Николая Кондратьева, Джона М. Кейнса и др. Мы будем разбираться в том, как, отвечая на вызовы своего времени, они создавали корпус современного экономического знания с его возможностями и ограничениями. \n\nДля освоения курса вам не потребуется никаких специальных знаний, а для его успешного завершения необходимо набрать проходной балл (80%) по всем оцениваемым заданиям.", 
    "end_date": null, 
    "title": "История экономической мысли (History of Economic Thought)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/55/b1254d747896918be6b9ae8a34e622/History-of-Economics.jpg", 
    "course_url": "https://en.coursera.org/learn/istoriya-ekonomicheskoy-mysli", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-02T01:21:51Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Наталья Андреевна Карнаухова (Natalya A. Karnaukhova), Андрей Петрович Глухов (Andrey P. Glukhov)", 
    "description": "Вот и пришло время дипломных испытаний, пора отпускать Ваш digital-корабль в неспокойные водовороты виртуального бизнеса! В рамках Вашего дипломного проекта у Вас появляется возможность соединить отдельные пазлы SMM-компетенций, о которых мы рассказывали на протяжении всей специализации (мониторинг и конкурентную разведку, графическое брендирование, комьюнити- и контент-менеджмент, продвижение и измерение эффективности и другие) в единую стратегию и тактику SMM-кампании по продвижению Вашего digital-проекта.\nВ свою очередь наша задача в рамках данного финального курса – оказать Вам информационную и методическую поддержку и пошаговое, что называется step-by-step, сопровождение реализации Вашего дипломного digital-проекта. \nКурс включает в себя в себя прохождение слушателями 7 учебных модулей  в течение 7 недель обучения. Каждый тематический модуль (за исключением первого вводного и 2-х заключительных модулей) содержит формулировку конкретных целей обучения, описание самостоятельного задания-этапа проекта, поддерживающие тематические и методические материалы. В конце каждой недели слушателям финального курса необходимо будет выполнить задание, оцениваемое сокурсниками из когорты в формате peer-to-peer. Это задание представляет собой определенный этап проекта и является элементом реализации продукта проекта. В заключение курса должен быть представлен продукт проекта в формате презентации рекламной SMM-кампании по продвижению и соответствующей бренд-платформы digital-проекта.\nПродукт проекта как результат всего Вашего обучения должен быть представлен в двух проекциях: как презентация результатов деятельности по проведению рекламной SMM-кампании digital-проекта и как объект, в данном случае  соответствующая бренд-платформа digital-проекта.\nИтак, у Вас есть все необходимое, чтобы реализовать Ваш дипломный digital-проект. В Добрый путь!", 
    "end_date": null, 
    "title": "Дипломный digital-проект: руководство к действию", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/b4/a78d40138011e6b00bbd15c77cf496/__________00000.png", 
    "course_url": "https://en.coursera.org/learn/digital-project", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-10T05:22:01Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Татьяна Борисовна Банкова (Tatiana B. Bankova), Елена Андреевна Юрина (Elena A. Yurina)", 
    "description": "Курс «Читаем русскую классику вместе. М. Булгаков \"Мастер и Маргарита\"» нацелен на овладение в совместной деятельности (преподаватель-студент) универсальной поэтапной моделью работы с художественным текстом, которая может быть использована как основа для формирования навыков смыслового чтения художественного произведения. Подобные навыки значимы как в реальной коммуникации, так и в учебной деятельности (на родном и иностранном языке). Произведение М. Булгакова \"Мастер и Маргарита\", выбранное для формирования навыков смыслового чтения, составляет золотой фонд мировой художественной культуры.\n\nВ этом курсе слушатели научатся:\n1. анализировать художественное произведение с точки зрения коммуникативного замысла автора; \n2. комментировать текст с точки зрения полученного коммуникативного задания; \n3. интепретировать художественный текст, выделяя содержательные и языковые единицы, являющиеся основой развития писательской мысли; \n4. прогнозировать содержание текста на основе смыслового анализа; \n5. конструировать собственное высказывание; \n6. рефлексировать по поводу образов, образных средств, коммуникативного замысла писателя; \n7. оценивать собственное речевое произведение, созданное как результат рефлексии по поводу текста.\n\nТребования к уровню подготовки слушателей: \n- знание базового курса русской литературы в объеме средней школы (для российских участников); \n- владение русским  языком на уровне А2 – В1 и выше (для иностранных обучающихся), \n- прочитанный роман М.А. Булгакова \"Мастер и Маргарита\" (для иностранных обучающихся возможно прочтение на родном языке). \n\nThe ideal outcome from the course is to master by means of teacher-student cooperation a universal model of work with literary text that may be used as a basis of purposeful reading skills formation. These skills are significant in real communication and in training activities (both in native and foreign languages). The writing that has been selected for purposeful reading skills formation is popular in Russia as well asabroad. Moreover it is a part of the world literature gold reserves. \n\nBy the end of the course learners will be able \n1) to analyze a writing from the point of view of the author’s communicative idea; \n2) to comment on the text considering the provided communicative task; \n3) to interpret a writingdefining meaningful and linguistic units that serve as a basis of the writer’s idea development; \n4) predict the content of the text basing on the sentiment analysis; \n5) to construct their own judgement; \n6) to introspect on the author’s images, means, communicative idea; \n7) evaluate their own speech utterance as a result of the introspection on the text; \n8) to compare the text of the writing considering the objective.\n\nNeeded Learner Background:\n- basic knowledge in Russian literature (equivalent to the secondary education in Russia), \n- level of competency in Russian – А2–В1 and higher (for foreign learners), \n- the novel 'The Master and Margarita’ by Mikhail Bulgakov read in advance (foreign learners may read the translation into their native language).", 
    "end_date": null, 
    "title": "Читаем русскую классику вместе.  М. Булгаков «Мастер и Маргарита»", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/16/673490a54f11e58ce46d165efb44cd/_____________00000.png", 
    "course_url": "https://en.coursera.org/learn/bulgakov-master-i-margarita", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-25T04:02:11Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Виктор Кантор, Эмели Драль", 
    "description": "Влияет ли знание методов анализа данных на уровень заработной платы? Работает ли система оценки кредитоспособности клиентов банка? Действительно ли новый баннер лучше старого? Чтобы ответить на такие вопросы, нужно собрать данные. Данные почти всегда содержат шум, поэтому утверждения, которые можно сделать на их основе, верны не всегда, а только с определённой вероятностью. Строить наиболее корректные выводы и численно оценивать степень уверенности в них помогают методы статистики. \n\nКак можно оценивать неизвестные параметры системы по небольшому количеству наблюдений? Как измерить точность таких оценок? Какие данные нужны, чтобы ответить на ваш вопрос, и на какие вопросы можно ответить с помощью уже имеющихся данных? Вы узнаете все, что нужно для успешного превращения данных в выводы — организация экспериментов, A/B-тестирование, универсальные методы оценки параметров и проверки гипотез, корреляции и причинно-следственные связи.", 
    "end_date": null, 
    "title": "Построение выводов по данным", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/41/880650b0de11e5a0fb177d76ab076a/800x800-04.jpg", 
    "course_url": "https://en.coursera.org/learn/stats-for-data-analysis", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-30T07:38:45Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ивашковская Ирина Васильевна, Sergey Stepanov", 
    "description": "Курс посвящен новой для российской практики методологии анализа компании, сфокусированной на задаче максимизации ее фундаментальной стоимости. Он основан на концепциях современной финансовой теории и выходит далеко за рамки интерпретации финансовой отчетности компании. \n\nПрименяя принципы универсальной финансовой теории, мы, тем не менее, отразим и специфику российского рынка капитала, который относится к группе развивающихся рынков. Курс основан на изучении публичных компаний,  однако его концепции применимы к компаниям любой организационно-правовой формы.\n\nМы сфокусируемся на анализе ключевых корпоративных решений: решений о привлечении капитала и решений об инвестициях. Инвестиционные решения – это выбор компанией проектов для долгосрочных вложений. Наша задача : научить вас современным методам оценки и критериям выбора инвестиционных проектов.  Решения о привлечении капитала – это выбор источников финансирования инвестиций (внутренние средства, заемные средства, средства привлеченные путем выпуска новых акций). Наша задача – объяснить мотивы выбора конкретной комбинации  инструментов финансирования в компании и показать, чем определяется оптимальная структура капитала компании (соотношение заемного и собственного капитала).\n\nМы также рассмотрим решения компании о выплатах акционерам, и продемонстрируем как полученные в этом курсе знания позволяют оценивать стоимость компании в целом, с учетом выбранной структуры капитала.\n\nНаконец, мы обсудим роль корпоративного управления (corporate governance) в создании стоимости компании.", 
    "end_date": null, 
    "title": "Основы корпоративных финансов (Fundamentals of Corporate Finance)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/8e/babc3621cec2144897866dcda42389/Corporate-finance.jpg", 
    "course_url": "https://en.coursera.org/learn/fundamentals-corporate-finance", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-09T03:19:28Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Svetlana  Avdasheva", 
    "description": "Курс посвящен факторам, влияющим на размер компаний и структуру рынка. Почему на одних рынках преобладают малые компании, а на другом крупные? Продавцы принимают решения стратегически, однако их стимулы в свою очередь зависят от структуры рынка и от предшествующих решений. Как разделить между зоной предопределенных и свободных решений? Например, сговор как модель ценового поведения – предопределен структурой рынка или служит результатом свободного волеизъявления? Способны ли укоренившиеся на рынке продавцы препятствовать входу новичков, защищая свою рыночную долю и свою прибыль? Каковы лучшие способы предотвращения ценовых сговоров продавцов? Нужно ли (или по крайней мере желательно) запрещать или ограничивать слияния между крупными продавцами? Есть ли необходимость для государственной политики налагать ограничения на условия договоров между производителем и дистрибьютором? Как в этих условиях должна быть организована государственная политика (применение антимонопольных запретов и регулирование)? На эти и другие вопросы мы и будем искать ответы.", 
    "end_date": null, 
    "title": "Теория отраслевых рынков (Industrial Organization)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/94/fdab4411cb6ff3fd4d651a71c5d635/industrial.jpg", 
    "course_url": "https://en.coursera.org/learn/otraslevye-rynki", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-30T11:21:55Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Igor Kim", 
    "description": "Главная цель курса - заложить у наших слушателей основы экономической грамотности, \"экономического образа мышления\" и показать, как экономические знания могут применяться в реальной жизни.\n\nКурс спроектирован так, чтобы быть интуитивно понятным даже слушателям, не обладающим какими-либо исходными знаниями по экономической теории, поэтому он не требует предварительной подготовки. Надеюсь, что изложение материала получилось максимально живым и неформальным.\n\nКурс включает важнейшие и наиболее связанные с повседневной жизнью темы из двух разделов экономической теории, микроэкономики и макроэкономики. Микроэкономика изучает поведение отдельных элементов экономической системы страны - прежде всего, потребителей и производителей - то, как они делают свой выбор (что купить/произвести) и как взаимодействуют друг с другом. Ключевые категории микроэкономического анализа, с которыми мы познакомимся: спрос и предложение; производство, издержки и прибыль; рыночные структуры (такие, как совершенная конкуренция, монополия и олигополия). Макроэкономика изучает экономическую систему страны как единое целое и проблемы, общие для всей экономики. Ключевые категории макроэкономического анализа, с которыми мы познакомимся: ВВП, инфляция и безработица; экономический рост и деловой цикл; государственная макроэкономическая политика.\n\nДля успешного завершения курса необходимо получить проходной балл по ВСЕМ оцениваемым заданиям (не менее 80% от максимального балла за задание). При этом каждое задание вы можете повторять до тех пор, пока не добьетесь успеха.", 
    "end_date": null, 
    "title": "Экономика для неэкономистов (Economics for non-economists)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e0/f93fe05dc111e4a260b1819267cd7d/ecnonec.png", 
    "course_url": "https://en.coursera.org/learn/ekonomika-dlya-neekonomistov", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-21T07:29:29Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "1338222", 
    "description": "Aprende los elementos esenciales necesarios para empezar a tocar la guitarra acústica o eléctrica. Aprenderás un enfoque fácil que te hará tocar rápidamente a través de una combinación de la exploración del instrumento, la técnica de ejecución y la teoría básica de la música.", 
    "end_date": null, 
    "title": "Introducción a la guitarra", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Berklee"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/6b/964440f78111e5a2b297ca70df7b3b/Guitar2.jpg", 
    "course_url": "https://en.coursera.org/learn/guitarra", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-08T04:50:06Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Берзон Николай Иосифович", 
    "description": "В рамках данного курса рассматриваются основные вопросы функционирования финансовых рынков, деятельности финансовых институтов, изучаются финансовые инструменты, с которыми приходится сталкиваться человеку в своей жизни. Помимо этого, раскрываются базовые принципы инвестирования свободных средств на финансовом рынке, основы проведения финансовых вычислений.\n\nВ настоящее время финансовый рынок активно используется компаниями, регионами и государством для привлечения финансовых ресурсов, обеспечивающих реализацию инвестиционных проектов. Однако востребован финансовый рынок не только со стороны финансовых институтов, но и частных инвесторов, которые используют его для размещения временно свободных денежных средств с целью получения дохода на вложенный капитал. Изучение курса позволит слушателю лучше ориентироваться в современном финансовом мире, понимать причины финансовых кризисов, роль процессов глобализации и секьюритизации финансовых рынков, возможности финансовой инженерии.\n\nФинальная оценка за курс основана на 9 тестах, выполняемых в конце каждой недели. Курс считается пройденным при успешной сдаче всех тестов.\nКаких-либо специальных знаний в области финансов и фондовых рынков для освоения курса не требуется.", 
    "end_date": null, 
    "title": "Финансовые рынки и институты (Financial Markets and Institutions)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/b0/723cd471c24a1b24b7730007c83b66/Financial-Markets-and-Institutions1.jpg", 
    "course_url": "https://en.coursera.org/learn/finansovye-rynki", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-20T01:54:05Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Зыков Сергей Викторович ", 
    "description": "Предметом курса являются методологии создания корпоративных систем — подходы к организации, планированию и управлению процессами их разработки. В разделе рассматриваются методологические основы «гибкой» разработки программных систем, а также систематизируются практические приемы — «лучшие практики» их применения. Исследуется влияние методологий разработки на характер и масштаб программных систем. Основное внимание при этом уделяется сравнительному анализу наиболее значимых «гибких» методологий разработки программных систем, которые нацелены на максимальную адаптивность к быстро изменяющимся условиям бизнеса. Систематизация «гибких» методологий проводится также и в аспекте их практической пригодности для разработки корпоративных систем.\nБудут рассмотрены следующие основные вопросы: Что такое методология? Чем отличаются строгие методологии от гибких? Почему необходимы методологии? При каких условиях применимы такие методологии? В чем особенности применения гибких методологий разработки к корпоративным приложениям? Какие этапы включает в себя каждая из гибких методологий? Как организуются процессы разработки? В чем особенности команды разработки? Почему важно непрерывное взаимодействие с заказчиком? Какие методологии лучше подходят для различных видов программных продуктов?", 
    "end_date": null, 
    "title": "Разработка корпоративных систем. Часть 3. Гибкие методологии разработки", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d2/48c620a4c711e58ce46d165efb44cd/logo_picture7.jpg", 
    "course_url": "https://en.coursera.org/learn/gibkie-metodologii-razrabotki", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-17T07:06:23Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Нестерова Наталья Георгиевна (Natalya G. Nesterova), Грекова Марина Владимировна (Marina V. Grekova), Фащанова Светлана Владимировна (Svetlana V. Faschanova)", 
    "description": "Курс «Зарисовки о Сибири. Город Томск: курс русского языка для иностранцев» ответит на вопросы, которые часто задают иностранцы о Сибири: Чем она богата? Каковы ее природные и климатические условия? Что за люди здесь живут, чем они занимаются? Как устроен сибирский город, сибирская деревня? Какие народности проживают на территории Томска и Томской области? Как поддерживаются национальные традиции? Как сохраняется деревянная архитектура? Кто из томских студентов принимал участие в Олимпийских играх? \n\nКурс может быть интересен \n- иностранным гражданам, которые хотят совершенствовать русский язык;\n- бывшим россиянам, проживающим сейчас за рубежом и интересующимся тем, как живет Сибирь сегодня; \n- преподавателям русского языка как иностранного; \n- иностранным студентам, выбирающим город, в котором хотели бы обучаться на русском языке;\n- российским школьным учителям и выпускникам российских школ.\n\nВ этом курсе слушатели смогут практиковаться в разных видах речевой деятельности на русском языке (аудирование, чтение, письмо); расширить словарный запас, в том числе за счет лексики, которая, как правило, не встречается в распространенных учебных пособиях по русскому языку как иностранному; улучшить грамматические навыки.\n\nПосле завершения курса слушатели смогут применить свои страноведческие знания о Сибири при изучении истории России, лингвострановедения России, русской культуры. Приобретенные знания и навыки будут полезны иностранным гражданам во время путешествий по России.  \n\nThe course will give answers to the questions about Siberia that are frequently asked by foreigners: What is it rich in? What its nature and climate conditions? What people live here and what do they do? How is a Siberian town or a village organized? What nationalities live on the territory of Tomsk and Tomsk region? How national traditions are maintained? How the wooden architecture is being preserved? What Tomsk students took part at the Olympic games?\nThis course will provide learners with an opportunity to practice different types of speech activity in Russian (listening, reading, and writing); to enrich their vocabulary with lexical units that are not typical in manuals “Russian as a foreign language”; to improve their grammar skills.\nOn completing the course the learners will be able to use their knowledge about Siberia in such subjects as the history of Russia, Russian language and area studies, and Russian culture. These skills and knowledge will be useful for foreign citizens who travel around Russia.", 
    "end_date": null, 
    "title": "Зарисовки о Сибири. Город Томск: курс русского языка для иностранцев", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/b1/834790a87c11e5b9a0cdf6c6c88612/Comp-1_00000.png", 
    "course_url": "https://en.coursera.org/learn/zarisovki-o-sibiri", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-28T12:28:33Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Анна Юшкова", 
    "description": "Несколько десятилетий назад определение нуклеотидной последовательности ДНК организма было почти невыполнимой задачей. Сегодня же секвенирование ДНК стало для специалистов чуть ли не рутинной работой – и тщательное изучение геномов принесло множество сюрпризов. Например, ученые обнаружили в генетическом материале ядерных организмов до 98 % молчащей, не кодирующей белки ДНК. Какие тайны скрываются в этих участках? \nЭтот курс познакомит вас с основными терминами и современными исследованиями в области генетики. От разбора молекулярного носителя наследственности, молекулы ДНК мы  перейдем к подробному изучению ее функциональных единиц – генов. Вы научитесь решать увлекательные генетические задачи и ориентироваться в причинах и последствиях мутаций. Студенты узнают законы классической генетики и столкнутся с тем, что и здесь на каждое правило есть свое исключение.\n\nПочему у голубоглазых родителей не может быть кареглазых детей? \nЧто общего между дальтонизмом у человека и черепаховой окраской у кошек? \nОтчего седеют лошади и не слышит голубоглазый кот? \n\nВместе с учеными-генетиками мы ответим на эти и другие вопросы и увидим, какие серьезные изменения в эволюционной биологии и биомедицине произошли сегодня благодаря появлению современных методов исследования ДНК.\n\nНаш курс состоит из пяти модулей, название и структуру которых вы можете видеть ниже. Общая оценка за курс  складывается как общая сумма баллов, набранных вами за итоговые тесты по модулям и итоговый тест по всему курсу.", 
    "end_date": null, 
    "title": "Генетика (Genetics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Novosibirsk State University "
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/18/d101d057a111e5b7ca3b0a24ec25fc/DNA.png", 
    "course_url": "https://en.coursera.org/learn/nsu-genetics", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-12T00:40:18Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ольчак Андрей Станиславович, Муравьев Сергей Евгеньевич ", 
    "description": "Наш курс — это рассказ о выдающихся изобретениях и открытиях – сифоне, тепловом двигателе, математическом анализе, квантовой механике. Изобретения и открытия эти будут очень разными. Но все их объединяет то, что они оказали огромное влияние на развитие человечества. \nС одной стороны, история человечества — это история войн, революций и переворотов. Но с другой стороны, — это совсем другая история, история развития науки, инженерии и вообще интеллектуальное развитие человечества (которое включает в себя, кстати, и культурное развитие – религия, литература, живопись, музыка, театр). И представляется, что эта — «Вторая история» — оказала и большее, и более позитивное влияние на человечество. Вот этой второй истории человечества и посвящен наш курс.", 
    "end_date": null, 
    "title": "История изобретений и открытий — Вторая история человечества", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/be/a8c9f0a4ca11e58be3bf4fd50e0078/logo_picture8.jpg", 
    "course_url": "https://en.coursera.org/learn/istoriya-izobretenii-i-otkritii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-11T01:37:40Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Зыков Сергей Викторович ", 
    "description": "Предметом курса являются методологии создания корпоративных систем — подходы к организации, планированию и управлению процессами их разработки. В разделе рассматриваются методологические основы разработки корпоративных систем, а также систематизируются практические приемы – «лучшие практики» их применения. Исследуется влияние методологий разработки на характер и масштаб программных систем. Основное внимание при этом уделяется сравнительному анализу наиболее значимых методологий разработки программных систем, которые объединяют практические приемы построения систем в рамках различных моделей жизненного цикла. Систематизация методологий проводится также и в аспекте их практической пригодности для разработки корпоративных систем.\nБудут рассмотрены следующие основные вопросы: Что такое методология? Чем отличаются строгие методологии от гибких? В чем особенности применения методологий разработки к корпоративным приложениям? Какие этапы включает в себя каждая из методологий разработки программных систем? В чем особенности каждого из этих этапов? Почему важно систематически изучать жизненный цикл разработки? Какие методологии лучше подходят для различных видов программных продуктов?", 
    "end_date": null, 
    "title": "Разработка корпоративных систем. Часть 2. Строгие методологии разработки", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/af/a37340a4c711e59e6951efef06fd22/logo_picture6.jpg", 
    "course_url": "https://en.coursera.org/learn/strogie-metodologii-razrabotki", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-18T09:01:20Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ивашковская Ирина Васильевна", 
    "description": "Финальный проект охватывает концепции и инструменты 5 курсов специализации, которые нужны для разработки Вами программы повышения стоимости реальной компании. Это Ваш индивидуальный креативный продукт, основанный на новой модели финансового анализа компании, сфокусированного на оценке изменений в ее стоимости.\n\nПервый и второй курсы обеспечивают навыки оценки стоимости компании для целей управления, требуемой за ее риски доходности капитала и правильного построения политики ее финансирования для увеличения стоимости бизнеса. Третий и четвертый курсы усиливают эти навыки за счет обучения методам обоснования инвестиционных проектов. В третьем курсе Вы получите навыки анализа проектов  внутреннего расширения бизнеса и роста путем покупки других бизнесов. В четвертом курсе Вы освоите методы привлечения венчурного финансирования для необычных, инновационных проектов. Пятый курс подытоживает концепции управления, ориентированные на приращение  стоимости, дополняет их методами оценки текущих результатов деятельности по критерию стоимости бизнеса, мониторинга вклада менеджмента в приращение стоимости.", 
    "end_date": null, 
    "title": "Мастерство создания стоимости компании", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ee/360c60bab311e58fef1bd93fb2110a/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/corporate-value-capstone", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-20T05:49:53Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Панебратцев Юрий Анатольевич, Клячин Николай Альбертович , Калашников Николай Павлович, Гервидс Валериан Иванович", 
    "description": "Наглядно – интересно – просто – понятно!\nДанный курс представляет собой серию физических опытов, наглядно демонстрирующих работу основных законов механики. Демонстрацию физических явлений проводит незаурядный преподаватель, доцент кафедры общей физики НИЯУ «МИФИ» — Валериан Иванович Гервидс, который доступно и наглядно объясняет основные принципы и законы движения материальных тел и их взаимодействие. \n\nЗачем учить этот курс?\n• Физика – наука экспериментальная. Лучше один раз увидеть, чем сто раз услышать или прочитать! \n• Именно эксперименты позволяют продемонстрировать и легко понять и простые, и сложные аспекты, которые традиционно преподаются в виде теоретического материала и математических моделей\n• Курс поможет Вам научиться использовать: \n   o эксперимент как способ постановки вопроса, \n   o эксперимент как инструмент изучения физического явления\n   o эксперимент как  форму ответа на вопрос\n• Очень часто достаточно «простые» физические вопросы имеют неожиданные ответы, которые зависят от конкретных условий проведения эксперимента. Демонстрация таких опытов и объяснение полученных в них результатов могут оказаться чрезвычайно интересными\n• Вы сможете увидеть применение изучаемых физических явлений в жизни, в технике и в быту\n• Изучая этот курс, вы восполните нехватку времени на экспериментальную, «живую» физику, которая ощущается в обычном учебном процесс\n\nЧему учит этот курс?\n• Пониманию широкого круга как простых, так и сложных физических явлений и процессов по тематике соответствующих разделов\n• Применению физических закономерностей для анализа различных физических явлений и процессов \n• Навыкам  использования эксперимента\n• Базовым знаниям по физике будущих инженеров и специалистов в различных областях деятельности.\n\nДля кого этот курс?\n• Для тех, кто изучает физику, и хочет прояснить для себя различные вопросы (в школе, в вузе)\n• Для тех, кто преподает физику (в школе, в вузе)\n• Для тех, кто использует физику в своем рабочем процессе (инженеры, программисты и т.д.)\n• Для тех, кому это просто интересно", 
    "end_date": null, 
    "title": "Физика в опытах. Часть 1. Механика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/68/44ed40a3f911e59e6951efef06fd22/logo_picture_mehanika.jpg", 
    "course_url": "https://en.coursera.org/learn/fizika-v-opitah-mehanika", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-19T08:36:30Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Стручалин Павел Геннадьевич, Делов Максим Игоревич, Пряхин Андрей Сергеевич, Кондаков Владимир Вениаминович, Федосеев Вячеслав Николаевич, Тихомиров Георгий Валентинович", 
    "description": "Сегодня в эпоху высоких технологий знание основ атомной и ядерной физики необходимо любому человеку, считающему себя образованным. Эти знания помогут в успешном обучении в любом техническом вузе, при выстраивании карьеры в области не только физики, но и в сфере информационных технологий, в области химии, экологии, биологии, медицины и т.д. Изучение этих разделов физики поможет лучше понять проблематику современной атомной энергетики, проблемы, связанные с влиянием атомной энергетики на окружающую среду и здоровье человека.\n\nКурс от лучших преподавателей НИЯУ МИФИ расскажет об основных понятиях ядерной физики, о ядерных реакциях, происходящих на Земле и в космосе, о практическом применении достижений в области ядерной физики. Вы узнаете, что радиация может приносить пользу, а профессиональная деятельность в сфере атомной энергетики очень перспективна.\n\nВ результате успешного прохождения курса вы получите сертификат, который может быть полезен при выборе дальнейшего направления вашего обучения.", 
    "end_date": null, 
    "title": "Элементы атомной и ядерной физики", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/33/9dcf20562f11e584d2f53f071a9306/logo_picture_atom.png", 
    "course_url": "https://en.coursera.org/learn/elementy-atomnoj-i-yadernoj-fiziki", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-01T01:18:43Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Вадим Стрижов, Виктор Кантор, Эмели Драль", 
    "description": "Финальный проект даст вам возможность применить полученные в рамках специализации знания к задаче из реального мира. Под руководством успешных специалистов в науке о данных вы сможете поработать над актуальным проектом в одной из областей: электронная коммерция, социальные медиа, информационный поиск, бизнес-аналитика и др.\n\nВ отличие от задач, основанных на модельных данных, работа над проектом из реальной жизни даст вам возможность самостоятельно пройти все этапы анализа данных — от подготовки данных до построения финальной модели и оценки её качества. В результате в вашем арсенале появится проект, который вы сможете использовать на практике и самостоятельно развивать в дальнейшем.\n\nНаличие такого проекта станет вашим конкурентным преимуществом, ведь вы всегда сможете продемонстрировать успешный проект потенциальному работодателю.", 
    "end_date": null, 
    "title": "Анализ данных: финальный проект", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/22/3539d0b0de11e5965623dd71776f15/800x800-06.jpg", 
    "course_url": "https://en.coursera.org/learn/data-analysis-project", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-20T07:03:11Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Селивановский Антон Сергеевич", 
    "description": "Основное внимание в процессе освоения курса направлено на формирование важнейшего практического навыка – выявление рисков рассматриваемой проблемы в комплексе и во взаимосвязи различных ее аспектов. Например, при изучении облигаций рассматриваются многие вопросы, касающиеся не только вопроса выпуска этих ценных бумаг, но и последствия неисполнения эмитентом облигаций обязанностей по выплате процентов и погашению номинальной стоимости облигаций.\n\nЦЕЛЬ КУРСА: сформировать целостную картину регулирования рынка ценных бумаг. Слушатели последовательно познакомятся с\n·        различными видами ценных бумаг, их особенностями\n·        порядком выпуска ценных бумаг, включая эмиссию\n·        правилами учета бездокументарных ценных бумаг, а также порядком перехода прав на бумаги между участниками оборота\n·        системой защиты прав на ценные бумаги\n·        всеми профессиональными участниками рынка ценных бумаг, общей характеристикой их деятельности, наиболее сущностными моментами договоров, которые заключаются между профучастниками и их клиентами\n·        основами биржевой торговли и договоров, которые заключаются на биржевых торгах.  \n\nКурс насыщен примерами из практики, материал сопровождается демонстрацией различных схем.\n\nНЕОБХОДИМЫЕ ЗНАНИЯ И НАВЫКИ\nДля освоения курса желательно обладать базовыми знаниями в области корпоративного и договорного права.\n\nОБЪЕМ КУРСА\n10 тем, 10 тестов, 7 заданий на взаимное оценивание.\n\nФОРМАТ КУРСА \n- основной материал представлен видеолекциями, каждая тема состоит из фрагментов по 5-15 мин., в общей сложности по 60-90 мин.;  \n- в конце каждой темы необходимо пройти контрольный тест, состоящий из 20 вопросов; в некоторых темах контрольный тест содержит 9-15 вопросов - в этом случае контроль по теме включает в себя также одно или два задания на взаимное оценивание (сравнение сходных финансовых инструментов);\n- к каждой теме прилагается перечень литературы и нормативных актов.\n\nНЕОБХОДИМОЕ ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ\nДополнительного программного обеспечения не требуется.\nСлушателям рекомендуется использовать справочно-информационные системы, например, КонсультантПлюс.\n\nАВТОР КУРСА\nСеливановский Антон Сергеевич\nДоцент кафедры гражданского и предпринимательского права Национального Исследовательского Университета «Высшая школа экономики»\n\nРаботает в области юриспруденции с 1988 года, в том числе более 15 лет в таких крупных международных компаниях, как PwC (ранее Price Waterhouse, PricewaterhouseCoopers) и Baker & McKenzie. Консультировал крупные российские и иностранные банки и компании по вопросам банковского и валютного законодательства, выпуску акций и облигаций, сделкам с ценными бумагами, руководил проектами по сопровождению открытия дочерних иностранных банков в России, по секьюритизации факторинговых и лизинговых платежей, проверке банков с целью их приобретения, по реструктуризации обязательств, взысканию кредитов и инвестиций в облигации. Активно взаимодействовал с Банком России, министерствами и Государственной думой как при реализации проектов для клиентов, так и при разработке нового законодательства.   \n\nКандидат юридических наук.\n\nС 2005 года активно занимается преподавательской деятельностью: проводит занятия как со студентами в рамках бакалавриата и магистратуры (программа «Корпоративный юрист»), так и с опытными специалистами на программах профессиональной переподготовки и повышения квалификации Высшей школы юриспруденции. А.С. Селивановский активно работает по программам, по которым обучаются не-юристы (руководит майнором «Правовая среда бизнеса» https://electives.hse.ru/minor_law/, проводит занятия на программах «второго высшего образования», программах МВА). \n\nВ течение ряда лет признается Лучшим преподавателем как студентами (2012, 2013, 2014, 2015), так и слушателями Высшей школы юриспруденции (2014, 2015).\n\nАвтор монографий и более 80 статей, посвященных правовому регулированию операций на рынке ценных бумаг, деривативам, корпоративному управлению, деятельности рейтинговых агентств, внешнеэкономической деятельности и пр.\n\nЯвляется судьей Третейского суда НАУФОР.", 
    "end_date": null, 
    "title": "Ценные бумаги: правовое регулирование", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/34/b97ae0a4a811e5a608e9815d73090e/______________-________2.png", 
    "course_url": "https://en.coursera.org/learn/cennye-bumagi-pravovoe-regulirovanie", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-26T08:13:41Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "5098188", 
    "description": "הקורס מציע מיפוי של השירה העברית החדשה למן תנועת ההשכלה דרך תקופת \"התחייה\" והמודרניזם שבא בעקבותיה, ועד לימינו. הקורס מציג באופן חי ונושם את המפנים הפואטיים ואת ההתפתחויות הסגנוניות והתמטיות בתחום השירה העברית, מראשיתה, באמצעות קריאות קרובות של טקסטים מן התקופות השונות, ומעמיד מאגר גדול ושופע של ידע תיאורטי, ספרותי  והיסטורי, לצד פרשנויות עמוקות, מאתגרות ומפתיעות.", 
    "end_date": null, 
    "title": "Modern Hebrew Poetry   שירה עברית מודרנית  ", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Hebrew University of Jerusalem"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/bc/bcc090a18011e49f6557d517468030/bibliotheque.png", 
    "course_url": "https://en.coursera.org/learn/hebrew-poetry", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-08T01:59:45Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Валерия Николаевна Петрова", 
    "description": "Курс направлен на:\n• понимание междисциплинарности и гуманитарности проблемы изучения особенностей трудовой деятельности;\n• глубокое изучение наиболее важных законов в различных отраслях научного знания о труде;\n• освоение технологий эффективной организации деятельности и регулирования работоспособности и утомления;\n• изучение методов диагностики профессиональной направленности человека;\n• изучение основных теоретических подходов к пониманию мотивации трудовой деятельности;\n• изучение концепций профессионализма и профессиональных кризисов;\n• освоение технологий эффективного построения карьеры.\n\nПрограмма данного курса предполагает активный анализ собственного профессионального опыта, а также сопоставление результатов собственного систематического наблюдения за базовыми элементами трудовой деятельности и данных литературных источников.\n\nРезультаты обучения:\n1.Формирование навыка распознавания различных функциональных состояний работника в процессе трудовой деятельности.\n2. Освоение технологии определения типа профессиональной направленности человека.\n3. Освоение технологии выявления базовых мотиваторов трудовой деятельности.\n4. Формирование навыка определения уровня профессионализма и индикаторов наличия профессиональных деструкций у работника.\n5. Формирование навыка применения базовых процедур сопровождения и поддержки процесса профессионализации работника.\n\nНеобходимые уровень подготовки – базовые общекультурные компетенции, сформированные на младших курсах бакалавриата.", 
    "end_date": null, 
    "title": "Психология труда, инженерная психология и эргономика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/35/7a4950fa5c11e5a75877ec0a8fc2eb/________.png", 
    "course_url": "https://en.coursera.org/learn/psykhologiya-truda", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-11T23:27:59Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Кокорева Мария Сергеевна", 
    "description": "В этом курсе вы получите комплексное современное представление о политике финансирования компании. Решения о привлечении капитала и выборе соотношения собственного и заемного капиталов мы рассмотрим как инструмент максимизации стоимости компании.  Курс входит в специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов, и необходим для выполнения заключительного прикладного проекта по специализации “Мастерство создания стоимости компании”.\n\nКурс будет полезен всем, кто по роду своей деятельности  должен решать вопросы организации финансирования бизнеса, оценки его потенциального эффекта и допустимого уровня долговой нагрузки компании, структурирования  источников финансирования или занимается оценкой его стоимости. \n\nПосле успешного завершения курса вы будете знать, какие виды финансирования доступны компании, их преимущества, недостатки и способы получения; каковы современные тренды выбора уровня долговой нагрузки; как определяются цены на разнообразные финансовые ресурсы.  Вы сможете рассчитать затраты на собственный и заемный капитал, определить оптимальное соотношение заемного и собственного финансирования для конкретной компании на основе финансовой информации и использовать информацию с рынка капитала и о конкурентах для принятия решений об изменении уровня долговой нагрузки. \n\nДля эффективного освоения курса вам понадобятся знания о финансовой отчетности компании и построении денежных потоков, драйверах стоимости компании, приобретенные в работе над курсом  “Оценка стоимости компании”, открывающем  специализацию “Корпоративные финансы и стоимость компании”. \n\nВ ходе курса вас ждут лекции, а также интервью с представителями компаний Sberbank CIB и UBS в России.  По итогам каждой недели вам необходимо будет решить тест, по итогам третьей недели вам также предстоит выполнить задание со взаимным оцениванием, а по окончании курса - итоговый экзамен.  Для окончания курса вам понадобится набрать проходной балл по всем оцениваемым заданиям.", 
    "end_date": null, 
    "title": "Структура капитала компании", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/18/c99da0adaa11e5a66fc325ecd229ce/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/struktura-kapitala-kompanii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-28T05:47:37Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "4973869, 6081, 1240234, 1702251, 1239903", 
    "description": "Курс «Введение в биоинформатику» адресован тем, кто хочет получить расширенное представление о том, что такое биоинформатика и как она помогает биологам и медикам в их работе.\n\n\nThe course is aimed at those who would like to have a better idea of what bioinformatics is and how it helps biologists and medical scientists in research and clinical work. ", 
    "end_date": null, 
    "title": "Введение в биоинформатику (Introduction to Bioinformatics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Saint Petersburg State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/22/2902c0501011e5979e3d1cbc3cabef/______________.png", 
    "course_url": "https://en.coursera.org/course/bioinfo", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": null
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Райгородский, Дмитрий Ильинский", 
    "description": "Комбинаторика - это наука, которая, с одной стороны, богата исключительно красивыми постановками задач, зачастую доступными школьнику, а с другой стороны, это очень глубокая современная область знаний, без овладения инструментами которой невозможно серьезное понимание как большинства других фундаментальных дисциплин - анализа, алгебры, теории графов, теории вероятностей и др., - так и многих прикладных проблем.\n\nСовременная комбинаторика, таким образом, это своего рода основа основ: это и красивейшая теория с массой нетривиальных задач и методов, но это и прекрасная база для приложений в computer science, в анализе сложных сетей, в теории кодирования и криптографии, в биоинформатике и др. В курсе мы познакомим слушателей с наиболее важными областями и инструментами современной комбинаторики, причем многие темы курса по сути уникальны: здесь не только классические комбинаторные величины и тождества, но также и общая теория обращения Мебиуса, и диаграммы Юнга, и рекурсия, и производящие функции. Это позволит нам в дальнейших курсах выйти на реальные приложения в анализе таких сложных сетей, как Интернет, социальные, биологические сети, сети межбанковских взаимодействий и др.\n\nДля участия в курсе слушателю необходимо иметь базовые представления о теории множеств и началах анализа. Все остальные понятия будут введены в ходе курса.\n\nКурс состоит из 7 недель лекций и 1 недели экзамена. Каждую неделю слушатель выполняет задания, составляющие 10% от всего курса (5% тест и 5% задачи с ответом). Экзамен также состоит из теста и задач с ответом, каждая часть оценивается в 15% от общей суммы. Для успешного прохождения курса необходимо в каждом задании набрать не менее 50% от общего числа баллов.\n\nДанный курс рекомендуется к прохождению перед курсом Теория вероятностей.", 
    "end_date": null, 
    "title": "Современная комбинаторика (Modern combinatorics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/4a/c81b70c63611e5b4870ff3a2e6d292/domino-Depositphotos_23344972_s-1.jpg", 
    "course_url": "https://en.coursera.org/learn/modern-combinatorics", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-14T04:05:48Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Партин Илья Маркович, Григорьева Светлана Александровна, Бончев Иван Радилов, Пирогов Никита Константинович", 
    "description": "В этом курсе вы сможете получить знания и навыки инвестиционного анализа в компании и выбора проектов, способных увеличить стоимость бизнеса. Мы рассмотрим оценку проектов, нацеленных на органический рост компании изнутри, и проектов ее роста через стратегические приобретения бизнесов (сделки M&A). Курс входит в специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и заключительный прикладной проект “Мастерство создания стоимости компании”.\n\nКоманда преподавателей курса, включающая представителей академической среды и бизнеса, поможет вам разобраться со сложностями оценки эффективности инвестиционных проектов, которая необходима для принятия решения о стратегии дальнейшего развития бизнеса – идти ли компании по пути расширения текущих производственных мощностей или принять активное участие в консолидации отрасли через приобретения или слияния с конкурентами.\n\nРазделы первой части данного курса посвящены анализу проектов, направленных на органический рост, и помогут вам лучше понять критерии распределения инвестиционного бюджета между несколькими вариантами расширения производства. В разделах второй части курса вы сможете узнать об эффективности сделок слияний и приобретений (M&A), принципах расчета синергетического эффекта от приобретения компании, а также последовательно пройти через все этапы сделки M&A.\n\nПосле успешного завершения курса вы сможете рассчитать экономическую эффективность инвестиционного проекта, учесть в финансовой модели возможности синергии от сделки M&A, сравнить альтернативные инвестиционные проекты и выбрать наиболее оптимальный с точки зрения различных инвестиционных критериев.\n\nПредставленный в курсе набор практических знаний эквивалентен нескольким годам работы в данной отрасли и позволит вам существенно нарастить багаж знаний, необходимых при трудоустройстве на работу, связанную с анализом инвестиционных проектов, включая сопровождение сделок M&A.\n\nДля прохождения курса вам понадобятся базовые знания в области корпоративных финансов, которые можно получить в 1 и 2 курсе специализации.", 
    "end_date": null, 
    "title": "Инвестиционные проекты, слияния и поглощения", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/6f/b88f40adaa11e584915d6f2c50249f/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/sliyaniye-pogloshcheniye", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-02T23:09:43Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Панебратцев Юрий Анатольевич, Калашников Николай Павлович, Клячин Николай Альбертович , Гервидс Валериан Иванович", 
    "description": "Наглядно – интересно – просто – понятно!\nДанный курс представляет собой серию физических опытов, наглядно демонстрирующих работу основных законов механики. Демонстрацию физических явлений проводит незаурядный преподаватель, доцент кафедры общей физики НИЯУ «МИФИ» — Валериан Иванович Гервидс, глубокие знания и огромный преподавательский опыт которого делает курс «Физика в опытах. Электричество и магнетизм» уникальным.\nКурс состоит из девяти модулей по основным разделам: Электрическое поле, Проводники в электрическом поле, Энергия электрического поля, Постоянный электрический ток, Магнитное поле, Магнитное поле в веществе, Электромагнитная индукция, Квазистационарные токи, Электрический ток в газах. В его основе этого курса лежат 64 опыта, в которых объясняются различные физические явления.\n\nЗачем изучать этот курс?\n• Физика – наука экспериментальная. Лучше один раз увидеть, чем сто раз услышать или прочитать! \n• Именно эксперименты позволяют продемонстрировать и легко понять и простые, и сложные аспекты, которые традиционно преподаются в виде теоретического материала и математических моделей\n• Курс поможет Вам научиться использовать: \n   o эксперимент как способ постановки вопроса, \n   o эксперимент как инструмент изучения физического явления\n   o эксперимент как  форму ответа на вопрос\n• Очень часто достаточно «простые» физические вопросы имеют неожиданные ответы, которые зависят от конкретных условий проведения эксперимента. Демонстрация таких опытов и объяснение полученных в них результатов могут оказаться чрезвычайно интересными\n• Вы сможете увидеть применение изучаемых физических явлений в жизни, в технике и в быту\n• Изучая этот курс, вы восполните нехватку времени на экспериментальную, «живую» физику, которая ощущается в обычном учебном процесс\n\nЧему учит этот курс?\n• Пониманию широкого круга как простых, так и сложных физических явлений и процессов по тематике соответствующих разделов\n• Применению физических закономерностей для анализа различных физических явлений и процессов \n• Навыкам  использования эксперимента\n• Базовым знаниям по физике будущих инженеров и специалистов в различных областях деятельности.\n\nДля кого этот курс?\n• Для тех, кто изучает физику, и хочет прояснить для себя различные вопросы (в школе, в вузе)\n• Для тех, кто преподает физику (в школе, в вузе)\n• Для тех, кто использует физику в своем рабочем процессе (инженеры, программисты и т.д.)\n• Для тех, кому это просто интересно", 
    "end_date": null, 
    "title": "Физика в опытах. Часть 2. Электричество и магнетизм", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/a6/8a3dd0a3f911e58b7829d2abc9fe56/logo_picture_elektrichestvo.jpg", 
    "course_url": "https://en.coursera.org/learn/fizika-v-opitah-elektrichestvo-i-magnetizm", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-19T03:03:03Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Зыков Сергей Викторович ", 
    "description": "Предметом курса являются модели создания корпоративных систем, подходы к организации, планированию и управлению всем их жизненным циклом — от концепции до вывода из эксплуатации. Исследуется влияние последовательности организации жизненного цикла на характер и масштаб программной системы, качество реализации и экономику разработки программного продукта. В курсе рассматриваются методологические основы разработки корпоративных систем, а также систематизируются практические приемы — «лучшие практики» их применения. Основное внимание при этом уделяется исследованию особенностей жизненного цикла при использовании наиболее распространенных моделей его организации. Систематизация моделей проводится также и в аспекте их практической пригодности для разработки корпоративных систем.\n\nБудут рассмотрены следующие основные вопросы: \n– Что такое корпорация? \n– Зачем необходим особый класс программных систем – корпоративные приложения, какие задачи они решают? \n– Из каких этапов состоит жизненный цикл программных систем? \n– В чем особенности каждого из этих этапов? \n– Почему важно систематически изучать жизненный цикл? \n– Что такое модель жизненного цикла? \n– Какие модели лучше подходят для различных видов программных продуктов?", 
    "end_date": null, 
    "title": "Разработка корпоративных систем. Часть 1. Модели жизненного цикла", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/88/39e190a4c711e58be3bf4fd50e0078/logo_picture5.jpg", 
    "course_url": "https://en.coursera.org/learn/razrabotka-korporativnih-sistem-modeli-jiznennogo-cikla", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-17T09:22:16Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "2641486, 1761365, 2643198", 
    "description": "קורס זה עוסק במתמטיקה של בית ספר תיכון מנקודת מבט מתקדמת. מטרתו העיקרית היא לחשוף סטודנטים לעתיד לאופן שבו מתמטיקאים רואים מקצוע זה, ובכך להכין אותם ללימודי מתמטיקה ברמת אוניברסיטה.", 
    "end_date": null, 
    "title": " Invitation to Mathematics     הזמנה למתמטיקה", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Hebrew University of Jerusalem"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/dd/cb1a00b45211e38efc2b29f6ab5ae7/einstein.jpg", 
    "course_url": "https://en.coursera.org/learn/introduction-to-math", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-06-03T02:13:03Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Берзон Николай Иосифович", 
    "description": "Основной целью данного курса является формирование у слушателей понимания того, что в современном мире крайне необходимо грамотное управление личными финансами, и это обязательно поможет человеку стать финансово состоятельным и независимым. Изучение курса позволит лучше ориентироваться в текущих финансовых вопросах, практически ежедневно возникающих у людей, и находить оптимальные для каждого человека способы управления личным капиталом.\nВ ходе прохождения курса слушатель, прежде всего, научится распределять свой капитал по трем элементам: текущий, страховой и инвестиционный капитал. Далее будут рассмотрены возможности осуществления инвестиционных операций на финансовом рынке и оценка их эффективности. Для объективной оценки совершаемых операций в представленном курсе даются основы финансовых вычислений (простой и сложный процент, номинальная и эффективная процентная ставка, номинальная и реальная доходность, текущая и будущая стоимость денег). Понимание рисков является особо важным в финансовом мире, и этому также будет посвящена отдельная часть курса, в ходе освоения которой слушатель научится оценивать эффективность принимаемых инвестиционных решений по критерию «риск-доходность». А в заключительной части будут рассмотрены вопросы, касающиеся формирования инвестиционного портфеля и управления им. \nКак результат – у слушателя сформируется комплексное представление об управлении личными финансами, что сделает этот процесс для каждого более успешным и интересным!\n\nПЛАН КУРСА\nНЕДЕЛЯ 1: Финансы в жизни человека\nНЕДЕЛЯ 2: Риск и доходность личных финансовых инвестиций\nНЕДЕЛЯ 3: Технология принятия решений частным инвестором\nНЕДЕЛЯ 4: Инвестиционные стратегии частного инвестора\n\nНЕОБХОДИМЫЕ ЗНАНИЯ И НАВЫКИ\nПредварительных требований к слушателям курса не предъявляется\n\nОЦЕНИВАНИЕ\nПо результатам каждого из 4-х модулей предусмотрен контрольный тест, который будет состоять из классических тестов (вопрос и даны варианты ответов), из задач, предполагающих проведение расчетов в рамках прослушанного материала. Итоговая оценка по курсу формируется нарастающим итогом по результатам тестов по каждому модулю.\n\nНЕОБХОДИМОЕ МАТЕРИАЛЬНОЕ И ПРОГРАММНОЕ ОБЕСПЕЧЕНИЕ\nСпециального материального и программного обеспечения для освоения курса не требуется.\n\nДОПОЛНИТЕЛЬНАЯ ИНФОРМАЦИЯ\nВ курсе будут делаться ссылки на наиболее интересные и актуальные статьи и сайты по вопросам личных финансов.", 
    "end_date": null, 
    "title": "Управление личными финансами", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/c3/881d20b89a11e596ddffa17da4aea1/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/upravlenie-lichnymi-finansami", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-09T06:04:01Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Konstantin Sonin", 
    "description": "В базовом курсе микроэкономики рассказывается об основных инструментах экономического анализа, которые позволяют изучать наиболее важные закономерности в поведении людей и фирм. У людей есть предпочтения относительно товаров и бюджетные ограничения, у фирм – производственные возможности и спрос на их продукцию со стороны людей. В результате взаимодействия людей и фирм складываются рынки, на которых определяется цена – важнейший канал передачи информации.\n\nЧтобы информации было больше, существуют рынки, на которых продаются и покупаются товары и услуги. Потребитель никогда не купит нужный ему товар, если не узнает, где и как его можно купить. Производитель не станет его изготавливать, если не будет уверен, что найдется покупатель, который его приобретет. Каждый человек и каждая фирма обладает какими-то сведениями – прежде всего о себе самом, о своих вкусах, интересах, потребностях и возможностях. Однако информации у всех становится во много раз больше, когда субъекты начинают взаимодействовать – производят и потребляют, продают, покупают и меняются. Поведение людей и фирм на рынках – основной предмет изучения в курсе микроэкономики.\n\nThe introductory course in Microeconomics describes the basic instruments of economic analysis, which allow us to study the most important patterns in the behavior of people and firms. As a result of their interactions markets occur and prices are determined. Microeconomics studies the behavior of people and firms in the markets.", 
    "end_date": null, 
    "title": "Основы микроэкономики (Microeconomics Principles)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/84/96a4bb6789f3fcceb8217ccca28ba2/microeconom.jpg", 
    "course_url": "https://en.coursera.org/learn/mikroekonomika", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-29T01:44:28Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Анисимов Евгений Викторович, Трабская Юлия Георгиевна", 
    "description": "Данный учебный курс посвящен истории Санкт-Петербурга с момента его основания в 1703 году до отъезда большевистского правительства в Москву в 1918 году. В задачи курса входит освещение политической, культурной, экономической жизни города в контексте развития Российской империи в течение двух столетий. Пройдя курс, слушатель узнает об истории создания Петербурга, его застройке, расцвете и трудностях, а также познакомится с основными событиями российской истории. В курсе показаны сложные процессы и трансформации внутренней политики российских императоров и то, как это отражалось на жизни имперской столицы и ее жителей. Особое внимание в лекциях уделено тому, как на протяжении веков менялся внешний облик города, рассказывается об архитекторах и скульпторах, создавших образы Петербурга. Кроме того, отдельные сюжеты курса посвящены развитию культуры и искусства и повседневной жизни петербуржцев. Город предстает перед слушателями как живой организм, сыгравший ключевую роль в истории России и Европы. Курс насыщен историческими образами, видами Петербурга и дает представление о мнении современников и исследователей о важнейших событиях в истории столицы Российской империи.", 
    "end_date": null, 
    "title": "Санкт-Петербург – столица Петра I и его империи", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ac/3de090298e11e6a32ab1c260b7afc1/SPB_Logo.jpg", 
    "course_url": "https://en.coursera.org/learn/sankt-peterburg-petr", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-25T01:29:13Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Alexander Dobrokhotov", 
    "description": "Основной вопрос курса «Философия культуры» – как возможно теоретическое знание о культуре? \nТеоретическое понимание предмета философии культуры и овладение её базовым концептуальным аппаратом невозможно без знакомства с историей философских учений о культуре.  Содержание лекций выстраивается вокруг сюжетов о морфологии различных типов культур от античности до современности. Особое внимание уделяется западноевропейской культуре Нового времени.\n\n Задачи курса:  \n–раскрыть специфику философии культуры как объяснительной модели,\n–рассмотреть развитие рефлексии о культуре в диахроническом аспекте.\n\nВ результате освоения материалов курса «Философия культуры» студент будет знать:\n –основные исторические типы философских теорий культуры, их своеобразие, логику их построения,\n –основные проблемы и парадоксы, связанные с опытом построения теорий культуры\nи уметь:\n–выявлять в разнородном эмпирическом материале культур закономерности их развития, \n–видеть связи ряда тенденций современной культуры с исторической традицией.\n\n\nThe underlying theme of the course is: How is theoretical knowledge of culture possible?\nTheoretical comprehension of the philosophy of culture as a subject area and its conceptual framework is impossible without the general understanding of the historical development of the theory of culture. The lectures focus on the morphology of various types of cultures from antiquity to the present days. Particular emphasis is made on the Western European culture of the Modern Times.\n\n  The course objectives are: \n –to reveal the distinguishing features of the philosophy of culture as an explanatory model,\n –to consider the formation of philosophic discourse in culture over the period of time.\n\nAs a result, students will become acquainted with: \n –the core patterns in history of the philosophy of culture, their features, and the logic of their construction,  \n–the basic problems and paradoxes associated with the experience of constructing a theory of culture\n and will be able to discern: \n–consistent patterns of development in diverse empirical material  of cultures, \n–the links between a number of contemporary cultural trends and historical tradition.", 
    "end_date": null, 
    "title": "Философия культуры (Philosophy of Culture)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/55/dddac05e8d11e487da13d17b09f3e9/philculture1.png", 
    "course_url": "https://en.coursera.org/learn/phil-culture", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-29T02:16:24Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Дмитрий Ильинский, Андрей Райгородский", 
    "description": "Комбинаторика для начинающих - это базовый курс, закладывающий самые основы комбинаторного знания.\n\nНа этом курсе слушатели, которые почти не знают комбинаторику или прочно ее забыли, откроют ее для себя впервые или заново. Курс очень полезен всем, кому трудно с ходу включиться в продвинутый курс современной комбинаторики. Однако фактические бонусы те же: в итоге человек, прослушавший курс, получит путевку в увлекательный мир комбинаторных задач и их далеко идущих приложений. Более того, даже в нем самом мы уже расскажем об инструментах, позволяющих решать некоторые задачи такой важной прикладной области знаний, как биоинформатика.\n\nКурс состоит из 7 учебных недель и экзамена. Каждую неделю слушателю предлагается выполнить тест, составляющий 10% от общей оценки. Экзамен состоит из задач по всему курсу и составляет 30% от общей оценки. Для получения сертификата необходимо набрать не менее 50% от общей суммы баллов.\n\nДанный курс является упрощённой версией курса \"Современная комбинаторика\" и рекомендуется к прохождению перед курсом \"Теория вероятностей для начинающих\".", 
    "end_date": null, 
    "title": "Комбинаторика для начинающих", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/be/b044303bf411e594f751ad8bd1faf3/Rubik_s_Cube.png", 
    "course_url": "https://en.coursera.org/learn/kombinatorika-dlya-nachinayushchikh", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-22T03:57:22Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Тамара Викторовна Теплова", 
    "description": "Курс раскрывает секреты инвестирования на рынке акций с позиции частного (миноритарного) инвестора. Слушатель курса погружается в сопоставление акций по инвестиционной привлекательности, в особенности работы финансовых аналитиков (брокерских и инвестиционных компаний), в интересный мир построения инвестиционных стратегий на базе фундаментального анализа.\n\nВы освоите профессиональную терминологию финансовых аналитиков и консультантов, поймете, как выставляются рекомендации «купить», «продать», «держать», почему отчеты аналитиков могут вводить в заблуждение.\n\nВ результате прохождения курса вы \n- получите навыки самостоятельного принятия  среднесрочных инвестиционных  решений на базе общедоступной информации на рынке;\n- научитесь ранжировать акции по инвестиционной привлекательности и выбирать для себя адекватную инвестиционную стратегию (на базе расчета дивидендной и общей доходности (TSR) инвестирования в акции, общего риска, как стандартного отклонения доходности по акции и  изучения финансовой и нефинансовой информации по компании, ликвидности ее акций;\n- поймете значимость учета  качества корпоративного управления и странового риска;\n- сумеете правильно воспользоваться фундаментальным анализом с учетом специфики функционирования российского фондового рынка, налоговой нагрузки на инвестора, биржевых (транзакционных) издержек.", 
    "end_date": null, 
    "title": "Инвестиции в акции", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/32/674ae0b89b11e5af288df91c83e825/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/investicii-akcii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-11T23:41:41Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "9616381", 
    "description": "Изучение российского налогового права позволит слушателям впоследствии самостоятельно работать с Налоговым кодексом РФ и др. источниками налогового права, правоприменительными актами судов и налоговых органов, применять полученные знания в практике налогообложения и налогового планирования, а также для защиты налогоплательщика от неправомерных действий налоговых органов.\n", 
    "end_date": null, 
    "title": "Введение в российское налоговое право (Introduction to the Russian Tax Law)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://d15cw65ipctsrr.cloudfront.net/9d/655cc05dbf11e49bf4419de815f559/RTL.png", 
    "course_url": "https://en.coursera.org/course/taxlaw", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": null
  }, 
  {
    "selfpaced": false, 
    "instructors": "Mikhail Ilyin, Mikhail Mironyuk", 
    "description": "Как войны изменяли политические организации, ставшие в итоге «привычными» нам государствами? Почему и когда возникают гражданские войны и революции? Почему и как нужно разделять власть? Что такое современная демократия? Почему в современных демократиях политическое представительство реализуется через политические партии? Почему выборы – важнейший институт демократии? Какие политические режимы более устойчивы к внешним изменениям? Как главе государства стоит поступить в случае неизбежного демократического транзита? Таковы одни из ключевых вопросов, которыми задаются исследователи сравнительной политики, а ответы могут быть найдены в рамках данного курса.\n\nКурс дает Вам двойную выгоду. Вы научитесь ЧТО и КАК сравнивать. Вы сможете познакомиться с важнейшими институтами, режимами и практиками. Вы осваиваете целый ряд способов анализа от всеохватных до казусно-ориентированных сравнений. \n\nВы научитесь использовать надежные методы и достоверные научные технологии сравнения на основе тренировочных сравнений разнообразных государств и демократий мира. Вы сможете сравнивать различные виды власти и способы ее распределения в современных политиях или фактическое разделение властей.\n\nВы познакомитесь с различными способами представительства людей или корпуса граждан – осуществляется ли оно главами государств или законодателями; изучите, как выборы и партии могут помочь или помешать демократическому представительству в различных случаях. Наконец Вы научитесь сравнивать «ускользающие» предметы изучения, например, преобразования, кризисы и конфликты различных видов.\n\nСИСТЕМА ОЦЕНИВАНИЯ\nФинальная оценка за курс основана на 10 тестах, выполняемых в конце каждой недели, Экзамена, который выполняется в качестве тестового задания и 1 взаимно-оцениваемого задания. Подтверждение о выполнении курса доступно в двух формах:  с отличием – балл по курсу должен составлять 80% или более; курс пройден – балл по курсу должен составлять от 65% до 80%.\n\nПРЕДВАРИТЕЛЬНЫЕ ТРЕБОВАНИЯ\nКурс рассчитан на слушателей, имеющих базовые представления о сфере политики и знакомых с набором основных понятий и концепций политической науки («власть», «государство» и его функции, «выборы», «политические партии»).", 
    "end_date": null, 
    "title": "Сравнительная политика (Comparative Politics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/8a/2747e05e8c11e4aef97dc156b8296c/Compol.png", 
    "course_url": "https://en.coursera.org/learn/politika-sravnitelnaja", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-16T07:29:42Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Меньшиков Сергей Михайлович", 
    "description": "Курс состоит из двух самостоятельных тем.  \n\nВ теме «Инфраструктура рынка» вы получите представление о деятельности профессиональных участников рынка ценных бумаг, единственной задачей которых является создание благоприятных условий для покупки или продажи акций различными типами инвесторов. По результатам изучения этой темы вы сможете: \n- описать деятельность фондовой биржи, на которой совершаются сделки с ценными бумагами; \n- отличать функции брокера, дилера, депозитария, расчётной (клиринговой) палаты и пользоваться ими при открытии и ведении брокерского счета; \n- понимать особенности, правила и риски и Интернет-торговли;  \n- знать правила и возможности использования индивидуальных инвестиционных счетов;\n- понимать назначение и виды приказов на покупку или продажу ценных бумаг, условия совершения различных сделок с акциями – маржинальных, сделок РЕПО и других.\n\nТема «Методы и технологии инвестирования» раскрывает перед вами особенности и инструменты краткосрочных инвестиционных стратегий. Здесь описываются различные инвестиционные стратегии, излагаются основные принципы технического анализа, даётся понятие  торговых стратегий. Вы познакомитесь с методами разработки математических моделей прогнозирования движения биржевых цен, лежащих в основе индикаторов и осцилляторов - основных инструментов принятия краткосрочных инвестиционных решений.\n\nПо итогам изучения курса вы сможете:\n- владеть основными принципами технического анализа, знать его основные подходы и  инструменты;\n- уметь самостоятельно выбирать индикаторы и осцилляторы при разработке и реализации торговых стратегий и создании собственных торговых систем.\n\nОЦЕНИВАНИЕ\nПрактические задания с использованием математических моделей прогнозирования цен и теоретические тесты на понимание технического анализа.\n\nНЕОБХОДИМЫЕ ЗНАНИЯ И НАВЫКИ\nДля освоения материалов курса вам понадобятся знания об основах рынка ценных бумаг, которые вы можете получить во 2 и 3 курсе нашей специализации - \"Инвестиции в облигации\" и \"Инвестиции в акции\".", 
    "end_date": null, 
    "title": "Инфраструктура рынка, методы и технологии инвестирования", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/68/b0ff60b89b11e582646f0314e1b02c/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/infrastruktura-rynka", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-06T22:24:14Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Сергей Нетесов, Маргарита Тарасова, Артем Тикунов, Галина Кочнева", 
    "description": "Существует множество инфекционных заболеваний, причины которых долгие годы казались необъяснимыми. Только в последние десятилетия стало понятно: более 70% из них вызваны вирусами. Причина большинства случаев рака печени — вирусы гепатитов В и С, рака шейки матки – папилломавирусы, более половины случаев диабета 2-го типа обусловлено последствиями заражения вирусом краснухи и другими вирусами. Вирусы — это то, что касается каждого из нас.\nВ нашем курсе вы узнаете о том, как устроены вирусы, чем они отличаются от живых организмов и какие механизмы используют для того, чтобы поразить клетки человека. Это поможет вам понять, как работают противовирусные препараты и вакцины. \nОРВИ, кишечные инфекции, гепатиты, корь, краснуха, бешенство, СПИД — вот далеко не полный список заболеваний, которые имеют вирусную природу. Разобраться в многообразии вирусов вам помогут учёные, которые каждый день работают с ними в лабораториях. Они расскажут об актуальных проблемах и задачах современной вирусологии, которые у всех на слуху. Например, о том, зачем исследователи воссоздали вирус гриппа «испанки», унёсший в начале прошлого века десятки миллионов человеческих жизней, а также о том, что такое вирус Эбола, и почему он опасен.\nВы побываете в современной вирусологической лаборатории и увидите, как нужно работать с вирусами, чтобы исключить вероятность заражения персонала и выхода вируса за пределы лаборатории. И конечно же, вы узнаете, как можно использовать вирусы на благо человека.", 
    "end_date": null, 
    "title": "Основы вирусологии (Introduction to Virology)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Novosibirsk State University "
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/c6/00f930579e11e5a198774c99d28682/skrin111.jpg", 
    "course_url": "https://en.coursera.org/learn/nsu-virology", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-12T00:38:57Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Теплова Тамара Викторовна, Столяров Андрей Иванович", 
    "description": "В шестинедельном итоговом проекте, разработанном  Высшей школой экономики в партнерстве с Инвестиционной компанией «Фридом Финанс», слушателям предлагается сформировать инвестиционный портфель по заданным критериям, рассчитать его доходность и показатели  риска  для двух сценариев развития экономики (оптимистичного и пессимистичного). Дополнительные материалы для выполнения заданий представят партнеры ИК «Открытие» и СПб биржа. \n\nПроект реализуется поэтапно с 4 взаимными оцениваниями. Самый весомый – последний этап, когда для физического лица (заказчика) формируется по-сценарно портфель, учитывающий  различные цели заказчика на горизонте 3-5 лет. На первой неделе слушатели критически оценивают предложенный консультантом инвестиционный портфель (выступают как консультанты-эксперты, критики), а на втором-четвертом этапе (неделях) самостоятельно формируют несколько портфелей (консервативный, средне-рискованный) из предложенных инструментов, сопоставляя и оценивая их с помощью технического и фундаментального анализа, а также принимая во внимание соответствие выбора инструментов заявленным целям заказчика. \nНа заключительном  этапе формируется сбалансированный портфель из инструментов по выбору слушателя и оценивается его доходность и риски для оптимистичного и пессимистичного сценариев.\n\nФормирование портфелей предполагается на разные временные горизонты (3 года, 5 лет), когда риск сглаживается как диверсификацией капитала в портфеле, так и включением низко-рискованных активов (государственных облигаций).\nДля наполнения средне-рискованного портфеля активами на срок от 3-х лет от слушателя будет требоваться сопоставление акций по инвестиционной привлекательности, принимая во внимание фундаментальные показатели деятельности компании и  ликвидность акций. \nКонсервативный портфель предполагает ранжирование облигаций и поиск высоконадежных из предложенного набора, отбор защитных акций с низким коэффициентом бета и оптимизацию весов активов в портфеле.\nОбщение со слушателями на форуме обеспечит как ассистент курса, так и сотрудники  ИК «Фридом Финанс» (ответят на вопросы слушателей, поделятся опытом и личным мнением).\n\nДля каждого из рассматриваемых портфелей в соответствии с профилем инвестора предполагается расчет общих и чистых (после уплаты налогов и комиссионных при заданных налоговых ставках и наличии предусмотренных законодательством льгот) выгод инвестирования, отдачи на вложенный капитал.\n\nПо итогам представленного проектного курса слушатели на практике вспомнят проблематику курсов специализации, составят инвестиционные портфели и обоснуют  доходность и риск  по ним, увяжут выбор портфеля с описанной в задании ситуацией, а также познакомятся с примером  формулирования личных финансовых целей и подбора  инструментов для их достижения.", 
    "end_date": null, 
    "title": "Итоговый проект специализации \"Финансовые инструменты для частного инвестора\"", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ec/047e60b89a11e5bd283755a7703f37/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/financial-instruments-capstone", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-13T02:08:26Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Сицына-Кудрявцева Алевтина Николаевна, Арбатская Ольга Анатольевна  , Яремчук Ольга Васильевна, Глушенкова Светлана Викторовна", 
    "description": "В настоящее время умение понимать и создавать научно-технические тексты на русском языке, навыки общения по-русски на научно-технические темы необходимы как студентам, собирающимся получать образование в российских университетах, так и специалистам, работающим вместе с профессионалами из России в области атомной энергетики, IT и современных технологий.\n\nКурс формирует навыки правильного использования грамматических конструкций при составлении научно-технических текстов, расширяет знания базовой грамматики русского языка, развивает профессиональные коммуникативные способности. Прохождение курса будет интересно всем, чья деятельность связана с наукой и образованием.\n\nПо результатам успешного прохождения курса слушатели, набравшие больше 70% от максимально возможного количества баллов, получают сертификат. При этом итоговый результат, представленный как 100 %, складывается из следующих составляющих: тесты к модулям 1, 2, 3, 4, 5 и 6 дают по 13 %, тест к модулю 7 дает 22 %.\n\nДайте возможность вашему знанию русского языка работать на Вас.", 
    "end_date": null, 
    "title": "Создание научно-технического текста", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/c0/bf6ad0562f11e5b3b731c0d5adf03e/logo_picture_russian.png", 
    "course_url": "https://en.coursera.org/learn/nauchno-texnicheski-text", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-13T07:59:15Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Вадим Стрижов, Виктор Кантор, Эмели Драль", 
    "description": "Методы машинного обучения — будь то алгоритмы классификации или регрессии, методы кластеризации или алгоритмы понижения размерности — применяются к подготовленным данным с вычисленными признаками для решения уже сформулированной задачи. Однако специалисты по анализу данных редко оказываются в такой идеальной ситуации. Обычно перед ними ставят задачи, которые нуждаются в уточнении формулировки, выборе метрики качества и протокола тестирования итоговой модели. Данные, с которыми нужно работать, часто представлены в непригодном виде: они зашумлены, содержат ошибки и выбросы, хранятся в неудобном формате и т. д.\n\nВ этом курсе мы разберем прикладные задачи из различных областей анализа данных: анализ текста и информационный поиск, коллаборативная фильтрация и рекомендательные системы, бизнес-аналитика, прогнозирование временных рядов. На их примере вы узнаете, как извлекать признаки из разнородных данных, какие при этом возникают проблемы и как их решать. Вы научитесь сводить задачу заказчика к формальной постановке задачи машинного обучения и поймёте, как проверять качество построенной модели на исторических данных и в онлайн-эксперименте. На каждой задаче мы изучим плюсы и минусы пройденных алгоритмов машинного обучения.\n\nПрослушав этот курс, вы познакомитесь с распространенными типами прикладных задач и будете понимать схемы их решения.", 
    "end_date": null, 
    "title": "Прикладные задачи анализа данных", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/49/58e8e0b0de11e5a0fb177d76ab076a/800x800-05.jpg", 
    "course_url": "https://en.coursera.org/learn/data-analysis-applications", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-20T07:02:47Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Михаил Владимирович Горбенко (Mikhail V. Gorbenko), Татьяна Ивановна Горбенко (Tatiana I. Gorbenko) ", 
    "description": "Для инновационного развития всех сфер робототехники необходимы молодые специалисты, способные креативно мыслить, разрабатывать, проектировать, внедрять и эксплуатировать сложные системы интеллектуального управления и роботизированные комплексы.\nКурс \"Инновации в промышленности: мехатроника и робототехника\" рассчитан на студентов технических специальностей, а также тех, кто интересуется робототехникой.\nМехатроника и робототехника охватывает очень широкий круг вопросов, и одному человеку трудно охватить и глубоко изучить все области исследования роботов. Данный курс поможет слушателям сориентироваться и выбрать для дальнейшей своей работы конкретное направление:\nизучение структуры и кинематики роботов, приводы роботов, управление и программирование, организация современного высокоэффективного роботизированного производства, применение систем автоматизированного проектирования изготовления деталей на станках с ЧПУ и технологической подготовки производства и др.\n\nСлушатели должны иметь знания по физике и математике в объеме школьной программы.\nУмение ориентироваться в математических и физических терминах, умение читать формулы, знание базовых физических единиц и их обозначений, понимание основ механики поможет слушателям успешно пройти данный курс.\n\nКурс состоит из 6 модулей. Каждая модуль курса содержит видеолекции, в конце каждой лекции – тестовые вопросы для самопроверки своих знаний.\nКаждый модуль заканчивается выполнением тестового задания из 10 вопросов. Это задание является важным для прохождения курса. Слушателю необходимо правильно ответить не менее чем на 7 из 10 вопросов. Сертификат получают слушатели, набравшие от 70 % и выше от максимально возможного количества баллов (100 %) за весь курс. При этом итоговый результат складывается из результатов тестовых заданий по всем модулям.\n\nThe course \"Innovations in industry: mechatronics and robotics\" may be interesting for students of engineering specialties who will learn to apply their knowledge in a new area. \nMechatronics and Robotics covers a wide range of issues, and it is difficult for one person to reach deep and explore all areas of robot research. This course will help students to navigate and choose the specific direction for their further work:\nthe structure and kinematics of robots, robot actuators, control and programming, the organization of modern highly robotized production, the use of CAD/CAM systems, manufacturing of parts on CNC machines and technological preparation of production.", 
    "end_date": null, 
    "title": "Инновации в промышленности: мехатроника и робототехника", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/2d/cdc960a25111e590f5731e47577412/______00148.png", 
    "course_url": "https://en.coursera.org/learn/innovations-in-industry-robotics", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-21T02:02:04Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Константин Вячеславович Воронцов, Евгений Соколов", 
    "description": "Не так давно получил распространение термин «большие данные», обозначивший новую прикладную область — поиск способов автоматического быстрого анализа огромных объёмов разнородной информации. Наука о больших данных ещё только оформляется, но уже сейчас она очень востребована — и в будущем будет востребована только больше.\nС её помощью можно решать невероятные задачи: оценивать состояние печени по кардиограмме, предсказывать зарплату по описанию вакансии, предлагать пользователю музыку на основании его анкеты в интернете.\n\nБольшими данными может оказаться что угодно: результаты научных экспериментов, логи банковских транзакций, метеорологические наблюдения, профили в социальных сетях — словом, всё, что может быть полезно проанализировать.\nСамым перспективным подходом к анализу больших данных считается применение машинного обучения — набора методов, благодаря которым компьютер может находить в массивах изначально неизвестные взаимосвязи и закономерности.\n\nНа факультете компьютерных наук ВШЭ и в Школе анализа данных есть люди, активно использующие машинное обучение и разрабатывающие новые подходы к нему. Именно они — преподаватели этого курса.\n\nВы изучите основные типы задач, решаемых с помощью машинного обучения — в основном речь пойдёт о классификации, регрессии и кластеризации. Узнаете об основных методах машинного обучения и их особенностях, научитесь оценивать качество моделей — и решать, подходит ли модель для решения конкретной задачи. Наконец, познакомитесь с современными библиотеками, в которых реализованы обсуждаемые модели и методы оценки их качества. Для работы мы будем использовать реальные данные из реальных задач.\n\nКраткая программа курса:\nНеделя 1. Введение. Примеры задач. Логические методы: решающие деревья и решающие леса.\nНеделя 2. Метрические методы классификации. Линейные методы, стохастический градиент.\nНеделя 3. Метод опорных векторов (SVM). Логистическая регрессия. Метрики качества классификации.\nНеделя 4. Линейная регрессия. Понижение размерности, метод главных компонент.\nНеделя 5. Композиции алгоритмов, градиентный бустинг. Нейронные сети.\nНеделя 6. Кластеризация и визуализация. Частичное обучение.\nНеделя 7. Прикладные задачи анализа данных: постановки и методы решения.\n\nСлушателю нужно знать об основных понятиях математики: функциях, производных, векторах, матрицах. Для выполнения практических заданий потребуются базовые навыки программирования. Очень желательно знать Python. Задания рассчитаны на использование этого языка и его библиотек numpy, pandas и scikit-learn.\n\nЧтобы успешно завершить курс, нужно набрать проходную сумму баллов за тесты и практические задания, а также выполнить финальный проект, посвящённый решению прикладной задачи анализа данных.\n\nМы уверены, что этот курс будет полезен каждому, кто хочет постичь искусство предсказательного моделирования и освоить интеллектуальный анализ данных.", 
    "end_date": null, 
    "title": "Введение в машинное обучение", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/a2/c23430579811e59644373576122c07/Ya-Icon-new-size.jpg", 
    "course_url": "https://en.coursera.org/learn/vvedenie-mashinnoe-obuchenie", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-27T02:50:07Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Danil Fedorovykh", 
    "description": "LaTeX (читается «латех») — научная издательская система. На этом курсе вы узнаете, как оформить ваши идеи в виде красивого, профессионально сверстанного текста или слайдов презентации.\n\nСистема LaTeX — стандарт в научном мире. Лучшие математические, физические и экономические журналы издаются в LaTeX и рекомендуют авторам использовать его для подготовки рукописей. LaTeX не очень прост в освоении, но обладает массой преимуществ перед популярными текстовыми процессорами и редакторами презентаций:\n  •  высококачественная верстка — текст выглядит «как в книжке»;\n  •  удобная работа со сложными математическими формулами;\n  •  отличная кросс-платформенная совместимость;\n  •  автоматизация многих рутинных процессов: нумерации формул, рисунков, таблиц, разделов документа, перекрестных ссылок, создания колонтитулов, оформления стилей заголовков и т. п.;\n  •  огромное сообщество пользователей и разработчиков, пакеты-расширения на все случаи жизни.\n\nLaTeX облегчает жизнь всем, кому приходится оформлять эссе, рефераты, курсовые и дипломные работы, диссертации, а также слайды презентаций на их основе. Пользователи, освоившие LaTeX, вспоминают верстку сложных документов в Word и создание больших презентаций в PowerPoint как страшный сон.\n\nFAQ\n\nВ: Что нужно установить на компьютер для прохождения этого курса?\nО: Для работы с LaTeX существует масса различных программных средств, некоторые из которых заменяют друг друга, а другие — дополняют их. Обзор этих средств — одна из тем первой недели лекций, до этого времени ничего устанавливать не нужно. Для освоения курса нужно будет иметь компьютер с быстрым доступом к интернету и возможностью устанавливать на него программное обеспечение. В дальнейшем при работе с собственными документами в LaTeX подключение к интернету будет необязательно.\n\nВ: Требуется ли предварительная подготовка для прохождения курса?\nО: Нет, предварительная подготовка для прохождения курса не требуется.", 
    "end_date": null, 
    "title": "Документы и презентации в LaTeX (Introduction to LaTeX)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/59/61b6b4924569d104a975c168fe88df/Introduction-to-LaTeX.jpg", 
    "course_url": "https://en.coursera.org/learn/latex", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-21T04:30:19Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Панебратцев Юрий Анатольевич, Гервидс Валериан Иванович, Клячин Николай Альбертович , Калашников Николай Павлович", 
    "description": "Наглядно – интересно – просто – понятно!\nДанный курс представляет собой серию физических опытов, в которых наглядно объясняются основные законы волновой оптики. Демонстрацию физических явлений проводит незаурядный человек, преподаватель, доцент кафедры общей физики НИЯУ МИФИ — Валериан Иванович Гервидс, глубокие знания и огромный преподавательский опыт которого делает курс «Физика в опытах. Часть 4. Волны и оптика» уникальным.\n\nЗачем учить этот курс?\n• Физика – наука экспериментальная. Лучше один раз увидеть, чем сто раз услышать или прочитать! \n• Именно эксперименты позволяют продемонстрировать и легко понять и простые, и сложные аспекты, которые традиционно преподаются в виде теоретического материала и математических моделей\n• Курс поможет Вам научиться использовать: \n   o эксперимент как способ постановки вопроса, \n   o эксперимент как инструмент изучения физического явления\n   o эксперимент как  форму ответа на вопрос\n• Очень часто достаточно «простые» физические вопросы имеют неожиданные ответы, которые зависят от конкретных условий проведения эксперимента. Демонстрация таких опытов и объяснение полученных в них результатов могут оказаться чрезвычайно интересными\n• Вы сможете увидеть применение изучаемых физических явлений в жизни, в технике и в быту\n• Изучая этот курс, вы восполните нехватку времени на экспериментальную, «живую» физику, которая ощущается в обычном учебном процесс\n\nЧему учит этот курс?\n• Пониманию широкого круга как простых, так и сложных физических явлений и процессов по тематике соответствующих разделов\n• Применению физических закономерностей для анализа различных физических явлений и процессов \n• Навыкам  использования эксперимента\n• Базовым знаниям по физике будущих инженеров и специалистов в различных областях деятельности.\n\nДля кого этот курс?\n• Для тех, кто изучает физику, и хочет прояснить для себя различные вопросы (в школе, в вузе)\n• Для тех, кто преподает физику (в школе, в вузе)\n• Для тех, кто использует физику в своем рабочем процессе (инженеры, программисты и т.д.)\n• Для тех, кому это просто интересно", 
    "end_date": null, 
    "title": "Физика в опытах. Часть 4. Волны и оптика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e1/719650a3f911e5b39e8fb33b8a68a0/logo_picture_volni.jpg", 
    "course_url": "https://en.coursera.org/learn/fizika-volny-optika", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-19T14:21:51Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "2444381", 
    "description": "هو مساق للمهتمين في التعرف على أدوات الاستشعار الحديثة التي تستعين بتقانة النانو (وهي التقانة التي تبحث في المجال بين واحد إلى مئة نانوميتر، أي في أجزاء من المليار من المتر) لفرز ومراقبة الأحداث المختلفة في حياتنا الشخصية أو العملية.  في أطار هذا المساق، سنكتشف معا عالم النانو المذهل الذي يتعامل مع الوحدات الأساسية في بناء المادة.  وبهذا سوف نمهد الطريق لتطبيقات إبداعية لانهائية تطبق في كل جزء من حياتنا اليومية، بدءا من تشخيصات وعلاجات (في الجسم الحي أو خارجه) للأمراض، وثم نستمر في تقانة مراقبة جودة المنتوجات وما يختص بالبيئة، وننهي في تقانة مراقبة القضايا الأمنية.  سنتعلم في هذا السعي كيف نصَنع هذه الأدوات الجديدة، وكيف نميزها، وكيف نتحكم بها، وكيف ندمجها في التطبيقات المختلفة.\n\n_ _ _ _ _ _ _ _ _ _ _ _ _\n\nوصف المساق\nتقانة ومستشعرات النانو هو مجال يحوي اختصاصات عديدة ومتداخلة ويجمع بين الكيمياء/البيوكيمياء، الفيزياء، البيولوجيا، علم المواد، هندسة الإلكترونيات وغيرها. سيعرض المساق الحالي بعض مبادئ التقانة ومواد النانو الاساسيّة ودورها الهام في اجهزة و خواص الاستشعار. في هذا المساق سيتم نقاش معلومات شيقة من تخصصات متعددة في مجال العلوم والهندسة في المستوى النانوي, مستهدفا فهم الاختلافات الفيزيائية الأساسية لمستشعرات النانو. عند إنهاء هذا المساق، يكون قد تعلم الطالب تصنيع، تمييز ومعالجة مواد النانو ومستشعرات النانو، وكيفية  تسخيرها لبناء تطبيقات جديدة. وأيضا سيطبق الطالب معرفته في تقانة ومستشعرات النانو ضمن مشروع حسب اهتمامه الشخصي.\n\n\nاهداف المساق\nهدف المساق الرئيسي هو تطوير التفكير النقدي, الابداعي والمبتكر. ان المساق يشجع العمل ضمن فريق ذو افراد من مجالات وحضارات مختلفة, لبناء \"مخازن أفكار\" عالمية لابتكار افكار جديدة. سوف يطلب منكم خلال المساق ان تقوموا بالتفكير بطريقة مبدعة, غير اعتيادية وان تقترحوا افكار جديدة. \n\nيستهدف هذا المساق تشجيع المعرفة بالمواضيع التالية: \n\n1)        أهمية المواد النانوية في تطبيقات الاستشعار.\n2)     الأساليب المستخدمة في تحديد خصائص المستشعرات النانوية·\n3)        الأساليب المستخدمة لتكييف مواد النانو بهدف استعمالها في تطبيقات استشعار خاصة.\n4)       جسيمات النانو الفلزية والشبه موصلة.\n5)        أنابيب النانو وأسلاك النانو العضوية وغير العضوية.\n6)        المستشعرات الضوئية، الميكانيكية، والكيميائية المبنية من مواد النانو.\n7)         المستشعرات المبنية من هجين من المواد النانوية.\n \n\nالكتب المطلوبة:\n·         Jiří Janata, Principles of Chemical Sensors, Springer, 2d Edition (1989).\n·         Roger George Jackson, Novel Sensors and Sensing, CRC Press (2004).\n\n\nنبذه عن البروفيسور حسام حايك:\n\nالبروفيسور حسام حايك هو خبير في مجال التقانة والمستشعرات النانوية، وتشخيص أمراض بوسائل غير باضعة. حاصل على العديد من الجوائز والأوسمة المرموقة في العالم: جائزة ماري كوري للتميز العلمي، جائزة ERC، جائزة الصحة الأوروبية 7-FP. البروفيسور حايك حاصل على أكثر من 42 وسام وجائزه دولية لإنجازاته العلمية، ويشمل ذلك وسام الفارس (التي تمنحه الحكومة الفرنسية) والذي يعد من أعرق اوسمه الشرف في العالم. وقد أدرج اسمه ضمن \"قائمة افضل 35 شاب عالم في العالم\". كذلك حاز البروفيسور حايك على جائزة ديسكفري من مؤسسة بيل وميليندا غيتس. البروفيسور حايك هو مؤسس ورئيس مجموعه مكونه من 8 فرق أبحاث وشركات أوروبية لتطوير جيل متقدم من الإلكترونيات الجزيئية لتشخيص الأمراض. وهو يشغل أيضا منصب محرر مساعد لمجلتين علميتين ويقوم بدور عضو استشاري علمي بارز في العديد من الشركات والمعاهد الوطنية والدولية، وكذلك مقيم علمي في المفوضية الأوروبية.\n\n البريد الإلكتروني: hhossam@technion.ac.il \n\n_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ \n\n الطاقم:\n\n\nميتال بار-سيجف: حاصلة على اللقب الأول  B.A في الكيمياء (بامتياز) وحاصله أيضا على اللقب الأول B.Sc.  في هندسة المواد (بامتياز) من معهد العلوم التطبيقية – التخنيون (كلاهما عام 2010). عملت أثناء دراستها في شركة  \"تاور سيميكوندكتور\" وبعد التخرج عملت في معهد ألفريد-مان في التخنيون كمهندسة للتطوير والتنمية. حاليا، تقوم ميتال بتحضير الدكتوراه (المسار المباشر) في معهد الإلكترونيات الجزيئية على اسم راسل باري في  التخنيون تحت إشراف البروفيسور حسام حايك. موضوع بحث الدكتوراه هو تطوير الجلد الإلكتروني بواسطة مواد النانو.\n\nعبير وتد: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في موضوع الهندسة المدنية بتخصصي هندسة المباني وهندسة المواصلات من معهد العلوم التطبيقية – التخنيون (عامي 1998 و- 2005 على التوالي). كما وحصلت على اللقب الثاني M.Sc. في موضوع تدريس العلوم والتكنولوجيا من التخنيون عام 2013. تركزت أبحاثها على تدريس العلوم عن طريق البحث العلمي في المختبرات. عبير تعمل حاليا محاضره في أكاديمية القاسمي-كلية أكاديمية للتربية (باقة الغربية، إسرائيل)، وهي تشغل أيضا منصب رئيسة قسم الهندسة المدنية في الأكاديمية.\n\nمايا اشر، مساعدة تدريس: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في دراسات الاتصالات من كلية سابير الاكاديمية وجامعة بن چوريون- اسرائيل (2009, 2013 على التوالي).\nعملت مايا كمحاضرة في الجامعة المفتوحة- اسرائيل. وحالياً، تقوم باكمال دراستها للدكتوراه في قسم التعليم في العلوم والتقانة في التخنيون تحت اشراف البروفسور ميري باراك. موضوع بحثها يتمركز حول دراسة التعلم التعاوني عبر الإنترنت في مجموعات صغيرة متعددة الثقافات. \n\nمحمد خطيب، مساعد تدريس: حاصل على اللقب الاول B.Sc في هندسة البيوكيمياء من معهد العلوم التطبيقية – التخنيون (2015). حالياً، يكمل محمد دراسة الدكتوراه (مسار خاص) في قسم هندسة الكيمياء, معهد العلوم التطبيقية – التخنيون، تحت اشراف البروفسور حسام حايك. موضوع بحثه يتمركز حول اجهزة الكترونية قادرة على اشفاء ذاتها، من اجل مراقبة ورصد امراض معدية.\n\nميري باراك، مستشارة تربوية: بروفيسور مساعد في قسم التعليم في العلوم والتقانة، معهد العفوم التطبيقية- التخنيون. هي رئيسة مجموعة التقانات العلمية والتعليمية ومستشارة طلاب الدراسات العليا. فعالياتها الاكادمية تتمركز حول تطوير، دمج وتقييم مناهج تعليم العلوم في المدارس والتعليم العالي. دراساتها تتضمن استعمال معلومات وتقانات اتصال، مع التشديد على الويب 2.0 الناشئ والتطبيقات السحابية، من اجل تعليم ناجع وعمليات تفكير عليا.", 
    "end_date": null, 
    "title": "التقانة والمستشعرات النانوية - الجزء الاول", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Technion - Israel Institute of Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/70/b89bab12e6e09ffa28db39a646c2c6/cover-picture.png", 
    "course_url": "https://en.coursera.org/learn/taknulujia-alnnanu1", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-14T15:27:46Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Станислав Козел, Владимир Овчинкин, Андрей Гавриков", 
    "description": "В курсе рассматриваются применения закона электромагнитной индукции и базовые закономерности колебаний в электрических цепях.\n\nСтуденты познакомятся с описанием свободных и вынужденных колебаний, квазистационарных процессов, получат представление о спектральном разложении и принципах работы параметрических и автоколебательных систем.\n\nУчебный материал основан на лекциях и семинарах по общей физике, читаемых студентам МФТИ в третьем семестре. Лекционный материал сопровождается наглядными демонстрациями.\n\nДля закрепления знаний и получения навыков решения задач в конце каждой недели студентам предлагается решить проверочные задания в виде теста и четырех задач. Итоговая контрольная работа помимо основного блока заданий содержит задачи повышенной сложности, которые в разное время предлагались студентам МФТИ на семестровых контрольных работах.", 
    "end_date": null, 
    "title": "Переходные процессы в электрических цепях", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/0c/df42c0c63611e5b4870ff3a2e6d292/IH7rGUn.jpg", 
    "course_url": "https://en.coursera.org/learn/electrical-circuits", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-16T04:17:25Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ilia Kiria", 
    "description": "Еще в конце 19 века исследователи обратили внимание на значимость роли медиа в социальных, политических, экономических, культурных процессах, а в 20 веке масс-медиа стали целой индустрией, производящей и воспроизводящей прообразы и репрезентации этих процессов, идеологии и картины мира. 21 век же ставит новые вопросы о том, что такое медиа и как они участвуют в формировании личности, конструировании социального пространства, политических режимов и в развитии экономики. \n\nОсновная цель курса – сформировать базовые представления о развитии медиа и нарисовать карту обширного поля медиатеорий. В связи с этим он состоит из двух частей – первая посвящена истории развития медиасистем, а вторая рассматривает ключевые теории медиа. \n\nПервая часть курса знакомит с основными технологическими вехами в развитии медиа и в то же время позволяет увидеть историю медиа как историю развития социального института. Основное внимание уделяется развитию институтов медиа преимущественно с момента появления национальных государств в Западной Европе до настоящего момента.  Курс рассматривает роль, которую играют медиа в формировании национальных идентичностей, капиталистической экономики, представлений о гражданских свободах и т.д. Отдельный модуль посвящен истории цензуры, поскольку история медиа тесно связана с этим явлением. \n\nВторая часть курса посвящена рассмотрению ключевых теоретических подходов к изучению медиа и коммуникаций, возникавших начиная с 1940-х годов и до сегодняшнего дня. Так, слушатели познакомятся с эмпирико-функционалистской и лингвистической группами медиа теорий, с идеями критической теории, парадигмой медиадетерминизма, теориями сетевого общества, с коммуникационным аспектом социологии технических инноваций, с микросоциальными теориями коммуникации, с изучением медиа в рамках направления cultural studies и политэкономии.", 
    "end_date": null, 
    "title": "История и теория медиа (History and theory of media)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/37/23f7f01c5911e6b8723341957cd3a2/media1.jpg", 
    "course_url": "https://en.coursera.org/learn/teoriya-smi", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-07-01T04:23:44Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ерохина Елена Альфредовна", 
    "description": "Курс «Алгоритмизация вычислений» будет вам интересен и просто необходим, если вы хотели бы изучить программирование с нуля и выйти на хороший базовый уровень, научиться составлять, понимать и анализировать алгоритмы. \n\nВ результате изучения курса вы сможете:\n• записывать математическую постановку задачи;\n• применять стандартные алгоритмы для решения задач;\n• оценивать оптимальность алгоритмов и выбирать алгоритм, дающий лучшее решение задачи;\n• проверять правильность алгоритма методом трассировки;\n• кодировать алгоритмы с использованием технологии структурного программирования;\n• отлаживать и тестировать программы.\n\nИзучение данной дисциплины базируется на знании студентами основ математики, информатики и основ алгоритмизации в пределах программы средней школы, умении применять математический аппарат при выборе метода решения задачи.\nДля освоения учебной дисциплины, студенты должны владеть школьными знаниями, получаемыми в процессе изучения указанных выше курсов.\n\nЭтот курс лежит в основе всего программирования. Можно сказать, что это фундамент, на котором будет строиться все дальнейшее обучение программированию. Мы будем решать задачи, постепенно переходя от простых к более сложным. В конечном итоге вы научитесь решать задачи обработки динамических списков, т.е. работать на хорошем базовом уровне.", 
    "end_date": null, 
    "title": "Алгоритмизация вычислений (Algorithmic computation)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/f9/832ba0f68311e598e59b02cabfd3c2/___-_________4.png", 
    "course_url": "https://en.coursera.org/learn/algoritmizacija-vychislenij", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-23T08:55:19Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Maria Yudkevich", 
    "description": "Этот курс – первый шаг к пониманию институтов и их роли в экономике и обществе, первый взгляд на богатую идеями и результатами область экономического анализа, которую мы называем институциональной экономикой. Мы покажем, что в мире, где осуществление трансакций связано с издержками, а люди склонны к оппортунизму, необходимо создавать правила и следить за соблюдением этих правил. Такие правила, дополненные механизмами принуждения к следованию правилам, мы и будем называть институтами. \nОсновная задача курса состоит в том, чтобы показать, как институты работают в различных сферах, и что происходит, если институты являются слабыми или неэффективными. Мы поговорим об институте прав собственности и о контрактах, будем приводить исторические примеры и разбирать современные кейсы, покажем, что институты важны для процветания целых стран, но в то же время необходимы для осуществления даже самых простых трансакций между двумя их гражданами. И это всего лишь неполный перечень вопросов, на которые мы ответим в течение курса.", 
    "end_date": null, 
    "title": "Институциональная экономика (Institutional economics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/cf/d721000beb11e4ac9665dad26e5e3e/InEc4.jpg", 
    "course_url": "https://en.coursera.org/learn/institutional-economics", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-29T03:40:18Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Николай Георгиевич Булахов (Nikolay G. Bulakhov)", 
    "description": "Наверняка многие из вас слышали о трёхмерной печати, и при этом большинство полагает, что это что-то из области высоких технологий, а потому очень сложное, дорогое и недоступное простым смертным. На самом деле всё гораздо проще, интереснее и доступнее. Каждый, кто пройдёт обучение на этом курсе, сможет собрать свой собственный бытовой 3D-принтер, открывая практически безграничные горизонты моделирования, прототипирования и создания эксклюзивных вещей.\nВ курсе будет продемонстрирован весь технологический процесс печати трёхмерных объектов. Вы узнаете, что такое 3D-модели и как их создают в редакторах трёхмерной графики, наглядно увидите, какими способами формируют объёмные фигуры 3D-принтеры, узнаете, из каких функциональных элементов состоят 3D-принтеры, поймёте, как работает управляющая электроника. Будет показано устройство, а также способы сборки и настройки персонального 3D-принтера, печатающего ABS пластиком.\nСертификат могут получить слушатели, набравшие больше 80% от максимально возможного количества баллов. При этом итоговый результат, представленный как 100 %, складывается из следующих составляющих: тесты к модулям 1, 2, 3, 4 и 7 дают 15 %, тесты к модулям 5 и 6 дают 20 %.", 
    "end_date": null, 
    "title": "3D-печать для всех и каждого", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/48/8c0a00552b11e584d2f53f071a9306/3d_00000.png", 
    "course_url": "https://en.coursera.org/learn/3d-printing", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-14T07:08:11Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Валерия Николаевна Петрова", 
    "description": "Курс направлен на:\n• формирование адекватного представления о разнообразии методов современной психодиагностики;\n• глубокое изучение современных мировых этических стандартов работы психолога – психодиагноста;\n• освоение технологий определения достоверности результатов, полученных с помощью различных методов диагностики;\n• изучение классических и современных подходов к диагностике интеллекта, личностных особенностей, потенциала одаренности и потенциала достижений личности;\n• формирование базовых навыков применения классических методов психодиагностики.\n\nПрограмма данного курса предполагает обучение современным способам распознавания, измерения и описания индивидуально-психологических особенностей человека; изучение закономерностей вынесения валидных и надежных диагностических суждений, правил “диагностических умозаключений”, с помощью которых осуществляется переход от признаков или индикаторов определенных психических состояний, структуры, процесса к констатации наличия и выраженности этих психологических переменных; выполнение большинства базовых методик психодиагностики и формирование навыка интерпретации полученных результатов.\n\nДанный курс ориентирован на три категории слушателей: \n• менеджеров по персоналу, специалистов клиент-ориентированного профиля, сталкивающиеся с необходимостью применения психодиагностических методов и/или принятия управленческих решений на основе результатов психодиагностики;\n• студентов программ очного и заочного бакалавриата гуманитарных и менеджерских направлений образования \n• магистров и аспирантов с различным уровнем подготовки, прошедших обучение по программам бакалавриата в различных вузах и по различным специальностям.", 
    "end_date": null, 
    "title": "Психодиагностика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/a4/e72730e1e911e5a4bddb8f3cb86bda/MAinComp-_0_00_14_10_.jpg", 
    "course_url": "https://en.coursera.org/learn/psykhodyahnostyka", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-14T23:33:49Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "2444381", 
    "description": "هو مساق للمهتمين في التعرف على أدوات الاستشعار الحديثة التي تستعين بتقانة النانو (وهي التقانة التي تبحث في المجال بين واحد إلى مئة نانوميتر، أي في أجزاء من المليار من المتر) لفرز ومراقبة الأحداث المختلفة في حياتنا الشخصية أو العملية.  في أطار هذا المساق، سنكتشف معا عالم النانو المذهل الذي يتعامل مع الوحدات الأساسية في بناء المادة.  وبهذا سوف نمهد الطريق لتطبيقات إبداعية لانهائية تطبق في كل جزء من حياتنا اليومية، بدءا من تشخيصات وعلاجات (في الجسم الحي أو خارجه) للأمراض، وثم نستمر في تقانة مراقبة جودة المنتوجات وما يختص بالبيئة، وننهي في تقانة مراقبة القضايا الأمنية.  سنتعلم في هذا السعي كيف نصَنع هذه الأدوات الجديدة، وكيف نميزها، وكيف نتحكم بها، وكيف ندمجها في التطبيقات المختلفة.\n\n_ _ _ _ _ _ _ _ _ _ _ _ _\n\nوصف المساق\nتقانة ومستشعرات النانو هو مجال يحوي اختصاصات عديدة ومتداخلة ويجمع بين الكيمياء/البيوكيمياء، الفيزياء، البيولوجيا، علم المواد، هندسة الإلكترونيات وغيرها. سيعرض المساق الحالي بعض مبادئ التقانة ومواد النانو الاساسيّة ودورها الهام في اجهزة و خواص الاستشعار. في هذا المساق سيتم نقاش معلومات شيقة من تخصصات متعددة في مجال العلوم والهندسة في المستوى النانوي, مستهدفا فهم الاختلافات الفيزيائية الأساسية لمستشعرات النانو. عند إنهاء هذا المساق، يكون قد تعلم الطالب تصنيع، تمييز ومعالجة مواد النانو ومستشعرات النانو، وكيفية  تسخيرها لبناء تطبيقات جديدة. وأيضا سيطبق الطالب معرفته في تقانة ومستشعرات النانو ضمن مشروع حسب اهتمامه الشخصي.\n\n\nاهداف المساق\nهدف المساق الرئيسي هو تطوير التفكير النقدي, الابداعي والمبتكر. ان المساق يشجع العمل ضمن فريق ذو افراد من مجالات وحضارات مختلفة, لبناء \"مخازن أفكار\" عالمية لابتكار افكار جديدة. سوف يطلب منكم خلال المساق ان تقوموا بالتفكير بطريقة مبدعة, غير اعتيادية وان تقترحوا افكار جديدة. \n\nيستهدف هذا المساق تشجيع المعرفة بالمواضيع التالية: \n\n1)        أهمية المواد النانوية في تطبيقات الاستشعار.\n2)     الأساليب المستخدمة في تحديد خصائص المستشعرات النانوية·\n3)        الأساليب المستخدمة لتكييف مواد النانو بهدف استعمالها في تطبيقات استشعار خاصة.\n4)       جسيمات النانو الفلزية والشبه موصلة.\n5)        أنابيب النانو وأسلاك النانو العضوية وغير العضوية.\n6)        المستشعرات الضوئية، الميكانيكية، والكيميائية المبنية من مواد النانو.\n7)         المستشعرات المبنية من هجين من المواد النانوية.\n \n\nالكتب المطلوبة:\n·         Jiří Janata, Principles of Chemical Sensors, Springer, 2d Edition (1989).\n·         Roger George Jackson, Novel Sensors and Sensing, CRC Press (2004).\n\nنبذه عن البروفيسور حسام حايك:\n\nالبروفيسور حسام حايك هو خبير في مجال التقانة والمستشعرات النانوية، وتشخيص أمراض بوسائل غير باضعة. حاصل على العديد من الجوائز والأوسمة المرموقة في العالم: جائزة ماري كوري للتميز العلمي، جائزة ERC، جائزة الصحة الأوروبية 7-FP. البروفيسور حايك حاصل على أكثر من 42 وسام وجائزه دولية لإنجازاته العلمية، ويشمل ذلك وسام الفارس (التي تمنحه الحكومة الفرنسية) والذي يعد من أعرق اوسمه الشرف في العالم. وقد أدرج اسمه ضمن \"قائمة افضل 35 شاب عالم في العالم\". كذلك حاز البروفيسور حايك على جائزة ديسكفري من مؤسسة بيل وميليندا غيتس. البروفيسور حايك هو مؤسس ورئيس مجموعه مكونه من 8 فرق أبحاث وشركات أوروبية لتطوير جيل متقدم من الإلكترونيات الجزيئية لتشخيص الأمراض. وهو يشغل أيضا منصب محرر مساعد لمجلتين علميتين ويقوم بدور عضو استشاري علمي بارز في العديد من الشركات والمعاهد الوطنية والدولية، وكذلك مقيم علمي في المفوضية الأوروبية.\n\n البريد الإلكتروني: hhossam@technion.ac.il \n\n_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ _ \n\n الطاقم:\n\n\nميتال بار-سيجف: حاصلة على اللقب الأول  B.A في الكيمياء (بامتياز) وحاصله أيضا على اللقب الأول B.Sc.  في هندسة المواد (بامتياز) من معهد العلوم التطبيقية – التخنيون (كلاهما عام 2010). عملت أثناء دراستها في شركة  \"تاور سيميكوندكتور\" وبعد التخرج عملت في معهد ألفريد-مان في التخنيون كمهندسة للتطوير والتنمية. حاليا، تقوم ميتال بتحضير الدكتوراه (المسار المباشر) في معهد الإلكترونيات الجزيئية على اسم راسل باري في  التخنيون تحت إشراف البروفيسور حسام حايك. موضوع بحث الدكتوراه هو تطوير الجلد الإلكتروني بواسطة مواد النانو.\n\nعبير وتد: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في موضوع الهندسة المدنية بتخصصي هندسة المباني وهندسة المواصلات من معهد العلوم التطبيقية – التخنيون (عامي 1998 و- 2005 على التوالي). كما وحصلت على اللقب الثاني M.Sc. في موضوع تدريس العلوم والتكنولوجيا من التخنيون عام 2013. تركزت أبحاثها على تدريس العلوم عن طريق البحث العلمي في المختبرات. عبير تعمل حاليا محاضره في أكاديمية القاسمي-كلية أكاديمية للتربية (باقة الغربية، إسرائيل)، وهي تشغل أيضا منصب رئيسة قسم الهندسة المدنية في الأكاديمية.\n\nمايا اشر، مساعدة تدريس: حاصله على اللقب الأول B.Sc واللقب الثاني M.Sc. في دراسات الاتصالات من كلية سابير الاكاديمية وجامعة بن چوريون- اسرائيل (2009, 2013 على التوالي).\nعملت مايا كمحاضرة في الجامعة المفتوحة- اسرائيل. وحالياً، تقوم باكمال دراستها للدكتوراه في قسم التعليم في العلوم والتقانة في التخنيون تحت اشراف البروفسور ميري باراك. موضوع بحثها يتمركز حول دراسة التعلم التعاوني عبر الإنترنت في مجموعات صغيرة متعددة الثقافات. \n\nمحمد خطيب، مساعد تدريس: حاصل على اللقب الاول B.Sc في هندسة البيوكيمياء من معهد العلوم التطبيقية – التخنيون (2015). حالياً، يكمل محمد دراسة الدكتوراه (مسار خاص) في قسم هندسة الكيمياء, معهد العلوم التطبيقية – التخنيون، تحت اشراف البروفسور حسام حايك. موضوع بحثه يتمركز حول اجهزة الكترونية قادرة على اشفاء ذاتها، من اجل مراقبة ورصد امراض معدية.\n\nميري باراك، مستشارة تربوية: بروفيسور مساعد في قسم التعليم في العلوم والتقانة، معهد العفوم التطبيقية- التخنيون. هي رئيسة مجموعة التقانات العلمية والتعليمية ومستشارة طلاب الدراسات العليا. فعالياتها الاكادمية تتمركز حول تطوير، دمج وتقييم مناهج تعليم العلوم في المدارس والتعليم العالي. دراساتها تتضمن استعمال معلومات وتقانات اتصال، مع التشديد على الويب 2.0 الناشئ والتطبيقات السحابية، من اجل تعليم ناجع وعمليات تفكير عليا.", 
    "end_date": null, 
    "title": " التقانة والمستشعرات النانوية - الجزء الثاني", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Technion - Israel Institute of Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/70/b89bab12e6e09ffa28db39a646c2c6/cover-picture.png", 
    "course_url": "https://en.coursera.org/learn/taknulujia-alnnanu2", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-14T15:28:32Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Райгородский, Максим Жуковский", 
    "description": "Издавна среди жителей Кёнигсберга была распространена такая загадка: как пройти по всем мостам через реку Преголя, не проходя ни по одному из них дважды. Многие кёнигсбержцы пытались решить эту задачу как теоретически, так и практически во время прогулок. Доказать или опровергнуть возможность существования такого маршрута никто не мог до 1736 года, когда выдающийся математик Леонард Эйлер не написал письмо своему другу с решением. Ответ был «нельзя». Так и родилась теория графов. Но что будет, если процесс, который описывает граф – случаен?\n\nТеория случайных графов находится на стыке теории графов и теории вероятностей. Наука появилась в середине ХХ века, и она сразу же привлекла огромное внимание как со стороны чистых математиков, так и со стороны прикладников. В курсе мы изучим как основы теории случайных графов, так и настоящие ее жемчужины.\n\nМы научимся воспринимать многие сложные системы как \"случайные графы\". Среди них – интернет, социальные сети (Фейсбука, Вконтакте), биологические, межбанковские сети.\n\nПрослушав этот курс, вы проникнетесь чрезвычайно красивой математической теорией и научитесь решать комбинаторные и алгоритмические задачи на случайных графах. Все эти знания позволят нам затем перейти к курсу веб-графов, в котором мы расскажем о самых современных приложениях вероятностно-графовых моделей и конструкций.\n\nДля освоения материала будет достаточно математики школьного уровня, базовых знаний комбинаторики и теории вероятностей.", 
    "end_date": null, 
    "title": "Случайные графы", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/5c/8e6b8057db11e5819e073a88710a2e/randomgr.png", 
    "course_url": "https://en.coursera.org/learn/sluchajnye-graphy", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-30T08:16:29Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Claudia Zuppini Dalcorso, Silvana Tamassia, Ednéia Regina Burger", 
    "description": "O curso Gestão para a Aprendizagem: Módulo Gestão Estratégica aborda uma nova concepção de gestão escolar focada na aprendizagem dos alunos e nas dimensões de trabalho do gestor visando o sucesso escolar, com foco na rede pública. O cerne do curso é o planejamento estratégico e os instrumentos práticos, tais como a caracterização da comunidade escolar, a avaliação de eficácia, a análise SWOT e o plano de ação.", 
    "end_date": null, 
    "title": "Gestão para a Aprendizagem: Módulo Gestão Estratégica", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Fundação Lemann", 
      "Elos Educacional"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/db/851ee05ca211e5a591c1e5f3f908bf/Course-logo_GAP_v2.png", 
    "course_url": "https://en.coursera.org/learn/gestao-escolar", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-05-16T02:28:51Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ольчак Андрей Станиславович", 
    "description": "Этот курс для тех, кто изучал физику в школе или в университете, пусть даже почти ничего при этом не понял, но желал бы все-таки понять; для тех, кто любознателен, кому интересно, как устроен и по каким правилам существует Вселенная, в которой мы живем, и природа, которая нас окружает; для тех, кто собирается в будущем заняться любой творческой работой, требующей кроме прочего хорошего логического анализа. \n\nВ результате прохождения курса вы узнаете многое о том, как устроен и по каким объективным законам существует наш Мир, и какими способами мы можем проникать в тайны его законов и использовать их на практике. Вы узнаете, как отличить действительные знания от мнимых, научитесь отличать псевдознания от “уфологов”, “экстрасенсов” и прочих от подлинного знания, основанного на логике и общих представлениях о принципах организации нашего Мира, заложенных Природой и/или Создателем. Вы сможете продолжить изучение проекта «Физика» на действительно глубоком уровне в последующих модулях нашего курса.\n\nЧто надо знать и уметь, чтобы приступить к изучению этого курса?\n•\tНачальные знания по физике в рамках школьного курса, пусть даже и не слишком твердо усвоенные\n•\tУмение логически мыслить, складывать “два и два”, делать выводы из предпосылок.\n•\tИметь достаточные знания по математике в рамках школьного курса.\n\nПри успешном прохождении курса вы получите сертификат, который будет позитивно оценен и учтен при поступлении, например, в магистратуру технического профиля. Кроме этого сертификат подтвердит наличие у Вас не только физико-математической подготовки, но и наличие развитых способностей к логическому анализу, что высоко ценится умными работодателями, независимо от профиля работы.", 
    "end_date": null, 
    "title": "Физика как глобальный проект", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/52/71aad0563311e59db1594593474550/logo_picture_phys.png", 
    "course_url": "https://en.coursera.org/learn/physics-global-project", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-11T00:11:43Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "9009600", 
    "description": "Course language is Hebrew! English subtitles are planned but not yet available.\n\nThe Hebrew course description will be followed by an English one.\n\nהשימוש בדלק לסוגיו הוא התשתית שעליה מבוססים החיים המודרניים. כבר יותר ממאה שנה אנו משתמשים בדלקים מאובנים שנאצרו בבטן האדמה – נפט, גז טבעי ופחם – כדי להניע את גלגלי עולמנו: תעשייה מתקדמת, תחבורה מהירה, בתים נוחים ועוד. בקורס זה ננסה לבחון אלטרנטיבות אפשריות לדלקים המאובנים, הגורמים נזק לא מבוטל לסביבתנו ולבריאותנו. נתאר את המחקר המדעי האינטנסיבי המתקיים בתחום, ונציג מגוון טכנולוגיות מתקדמות להפקת אנרגיה נקייה ממקורות טבעיים ומתחדשים – כמו השמש, הרוח והמים – מקורות המצויים בשפע, אינם מזהמים, ואינם מתכלים.\n\nקורס המבוא לאנרגיה מתחדשת ייפתח בשאלות הבסיס של תחום האנרגיה: מהם צורכי האנרגיה של האנושות כיום, ואילו משאבים עומדים לרשותה? אילו תהליכים אנו מכירים  לאיסוף, המרה וניצול של מקורות אנרגיה? מהן הבעיות שנוצרות עקב השימוש הנוכחי במקורות אנרגיה מאובנים? ואיזה שינוי נדרש במדיניות האנרגיה ובמשק האנרגיה של החברה המודרנית?\n\nמכאן נעבור לתיאור הסוגים העיקריים של אנרגיה מתחדשת – מקורות אנרגיה טבעיים, זמינים ובלתי מתכלים, שאינם גורמים נזק סביבתי, ועשויים להחליף את הדלקים המאובנים. נדבר על אנרגיית השמש, אנרגיית הרוח, אנרגיית המים וביו-אנרגיה; ננתח את הטכנולוגיות הקיימות כבר היום לניצול המקורות הללו לצורכי האדם; נציג כלים בסיסיים לחישוב יעילות ההמרה של כל טכנולוגיה, וכמויות האנרגיה שניתן להפיק באמצעותה; ונביא דרכים להערכת הכדאיות הכלכלית של כל אחת מהשיטות.\n\nבמקביל, נדון בקשיים ובאתגרים הממתינים עדיין לפתרון, ונשאל מה יש לעשות כדי שהאנרגיות המתחדשות ייושמו בקנה מידה רחב – בתעשייה, בתחבורה, ובכל תחומי חיינו. נבחן מגוון טכנולוגיות מתקדמות להפקת אנרגיה ממקורות נקיים; נסביר מדוע הן עדיין אינן תופסות את מקומם של הדלקים המאובנים; ונציג כיווני מחקר עכשוויים ופיתוחים חדשניים שמשפרים ומייעלים לא הרף את השיטות הקיימות, במטרה להבטיח לכולנו עתיד בר-קיימא.\n\n \n\nCourse language is Hebrew! English subtitles are planned but not yet available.\n\nFuels are the foundations of modern living. For over a century we have been drawing fossil fuels – oil, coal and natural gas – from the depths of the earth, and using them to power our world: advanced industries, fast transportation, comfortable homes and more. In this course we will examine possible alternatives for these fuels - which have proved quite damaging to both our health and our environment. We will describe the intensive worldwide efforts in this field of research, and present their encouraging outcome: a range of innovative technologies for generating clean energy from natural, non-polluting and renewable sources – such as sunlight, wind and water.\n\nThe course will open with some fundamental questions on energy: What are the energy needs of the global population today, and what will they be tomorrow? What are the resources at our disposal? What are the known processes for harvesting, converting and utilizing resources of energy? What are the problems generated by the use of fossil fuels? In what ways must we change our energy policies and energy economy? And most important of all: What are the alternatives to fossil fuels, and can they supply humanity's extensive and constantly growing energy needs?\n\nSubsequent lessons will introduce the main types of safe, clean, natural and renewable energy sources available to us: solar energy, wind energy, water energy and bioenergy. We will speak of existing technologies that already harness these resources to the needs of humankind, and supply simple tools for computing conversion efficiencies, calculating the amounts of energy produced through the various methods, and assessing their economic feasibility.\n\nIn parallel, we will discuss the remaining problems and challenges, and ask what must be done to enable the large-scale use of renewable energy – in industry, in transportation, and in every other sphere of our lives. We will examine several advanced renewable energy technologies; explain why they have not yet taken the place of fossil fuels; and present cutting-edge innovations and promising research directions – in the ongoing global effort to ensure a sustainable future for us all.", 
    "end_date": null, 
    "title": "מבוא לאנרגיה מתחדשת -  Introduction to Renewable Energy", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Tel Aviv University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/28/9dbde0aedd11e592f52d1e33da9f3c/introduction-to-renewable-energy.jpg", 
    "course_url": "https://en.coursera.org/learn/renewable-energy", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-26T02:33:58Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Виктор Кантор, Эмели Драль, Константин Воронцов", 
    "description": "В машинном обучении встречаются задачи, где нужно изучить структуру данных, найти в них скрытые взаимосвязи и закономерности. Например, нам может понадобиться описать каждого клиента банка с помощью меньшего количества переменных — для этого можно использовать методы понижения размерности, основанные на матричных разложениях. Такие методы пытаются сформировать новые признаки на основе старых, сохранив как можно больше информации в данных. Другим примером может служить задача тематического моделирования, в которой для набора текстов нужно построить модель, объясняющую процесс формирования этих текстов из небольшого количества тем.\n\nТакие задачи назвают обучением без учителя. В отличие от обучения с учителем, в них не предполагают восстановление зависимости между объектами и целевой переменной. \n\nИз этого курса вы узнаете об алгоритмах кластеризации данных, с помощью которых, например, можно искать группы схожих клиентов мобильного оператора. Вы научитесь строить матричные разложения и решать задачу тематического моделирования, понижать размерность данных, искать аномалии и визуализировать многомерные данные.", 
    "end_date": null, 
    "title": "Поиск структуры в данных", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/51/45def0b0de11e5bc793bb6b305a033/800x800-03.jpg", 
    "course_url": "https://en.coursera.org/learn/unsupervised-learning", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-26T07:43:14Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Радаев Вадим Валерьевич ", 
    "description": "Экономическая социология опирается на длинную и богатую интеллектуальную традицию и в то же время является молодой, становящейся. Она пережила ренессанс в 1980-е годы с появлением «новой экономической социологии», активно и плодотворно анализирующей экономические объекты – развитие современных рынков, деятельность компаний и домашних хозяйств, трудовое, финансовое и потребительское поведение людей. Экономическая социология – широкая интегративная дисциплина. В данном курсе отобраны темы и концепции, наиболее важные для понимания и содержательного использования экономико-социологического подхода.\n\nВ результате освоения курса слушатели:\n- получат углубленные знания о предмете, основных направлениях исследований и перспективах развития экономической социологии;\n- научатся применять разнообразные аналитические инструменты, используемые в современных экономико-социологических исследованиях;\n- выработают навыки критического осмысления научных материалов по экономико-социологическим проблематикам.\n\nПрограмма курса\nКурс включает 10 тем по экономической социологии.  В каждой теме Вам предлагаются видеолекции, перечень основных вопросов лекции, литература и проверочный тест. \n\nТемы курса\n1. Предмет экономической социологии\n2. Модель человека в экономической социологии\n3.Человек в роли предпринимателя\n4. Человек в трудовых отношениях\n5. Человек в домашнем хозяйстве\n6. Человек в роли потребителя\n7. Человек в денежном хозяйстве\n8. Рынок как форма хозяйства\n9. Государственное регулирование хозяйства\n10. Неформальная экономика как форма хозяйства", 
    "end_date": null, 
    "title": "Экономическая социология", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/61/ccf1d0879b11e58fe52b33c777c38b/______.png", 
    "course_url": "https://en.coursera.org/learn/ekonomicheskaya-sociologiya", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-01T05:12:10Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Николай Николаевич Богословский (Nikolay N. Bogoslovskiy), Евгений Александрович Данилкин (Evgeniy A. Danilkin) ", 
    "description": "Потребность решения сложных прикладных задач с большим объемом вычислений и принципиальная ограниченность максимального быстродействия «классических» – по схеме фон Неймана – ЭВМ привели к появлению многопроцессорных вычислительных систем (МВС) или суперкомпьютеров. \nШирокое распространение параллельные вычисления приобрели с переходом компьютерной индустрии на массовый выпуск многоядерных процессоров с векторными расширениями. В настоящие время практически все устройства – от карманных гаджетов и до самых мощных суперкомпьютеров – оснащены многоядерными процессорами. И если вы пишите последовательную программу, не применив распределение работы между разными ядрами центрального процессора и не проведя векторизацию, то вы используете только часть вычислительных возможностей центрального процессора. \n\nПройдя этот курс, вы познакомитесь с основными архитектурами МВС, с двумя стандартами (OpenMP и MPI), позволяющими писать параллельные программы для систем с общей и распределенной памятью. На простых примерах будут разобраны основные конструкции и способы распределения работы. Выполнение практических заданий позволит вам приобрести практические навыки создания параллельных программ. Курс будет интересен всем, кто занимается программированием.\n\nДля участия в курсе слушателю необходимо иметь базовые знания по программированию с использованием С/С++. \n\nКурс состоит из 9 недель. Каждая неделя курса содержит видеолекции, а также проверочные задания. Сертификат получают слушатели, набравшие более 80 % от максимально возможного количества баллов. При этом итоговый результат, представленный как 100 %, складывается из следующих составляющих: тесты 1–5 недели дают 4 %, тесты 6–9 недели дают 5 %, все практические задания дают 10 %, кроме итогового практического задания по OpenMP, которое дает 20 %.", 
    "end_date": null, 
    "title": "Введение в параллельное программирование с использованием OpenMP и MPI", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/21/31d2c0719411e59990ed0820cea50c/logo.png", 
    "course_url": "https://en.coursera.org/learn/parallelnoye-programmirovaniye", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-16T02:42:23Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Boris Demeshev", 
    "description": "Эконометрика – наука, позволяющая исследовать закономерности в реальных данных. К концу курса мы научимся отвечать на два вопроса. Как одна переменная, y, зависит от другой переменной, x? Как спрогнозировать переменную y?\n\nМы будем подробно изучать линейные регрессионные модели,  рассмотрим наиболее частые отклонения от предпосылок классической линейной регрессии. Изучим базовые модели (логит и пробит) для качественных зависимых переменных. Наряду с теоретической основой мы будем работать с реальными данными, используя статистический пакет R.\n\nНеобходимые знания:\nТеория вероятностей и математическая статистика.\nЛинейная алгебра опционально.", 
    "end_date": null, 
    "title": "Эконометрика (Econometrics)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/40/b229e05f5e11e48a20a7e729f7ce56/econ_5-copy.png", 
    "course_url": "https://en.coursera.org/learn/ekonometrika", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-27T00:53:14Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Сергеевич Бабенко (Andrey S. Babenko)", 
    "description": "Курс посвящен обзору биологических процессов, протекающих в почве и роли живых организмов в формировании почвенного горизонта. В этом курсе слушатели узнают, какую роль играют почвенные организмы в глобальном круговороте вещества и энергии, научатся распознавать различные систематические и трофические группы почвенных животных, смогут оценить их возможности как индикаторов состояния наземных экосистем. Также слушатели курса получат возможность ознакомиться со спецификой животного населения почв городских экосистем и сельскохозяйственных угодий; использовать сведения по экологии почвенных организмов для переработки органических отходов, создания почвозамещающих смесей и улучшения почвенного плодородия.\nДля успешного освоения курса и получения сертификата слушателям необходимо набрать не менее 80% от максимально возможного количества баллов. При этом итоговый результат складывается из следующих составляющих: промежуточные тесты дают 80 %, итоговый тест дает 20 %.", 
    "end_date": null, 
    "title": "Жизнь в почве ", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/81/f99d50553711e5b3162fb996be2871/________.png", 
    "course_url": "https://en.coursera.org/learn/life-in-soil", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-14T07:08:33Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "11737707", 
    "description": "Впливайте на ваші фінансові рішення та навчіться впливати на виконання показників прибутковості вашого підрозділу та організації в цілому. Цей курс надає базове розуміння концепцій фінансів та бухгалтерського обліку для сприятння росту вашої організації. Після проходження цього курсу, ви отримаєте загальні знання з фінансів та глибоке розуміння впливу ваших рішень за рамками сфери ваших функціональних обов’язків. Зміст курсу включає обрані аспекти фінансів з точки зору нефінансових спеціалістів.Спеціальні теми включають: фінансовий аналіз; планування, прогнозування та бюджетування; грошовий потік та стратегічне фінансування. Даний курс буде інтерактивним та потребуватиме активної участі студентів у діяльність, що має відношення до фінансів. \n\nThis course is translated by the Ukrainian mobile network operator, lifecell.", 
    "end_date": null, 
    "title": "Фінанси для нефінансових спеціалістів", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "University of California, Irvine"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/04/e5493049ae11e4a3304f24ff82b397/Finance-Course.jpg", 
    "course_url": "https://en.coursera.org/learn/finansy", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-29T05:17:07Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Нина Александровна Агапова (Nina A. Agapova)", 
    "description": "В настоящее время русский язык испытывает на себе различного рода влияния Интернет-коммуникации, средств массовой информации, сильное воздействие других языков. Подобные процессы нельзя назвать сугубо положительными: отрицательные стороны у них, безусловно, тоже есть. И это является еще одним важным фактором, обуславливающим необходимость обращения к языковому материалу сегодня и дополнительного его изучения.\nСпецифика курса, который в университетской программе традиционно называется «Русский язык и культура речи», состоит в том, что он является общеобразовательным и повсеместно читается студентам самых разных факультетов. В российских вузах его ежегодно слушают экономисты, юристы, психологи, биологи, информатики, историки, спортсмены…\nВ онлайн-курсе предпринимается попытка дать базовые знания, необходимые для эффективного освоения дисциплины студентами различных направлений и специальностей как российских, так и зарубежных вузов.\nКурс будет интересен студентам любых факультетов и любых курсов (включая магистратуру), иностранным гражданам, изучающим русский язык, школьникам среднего и старшего звена, а также всем желающим повысить уровень владения навыками устной и письменной речи.\nСертификат получают слушатели, набравшие больше 70% (от 71% и выше) от максимально возможного количества баллов.\nПри этом итоговый результат складывается из следующих составляющих: промежуточные тесты дают 70 %, итоговый тест  дает 30 %.", 
    "end_date": null, 
    "title": "Русский язык как инструмент успешной коммуникации", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/bc/20f7d052df11e5b544012069a20f0b/itog.jpg", 
    "course_url": "https://en.coursera.org/learn/russian", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-14T07:07:48Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ивашковская Ирина Васильевна", 
    "description": "Любая компания, независимо от ее правовой формы, обладает стоимостью, и все принимаемые в ней решения влияют на ее величину. В этом курсе мы ставим задачу научить Вас инструментам мониторинга изменений в фундаментальной стоимости компании. Курс завершает специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и необходим для выполнения заключительного прикладного проекта “Мастерство создания стоимости компании”.\n\nКурс полезен тем, кто уже создал бизнес или обдумывает предпринимательскую концепцию создания новой компании, а также специалистам, работающим в управленческой команде в бизнесе.\nВ результате успешного освоения курса Вы будете знать, как определить вклад управленческих решений менеджеров в приращение или падение стоимости компании; каким образом советы директоров компаний могут увеличивать ее стоимость; какие инструменты нужно использовать для оперативной оценки текущей деятельности компании по критерию приращения ее стоимости и мониторинга ее создания.\n\nВ ходе курса вас ждут лекции и интервью с профессиональным консультантами, работающими  в международном стратегическом и финансовом консалтинге России. По итогам каждой из 4-х недель Вы выполняете оценочное задание и по итогам курса - заключительное экзаменационное задание.", 
    "end_date": null, 
    "title": "Управление стоимостью компании", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/a2/53a7b0bab011e582646f0314e1b02c/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/mastering-value-creation", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-20T05:49:33Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Станислав Козел, Владимир Овчинкин, Андрей Гавриков", 
    "description": "Что такое физика и зачем она нужна? Некоторые люди никогда не задаются таким вопросом. Некоторые считают, что физика нужна исключительно для создания различных «девайсов», например холодильников или мобильных телефонов. И они в чем-то правы, ведь сказал же Оскар Уайльд, что «Комфорт – это единственное, что может нам дать цивилизация».\n\nДля нас физика – это умение видеть и понимать окружающий мир, возможность творить то, о чем раньше даже и мечтать было сложно. Мы считаем, что для дальнейшего прогресса человечества необходимы ученые-физики, инженеры-физики и просто образованные люди. Мы готовы делиться нашими знаниями. \n\nПредлагаемый курс «Электростатика и магнитостатика» посвящен рассмотрению ключевых понятий этой области: уравнений Максвелла, записанных в статическом случае как внутри вещества, так и вне его, энергетических подходов для вычисления сил, действующих на объекты, находящиеся электростатическом или магнитном поле, а также рассмотрение свойств для постоянных токов.\n\nСразу заметим – курс не очень простой, для его освоения слушателям необходимо владеть знаниями по физике в объеме школьной программы, основами дифференциального и интегрального исчисления и основами векторного исчисления.\n\nВ течение 10 недель вам будут предлагаться для изучения видеолекции, физические демонстрации и семинары с разбором задач. Основные формулы и тезисы лекций представлены в виде кратких конспектов. Каждая учебная неделя содержит тест и 4 задачи для самостоятельного решения. Экзаменационные недели включают тест и 5 задач.\n\nВ конце курса у слушателя есть возможность решить дополнительную контрольную работу из трёх задач повышенной сложности с ограничением по времени.", 
    "end_date": null, 
    "title": "Электростатика и магнитостатика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ab/bd8300c63611e5850fe97efdde7980/IH7rGUn1.jpg", 
    "course_url": "https://en.coursera.org/learn/electrostatica", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-07T08:25:02Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Bertrand Badie, Marie-Françoise Durand, Jana Jabbour", 
    "description": "حول هذه المادة التدريسية\n\nلكي نفسّر كيف أن العولمة تعيد بناء السياسات العامة والسلوكيات الاجتماعية، ندرس التبادلات والتفاعلات بين مختلف الجهات الفاعلة السياسية والاقتصادية، والاجتماعية - العامة أو الخاصة، الفردية أو الجماعية- والطريقة التي تعيد فيها صياغة العلاقات الدولية. هذه المادة التدريسية تعتمد على المقاربات السوسيولوجية والتاريخية الفرنسية العائدة للعلاقات الدولية. وهي متوفرة  أيضاً في نسخة باللغة الإنجليزية (www.coursera.org/learn/global-studies)، وأخرى باللغة الفرنسية (www.coursera.org/learn/espace-mondial-fr)", 
    "end_date": null, 
    "title": "\"Espace mondial\" الرؤية الفرنسية للدراسات العالمية", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Sciences Po"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/cf/81b2307c8b11e5a83fd7f8bdaf4ee0/EM_2015_AR.jpg", 
    "course_url": "https://en.coursera.org/learn/espace-mondial-ar", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-23T03:34:20Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Ивашковская Ирина Васильевна, Тихомиров Дмитрий Викторович, Кузубов Сергей Анатольевич", 
    "description": "В этом курсе вы получите представление о том, как определить стоимость компании, чтобы использовать  эти знания в управленческих решениях, и почему такие навыки необходимы менеджерам, аналитикам, предпринимателям, собственникам бизнеса. Курс открывает специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и заключительный прикладной проект “Мастерство создания стоимости компании”\n\nКурс будет полезен тем, кто стремится получить новые навыки анализа бизнеса, нарастить мастерство управления, создать успешный бизнес, усилить профессиональные позиции в аналитической, управленческой и в предпринимательской среде.\n\nПосле успешного завершения курса Вы будете:\n- уметь оценивать деятельность компании с помощью финансовой отчётности;\n- знать, каковы границы ее применения и в чем состоят радикальные отличия финансовой модели анализа компании от бухгалтерской;\n- уметь определять потоки свободных денежных средств компании и использовать драйверы стоимости для расчета фундаментальной стоимости компании  методом дисконтируемого потока денежных средств;\n- уметь оценивать стоимость компании с помощью рыночных сравнений;\n- понимать специфику  оценки стоимости в различных отраслях бизнеса.\n\nДля эффективного освоения курса Вам полезны начальные знания бухгалтерского учета и основ финансов. По итогам каждой недели Вам потребуется выполнять контрольные задания, а по окончании курса - итоговый экзамен. Курс ведут преподаватели и профессиональный консультант в области оценки.", 
    "end_date": null, 
    "title": "Оценка стоимости компании", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/50/6844c0a59c11e58b7829d2abc9fe56/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/ocenka-stoimosti-kompanii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-09T06:15:34Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Алексей Перепелкин, Дмитрий Савицкий", 
    "description": "На протяжении тысячелетий люди усовершенствовали орудия труда, изучали силы природы и подчиняли их себе, использовали их энергию для работы машин, а в прошлом веке создали машины, которые могут управлять другими машинами. Теперь создание устройств, которые взаимодействуют с физическим миром, доступно даже школьнику. \n\nНаш курс состоит из серии практических задач про создание вещей, которые работают сами: изучают мир, принимают решения и действуют – двигаются, обмениваются данными друг с другом и с человеком, управляют другими устройствами. Мы покажем, как собирать эти устройства и программировать их, используя в качестве основы платформу Arduino.\n\nПройдя этот курс, вы сможете создавать устройства, которые считывают данные о внешнем мире с разнообразных датчиков, обрабатывают информацию, получают и отправляют данные на ПК, в Интернет, на мобильные устройства, управляют индикацией и движением. Создание устройств будет включать проектирование, изучение компонентов, сборку схем, написание программ, диагностику. Попутно с созданием самих устройств вы сделаете визуализацию на ПК, создадите веб-страницу, которую будет демонстрировать одно из ваших устройств, а также разберетесь с устройством и работой FDM 3D-принтера. \n\nПомимо тех, кто увлекается робототехникой или стремится расширить кругозор и свои навыки, курс будет полезен всем, кто сталкивается с задачами бытовой и производственной автоматизации, а также занимается промышленным дизайном, рекламой и искусством.\n\nКурс не требует специальных знаний у слушателей, доступен даже ученикам старших классов средней школы. Плюсом будут навыки программирования и владение английским языком на уровне чтения технической документации, однако обязательным это не является.\n\nВесь курс посвящен практике и самым лучшим решением для вас будет раздобыть электронику, повторять показанные примеры и экспериментировать самостоятельно.\n\nПриобрести комплекты можно здесь – kits.cyberphysica.ru", 
    "end_date": null, 
    "title": "Строим роботов и другие устройства на Arduino. От светофора до 3D-принтера", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/60/95b9a0684711e5835df783b40774dc/1.png", 
    "course_url": "https://en.coursera.org/learn/roboty-arduino", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-20T07:07:43Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Райгородский, Максим Жуковский", 
    "description": "Теория вероятностей - это, вне всякого сомнения, один из самых важных и богатых приложениями разделов современной математики.\n\nС помощью методов этой замечательной науки можно как оценивать классические вероятности выигрышных стратегий в азартных играх, так и решать весьма серьезные прикладные задачи, возникающие буквально в каждой области науки. В нашем курсе мы познакомим слушателей прежде всего с самыми основами предмета. И сделаем мы это в уникальном формате - иллюстрируя вероятностные объекты и методы на примерах решения с их помощью комбинаторных задач. Суть в том, что, конечно, в базовой вероятности много комбинаторики, и это все знают; мы же расскажем не только об этом, но и о том, как, наоборот, вероятностные методы позволяют работать с комбинаторными задачами. Это позволит нам впоследствии выйти на приложения вероятности в теории графов, случайных графов и, наконец, веб-графов и прочих сложных сетей. Также в рамках курса мы оторвемся от чисто комбинаторных интерпретаций и обсудим более общие вероятностные модели. Но интуиция все равно сохранится, и в этой комбинаторной подоплеке уникальность курса.\n\nКурс построен так, что будет по плечу даже тем, кто изучал математику последний раз только в школе. Тем не менее, так как для понимания курса необходимы знания основ комбинаторики, мы рекомендуем пройти наш курс по комбинаторике прежде чем прослушивать данный курс.\n\nВнутри курса также все просто – каждую неделю вас ждут видеолекции и проверочные задания, которые нужно выполнять в срок. В конце – итоговая проверочная работа. Студенты, которые набрали достаточное количество баллов, смогут получить сертификат.", 
    "end_date": null, 
    "title": "Теория вероятностей для начинающих", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/9c/6d5ab05b0311e58c5b5104eb6e83b9/brobth.jpg", 
    "course_url": "https://en.coursera.org/learn/probability-theory-basics", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-09-14T04:04:19Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Панебратцев Юрий Анатольевич, Гервидс Валериан Иванович, Клячин Николай Альбертович , Калашников Николай Павлович", 
    "description": "Наглядно – интересно – просто – понятно!\nДанный курс представляет собой серию физических опытов и экспериментов по теории колебаний и основам молекулярной физики. Демонстрацию физических явлений проводит легендарная личность, незаурядный преподаватель, доцент кафедры общей физики НИЯУ МИФИ — Валериан Иванович Гервидс, который доступно и наглядно объясняет основные принципы и законы общей физики. \n\nЗачем учить этот курс?\n• Физика – наука экспериментальная. Лучше один раз увидеть, чем сто раз услышать или прочитать! \n• Именно эксперименты позволяют продемонстрировать и легко понять и простые, и сложные аспекты, которые традиционно преподаются в виде теоретического материала и математических моделей\n• Курс поможет Вам научиться использовать: \n   o эксперимент как способ постановки вопроса, \n   o эксперимент как инструмент изучения физического явления\n   o эксперимент как  форму ответа на вопрос\n• Очень часто достаточно «простые» физические вопросы имеют неожиданные ответы, которые зависят от конкретных условий проведения эксперимента. Демонстрация таких опытов и объяснение полученных в них результатов могут оказаться чрезвычайно интересными\n• Вы сможете увидеть применение изучаемых физических явлений в жизни, в технике и в быту\n• Изучая этот курс, вы восполните нехватку времени на экспериментальную, «живую» физику, которая ощущается в обычном учебном процесс\n\nЧему учит этот курс?\n• Пониманию широкого круга как простых, так и сложных физических явлений и процессов по тематике соответствующих разделов\n• Применению физических закономерностей для анализа различных физических явлений и процессов \n• Навыкам  использования эксперимента\n• Базовым знаниям по физике будущих инженеров и специалистов в различных областях деятельности.\n\nДля кого этот курс?\n• Для тех, кто изучает физику, и хочет прояснить для себя различные вопросы (в школе, в вузе)\n• Для тех, кто преподает физику (в школе, в вузе)\n• Для тех, кто использует физику в своем рабочем процессе (инженеры, программисты и т.д.)\n• Для тех, кому это просто интересно", 
    "end_date": null, 
    "title": "Физика в опытах. Часть 3. Колебания и молекулярная физика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Nuclear University MEPhI"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/c8/860a40a3f911e5b65225729526771e/logo_picture_kolebaniya.jpg", 
    "course_url": "https://en.coursera.org/learn/molekulyarnaya-fizika", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-04-20T09:35:25Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Гульнафист Алтаевна Окушова (Gulnafist A. Okushova), Юлия Михайловна Стаховская (Yulia M. Stakhovskaya), Андрей Петрович Глухов (Andrey P. Glukhov)", 
    "description": "Социальные платформы можно уподобить волшебной сцене, где каждый желающий, используя готовый реквизит и подмостки, может поставить свою постановку почти бесплатно и пригласить зрителей-юзеров с неплохими шансами превратить их в друзей бренда. Вы можете разыграть целое представление по вовлечению пользователя в Ваш бизнес. \nТеперь каждый предприниматель, используя инструменты инфографики, цифрового дизайна, контент- и комьюнити-менеджмента, может стать одновременно драматургом-сценаристом, режиссёром, художником-декоратором и актёром  шоу, разыгрываемого перед цифровой публикой. \nНаш курс как раз об этом – как сделать так, чтобы Ваша цифровая бизнес-постановка снискала успех у зрителя, голосующего за неё звонкой монетой. В каком-то смысле это курс драматургии и режиссёрского мастерства, но не обычного, а цифрового. \nВ наших лекциях мы расскажем Вам о новом герое этой сцены – коллаборативной социалномике или экономике участия, новом зрителе – аудитории социальных платформ, новых подмостках – многообразии социальных платформ, о том, что происходит за кулисами - как «мониторят» социальные сети,  о новой режиссуре как построении стратегии присутствия и продвижения в социальных сетях и новой игре, актерах и помощниках сцены – дизайнерах, копирайтерах, контент- и комьюнити-менеджерах.\nКурс является составной частью общей специализации «Цифровой SMM-проект: виртуальная платформа для бизнес-коммуникаций», посвящен основам SMM-маркетинга и предназначен для слушателей, нацеленных на использование социальных медиа в своей профессиональной деятельности и своих профессиональных бизнес-коммуникациях в рамках продвижения своего цифрового проекта. \nЦель данного курса – обучить слушателей основам SMM-маркетинга, выработав у них навыки оценки и использования ведущих трендов в области сетевого продвижения, сегментирования и таргетирования аудитории, выбора сетевых глобальных и локальных платформ и Web-аналитики. \nКурс включает в себя 4 модуля, в рамках которых Вы узнаете о новых социальных трендах в бизнесе, появлении викиномики (или социалномики), получите опыт использования в маркетинговых коммуникациях краудсорсинговых и коворкинговых технологий (1 модуль), приобретете компетенции анализа целевой аудитории с использованием сегментации по различным параметрам Вашей аудитории на социальных площадках, ее гипертаргетирования с помощью встроенных сервисов платформ (2 модуль), узнаете о маркетинговых особенностях использования некоторых из основных популярных социальных платформ (блог-платформы (LJ, Blogger.com), Facebook, Twitter, Linkedln, Instagram, Pinterest) и приобретете начальные навыки разработки, наполнения и публикации групп и пабликов на них (3 модуль) и, наконец, получите базовые компетенции по использованию встроенных сервисов статистики и сервисов автоматического мониторинга сетей (4 модуль). \nПо окончании курса предполагается выполнение промежуточной проектной работы слушателями специализации, включающей оценку и таргетирование аудитории цифрового проекта, выбор сетевых платформ для будущего проекта и конкурентный анализ на основе мониторинга сетей.\nДля освоения курса требуются навыки владения персональным компьютером на уровне рядового пользователя, желателен некоторый опыт использования в организации личных коммуникаций наиболее известных популярных социальных сетей знакомств и общения (таких как «ВКонтакте», «Facebook», «Одноклассники»), начальный уровень знаний (на уровне знакомства с ключевыми понятиями и бизнес-процессами) в области маркетинга и организации маркетинговых коммуникаций. В процессе освоения курса Вы приобретете умение оценивать достоинства, возможности и недостатки, риски  переноса бизнеса на социальные платформы. Курс поможет Вам лучше разбираться в вопросах сегментации Вашей целевой аудитории на социальных платформах и расскажет о возможностях ее гипертаргетирования. Вы узнаете об особенностях и нюансах маркетингового использования различных социальных платформ и научитесь создавать на них группы и паблики с целью продвижения Вашего бизнеса. Вы получите также информацию об использовании встроенных на платформах инструментов статистики и систем автоматического мониторинга социальных сетей, усвоите начальные навыки их использования в конкурентной разведке и оценке эффективности.", 
    "end_date": null, 
    "title": "Основы SMM: тренды, аудитории, платформы, аналитика", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/7e/d07400231311e6b427dd6d5b41c878/_________SMM_____-_2-_0_00_11_20_.png", 
    "course_url": "https://en.coursera.org/learn/smm-osnovy", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-21T01:56:01Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Столяров Андрей Иванович", 
    "description": "Рынок облигаций представляется частному инвестору сложным и запутанным. На нем торгуется огромное количество инструментов, которые сначала кажутся непонятными. Тем не менее, этот рынок дает огромные возможности инвестору как для диверсификации вложений и гарантирования дохода, когда на рынке нет достойных инвестиционных идей, так и для получения спекулятивного дохода.\n\nЦЕЛЬ - получение знаний об облигационном рынке и приобретение навыков расчета доходности и оценки рисков инвестиций в различные долговые инструменты. \n\nПосле изучения курса вы сможете: \n- самостоятельно находить необходимую информацию для расчета потенциального дохода и рисков предполагаемой операции, \n- сравнивать выгоду от покупки различных долговых финансовых инструментов и \n- выбирать для инвестиций наиболее подходящий вариант, основываясь на достоверных расчетах. \n\nКроме инструментария и методологии для успешного старта инвестиционной деятельности курс содержит ряд практических примеров, которые позволят вам ознакомиться с рынком облигаций в реальности.\n\nВы получите возможность понять механизм ценообразования на рынке облигаций, узнаете, как можно зарабатывать на этом рынке, ориентируясь на консервативную или спекулятивную стратегию в зависимости от своих собственных предпочтений. \n\nБольшой и сложный рынок облигаций станет вам понятным!", 
    "end_date": null, 
    "title": "Инвестиции в облигации", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/37/cf91e0b89b11e5b3847b93647b6493/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/investicii-obligacii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-14T02:14:44Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Столяров Андрей Иванович, Теплова Тамара Викторовна, Берзон Николай Иосифович", 
    "description": "Слушатели курса освоят навыки оценивания доходности и риска по портфелям финансовых активов, смогут реализовать принципы расчета и работы с такими традиционными показателями оценки эффективности инвестирования как коэффициенты Шарпа, Сортино и др. \nПримеры российской и зарубежной практики позволят вам сопоставлять активные и пассивные стратегии по привлекательности (инвестирование через паевые инвестиционные фонды (ПИФы) и другие программы взаимного инвестирования). После прохождения курса вы сумеете аргументировано выбрать схему долгосрочного портфельного инвестирования через пенсионные и страховые программы. Анализ ETF позволит вам оценить преимущества инвестирования в различные индексы (как уже сформированные портфели). \nСопоставление зарубежных финансовых рынков позволит вам расширить портфель включением активов иностранных компаний и выстроить с учетом налоговой нагрузки и комиссионных прибыльную инвестиционную стратегию через отбор активов в портфель. \n\nДля успешного освоения курса понадобятся базовые знания в статистике и математике, но достаточно будет предварительного освоения 3 курса специализации - «Инвестирование в акции» https://www.coursera.org/learn/investing-in-shares", 
    "end_date": null, 
    "title": "Портфельные инвестиции: активные и пассивные стратегии", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/2a/baebd0b89111e58fef1bd93fb2110a/9zDdStWNL2Y.jpg", 
    "course_url": "https://en.coursera.org/learn/portfelnyye-investitsii", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-09T13:02:47Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Петрович Глухов (Andrey P. Glukhov), Наталья Андреевна Карнаухова (Natalya A. Karnaukhova)", 
    "description": "Передвигаться на лошадях прекрасно и романтично, у локомотива и автомобиля масса недостатков, но современный человек  все-таки предпочитает использовать их для своей мобильности. Эпистолярный жанр является высоким искусством, но мало кому сегодня придет в голову отправлять письмо по почте, вместо того, чтобы воспользоваться e-mail или теми же социальными сетями. С прежними платформами бизнеса та же проблема – отставания от времени: скорость коммуникаций в современном мире растет по экспоненте и старые платформы уже не удовлетворяют требованиям ускоряющихся бизнес-коммуникаций. Социальные медиа – это дорога с «двусторонним движением», где миллиарды людей проводят массу времени, и они просто обязаны перевернуть бизнес и существующие бизнес-модели. Социальность как появление технологических возможностей-платформ для участия, сотрудничества и коммуникации – это всерьез и надолго, это долгоиграющий тренд; поэтому бизнес также будет становиться социальным во всех смыслах этого слова. Наш курс о том, как используя различные SMM-активности (дизайн, контент-менеджмент, комьюнити-менеджмент, рекламу) продвигать Ваш бизнес через социальные сети.\nКурс является составной частью общей специализации «Цифровой SMM-проект: виртуальная платформа для бизнес-коммуникаций», посвящен организации SMM-кампании на социальных платформах и предназначен для слушателей, нацеленных на использование социальных медиа в своей профессиональной деятельности и своих профессиональных бизнес-коммуникациях в рамках продвижения своего цифрового проекта. \nЦель данного курса – обучить, начальным навыкам продвижения собственного продукта (личный аккаунт/услуга/товар/компания/бренд, блог) и другим видам маркетинговых коммуникаций (включая брендинг, мониторинг, клиентскую поддержку и рекрутинг) с помощью социальных медиа. \nКурс включает в себя 4 модуля, в рамках которых последовательно описываются цели и направления использования социальных платформ в рамках маркетинговых коммуникаций (1 модуль), раскрывается стратегическая последовательность шагов по реализации цифрового проекта в социальных медиа (2 модуль), предлагается тренинг деятельности в SMM по вовлечению аудитории и продвижению цифрового проекта (графический дизайн, контент- менеджмент, коммьюнити-менеджмент, продвижение) (3 модуль), описываются форматы организации SMM-кампаний и рынок российских SMM-услуг (4 модуль). \nПо окончании курса предполагается выполнение итоговой проектной работы, включающей разработку, создание, продвижение и вовлечение аудитории в цифровой проект слушателя специализации с оценкой его полноты, обоснованности, креативности и практической эффективности командой коучеров курса.", 
    "end_date": null, 
    "title": "SMM-кампания: цели, стратегия, алгоритм, SMM-активности", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/97/c41310138011e6a053c1fc50b1e8d2/__________00000.png", 
    "course_url": "https://en.coursera.org/learn/smm-campaniya", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-10T05:21:46Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "10028746", 
    "description": "Стандартный курс линейной алгебры, содержащий все необходимые для статистики и многомерного анализа приложения и алгоритмы, но не всегда содержащий подробные доказательства.\n\nМы введём понятие линейности и линейного пространства, конечномерного пространства, линейного функционала, линейного оператора. Научимся оперировать матрицами, находить удачные базисы для линейных операторов (диагонализировать матрицу, если это возможно, найти жорданов базис в случае пространств небольшой размерности). Мы обсудим теорему Перрона-Фробениуса и ее приложение к индексированию страниц в интернете. Мы будем изучать квадратичные формы и их приведение к главным осям.", 
    "end_date": null, 
    "title": "Линейная алгебра (Linear Algebra)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/55/1b2e705dc611e4b2ae9b6d330ca688/LA.png", 
    "course_url": "https://en.coursera.org/learn/algebra-lineynaya", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-30T11:44:37Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Виктор Кантор, Эмели Драль, Константин Воронцов", 
    "description": "Обучение на размеченных данных или обучение с учителем – это наиболее распространенный класс задач машинного обучения. К нему относятся те задачи, где нужно научиться предсказывать некоторую величину для любого объекта, имея конечное число примеров. Это может быть предсказание уровня пробок на участке дороги, определение возраста пользователя по его действиям в интернете, предсказание цены, по которой будет куплена подержанная машина.\n\nВ этом курсе вы научитесь формулировать и, конечно, решать такие задачи. В центре нашего внимания будут успешно применяемые на практике алгоритмы классификации и регрессии: линейные модели, нейронные сети, решающие деревья и так далее. Особый акцент мы сделаем на такой мощной технике как построение композиций, которая позволяет существенно повысить качество отдельных алгоритмов и широко используется при решении прикладных задач. В частности, мы узнаем про случайные леса и про метод градиентного бустинга.\n\nПостроение предсказывающих алгоритмов — это лишь часть работы при решении задачи анализа данных. Мы разберемся и с другими этапами: оценивание обобщающей способности алгоритмов, подбор параметров модели, выбор и подсчет метрик качества.", 
    "end_date": null, 
    "title": "Обучение на размеченных данных", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/e6/cd8dc0b0dd11e5bda4c35792983a0c/800x800-02.jpg", 
    "course_url": "https://en.coursera.org/learn/supervised-learning", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-03-22T01:12:05Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Dmitry Dagaev", 
    "description": "В течение жизни мы постоянно взаимодействуем с другими людьми. Маленькие дети, пытаясь добиться того, чтобы родители купили понравившуюся конфетку, часто шантажируют родителей своими слезами. Принимая решение заплакать, ребенок рискует — он не знает, как поведут себя папа с мамой. В чуть более взрослом возрасте абитуриенты, выбирающие вуз, принимают сложное решение о том, в какие университеты подать документы. Ошибка может стоить дорого: при неправильной стратегии можно оказаться в слабом университете или вообще остаться без заветного студенческого билета. Окончив вуз, юноши и девушки начинают искать работу. Перед интервью с работодателем они штудируют статьи в интернете о том, что можно и чего нельзя говорить на интервью, — они пытаются найти наилучшую стратегию своего поведения, исходя из ожиданий компании, в которую они устраиваются. Все эти ситуации объединяет то, что решения, которые принимают одни люди, оказывают влияние на других людей. Такие взаимодействия называются стратегическими. Именно их изучает теория игр.\n\nЧтобы проанализировать ту или иную реальную жизненную ситуацию стратегического взаимодействия и найти оптимальный вариант поведения в ней, необходимо сделать две вещи. Во-первых, необходимо формально записать ситуацию на языке теории игр, то есть создать модель (игру). Во-вторых, после того как модель (игра) составлена, ее необходимо решить. Этому мы будем учиться в течение курса. Мы разберем основные виды игр (одновременные и последовательные, с совершенной и несовершенной информацией, коалиционные и некоалиционные), приведем способы их решения и обсудим их на многочисленных примерах.\n\nКурс будет интересен желающим разобраться в том, как конкурируют друг с другом несколько компаний и можно ли гарантированно выиграть в шашки, есть ли смысл угрожать на переговорах и с кем стоит объединяться в коалиции в парламенте.\n\nFAQ\n\nВ: Требуется ли предварительная подготовка для прохождения курса?\nО: Курс является базовым, поэтому он не требует специальной подготовки. Для его успешного освоения достаточно уверенных знаний курса математики в объеме школьной программы. В одном-двух примерах могут пригодиться знания начал математического анализа (дифференцирование функций одной переменной, необходимое условие экстремума) и знания начал теории вероятностей (понятие математического ожидания случайной величины).\n\nВ: Что требуется для успешного окончания курса?\nО: Итоговая оценка за курс складывается из результатов 10 оцениваемых тестов. Для успешного окончания курса необходимо дать не менее 80 % правильных ответов на каждый из этих тестов.", 
    "end_date": null, 
    "title": "Теория игр (Game Theory)", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/08/eedfc0a4fa11e5a894ad7ff73294ef/logo.png", 
    "course_url": "https://en.coursera.org/learn/game-theory", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-01-21T04:24:23Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Райгородский, Андрей Купавский", 
    "description": "Среди жителей Кёнигсберга была распространена такая практическая головоломка: можно ли пройти по всем мостам через реку Преголя, не проходя ни по одному из них дважды? В 1736 году выдающийся математик Леонард Эйлер заинтересовался задачей и в письме другу привел строгое доказательство того, что сделать это невозможно. В том же году он доказал замечательную формулу, которая связывает число вершин, граней и ребер многогранника в трехмерном пространстве. Формула таинственным образом верна и для графов, которые называются \"планарными\". Эти два результата заложили основу теории графов и неплохо иллюстрируют направление ее развития по сей день. \n\nГраф как математический объект оказался полезным во многих теоретических и практических задачах. Наверное, дело в том, что сложность его структуры хорошо отвечает возможностям нашего мозга: это структура наглядная и понятно устроенная, но, с другой стороны, достаточно богатая, чтобы улавливать многие нетривиальные явления. Если говорить о приложениях, то, конечно, сразу же на ум приходят большие сети: Интернет, карта дорог, покрытие мобильной связи и т.п. В основах поисковых машин, таких, как Yandex и Google, лежат алгоритмы на графах. Помимо computer science, графы активно используются в биоинформатике, химии, социологии.\n\nЭтот курс служит введением в современную теорию графов. Мы, конечно, обсудим классические задачи, но и поговорим про более недавние результаты и тенденции, например, про экстремальную теорию графов. \n\nМатериал изложен с самых основ и на доступном языке. Целью этого курса является не только познакомить вас с вопросами и методами теории графов, но и развить у неподготовленных слушателей культуру математического мышления. Поэтому курс доступен широкому кругу слушателей. Для освоения материала будет достаточно знания математики на хорошем школьном уровне и базовых знаний комбинаторики.\n\nКурс состоит из 7 учебных недель и экзамена. Для успешного решения большинства задач из тестов достаточно освоить материал, рассказанный на лекциях. На семинарах разбираются и более сложные задачи, которые смогут заинтересовать слушателя, уже знакомого с основами теории графов.", 
    "end_date": null, 
    "title": "Теория графов", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/1c/7a11e071a611e597e6ed05f6c41ffb/logo.jpg", 
    "course_url": "https://en.coursera.org/learn/teoriya-grafov", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-31T06:24:39Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Иван Иванович Родионов", 
    "description": "Любой растущей компании могут потребоваться инвестиции для финансирования дальнейшего роста. Для решения этой задачи в условиях нарастания неустойчивости деловой среды Вам понадобится понимание механизмов работы венчурной индустрии. Курс входит в специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и заключительный прикладной проект “Мастерство создания стоимости компании”.\n\nЭтот курс позволит вам узнать:\n- как финансируется бизнес на этапе роста, \n- почему появились и как работают венчурные фонды и фонды прямых инвестиций,\n- кого они хотят видеть в качестве объекта инвестирования,\n- как готовить заявку на инвестиции и как она рассматривается фондом,\n- как фонд и компания сотрудничают в увеличении стоимости бизнеса,\n- когда и как осуществляется капитализация этой стоимости путем выхода венчурного инвестора из компании.\n\nДля освоения курса Вам потребуются знания финансовой отчетности, оценки стоимости и эффективности инвестиционных проектов, оптимизации структуры источников финансирования, которые предлагаются в курсах 1-3 специализации и уметь работать с Excel.\n\nВ ходе курса Вас ждут интересные лекции и увлекательные задания.\nКаждое из 4-х занятий предполагает оценочные тесты и заключительное экзаменационное задание.", 
    "end_date": null, 
    "title": "Венчурный капитал", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/20/5469d0a58311e58be3bf4fd50e0078/____-___________-03.png", 
    "course_url": "https://en.coursera.org/learn/venchurnyj-kapital", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-06T22:25:33Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Евгений Рябенко, Евгений Соколов, Виктор Кантор, Эмели Драль", 
    "description": "Анализ данных и машинное обучение существенно опираются на результаты из математического анализа, линейной алгебры, методов оптимизации, теории вероятностей. Без фундаментальных знаний по этим наукам невозможно понимать, как устроены методы анализа данных. Данный курс направлен на то, чтобы сформировать этот фундамент. Мы обойдёмся без сложных формул и доказательств и сделаем упор на интерпретации и понимании смысла математических понятий и объектов. \n\nДля успешного применения методов анализа данных нужно уметь программировать. Фактическим стандартом для этого в наши дни является язык Python. В данном курсе мы предлагаем познакомиться с его синтаксисом, а также научиться работать с его основными библиотеками, полезными для анализа данных.\n\nВ этом курсе вы познакомитесь с фундаментальными математическими понятиями, необходимыми для анализа данных, и получите начальный навык программирования на Python. Курс состоит из двух больших частей. Первая часть курса – практическая, она посвящена языку программирования Python. Вы познакомитесь с синтаксисом и идеологией языка, научитесь писать простые программы. Также вы узнаете о библиотеках, которые часто применяются на практике для анализе данных, например, NumPy, SciPy, Matplotlib и Pandas. Вторая часть курса посвящена таким разделам математики как линейная алгебра, математический анализ, методы оптимизации и теория вероятностей. При этом, упор делается на разъяснение математических понятий и их применение на практике, а не на вывод сложных формул и доказательство теорем.", 
    "end_date": null, 
    "title": "Математика и Python для анализа данных", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "Moscow Institute of Physics and Technology"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d7/c45bf0b0d911e5965623dd71776f15/800x800-01.jpg", 
    "course_url": "https://en.coursera.org/learn/mathematics-and-python", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-02-09T10:55:42Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Петрович Глухов (Andrey P. Glukhov), Гульнафист Алтаевна Окушова (Gulnafist A. Okushova), Юлия Михайловна Стаховская (Yulia M. Stakhovskaya)", 
    "description": "Мир сильно изменился с тех времен, когда люди общались между собою с помощью писем на бумаге и с помощью голоса, теперь все мы расставляем кому-то сети отношений и попадаем в них сами, все мы отныне живем в Сети Глобальной паутины. \nВ этом новом мире сетей старые приемы налаживания отношений не работают: журналистов печатных изданий не читают в бумажном варианте, маркетологи, делающие ставку только на оффлайн-работу, разоряют компании, пиарщики и рекламисты лишаются оффлайн-аудитории, HR-специалист, не умеющий работать в сетях, не получает достоверной информации о своих кандидатах.\nЕдинственный выход для профессионала: идти в Сеть, «ищите и обрящете»!\n\nНаш курс поможет вам узнать: \n1.\tКакие сети существуют и как меняется психология «человека виртуально-сетевого».\n2.\tПочему блоггеры испытывают от своей деятельности блОженство и что такое гражданская журналистика.\n3.\tКак работает френд-бизнес и как компании делают из потребителей союзников, советчиков и сотрудников.\n4.\tКак найти работу или работника в Сети.\n \nКурс является составной частью общей специализации «Цифровой SMM-проект: виртуальная платформа для бизнес-коммуникаций» и рассчитан на то, чтобы дать базовые знания и навыки использования социальных сетей и социальных медиа в профессиональных коммуникациях журналистов, маркетологов, пиарщиков и рекламистов, рекрутеров и образовательных менеджеров. \nВ процессе изучения курса Вы сможете получить первичное представление об интегрированности социальных сетей во все сферы деятельности современного информационного общества и узнать об использовании социальных сетей  в области журналистики в новых медиа, маркетинга, пиар и рекламы, рекрутинга, организации молодежных мероприятий и дистанционного образования.", 
    "end_date": null, 
    "title": "Платформы социальных медиа: история, аудитории, возможности использования", 
    "price": 0, 
    "topic_name": [], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/8f/fa41400ac011e6bb4fe9b63eb1e91e/Comp-1-_0-00-08-19_.png", 
    "course_url": "https://en.coursera.org/learn/smm-platformy", 
    "currency": null, 
    "subject_name": [], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-05-23T01:18:12Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Oleg Zamulin", 
    "description": "Курс посвящен изучению макроэкономических вопросов, таких как долгосрочный рост, циклические колебания экономики и стабилизационная политика государства.\n\nЦелью курса является знакомство слушателей с основными понятиями макроэкономики, с базовыми моделями и принципами, которые используются при анализе текущего состояния экономики той или иной страны, что позволит самостоятельно ориентироваться в происходящих процессах и явлениях, а также проводить оценку эффективности и необходимости проводимой государством макроэкономической политики.\n\nДанный курс покрывает на базовом уровне все основные темы макроэкономики. Примерно две трети курса посвящены анализу общего равновесия на рынках труда, заемных средств, финансовых, денежных, товарных рынках, а также международных потоков капитала. Изучается долгосрочный экономический рост, идущий за счет накопления капитальных мощностей и технического прогресса.  Вторая часть курса посвящена изучению природы краткосрочных колебаний вокруг долгосрочной траектории роста, таким как финансовый кризис и мировая рецессия 2008-2009 годов. Обсуждаются причины подобных спадов, а также оптимальная стабилизационная политика государства, призванная либо предотвращать подобные катаклизмы, либо сглаживать последствия от них.\n\nДля успешного прохождения курса желательно (но не обязательно) иметь базовые знания по микроэкономике.", 
    "end_date": null, 
    "title": "Макроэкономика (Macroeconomics)", 
    "price": 0, 
    "topic_name": [
      "economics"
    ], 
    "institution_name": [
      "Higher School of Economics"
    ], 
    "commitment": null, 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/6a/a7f4946004bdf4a99193647b5061ff/macroeconomics-_3_.jpg", 
    "course_url": "https://en.coursera.org/learn/makrojekonomika", 
    "currency": null, 
    "subject_name": [
      "social-sciences"
    ], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2016-06-02T02:56:31Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "9772840", 
    "description": "Працюйте розумніше, а не більше\nВи зможете здобути і застосувати ваші знання та розуміння особистої та професійної обізнаності, організованості та виконання зобов’язань, а також використовувати інструменти, методи та прийоми, про які ви дізналися, для постановки цілей та пріоритетів, планування та делегування для подолання управлінських викликів та покращення продуктивності. \n\nThis course is translated by the Ukrainian mobile network operator, lifecell.", 
    "end_date": null, 
    "title": "Працюйте розумніше, а не більше: управління часом для особистої та професійної продуктивності", 
    "price": 0, 
    "topic_name": [
      "business-essentials"
    ], 
    "institution_name": [
      "University of California, Irvine"
    ], 
    "commitment": "4-8 hours of videos, readings, and quizzes", 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/ee/5c8f8049b111e4bc80b986c176101c/Time-Mangagement-Course-2.jpg", 
    "course_url": "https://en.coursera.org/learn/upravlinnya-chasom", 
    "currency": null, 
    "subject_name": [
      "business"
    ], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-12-19T07:27:56Z"
  }, 
  {
    "selfpaced": false, 
    "instructors": "Андрей Петрович Глухов (Andrey P. Glukhov), Юлия Михайловна Стаховская (Yulia M. Stakhovskaya), Гульнафист Алтаевна Окушова (Gulnafist A. Okushova)", 
    "description": "Мир сильно изменился с тех времен, когда люди общались между собою с помощью писем на бумаге и с помощью голоса, теперь все мы, расставляем кому-то сети отношений и попадаем в них сами, все мы отныне живем в Сети Глобальной паутины.\nВ этом новом мире сетей старые приемы налаживания отношений не работают: журналистов печатных изданий не читают в бумажном варианте, маркетологи, делающие ставку только на офлайн-работу, разоряют компании, пиарщики и рекламисты лишаются офлайн-аудитории, HR-специалист, не умеющий работать в сетях, не получает достоверной информации о своих кандидатах.\nЕдинственный выход для профессионала: идти в Сеть, «ищите и обрящете»!\n\nНаш курс поможет вам узнать:\n1.\tКакие сети существуют и как меняется психология «человека виртуально-сетевого».\n2.\tПочему блоггеры испытывают от своей деятельности блОженство и что такое гражданская журналистика.\n3.\tКак работает френд-бизнес и как компании делают из потребителей союзников, советчиков и сотрудников.\n4.\tКак найти работу или работника в Сети.\n5.\tКак организовать виртуальную вечеринку или виртуальный конкурс.", 
    "end_date": null, 
    "title": "«Ловцы человеков» или социальные сети в медиа, бизнесе, рекрутинге и образовании", 
    "price": 0, 
    "topic_name": [
      "economics"
    ], 
    "institution_name": [
      "National Research Tomsk State University"
    ], 
    "commitment": "9 недель исследования, 1-2 часов / неделю", 
    "cover_url": "https://d3njjcbhbojbot.cloudfront.net/api/utilities/v1/imageproxy/https://coursera-course-photos.s3.amazonaws.com/d7/046af0560e11e5adde798ff4740020/___3.png", 
    "course_url": "https://en.coursera.org/learn/sotsialnaya-set", 
    "currency": null, 
    "subject_name": [
      "social-sciences"
    ], 
    "duration": null, 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "coursera"
    ], 
    "start_date": "2015-10-16T02:42:40Z"
  }
]