[
  {
    "selfpaced": false, 
    "topic_name": [
      "Economics & Finance"
    ], 
    "description": "<p>Насколько здоровой является экономика? Как экономическая политика может способствовать сохранению или восстановлению здоровья экономики? Эти вопросы находятся в центре финансового программирования.&nbsp;На наших курсах по ФПП вы изучите основные концепции, знание которых необходимо для ответа на эти вопросы.</p>\r\n\r\n<p>Финансовое программирование является основой анализа текущего состояния экономики, прогнозирования направления ее развития и определения мер экономической политики, которые могут изменить это направление.</p>\r\n\r\n<p>Первая часть курса ФПП, проводимого Институтом профессионального и организационного развития МВФ и Объединенным венским институтом, позволит вам приобрести базовые навыки финансового программирования. В рамках курса рассматриваются основные характеристики счетов четырех основных макроэкономических секторов (реального, налогово- бюджетного, внешнеэкономического и денежно-кредитного) и методы анализа и интерпретации этих счетов, а также объясняются существующие между ними взаимосвязи.</p>\r\n\r\n<p>За время обучения экономисты МВФ и ОВИ подробно расскажут вам о макроэкономических счетах и помогут разобраться в деталях экономического анализа. Помимо просмотра видео лекций вам будет предложено ответить на вопросы по поводу изложенных концепций, выполнить небольшие задания с использованием расчетов, обсудить с другими участниками курса экономические процессы в вашей стране, а также поработать с данными на примере условной страны. Необходимые материалы вам будут предоставлены.</p>\r\n\r\n<p>Неважно, являетесь ли вы сотрудником государственного учреждения, занимающимся актуальными для вашей страны экономическими вопросами, или экспертом, работающим с экономическими данными, или же просто хотите лучше понять происходящие в экономике процессы, данный курс поможет вам приобрести необходимые практические навыки макроэкономического анализа. Надеемся, что вместе с нами вы совершите это увлекательное путешествие!</p>\r\n", 
    "end_date": "2016-12-14T00:00:00-05:00", 
    "title": "Финансовое программирование и политика, часть 1: макроэкономические счета и анализ", 
    "price": 0, 
    "instructors": "Мартин Шиндлер, Дмитрий Рожков, Михаил Пранович, Максим Иванина, Асель Исакова ", 
    "institution_name": [
      "The International Monetary Fund"
    ], 
    "commitment": "8-10 часов в неделю", 
    "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fpp_description-378x225.jpg", 
    "course_url": "https://www.edx.org/course/finansovoe-programmirovanie-i-politika-imfx-fpp-1x", 
    "currency": null, 
    "subject_name": null, 
    "duration": "6 weeks", 
    "language_name": [
      "Others"
    ], 
    "provider_name": [
      "edx"
    ], 
    "start_date": "2016-11-02T00:00:00-04:00"
  }
]