[
{"selfpaced": true, "description": "<p>Este curso trata la Teoría de Grafos desde el punto de vista de la modelización, lo que nos permitirá con posterioridad resolver muchos problemas de diversa índole. Presentaremos ejemplos de los distintos problemas en un contexto real, analizaremos la representación de éstos mediante grafos y veremos los algoritmos necesarios para resolverlos.</p>\r\n\r\n<p>Resolveremos problemas que aparecen en la logística, la robótica, la genética, la sociología, el diseño de redes y el cálculo de rutas óptimas, mediante el uso de la Teoría de Grafos. Nuestro objetivo será presentar tanto los contenidos de la misma como la modelización de los casos planteados.</p>\r\n\r\n<p>En cada tema comenzaremos presentando el problema a resolver. Posteriormente introduciremos la teoría y los algoritmos correspondientes, modelizaremos el problema propuesto y finalmente hallaremos su solución. En general explicaremos en qué consiste y cómo se deduce cada algoritmo, haciendo para ello una traza a modo de ejemplo.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n", "end_date": "2016-07-25T00:00:00-04:00", "title": "Aplicaciones de la Teoría de Grafos a la vida real II", "price": 0, "instructors": "Dr.  José Alberto Conejero Casares, Dra. Cristina Jordán Lluch", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/tgv201x.2-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/aplicaciones-de-la-teoria-de-grafos-la-upvalenciax-tgv201x-2-0", "subject_name": ["Computer Science"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-28T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Le politique nous concerne tous : chaque jour, des décisions publiques sont adoptées qui impactent notre quotidien. Dans quel contexte ces décisions sont-elles adoptées ? Au 21ème siècle, de nombreux paradoxes brouillent la vision que nous pouvons en avoir. Qu’est-ce que le pouvoir dans la société actuelle ? Quels acteurs en détiennent&nbsp;? L’État demeure-t-il un acteur politique majeur s’il est concurrencé par des organisations internationales et régionales ? Comment la démocratie prônée par la communauté internationale se différencie-t-elle des régimes autoritaires voire totalitaires ?&nbsp;Quelle est la place des idéologies dans le monde actuel ?&nbsp;Le cours vise à comprendre et à expliquer des phénomènes politiques à partir d’une posture d’analyse critique.</p>\r\n\r\n<hr />\r\n<p>Politics impact all of us: everyday political decisions impact many areas of our lives. In which context are these decisions made? In the 21st century, many paradoxes blur our vision of these decisions. What is power in a multi-level society? Does the state remain the main political actor, if it is in competition with international and regional organizations? Can democracy – pushed forward by the international community – coexist with authoritarian, or even totalitarian, regimes?&nbsp;What is the role of ideologies in contemporary politics?&nbsp;The course aims at understanding and explaining political phenomena from a critical standpoint.&nbsp;</p>\r\n", "end_date": "2017-07-01T00:00:00-04:00", "title": "Découvrir la science politique", "price": 0, "instructors": "Nathalie Schiffino-Leclercq, Min Reuchamps, Vincent Legrand, Pierre Baudewyns, Ella Hamonic", "institution_name": ["Université catholique de Louvain"], "commitment": "4-5 heures par semaine", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/louvainx3_378x225_0.jpg", "course_url": "https://www.edx.org/course/decouvrir-la-science-politique-louvainx-louv3x-2", "subject_name": ["Social Sciences", "History"], "duration": "6 semaines", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Muchas tecnologías e ideas aparentemente grandiosas llegan a un repentino alto a cara de una pregunta simple e inescapable.<br />\r\n&nbsp;<br />\r\n\"¿Quién es tu cliente?\"<br />\r\n&nbsp;<br />\r\nMIT ha hecho esta pregunta por muchos años a sus estudiantes emprendedores – y con gran éxito.&nbsp; Las 25,600 compañías fundadas por alumnos de MIT generan ingresos de US $2 trillones y han creado 3.3 millones de empleos. Si MIT fuese un país, sería la 11<sup>va</sup> economía más grande del mundo.&nbsp;<br />\r\n&nbsp;<br />\r\n¡Conviértete en un ciudadano de esta 11<sup>va</sup> economía más grande del mundo!&nbsp; Únete a MIT en tu trayectoria empresarial a medida que descubres el recurso más esencial de tu startup - el cliente.<br />\r\n<br />\r\nEsto es emprendimiento – así que no esperes una conferencia. Cada sesión de clase será un profundo y enfocado estudio de caso de emprendedores del MIT de diversas áreas como los son las aplicaciones móviles, impresión 3D, electrónica, desarrollo internacional y relojería.<br />\r\n<br />\r\nAprenderás, a través de historias de emprendedores del MIT, cómo pasar de la idea o la tecnología hacia la comprensión necesaria de quién y por qué querrá comprar tu producto. Específicamente, aprenderás cómo:</p>\r\n\r\n<ul>\r\n\t<li>\r\n\t<p>Identificar clientes prospectos</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Entrevistarlos</p>\r\n\t</li>\r\n\t<li>\r\n\t<p>Finalmente, elegir los clientes adecuados para tu negocio.&nbsp;</p>\r\n\t</li>\r\n</ul>\r\n\r\n<p>Las asignaturas del curso serán ejercicios de la vida real que te guiarán a través de una concreta y práctica serie de pasos efectivos que te ayudarán en hacer tu idea muy real.<br />\r\n&nbsp;</p>\r\n\r\n<p>Apúntante a la versión \"Verified\" de nuestro curso, consigue el certificado, y gana un año de subscripción gratis a AWS Activate, con 500$ de crédito y otras muchas ventajas.</p>\r\n", "end_date": "2017-07-30T00:00:00-04:00", "title": "Entrepreneurship 101: ¿Quién es tu cliente?", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/entrepreneurship-101_378x225.jpg", "course_url": "https://www.edx.org/course/entrepreneurship-101-quien-es-tu-cliente-mitx-15-390-1x-0", "subject_name": ["Business & Management", "Communication", "Social Sciences"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>No preguntes lo que el cliente puede hacer por ti – Pregunta que puedes hacer por tu cliente.&nbsp;<br />\r\n<br />\r\nEn Entrepreneurship 101, aprendiste a ver al mundo a través de los ojos del cliente– y&nbsp; ah, ¡qué gran perspectiva!<br />\r\n<br />\r\nEl viaje no para ahí. Ya que el santo grial de la especificidad&nbsp; -&nbsp; mientras aun al alcance – aún hay mucho que aprender antes de obtenerlo.<br />\r\n<br />\r\nAsí de importante que es encontrar a tu cliente, es el de crear un gran producto que resolverá el problema del cliente. ¿Cómo va a adquirir tu producto el cliente?&nbsp; &nbsp;¿Cómo resolverá el problema del cliente? ¿Qué valor traerá tu producto? &nbsp;¿Cuál es la salsa secreta?&nbsp; ¿Cómo enfrentas a la competencia?<br />\r\n<br />\r\nA partir de campos tan diversos como la inmortalidad virtual, la comercialización de la pequeña empresa, el diseño urbano, la enseñanza de idiomas, la asistencia de salud y los servicios de apoyo emprendedor, usamos casos de estudio de profundidad de los emprendedores para examinar la forma en como desarrollaron sus conceptos de productos, resolvieron el problema de su cliente, establecimos una clara propuesta de valor, refinaron su salsa secreta, y comprendieron a su competencia.</p>\r\n\r\n<p><span class=\"s1\">El viaje continúa. ¿Estás con nosotros? El cliente está esperando.&nbsp;</span></p>\r\n\r\n<p>Apúntante a la versión \"Verified\" de nuestro curso, consigue el certificado, y gana un año de subscripción gratis a AWS Activate, con 500$ de crédito y otras muchas ventajas.</p>\r\n", "end_date": "2017-07-30T00:00:00-04:00", "title": "Entrepreneurship 102: ¿Que puedes hacer por tu cliente?", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/entrepreneurship-102_378x225.jpg", "course_url": "https://www.edx.org/course/entrepreneurship-102-que-puedes-hacer-mitx-15-390-2x-0", "subject_name": ["Business & Management"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p class=\"p1\">Mükemmel görünen birçok fikir ve teknoloji, kaçınılmaz ve basit bir soruyla aniden durma noktasına geliyor.</p>\r\n\r\n<p>“Müşteriniz kim?”</p>\r\n\r\n<p>MIT kendi öğrenci girişimcilerine bu soruyu yıllardır başarıyla soruyor.</p>\r\n\r\n<p>MIT mezunları tarafından kurulan 25,600 şirket toplam 2 trilyon dolarlık gelir elde ediyor ve 3,3 milyon kişilik istihdam sağlıyor. MIT bir ülke olsaydı, dünyanın en büyük 11. ekonomisine sahip olurdu.</p>\r\n\r\n<p>Siz de bu en büyük 11. ekonominin bir vatandaşı olun! Girişim yolculuğunuzda MIT’ye katılın ve yeni kurduğunuz şirketin en önemli kaynağı olan müşteriyi keşfedin. Girişimcilikten bahsediyoruz. 9 Ocak 2015'te başlayacak olan ve yaklaşık 3 ay boyunca tüm dünya ile aynı zamanda devam edecek Girişimcilik MBA programıyla Girişimciliğin temellerini öğreneceksiniz. Haftada yaklaşık 4 saatlik çalışmanız yeterli olacak. Uluslararası kalkınmadan saat üretimine kadar bircok farklı alanda çalışan MIT girişimcilerinin geniş kapsamlı vaka analizlerinden oluşan 12 haftalık program sayesinde bir fikir ya da teknolojiden yola çıkarak ürününüzü kimin neden almak isteyeceğine dair gerekli bilgilere sahip olacaksınız. Özellikle şunları öğreneceksiniz:</p>\r\n\r\n<p>Muhtemel müşterileri tanımlamak</p>\r\n\r\n<p>Onlarla görüşmek</p>\r\n\r\n<p>Son olarak işiniz için uygun olan müşterileri seçmek.</p>\r\n\r\n<p>Derste verilen ödevler gerçek hayata dayalı egzersizlerden oluşacak. Bu egzersizler, size fikrinizi gerçekleştirmenizi sağlayacak somut, pratik ve etkili adımlarla yol gösterecek.</p>\r\n\r\n<p>Biraz eğlenmeye de hazırlıklı olun! Derse kaydolduktan sonra göreceksiniz ;-)</p>\r\n\r\n<p><strong>Bu derse tahminen ne kadar zaman ayırmalıyım?</strong></p>\r\n\r\n<p>Haftada yaklaşık 4 saat.</p>\r\n\r\n<p><strong>Derslerin metin hallerine erişebilecek miyim?</strong></p>\r\n\r\n<p>Evet. Bütün derslerin videolara uyumlu yazılı kayıtları olacak.</p>\r\n\r\n<p><strong>Dersleri canlı izlemek gerekiyor mu?</strong></p>\r\n\r\n<p>Hayır. Dersleri size uygun olan bir zamanda izleyebilirsiniz.</p>\r\n\r\n<p><strong>Eğitmen ya da Asistanlarla iletişim kurabilir miyim?</strong></p>\r\n\r\n<p>Evet, ama doğrudan değil. Tartışma forumları dersle ilgili sorular için en uygun yerdir. Eğitmenler bu forumları takip edecek ve en önemli sorulara cevap vermeye çalışacaklar. Çoğu zaman diğer öğrencilerden gelen cevaplar yeterli ve daha hızlı olacaktır.</p>\r\n\r\n<p><strong>Bu ders MIT’nin içinde verilen derslerle ilgili mi?</strong></p>\r\n\r\n<p>Evet. Bu ders, 15.390 Yeni Girişimcilik dersine tekabül etmektedir. Bu ders, MIT Mühendislik Fakültesi ve Sloan School of Managment (Sloan İşletme Fakültesi) tarafından ortak olarak verilen seçmeli bir derstir.</p>\r\n\r\n<p>Onaylı sertifikaya devam ederek $500 AWS kredisi ve diğer avantajlar içeren AWS Activate üyeliğine hak kazanın.</p>\r\n", "end_date": "2017-06-30T00:00:00-04:00", "title": "Girişimcilik 101: Müşterinizi tanıyın", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/unnamed_0.jpg", "course_url": "https://www.edx.org/course/girisimcilik-101-musterinizi-taniyin-mitx-15-390-1x-1", "subject_name": ["Business & Management", "Communication"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Müşterinizin sizin için ne yapabileceği değil, sizin müşteriniz için ne yapabileceğiniz önemli.</p>\r\n\r\n<p>Girişimcilik 101 dersinde dünyaya müşteri gözünden bakmayı öğrendiniz, bu da sizin için mükemmel bir bakış açısı oldu!</p>\r\n\r\n<p>Ama yolculuğumuz henüz bitmedi. Ufukta görünen kesinliğe ulaşmamız için daha öğrenmemiz gereken çok şey var.</p>\r\n\r\n<p>Müşterilerin sorunlarını çözecek harika bir ürün yaratmak en az müşteri bulmak kadar önemli olan bir unsur. Müşteriniz ürününüzü nasıl edinecek? Bu ürün müşterinin sorununu nasıl çözecek? Ürününüz ne gibi bir değer getirecek? Başarınızın sırrı nedir? Rekabet noktasında nasıl davranıyorsunuz?</p>\r\n\r\n<p>Sanal ölümsüzlük, küçük işletme pazarlaması, kentsel tasarım, dil eğitimi, sağlık ve girişimci destek hizmetleri gibi birçok konudan yola çıkarak, girişimcilerin geniş kapsamlı vaka analizlerini kullanıyoruz. Girişimcilerin ürün kavramını nasıl geliştirdiklerini, müşterilerin sorunlarını nasıl çözdüklerini, nasıl net bir değer önermesi kurduklarını, başarı sırlarını ne şekilde geliştirdiklerini ve rekabeti nasıl anladıklarını inceleyebileceksiniz.</p>\r\n\r\n<p>Yolculuk devam ediyor. Bizimle misiniz? Müşteriniz sizi bekliyor.</p>\r\n\r\n<p>Onaylı sertifikaya devam ederek $500 AWS kredisi ve diğer avantajlar içeren AWS Activate üyeliğine hak kazanın.</p>\r\n", "end_date": "2017-07-30T00:00:00-04:00", "title": "Girişimcilik 102: Müşteriniz için ne yapabilirsiniz?", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "Haftada 4 saat", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/turkish_102_thumbnail-01.jpg", "course_url": "https://www.edx.org/course/girisimcilik-102-musteriniz-icin-ne-mitx-15-390-2x-1", "subject_name": ["Business & Management"], "duration": "16 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Size bir sır vermek istiyoruz: Yenilik sadece doktora öğrencileriyle dolu araştırma laboratuvarlarından çıkmıyor. Çoğunlukla yeniliği kendileri için önemli bir sorunu çözmek isteyen sıradan insanlar yaratıyor. Bunu siz de yapabilirsiniz.</p>\r\n\r\n<p>Önce neye ihtiyacınız olduğunu düşünün. Sonra başkalarının da bunu isteyip istemediğini öğrenin. Eğer istiyorlarsa, önce kendiniz için geliştirdiğiniz bu yeni ürün veya hizmeti diğerlerine sunmak için kâr amaçlı veya kâr amaçlı olmayan bir girişim oluşturabilirsiniz.</p>\r\n\r\n<p>Sonsuz sayıda kullanıcı yeniliği örneği var. Bir sörfçü, sörf yaparken selfie çekebilmek için GoPro'yu yarattı. Bir öğrenci flaş belleğini unuttuktan sonra Dropbox'ı buldu. İki parasız girişimci kirayı ödeyebilmek için salonlarını kiraya verince Airbnb ortaya çıktı. Girişimlerinin nasıl başarılı olduğunu bizimle paylaşacaklar.</p>\r\n\r\n<p>Kullanıcı yeniliğini ortaya çıkaran profesör Eric von Hippel'ın verdiği bu derste hangi sorunları çözmeyi seçebileceğinizi ve yeniliklerinizi başkalarıyla nasıl paylaşabileceğinizi öğreneceksiniz.</p>\r\n\r\n<p>Siz de yenilik yaratabilirsiniz.</p>\r\n\r\n<p>&nbsp;</p>\r\n", "end_date": "2017-06-30T00:00:00-04:00", "title": "Kullanıcıdan doğan yenilikçilik: Girişimciliğe Yolculuk", "price": 0, "instructors": "Eric von Hippel, Erdin Beshimov", "institution_name": ["MIT"], "commitment": "2 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/uinov8x-378x225.jpg", "course_url": "https://www.edx.org/course/kullanicidan-dogan-yenilikcilik-mitx-uinov8xtur1", "subject_name": ["Business & Management"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-01T00:00:00-04:00"},
{"selfpaced": false, "description": "<p><em>***Este curso será impartido en español***</em></p>\r\n\r\n<p>En las próximas décadas, las pensiones se convertirán en uno de los ejes centrales de las políticas económicas y sociales en América Latina y el Caribe (ALC).</p>\r\n\r\n<p>¿La razón? En 2050 habrá en la región el triple de adultos mayores que ahora, con una mayor esperanza de vida y, por lo tanto mayores necesidades de atención.</p>\r\n\r\n<p>Esos adultos mayores del futuro están hoy en un mercado de trabajo donde sólo 4 de cada 10 trabajadores contribuyen a un sistema de pensiones. Esto significa que en la actualidad 130 millones de personas están trabajando sin ahorrar para su pensión en ALC.</p>\r\n\r\n<p>En ausencia de reformas, incluso con un crecimiento sostenido en la región, 1 de cada 2 jubilados no tendrá una pensión o esta no será adecuada, dejando entre 66 y 83 millones de adultos mayores dependiendo de las familias o del Estado para su manutención, lo que será económica, fiscal y socialmente insostenible.</p>\r\n\r\n<p>Por otra parte, aquellos sistemas que prometen beneficios más generosos tienen baja cobertura y eventuales problemas de equidad y sustentabilidad. Lo que genera un importante desafío, ya que el aumentar la cobertura bajo el mismo diseño puede mejorar la situación financiera en el corto plazo, pero acrecentar los problemas de sustentabilidad en el largo plazo.</p>\r\n\r\n<p>En este curso comprenderemos las complejidades que afronta el mercado de trabajo en ALC y, por ende, su sistema de pensiones. Vamos a esclarecer las políticas que se pueden formular en los diferentes contextos de la Región que podrían llevar a un funcionamiento de sistemas de pensiones más eficientes, financieramente sostenibles y equitativos y así ofrecer “mejores pensiones” a todos los adultos mayores, no solo a unos pocos.</p>\r\n\r\n<p><strong>La preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del <a href=\"http://www.iadb.org/es/temas/gobierno/programa-especial-para-el-desarrollo-institucional,8478.html\">SPID</a>.</strong></p>\r\n", "end_date": "2016-08-23T00:00:00-04:00", "title": "Pensiones en América Latina y el Caribe", "price": 0, "instructors": "Carmen Pagés-Serra, Ángel Melguizo, Mariano Bosch, Solange Berstein", "institution_name": ["Inter-American Development Bank"], "commitment": "6 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb2x_thumbnail_378x225.jpg", "course_url": "https://www.edx.org/course/pensiones-en-america-latina-y-el-caribe-idbx-idb2x", "subject_name": ["Economics & Finance", "Social Sciences"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-07-12T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Este curso les ayudará a responder preguntas como:</p>\r\n\r\n<ol>\r\n\t<li>¿Consumen más, menos, o justo lo que necesitan?</li>\r\n\t<li>¿Les gusta botar dinero cuando compran y consumen algo o estarían interesados en que no tuvieran que desperdiciarlo?</li>\r\n\t<li>¿Por qué a veces consumen productos que no necesitan realmente?</li>\r\n\t<li>¿Quieren seguir consumiendo los productos que compran actualmente sin sentirse culpables por los discursos ambientales sobre la protección del ambiente?</li>\r\n</ol>\r\n\r\n<p>Si te has hecho alguna de estas preguntas antes o, por el contrario, nunca te las habías planteado, ¡Seguro disfrutarás este curso!</p>\r\n\r\n<p>No existen los productos perfectamente sostenibles hoy en día. Por esto como compradores y consumidores debemos volvernos expertos en tomar las mejores decisiones posibles, con la mejor información disponible (e, incluso, exigir nueva información que no exista aún), sobre el valor que realmente queremos obtener de un bien o servicio, identificando las mejores oportunidades que nos ofrezcan las empresas para cuidar al ambiente y a la sociedad (al mencionar el cuidado del ambiente y de la sociedad, se incluyen ustedes mismos como compradores y consumidores)</p>\r\n\r\n<p>Entonces, ¿de quién es la responsabilidad de que se sigan escuchando denuncias sobre la contaminación del ambiente por ejemplo? Todos los que estamos involucrados en el ciclo de vida de los bienes y servicios que compramos, tenemos la oportunidad de presionar para que los sistemas de producción y de consumo mejoren hacia un estado más sostenible que antes.</p>\r\n", "end_date": "2016-09-06T00:00:00-04:00", "title": "Hábitos de consumo sostenible: Motor de innovación", "price": 0, "instructors": "Lucas Rafael Ivorra Peñafort", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "5 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/consumo_sostenible_378x225.jpg", "course_url": "https://www.edx.org/course/habitos-de-consumo-sostenible-motor-de-javerianax-con-1602x-01", "subject_name": ["Environmental Studies", "Humanities"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-08-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La presencia de las TIC en la vida de las familias es un tema en construcción, dada la permanente movilidad de la era de la información y los constantes cambios que esta plantea en un mundo que está en permanente transformación.</p>\r\n\r\n<p>En esta medida, y reconociendo que desde distintas profesiones estamos en contacto con familias en diversos escenarios, resulta pertinente que tengamos claridad conceptual y también herramientas de acompañamiento necesarias para apoyar las familiar: sus necesidades y las formas como están siendo impactadas por la presencia de las TIC.</p>\r\n\r\n<p>Es conveniente tener dominio del tema dada la realidad que nos desborda frente a la presencia de las TIC, las nuevas problemáticas que surgen alrededor de ellas o las que se exacerban ante su presencia como también la consideración por supuesto de sus aportes y posibilidades.</p>\r\n\r\n<p>Es indudable que nosotros como sociedad tenemos muchas preguntas por resolver y este MOOC es un avance frente a ellas.</p>\r\n", "end_date": "2016-10-23T00:00:00-04:00", "title": "Impacto de las TIC en la vida de las familias", "price": 0, "instructors": "María del Socorro Peláez ", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "8 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/course-image_378x225.jpg", "course_url": "https://www.edx.org/course/impacto-de-las-tic-en-la-vida-de-las-javerianax-imp1-0x", "subject_name": ["Social Sciences", "Humanities", "Medicine"], "duration": "11 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-08-08T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Ce cours est un cours d’introduction à la réalisation des fonctions linéaires et non-linéaires de base à l’aide de l’amplificateur opérationnel.\u2028\u2028Les étudiants appliquent la théorie des circuits, la réaction négative et positive aux amplificateurs opérationnels pour réaliser les fonctions électroniques élémentaires (amplification, filtrage,&nbsp;transposition, addition, soustraction, génération des fonctions périodiques, etc.). Les explications sont illustrées par des exercices au laboratoires avec des démonstrations qui peuvent être&nbsp;reproduite par les élèves par simulation.</p>\r\n", "end_date": "2017-09-01T00:00:00-04:00", "title": "Electronique I", "price": 0, "instructors": "Maher Kayal, Cédric Meinen", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "4 heures par semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/electronix-electronique_i-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/electronique-i-epflx-electronix-0", "subject_name": ["Electronics", "Engineering"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>El curso que se propone es ideal para investigadores y alumnos que se encuentren cursando trabajos de fin de grado, trabajos de fin de máster o realizando tesis, así como todos aquellos del área de la administración que quieran realizar un análisis cuantitativo o cualitativo en sus estudios. El curso pretende acercar al alumno al método científico y, en concreto, cómo éste se viene aplicando al estudio y análisis de los métodos de casos.</p>\r\n\r\n<p>El curso pretende construir una base básica-inicial en los principios estadísticos, econométricos y metodológicos generales que permitan a los alumnos desarrollar un análisis completo desde el diseño de la investigación, la preparación de los datos, segmentación y codificación, hasta la obtención de resultados y respuestas a las preguntas de investigación. El curso enfatiza el método científico y el sistema de análisis de datos guiados por un modelo que pone énfasis en la descripción del punto de vista del participante, la generación entre las unidades de datos y el proceso de interpretación.</p>\r\n\r\n<p>Unidades:</p>\r\n\r\n<ul>\r\n\t<li>Fuentes de Información para la Investigación</li>\r\n\t<li>Manejo de Paquetes Estadísticos</li>\r\n\t<li>Modelos Econométricos</li>\r\n\t<li>Análisis e Interpretación de Datos</li>\r\n\t<li>Procesos de Investigación Cualitativa</li>\r\n\t<li>Ética en la Investigación</li>\r\n\t<li>Examen Final</li>\r\n</ul>\r\n", "end_date": "2017-09-06T00:00:00-04:00", "title": "Técnicas Cuantitativas y Cualitativas para la Investigación", "price": 0, "instructors": "Adela García Aracil, Isabel Neira Gómez, Fernando Jiménez Sáez, José Félix Lozano Aguilar", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/investigacion-operativa378x225.jpg", "course_url": "https://www.edx.org/course/tecnicas-cuantitativas-y-cualitativas-upvalenciax-tcci201-x", "subject_name": ["Data Analysis & Statistics"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-06T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Quel est l’état de santé de l’économie ? Comment la politique économique peut-elle rétablir ou contribuer à la bonne santé d’un pays ? Ces questions sont au cœur de la programmation financière. Nos cours de PPF (Programmation et politiques financières) vous permettront d’acquérir les bases nécessaires pour y répondre.<br />\r\n&nbsp;<br />\r\nLa programmation financière est un cadre qui permet d’analyser l’état actuel de l’économie, de prévoir la direction qu’elle prend, et de déterminer les politiques économiques qui peuvent en changer le cours.<br />\r\n&nbsp;<br />\r\nLa première partie du cours de PPF, présentée par l’Institut du FMI pour le développement des capacités, vous permettra d’acquérir les compétences de base indispensables pour mener à bien la programmation financière. Dans ce cours, vous découvrirez les principales caractéristiques des quatre grands secteurs macroéconomiques (réel, financier, extérieur et monétaire), vous apprendrez comment lire, interpréter et analyser les comptes de chacun d’eux, et vous comprendrez à quel point ils sont interdépendants.<br />\r\n(La deuxième partie du cours de PPF portera sur la formulation de projections de base et l’élaboration d’un programme d’ajustement.)<br />\r\n&nbsp;<br />\r\nAu long de ce cours, les économistes du FMI vous guideront dans les comptes et dans l’analyse d’une économie. En outre du suivi de conférences sous forme de vidéos, vous serez appelés à répondre à des questions sur les concepts expliqués, à résoudre de brefs exercices pratiques, à réfléchir avec les autres participants sur l’évolution économique de votre pays, et à travailler sur les données d’un pays imaginaire. Les dossiers de lecture vous seront fournis.<br />\r\n&nbsp;<br />\r\nQue vous soyez un cadre de la fonction publique chargé de dossiers économiques pour votre pays ou que votre travail repose sur l’exploitation de données économiques, ou tout simplement si vous souhaitez mieux comprendre l’évolution économique d’un pays, ce cours vous apportera une formation pratique en analyse macroéconomique, et nous attendons avec intérêt votre participation à ce fascinant apprentissage!<br />\r\n&nbsp;<br />\r\nLa première partie du cours de Programmation et politiques financières est proposée par le FMI avec le concours financier du gouvernement de Belgique.</p>\r\n", "end_date": "2016-10-26T00:00:00-04:00", "title": "Programmation et Politiques Financières, Première Partie: Analyse des Comptes Macroéconomiques", "price": 0, "instructors": "Antonio David, Eric Verreydt, Céline Rochon, Romain Ranciere, Marc Quintyn", "institution_name": ["The International Monetary Fund"], "commitment": "8-10 heures a la semaine", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/fpp_description-378x225_0.jpg", "course_url": "https://www.edx.org/course/programmation-et-politiques-financieres-imfx-ppf-1x-0", "subject_name": ["Economics & Finance"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-14T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>En el curso veremos una definición analítica de la Gestión Participativa y cómo implantar y medir el grado de despliegue de las prácticas de alta implicación (HIWP) en las empresas.</p>\r\n\r\n<p>También analizaremos como se pueden medir los resultados de estas prácticas.</p>\r\n", "end_date": "2016-11-14T00:00:00-05:00", "title": "Gestión Participativa", "price": 0, "instructors": "Dr. Juan A. Marin-García, Dr. Cristina Santandreu Mascarell, Amable Juárez Tárrega", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/gp201x-378x225.jpg", "course_url": "https://www.edx.org/course/gestion-participativa-upvalenciax-gp201x-0", "subject_name": ["Business & Management"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-20T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Quel est le secret d’une entreprise qui réussit mieux qu’une autre&nbsp;? Comment faire les bons choix stratégiques&nbsp;? Ce cours proposera des réponses à ces questions au travers de nombreuses études de cas. Il vous fournira des outils et méthodes d’analyse indispensables pour comprendre les atouts ainsi que l’environnement concurrentiel des entreprises.</p>\r\n\r\n<p>Il s’agit d’une approche originale qui s’adresse à chacun, qu’il soit directeur, cadre, entrepreneur, étudiant ou tout simplement désireux de savoir comment prendre des décisions réfléchies et cohérentes tout en poursuivant un objectif à long terme.</p>\r\n\r\n<p>Ce cours est construit comme un voyage en 6 escales au pays «&nbsp;stratégie&nbsp;». Tout comme le stratège, le voyageur doit décider, prévoir et planifier son itinéraire en demeurant flexible. Il doit tenir un cap et connaître sa destination, car comme le disait Sénèque&nbsp;: «&nbsp;il n’est pas de vent favorable à qui ne connaît pas son port&nbsp;».</p>\r\n\r\n<hr />\r\n<p>Why does one company succeed over another? How do you make the right strategic choices while developing your business?&nbsp;</p>\r\n\r\n<p>This course will provide you with the tools and methods of analysis needed to answer these important questions. Through numerous case studies, you will come to understand both the assets of companies and their competitive environment. This is an original approach, applicable to everyone from students to business executives, but also anyone curious about how to make informed decisions while pursuing well-defined, long-term goals.</p>\r\n\r\n<p>The course takes a multi-faceted approach. As a strategist, you must decide, predict and plan your route while remaining flexible and open to change. You must stay the course and know your destination because, as the philosopher Seneca once said, “<em>If one does not know to which port one is sailing, no wind is favourable.</em>”</p>\r\n", "end_date": "2017-09-20T00:00:00-04:00", "title": "Les fondements de la stratégie d’entreprise", "price": 0, "instructors": "Alain  Vas, Régis Coeurderoy", "institution_name": ["Université catholique de Louvain"], "commitment": "3-5 heures par semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/louv10x-378x225_0.jpg", "course_url": "https://www.edx.org/course/les-fondements-de-la-strategie-louvainx-louv10x-1", "subject_name": ["Business & Management", "Economics & Finance"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-20T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Wollen Sie realistische Probleme der Ingenieurmathematik lösen? Das ist ohne Einsatz von Computersoftwarelösungen, wie sie etwa MATLAB bietet, nicht möglich.</p>\r\n\r\n<p>In diesem Kurs zeigen wir, wie Sie die in MATLAB zur Verfügung stehenden Funktionen benutzen können, um zahlreiche typische Problemstellungen aus der Höheren Mathematik zu lösen bzw. zu visualisieren. Sie entwickeln ein tiefes Verständnis für die mathematischen Problemstellungen und deren Lösungen. Das aktive Erstellen von Programmen unterstützt das sogfältige und genaue Arbeiten der Studierenden – die Lösungsstrategien werden nicht nur nachvollzogen, sondern erarbeitet.</p>\r\n\r\n<p>Es sind keine Voraussetzungen nötig. Nehmen Sie an dem Kurs teil und erwerben Sie eine Schlüsselqualifikation, die Ihnen nicht nur im Studium, sondern auch im Berufsleben von entscheidendem Nutzen sein wird.</p>\r\n", "end_date": "2017-10-01T00:00:00-04:00", "title": "Einführung in MATLAB", "price": 0, "instructors": "Christian Karpfinger, Sina Greger, Benjamin Hab, Veronika Kreuzer, Kerstin Roder, Moritz Rumpf, Benjamin Rüth", "institution_name": ["Technische Universität München"], "commitment": "2-3 Studen pro Woche", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/mandel_spiral_378x225.jpg", "course_url": "https://www.edx.org/course/einfuhrung-matlab-tumx-matlabx", "subject_name": ["Math", "Computer Science"], "duration": "9 Wochen", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-26T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Comment définir et comprendre la notion d’espace? Comment l’urbanisation, la mobilité, Internet et la mondialisation ont-ils influencé notre perception du temps et de l’espace? Ce cours a pour objectif de définir la notion d’espace en apportant des clés de lecture pour comprendre les sociétés qui nous entourent.</p>\r\n\r\n<p>À la fois théorique et pratique, ce cours privilégie les compétences sur les « contenus » factuels et valorise une approche par l’intelligence collective. Ce cours propose de saisir la notion d’espace à partir de vos expériences quotidiennes, de vos perceptions et de vos pratiques.</p>\r\n\r\n<p>Dans EspaceX, nous explorons ensemble la ville, l’urbanisation, l’urbanité, et l’urbanisme, l’acteur individuel au sein d’un Monde mondialisé, les spatialités numériques, le couple espace-temps et la relation complexe entre les sociétés et les mondes bio-physiques. Une large part sera accordée à la cartographie. À l’issue de ce cours, vous serez capable non seulement de lire, mais aussi de dessiner vos propres cartes. Enfin, les problématiques de l’agir spatial et de la justice spatiale seront abordées. Un(e) specialiste reconnu(e) interviendra à chacune des 9 séances sous la forme d’un entretien filmé mettant en lumière la relation de ce chercheur à l’espace.</p>\r\n", "end_date": "2016-11-05T00:00:00-04:00", "title": "Explorer l’espace des humains: une introduction à la géographicité", "price": 0, "instructors": "Jacques Lévy, Dr. Boris Beaude, Hélène Noizet, Dr. Patrick Poncet", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "5 heures par semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/espace-v1-course-thumbnail-378x225.jpg", "course_url": "https://www.edx.org/course/explorer-lespace-des-humains-une-epflx-espacex", "subject_name": ["Social Sciences"], "duration": "10 semaines", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-09-26T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La seguridad de los alimentos que ingerimos es uno de los principales objetivos de las políticas de la Unión Europea. Pero la realidad es que en las últimas décadas hemos sufrido crisis alimentarias muy importantes, tanto desde una perspectiva económica, con grandes pérdidas para productores y distribuidores, como sobre todo desde una perspectiva social, con un elevado número de fallecidos a lo largo de toda Europa. A través de este curso podrás conocer las respuestas adoptadas por la Unión Europea: la primacía del conocimiento científico sobre los criterios económicos; la colaboración de la industria alimentaria en la garantía de la seguridad; la adopción de procedimientos autorizatorios y de alerta ante situaciones de crisis; y la reparación de los daños generados por tales crisis.</p>\r\n\r\n<p><em><span>Este curso se imparte en español, si bien alguno de los documentos de referencia pueden aparecer en ingles (aunque se incluirá una breve explicación en español). No se requiere conocimiento jurídico previo alguno.</span></em></p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "De la granja a la mesa: La seguridad alimentaria en la Unión Europea", "price": 0, "instructors": "Ángel Menéndez Rexach, Juan Antonio Chinchilla Peinado, Francisco R. Marín Martín, Blanca Rodríguez-Chaves Mimbrero, Mónica Domínguez Martín, Ana De Marcos Fernández, Carmen Jerez Delgado ", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "3-5 horas a la semana ", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/segalim201x-course_imageb-378x225.jpg", "course_url": "https://www.edx.org/course/de-la-granja-la-mesa-la-seguridad-uamx-segalim201x-0", "subject_name": ["Law", "Food & Nutrition", "Science"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Vous allez découvrir les mécanismes à l’œuvre derrière les grandes décisions qui relèvent du marketing opérationnel&nbsp;:</p>\r\n\r\n<ul>\r\n\t<li>la conception d’un produit</li>\r\n\t<li>la fixation du prix auquel celui-ci sera vendu</li>\r\n\t<li>la sélection des canaux de distribution pour la vente</li>\r\n\t<li>le choix des moyens de communication par lesquels l’entreprise va informer ses clients.</li>\r\n</ul>\r\n\r\n<p>Ces décisions s’appuient bien sûr sur des analyses mobilisant des concepts importants que nous vous présenterons. Tout au long du MOOC, vous aurez l’occasion d’appliquer la théorie à une étude de cas réel qui vous placera dans la peau d’un décideur marketing. Vous bénéficierez aussi d’interviews d’experts et d’échanges privilégiés et interactifs avec les professeurs lors de conférences en direct.&nbsp;<br />\r\n&nbsp;<br />\r\nTous les jours, consommez-vous des biens ou des services&nbsp;? Ce MOOC vous permettra de saisir la logique du marketing et de devenir un consommateur plus responsable.</p>\r\n\r\n<p>Etes-vous un praticien non encore averti en marketing&nbsp;? Ce MOOC vous permettra de comprendre le pourquoi des décisions du marketing opérationnel et de les mettre en œuvre dans un cas concret.</p>\r\n\r\n<p>Etes-vous étudiant et curieux&nbsp;? Ce MOOC vous permettra de vous familiariser avec les pratiques du marketing, dans les secteurs marchands et non marchands.<br />\r\n&nbsp;<br />\r\nEtes-vous un étudiant en gestion&nbsp;? Ce MOOC vous offrira un complément aux cours de stratégie et de marketing stratégique. Il vous permettra d’opérationnaliser les décisions dans quatre composantes classiques à savoir le produit, la distribution, le prix et la communication (les «&nbsp;4 P&nbsp;»).<br />\r\n&nbsp;<br />\r\nQue vous soyez consommateur, praticien ou étudiant, ce MOOC vous offrira un regard éclairé sur l’éthique du marketing.<br />\r\n<br />\r\nAvec le partenariat des éditions Dunod pour l'ouvrage Lambin, J.-J., &amp; de Moerloose, C. (2012).&nbsp;<a href=\"http://www.dunod.com/entreprise-economie/entreprise-et-management/marketing-communication/master-et-doctorat/marketing-strategique-et-opera-0\" target=\"_self\">Marketing stratégique et opérationnel. Du marketing à l'orientation-marché</a>&nbsp;(8ème édition).<br />\r\n&nbsp;</p>\r\n\r\n<hr />\r\n<p>This class will provide you with an overview of the various dimensions of operational marketing (marketing decisions). These decisions concern product development, setting of a price for this product, selecting one or several distribution channels and finally communication tools in order to promote this product. Of course, these decisions rest on conceptual concepts that we will also present. You will have the opportunity to concretely apply course content through weekly case studies for which you will play the role of a manager. This MOOC provides content through videos, quiz, expert interviews, a forum, discussion (hangouts) and additional readings.<br />\r\n&nbsp;<br />\r\nTo consumers, this class will offer you an understanding of the logic behind marketing and it will enable you to become a more aware and responsible consumer.<br />\r\n&nbsp;<br />\r\nTo practitioners with no marketing background, this MOOC will enable you to understand the reasoning behind marketing decisions and to apply this reasoning in real situations.<br />\r\n&nbsp;<br />\r\nTo students with no business background, this MOOC will help you to become familiar with marketing practices both in commercial and non-profit marketing and to understand and analyze important operational decisions in marketing.<br />\r\n&nbsp;<br />\r\nTo business students, this MOOC will be complementary to strategy and marketing strategy classes. It will enable you to operationalize decisions using the 4 ‘P’s’: Price, Product, Place and Promotion.<br />\r\n&nbsp;<br />\r\nTo everybody involved in this MOOC, the ethical issues in Marketing will be highlighted.&nbsp;<br />\r\n&nbsp;<br />\r\n<em><span>Ce cours est enseigné en français.&nbsp;</span><span>This course is taught in French.</span></em></p>\r\n", "end_date": "2016-11-21T00:00:00-05:00", "title": "Découvrir le marketing", "price": 0, "instructors": "Chantal de Moerloose, Claude Pecheux, Anne-Laure Bartier", "institution_name": ["Université catholique de Louvain"], "commitment": "3-5 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/decouvrir-le-marketing-essentials-of-marketing_378x225.jpg", "course_url": "https://www.edx.org/course/decouvrir-le-marketing-louvainx-louv11x-1", "subject_name": ["Business & Management"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>¡Si te interesa la educación escolar como espacio para contribuir a una sociedad más justa e inclusiva, este curso es para ti! Sobre todo si crees que es necesario revertir los procesos de segregación, marginación y&nbsp; fracaso escolar que afectan a tantos alumnos y alumnas.</p>\r\n\r\n<p>Este curso te facilitará la comprensión de principios y conceptos clave para el desarrollo de sistemas, centros escolares y prácticas educativas inclusivas</p>\r\n\r\n<p>Aprenderás a entender por qué hoy la “educación inclusiva” se va extendiendo por el mundo como el “<em>camino hacia el futuro</em>”, para ayudar a construir sociedades también incluyentes.</p>\r\n\r\n<p>Del análisis de ejemplos de exclusión y discriminación escolar y social de muchos grupos (personas con discapacidad, migrantes, alumnas, poblaciones originarias…), sacaremos las <em>lecciones</em> que han de guiar nuevas prácticas escolares para todo el alumnado.</p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "Educación de calidad para todos. Equidad, inclusión y atención a la diversidad.", "price": 0, "instructors": "Gerardo Echeita, Elena Martin, Marta Sandoval, Cecilia Simón", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "3-5 horas a la semana ", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/equidad801x-course_imageb-378x225.jpg", "course_url": "https://www.edx.org/course/educacion-de-calidad-para-todos-equidad-uamx-equidad801x-0", "subject_name": ["Social Sciences"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Alguna vez te preguntaste: ¿por qué se hinchan los pies después de una boda?, ¿Cuánta agua hay que beber al día?, ¿cuánta agua es demasiada?, ¿Por qué beber agua era una forma de tortura en la edad media?, ¿Cómo terminar un maratón sin deshidratarte?, ¿Por qué los médicos pueden llegar a prescribir dietas pobres en frutas y verduras?, ¿Debes tomar suplementos de fósforo para la memoria?, ¿Cómo retrasar el envejecimiento?, y, sobre todo…&nbsp; ¿por qué murió el campeón del concurso de bebedores de cerveza?</p>\r\n\r\n<p>Este curso es una introducción a la fisiología (funcionamiento normal) y patología (enfermedades) de los riñones: Comenzando con los mecanismos que mantienen el equilibrio del agua, de la sal, del potasio, del fósforo, de la vitamina D, de la eritropoietina (si, esa, ¡la EPO de los escándalos del deporte!) y, sobre todo, de la hormona antienvejecimiento Klotho, el curso te permitirá conocer mejor el funcionamiento de los riñones y aplicar estos conocimientos a tu vida cotidiana.</p>\r\n\r\n<p>No son necesarios conocimientos previos de Medicina. Acompáñanos en este viaje a la fisiología renal y su impacto sobre la salud y la enfermedad.</p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "Fisiopatología renal y enigmas de la vida cotidiana", "price": 0, "instructors": "Alberto Ortiz Arduan, María Vanessa Pérez Gómez, María Dolores Sánchez Niño", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "3-5 horas a la semana ", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/renal701x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/fisiopatologia-renal-y-enigmas-de-la-uamx-renal701x-0", "subject_name": ["Medicine"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El curso mostrará el carácter actual, y a veces dramático, de las concepciones que desde la filosofía griega han venido siendo denominadas como “idealismo”. Desplegará las grandes cosmovisiones occidentales en base a sus ideas rectoras, operativas en los estadios científico, artístico y sociocultural, haciendo ver cómo la filosofía ha servido de sustrato o conexión de todas estas manifestaciones espirituales, estableciendo una sistemática efectiva, patente en la atmósfera cultural de las épocas-mundo. Cada uno de estos “mundos” (en el sentido de “ordenación global”) está configurado por un conjunto bien trabado de ideas-fuerza, en torno a una Idea fundamental.</p>\r\n\r\n<p>El alumno obtendrá una visión general de la cohesión interna y organización de cada una de estas cosmovisiones, respecto a las cuales se pondrá el acento en su presencia activa en los problemas del presente.</p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "Idealismo Filosófico: Cómo hacer Mundos con Ideas", "price": 0, "instructors": "Felix Duque, Ángel Gabilondo, Valerio Rocco, Marcela Vélez, José Maria Zamora, Eduardo Zazo", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "3-5 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idealismo501x-378x225.jpg", "course_url": "https://www.edx.org/course/idealismo-filosofico-como-hacer-mundos-uamx-idealismo501x-0", "subject_name": ["Philosophy & Ethics", "Art & Culture", "Humanities"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>En un lugar de la UAM, cuyo nombre merece recordar, habita la España de&nbsp;<em>El Quijote</em>.&nbsp;<br />\r\n<br />\r\nUn espacio en el que su monarquía creó el primer imperio global de la Historia. Un tiempo, entre los siglos XVI y XVII, en el que su sociedad alcanzó la excelencia en las artes y las letras.<br />\r\n<br />\r\nAunque ese esplendor se dio en plenos aires de cambio. Pues España pasó de la hegemonía a la decadencia, de la expansión a la crisis.<br />\r\n<br />\r\nEsta asignatura pretende trazar la historia de aquella época. Entre el Renacimiento y el Barroco su cultura marcó la pauta en Occidente. Las obras literarias -La Celestina, El Lazarillo,&nbsp;etc.- se tradujeron enseguida en las imprentas europeas y americanas. Las ropas marcaron la moda cortesana. La tendencia más&nbsp;fashion&nbsp;era “vestir a la española”. Los tratados militares y políticos fueron estudiados por los enemigos.<br />\r\n<br />\r\nLa acumulación de talentos en la Villa y Corte de Madrid (Cervantes, Lope, Velázquez, etc.), tuvo réplicas en las grandes ciudades de imperio. Pues en Sevilla, Lisboa, Barcelona, Nápoles, México o Lima se multiplicaron academias literarias, estrenos teatrales y fiestas. Una síntesis de pueblos unidos por la lealtad a la Corona y la fe católica.<br />\r\n<br />\r\nEn nuestro recorrido por esa España de&nbsp;<em>El Quijote</em>&nbsp;pasaremos de la campana al reloj y de la geografía fantástica a la real. La sociedad estuvo - Conocer la Historia de España en el Siglo de Oro a través de <em>El Quijote</em> como hilo conductor.</p>\r\n\r\n<ul>\r\n\t<li>Adentrarnos en la vida cotidiana de los siglos XVI y XVII a través de la sociedad y la cultura.</li>\r\n\t<li>Ofrecer al alumnado las fuentes escritas y visuales para que contemple el tiempo de <em>El Quijote</em> como si viviese en él.</li>\r\n\t<li>Comparar los valores de la España de <em>El Quijote</em> con los actuales para comprender cómo han ido evolucionando a lo largo de la Historia&nbsp;polarizada entre los privilegiados -nobleza y clero- y los pobres y los picaros. El Humanismo fue cultivado en las universidades. La familia, la alimentación, la vivienda, los juegos y las fiestas, protagonizaron la vida cotidiana.&nbsp;</li>\r\n</ul>\r\n\r\n<p><br />\r\nEn el tiempo de&nbsp;<em>El Quijote</em>&nbsp;las luces de los genios literarios y artísticos brillaron sobre las sombras de la Inquisición. Viajemos, pues, a esta excelsa cultura del Siglo de Oro.</p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "La España de <em>El Quijote</em> ", "price": 0, "instructors": "Pedro García Martín", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "5 - 7 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/la_espana_de_el_quijote_378x225.jpg", "course_url": "https://www.edx.org/course/la-espana-de-el-quijote-uamx-quijote501x-0", "subject_name": ["Art & Culture", "History", "Humanities"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<div>Souvent confinée à l’étude des techniques permettant de vendre une encyclopédie en 24 volumes à une octogénaire récalcitrante ou à l’art de marchander son salaire, la négociation est souvent abordée sous un angle exclusivement utilitariste. Mais négocier ce n’est pas se limiter à la recherche du bénéfice maximum. La négociation traverse toutes les dimensions de la vie humaine. Nous négocions tous les jours, dans toutes les sphères de notre existence&nbsp;: au travail, avec la famille, les amis… Dès qu’il s’agit de partager des biens matériels mais aussi de résoudre une divergence d’intérêts, de concilier différentes envies, rêves, goûts, couleurs…<br />\r\n&nbsp;<br />\r\nCe cours s’éloigne de l’approche classique des négociations et tente de rendre compte des phénomènes psychologiques à la base du comportement. L’approche poursuivie sera descriptive plutôt que prescriptive. Contrairement aux théoriciens du jeu qui «&nbsp;examinent ce que de super-hommes, ultra-intelligents et impeccablement rationnels devraient faire dans les situations compétitives&nbsp;», nous explorerons la façon dont «&nbsp;des êtres imparfaits se comportent dans la réalité&nbsp;» (Raïffa, 1982, p. 21). Ainsi, les êtres humains poursuivent des motivations, ont des attentes, des préjugés, des biais et des émotions. Ils analysent l’information qui leur est soumise et prennent des décisions à travers le spectre de leurs propres limites cognitives. Leurs actions fluctuent en fonction de la situation ou de leur personnalité. Toutes ces variables influencent non seulement le comportement des personnes mais, plus fondamentalement, elles modifient la dynamique même de résolution des divergences. Ce cours mettra en évidence ces variables multiples et offrira aux étudiants une compréhension fine et détaillée des processus psychologiques qui entrent en jeu avant, pendant et après toute négociation.<br />\r\n&nbsp;</div>\r\n\r\n<div><em>Ce cours sera enseigné en français.</em><br />\r\n&nbsp;\r\n<hr />Often confined to the study of techniques like selling a 24-volume encyclopedia to a recalcitrant octogenarian or to the art of haggling salary, negotiation is frequently approached from a purely utilitarian perspective. But motivations in negotiations are not limited to the pursuit of maximum profit. Negotiations concern all dimensions of human life. We negotiate every day, in all spheres of our lives: at work, with family, and with friends. We negotiate in attempts to share material goods, but also to solve divergence of interests, to reconcile different desires, dreams, tastes, and colors.<br />\r\n&nbsp;<br />\r\nThis course attempts to account for psychological phenomena at the basis of negotiation behaviors. Our approach will be descriptive rather than prescriptive. Unlike game theorists who “look at what ultra-smart and impeccably rational super-human beings should do in competitive situations,” we will explore how “imperfect beings behave in reality (Raïffa, 1982). Human beings pursue motivations, have expectations, show prejudice, display biases and emotions. They analyze information submitted to them and make decisions that are tainted by their cognitive limitations. Their actions fluctuate as a function of the situation they are embedded in, as well as their personality. All these variables influence not only the behavior of people, but more fundamentally, the very dynamic of negotiation instances. This course will highlight these multiple variables and offer students a detailed understanding of the psychological processes involved before, during, and after negotiation.<br />\r\n&nbsp;<br />\r\n<em>This course is taught in French.</em></div>\r\n", "end_date": "2016-06-28T15:54:21-04:00", "title": "Psychologie de la négociation", "price": 0, "instructors": "Stéphanie Demoulin", "institution_name": ["Université catholique de Louvain"], "commitment": null, "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/psychologie-de-la-negociation_378x225.jpg", "course_url": "https://www.edx.org/course/psychologie-de-la-negociation-louvainx-louv7x-0", "subject_name": ["Business & Management", "Communication", "Social Sciences"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Este curso se imparte en español con subtítulos en inglés, y tanto el material adicional como los ejercicios del curso se ofrecerán en español e inglés. / <em>Th</em><span><em>is course will be taught in Spanish with English subtitles; the required readings as well as the quizzes and other evaluation materials will be provided in both languages</em></span><em><span>.</span></em></p>\r\n\r\n<hr />\r\n<p>Desde que en 1954 se realizara el primer trasplante exitoso de un órgano, la cirugía de trasplantes se ha desarrollado espectacularmente brindando esperanza y calidad de vida a muchos enfermos. Mientras esas técnicas y posibilidades terapéuticas avanzan, persisten sin embargo muchos interrogantes sobre el modo en el que los órganos pueden obtenerse lícitamente. Algunos de esos dilemas nos acompañan desde siempre, otros son suscitados por la aparición de fenómenos novedosos como el turismo de trasplantes, las posibilidades que ofrece la donación tras la muerte cardiocirculatoria o los descubrimientos sobre las funciones fisiológicas remanentes en los pacientes diagnosticados en muerte cerebral. En la inmensa mayoría de los países no se pueden comprar y vender órganos. ¿Por qué? A pesar de que muchas personas siguen muriendo a la espera de recibir un órgano, en ningún país se confiscan los órganos de las personas fallecidas. ¿Por qué? ¿Pueden donar los menores? ¿Debemos prescindir de la conocida como “regla del donante cadáver” y permitir la eutanasia para la donación? ¿Con qué límites? ¿De qué manera influye la potencial condición de donante de un órgano en los cuidados que se proporcionan al final de la vida? ¿Cómo evitar el conflicto de intereses entre quienes velan por la vida de los futuros receptores de un órgano y quienes aún se afanan por cuidar a quien va a fallecer de manera irremisible e inminente?<br />\r\n<br />\r\nEn este curso nos adentraremos en el análisis de ésas y otras cuestiones, pero también introduciremos los nuevos desafíos que para la ética y el Derecho plantean trasplantes novedosos así como la discusión en torno a los criterios de justa distribución de los órganos<br />\r\n&nbsp;<br />\r\n<em>The first successful organ transplantation was performed in 1954. </em><em>Since then, the technique has evolved tremendously, giving hope and increased quality of life to many patients around the world. While the technology and drugs advance, several controversies persist regarding the way in which organs may be obtained. Some of these dilemmas arose on the very first day in which organs’ transplantation originated; others have emerged as a result of new phenomena such as transplantation tourism, the new possibilities brought by donation after cardio-circulatory death, or increasing knowledge about the remaining physiological functions detected in patients pronounced as brain dead. Almost all countries in the world forbid the selling of organs. Why? Although many people die while on the waiting lists, in no country does the Government confiscate cadaveric organs. Why? May minors be organ donors? Should we abandon the so-called “dead donor rule” and allow “organ-donation euthanasia”? How does the potential condition of becoming a donor influence the administration of end-of-life care? How should we avoid the eventual conflict of interests between those who care for the life of future recipients of organs and those who are in charge of the dying patient-eventual-donor? In this course we will explore the answers to these questions, and we will also engage in the assessment of the more recent challenges posed by novel transplantation techniques, and, albeit briefly, in the discussion regarding the fair distribution of organs.&nbsp;</em></p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "Trasplante de órganos - desafíos éticos y jurídicos | Organ Transplantation - Ethical and Legal Challenges", "price": 0, "instructors": "Pablo de Lora, Alicia Pérez Blanco", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "4-6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/trasplante_de_organos_378x225.jpg", "course_url": "https://www.edx.org/course/trasplante-de-organos-desafios-eticos-y-uamx-txetj201x-1", "subject_name": ["Law", "Medicine", "Philosophy & Ethics"], "duration": "9 weeks", "language_name": ["English", "Others"], "provider_name": ["edx"], "start_date": "2016-10-04T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Comment les humains s’organisent-ils en sociétés ? Qu’appelle-t-on « familles » et comment se constituent-elles ? Quel regard et quels types d’analyse l’anthropologie propose-t-elle sur les systèmes de parenté, symboliques, politiques, religieux ?</p>\r\n\r\n<p>L’anthropologie prospective nous aide à comprendre et à anticiper les phénomènes qui transforment nos modes de vie contemporains. Elle pose un regard transversal sur les actions, les pratiques et les dires des personnes avec lesquelles travaillent les chercheurs.</p>\r\n\r\n<p>« Entrer en anthropologie », c’est accepter de changer son regard sur le monde et de se décentrer par rapport à ses habitudes. Si vous désirez comprendre un peu mieux le monde et ses changements contemporains, suivez ces chercheurs sur leur terrain et expérimentez d’autres repères culturels.</p>\r\n\r\n<p>Durant ces quelques heures, vous serez amenés à débattre avec des professeurs et des étudiants autour de questions sur la famille, les migrations, les mondes virtuels ou encore les mondes des invisibles. Vous apprendrez les bases de l'approche anthropologique et ce qu'elle peut vous apporter en termes de réflexion sur votre propre société, sur votre vie et votre quotidienneté. Ce cours vous donne l’opportunité de comparer vos expériences et d’échanger vos points de vue avec des personnes d’autres horizons.</p>\r\n\r\n<p>Les six semaines de cours aborderont une série de thématiques illustrées par des exemples concrets de modes d’existence divers et disséminés sur le globe. Des enseignants plongés au cœur des pratiques sociales et des enjeux politiques et économiques les plus variés partageront avec vous leur expérience après des années d'immersion sur les terrains de recherche qui les passionnent.</p>\r\n\r\n<p>Si vous êtes curieux de tout et que comprendre votre propre société mais aussi des sociétés méconnues vous intéresse, ce cours s'adresse à vous !</p>\r\n\r\n<hr />\r\n<p>How do human beings organize themselves in societies? What do we call “families” and how do they form? What type of analysis does anthropology propose about parenthood, and symbolic, political and religious systems?</p>\r\n\r\n<p>Prospective anthropology helps us to understand and anticipate phenomena that transform our ways of life today. It gives a cross-cutting look at the actions, practices, and words of those people with whom anthropological researchers work.</p>\r\n\r\n<p>To understand anthropology is to accept changing your view of the world, and to shift your perpsective of your own habits. If you want to understand the world and its contemporary changes more deeply, follow these researchers in their field, and experiment with other cultural references.</p>\r\n\r\n<p>In this course, you will debate with professors and students about family, migrations, virtual worlds, and the world of «&nbsp;invisibles.&nbsp;» You will learn the basis of the anthropological approach and what it can bring you as a reflection tool about your own society and your everyday life. This course gives you the opportunity to compare your experiences and to exchange points of view with people from all around the world.</p>\r\n\r\n<p>Professors immersed in the heart of various social practices, political and economic issues will share their experiences with you after years of research in fields that they are passionate about.</p>\r\n\r\n<p>If you are curious about <em>everything</em>, and if you are interested in understanding your own society but also unknown societies, this course is for you!</p>\r\n", "end_date": "2017-10-13T00:00:00-04:00", "title": "Découvrir l'anthropologie", "price": 0, "instructors": "Pierre-Joseph Laurent, Jacinthe Mazzocchetti, Olivier Servais, Anne-Marie Vuillemenot", "institution_name": ["Université catholique de Louvain"], "commitment": "3-4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/louv6x_-_decouvrir_lanthropologie-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/decouvrir-lanthropologie-louvainx-louv6x-0", "subject_name": ["Social Sciences", "Art & Culture", "Humanities"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-13T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Comment décrire l’écoulement d’une rivière ou d’un fleuve ? Quels aménagements vont permettre de limiter les impacts d’événements naturels tels qu’une crue ou une inondation sur la population et les villes avoisinantes ? Comment la rivière évolue-t-elle au fil du temps ? Autant de questions qui reflètent l’importance de la compréhension du fonctionnement des rivières.</p>\r\n\r\n<p>Face aux enjeux majeurs liés à la problématique de l’eau et plus particulièrement à la gestion durable des rivières, ce cours d’hydraulique fluviale va vous donner des clés pour comprendre les écoulements en rivières et leurs interactions avec l’environnement. Cette compréhension joue un rôle primordial pour assurer une gestion responsable de la rivière qui permette d’en tirer profit tout en préservant l’environnement de ses impacts négatifs.</p>\r\n\r\n<p>Ce cours résulte d’une collaboration entre experts de plusieurs universités. Durant les huit semaines de cours, vous serez confrontés successivement à:</p>\r\n\r\n<ul>\r\n\t<li>la modélisation des écoulements à surface libre</li>\r\n\t<li>l’étude des sédiments et du transport solide</li>\r\n\t<li>la caractérisation morphologique des rivières</li>\r\n</ul>\r\n\r\n<p>Au fil des séquences, notions théoriques alterneront avec applications concrètes, notamment sur des sites haïtiens et suisses.</p>\r\n\r\n<p>Afin de consolider vos connaissances, vous serez encouragés à répondre à différents questionnaires ou à interagir concrètement avec les autres participants.</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p align=\"center\"><strong>En collaboration avec le réseau Rescif.</strong>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<br />\r\n&nbsp;<br />\r\n&nbsp;<img src=\"/sites/default/files/rescif_network_logo_for_louv17x.png\" />&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;</p>\r\n", "end_date": "2016-12-12T00:00:00-05:00", "title": "Hydraulique fluviale", "price": 0, "instructors": "Sandra Soares-Frazão, Yves Zech, Mário J. Franca, Pedro Manso, Giovanni De Cesare, Azin Amini, Nyankona Gonomy, Adermus Joseph, Stephen Louis", "institution_name": ["Université catholique de Louvain"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/courseimage-louv17x_378x225.jpg", "course_url": "https://www.edx.org/course/hydraulique-fluviale-louvainx-louv17x", "subject_name": ["Engineering", "Environmental Studies"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-18T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Múltiples y diversas manifestaciones muestran que se están produciendo unos profundos cambios en el mundo. El modelo de la sociedad industrial está dejando paso a un nuevo modelo de sociedad, aún difuso, en el que la capacidad de transformar la información en conocimiento es clave. Es fácil deducir que para esta nueva sociedad emergente se necesita un concepto de educación bien distinto al que requería la sociedad industrial. Sin este cambio educativo difícilmente se podrá conseguir satisfactoriamente el cambio y, consecuentemente, instalarse adecuadamente en un mundo que va a alterarse radicalmente.</p>\r\n\r\n<p>El curso tiene dos objetivos. El primero es presentar el fenómeno de la transformación de la sociedad que estamos viviendo y los fundamentos para definir el mundo que está emergiendo como el de la sociedad del conocimiento.&nbsp; La pretensión de la primera parte es disponer de un escenario suficientemente detallado y sólido de lo que está sucediendo y superar así la visión e interpretación triviales que pueda haber sobre un nuevo modelo de sociedad. Sin esta buena base es difícil fundamentar el siguiente objetivo del curso: el papel de la educación.</p>\r\n\r\n<p>El objetivo de tratar la educación en este curso es para presentarla en estrecha relación con una intensa crisis cultural que inevitablemente tiene que sobrevenir para que no aumente el desajuste entre el mundo tecnológico -planetario, desigual y contradictorio- que hemos levantado y los valores culturales de otros tiempos con los que queremos mirar e interpretar el mundo de hoy y el que se avecina. Así que se tratará la estrecha relación que hay y debe haber entre educación y cultura. De igual modo se verá en el curso la relación entre tecnología y educación, no desde el punto de vista instrumental, sino cultural.</p>\r\n\r\n<p>La pretensión del curso es que de esta observación del fenómeno actual de&nbsp; cambio, y de la interpretación del papel de la educación para la orientación y control de ese cambio, surjan elementos inspiradores de acciones educativas precisas ajustadas a las múltiples realidades concretas desde las que se están sintiendo los desafíos de vivir en el siglo XXI.</p>\r\n\r\n<p>El planteamiento didáctico del curso seguirá la estructura de un viaje por el tiempo, por lugares y también por conceptos que haga ameno el recorrido durante las siete semanas. En cuanto a la parte textual, habrá la experiencia de lectura de piezas multimedia concebidas y escritas para la lectura en pantalla, y especialmente en <em>smartphones</em> y tabletas.</p>\r\n", "end_date": "2016-12-13T00:00:00-05:00", "title": "Utopedia: Educación para una Sociedad del Conocimiento", "price": 0, "instructors": "Antonio Rodríguez de las Heras, Beatriz de las Heras Herrero", "institution_name": ["Universidad Carlos III de Madrid"], "commitment": "4-6 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/hga1x-banner-378x225.jpg", "course_url": "https://www.edx.org/course/utopedia-educacion-para-una-sociedad-del-uc3mx-hga-1x-0", "subject_name": ["Humanities", "Social Sciences", "Communication"], "duration": "9 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-10-18T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Насколько здоровой является экономика? Как экономическая политика может способствовать сохранению или восстановлению здоровья экономики? Эти вопросы находятся в центре финансового программирования.&nbsp;На наших курсах по ФПП вы изучите основные концепции, знание которых необходимо для ответа на эти вопросы.</p>\r\n\r\n<p>Финансовое программирование является основой анализа текущего состояния экономики, прогнозирования направления ее развития и определения мер экономической политики, которые могут изменить это направление.</p>\r\n\r\n<p>Первая часть курса ФПП, проводимого Институтом профессионального и организационного развития МВФ и Объединенным венским институтом, позволит вам приобрести базовые навыки финансового программирования. В рамках курса рассматриваются основные характеристики счетов четырех основных макроэкономических секторов (реального, налогово- бюджетного, внешнеэкономического и денежно-кредитного) и методы анализа и интерпретации этих счетов, а также объясняются существующие между ними взаимосвязи.</p>\r\n\r\n<p>За время обучения экономисты МВФ и ОВИ подробно расскажут вам о макроэкономических счетах и помогут разобраться в деталях экономического анализа. Помимо просмотра видео лекций вам будет предложено ответить на вопросы по поводу изложенных концепций, выполнить небольшие задания с использованием расчетов, обсудить с другими участниками курса экономические процессы в вашей стране, а также поработать с данными на примере условной страны. Необходимые материалы вам будут предоставлены.</p>\r\n\r\n<p>Неважно, являетесь ли вы сотрудником государственного учреждения, занимающимся актуальными для вашей страны экономическими вопросами, или экспертом, работающим с экономическими данными, или же просто хотите лучше понять происходящие в экономике процессы, данный курс поможет вам приобрести необходимые практические навыки макроэкономического анализа. Надеемся, что вместе с нами вы совершите это увлекательное путешествие!</p>\r\n", "end_date": "2016-12-14T00:00:00-05:00", "title": "Финансовое программирование и политика, часть 1: макроэкономические счета и анализ", "price": 0, "instructors": "Мартин Шиндлер, Дмитрий Рожков, Михаил Пранович, Максим Иванина, Асель Исакова ", "institution_name": ["The International Monetary Fund"], "commitment": "8-10 часов в неделю", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fpp_description-378x225.jpg", "course_url": "https://www.edx.org/course/finansovoe-programmirovanie-i-politika-imfx-fpp-1x", "subject_name": ["Economics & Finance"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-11-02T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Ce cours donne les connaissances fondamentales liées aux fonctions trigonométriques, logarithmiques et exponentielles. Il est articulé autour de 9 chapitres:</p>\r\n\r\n<ol>\r\n\t<li>L'angle et sa mesure</li>\r\n\t<li>Les fonctions trigonométriques sinus et cosinus et leurs inverses</li>\r\n\t<li>Les fonctions trigonométriques tangente et cotengente et leurs inverses</li>\r\n\t<li>Les formules trigonométriques (addition, bissection, etc)</li>\r\n\t<li>Les oscillations harmoniques</li>\r\n\t<li>Les équations trigonométriques</li>\r\n\t<li>Les relations dans le triangle (théorème du sinus, du cosinus)</li>\r\n\t<li>Continuité et dérivabilité des fonctions trigonométriques</li>\r\n\t<li>Les fonctions logarithmiques et exponentielles</li>\r\n</ol>\r\n\r\n<p>Le cours propose une approche très détaillée et précise&nbsp;des notions fondamentales liées aux fonctions trigonométriques, logarithmiques et exponentielles. La présentation des concepts et des propositions est soutenue par une grande gamme de figures et d'animations, ainsi que par des exemples qui illustrent la mise en oeuvre des connaissances acquises.</p>\r\n", "end_date": "2016-12-31T00:00:00-05:00", "title": "Cours préparatoire: Fonctions Trigonométriques, Logarithmiques et Exponentielles", "price": 0, "instructors": "Hans-Jörg Ruppen", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "3 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/cours-preparatoire_378x225.jpg", "course_url": "https://www.edx.org/course/cours-preparatoire-fonctions-epflx-trigoexpx-1", "subject_name": ["Math"], "duration": "12 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-11-12T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Vous voulez apprendre l'algèbre linéaire, un précieux outil complémentaire à vos connaissances acquises durant vos études en économie, ingénierie, physique, ou statistique? Ou simplement pour la beauté de la matière? Alors ce cours est fait pour vous! Outre remplir le rôle d'outil dans les différentes branches mentionnées ci-dessus (permettant la résolution de problèmes concrets), l'algèbre linéaire, qui capture l'essence des mathématiques -à savoir, l'algèbre et la géométrie- vous introduira au monde plus abstrait des mathématiques.</p>\r\n\r\n<p>Proposé comme complément de cours aux ingénieurs de première année à l'Ecole Polytechnique Fédérale de Lausanne, ce MOOC (composé de trois parties) n'en est pas moins un cours à part entière et peut être considéré comme une base solide d'algèbre linéaire pour tout étudiant intéressé par l'apprentissage de cette matière.</p>\r\n\r\n<p>Bien que les vidéos constituent le coeur du cours, des exercices de type QCM (Questions à choix multiples) ainsi que des séries au format PDF seront disponibles chaque semaine, ainsi que des corrigés appropriés. Plus précisément, les séries d'exercices seront accompagnées d'un corrigé au format PDF et certains problèmes bénéficieront d'une correction détaillée en vidéo, dans laquelle l'un des enseignants présentera la solution, étape par étape. Finalement, chaque vidéo de cours sera suivie d'un quiz, dont le but est de tester le degré d’assimilation des connaissances acquises.</p>\r\n\r\n<p>Le cours est organisé en dix chapitres dans lesquels une approche très détaillée des concepts théoriques est proposée, ainsi que de multiples exemples illustratifs :</p>\r\n\r\n<p>1) Systèmes d'équations linéaires.</p>\r\n\r\n<p>2) Algèbre matricielle.</p>\r\n\r\n<p>3) Espaces vectoriels.</p>\r\n\r\n<p>4) Bases et dimensions.</p>\r\n\r\n<p>5) Applications linéaires.&nbsp;&nbsp;&nbsp;</p>\r\n\r\n<p>6) Matrices et applications linéaires.</p>\r\n\r\n<p>7) Déterminants.</p>\r\n\r\n<p>8) Vecteurs propres, valeurs propres, diagonalisation.</p>\r\n\r\n<p>9) Produits scalaires et espaces euclidiens.</p>\r\n\r\n<p>10) Matrices orthogonales et matrices symétriques.</p>\r\n\r\n<p>Cette première partie du cours sera dévouée à l'étude des quatre premiers chapitres cités plus haut. Aucune connaissance particulière n’est requise pour comprendre les concepts abordés dans ce MOOC, mais il est conseillé de travailler régulièrement et de manière assidue, de façon à ne pas prendre de retard lors de l'apprentissage de la matière.</p>\r\n", "end_date": "2016-06-28T15:23:26-04:00", "title": "Algèbre Linéaire (Partie 1)", "price": 0, "instructors": "Donna Testerman, Claude Marion, Mikaël Cavallin", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "6 - 8 heures/semaine", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/algebrex-algebre_lineaire_part_1-378x225.jpg", "course_url": "https://www.edx.org/course/algebre-lineaire-partie-1-epflx-algebrex-0", "subject_name": ["Math", "Engineering"], "duration": null, "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-01T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Vous voulez apprendre l'algèbre linéaire, un précieux outil complémentaire à vos connaissances acquises durant vos études en économie, ingénierie, physique, ou statistique? Ou simplement pour la beauté de la matière? Alors ce cours est fait pour vous! Outre remplir le rôle d'outil dans les différentes branches mentionnées ci-dessus (permettant la résolution de problèmes concrets), l'algèbre linéaire, qui capture l'essence des mathématiques -à savoir, l'algèbre et la géométrie- vous introduira au monde plus abstrait des mathématiques.</p>\r\n\r\n<p>Proposé comme complément de cours aux ingénieurs de première année à l'Ecole Polytechnique Fédérale de Lausanne, ce MOOC (composé de trois parties) n'en est pas moins un cours à part entière et peut être considéré comme une base solide d'algèbre linéaire pour tout étudiant intéressé par l'apprentissage de cette matière.</p>\r\n\r\n<p>Bien que les vidéos constituent le coeur du cours, des exercices de type QCM (Questions à choix multiples) ainsi que des séries au format PDF seront disponibles chaque semaine, ainsi que des corrigés appropriés. Plus précisément, les séries d'exercices seront accompagnées d'un corrigé au format PDF et certains problèmes bénéficieront d'une correction détaillée en vidéo, dans laquelle l'un des enseignants présentera la solution, étape par étape. Finalement, chaque vidéo de cours sera suivie d'un quiz, dont le but est de tester le degré d’assimilation des connaissances acquises.</p>\r\n\r\n<p>Le cours est organisé en dix chapitres dans lesquels une approche très détaillée des concepts théoriques est proposée, ainsi que de multiples exemples illustratifs :</p>\r\n\r\n<ol>\r\n\t<li>Systèmes d'équations linéaires.</li>\r\n\t<li>Algèbre matricielle.</li>\r\n\t<li>Espaces vectoriels.</li>\r\n\t<li>Bases et dimensions.</li>\r\n\t<li>Applications linéaires.&nbsp;&nbsp;</li>\r\n\t<li>Matrices et applications linéaires.</li>\r\n\t<li>Déterminants.</li>\r\n\t<li>Vecteurs propres, valeurs propres, diagonalisation.</li>\r\n\t<li>Produits scalaires et espaces euclidiens.</li>\r\n\t<li>Matrices orthogonales et matrices symétriques.</li>\r\n</ol>\r\n\r\n<p>Cette deuxième partie du cours sera dévouée à l'étude des chapitres 5 à 8 cités plus haut. Une bonne connaissance de la matière enseignée dans le MOOC <em>Algèbre Linéaire (Partie 1)</em> est requise. Aussi, il est conseillé de travailler régulièrement et de manière assidue, de façon à ne pas prendre de retard lors de l'apprentissage de la matière.&nbsp;</p>\r\n", "end_date": "2016-06-28T16:01:02-04:00", "title": "Algèbre Linéaire (Partie 2)", "price": 0, "instructors": "Donna Testerman, Claude Marion, Mikaël Cavallin", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "6-8 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/algebra-v1-course-thumbnail-378x225.jpg", "course_url": "https://www.edx.org/course/algebre-lineaire-partie-2-epflx-algebre2x-0", "subject_name": ["Math", "Engineering"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-01T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Vous voulez apprendre l'algèbre linéaire, un précieux outil complémentaire à vos connaissances acquises durant vos études en économie, ingénierie, physique, ou statistique? Ou simplement pour la beauté de la matière? Alors ce cours est fait pour vous! Outre remplir le rôle d'outil dans les différentes branches mentionnées ci-dessus (permettant la résolution de problèmes concrets), l'algèbre linéaire, qui capture l'essence des mathématiques -à savoir, l'algèbre et la géométrie- vous introduira au monde plus abstrait des mathématiques.</p>\r\n\r\n<p>Proposé comme complément de cours aux ingénieurs de première année à l'Ecole Polytechnique Fédérale de Lausanne, ce MOOC (composé de trois parties) n'en est pas moins un cours à part entière et peut être considéré comme une base solide d'algèbre linéaire pour tout étudiant intéressé par l'apprentissage de cette matière.</p>\r\n\r\n<p>Bien que les vidéos constituent le coeur du cours, des exercices de type QCM (Questions à choix multiples) ainsi que des séries au format PDF seront disponibles chaque semaine, ainsi que des corrigés appropriés. Plus précisément, les séries d'exercices seront accompagnées d'un corrigé au format PDF et certains problèmes bénéficieront d'une correction détaillée en vidéo, dans laquelle l'un des enseignants présentera la solution, étape par étape. Finalement, chaque vidéo de cours sera suivie d'un quiz, dont le but est de tester le degré d’assimilation des connaissances acquises.</p>\r\n\r\n<p>Le cours est organisé en dix chapitres dans lesquels une approche très détaillée des concepts théoriques est proposée, ainsi que de multiples exemples illustratifs :</p>\r\n\r\n<ol>\r\n\t<li>Systèmes d'équations linéaires.</li>\r\n\t<li>Algèbre matricielle.</li>\r\n\t<li>Espaces vectoriels.</li>\r\n\t<li>Bases et dimensions.</li>\r\n\t<li>Applications linéaires.&nbsp;&nbsp;</li>\r\n\t<li>Matrices et applications linéaires.</li>\r\n\t<li>Déterminants.</li>\r\n\t<li>Vecteurs propres, valeurs propres, diagonalisation.</li>\r\n\t<li>Produits scalaires et espaces euclidiens.</li>\r\n\t<li>Matrices orthogonales et matrices symétriques.</li>\r\n</ol>\r\n\r\n<p>Cette troisième (et dernière) partie du cours sera dévouée à l'étude des chapitres 9 et 10 cités plus haut. Une bonne connaissance de la matière enseignée dans les MOOCs&nbsp;<em>Algèbre Linéaire (Partie 1) </em>et <em>Algébre Linéaire (Partie 2) </em>est requise. Aussi, il est conseillé de travailler régulièrement et de manière assidue, de façon à ne pas prendre de retard lors de l'apprentissage de la matière.&nbsp;</p>\r\n", "end_date": "2016-06-28T15:29:49-04:00", "title": "Algèbre Linéaire (Partie 3)", "price": 0, "instructors": "Donna Testerman, Claude Marion, Mikaël Cavallin", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "6 - 8 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/algebrex-algebre_lineaire_part_1-378x225_0.jpg", "course_url": "https://www.edx.org/course/algebre-lineaire-partie-3-epflx-algebre3x-0", "subject_name": ["Math", "Engineering"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-01T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Ce cours est une première introduction à la mécanique des fluides. Nous allons aborder tout d'abord les propriétés physiques des fluides : les états de la matière et la notion de viscosité. Un chapitre sera dédié à la tension de surface et à la capillarité. Nous introduirons ensuite le concept de similitude et l’utilisation des nombres adimensionnels. Nous allons alors considérer la statique des fluides à travers la loi de l'hydrostatique. La dynamique des fluides sera abordée en premier lieu par la cinématique. Ensuite, nous traiterons des équations de bilan avec notamment une application du théorème de conservation de l’énergie cinétique : le théorème de Bernoulli. Dans le dernier, nous montrerons que ce théorème relativement simple permet d’expliquer et de calculer des écoulements tels que ceux observés dans les rivières. Les vidéos du cours seront enrichies de vidéos d’expériences qui illustreront les concepts clés et par des quiz pour tester votre intuition et vos connaissances. Le dernier module vous permettra de piloter à distance une expérience d'hydraulique qui a lieu dans les laboratoires de l'EPFL.</p>\r\n\r\n<p>This course is presented in French.&nbsp;</p>\r\n", "end_date": "2016-06-28T15:10:44-04:00", "title": "Mecanique des Fluides", "price": 0, "instructors": "Christophe Ancey, François Gallaire, Marco Ramaioli", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "60 heures", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/dynamique_des_fluides_v1.0_course_banner_378x225.jpg", "course_url": "https://www.edx.org/course/mecanique-des-fluides-epflx-mf201x-1", "subject_name": ["Engineering", "Physics"], "duration": "8 weeks", "language_name": ["English", "Others"], "provider_name": ["edx"], "start_date": "2016-02-15T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Ce cours définit les notions de base des circuits électriques composés des trois éléments passifs (résistance, inductance et condensateur), linéaires et des sources de tension et de courant.</p>\r\n\r\n<p>On traite ces circuits avec les lois élémentaires de l'électricité puis on développe une série de méthodes de combinaisons des éléments et de transformations du circuit qui mènent à leur simplification et permettent une analyse aisée des courants, tensions et puissances présents. Quelques circuits particuliers classiques sont présentés.&nbsp;</p>\r\n\r\n<p>Toutes ces méthodes sont premièrement développées en régime continu puis elles sont généralisées au régime alternatif, faisant intervenir le calcul complexe. L'importance du régime alternatif réside dans le fait qu'il est omniprésent au niveau de la distribution électrique domestique et industrielle.</p>\r\n\r\n<p>This course is presented in French.</p>\r\n", "end_date": "2016-06-28T14:26:52-04:00", "title": "Electrotechnique I", "price": 0, "instructors": "Yves Perriard, Paolo Germano", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "4 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/electrotechnique_378x225.jpg", "course_url": "https://www.edx.org/course/electrotechnique-i-epflx-ee-100bx-1", "subject_name": ["Electronics", "Engineering", "Science"], "duration": "8 weeks", "language_name": ["English", "Others"], "provider_name": ["edx"], "start_date": "2016-02-26T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>This course is presented in French, with English subtitles.</p>\r\n\r\n<p>Ce cours traite des systèmes alternatifs triphasés, piliers de l'alimentation électrique industrielle et de certains types de machines électriques. Les charges triphasées associées, symétriques ou dissymétriques, seront étudiées ainsi que les puissances actives, réactives et apparentes qui en découlent. Des méthodes de compensation de la puissance réactive seront développées.</p>\r\n\r\n<p>Ce cours traite également des régimes transitoires, induits par les enclenchements, déclenchements ou pannes de circuits sur leur source, qu'elle soit continue ou alternative. L'importance de l'étude des régimes transitoires réside dans le fait qu'ils sont la base du fonctionnement d'appareils que l'on retrouve dans de nombreuses applications modernes comme la distribution d'énergie, les entraînements électriques, la recharge de batteries, les alimentations à découpage ou encore de l'éclairage.</p>\r\n", "end_date": "2016-04-30T00:00:00-04:00", "title": "Electrotechnique II", "price": 0, "instructors": "Yves Perriard, Paolo Germano", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "4 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/electrotechnique_378x225_0.jpg", "course_url": "https://www.edx.org/course/electrotechnique-ii-epflx-ee-102b-1x", "subject_name": ["Electronics", "Engineering", "Science"], "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-26T00:00:00-05:00"},
{"selfpaced": true, "description": "<p>Acerca de este curso</p>\r\n\r\n<p>El curso aborda un tema que se mantiene vigente en la antropología de la música y la sociología de la cultura: la amplia gama de relaciones que se dan entre los hechos musicales y los grupos humanos que toman parte en ellas. Las discusiones al respecto se han planteado en distintos campos y disciplinas del conocimiento interesadas en la dimensión sonora de la cultura como los estudios en comunicación, la musicología, la antropología y la psicología.</p>\r\n\r\n<p>A través de este curso viajaras por el pacifico y lograras interpretar a partir de elementos conceptuales y metodológicos de la antropología simbólica, prácticas musicales del pacifico colombiano asociadas a la espiritualidad, el Territorio y la Política.</p>\r\n\r\n<p>Disfruta de este viaje y contribuye al desarrollo de nuevas maneras de comprender y trabajar en favor de la diversidad cultural característica de Colombia, en particular en las maneras que superen algunas de las dificultades del actual modelo multi culturalista.&nbsp;</p>\r\n", "end_date": "2016-05-27T00:00:00-04:00", "title": "Antropología de la Música: El Caso de las Músicas del Pacífico Colombiano", "price": 0, "instructors": "Manuel Enrique Sevilla Peñuela", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "6 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/puj.e.1601x.05-course_card-378x225.jpg", "course_url": "https://www.edx.org/course/antropologia-de-la-musica-el-caso-de-las-javerianax-puj-e-1601x-05", "subject_name": ["Art & Culture", "Humanities", "Social Sciences"], "duration": "9 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-03-28T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Android es la plataforma libre desarrollada por Google, ampliamente utilizada en multitud de dispositivos como móviles, tabletas, TV, wearables o sistemas empotrados. Su expansión ha sido espectacular, superando en la actualidad al S.O. Microsoft Windows. Tras realizar este curso conocerás los fundamentos del desarrollo de aplicaciones en Android y podrás realizar sencillas aplicaciones, que incluyan los aspectos más importantes y novedosos de esta plataforma.<br />\r\n<br />\r\nA lo largo del curso se desarrolla una aplicación de ejemplo, \"Mis Lugares Favoritos\", que nos permitirá almacenar fotografía, posición geográfica, valoración y otros datos de los locales que más nos gustan. El curso se introducen los siguientes aspectos: repaso de Java, visión general de Android, entorno de desarrollo (Eclipse), Interfaz de usuario (vistas, Layouts, recursos, barra de acciones, preferencias, ListView, Fragments...), actividades, intenciones, seguridad, posicionamiento, mapas y bases de datos.</p>\r\n", "end_date": "2016-06-16T00:00:00-04:00", "title": "Android: Introducción a la Programación", "price": 0, "instructors": "Dr. Jesús Tomás Gironés", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "5 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/android-introduccion-a-la-programacion_378x225.jpg", "course_url": "https://www.edx.org/course/android-introduccion-la-programacion-upvalenciax-aip201x-0", "subject_name": ["Computer Science"], "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-05T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso está destinado a estudiantes universitarios de la rama de las Tecnologías de la Información y las Comunicaciones que quieran conocer los mecanismos fundamentales de las comunicaciones por fibra óptica. También es adecuado para profesionales relacionados con las instalaciones de fibra óptica que deseen comprender aspectos fundamentales sobre la generación, propagación y detección de la señal óptica.<br />\r\n<br />\r\nEn él aprenderás los conceptos básicos relacionados con las comunicaciones ópticas. Tras comprender la importancia de las redes ópticas en la actualidad atendiendo a la evolución de la demanda y los servicios, se explicarán los fundamentos del guiado de la luz en la fibra óptica, así como las características de los modos propagados por fibras multimodo y monomodo. A continuación se estudiarán la atenuación y la dispersión, como efectos fundamentales de propagación en la fibra óptica, así como las limitaciones que éstos suponen en alcance y capacidad máxima. También se explicará la generación de señal óptica en LEDs y láseres, así como la detección y recuperación de la información transmitida por la fibra. Finalmente, el último capítulo permitirá al alumno realizar los cálculos necesarios para diseñar un sistema de comunicaciones ópticas, con la posibilidad de emplear técnicas multicanal WDM o SCM en estos sistemas.</p>\r\n", "end_date": "2016-05-23T00:00:00-04:00", "title": "Fundamentos de Comunicaciones Ópticas", "price": 0, "instructors": "Dr. José Capmany Francoy, Dra. Beatriz Ortega Tamarit", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fundamentos-de-comunicaciones-opticas_378x225.jpg", "course_url": "https://www.edx.org/course/fundamentos-de-comunicaciones-opticas-upvalenciax-fco201x-0", "subject_name": ["Engineering"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-05T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Los materiales que utilizamos diariamente y los objetos que nos rodean están formados por sustancias químicas cuyas propiedades, aplicaciones y transformaciones dependen del tipo de enlace que las caracteriza. El tipo de enlace condiciona la interacción entre las moléculas de un compuesto. El estudio del enlace típico de un compuesto y de las interacciones entre sus moléculas es competencia de la Química, una materia básica que se estudia en muchas titulaciones universitarias. Este curso va dirigido a los alumnos que acceden a la Universidad, especialmente aquellos que no han cursado Química y que requieren de los conocimientos básicos en estos aspectos.<br />\r\n&nbsp;<br />\r\nEn este curso aprenderás a identificar los tipos de enlace que pueden presentarse en los diferentes compuestos químicos y a predecir qué tipo de enlace predomina en un compuesto en base a las características de los elementos que lo constituyen. Así mismo, podrás deducir qué enlace presenta un compuesto observando sus características y comportamiento. Profundizarás en el estudio del enlace covalente y entenderás la relación entre las interacciones moleculares y las propiedades físicas de los compuestos. En definitiva, adquirirás las habilidades necesarias para reconocer todo tipo de enlaces y relacionar la estructura de un compuesto con las propiedades físicas que manifiesta.<br />\r\n&nbsp;<br />\r\nEn el curso trataremos:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Enlace químico y tipos</li>\r\n\t<li>Enlace iónico y metálico</li>\r\n\t<li>Enlace covalente. Geometría y propiedades de las moléculas</li>\r\n\t<li>Interacciones moleculares</li>\r\n</ol>\r\n", "end_date": "2015-05-09T00:00:00-04:00", "title": "El Enlace Químico y las Interacciones Moleculares", "price": 0, "instructors": "Juan Antonio Llorens Molina, Isabel Morera Bertomeu", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/el-enlace-quimico-y-las-interacciones-moleculares_378x225.jpg", "course_url": "https://www.edx.org/course/el-enlace-quimico-y-las-interacciones-upvalenciax-iq101-2x-0", "subject_name": ["Chemistry"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-12T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>En un mundo virtual en el que hay cientos de millones de páginas disponibles con informacion de todo tipo, buscar en Internet de forma eficaz es una habilidad cada día más necesaria. Aprende con nosotros a separar el grano de la paja usando las herramientas disponibles y realizando las preguntas de forma adecuada.<br />\r\n&nbsp;<br />\r\nEn el curso aprenderás a planificar una búsqueda desde el comienzo y a utilizar las diversas herramientas que Internet pone a tu alcance para que encuentres aquello que necesitas. Veremos herramientas para buscar vídeos, imágenes, contenido libre de derechos e información institucional, entre otras muchas cosas.</p>\r\n", "end_date": "2016-06-06T00:00:00-04:00", "title": "Buscar en Internet", "price": 0, "instructors": "Jaime  Busquets, Ignacio Despujol Zabala, Ana María Checa Rubio", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/buscar-en-internet_378x225.jpg", "course_url": "https://www.edx.org/course/buscar-en-internet-upvalenciax-bi101x-0", "subject_name": ["Computer Science"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-19T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>수업에 관하여&nbsp;</p>\r\n\r\n<p>많은 사람들이 훌륭한 아이디어와 기술을 가지고 있습니다. 하지만 \"당신의 고객은 누구입니까?\"라는 단순하지만 피해갈 수 없는 질문 하나로 갈피를 못 잡고 무너지곤 합니다.&nbsp;</p>\r\n\r\n<p>MIT공대는 수년간 이 질문을 기업가 학생들에게 던지면서 아주 성공적인 결과를 이루어냈습니다. MIT동문들이 세운 2만5천6백개의 기업들은 2조 달러 규모의 수익을 창출해냈으며 330만여개의 일자리를 만들어냈습니다. MIT가 국가였다면 세계에서 11번째로 큰 경제강국이 됐을 것입니다.&nbsp;</p>\r\n\r\n<p>여러분도 이 MIT 국가의 국민이 되어보세요. 여러분의 스타트업 여정을 MIT와 함께하시면서 성공의 핵심이 될 고객에 대해서 발견하는 시간을 가져보세요.&nbsp;</p>\r\n\r\n<p>이 강의는 기업가정신에 대한 수업으로 &nbsp;딱딱한 대학강의와는 거리가 멉니다. 매 수업시간마다 모바일 애플리케이션, 3D 프린팅, 전기전자, 국제개발, 손목시계 개발 등 다양한 분야의 MIT 출신 기업가들에 대한 심층적이고 전문적인 사례연구가 준비되어 있습니다.&nbsp;</p>\r\n\r\n<p>이러한 사례연구를 통해 여러분의 아이디어나 기술이 제품 단계로 넘어갔을 때 누가, 또 왜, 제품 구매의향을 가지게 되는지에 대한 공부를 할 것입니다. 과제물은 실제상황에 기반한 예제로 구성되어 있습니다. 구체적이고 실용적이며 효율적인 과정단계를 통해 예제를 풀면서, 이를 여러분 아이디어의 실체를 찾는 데 적용한다면 큰 도움이 될 것입니다.&nbsp;</p>\r\n\r\n<p>그럼 즐거운 수업 되시길 바랍니다!&nbsp;</p>\r\n\r\n<p>이 수업의 Verified certificate를 받은 학생들은 다른 여러가지 특전과 더불어 일년 동안 5백달러 어치의 AWS 프로모션 크레딧을 사용할 수 있는 AWS Activate 회원 자격이 주어집니다.&nbsp;</p>\r\n", "end_date": "2016-06-28T16:01:02-04:00", "title": "스타트업 기업가정신 101: 당신의 고객은 누구입니까? ", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/e101_banner_kor1_378x225.jpg", "course_url": "https://www.edx.org/course/seutateueob-gieobgajeongsin-101-mitx-15-390-1x", "subject_name": ["Business & Management"], "duration": null, "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-25T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Se conocerán los distintos sistemas de georreferenciación/navegación aplicados a dispositivos&nbsp;móviles, la estructura de los Sistemas de Información Geográfica (SIG) y su aplicabilidad a la&nbsp;gestión del territorio y se describirán los sistemas de comunicación existentes (GPRS/UMTS,&nbsp;internet), con el objeto de analizar las aplicaciones a la ingeniería y la gestión del territorio&nbsp;que proporciona la integración de estos tres sistemas en los dispositivos móviles.</p>\r\n\r\n<p>Asimismo, se describirán los principales software de navegación y gestión de la información (SIG) existentes en el mercado para dispositivos móviles, incluyendo prácticas con algunos de ellos. Por último, se realizara una valoración de&nbsp;las distintas aplicaciones que pueden proporcionar los dispositivos móviles para la gestión del&nbsp;territorio, para la ingeniería, geografía, geología, ciencias medio ambientales…</p>\r\n", "end_date": "2016-06-06T00:00:00-04:00", "title": "Dispositivos Móviles para la Gestión del Territorio", "price": 0, "instructors": "Israel Quintanilla García, Aurea Gallego Salguero", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/dispositivos-moviles-para-la-gestion-del-territorio_378x225.jpg", "course_url": "https://www.edx.org/course/dispositivos-moviles-para-la-gestion-del-upvalenciax-dmt201x-0", "subject_name": ["Engineering"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-26T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Se aborda el estudio del universo físico analizando objetos en movimiento. Se definen y analizan todas las magnitudes y leyes físicas que permiten describir geométrica y causalmente el movimiento de cuerpos representados por un punto.</p>\r\n\r\n<p>Trataremos:</p>\r\n\r\n<ul>\r\n\t<li>Magnitudes físicas y álgebra vectorial</li>\r\n\t<li>Fundamentos de cinemática del punto</li>\r\n\t<li>Tipos de movimiento</li>\r\n\t<li>Dinámica del punto</li>\r\n\t<li>Trabajo y potencia</li>\r\n\t<li>Energía mecánica</li>\r\n</ul>\r\n", "end_date": "2016-06-06T00:00:00-04:00", "title": "Fundamentos de Mecánica para Ingeniería", "price": 0, "instructors": "Pilar Candelas Valiente, M. Ángeles Hernández Fenollosa, Constanza Rubio Michavila, Marcos Giménez Valentín, Joaquín Cerdá Boluda", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fundamentos-de-mecanica-para-ingenieria_378x225.jpg", "course_url": "https://www.edx.org/course/fundamentos-de-mecanica-para-ingenieria-upvalenciax-ffi101-1x-0", "subject_name": ["Physics"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-26T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>¿Quieres ser capaz de valorar de forma analítica a Cristiano Ronaldo o a Fernando Torres usando el Proceso Analítico Jerárquico (AHP), método empleado a nivel mundial para la valoración de todo tipo de activos?</p>\r\n\r\n<p>El mundo del deporte mueve miles de millones de euros, muchos de los cuales se invierten en los traspasos de deportistas entre equipos. La valoración de futbolistas es tema complejo en el que influyen muchas variables con relaciones complejas.</p>\r\n\r\n<p>En el curso aprenderás a utilizar herramientas que permiten seleccionar de una forma objetiva el mejor jugador para una posición dada o estimar el valor del traspaso de un jugador utilizando las cantidades pagadas por jugadores similares en operaciones recientes.</p>\r\n\r\n<p>El contenido del curso es el siguiente:</p>\r\n\r\n<p>Unidad 1: El mundo del deporte y la valoración<br />\r\nUnidad 2: El proceso analítico jerárquico (AHP)<br />\r\nUnidad 3: Aplicación de AHP a la valoración de deportistas<br />\r\nUnidad 4: Ejemplos</p>\r\n\r\n<p>Este curso está actualmente en modo autónomo o “self-paced”. ¿Qué significa esto? Que puedes empezarlo cuando quieras y seguirlo a tu ritmo ya que no hay fecha prevista de cierre y cada 6-8 semanas se generarán certificados a aquellos que lo hayan superado. Por otro lado los profesores participarán algo menos en los foros, seguirás teniendo soporte por su parte pero es posible que tarde algo más en contestar tus dudas.<br />\r\n<br />\r\nThis course is taught in Spanish with English subtitles.</p>\r\n", "end_date": "2016-05-17T00:00:00-04:00", "title": "Valoración de Futbolistas con el Método AHP", "price": 0, "instructors": "Dr. Jerónimo Aznar, Dr. Francisco Guijarro Martínez", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/valoracion-de-futbolistas_378x225.jpg", "course_url": "https://www.edx.org/course/valoracion-de-futbolistas-con-el-metodo-upvalenciax-vf201x-0", "subject_name": ["Business & Management"], "duration": "3 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-26T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Si en el mundo existe tanta agua dulce, 35 millones de km3 para ser exactos… ¿cómo es posible que hoy más de 750 millones de personas no tengan acceso al agua? Al mismo tiempo, el continente Americano cuenta con el 31% de las reservas de agua dulce del mundo. ¿Es posible que los países que conforman América Latina puedan aprovechar esta situación y transformarla en una gran oportunidad?</p>\r\n\r\n<p>Si deseas dar respuesta a estas preguntas y otras parecidas, ¡este curso es para ti! Su objetivo es que quienes participen tomen conciencia sobre la creciente demanda de agua a nivel mundial y la situación privilegiada de América Latina y el Caribe en este contexto.</p>\r\n\r\n<p>De esta forma, el curso te llevará hacia una reflexión sobre el rol del agua en la sociedad, sus usos y su potencial y, además, te presentará los métodos y herramientas existentes para la asignación de los recursos hídricos disponibles y, así, obtener el máximo beneficio y evitar el despilfarro. No te pierdas la oportunidad de analizar los usos del agua y riesgos del acceso a los recursos hídricos en la región, a través de la mirada interdisciplinar.</p>\r\n\r\n<p>Además, haremos uso de aplicaciones web, como juegos o interacciones que promueven la colaboración y la aplicabilidad de los conceptos presentados por nuestros instructores. Incluso, a lo largo del curso, las actividades propuestas permitirán al participante poner en práctica lo aprendido en su lugar de residencia.</p>\r\n\r\n<p>Ya lo sabes: ¡te esperamos en “Agua en América Latina: abundancia en medio de la escasez mundial”</p>\r\n", "end_date": "2016-07-12T00:00:00-04:00", "title": "Agua en América Latina: Abundancia en medio de la escasez mundial", "price": 0, "instructors": "Juan Mauricio Benavides, Mario Díaz Granados, Luis Alejandro Camacho, Jorge Higinio Maldonado, Juan Camilo Cárdenas, Fernando Miralles-Wilhelm, Fernando Bretas, Jorge Ducci, Coral Fernández Illescas, Alfred Grünwaldt", "institution_name": ["Inter-American Development Bank"], "commitment": "6-7 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb3x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/agua-en-america-latina-abundancia-en-idbx-idb3x-0", "subject_name": ["Environmental Studies", "Economics & Finance"], "duration": "10 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-03T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso se concibe como una revisión de los conceptos básicos del cálculo diferencial, necesarios para los primeros cursos de aquellos estudios universitarior en los que se imparte matemáticas. Nuestro objetivo es proporcionar un curso básico sobre funciones y derivadas, incluyendo sus aplicaciones.</p>\r\n", "end_date": "2016-06-03T00:00:00-04:00", "title": "Bases Matemáticas: Derivadas", "price": 0, "instructors": "Dr. Santiago Moll López, Dr. José Antonio Moraño Fernández", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bases-matematicas-derivadas_378x225.jpg", "course_url": "https://www.edx.org/course/bases-matematicas-derivadas-upvalenciax-bmd101x-0", "subject_name": ["Math"], "duration": "5 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-03T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este es un curso destinado a profesores de todos los niveles. En él aprenderás a sacar partido de las nuevas tecnologías en tu labor docente para crear una experiencia de aprendizaje nueva y enriquecedora. Si eres profesor y quieres conocer la nueva enseñanza que viene, no puedes perdértelo.<br />\r\n&nbsp;<br />\r\nCon un proyector de vídeo y un ordenador conectado a Internet se pueden hacer cosas increíbles en el aula. Incluso sin este equipamiento, es posible utilizar los distintos servicios y plataformas disponibles en Internet para crear una nueva y enriquecedora experiencia de aprendizaje.<br />\r\n&nbsp;<br />\r\nEn este curso aprenderás a encontrar información en Internet de gran utilidad para tu labor docente&nbsp; y a utilizar herramientas para crear presentaciones visuales impactantes y estimulantes. Conocerás multitud de plataformas y herramientas disponibles en Internet que permiten crear nuevas experiencias de enseñanza-aprendizaje, así como crear una comunicación increíblemente eficaz, tanto profesor-alumno como alumno-alumno. El aprendizaje con tecnología es multi-plataforma y multi-dispositivo, y se extiende más allá del aula, incluso de una forma global.</p>\r\n", "end_date": "2016-07-18T00:00:00-04:00", "title": "Tecnologías para la Educación", "price": 0, "instructors": "Miguel Ferrando Bataller, Ignacio Despujol, Linda Castañeda Quintero", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/tecnologias-para-la-educacion_378x225.jpg", "course_url": "https://www.edx.org/course/tecnologias-para-la-educacion-upvalenciax-te201x-0", "subject_name": ["Computer Science", "Social Sciences"], "duration": "11 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-03T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>수업에 관하여</p>\r\n\r\n<p>고객이 나를 위해 무엇을 해줄 것인지 생각하지 말고, 내가 고객을 위해 무엇을 해줄 것인지 생각해라.</p>\r\n\r\n<p>기업가정신 101 에서는 고객의 관점에서 세상을 바라보는 방법을 배웠습니다. 세상을 바라보는 참 멋진 관점이었죠?</p>\r\n\r\n<p>그러나 아이디어를 구체화하는 여정은 여기서 멈추지않습니다. 물론 끝에 어느정도 가까이 왔지만 정말 끝에 다다르기 까지는 아직도 배워야할 것이 많이 남았습니다.</p>\r\n\r\n<p>고객을 찾는 것과 동등하게 중요한 것이 바로 고객의 문제점을 해결해줄 수 있는 제품을 만드는 것입니다. 이를 위해 많은 질문을 해봐야합니다. 고객이 어떻게 제품을 획득하는가? 제품이 고객의 문제점을 어떻게 해결해줄 것인가? 제품이 어떤 가치를 지니고 있나? 나만의 '비밀소스'는 무엇인가? 나는 경쟁상대에 비해 어디에 위치하나?</p>\r\n\r\n<p>101에이어 기업가정신 102 강의 역시 다양한 분야의 기업가들의 사례연구를 심층분석합니다. 가상공간상의 영생(virtual immortality), 중소기업 마케팅, 도시 디자인, 언어 교육, 의료보건, 기업가 지원 서비스 등 여러 분야의 기업가들이 어떻게 제품 컨셉트를 개발하고, 고객의 문제점을 해결하며, 가치 제안을 정량화했는지, 또 어떻게 비밀소스를 개선하고, 경쟁자를 파악했는지 알아보겠습니다.</p>\r\n\r\n<p>여정은 계속됩니다. 함께 하시겠습니까? 고객이 기다리고 있습니다.</p>\r\n\r\n<p>이 수업의 Verified certificate 를 받은 학생들은 다른 여러가지 특전과 더불어 일년 동안 5백달러 어치의 AWS 프로모션 크레딧을 사용할 수 있는 AWS Activate 회원 자격이 주어집니다.</p>\r\n", "end_date": "2017-05-05T00:00:00-04:00", "title": "스타트업 기업가정신 102: 당신의 고객을 위해 무엇을 할 수 있습니까? ", "price": 0, "instructors": "Bill Aulet", "institution_name": ["MIT"], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/e102_banner_kor_378x225.jpg", "course_url": "https://www.edx.org/course/seutateueob-gieobgajeongsin-102-mitx-15-390-2x", "subject_name": ["Business & Management"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-05T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso trata la Teoría de Grafos desde el punto de vista de la modelización, lo que nos permitirá con posterioridad resolver muchos problemas de diversa índole. Presentaremos ejemplos de los distintos problemas en un contexto real, analizaremos la representación de éstos mediante grafos y veremos los algoritmos necesarios para resolverlos.</p>\r\n\r\n<p>Resolveremos problemas que aparecen en la logística, la robótica, la genética, la sociología, el diseño de redes y el cálculo de rutas óptimas, mediante el uso de la Teoría de Grafos. Nuestro objetivo será presentar tanto los contenidos de la misma como la modelización de los casos planteados.</p>\r\n\r\n<p>En cada tema comenzaremos presentando el problema a resolver. Posteriormente introduciremos la teoría y los algoritmos correspondientes, modelizaremos el problema propuesto y finalmente hallaremos su solución. En general explicaremos en qué consiste y cómo se deduce cada algoritmo, haciendo para ello una traza a modo de ejemplo.</p>\r\n\r\n<p>Las unidades del curso son:</p>\r\n\r\n<p>Unidad 1: Conceptos básicos de la Teoría de Grafos</p>\r\n\r\n<p>Unidad 2: Accesibilidad</p>\r\n\r\n<p>Unidad 3: Grafos ponderados</p>\r\n\r\n<p>Unidad 4: Árboles</p>\r\n\r\n<p>Los contenidos de este curso fueron reconocidos con&nbsp;una Mención Especial del I Premio Ministerio de Educación, Cultura y Deportes (España) – Telefónica L.S. - Universia a la iniciativa de MOOC's en MiríadaX.</p>\r\n", "end_date": "2016-06-06T00:00:00-04:00", "title": "Aplicaciones de la Teoría de Grafos a la Vida Real (I)", "price": 0, "instructors": "Dr.  José Alberto Conejero Casares, Dra. Cristina Jordán Lluch", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/tgv201x.1-378x225_0.png", "course_url": "https://www.edx.org/course/aplicaciones-de-la-teoria-de-grafos-la-upvalenciax-tgv201x-1-0", "subject_name": ["Math"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-10T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este es un curso introductorio en el que aprenderemos a trabajar con Excel, el componente para hojas de cálculo de la suite ofimática de Microsoft, MS-Office.</p>\r\n\r\n<p>Este programa permite realizar todo tipo de operaciones con datos, pudiendo clasificar y manejar grandes cantidades de ellos; incorpora una gran cantidad de funciones y posee grandes cualidades para representar los resultados de forma gráfica.</p>\r\n\r\n<p>Partiremos de 0 y exploraremos las funcionalidades más utilizadas, como los formatos, la presentación de resultados, los gráficos, las funciones y la tablas de datos.</p>\r\n", "end_date": "2017-05-10T00:00:00-04:00", "title": "Excel", "price": 0, "instructors": "Jaime  Busquets, Victor Braquehais Acero", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/excel_378x225.jpg", "course_url": "https://www.edx.org/course/excel-upvalenciax-xls101x-0", "subject_name": ["Computer Science"], "duration": "8 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-10T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Toda la materia está formada por elementos o compuestos químicos que son resultado de la combinación de átomos. Cada compuesto presenta una determinada composición que se corresponde con una fórmula y se identifica con un nombre. La formulación y la nomenclatura sirven para clasificar y nombrar las diferentes clases de sustancias. Este curso va dirigido a los alumnos que acceden a la Universidad, especialmente, aquellos que no han cursado Química y que requieren de los conocimientos básicos en estos aspectos.<br />\r\n&nbsp;<br />\r\nEn este curso aprenderás las normas que se utilizan para establecer las fórmulas de las sustancias y especies químicas, así como las reglas necesarias para nombrarlas. De este modo, podrás identificar y nombrar correctamente los compuestos químicos inorgánicos y orgánicos más comunes.<br />\r\n&nbsp;<br />\r\nLas unidades del curso son:&nbsp;</p>\r\n\r\n<ol>\r\n\t<li>Introducción y nomenclatura de sustancias inorgánicas</li>\r\n\t<li>Sustancias binarias</li>\r\n\t<li>Sustancias terciarias</li>\r\n\t<li>Sustancias cuaternarias</li>\r\n\t<li>Introducción a la formulación y nomenclatura de compuestos orgánicos</li>\r\n\t<li>Hidrocarburos</li>\r\n\t<li>Funciones halogenadas</li>\r\n\t<li>Funciones oxigenadas</li>\r\n\t<li>Funciones nitrogenadas</li>\r\n\t<li>Compuestos con dos o más grupos funcionales</li>\r\n</ol>\r\n", "end_date": "2016-06-27T00:00:00-04:00", "title": "Formulación y nomenclatura de compuestos químicos", "price": 0, "instructors": "Juan Antonio Llorens Molina, Teresa Pardo Vicente", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/formulacion-y-nomenclatura-de-compuestos-quimicos_378x225.jpg", "course_url": "https://www.edx.org/course/formulacion-y-nomenclatura-de-compuestos-upvalenciax-iq101-3x-0", "subject_name": ["Chemistry"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-17T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Con este curso aprenderás a desarrollar y operar un proyecto con una máquina CNC, a través de la simulación de un caso real y con el objetivo de producir piezas de ajedrez para una empresa llamada “Jaque Mate”. De esta forma, irás adquiriendo los conocimientos necesarios para tomar decisiones en cada etapa del proyecto (desde la interpretación de un plano hasta el mecanizado y control de calidad de las piezas) y así cumplir con el pedido del cliente.</p>\r\n\r\n<p>Para resolver los desafíos que se proponen en cada sección, el curso cuenta con una serie de videos teóricos e interactivos que facilitan el aprendizaje del uso y control de una máquina CNC.</p>\r\n", "end_date": "2017-04-17T00:00:00-04:00", "title": "Introducción al Control Numérico por Computadora | Introduction to Computer Numerical Control", "price": 0, "instructors": "Jorge Muract, La Escuela Técnica  Roberto Rocca", "institution_name": ["TenarisUniversity "], "commitment": "2 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/cnc.etrrx_3-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-al-control-numerico-por-tenarisuniversity-cnc-etrrx3-0", "subject_name": ["Engineering"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-17T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso está, concebido como una preparación mínima necesaria para los primeros cursos de ingeniería y otros estudios en los que se imparten matemáticas. En él trabajaremos:</p>\r\n\r\n<ul>\r\n\t<li>El concepto de conjunto y sus operaciones</li>\r\n\t<li>La notación matemática elemental</li>\r\n\t<li>Los diferentes tipos de números: naturales, enteros, racionales, irracionales y reales</li>\r\n\t<li>Finalmente aprenderás los conceptos básicos necesarios sobre números complejos</li>\r\n</ul>\r\n", "end_date": "2017-05-22T00:00:00-04:00", "title": "Bases Matemáticas: Números y terminología", "price": 0, "instructors": "Dr. Antonio José Guirao Sánchez, Dr. Santiago Moll López", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bases-matematicas_378x225.jpg", "course_url": "https://www.edx.org/course/bases-matematicas-numeros-y-terminologia-upvalenciax-bmn101x-1", "subject_name": ["Math"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>En este curso se recordará lo que es una ecuación&nbsp;con una única incógnita y cómo solucionarla. A partir de ahí se tratarán:</p>\r\n\r\n<ul>\r\n\t<li>Los sistemas de ecuaciones lineales. Cómo se definen, cómo se clasifican y cómo se resuelven utilizando el método de Gauss</li>\r\n\t<li>El concepto de matriz y las operaciones entre matrices</li>\r\n\t<li>El cálculo de matrices inversas mediante el método de Gauss y el de los adjuntos</li>\r\n\t<li>Una introducción a las ecuaciones matriciales</li>\r\n\t<li>El determinante de una matriz cuadrada y su cálculo</li>\r\n\t<li>El rango de una matriz</li>\r\n\t<li>La expresión matricial de un sistema de ecuaciones lineales y la regla de Cramer</li>\r\n</ul>\r\n", "end_date": "2017-05-23T00:00:00-04:00", "title": "Bases Matemáticas: Álgebra", "price": 0, "instructors": "Alicia Herrero Debón", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bases-matematicas-algebra_378x225.jpg", "course_url": "https://www.edx.org/course/bases-matematicas-algebra-upvalenciax-bma101x-1", "subject_name": ["Math"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Todos lo que nos envuelve y los materiales que utilizamos diariamente están formados por mezclas de compuestos químicos, cuyas propiedades, aplicaciones y transformaciones dependen de los elementos que los forman y de su estructura. La Química es la ciencia que nos permite conocer todos estos conceptos, y es una materia básica en muchas titulaciones Universitarias. Este curso va dirigido a los alumnos que acceden a la Universidad que requieren dichos conocimientos básicos.<br />\r\n&nbsp;<br />\r\nCon este curso conocerás la importancia de la Química en el mundo que te rodea. Te introducirás en el concepto de la reacción química. Entenderás la estructura de la materia, los elementos que la forman y sus propiedades.<br />\r\n&nbsp;<br />\r\nEn el curso trataremos:</p>\r\n\r\n<ol>\r\n\t<li>Química: vida y sociedad</li>\r\n\t<li>El átomo</li>\r\n\t<li>El sistema periódico</li>\r\n</ol>\r\n", "end_date": "2017-05-23T00:00:00-04:00", "title": "Introducción a la Estructura de la Materia", "price": 0, "instructors": "Teresa Pardo Vicente, Carmen Gómez Benito, Juan Antonio Llorens Molina", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/introduccion-a-la-estructura-de-la-materia_378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-la-estructura-de-la-materia-upvalenciax-iq101-1x-1", "subject_name": ["Chemistry"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso pretende dar una visión panorámica e introductoria de la inversión en bolsa. Se presentan los diferentes productos en los que podemos invertir o con los que podemos especular. También se introducen los diferentes tipos de gráficos, los indicadores más habituales entre los gestores profesionales, y algunas estrategias rentables tanto para el inversor a largo plazo como para el inversor intradía.</p>\r\n\r\n<p>Unidades</p>\r\n\r\n<ol>\r\n\t<li>Aspectos básicos de la inversión bursátil</li>\r\n\t<li>Las herramientas del inversor</li>\r\n\t<li>Estrategias de inversión</li>\r\n\t<li>Activos en los que invertir</li>\r\n\t<li>Examen Final</li>\r\n</ol>\r\n", "end_date": "2017-05-23T00:00:00-04:00", "title": "Introducción a la inversión bursátil", "price": 0, "instructors": "Fernando García García, Dr. Francisco Guijarro Martínez, Javier Oliver Muncharaz", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bol101x_banner378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-la-inversion-bursatil-upvalenciax-bol1201-x-0", "subject_name": ["Economics & Finance"], "duration": "2 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Nunca antes el mercado de los videojuegos se ha encontrado en un mejor momento. En la actualidad existen multitud de plataformas disponibles y la irrupción de los dispositivos móviles ha revolucionado el sector.</p>\r\n\r\n<p>La existencia de múltiples plataformas implica grandes retos para los desarrolladores en la toma de decisiones, tanto en la elección de las plataformas como en el dimensionamiento de los equipos de trabajo.</p>\r\n\r\n<p>Una solución a estos problemas es utilizar un motor de juegos, y sin lugar a dudas el motor más popular y usado del momento es Unity.</p>\r\n\r\n<p>Unity es el motor más popular por razones como sus poderosas herramientas, su capacidad de generar juegos en más de 20 plataformas distintas, su excelente curva de aprendizaje y los centenares de complementos disponibles para él desarrollados por terceros.</p>\r\n\r\n<p><strong>Unidades </strong></p>\r\n\r\n<ol>\r\n\t<li>Introducción al entorno</li>\r\n\t<li>Conceptos básicos de Unity</li>\r\n\t<li>Introducción al motor de juegos</li>\r\n\t<li>Unity y las diferentes plataformas</li>\r\n\t<li>Scripting</li>\r\n\t<li>Unity en acción</li>\r\n</ol>\r\n", "end_date": "2017-05-23T00:00:00-04:00", "title": "Introducción al desarrollo de videojuegos con Unity", "price": 0, "instructors": "Jordi Linares Pellicer", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/uny201x_banner_378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-al-desarrollo-de-upvalenciax-uny201-x-0", "subject_name": ["Computer Science"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Con este curso podrás conocer que son y que proporcionan las redes de difracción sobre fibra en telecomunicaciones y sensores. Podrás entender el funcionamiento de forma intuitiva en incluso detallada para las redes de difracción más comunes.</p>\r\n\r\n<p>El curso requiere conocimientos básicos de propagación de ondas y de tratamiento de sañeles así como de mátemáticas en todos los casos a un nivel equivalente a los primeros cursos de un grado técnico. Si bien el curso trata de ser auntocontenido y descriptivo sin entrar en desarrollos complejos de forma que pueda ser aprovechado por el máximo espectro posible de alumnado.</p>\r\n\r\n<p>Unidades:</p>\r\n\r\n<ol>\r\n\t<li>Fundamentos de redes de difracción I.</li>\r\n\t<li>Fundamentos de redes de difracción II.</li>\r\n\t<li>Análisis y diseño de redes de difracción en fibra.</li>\r\n\t<li>Aplicaciones en telecomunicaciones.</li>\r\n</ol>\r\n\r\n<p>Aplicaciones en sensores.</p>\r\n", "end_date": "2017-05-23T00:00:00-04:00", "title": "Redes de difracción en comunicaciones ópticas", "price": 0, "instructors": "Daniel Pastor  Abellán, Salvador Sales  Maicas", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/rdo301x_banner.jpg", "course_url": "https://www.edx.org/course/redes-de-difraccion-en-comunicaciones-upvalenciax-rdo301x-0", "subject_name": ["Electronics"], "duration": "5 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-23T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Le christianisme s’oppose-t-il à la raison philosophique&nbsp;? Ce questionnement d’ordre général peut trouver une première réponse dans l’étude historique de la confrontation entre christianisme et philosophie dans l’Antiquité. Cette confrontation a joué un rôle très important dans la constitution de la doctrine chrétienne. Elle prend la forme d’une polémique entre les chrétiens et les philosophes, mais également d’un rapprochement, les chrétiens reprenant à la philosophie un grand nombre de concepts et de modes de raisonnement pour penser, exprimer et défendre leur foi. On verra ce qui oppose le christianisme et la philosophie comme deux voies d’accès concurrentes à la vérité, avant d’envisager différents aspects de la dette du christianisme à l’égard de la philosophie antique. On se demandera pour finir quel a été le rôle du christianisme dans l’histoire de la philosophie en tant que telle.</p>\r\n\r\n<p>Ce cours constitue une introduction au christianisme des origines ainsi qu’au monde intellectuel de l’Empire romain. Il permettra de comprendre comment se sont constitués les aspects centraux de la doctrine chrétienne. On évoquera aussi dans ce cadre les modalités pratiques de la production et de la transmission des idées dans l’Antiquité&nbsp;(papyrus, manuscrits) avec l’intervention de plusieurs spécialistes.&nbsp;&nbsp;</p>\r\n", "end_date": "2016-12-31T00:00:00-05:00", "title": "Christianisme et philosophie dans l’Antiquité ", "price": 0, "instructors": "Sébastien  Morlet", "institution_name": ["Sorbonne University System"], "commitment": "2-4 heures par semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/eg001x_banner.jpg", "course_url": "https://www.edx.org/course/christianisme-et-philosophie-dans-sorbonnex-eg001x", "subject_name": ["Humanities", "Literature", "Philosophy & Ethics"], "duration": "6 Semaines", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-26T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Aprenderás a desarrollar mensajería en tiempo real como WhatsApp, a conectar con el API de Twitter, hacer que tus aplicaciones interactúen con Facebook, crear tu propia red social de fotos, y hacer apps que se prueben automáticamente.</p>\r\n\r\n<p>Un curso dinámico e interactivo, con los aspectos más importantes en la construcción de aplicaciones de forma profesional para Android.</p>\r\n\r\n<p>Nuestro curso es el único que te enseñará a dar el siguiente paso en la construcción de aplicaciones profesionales para Android, esto lo haremos a través de darte las herramientas y conocimiento más actualizado. Inclusive tendremos en exclusiva una vídeo conferencia desde el Google I/O!</p>\r\n\r\n<p>Sabías que Android es el sistema operativo dominante con un 82.2% de la cuota de mercado. Imagina cuantos miles de consumidores puedes tener al crear tus apps profesionales para Android.</p>\r\n\r\n<p>En nuestro curso de Android aprenderás: Android Studio, actividades, fragmentos, intents, Model-View-Presenter, RecyclerView, ViewHolder, Adapter, Firebase, Navegación con tabs, ViewPager, autenticación, almacenamiento, consumo de API, Facebook SDK, GCM, notificaciones, Integración con Android wear, Cámara, Google Play Services, GPS, mapas, Graddle, Unit testing (JUnit4, Mockito), UI testing (Espresso).</p>\r\n", "end_date": "2016-07-19T00:00:00-04:00", "title": "Desarrollo de aplicaciones profesionales para Android", "price": 0, "instructors": "Adrián Catalan", "institution_name": ["Galileo University"], "commitment": "5-6 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/ctec001x-course_card_image11032015-378x225.jpg", "course_url": "https://www.edx.org/course/desarrollo-de-aplicaciones-profesionales-galileox-ctec001x", "subject_name": ["Computer Science"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-30T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Según datos publicados por Gartner a nivel mundial, casi el 60% de los teléfonos vendidos en 2013 fueron teléfonos inteligentes. Alrededor del 80% de estos teléfonos llevaban en su interior el sistema operativo&nbsp;<a href=\"http://en.wikipedia.org/wiki/Mobile_operating_system#Market_share\">Android</a>. No cabe duda, por lo tanto, de que formarse en Android es una de las mejores inversiones que puede hacer un programador en la actualidad.</p>\r\n\r\n<p>Como cabría esperar, escribir aplicaciones para dispositivos móviles no es lo mismo que hacerlo para ordenadores de sobremesa. Las aplicaciones móviles deben ser capaces de ejecutarse en un rango enorme de dispositivos, no solo teléfonos, sino también relojes, pulseras, coches y televisores. Android da una respuesta satisfactoria a estos desafíos en código abierto y recientemente ha añadido plataformas como Android Wear, Android TV y Android Auto, que abren una nueva frontera de desarrollo.</p>\r\n\r\n<p>El objetivo de este curso es que los estudiantes aprendan los fundamentos de la programación en Android mediante el desarrollo paso a paso de una aplicación. Al finalizar el curso cada estudiante habrá completado un pequeño juego casi sin darse cuenta, adquiriendo los conocimientos necesarios para utilizar los principales elementos de Android como son las actividades, los ficheros de diseño, las intenciones, los fragmentos, los menús, los diálogos, las preferencias, etc.</p>\r\n\r\n<p>Esperamos que disfrutes del curso.</p>\r\n", "end_date": "2017-10-04T00:00:00-04:00", "title": "Jugando con Android - Aprende a Programar tu Primera App", "price": 0, "instructors": "David Arroyo Guardeño, Luis Fernando Lago Fernández, Gonzalo Martínez Muñoz, Estrella Pulido Cañabate, Alejandro Sierra Urrecho", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "5 - 7 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/jugando_con_android_378x225.jpg", "course_url": "https://www.edx.org/course/jugando-con-android-aprende-programar-tu-uamx-android301x-1", "subject_name": ["Computer Science"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>¡La Química Orgánica está en todas partes! Simplemente nos rodea. ¿Te has dado cuenta que nosotros mismos somos Química Orgánica? Las moléculas biológicas son Química Orgánica. En este curso se introducen los fundamentos de la Química Orgánica y de la estructura molecular, sin que sea necesario tener ningún conocimiento previo de Química, ¡lo creas o no!.</p>\r\n", "end_date": "2016-06-28T13:11:19-04:00", "title": "La Química Orgánica, un mundo a tu alcance", "price": 0, "instructors": "Ernesto Brunet-Romero", "institution_name": ["Universidad Autónoma de Madrid"], "commitment": "4-5 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/la_quimica_organica_378x225.jpg", "course_url": "https://www.edx.org/course/la-quimica-organica-un-mundo-tu-alcance-uamx-quiorg101x-2", "subject_name": ["Chemistry"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-01T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Este curso se concibe como una revisión de los conceptos básicos del cálculo diferencial, necesarios para los primeros cursos de aquellos estudios universitarios en los que se imparte matemáticas. Nuestro objetivo es proporcionar un curso básico sobre funciones y derivadas, incluyendo sus aplicaciones.</p>\r\n", "end_date": "2016-08-01T00:00:00-04:00", "title": "Bases Matemáticas: Integrales", "price": 0, "instructors": "Dr. Antonio José Guirao Sánchez", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bases-matematicas-integrales_378x225.jpg", "course_url": "https://www.edx.org/course/bases-matematicas-integrales-upvalenciax-bmi101x-0", "subject_name": ["Math"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-07T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>En este curso se investigan las causas y se definen las leyes de la interacción electromagnética. Esta interacción es una de las más importantes que caracterizan nuestra vida diaria, ya que muchos de los fenómenos que se observan a nuestro alrededor, incluidos los químicos y biológicos, son debidos a la interacción electromagnética entre átomos y moléculas. Este curso se centra en analizar el origen de esta interacción y describir las leyes físicas que la gobiernan.&nbsp;</p>\r\n", "end_date": "2016-07-25T00:00:00-04:00", "title": "Fundamentos de Electromagnetismo para Ingeniería", "price": 0, "instructors": "Pilar Candelas Valiente, M. Ángeles Hernández Fenollosa, Constanza Rubio Michavila, Marcos Giménez Valentín, Joaquín Cerdá Boluda", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fundamentos-de-electromagnetismo-para-ingenieria_378x225.jpg", "course_url": "https://www.edx.org/course/fundamentos-de-electromagnetismo-para-upvalenciax-ffi101-2x-0", "subject_name": ["Physics"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-07T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Este curso será impartido en español.</p>\r\n\r\n<p>¿Qué se entiende por gestión para resultados en el desarrollo?</p>\r\n\r\n<p>¿Cuáles son los componentes del ciclo de gestión pública que aborda la gestión para resultados en el desarrollo?</p>\r\n\r\n<p>¿Cuáles son los principales desafíos en América Latina y el Caribe para la implementación de la gestión para resultados en el desarrollo?</p>\r\n\r\n<p>¿Cómo favorecer la implementación de la gestión para resultados en el desarrollo en América Latina y el Caribe?</p>\r\n\r\n<p>Este curso – el primero de una serie de cursos sobre este tema - da respuesta a las anteriores preguntas y, a modo de introducción, brinda el marco conceptual de la gestión para resultados en el desarrollo con énfasis en los gobiernos subnacionales. En los siguientes cursos de esta serie profundizaremos en cada uno de los componentes del ciclo de gestión pública.</p>\r\n\r\n<p>Los países de América Latina y el Caribe enfrentan considerables desafíos de la gestión pública, tales como el diseño de políticas públicas que tengan en consideración los puntos de vista de los diferentes actores; las demandas ciudadanas y los escasos recursos disponibles; la asignación de los recursos financieros; la calidad de los servicios públicos o el seguimiento y la evaluación de la gestión, entre otros.</p>\r\n\r\n<p>La gestión para resultados en el desarrollo y su enfoque de gerencia contribuyen al abordaje de estos desafíos mediante el tratamiento integral de las distintas etapas del ciclo de la gestión pública, el uso de la información para la toma de decisiones y el empleo de múltiples instrumentos y metodologías.</p>\r\n\r\n<p>Si tienes alguna pregunta, escríbenos a&nbsp;<a href=\"mailto:idbx@iadb.org\">idbx@iadb.org</a></p>\r\n\r\n<p>La preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del <a href=\"http://www.iadb.org/es/temas/gobierno/programa-especial-para-el-desarrollo-institucional,8478.html\">SPID</a>.&nbsp;&nbsp;</p>\r\n\r\n<p>&nbsp;</p>\r\n\r\n<p>*&nbsp;<span>This course will be offered in Spanish&nbsp;</span>*</p>\r\n\r\n<p>What is managing for development results?</p>\r\n\r\n<p>What are the components of the public management cycle associated with managing for development results?</p>\r\n\r\n<p>What are the main challenges in Latin America and the Caribbean for the implementation of managing for development results?</p>\r\n\r\n<p>How to assist the implementation of managing for development results in Latin America and the Caribbean?</p>\r\n\r\n<p>This course – the first of a series of courses in this topic – answers the previous questions and, as an introduction, provides a conceptual framework on managing for development results with special emphasis in subnational governments. In the following courses of this series we will go in depth in each one of the components of the public management cycle.</p>\r\n\r\n<p>Latin American and Caribbean countries face considerable challenges in public management, such as the design of public policies that take into account different stakeholders’ points of view; citizen demands and scarce available resources; financial resource allocation; public service quality; and monitoring and evaluation; among others.</p>\r\n\r\n<p>Managing for development results and its managerial focus contributes to addressing these challenges through a comprehensive effort involving different stages of the public management cycle, the use of information for decision-making, and the use of multiple instruments and methodologies.</p>\r\n\r\n<p>If you have any questions, please write us at&nbsp;<a href=\"mailto:idbx@iadb.org\">idbx@iadb.org</a></p>\r\n\r\n<p>The preparation of this course was financed by the Special Program for Institutional Development (SPID) of the Inter-American Development Bank. For more information visit the&nbsp;<a href=\"http://www.iadb.org/en/topics/government/special-program-for-institutional-development,8478.html\">SPID</a> website. &nbsp;</p>\r\n", "end_date": "2016-07-19T00:00:00-04:00", "title": "Introducción a la Gestión para Resultados en el Desarrollo", "price": 0, "instructors": "Roberto García López, Mauricio García Moreno", "institution_name": ["Inter-American Development Bank"], "commitment": "6 horas/semana, 6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb1x_managing_course_featured378x225_0.jpg", "course_url": "https://www.edx.org/course/introduccion-la-gestion-para-resultados-idbx-idb1x-0", "subject_name": ["Business & Management"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-07T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>El objetivo del curso es introducir algunos conceptos básicos de la Gestión de Proyectos / Project Management (PM), según las metodologías del Project Management Institute (PMI). El PMI es la Principal Organización Mundial en el campo de la Dirección de Proyectos (www.pmi.org). Sus guías están basadas en las \"Buenas Prácticas\" de profesionales de todo el mundo, y sus certificaciones, por ejemplo el Project Manager Professional (PMP) son muy demandadas por empresas de todos los sectores.</p>\r\n\r\n<p>Se tratan los conceptos básicos de la gestión de proyectos, la gestión del tiempo y la gestión del riesgo en un proyecto.</p>\r\n", "end_date": "2016-07-18T00:00:00-04:00", "title": "Introducción a la gestión de proyectos", "price": 0, "instructors": "Alberto Palomares Chust", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/igp101x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-la-gestion-de-proyectos-upvalenciax-igp101x-0", "subject_name": ["Business & Management"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-14T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Como consumidor, seguro conoces muy bien el costo de todos los alimentos que ingieres a diario. Pero, ¿sabes por qué tus alimentos tienen ese precio y por qué éste es diferente al de otros países? Pues son las políticas públicas agropecuarias, las que los determinan, entre otros factores. ¿Y sabías, además, que estas políticas también inciden de manera muy importante en la seguridad alimentaria y el cambio climático?</p>\r\n\r\n<p>No te pierdas la oportunidad de aprender a analizar las políticas públicas agropecuarias de América Latina y el Caribe, de conocer su implicación en la seguridad alimentaria y de comprender su estrecha relación con el medio ambiente y el cambio climático. Para ello te acercaremos a “AGRIMONITOR”: una base de datos creada por el BID, que contiene información de 18 países de América Latina y el Caribe, y que será tu mano derecha en el análisis de todos estos importantes temas.</p>\r\n\r\n<p>Además de trabajar con AGRIMONITOR, en el curso encontrarás videos, en los que especialistas de diversas organizaciones (BID, FAO, OCDE, entre otras) exponen su conocimiento sobre los temas tratados en el curso; lecturas teóricas; casos reales del BID donde se promueve el análisis de las políticas agropecuarias; recomendaciones de bibliografía de consulta; actividades prácticas para aplicar el contenido a medida que vayamos aprendiendo y foros de discusión, donde se abren espacios para el aprendizaje grupal alrededor de una pregunta orientadora.</p>\r\n\r\n<p>Además, si obtienes 80 puntos sobre 100 posibles durante el curso, podrás optar a concursar por… ¡conocer de cerca el Banco, trabajando por un período de entre tres y seis meses en la División de Medio Ambiente, Desarrollo Rural y Administración de Riesgos por desastres del Banco Interamericano de Desarrollo!</p>\r\n\r\n<p>Ya lo sabes: súmate al curso y analiza cuáles son las mejores políticas públicas agropecuarias para tu país en el futuro.</p>\r\n\r\n<p>¡AGRIMONITOR te está esperando!</p>\r\n\r\n<p>*La preparación de este curso fue financiada por fondos de la iniciativa BID AGRIMONITOR y fondos del Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo (mayor información en la página web del SPID).</p>\r\n\r\n<p><strong>***La presente edición de este curso será impartida en español. Posteriormente, habrá una versión en inglés***&nbsp;</strong></p>\r\n", "end_date": "2016-07-26T00:00:00-04:00", "title": "AGRIMONITOR: política agropecuaria, seguridad alimentaria y cambio climático", "price": 0, "instructors": "Pedro Martel, Carmine Paolo De Salvo, Rachel Boyce, Timothy E. Josling, César Falconi, Namho Kim, Amal-Lee Amin", "institution_name": ["Inter-American Development Bank"], "commitment": "6 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb13x_378x225.jpg", "course_url": "https://www.edx.org/course/agrimonitor-politica-agropecuaria-idbx-idb13x", "subject_name": ["Economics & Finance", "Environmental Studies", "Data Analysis & Statistics"], "duration": "5 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>América Latina y el Caribe están viviendo un rápido proceso de urbanización que conlleva desafíos y oportunidades para el desarrollo integral de la región.</p>\r\n\r\n<p>¿Cómo se puede manejar la expansión urbana y planear de manera efectiva? ¿Cómo se puede asegurar vivienda digna para la creciente población? ¿Qué hacer con los barrios informales que tipifican las ciudades en desarrollo? ¿Cómo se puede valorizar el patrimonio urbano y revitalizar los centros históricos?</p>\r\n\r\n<p>Con este curso se aprenderán las herramientas necesarias y el conocimiento especializado que permiten enfrentar los desafíos que la región tiene para asegurar un desarrollo efectivo y sustentable de sus ciudades, mitigar los riesgos sociales, económicos y de infraestructura que esta expansión conlleva y formular planes de largo plazo que se traduzcan en un desarrollo urbano equitativo y bien estructurado.</p>\r\n\r\n<p>Este MOOC está orientado a funcionarios públicos de América Latina y el Caribe que trabajen o estén involucrados en el ámbito de desarrollo urbano y vivienda. Asimismo, se desarrolló teniendo en mente a los actores que, a través del estudio o su labor cotidiana, estén teniendo un mayor acercamiento a esta temática y sus derivadas.</p>\r\n\r\n<p>Los contenidos y materiales de este MOOC se basan en recursos teóricos, lecciones aprendidas, casos reales y actividades prácticas que permiten al participante comprender el contexto urbano de América Latina y el Caribe, junto con sus oportunidades y fortalezas. Por el mismo lado, se hace un esfuerzo por conectar a los participantes y sus experiencias, para dialogar y trabajar en soluciones conjuntas a los problemas generales y particulares que enfrenta la Región y sus ciudades.</p>\r\n\r\n<p>Si tienes alguna pregunta, escríbenos a <a href=\"mailto:idbx@iadb.org\">idbx@iadb.org</a></p>\r\n\r\n<p>La preparación de este curso fue financiada por el Programa Especial para el Desarrollo Institucional (SPID) del Banco Interamericano de Desarrollo. Mayor información en la página web del <a href=\"http://www.iadb.org/es/temas/gobierno/programa-especial-para-el-desarrollo-institucional,8478.html\" target=\"_blank\">SPID</a>.</p>\r\n", "end_date": "2016-08-02T00:00:00-04:00", "title": "Desarrollo Urbano y Vivienda", "price": 0, "instructors": "Andrés G. Blanco, José Brakarz, Michael Donovan, Jesús Navarrete, Diego Arcia", "institution_name": ["Inter-American Development Bank"], "commitment": "6 horas por semana", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/idb7x-378x225.jpg", "course_url": "https://www.edx.org/course/desarrollo-urbano-y-vivienda-idbx-idb7x-0", "subject_name": ["Social Sciences", "Economics & Finance", "Environmental Studies"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-21T00:00:00-04:00"},
{"selfpaced": true, "description": "<p>Con este curso aprenderás los conceptos básicos relacionados con las reacciones químicas y profundizarás en su estudio desde el punto de vista cuantitativo, es decir su estequiometría. Entenderás el comportamiento de los gases y las disoluciones y aplicarás las leyes que regulan su comportamiento en los procesos químicos en los que participan.<br />\r\n&nbsp;<br />\r\nLa ecuación química representa lo que sucede cuando tiene lugar un proceso en el que unas sustancias se convierten en otras mediante una “reacción química”.<br />\r\n<br />\r\nEn las reacciones se cumple la ley de la conservación de la masa y es posible calcular las cantidades de reactivos que reaccionan y de productos que se obtienen.<br />\r\n&nbsp;<br />\r\nEl estudio de las reacciones químicas y de los aspectos cuantitativos de las mismas, es decir su “estequiometría”, es competencia de la Química, una materia básica que se estudia en muchas titulaciones Universitarias.<br />\r\n&nbsp;<br />\r\nEste curso va dirigido a los alumnos que acceden a la Universidad, especialmente aquellos que no han cursado Química y que requieren de los conocimientos básicos en estos aspectos.<br />\r\n&nbsp;<br />\r\nLas unidades que&nbsp;trataremos:</p>\r\n\r\n<ul>\r\n\t<li>Conceptos básicos: masa, mol y fórmula química</li>\r\n\t<li>Gases. Ecuación de los gases ideales</li>\r\n\t<li>Disoluciones y formas de expresar la concentración</li>\r\n\t<li>Ecuaciones y reacciones químicas</li>\r\n\t<li>Estequiometría y cálculos en reacciones completas</li>\r\n\t<li>Reacciones reversibles y cálculos estequiométricos en el equilibrio</li>\r\n</ul>\r\n", "end_date": "2015-07-25T00:00:00-04:00", "title": "Reacciones Químicas y Cálculos Estequiométricos", "price": 0, "instructors": "Carmen Gómez Benito, Isabel Morera Bertomeu", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/reacciones-quimicas-y-calculos-estequiometricos_378x225.jpg", "course_url": "https://www.edx.org/course/reacciones-quimicas-y-calculos-upvalenciax-iq101-4x-0", "subject_name": ["Chemistry"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-06-28T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El curso está diseñado para que aprendas a generar un poder sin límites y despertar en ti la importancia de tomar iniciativas, riesgos y emprender acciones valientes que te permitan tomar ventaja de los diferentes retos y situaciones que se te presenten.</p>\r\n\r\n<p>Nuestro curso te proporcionará el conocimiento y las herramientas para establecer estrategias triunfadoras y a poderlas aplicar con éxito. Si buscas: reforzar un liderazgo empresarial, nuevas oportunidades de negocio, una estrategia empresarial, emprender un negocio o superación personal, estás en el curso indicado, ya que con nuestro catedrático especializado quien tiene en su experiencia la asesoría de más 90 empresas internacionales de diversas industrias, y quien logrará en ti llegar a tener más que negocio rentable o una superación personal.</p>\r\n\r\n<p>La estrategia de éxito se convierte en el elemento crucial que permite a personas, empresas, instituciones y países tomar ventaja de las situaciones que enfrenta, de los recursos con los que cuenta y para eso, el curso consigue el entendimiento preciso de la situación, la concepción original de la forma en que puede tomar la ventaja sobre competidores o adversarios y cómo generar el crecimiento sostenido a lo largo del tiempo, fortalece el liderazgo haciendo énfasis en el desarrollo del estratega, quien piensa y actúa en cualquier momento como tal, para quien su objetivo además de ser efectivo es triunfar en cada batalla librada a lo largo de su vida o en la empresa.</p>\r\n\r\n<p>Además con nosotros aprenderá a analizar la forma en que toma decisiones y entiende sus limitantes, a conseguir que la visión sea de largo plazo y que se considere el tiempo y los recursos en general como escasos. Durante 6 semanas trabajarás sobre la originalidad y creatividad necesaria para conseguir que el factor sorpresa se consiga y genere ventaja. Partiendo del principio de que la estrategia se establece para el peor de los escenarios, todo el curso está basado en la realidad, en la que existe competencia y terrenos complicados para poder lograr los objetivos.</p>\r\n\r\n<p>Atrévete a convertirte en una herramienta contundente y se un generador de acciones incontenibles hacia el éxito.</p>\r\n", "end_date": "2016-06-26T00:00:00-04:00", "title": "Diseño de Estrategias Exitosas y Acciones Incontenibles", "price": 0, "instructors": "Jorge Iván Echeverría Permouth", "institution_name": ["Galileo University"], "commitment": "5-6 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/cneg001x-course_card_image11032015-378x225.jpg", "course_url": "https://www.edx.org/course/diseno-de-estrategias-exitosas-y-galileox-cneg001x", "subject_name": ["Business & Management"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-16T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Podemos afirmar sin temor a equivocarnos que un buen curso de Cálculo amplía la visión del estudiante en su campo y en su área de estudio, que no pertenece necesariamente al área de física o matemática, por ejemplo en fisiología para estudiantes de medicina.</p>\r\n\r\n<p>El Cálculo Diferencial es el lenguaje en el que algunas leyes de la naturaleza se expresan, por ejemplo: nos permite describir el movimiento y el cálculo de trayectorias en dinámica, nos ayuda a resolver problemas de áreas y volúmenes, a resolver problemas extremales en campos como economía y matemática financiera.</p>\r\n\r\n<p>En este curso se presentan los conceptos y demostraciones con extrema precisión y cuidado; se hace énfasis en los fundamentos del Cálculo para que lo que se enseña quede fundamentado y claramente explicado.</p>\r\n\r\n<p>Se estudia el cálculo diferencial de funciones de variable real, por lo tanto, se parte de una estructura algebraica de los números reales. Utiliza conceptos puramente métricos, por eso se introduce el concepto de distancia para explicar que nos vamos acercando a algo, es decir, se define la estructura del espacio métrico&nbsp; que da paso al primer tema sucesiones de números reales continúa con sucesiones convergentes, derivadas de una función hasta llegar a problemas extremales en dos variables y multiplicadores de Lagrange.</p>\r\n\r\n<p>Esperamos que este curso de Cálculo logre cambiar la percepción de los estudiantes en cuanto a su aplicación e importancia.</p>\r\n", "end_date": "2016-06-19T00:00:00-04:00", "title": "Cálculo Diferencial", "price": 0, "instructors": "Dr. Eduardo Suger", "institution_name": ["Galileo University"], "commitment": "5-6 horas a la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/cmath001x-course_card_image11032015-378x225.jpg", "course_url": "https://www.edx.org/course/calculo-diferencial-galileox-cmath001x", "subject_name": ["Math"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-05-09T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Acerca de este curso</p>\r\n\r\n<p>Dentro de la práctica educativa y clínica, las neurociencias y la psicología cognitiva son ejes fundamentales en la comprensión del comportamiento humano. Estas disciplinas aportan no solo modelos explicativos desde las ciencias básicas sino también desde su perspectiva aplicada. Teniendo en cuenta lo anterior, se pretende generar un espacio para comprender cómo el ser humano desarrolla y adquiere las habilidades de lectura y escritura así como las dificultades más comunes en su adquisición, desde una perspectiva neuropsicológica y cognitiva. Esto, con el fin de ofrecer pautas para identificar cuándo un niño presenta alguna o varias de estas dificultades y qué hacer para ayudarlo en su correcta apropiación.</p>\r\n", "end_date": "2016-06-17T00:00:00-04:00", "title": "Aproximación Neuropsicológica de la Lecto-Escritura en la etapa escolar", "price": 0, "instructors": "María Cristina Quijano Martínez, Natalia Cadavid Ruiz", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "6 horas por semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/puj.e.1601x.06-course_card-378x225.jpg", "course_url": "https://www.edx.org/course/aproximacion-neuropsicologica-de-la-javerianax-puj-e-1601x-06", "subject_name": ["Social Sciences", "Humanities"], "duration": "8 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-25T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Cuando hacer las cosas bien no es suficiente, necesitamos convertir la mejora continua en un lema diario para todos los trabajadores de la empresa. Para ello necesitamos conocer técnicas que nos ayuden a realizar esta tarea de manera más sistemática para que, por un lado tengamos mejores resultados y, por otro, no nos dispersemos con las urgencias de un día a día caótico. En este curso, aprenderás a definir problemas/oportunidades, y a convertirlas en un proyecto de mejora.<br />\r\n<br />\r\nDescubrirás cómo construir un equipo que se haga cargo de estos proyectos y conocerás y practicaras diferentes técnicas para la resolución de problemas en grupo. Al finalizar el curso serás capaz de participar en grupos de resolución de problemas quesean capaces de mejorar la eficiencia de las organizaciones.&nbsp;</p>\r\n", "end_date": "2016-06-06T00:00:00-04:00", "title": "Implantar Grupos de Mejora de Procesos", "price": 0, "instructors": "Dr. Juan A. Marin-García, Dr. Julio J. García-Sabater, Dr. Julien Maheut, Dr. José Pedro García-Sabater, Dra. Pilar I. Vidal-Carreras", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "4 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/implantar-grupos-de-mejora-de-procesos_378x225.jpg", "course_url": "https://www.edx.org/course/implantar-grupos-de-mejora-de-procesos-upvalenciax-gm201x-0", "subject_name": ["Business & Management"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-12T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El MOOC en Finanzas personales le ayudará a lograrde una mejor administración de sus finanzas mediante el desarrollo de un proceso que involucra tres grandes temas:</p>\r\n\r\n<ul>\r\n\t<li>¿Hacia dónde voy?</li>\r\n\t<li>¿Con qué cuento?</li>\r\n\t<li>Cambiando el rumbo</li>\r\n</ul>\r\n\r\n<p>En cada una de estas etapas usted podrá evidenciar, mediante actividades lúdicas, los principales conceptos que deberá considerar para el mejor manejo de sus finanzas. Podrá evaluar cómo lo ha hecho hasta ahora y por supuesto encontrará las causas del estado actual de sus finanzas, descubriendo diversos caminos para asegurar, con disciplina, la tan anhelada libertad financiera, es decir, tener el mismo nivel de vida sin tener que trabajar, el sueño de todos eliminate.</p>\r\n\r\n<p>Todo esto estará acompañado de la toma de decisiones sobre sus objetivos a corto, mediano y largo plazo; simulando las diferentes opciones que un sano manejo financiero permite. Tendrá la posibilidad de conocer casos reales y de consultar a la experta: “la doctora billetera” para tomar las mejores decisiones en términos financieros lo que le permitirá que sus decisiones futuras sean las más eficientes y adecuadas a sus metas, ingresos y gastos.</p>\r\n", "end_date": "2016-05-06T00:00:00-04:00", "title": "Finanzas Personales", "price": 0, "instructors": "Julio Sarmiento", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "5 Horas/Semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/puj.e.1601x.3-course_card12042015-378x225.jpg", "course_url": "https://www.edx.org/course/finanzas-personales-javerianax-puj-e-1601x-3", "subject_name": ["Business & Management", "Economics & Finance"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-06T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El planeta se enfrenta al reto de alimentar a una población creciente en un escenario de limitación de recursos, mercados agroalimentarios imperfectos, crisis de alimentos, y población rural vulnerable. El curso invita a una reflexión sobre las alternativas de la agricultura y la alimentación, vistas como solución a los desafíos socio-económicos y ambientales, con énfasis en el papel de la agricultura familiar y en modos de producción sostenibles, en el marco de cadenas de valor más equilibradas.</p>\r\n\r\n<p>This course is taught in Spanish with English subtitles.</p>\r\n", "end_date": "2016-05-30T00:00:00-04:00", "title": "Retos de la Agricultura y la Alimentación en el Siglo XXI", "price": 0, "instructors": "Dr. José-María García-Alvarez-Coque, Dr. Victor Martinez Gómez, Dr. Olga Moreno Pérez, Dr. Raúl Compés López, Lorena Tudela Marco", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/agricultura-y-la-alimentacion_378x225.jpg", "course_url": "https://www.edx.org/course/retos-de-la-agricultura-y-la-upvalenciax-ra201x-0", "subject_name": ["Food & Nutrition", "Social Sciences"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-04-05T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>¿Cuán sana es una economía? ¿Qué puede hacer la política económica para mantener o restablecer la salud de una economía? Estas preguntas están en el centro de la programación financiera. En nuestro curso PPF usted aprenderá los conceptos fundamentales para responder a estas preguntas.</p>\r\n\r\n<p>La programación financiera es un marco que permite analizar el estado de la economía, prever el curso de su evolución y determinar las políticas económicas que pueden cambiarlo.</p>\r\n\r\n<p>La primera parte del curso PPF, presentada por el Instituto de Capacitación del FMI, le permitirá adquirir conocimientos básicos para realizar la programación financiera. En el curso se presentan las características principales de los cuatro grandes sectores que comprenden la macroeconomía (real, fiscal, externo y monetario), enseña cómo analizar e interpretar las cuentas de estos sectores y cómo estos sectores están relacionados entre sí.</p>\r\n\r\n<p>Durante el curso, los economistas del FMI lo guiarán a través de las cuentas y el análisis de una economía. Además de las clases, usted responderá a las preguntas sobre los conceptos explicados, hará breves ejercicios numéricos, discutirá con los otros participantes sobre la evolución económica de su país y trabajará con los datos de un país imaginario. Tendrá acceso a los materiales de lectura.</p>\r\n\r\n<p>Tanto si es funcionario y trabaja en cuestiones económicas para su país, como si es un profesional que maneja datos económicos o sencillamente le interesa entender mejor la evolución de una economía, este curso le entregará las herramientas para el análisis macroeconómico. ¡Esperamos con interés su participación!</p>\r\n\r\n<p>El curso de programación y políticas financieras, Parte 1 es ofrecido por el FMI con el apoyo financiero del gobierno de Bélgica.</p>\r\n", "end_date": "2016-04-13T00:00:00-04:00", "title": "Programación y políticas financieras, Parte 1: Cuentas macroeconómicas y análisis", "price": 0, "instructors": "Christian Johnson, Santiago Acosta Ormaechea, Luciana Juvenal, Marco Rodríguez, Leonardo Martínez, Jorge Restrepo", "institution_name": ["The International Monetary Fund"], "commitment": "6 - 10 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/fpp_description-378x225.jpg", "course_url": "https://www.edx.org/course/programacion-y-politicas-financieras-imfx-fpp-1x", "subject_name": ["Economics & Finance"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-03-02T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Le théâtre classique du 17e siècle passe pour le sommet de l’art du théâtre en France. Ses trois représentants les plus connus, Corneille et Racine pour la tragédie et Molière pour la comédie comptent parmi les plus grands dramaturges européens de tous les temps, et Molière reste l’un des auteurs les plus joués dans le monde.</p>\r\n\r\n<p>Pour vous les faire découvrir, nous vous emmènerons dans l’environnement historique, sociologique, culturel et littéraire qui les a vu naître. Nous retracerons ainsi l’histoire du «&nbsp;théâtre moderne&nbsp;» depuis sa naissance au milieu du 16e siècle jusqu’aux plus brillantes années du «siècle de Louis XIV» (2e moitié du 17e siècle).</p>\r\n\r\n<p>Nous examinerons ainsi les fondements de l’expression «théâtre classique», les fondements du système qui a vu naître les «&nbsp;règles classiques&nbsp;», les fondements d’un dialogue théâtral qui repose entièrement sur «&nbsp;l’alexandrin classique&nbsp;». Et nous ferons apparaître les tensions créatrices (entre la théorie et la pratique, entre les règles et le refus des règles, entre le texte et le spectacle, entre le classicisme et le baroque, entre la tragédie et l’opéra) qui ont façonné le théâtre de cette période.</p>\r\n\r\n<p>Enfin, en vous accompagnant dans la lecture des quelques chefs-d’œuvre qui ont créé une rupture esthétique et marqué les esprits, nous vous ferons pénétrer avec nous dans l’atelier créateur des plus grands dramaturges de l’âge d’or du théâtre français.</p>\r\n\r\n<p>Pièces de théâtre à lire: Le Cid et Cinna de Corneille / Les Précieuses ridicules, L’École des femmes et Tartuffe de Molière / Andromaque et Phèdre de Racine.</p>\r\n\r\n<p>Ces textes sont tous disponibles en éditions de poche (choisir de préférence «Folio classique” et «Folio Théâtre» ou «Le Livre de poche Classique». On peut les lire aussi en ligne sur le site:&nbsp;http://www.theatre-classique.fr/pages/programmes/PageEdition.php</p>\r\n\r\n<p>Nous vous invitons à découvrir avec nous d’où viennent ces trois auteurs, comment ils se sont construits, comment ils se sont distingués des plus brillants dramaturges de leur temps. Et nous vous montrerons quels sont les ingrédients qui ont permis à leurs œuvres d’avoir été sans cesse lues et jouées jusqu’à aujourd’hui — et cela, alors même que de nombreux éléments-clés (l’obéissance à des «règles» et l’usage du vers dit «alexandrin», en particulier) ont disparu depuis longtemps.</p>\r\n", "end_date": "2016-04-07T00:00:00-04:00", "title": "À la découverte du théâtre classique français –Tome 2 ", "price": 0, "instructors": "Georges Forestier", "institution_name": ["Sorbonne University System"], "commitment": "4-6 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/lf001.1x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/la-decouverte-du-theatre-classique-sorbonnex-lf001-2x", "subject_name": ["Humanities", "Literature", "History"], "duration": "6 Semaines", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-25T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Acerca de este curso</p>\r\n\r\n<p>Si usted está interesado en aprender a hacer e interpretar pronósticos de ventas sin profundizar en las matemáticas, ¡este curso es para usted!</p>\r\n\r\n<p>Podrá desarrollar la habilidad para entender en qué situaciones debe utilizar y aplicar los tipos de pronósticos basados en modelos existentes, vistos de una forma matemática muy práctica.</p>\r\n\r\n<p>Comprenderá cuándo un pronóstico es bueno y cuándo no lo es.</p>\r\n\r\n<p>Podrá presentar informes exitosos que le permitan tomar decisiones anticipadas y \"acordes a la realidad de su negocio\"</p>\r\n", "end_date": "2016-03-22T00:00:00-04:00", "title": "Pronósticos de ventas: una herramienta comercial", "price": 0, "instructors": "Manuel Ignacio Medina Labrador", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "4-6 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/puj.i.1601x.1-course_card_image11232015-378x225.jpg", "course_url": "https://www.edx.org/course/pronosticos-de-ventas-una-herramienta-javerianax-puj-i-1601x-1", "subject_name": ["Business & Management", "Economics & Finance", "Data Analysis & Statistics"], "duration": "4 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-17T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>¿Sabía que las enfermedades crónicas son la principal causa de mortalidad y discapacidad a nivel mundial? Se ha preguntado ¿por qué sucede esto? A través de este curso descubrirá que estas consecuencias se pueden prevenir si pacientes, cuidadores y profesionales de la salud, logran comprender las barreras y limitaciones que tiene el paciente para responder positivamente con el tratamiento farmacológico y no farmacológico de dichas enfermedades.&nbsp; Los estudiantes reconocerán que los pacientes con enfermedad crónica que tienen una adherencia positiva al tratamiento, lograran tener cambios en su estilo de vida que generarán los resultados preventivos y terapéuticos deseados.</p>\r\n", "end_date": "2016-04-08T00:00:00-04:00", "title": "Adherencia al tratamiento de pacientes con enfermedad crónica", "price": 0, "instructors": "Diego Correa Sánchez", "institution_name": ["The Pontificia Universidad Javeriana"], "commitment": "6 horas/semana", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/adh1.0x-course_card_image11302015-378x225.jpg", "course_url": "https://www.edx.org/course/adherencia-al-tratamiento-de-pacientes-javerianax-adh1-0x", "subject_name": ["Health & Safety", "Biology & Life Sciences", "Medicine"], "duration": "9 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-15T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Pourquoi respirons-nous&nbsp;? A quoi servent nos poumons&nbsp;? Quel est le lien entre l’oxygène et la vie&nbsp;? Ces questions ouvrent un vaste champ de découvertes et de curiosités pour mieux comprendre la &nbsp;respiration. Ce cours s’adresse à toute personne qui souhaite apprivoiser, s’approprier ou approfondir le fonctionnement de la respiration et des poumons, autrement dit la physiologie respiratoire humaine.<br />\r\n&nbsp;<br />\r\nPlongés au cœur de l’université et de la pratique hospitalière, durant &nbsp;sept semaines, vous côtoierez professeurs, professionnels de la santé, internes et étudiants de médecine. Vous y apprendrez des notions de niveau universitaire qui ont été sélectionnées et adaptées afin que toute personne intéressée puisse les comprendre et y donner du sens. Ainsi, nous aborderons des thèmes proches du monde qui vous entoure&nbsp;: la respiration lors d’un effort physique, en altitude, le rôle des polluants atmosphériques, l’asthme….<br />\r\n&nbsp;<br />\r\nA chaque leçon, un expert abordera des domaines concrets et pratiques&nbsp;: comment apprécier l’oxygénation d’un patient, pourquoi lui administrer de l’oxygène, que signifie hyperventiler….<br />\r\n&nbsp;<br />\r\nCe cours vous fera entrer en profondeur dans un monde où l’atmosphère est faite d’anatomie humaine, de physique des volumes et des pressions, de gaz et de sang, d’oxygène et de CO2, de poumons et de tissus, de tabagisme et de bronchite chronique.<br />\r\n&nbsp;<br />\r\nAu terme de ce cours, vous serez capables&nbsp;de</p>\r\n\r\n<ul>\r\n\t<li>expliquer et décrire les principes d’oxygénation, de ventilation, de transport et de consommation d’oxygène, de diffusion de gaz entre l’air et le sang… par des schémas et par des calculs utilisant quelques formules fondamentales.</li>\r\n\t<li>évaluer la quantité et la qualité de l’oxygénation d’un patient,</li>\r\n\t<li>distinguer les situations normales de celles dites pathologiques.</li>\r\n</ul>\r\n\r\n<p>Bref, vous aurez, pour votre plaisir et votre motivation, approfondi votre culture générale en acquérant des connaissances élevées.</p>\r\n\r\n<p><span>Table des matières&nbsp;:</span></p>\r\n\r\n<ul>\r\n\t<li>Sans oxygène, point de vie sur terre</li>\r\n\t<li>L’anatomie respiratoire : de la bouche aux alvéoles pulmonaires</li>\r\n\t<li>La ventilation et les volumes pulmonaires</li>\r\n\t<li>Les physiciens de la respiration</li>\r\n\t<li>La Cascade d’Oxygène</li>\r\n\t<li>L’Hémoglobine, transporteur d’Oxygène dans le sang</li>\r\n\t<li>Les couleurs de l’oxygène</li>\r\n\t<li>Le Dioxyde de Carbone (CO2) : bien mieux qu’un déchet de l’organisme</li>\r\n\t<li>Respirer en altitude ou en avion : une adaptation à l’hypoxie</li>\r\n\t<li>L’effort physique augmente la consommation d’oxygène</li>\r\n\t<li>Le poumon du fœtus, c’est le placenta de sa mère</li>\r\n\t<li>Les polluants atmosphériques, le monoxyde de carbone (CO) et le tabagisme</li>\r\n\t<li>L’asthme obstrue et enflamme les petites bronches</li>\r\n\t<li>La bronchite chronique et l’emphysème réduisent l’élasticité des poumons</li>\r\n\t<li>L’œdème Pulmonaire : le cœur et les poumons sont indissociables</li>\r\n\t<li>Respiration et bien-être : le yoga et l’hypnose</li>\r\n\t<li>Compléments de physiologie respiratoire : le surfactant, la compliance, la fibros</li>\r\n</ul>\r\n", "end_date": "2016-03-28T00:00:00-04:00", "title": "Comprendre la respiration", "price": 0, "instructors": "Franck  Verschuren", "institution_name": ["Université catholique de Louvain"], "commitment": "3 - 5 hours/week", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/comprendre-la-respiration_378x225.jpg", "course_url": "https://www.edx.org/course/comprendre-la-respiration-louvainx-louv8x-0", "subject_name": ["Biology & Life Sciences", "Health & Safety", "Medicine"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-08T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Ce cours sera enseigné en français.<br />\r\nThis course will be taught in French.</p>\r\n\r\n<p>Quel lien existe-t-il entre l’exploitation des ressources naturelles (terre, eau, ressources minières, forêts, ...) et le développement durable ? Ce cours vous permettra de comprendre les opportunités mais aussi les défis que la présence de ressources naturelles offre, tant au niveau local que global. En analysant les effets socio-économiques et écologiques de la ruée actuelle vers ces ressources naturelles, vous comprendrez mieux les liens entre crise agraire, crise alimentaire et crise environnementale. A partir d’études de cas spécifiques, c’est votre regard sur les dynamiques globales contemporaines qui en sera modifié.<br />\r\n<br />\r\nA&nbsp;la fin du cours, par rapport à des problématiques liées à la gestion des ressources naturelles (ruée sur la terre, le sous-sol, l’eau et/ou la forêt), vous serez capables de:</p>\r\n\r\n<ul>\r\n\t<li>comprendre, comparer et analyser des modèles théoriques qui permettent de décoder de telles problématiques</li>\r\n\t<li>décomposer ces problématiques en causes, conséquences, solutions et points de vue divergents sur ces trois elements</li>\r\n\t<li>repérer, dans votre environnement, des cas d'étude qui illustrent ces problématiques et leur appliquer le processus de décomposition vu dans le cours.</li>\r\n</ul>\r\n\r\n<p>Vous serez invités à choisir deux ressources naturelles parmi les quatre proposées. Vous développerez les apprentissages annoncés au travers de présentations vidéo par la professeur et par des experts, de QCM, d’un jeu de plateau à jouer avec vos proches (Land Rush), de débats et de cas d’étude proposés par vous, que vous schématiserez et présenterez aux autres via une activité d’évaluation par les pairs.</p>\r\n\r\n<p>What kind of link exists between the exploitation of natural resources (land, water, minerals, forests) and sustainable development? This course aims to understand the opportunities and challenges implied by the presence of natural resources at both local and global levels. You will be analyzing the socioeconomic and ecological effects of the contemporary natural resource rush. This will help you to gain a better understanding of the links between land, food and environmental crises. Through the analysis of specific case studies, you’ll look at contemporary global dynamics in a different way.</p>\r\n", "end_date": "2016-04-04T00:00:00-04:00", "title": "Ressources naturelles et développement durable", "price": 0, "instructors": "An Ansoms", "institution_name": ["Université catholique de Louvain"], "commitment": "4 - 6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/louv4x-ressources_naturelles-378x225.jpg", "course_url": "https://www.edx.org/course/ressources-naturelles-et-developpement-louvainx-louv4x-0", "subject_name": ["Humanities", "Social Sciences"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-08T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Con este curso, el alumnado será capaz de aprender y entender los conceptos básicos de visión por computador, además de&nbsp; implementar de forma práctica algoritmos de análisis de imágenes a través de computadores utilizando la biblioteca de funciones OpenCV.</p>\r\n\r\n<p>El Análisis de Imágenes o Visión por Computador es la capacidad de los ordenadores de analizar imágenes capturadas por una cámara y obtener la información de los objetos que se hayan presentes en esa escena. En la actualidad, constituye uno de los campos de la Inteligencia Artificial con un mayor ritmo de desarrollo y que más aplicaciones nuevas está presentando.</p>\r\n\r\n<p>Hasta hace pocos años las cámaras digitales solo estaban implantadas en el ambiente industrial. Allí se utilizan con dos fines:</p>\r\n\r\n<ol>\r\n\t<li>Lograr una mayor interacción entre los robots industriales y el entorno que los rodea.</li>\r\n\t<li>Conseguir un control de calidad total de los productos fabricados.</li>\r\n</ol>\r\n\r\n<p>Con la aparición de nuevo hardware, cámaras y algoritmos, el mundo de la Visión por Computador ya no se centra exclusivamente en el ambiente industrial sino que se extiende a los smartphones, la industria del videojuego e incluso a los coches.</p>\r\n\r\n<p>Otra característica que ha cambiado recientemente es que hasta hace poco tiempo las técnicas de análisis de imágenes eran accesibles solamente a un reducido número de especialistas. Los programas que se utilizaban eran costosos, con poca documentación y que exigían equipos informáticos de gama alta. Esto es ahora muy distinto; en concreto la biblioteca OpenCV, que se verá en el curso, constituyen una solución de altísimo nivel, gratuitas, portables a diversos sistemas operativos y equipos, ordenadores o teléfonos inteligentes y que constituyen <em>de facto</em> un estándar en la comunidad científica.</p>\r\n\r\n<p>Para que el alumnado pueda realizar diversas aplicaciones relacionadas con la Visión por Computador, a lo largo del curso se revisan los tipos básicos de elementos y sensores, viéndose las ventajas e inconvenientes de cada uno de ellos, así como las técnicas más usuales de procesar la información que proveen. A partir de dicho procesamiento de la información y de la extracción de características, se presentan diversos métodos para el reconocimiento de patrones.</p>\r\n", "end_date": "2016-04-16T00:00:00-04:00", "title": "Introducción a la visión por computador: desarrollo de aplicaciones con OpenCV", "price": 0, "instructors": "Arturo de la Escalera, José María Armingol, David Martín Gómez, Fernando García, Abdulla H. Al-Kaff", "institution_name": ["Universidad Carlos III de Madrid"], "commitment": "5 - 7 horas/semana", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/isa.1x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-la-vision-por-computador-uc3mx-isa-1x", "subject_name": ["Computer Science", "Electronics", "Engineering"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-02T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>La finance est omniprésente et les décisions financières nous concernent tous. Tout individu est un jour ou l’autre amené à épargner ou emprunter. La sélection des projets d’investissements et leur financement sont des questions cruciales pour les entrepreneurs ou managers. D’une manière plus large, les décisions prises par le monde politique en matières financières influencent directement ou indirectement le quotidien des citoyens. Les récentes crises financières ont pu nous montrer à quel point il peut être primordial de comprendre les fondamentaux de la finance. Sans un minimum d’éducation financière, il est difficile d’appréhender le fonctionnement du monde dans lequel nous évoluons. Ce cours introductif vous propose un cadre conceptuel et des outils pour vous aider à prendre des décisions financières judicieuses, avec un focus particulier sur les opérations financières courantes. &nbsp;&nbsp;<br />\r\n&nbsp;<br />\r\nAu terme de ce cours, vous serez capable de&nbsp;:</p>\r\n\r\n<ul>\r\n\t<li>Décrire les principes fondamentaux du raisonnement financier : absence d’opportunités d’arbitrage dans un marché concurrentiel, intégration de la dimension temporelle et du risque dans la décision financière&nbsp;;</li>\r\n\t<li>Calculer des valeurs actuelles ou futures, de flux ou de séquence de flux&nbsp;;</li>\r\n\t<li>Appliquer les techniques de l’évaluation actuarielle aux opérations financières courantes (de type épargne ou emprunt) et aux principaux actifs financiers (actions et obligations)&nbsp;;</li>\r\n\t<li>Utiliser les différents outils de sélection d’investissement pour des projets en entreprise&nbsp;;</li>\r\n\t<li>Analyser la problématique de la décision d’investissement, en tenant compte du lien entre rendement attendu et risque&nbsp;;</li>\r\n\t<li>Déterminer le taux de rendement qu’une entreprise doit utiliser lorsqu’elle doit prendre une décision d’investissement et utiliser ce taux pour calculer la valeur générée par un projet&nbsp;;</li>\r\n\t<li>Suivre des cours de finance plus avancés (finance d’entreprise, gestion de portefeuille, marchés financiers, finance internationale, produits dérivés, etc.).</li>\r\n</ul>\r\n\r\n<div>\r\n<p>Financial decisions impact all of us. As individuals we earn money, spend it, borrow it and at times save and invest it. At work, for managers or entrepreneurs, financial decisions are crucial. In the public sector , financial decisions made by politicians affect us every day. Without minimal financial literacy, it is very difficult to succeed, especially in light of the recent financial crises. This introductory course provides a framework and tools to help you make sound financial decisions, with a particular focus on common financial operations.</p>\r\n\r\n<p>At the end of this course, you will be able to:</p>\r\n\r\n<ul>\r\n\t<li>Describe the basics of financial reasoning: absence of arbitrage opportunity in a competitive market, decision-making based on both time and risk ;</li>\r\n\t<li>Calculate present or future values of cash-flows or sequences of cash-flows ;</li>\r\n\t<li>Apply the principles of valuation to value common financial operations (savings or loans) and main financial assets (stocks and bonds);</li>\r\n\t<li>Use different criteria to select investment projects in firms ;&nbsp;</li>\r\n\t<li>Analyze capital budgeting problems, involving the relationship between expected return and risk ;</li>\r\n\t<li>Determine the return a firm should use when facing an investment decision, and use this return to compute the value generated by a project ;&nbsp;</li>\r\n\t<li>Take more advanced courses in finance (corporate finance, portfolio management, financial markets, international finance, derivative securities, etc.).&nbsp;</li>\r\n</ul>\r\n</div>\r\n\r\n<div>&nbsp;Ce cours est enseigné en français. This course is taught in French.</div>\r\n", "end_date": "2016-05-03T00:00:00-04:00", "title": "Les principes de la finance", "price": 0, "instructors": "Catherine D'Hondt, Isabelle Platten", "institution_name": ["Université catholique de Louvain"], "commitment": "3 - 5 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/les-principes-de-la-finance_378x225.jpg", "course_url": "https://www.edx.org/course/les-principes-de-la-finance-louvainx-louv9x-0", "subject_name": ["Business & Management", "Economics & Finance"], "duration": "13 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-02T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Commencer à utiliser un logiciel est toujours délicat, on ne sait jamais par où commencer.</p>\r\n\r\n<p>Dans ce cours nous allons nous concentrer sur la maîtrise d’Octave et MATLAB, de façon à pouvoir par la suite continuer à apprendre de manière indépendante.</p>\r\n\r\n<p>Le but est donc d’apprendre, pas à pas, comment ces logiciels sont organisés, comment faire des calculs compliqués, en utilisant des matrices et des vecteurs, ainsi que traiter des données et dessiner des graphiques qui mettent en valeur vos résultats. Vous allez aussi apprendre à bien organiser le travail en utilisant des scripts et des fonctions, ce qui va améliorer votre efficacité par la suite.</p>\r\n\r\n<p>Enfin vous allez connaitre de bases simples pour la programmation.</p>\r\n", "end_date": "2016-02-26T00:00:00-05:00", "title": "MATLAB et Octave pour débutants", "price": 0, "instructors": "Simone Deparis", "institution_name": ["École polytechnique fédérale de Lausanne"], "commitment": "6 heures/semaine", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/matlaboctavex-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/matlab-et-octave-pour-debutants-epflx-matlaboctavex", "subject_name": ["Computer Science", "Math"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2016-02-01T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>As Parcerias Público-Privadas (PPPs) tornaram-se um instrumento essencial para o crescimento produtivo, econômico e social dos países da América Latina e Caribe. Ao desenvolver e programar as PPPs observam-se restrições nas capacidades técnicas dos responsáveis, em especial no setor público.</p>\r\n\r\n<p>Para preencher esta lacuna, IDBx desenvolveu este curso, o primeiro MOOC disponível em Português para aprender a planejar, projetar e implementar PPPs para projetos de desenvolvimento na América Latina e no Caribe.</p>\r\n\r\n<p>Este curso busca dividir experiências de instituições internacionais líderes com a finalidade de ajudar a diminuir lacunas de conhecimento na utilização efetiva das PPPs, oferecendo ideias, soluções e lições aprendidas para lidar com os desafios ou restrições às capacidades técnicas e administrativas do setor público da região. As lições contidas no MOOC se aplicam a diferentes setores como infraestrutura, saúde, educação, banda larga e setor fiscal, levando em conta contextos nacionais de vários países da região, incluindo Peru, México, Colômbia e Brasil.&nbsp;</p>\r\n\r\n<p>Para este efeito, o curso coloca à disposição dos participantes leituras selecionadas, vídeos, tutoriais de análises e outros recursos de aprendizagem.</p>\r\n\r\n<p>O curso é baseado nos conteúdos do Guia de Referência sobre Parcerias Público-Privadas (PPPs) versão 2.0, desenvolvido e publicado em 2014 pelo BID, Banco Mundial (BM) e Banco Asiático de Desenvolvimento (ADB).</p>\r\n\r\n<p>A elaboração deste curso foi financiada pelo Programa Especial para o Desenvolvimento Institucional (SPID). Mais informações em&nbsp; <a href=\"http://www.iadb.org/es/temas/gobierno/programa-especial-para-el-desarrollo-institucional,8478.html\">SPID</a>.</p>\r\n\r\n<p>-------------</p>\r\n\r\n<p>Public-Private Partnerships (PPPs) have become an essential instrument for productive, economic, and social growth in Latin American countries and the Caribbean.&nbsp;However, when developed and implemented, those responsible for&nbsp;PPPs' implementation&nbsp;have had limited technical capacity, particularly in the public sector.</p>\r\n\r\n<p>In order to&nbsp;address this need, IDB&nbsp;has&nbsp;developed the first MOOC available in Portuguese, to learn&nbsp;how&nbsp;to plan, design, and implement PPPs for development projects in Latin America and the Caribbean.</p>\r\n\r\n<p>This course seeks to share the experiences of leading international institutions&nbsp;to contribute&nbsp;to close the knowledge gaps for&nbsp;the&nbsp;effective use of PPPs,&nbsp;providing&nbsp;ideas, solutions, and lessons learned to face the challenges or limitations of technical and administrative capacity in the region's public sector. The lessons from this course are applicable to different sectors such as infrastructure, health, education, broad band, fiscal&nbsp;sector, and take into consideration national contexts from various countries in the region, including Perú, México, Colombia and Brasil.</p>\r\n\r\n<p>For this goal, this course presents selected readings, videos, tutorials and other knowledge products.</p>\r\n\r\n<p>The course is based on the Public-Private Partnerships (PPPs) Reference Guide Version 2.0, developed and published in 2014 by the IDB, World Bank (WB) and the Asian Development Bank (ADB).</p>\r\n\r\n<p>The preparation of this course was financed by the Special Program for Institutional Development (SPID) of the Inter-American Development Bank. For more information visit the&nbsp;<a href=\"http://www.iadb.org/en/topics/government/special-program-for-institutional-development,8478.html\">SPID</a>&nbsp;website.</p>\r\n", "end_date": "2015-12-22T00:00:00-05:00", "title": "Alianças Público Privadas para o Desenvolvimento: Implementando Soluções no Brasil", "price": 0, "instructors": "Ignacio Astorga, Sergio Campos, Ana Lucia Dezolt, Reinaldo Fioravanti, Ismael Gilio, Juan Ketterer, Gustavo Mendez, Karisa Ribeiro, Marcia Rocha, German Zappani", "institution_name": ["Inter-American Development Bank"], "commitment": "6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb8x-public_private_partnerships-378x225.jpg", "course_url": "https://www.edx.org/course/aliancas-publico-privadas-para-o-idbx-idb8-1x", "subject_name": ["Economics & Finance"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-11-17T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Este curso te ayudará a tomar el control sobre los datos, a darles sentido y, de esta manera, usarlos para mejorar tus decisiones.</p>\r\n\r\n<p>This course will help you take control over data and use it to improve your decisions.</p>\r\n\r\n<p>**<b>Este curso será impartido en español</b>**<br />\r\nEn esta era de la información, los datos están disponibles en todos lados y creciendo a una tasa exponencial. ¿Cómo podemos darle sentido a todos los datos? ¿Cómo aprovechamos los datos en el momento de tomar decisiones? ¿Cómo utilizamos los datos para que nos ayuden a guiar la planificación estratégica de nuestras políticas? Tanto si eres ciudadano como planificador de políticas deberías poder responder a estas preguntas.<br />\r\nEn este curso podrás fortalecer tus capacidades de comprensión e interpretación de datos utilizando la plataforma desarrollada por el BID “Números para el Desarrollo.” A través de estas herramientas podrás mejorar tu proceso de toma de decisiones estratégicas basándolas en el análisis de datos, especialmente en el desempeño de la función pública.<br />\r\nAl finalizar el curso contarás con instrumentos para navegar entre los datos, realizar e interpretar visualizaciones y comprender los diferentes tipos de análisis de datos según el problema estudiado.<br />\r\nTranquilo, no se trata de un curso de estadística, sólo vas a adquirir los conocimientos necesarios para interpretar gráficas o reportes estadísticos. Finalmente, adquirirás las bases para fundamentar tus decisiones en datos comprobables, más allá de tu intuición.<br />\r\nEl curso está compuesto por diferentes actividades prácticas donde se podrán aplicar los conocimientos adquiridos, casos reales del BID donde se promueve el análisis y se presentan las realidades a las que están expuestos los funcionarios públicos de la región y algunos retos creativos que tienen un nivel más alto de complejidad.<br />\r\nFinalmente, el curso tiene lecturas teóricas, videos que permiten generar una mejor compresión de temas del curso y de foros de discusión donde se abren espacios para la construcción grupal alrededor de una pregunta orientadora.</p>\r\n\r\n<p>In this period of information, data is available everywhere and growing at an exponential rate. How can we use data? How do we take advantage of data when making decisions? How do we use data to guide strategic planning of policies?. Whether you are a citizen or policy maker you should be able to answer these questions.<br />\r\nIn this course you would strengthen your skills on understanding and explaining data by using the IDB platform \"Numbers for Development.\" Through these tools you can improve the process of making strategic decisions based on the analysis of data, especially in the performance of public functions.<br />\r\nAfter completing the course you will have instruments to navigate between data, perform and interpret displays and able to understand different types of data analysis according to the problem studied.<br />\r\nDon’t panic, it is not a statistics course; you’re going to acquire the knowledge to understand graphs and statistical reports. Finally, you will acquire tangible foundation to base your decisions on proper data, beyond your intuition.<br />\r\nThe course consists of various practical activities where you can apply the acquired knowledge, there are real case studies of IDB, where the analysis is needed together with real public officials reality when working in the region, also there are some creative challenges at higher-level off complexity.<br />\r\nFinally, the course has readings, videos allowing the generation of better understanding of the course and open to discussion among the participants.</p>\r\n", "end_date": "2015-12-11T00:00:00-05:00", "title": "Datología: La toma de decisiones basada en datos | Datalogy: Data-driven decision making", "price": 0, "instructors": "Ivette Fis de Melo, Norma Palomino", "institution_name": ["Inter-American Development Bank"], "commitment": "5 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb10x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/datologia-la-toma-de-decisiones-basada-idbx-idb10x", "subject_name": ["Business & Management", "Economics & Finance", "Math"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-11-10T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Entre 1950 e 2010, a taxa de urbanização da América Latina passou de 41% a 79%. Caso esta tendência se mantenha, a taxa de urbanização em 2030 será de cerca de 90%, fazendo da região a mais urbanizada do planeta.</p>\r\n\r\n<p>Essa tendência consolida a cidade como o centro do desenvolvimento econômico e humano da região. A cidade está criando trabalho, está inovando, está repensando seus sistemas de saúde e educação, transporte, está fazendo frente às mudanças do clima, está abrindo espaços para o debate e a socialização. Para que esse dinamismo possa traduzir-se em um fenômeno exitoso, a cidade deve aprender a planejar seu presente pensando em seu futuro, buscando o equilíbrio entre crescimento econômico, a inclusão social e o respeito ao meio ambiente. É, portanto, responsabilidade das cidades melhorar a qualidade de vida das gerações presentes sem comprometer o bem estar das gerações futuras.</p>\r\n\r\n<p>Com o objetivo de responder a este desafio, o BID criou um curso que busca fortalecer os conhecimentos e capacidades dos participantes em gerir o desenvolvimento sustentável de suas cidades. E para isso, o curso parte da premissa que a sustentabilidade das cidades só será alcançada por meio de uma perspectiva integrada e intersetorial; uma perspectiva integral, onde se trabalhe de maneira conjunta os desafios econômicos, fiscais, urbanos, ambientais, institucionais e de governabilidade das cidades junto com uma perspectiva intersetorial, onde as diferentes áreas e níveis de governo se coordenem e que se articulem com o setor privado e com a sociedade civil.</p>\r\n\r\n<p>Com o objetivo de entender melhor essa perspectiva, o curso analisa a situação, os desafios setoriais e intersetoriais que as cidades encontram na gestão das principais áreas de sua competência: finanças subnacionais, desenvolvimento produtivo, planejamento urbano, transporte, segurança cidadã, água, ar etc. Desta forma, com o objetivo de abordar o planejamento do desenvolvimento sustentável das cidades médias latino americanas, o curso apresenta a “Iniciativa Cidades Emergentes e Sustentáveis”, uma ferramenta de gestão que permite dar sentido ao trabalho analítico das dimensões/desafios de forma integrada.</p>\r\n\r\n<p>Assim como na América Latina e no Caribe, o Brasil possui grandes desafios ambientais, urbanos e fiscais para a sustentabilidade de suas cidades. Dentre eles se destacam os altos índices de violência - 25,8 mortes violentas por 100 mil habitantes segundo o Fórum Brasileiro de Segurança Pública; a desigualdade urbana, uma vez que o país é o 4º mais desigual da América Latina e Caribe; e a vulnerabilidade diante de desastres naturais, onde se calcula, por exemplo, que a reconstrução das cidades cariocas devastadas pelas enchentes e pelos deslizamentos de 2011 custou 1,3% do PIB do estado do Rio de Janeiro; ou ainda, degradação ambiental, com um índice de 63% de esgoto sendo lançado nos corpos hídricos sem nenhum tratamento, segundo o MCidades.</p>\r\n\r\n<p>Além de fornecer conceitos e uma visão abrangente da situação do Brasil em relação à sustentabilidade das cidades, neste curso serão abordados alguns desafios dos municípios, bem como exemplos práticos de como esses problemas estão sendo enfrentados.</p>\r\n", "end_date": "2015-12-15T00:00:00-05:00", "title": "Liderando o Desenvolvimento Sustentável das Cidades", "price": 0, "instructors": "Jose E. Yitani Ríos, Daniela Carrera, ​Ana María Rodríguez, Ellis Juan, Horacio Terraza, Marcia Casseb, Mara Alvim Motta, Rebecca Sabo, David Maleki, William Lauriano, Marcelo Facchina, Katia Miller, Ricardo De Vecchi, María Isabel Beltrán, Cristina MacDowell, Alejandro de la Reza, Vanderleia Radaelli, Diego Carrión, Javier León, Darío Hidalgo, Heloísa Barbeiro, José Brakarz, Santiago Bonifatti, Clean Air Institute, Gloria Visconti, Arturo Galindo, Maria Eugenia Schmuck, ​Carolina Barco, Patricio Tudela, Nathalie Alvarado, Adenilson Ferreira", "institution_name": ["Inter-American Development Bank"], "commitment": "6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/idb4.1x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/liderando-o-desenvolvimento-sustentavel-idbx-idb4-1x", "subject_name": ["Economics & Finance", "Business & Management"], "duration": "6 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-11-03T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>Este curso ofrece conceptos básicos que permiten una aproximación interdisciplinaria, crítica, problematizadora y propositiva para la educación intercultural bilingüe.</p>\r\n\r\n<p>La educación intercultural es un enfoque educativo que se viene usando en naciones multiculturales como México, para afrontar problemáticas de desigualdad social, diferencia cultural, racismo y la universalización de la escuela y sus efectos, en el que no solo incluye la atención a las minorías indígenas, sino a la toda la sociedad en su conjunto. Los principales retos son: la democratización del sistema educativo, la trasformación de las inequidades, el acceso a la educación y permanencia.</p>\r\n\r\n<p>La formación de los agentes educativos en los conceptos básicos en este campo busca trasformar las prácticas pedagógicas dentro y fuera de la escuela.</p>\r\n", "end_date": "2015-12-01T00:00:00-05:00", "title": "Educación intercultural. Perspectivas interdisciplinarias", "price": 0, "instructors": "Nicanor Rebolledo", "institution_name": ["MéxicoX"], "commitment": "6 - 7 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/upn002x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/educacion-intercultural-perspectivas-mexicox-upn002x", "subject_name": ["Education & Teacher Training"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-10-19T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Hoy nuestra cultura debe estar inmersa en ese ya tan importante concepto llamado: RESILIENCIA Nómica. Concepto que la <strong>OCDE&nbsp;</strong><em>(Organización para la Cooperación y el Desarrollo Económicos con 34 países)&nbsp;</em>en Japón y México <strong>2015</strong> lo señalan como prioritario,&nbsp;especialmente en las fuerzas de trabajo; el <strong>PNUD</strong>&nbsp;<em>(Programa de las Naciones Unidas para el Desarrollo)&nbsp;</em>en su reciente <strong>Informe sobre Desarrollo Humano 2014 </strong>lo vuelve como una urgencia global desde noviembre 2015; &nbsp;el <strong>Foro Económico Mundial del 2013</strong>, declara el Dinamismo RESILIENTE como una cultura urgente a trasladar a las tradiciones del hogar en familia, sobre todo en Iberoamérica. Es lo único que hará de esta región una región que destaque por su desarrollo humano y erradicación de la pobreza.</p>\r\n", "end_date": "2016-01-09T00:00:00-05:00", "title": "Resiliencia Nómica", "price": 0, "instructors": "Dagoberto Flores Olvera, Miryam Ángeles González, Malú Sánchez Paz, Agustín Ríos Matence, José Antonio Monroy Ramírez, Gerardo Fernández Fernández", "institution_name": ["MéxicoX"], "commitment": "4 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/iiidrn101x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/resiliencia-nomica-mexicox-iiidrn101x", "subject_name": ["Health & Safety", "Biology & Life Sciences"], "duration": "11 semanas", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-10-19T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Le théâtre classique du 17e&nbsp;siècle passe pour le sommet de l’art du théâtre en France. Ses trois représentants les plus connus, Corneille et Racine pour la tragédie et Molière pour la comédie comptent parmi les plus grands dramaturges européens de tous les temps, et Molière reste l’un des auteurs les plus joués dans le monde.</p>\r\n\r\n<p>Pour vous les faire découvrir, nous vous emmènerons dans l’environnement historique, sociologique, culturel et littéraire qui les a vu naître. Nous retracerons ainsi l’histoire du \"théâtre moderne\" depuis sa naissance au milieu du 16e&nbsp;siècle jusqu’aux plus brillantes années du \"siècle de Louis XIV\"(2e&nbsp;moitié du 17e&nbsp;siècle).</p>\r\n\r\n<p>Nous examinerons ainsi les fondements de l’expression \"théâtre classique,\" les fondements du système qui a vu naître les \"règles classiques,\"&nbsp;les fondements d’un dialogue théâtral qui repose entièrement sur \"l’alexandrin classique.\" Et nous ferons apparaître les tensions créatrices (entre la théorie et la pratique, entre les règles et le refus des règles, entre le texte et le spectacle, entre le classicisme et le baroque, entre la tragédie et l’opéra) qui ont façonné le théâtre de cette période.</p>\r\n\r\n<p>Enfin, en vous accompagnant dans la lecture des quelques chefs-d’œuvre qui ont créé une rupture esthétique et marqué les esprits, nous vous ferons pénétrer avec nous dans l’atelier créateur des plus grands dramaturges de l’âge d’or du théâtre français.</p>\r\n\r\n<p>Pièces de théâtre à lire: Le Cid et Cinna de Corneille / Les Précieuses ridicules, L’École des femmes et Tartuffe de Molière / Andromaque et Phèdre de Racine.</p>\r\n\r\n<p>Ces textes sont tous disponibles en éditions de poche (choisir de préférence \"Folio classique” et \"Folio Théâtre\"&nbsp;ou \"Le Livre de poche Classique.\")&nbsp;</p>\r\n\r\n<p>Nous vous invitons à découvrir avec nous d’où viennent ces trois auteurs, comment ils se sont construits, comment ils se sont distingués des plus brillants dramaturges de leur temps. Et nous vous montrerons quels sont les ingrédients qui ont permis à leurs œuvres d’avoir été sans cesse lues et jouées jusqu’à aujourd’hui — et cela, alors même que de nombreux éléments-clés (l’obéissance à des \"règles\"&nbsp;et l’usage du vers dit \"alexandrin,\"&nbsp;en particulier) ont disparu depuis longtemps.</p>\r\n\r\n<div>&nbsp;</div>\r\n\r\n<p>&nbsp;</p>\r\n", "end_date": "2015-11-20T00:00:00-05:00", "title": "À la découverte du théâtre classique français – Tome 1", "price": 0, "instructors": "Georges Forestier", "institution_name": ["Sorbonne University System"], "commitment": "3-5 heures/semaine", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/lf001.1x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/la-decouverte-du-theatre-classique-sorbonnex-lf001-1x", "subject_name": ["Humanities", "Literature", "History"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-10-15T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La Universidad del Claustro de Sor Juana, que tiene el privilegio de ocupar el ex Convento de San Jerónimo, desde su fundación ha asumido como vocación y compromiso, promover y difundir el conocimiento de la vida y de la obra de Sor Juana así como del mundo virreinal. Este curso tiene como propósito brindar un acercamiento a los interesados. El objetivo primordial de este material es dar al participante una muestra de la producción de la autora novohispana; de su vida y su tiempo.</p>\r\n", "end_date": "2015-11-20T00:00:00-05:00", "title": "Seducciones de Sor Juana", "price": 0, "instructors": "Sandra Lorenzano", "institution_name": ["MéxicoX"], "commitment": "5 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/sdsj01x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/seducciones-de-sor-juana-mexicox-sdsj01x", "subject_name": ["Art & Culture", "History"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-10-13T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>En este curso trabajarás la definición, el desarrollo y el cierre de un proyecto de Tecnologías de la Información. Tu dedicación y constancia serán la clave para alcanzar el éxito deseado, a través de las metas planteadas. Encontrarás una serie de actividades para desarrollar el curso AP de TI, el tiempo propuesto para éste será de 40 horas totales. Cabe mencionar que deberás dedicar 10 horas de estudio mínimo a la semana, por lo que tú serás responsable de administrar el tiempo que le dedicarás al MOOC de Administración de Proyectos de Tecnologías de la Información. Te recomendamos planificar tu tiempo para poder realizar cada una de las actividades que se te solicitan como complemento a los contenidos temáticos para evitar retrasos.</p>\r\n\r\n<p>Es importante que pongas mucha atención en los recursos que se te presentan dentro del contenido, ya que te servirán para orientarte en la definición, desarrollo y cierre de tu proyecto informático. A continuación te mencionaremos cómo estará estructurado el curso, lo cual te facilitará su comprensión.</p>\r\n\r\n<p>El curso comprende tres grandes bloques y a cada uno corresponde una meta, de las que se desarrolla el contenido que debes estudiar, los cuales muestran y describen las etapas de administración de un proyecto de Tecnologías de Información (TI). Lo anterior se apoya en distintas actividades y ejercicios, además de los recursos complementarios proporcionados. Con la finalidad de definir un proyecto de TI, se mostrará el análisis de técnicas y metodologías para el desarrollo y el cierre del mismo, entre otros aspectos que identificarás a lo largo del contenido.</p>\r\n\r\n<p>Como parte de tu autoaprendizaje, se recomienda que realices las lecturas sugeridas dentro de los bloques y las investigaciones a través de búsquedas en Internet y bibliografías especializadas en la materia de Administración de Proyectos para complementar tu formación y conocimiento.</p>\r\n", "end_date": "2015-10-30T00:00:00-04:00", "title": "Administración de proyectos de Tecnologías de la Información", "price": 0, "instructors": "Ricardo Ángel Aguilar Pérez", "institution_name": ["MéxicoX"], "commitment": "10 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/upevipn03x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/administracion-de-proyectos-de-mexicox-upevipn03x", "subject_name": ["Computer Science", "Business & Management"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-10-05T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>¿Te has preguntado cómo funciona tu cuerpo?</p>\r\n\r\n<p>En este curso de Biología Humana conocerás la información básica sobre la estructura y función celular, y cómo a partir de la interacción entre células, se forman tejidos, órganos y sistemas. Estos elementos en conjunto, hacen que nuestro cuerpo funcione adecuadamente.</p>\r\n\r\n<p>Para que termines con éxito este curso, necesitas empeño y dedicación en el estudio de las metas que hemos diseñado para ti, es importante que dediques 8 horas de estudio a la semana, recuerda que tú eres responsable de administrar dicho tiempo.</p>\r\n\r\n<p>Te sugerimos realizar un plan de trabajo para que consideres las fechas límites de las actividades y evitar atrasos. Por otra parte es importante que pongas mucha atención en todos los recursos que te ofrecemos, los cuales refuerzan tu conocimiento para culminar el curso satisfactoriamente.</p>\r\n\r\n<p>Para facilitar la comprensión y asimilación de los contenidos del curso hemos diseñado ilustraciones, animaciones, documentos adicionales y ejemplos que debes analizar y relacionar con el funcionamiento de tu cuerpo. Asimismo, pondrás en práctica tus conocimientos mediante actividades que te servirán para conocer tu nivel de dominio de cada apartado y te servirán para acreditar tu curso.</p>\r\n", "end_date": "2015-10-23T00:00:00-04:00", "title": "Biología Humana", "price": 0, "instructors": "Dr. Juan Vargas Mancilla", "institution_name": ["MéxicoX"], "commitment": "8 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/upevipn01x-course_image-378x225a.jpg", "course_url": "https://www.edx.org/course/biologia-humana-mexicox-upevipn01x", "subject_name": ["Biology & Life Sciences", "Chemistry", "Medicine", "Science"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-28T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La cocina mexicana es una de las mayores expresiones culturales de México. Es resultado del encuentro de dos mundos y de la suma de otras culturas. Su riqueza se da gracias a la enorme biodiversidad natural y cultural del país. En noviembre de 2010 fue declarada como Patrimonio Inmaterial de la Humanidad por la UNESCO.</p>\r\n\r\n<p>Este curso, impartido por la Universidad del Claustro de Sor Juana,&nbsp;te proporcionará una visión amplia sobre los ingredientes básicos de la cocina mexicana. Conocerás sobre productos endémicos de México, la relevancia cultural e histórica de estos ingredientes y su importancia a nivel mundial; asimismo aprenderás algunas de las preparaciones más representativas de la cocina mexicana utilizando estos insumos. El curso consta con 6 módulos:</p>\r\n\r\n<ul>\r\n\t<li>Módulo 1. Introducción a la cocina mexicana</li>\r\n\t<li>Módulo 2. El maíz</li>\r\n\t<li>Módulo 3. El chile</li>\r\n\t<li>Módulo 4. El jitomate y el frijol</li>\r\n\t<li>Módulo 5. La vainilla y el amaranto</li>\r\n\t<li>Módulo 6. El cacao</li>\r\n</ul>\r\n", "end_date": "2015-10-30T00:00:00-04:00", "title": "De México al mundo, los ingredientes", "price": 0, "instructors": "Marco Antonio Covarrubias Castro", "institution_name": ["MéxicoX"], "commitment": "5 horas/la semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/g01x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/de-mexico-al-mundo-los-ingredientes-mexicox-g01x", "subject_name": ["Art & Culture", "Food & Nutrition"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Las enfermedades transmitidas por vector (ETV) comprenden un grupo heterogéneo de enfermedades que difieren en su expresión clínica y patológica en las que están involucradas una gran variedad de agentes patógenos y vectores transmisores. Actualmente, las ETV de mayor importancia por su magnitud, trascendencia y vulnerabilidad son el dengue y el paludismo. Por otro lado, el riesgo de que el virus de Chikungunya se propague a nivel mundial, especialmente en las Américas, es probablemente mayor de lo que se había pensado.</p>\r\n\r\n<p><span>El curso, impartido por el&nbsp;</span><span class=\"s1\">Instituto Nacional de Salud Pública (INSP)</span><span>, tiene como objetivo capacitar al personal de salud en el adecuado diagnóstico, tratamiento y manejo en general de enfermedades transmitidas por vector (ETV) de mayor impacto.</span></p>\r\n", "end_date": "2015-10-02T00:00:00-04:00", "title": "ETV: Paludismo, Dengue y Chikungunya", "price": 0, "instructors": "Dra. Celia Mercedes Alpuche Aranda", "institution_name": ["MéxicoX"], "commitment": "10 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/etv.001-course_image-378x225_0.jpg", "course_url": "https://www.edx.org/course/etv-paludismo-dengue-y-chikungunya-mexicox-etv-001", "subject_name": ["Health & Safety"], "duration": "2 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El curso <em>Literatura y cultura tradicional de México</em>, impartido por el El Colegio de México, te llevará por un recorrido que atraviesa las principales manifestaciones de la cultura tradicional mexicana para conocer sus raíces, antecedentes e incluso sus expresiones más modernas.</p>\r\n\r\n<p>Durante estas seis semanas, Aurelio González, doctor en Literatura Hispánica y miembro de la Academia Mexicana de la Lengua, nos llevará a conocer los aspectos más relevantes de estas expresiones tradicionales de México:</p>\r\n\r\n<ol>\r\n\t<li>Cuentos tradicionales</li>\r\n\t<li>Canciones y bailes</li>\r\n\t<li>Corridos</li>\r\n\t<li>Fiestas, conmemoraciones y sus textos</li>\r\n\t<li>Leyendas</li>\r\n\t<li>Costumbres y artesanía</li>\r\n</ol>\r\n\r\n<p>Cada uno de los módulos se acompañará de materiales visuales, textuales o bibliográficos.</p>\r\n\r\n<p>El curso Literatura y cultura tradicional de México te llevará por un recorrido que atraviesa las principales manifestaciones de la cultura tradicional mexicana para conocer sus raíces, antecedentes e incluso sus expresiones más modernas.</p>\r\n", "end_date": "2015-10-30T00:00:00-04:00", "title": "Literatura y cultura tradicional de México", "price": 0, "instructors": "Dr. Aurelio González Pérez", "institution_name": ["MéxicoX"], "commitment": "6 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/cmlt1x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/literatura-y-cultura-tradicional-de-mexicox-cmlt1x", "subject_name": ["Art & Culture", "History", "Humanities", "Literature"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>¿Por qué es importante aprender sobre migración internacional? Porque representa uno de los fenómenos sociales contemporáneos más importantes.El curso te permitirá conocer los aspectos más relevantes de la migración, sus características socio demográficas, su impacto en lugares de destino, tránsito y llegada a las políticas públicas actuales y aspectos sociales y culturales del fenómeno.&nbsp;</p>\r\n", "end_date": "2015-11-27T00:00:00-05:00", "title": "Migración, un fenómeno global", "price": 0, "instructors": "Dr.  Douglas Massey, Dr. René Zenteno Quintero, Dr. Joaquín Arango Vila-Belda, Dr. Rodolfo Cruz Piñeiro, Dr. Rafael Alarcón Acosta, Dra.  María Eugenia Anguiano Téllez, Dra.  María Dolores Paris Pombo, Dra.  Laura Velasco Ortiz, Dr. Jorge Eduardo Mendoza Cota, Dr. José Manuel Valenzuela Arce", "institution_name": ["MéxicoX"], "commitment": "5 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/colef01.1x-course_card_image-378x225.jpg", "course_url": "https://www.edx.org/course/migracion-un-fenomeno-global-mexicox-colef01-1x", "subject_name": ["Social Sciences", "History"], "duration": "10 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Descubre la programación orientada a objetos y resuelve problemas con sistemas computacionales.</p>\r\n\r\n<p>En este curso trabajarás con los fundamentos de la programación orientada a objetos para la resolución de problemas en sistemas computacionales.</p>\r\n\r\n<p>Tu empeño y dedicación serán cruciales para culminar con éxito las metas que hemos diseñado para ti, por lo que deberás dedicarle 12 horas de estudio a la semana; administra tu tiempo adecuadamente. Te sugerimos realizar un plan de trabajo para que consideres las fechas límites de las actividades y evitar atrasos. Por otra parte es importante que pongas mucha atención en todos los recursos que te ofrecemos, los cuales refuerzan tu conocimiento para culminar el curso satisfactoriamente.</p>\r\n\r\n<p>Para facilitar la comprensión y asimilación de los contenidos del curso, hemos diseñado videos, ilustraciones, animaciones, tutoriales, documentos adicionales y ejemplos que debes analizar y relacionar con todo lo que haces en tu vida diaria. Asimismo, pondrás en práctica tus conocimientos mediante actividades que te servirán para conocer tu nivel de dominio de cada apartado y te servirán para acreditar tu curso.</p>\r\n", "end_date": "2015-10-16T00:00:00-04:00", "title": "Programación Orientada a Objetos", "price": 0, "instructors": "Jesús Alexander Alvarado Gutiérrez", "institution_name": ["MéxicoX"], "commitment": "12 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/upevipn02x-course_image-378x225c.jpg", "course_url": "https://www.edx.org/course/programacion-orientada-objetos-mexicox-upevipn02x", "subject_name": ["Computer Science", "Engineering"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>En el caso de la escuela, el fenómeno de la violencia se ha incrementado de manera significativa en el último tiempo. Sin embargo ¿Cómo afrontar dicha problemática?</p>\r\n\r\n<p>Frente al carácter limitado que poseen las estrategias de tipo restringido que plantean soluciones remediales desde enfoques de tipo reactivo y punitivo, en este curso se plantea la necesidad de construir estrategias de carácter más amplio que a través de enfoques de tipo preventivo pongan el acento en la promoción del desarrollo de climas de convivencia pacíficos, cuando se comprende el carácter estructural que poseen la génesis y desarrollo de los fenómenos de violencia en la escuela.</p>\r\n\r\n<p>Quien se inscriba en este curso podrá adquirir las herramientas teórico-metodológicas para comprender a mayor profundidad el fenómeno y para poder construir estrategias para el diagnóstico y la intervención más pertinentes a fin de hacer frente a los problemas de convivencia que hoy día se viven en las escuelas.</p>\r\n", "end_date": "2015-11-06T00:00:00-05:00", "title": "Violencia en la escuela. Herramientas para el diagnóstico e intervención.", "price": 0, "instructors": "Lucía Elena Rodríguez McKeon", "institution_name": ["MéxicoX"], "commitment": "6 - 8 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/upn001x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/violencia-en-la-escuela-herramientas-mexicox-upn001x", "subject_name": ["Education & Teacher Training"], "duration": "7 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El Álgebra Lineal es una parte esencial en la formación matemática de todo científico, administrador e ingeniero, pues sus aplicaciones son numerosas en las áreas de física, química, ingeniería biomédica, gráficas computarizada, procesamiento de imágenes, optimización de procesos, entre muchas otras.</p>\r\n\r\n<p>En el contenido de este curso encontrarás los siguientes temas:</p>\r\n\r\n<ol>\r\n\t<li>Números complejos.</li>\r\n\t<li>Matrices y determinantes.</li>\r\n\t<li>Sistemas de ecuaciones lineales.</li>\r\n</ol>\r\n\r\n<p>Al final del curso serás capaz de resolver sistemas de ecuaciones, involucrados en muchos problemas académicos y del ámbito profesional.</p>\r\n\r\n<p>El diseño de este curso, está orientado a proporcionarte las herramientas necesarias para un mejor desempeño en el aprendizaje de estos temas. Contarás para ello con notas de apoyo en formato electrónico (PDF) de la materia, videos tutoriales, que te mostrarán paso a paso como obtener la solución de los ejemplos planteados, Applets interactivos para reforzar la comprensión geométrica de los conceptos algebraicos, autoevaluaciones en línea para registrar tu avance y foros de discusión entre usuarios.</p>\r\n", "end_date": "2015-10-30T00:00:00-04:00", "title": "Álgebra Lineal", "price": 0, "instructors": "Gabriel Villaseñor Aguilar", "institution_name": ["MéxicoX"], "commitment": "5 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/acf.0903.1x-course_image-378x225.jpg", "course_url": "https://www.edx.org/course/algebra-lineal-mexicox-acf-0903-1x", "subject_name": ["Math"], "duration": "6 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-09-21T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El objetivo de este curso es ayudar a los estudiantes a familiarizarse con los principales pintores y pinturas europeas desde 1400 hasta 1800 aproximadamente, y con los problemas que encuentran su expresión en el arte de la pintura. En este amplio marco temporal se incluyen artistas de la importancia de Leonardo da Vinci, Caravaggio, Velázquez, Rembrandt, Vermeer o Goya.</p>\r\n\r\n<p>Los pintores durante este periodo estaban preocupados por ideas tales como la búsqueda de la belleza, los placeres y dolores asociados al amor, la demostración de poder y estatus, o la relación de hombres y mujeres con la divinidad y la naturaleza. En las pinturas del período cubierto en este curso se encuentran rastros de la aparición de la mentalidad moderna, así como información sobre cuestiones tales como los roles respectivos de los hombres y las mujeres en el mundo.</p>\r\n\r\n<p>Las clases se centrarán en imágenes de pinturas de los artistas que figuran en el programa del curso. Las discusiones que tendrán lugar en el \"Foro del curso\" nos permitirán abordar una gama más amplia de cuestiones.</p>\r\n", "end_date": "2015-09-15T00:00:00-04:00", "title": "Pintura europea: Leonardo, Rembrandt, Goya", "price": 0, "instructors": "Alejandro Vergara, Jennifer Calles", "institution_name": ["Universidad Carlos III de Madrid"], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/ceh.1-en378x225_0.jpg", "course_url": "https://www.edx.org/course/pintura-europea-leonardo-rembrandt-goya-uc3mx-ceh-1-esx", "subject_name": ["Art & Culture", "History", "Humanities"], "duration": "9 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-07-14T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La complejidad de los problemas emanados de una rápida globalización de la economía así como&nbsp; los grandes avances en la tecnología de la información (TI) han acelerado la aparición de sucesivas crisis económicas y sociales en las que tanto gobiernos de muchos países como empresas encuentran dificultades para adaptarse a esta nueva situación&nbsp; y cambiar con agilidad sus modelos de&nbsp; gobierno y gestión.<br />\r\n<br />\r\nPor otro lado la agresión al medio ambiente y el cambio climático&nbsp; y&nbsp; la necesidad de atender los requerimientos&nbsp; de agentes económicos y sociales reclaman su derecho a desempeñar el rol que les corresponde. Emergen tendencias como la Responsabilidad Social Corporativa, vinculada a procesos de reporte estandarizado, como el que marca Global Reporting Initiative (GRI) y a mejoras en los esquemas de Gobernanza Corporativa, necesarias para armonizar los distintos ecosistemas tanto sociales como empresariales y ambientales garantizando la legítima participación de todas las partes interesadas y equiparando la información generada a la financiera a la hora de tomar decisiones.<br />\r\n<br />\r\nEn este escenario, los activos utilizados tanto por gobiernos como empresas para desarrollar deben ser administrados de manera eficaz y eficiente para incrementar el valor de las organizaciones de manera incremental y continua garantizando principalmente&nbsp; la sostenibilidad económico financiera de esas organizaciones. Dentro de esos activos, la información y la TI adquieren valor importantísimo para facilitar &nbsp;las necesidades de transformación de las organizaciones y, especialmente gobernar y gestionar el uso adecuado de la TI tal como señala la norma ISO/IECE 38500.<br />\r\n<br />\r\nEn cualquier caso, la implantación de éstas &nbsp;tecnologías requiere un cambio profundo en la cultura de las organizaciones, públicas y privadas y la adopción de principios y políticas internas que impidan posibles perjuicios a todas las partes interesadas en el éxito de dichas organizaciones.<br />\r\n<br />\r\nLa aplicación de las distintas normas mencionadas así como&nbsp; renovación del concepto de Gobernanza Corporativa aplicada a los distintos activos y especialmente a la TI (dirección y control en el uso y gestión de los mismos) es uno de los grandes retos a los que se enfrenta hoy el mundo económico financiero así como la generación de conocimiento e inteligencia para resolver los graves problemas de nuestros días y en el futuro. Esta nueva forma de trabajar hará que las empresas sean más responsables, comprometidas, humanas, &nbsp;productivas, y más eficaces y eficientes en el liderazgo, formación y aptitud personal así como un uso adecuado de la TI por parte de la organización.</p>\r\n", "end_date": "2015-08-01T00:00:00-04:00", "title": "Responsabilidad Social Corporativa y su impacto sobre la Gestión de la Tecnología de la Información", "price": 0, "instructors": "José Carrillo, Gerardo Fernández Fernández, Rafael Miñano, Ana Moreno, Edmundo Tovar , Javier Uceda", "institution_name": ["Open Education Consortium"], "commitment": "6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/responsabilidad-social-corporativa_378x225.jpg", "course_url": "https://www.edx.org/course/responsabilidad-social-corporativa-y-su-oecx-b1156-x", "subject_name": ["Business & Management", "Computer Science", "Economics & Finance"], "duration": "4 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-07-07T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>El curso Evaluación de Impacto de Programas Sociales de J-PAL te aportará los conceptos fundamentales para entender cómo la metodología experimental puede ser empleada con el objetivo de evaluar programas sociales.<br />\r\n&nbsp;<br />\r\nEste curso de nueve semanas de duración (ocho semanas de contenido, una semana para la prueba final) te permitirá desarrollar una comprensión sólida de la metodología que subyace a las evaluaciones experimentales, y te mostrará paso a paso cómo llevar a cabo tu propia evaluación. El curso se centra en las preguntas de por qué, cuándo y cómo llevar a cabo evaluaciones experimentales. Combinando clases teóricas y casos de estudio basados en evaluaciones reales, el curso presta atención a aspectos como las virtudes de la metodología experimental, los distintos métodos de aleatorización posibles, cómo determinar el tamaño de muestra necesario para poder estimar un impacto o qué situaciones ponen en riesgo la validez interna de un experimento. Asimismo, enfatiza otros temas que son relevantes para cualquier tipo de evaluación de programas, tales como la importancia de hacer un buen diagnóstico de necesidades, definir la teoría de cambio, medir adecuadamente los resultados de interés, asegurar la calidad de los datos y monitorear la implementación.<br />\r\n&nbsp;<br />\r\nEl curso de Evaluación de Impacto de Programas Sociales está diseñado para múltiples tipos de audiencias: representantes de fundaciones y ONGs vinculadas al desarrollo internacional, funcionarios de gobierno de países iberoamericanos, así como investigadores, académicos y estudiantes de habla hispana en busca de nuevas herramientas de análisis.</p>\r\n", "end_date": "2015-07-13T00:00:00-04:00", "title": "Evaluación de Impacto de Programas Sociales", "price": 0, "instructors": "Francisco Gallego, Marc Shotland", "institution_name": ["MIT"], "commitment": "3-5 horas semanales", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/evaluacion-de-impacto-de-programas-sociales_378x225.jpg", "course_url": "https://www.edx.org/course/evaluacion-de-impacto-de-programas-mitx-jpal101spax", "subject_name": ["Economics & Finance", "Social Sciences", "Data Analysis & Statistics"], "duration": "9 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-05-11T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Este curso se concibe como una revisión de los conceptos básicos del cálculo diferencial, necesarios para los primeros cursos de aquellos estudios universitarior en los que se imparte matemáticas. Nuestro objetivo es proporcionar un curso básico sobre funciones y derivadas, incluyendo sus aplicaciones.</p>\r\n", "end_date": "2015-05-19T00:00:00-04:00", "title": "Bases Matemáticas: Derivadas", "price": 0, "instructors": "Dr. Santiago Moll López, Dr. José Antonio Moraño Fernández", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/bases-matematicas-derivadas_378x225.jpg", "course_url": "https://www.edx.org/course/bases-matematicas-derivadas-upvalenciax-bmd101x", "subject_name": ["Math"], "duration": "5 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-04-14T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>La necesidad de conocer los vehículos aeroespaciales y sus sistemas de vuelo exige el conocimiento adecuado y aplicado a la Ingeniería de los diferentes métodos de cálculo y diseño en el campo aeroespacial; el uso de la experimentación aerodinámica y de los parámetros más significativos en la aplicación teórica; el acercamiento a las técnicas experimentales, equipamiento e instrumentos de medida propios de la disciplina; la simulación, diseño, análisis e interpretación de experimentación y operaciones en vuelo; los sistemas de mantenimiento y certificación de aeronaves.<br />\r\n<br />\r\nEstas necesidades se acometen de diversas formas en el sector aeroespacial dependiendo de si es un vehículo espacial, una aeronave de ala fija y una aeronave de ala rotatoria. Es esta última la que centra el objetivo de esta asignatura introductoria hacia conocimientos de mayor envergadura en curso de master o especialización.</p>\r\n", "end_date": "2015-05-04T00:00:00-04:00", "title": "Introducción a la Ingeniería del Helicóptero", "price": 0, "instructors": "Miguel A. Barcala, Ángel A. Rodríguez-Sevillano", "institution_name": ["Open Education Consortium"], "commitment": "6 hours/week", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/introduccion-a-la-ingenieria-del-helicoptero_378x225.jpg", "course_url": "https://www.edx.org/course/introduccion-la-ingenieria-del-oecx-e2601x", "subject_name": ["Engineering"], "duration": "3 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-04-13T00:00:00-04:00"},
{"selfpaced": false, "description": "<p>Las estructuras están implicadas en nuestras vidas: las plantas, los animales, casi todo lo que fabrica el ser humano, incluso nuestro propio cuerpo, deben soportar una serie de fuerzas sin romperse, y por lo tanto prácticamente cualquier elemento de nuestro entorno es una estructura de una clase u otra. No cabe duda de que entender cómo se comportan las estructuras es fundamental para entender el mundo que nos rodea, para comprender la naturaleza y para juzgar mejor los progresos que ha hecho la humanidad a lo largo de la historia. Sin embargo, los ingenieros hemos fallado una y otra vez cuando hemos intentado explicar esta materia de forma que los no entendidos puedan entender su importancia.</p>\r\n\r\n<p>Este curso pretende saltar esa brecha existente entre los expertos en cálculo de estructuras y los profanos utilizando un lenguaje asequible, empleando ejemplos históricos y proponiendo ensayos sencillos que pueden hacerse en casa. El curso abordará no sólo el problema de por qué los edificios y los puentes se caen sino también otras muchas cuestiones ¿Por qué las ventanas de los aviones son redondas? ¿Por qué los gusanos tienen esa forma? ¿Por qué los murciélagos pueden volar dentro de un rosal sin rasgarse las alas? ¿Cómo funcionan las arterias? ¿Por qué las catedrales góticas pueden ser tan esbeltas? ¿Por qué hay construcciones romanas que siguen en pie 2000 años después? ¿Qué podemos aprender sobre los constructores de las diferentes estructuras que nos han legado nuestros antepasados? Muchos contenidos de este curso pueden ser útiles para médicos, biólogos, artistas, historiadores y arqueólogos.<br />\r\n<br />\r\n<a href=\"http://courses.edx.org/c4x/UC3Mx/MMC.1x/asset/MMC.1x-Syllabus.pdf\">More info\" / \"Más información</a></p>\r\n", "end_date": "2015-03-27T00:00:00-04:00", "title": "Caer o No caer. El Secreto de las Estructuras.", "price": 0, "instructors": "Carlos Santiuste, José Fernández Sáez, Ramón Zaera, José Luis Pérez Castellanos, David Varas, Jesús Pernas", "institution_name": ["Universidad Carlos III de Madrid"], "commitment": "3 hours/week", "cover_url": "https://webview.edx.org/sites/default/files/course/image/promoted/mmcx-banner-378x225.jpg", "course_url": "https://www.edx.org/course/caer-o-no-caer-el-secreto-de-las-uc3mx-mmc-1x", "subject_name": ["Engineering"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-02-03T00:00:00-05:00"},
{"selfpaced": false, "description": "<p>El planeta se enfrenta al reto de alimentar a una población creciente en un escenario de limitación de recursos, mercados agroalimentarios imperfectos, crisis de alimentos, y población rural vulnerable. El curso invita a una reflexión sobre las alternativas de la agricultura y la alimentación, vistas como solución a los desafíos socio-económicos y ambientales, con énfasis en el papel de la agricultura familiar y en modos de producción sostenibles, en el marco de cadenas de valor más equilibradas.</p>\r\n\r\n<p>This course is taught in Spanish with English subtitles.</p>\r\n", "end_date": "2015-03-16T00:00:00-04:00", "title": "Retos de la Agricultura y la Alimentación en el Siglo XXI", "price": 0, "instructors": "Dr. José-María García-Alvarez-Coque, Dr. Victor Martinez Gómez, Dr. Olga Moreno Pérez, Dr. Raúl Compés López, Lorena Tudela Marco", "institution_name": ["Universitat Politècnica de Valencia "], "commitment": "3 horas/semana", "cover_url": "https://www.edx.org/sites/default/files/course/image/promoted/agricultura-y-la-alimentacion_378x225.jpg", "course_url": "https://www.edx.org/course/retos-de-la-agricultura-y-la-upvalenciax-ra201x", "subject_name": ["Food & Nutrition", "Social Sciences"], "duration": "8 weeks", "language_name": ["Others"], "provider_name": ["edx"], "start_date": "2015-01-20T00:00:00-05:00"}
]