[
{"description": "<h2 id=\"bienvenidos-al-curso-leer-a-macondo\">¡Bienvenidos al curso Leer a Macondo!</h2>\n\n<p>Gabriel García Márquez es un escritor colombiano que ganó el premio Nobel de Literatura en 1982 y ha sido reconocido como uno de los escritores más importantes del siglo XX. Sus obras han sido traducidas a más de 35 idiomas, han sido adaptadas para televisión y cine y han inspirado múltiples obras de arte.</p>\n\n<h2 id=\"explore-5-de-las-primeras-obras-del-autor-que-estn-relacionadas-con-macondo\">Explore 5 de las primeras obras del autor, que están relacionadas con Macondo.</h2>\n\n<p>El principal objetivo de este curso es explorar las contribuciones literarias de Gabriel García Márquez a la literatura universal a través de cinco de sus primeras obras, todas con una fuerte relación con Macondo, un pueblo inspirado en Aracataca, el lugar de nacimiento del autor en Colombia. Ante todo, usted tendrá la oportunidad de gozar de la lectura y el análisis de las siguientes obras:</p>\n\n<ul>\n  <li>La hojarasca (1955),</li>\n  <li>El coronel no tiene quien le escriba (1961),</li>\n  <li>La mala hora (1962),</li>\n  <li>Los funerales de la Mamá Grande (1962) y</li>\n  <li>Cien años de soledad (1967).</li>\n</ul>\n\n<p>Al entrar en el universo narrativo de García Márquez, usted se dejará seducir por la riqueza de su lenguaje y logrará identificar las obsesiones del autor. A través del estudio de estas obras usted:</p>\n\n<ul>\n  <li>Valorará la obra de Gabriel García Márquez</li>\n  <li>Apreciará la forma en que evoluciona</li>\n  <li>Desarrollará la capacidad de relacionar sus diferentes obras</li>\n  <li>Identificará algunos de los elementos centrales de su obra</li>\n</ul>\n\n<p>Este curso está dirigido a personas que disfrutan de la literatura y no requiere ningún tipo de conocimiento previo.</p>\n\n<h2 id=\"aprenda-acerca-de-gabriel-garca-mrquez-acompaado-de-profesores-experto-de-bogot-colombia\">Aprenda acerca de Gabriel García Márquez acompañado de profesores experto de Bogotá, Colombia</h2>\n\n<p>Sus guías para este curso son profesores de literatura de la Facultad de Artes y Humanidades de la Universidad de los Andes, Colombia, expertos en el análisis de la obra de Gabriel García Márquez, quienes le brindarán una perspectiva única acerca de la narrativa de este autor.</p>\n\n<p>¡Esperamos que sea una experiencia enriquecedora y que disfrutemos juntos de las obras de Gabriel García Márquez!.</p>\n", "end_date": "2016-10-10T00:00:00Z", "title": "Leer a Macondo: La obra de Gabriel García Márquez", "instructors": "Hugo Ramirez", "institution_name": ["University of Los Andes"], "commitment": "6 hours/week", "cover_url": "https://ugc.futurelearn.com/uploads/images/e9/99/regular_e999c3c4-5a72-4d0d-8733-4dbf181306f8.jpg", "course_url": "http://www.futurelearn.com/courses/macondo-es-gabriel-garcia-marquez?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["futurelearn"], "start_date": "2016-08-29T00:00:00Z"},
{"description": "<h2 id=\"identificar-los-aportes-claves-de-la-obra-de-gabriel-garca-mrquez\">Identificar los aportes claves de la obra de Gabriel García Márquez</h2>\n\n<p>En este curso usted podrá identificar los aportes narrativos del escritor colombiano Gabriel García Márquez a la literatura universal a través del estudio de tres de las grandes obsesiones del autor: el poder, la historia y el amor.</p>\n\n<p>Usted tendrá la oportunidad de gozar de la lectura de las siguientes obras: La increíble y triste historia de la cándida Eréndira y su abuela deslamada (1972), El Otoño del patriarca (1975), Crónica de una muerte anunciada (1981), El amor en los tiempos del cólera (1985), El general en su laberinto (1989) y Del amor y otros demonios (1994).</p>\n\n<h2 id=\"al-estudiar-de-forma-cronolgica-estas-obras-publicadas-despus-de-cien-aos-de-soledad-1963-usted-reconocer-la-evolucin-narrativa-de-garca-mrquez\">Al estudiar de forma cronológica estas obras publicadas después de Cien años de soledad (1963), usted reconocerá la evolución narrativa de García Márquez.</h2>\n<p>Adicionalmente, usted tendrá la oportunidad de profundizar en diferentes temas como: la novela del dictador, las particularidades de la nueva novela histórica, las influencias literarias del autor, el tema de la vejez, entre otras.</p>\n\n<h2 id=\"profundizar-en-el-universo-de-gabriel-garca-mrquez\">Profundizar en el universo de Gabriel García Márquez</h2>\n\n<p>Finalmente, al profundizar en el universo narrativo de García Márquez después de Macondo, usted se dejará seducir por la riqueza de su lenguaje y entenderá por qué este escritor es considerado uno de los grandes genios literarios de todos los tiempos.</p>\n\n<p>A través del estudio de estas obras usted:</p>\n<ol>\n<li>Valorará la obra de Gabriel García Márquez </li>\n<li>Apreciará la forma en que evoluciona </li>\n<li>Desarrollará la capacidad de relacionar sus diferentes obras </li>\n<li>Identificará algunos de los elementos centrales de su obra</li>\n</ol>\n\n<p>Este curso también estará disponible en Inglés a partir del 30 de Mayo del 2016. Para mayor información y para inscribirte por favor <a href=\"https://www.futurelearn.com/courses/gabriel-garcia-marquez-english/1\">visita la página del curso</a>.</p>\n\n<p>This course is also running in English, starting 30 May 2016. To find out more and enrol, <a href=\"https://www.futurelearn.com/courses/gabriel-garcia-marquez-english/1\">visit the course page</a>.</p>\n", "end_date": "2016-07-25T00:00:00Z", "title": "Gabriel García Márquez: entre el poder, la historia y el amor", "instructors": "Hugo Ramirez", "institution_name": ["University of Los Andes"], "commitment": "4 hours/week", "cover_url": "https://ugc.futurelearn.com/uploads/images/f5/14/regular_f51427c0-2621-449f-8b9b-ec830e44743e.jpg", "course_url": "http://www.futurelearn.com/courses/gabriel-garcia-marquez?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["futurelearn"], "start_date": "2016-05-30T00:00:00Z"},
{"description": "<p>Ce Mooc  vous permettra de mieux comprendre le fonctionnement du système financier afin, en tant que citoyen, de pouvoir le questionner et en tant qu’épargnant de pouvoir l’utiliser en confiance en ayant acquis compétence et indépendance. <br></p>\n\n<h2 id=\"lobjectif-de-ce-mooc-est-br\">L’objectif de ce mooc est :<br></h2>\n<ul>\n  <li>vous familiariser avec des notions qui vous permettront de mieux dialoguer avec les intermédiaires financiers comme les banques.</li>\n  <li>avoir une meilleure compréhension des circuits qui permettent de mettre en relation l’épargnant et les entreprises qui ont besoin de notre capital pour investir.</li>\n  <li>devenir familier du fonctionnement réel, au quotidien, des marchés<br></li>\n  <li>connaître plus précisément le cadre de commercialisation des produits financiers, vos droits et les recours possibles.<br></li>\n</ul>\n\n<p>Nous nous attarderons également sur les réflexes à adopter afin de prendre une décision d’investissement éclairée puis de suivre les performances de celle-ci. <br>\nPlus généralement, ce Mooc vous permettra de pénétrer l’organisation et le fonctionnement des marchés financiers au travers desquels circule votre épargne. Ceci afin de vous permettre de mieux comprendre pour mieux décider. <br></p>\n\n<h2 id=\"a-lissue-de-ce-mooc-br\">A l’issue de ce Mooc :<br></h2>\n<ul>\n  <li>vous serez en mesure d’analyser et de mieux comprendre les offres des intermédiaires financiers comme les banques.</li>\n  <li>vous aurez acquis des compétences pour suivre vos placements en termes de rendement et de risque.</li>\n  <li>vous aurez une meilleure connaissance de l’arsenal juridique qui vous protège.</li>\n  <li>vous aurez une vision d’ensemble des marchés financiers, leur place, leur rôle dans l’économie sera bien plus clair à vos yeux.</li>\n</ul>\n\n", "end_date": "2016-06-27T00:00:00Z", "title": "Epargner et Investir", "instructors": "Philippe  Dupuy ", "institution_name": ["Grenoble Ecole de Management"], "commitment": "3 hours/week", "cover_url": "https://ugc.futurelearn.com/uploads/images/51/9a/regular_519a07af-6a63-4613-8d99-e00d2c5221b6.jpg", "course_url": "http://www.futurelearn.com/courses/epargner-et-investir?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["futurelearn"], "start_date": "2016-05-23T00:00:00Z"}
]