{
    "selfpaced": true, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    There is no higher form of user validation than having customers support your product with their wallets. However, the path to a profitable business is not necessarily an easy one. This course blends instruction with real life examples to help you effectively develop, implement, and measure your monetization strategy, iterating on the model as appropriate.\n\nThis course is part of our Tech Entrepreneur Nanodegree Program, click [here to learn more](https://www.udacity.com/course/tech-entrepreneur-nanodegree--nd007).Why Take This Course?Google Developer Relations has worked with thousands of developers in hundreds of startups to help them build successful apps. Along the way, they’ve identified common themes that contribute to successful monetization strategies.\n\nThis course combines this expertise with insights from leading startups in multiple industries. From ecommerce to games, this course will guide you through the best practices and principles for monetizing your app. By the end of this course, you’ll be able to:\n\n- Choose &amp; implement a monetization strategy relevant to your product\n- Set performance metrics &amp; monitor the success of a strategy\n- Know when it might be time to change methods\n\n                                            Syllabus\n                        ###Lesson 1: Introducing Monetization \nDeveloping an appropriate monetization strategy is comparable to finding the product/market fit for a new idea. This lesson will get you started on the path to finding that strategy by helping you think about profitability from the very beginning. You will also learn about different monetization models, profit margins, KPIs, and customer acquisition and retention.   \n\n###Lesson 2: Monetization Strategies \nThey say nothing happens before you make your first dollar. This lesson takes a deep dive into monetization strategies for different platforms, covering freemium, subscription, eCommerce, and Ads across web, games, and native apps. You’ll learn about the tools startups use to implement these strategies and design a plan to execute a model for your own product. \n\n###Lesson 3: Implement a Monetization Plan\nMonetization strategies change over time as the user base grows and the product evolves. In this lesson, you will choose and tailor a monetization strategy for your product and learn how to set up tracking to monitor its effectiveness. Using Google Analytics and other tracking tools, you will begin closely following and iterating based on behavior reports, crashes, exceptions, and app speed. \n\n###Lesson 4: Optimize Your Model\nIn the final lesson, you will learn how to react and re-engage users if your monetization strategies don’t originally work. Through a case study with Nir Eyal, you will see how product and monetization are closely tied and how the Hooked Model can be used to optimize your strategy. \n\n###Case Study: Wufoo\nLearn how Kevin Hale got started with Wufoo (sold to SurveyMonkey).\n                                    ", 
    "end_date": "2015-08-28T00:00:00Z", 
    "title": "App Monetization", 
    "price": 0, 
    "instructors": "Jessica Uelmen and Ido Green", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.udacity.com/course/app-monetization--ud518?utm_medium=referral&utm_campaign=api", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-07-31T00:00:00Z"
}