{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    This course is for social enterprises or non-profits that are just starting out and are in the early-stages of forming a board for their companies.\r\nA functioning board early on can be a key driver for an enterprise’s success over the long term.  As investors, both Acumen and our course partner, Accion Venture Labs, often sit on the boards of such companies. But more importantly, we support our entrepreneurs through the process of creating the “right” board.\r\nWe believe this course will be especially useful for social entrepreneurs of all shapes and sizes – both for-profit and non-profit – at all stages, but by no means limited to that audience. Whether you are an employee of a social enterprise, an impact investor or if you just want to understand a social enterprise’s board strategy, this course is for you.\r\nSo please join us, learn best practices, pick up expert tips and think about how to apply these to your own journey!\r\nBy the end of this five-module course, you will:\r\n\r\nUnderstand best practices in creating and leveraging the board of a social enterprise and how that is applicable to diverse situations and organizations\r\nUnderstand what board meeting materials look like, what to include in them and the processes necessary to ensure that the health of your board is maintained\r\nBe able to walk away with a board development timeline for your social enterprise\r\n\n\n                                            Syllabus\n                        \r\nModule 1: What is a board strategy? Why is it important?\r\nModule 2: What does the board look like? Who should you bring in and why?\r\nModule 3: How to manage/leverage your board and maximize the benefit of the relationship\r\nModule 4: How to prepare for/run an effective board meeting\r\nModule 5: How to adapt your board strategy to your organization’s growth\r\n\n                                    ", 
    "end_date": "2015-11-16T00:00:00Z", 
    "title": "Board strategy for Social Enterprise: Best practices to maximize your Impact", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Accion Venture Lab", 
        "+Acumen"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://plusacumen.org/courses/board-strategy/", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2015-10-12T00:00:00Z"
}