{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    As well as a form of art and entertainment, games are about business. Whether you want to work at a game studio, start your own business or make games as a hobby, recognizing the dynamic landscape of the videogame industry is critical to finding your place. This course will introduce you to game production, project management, teamwork skills, and how to position your game ideas and yourself in the broader marketplace. By the end of the course, you will be able to develop an impactful portfolio of game work to get noticed and/or develop an effective business plan to bring your game to market.\n\n                                            Syllabus\n                        Show Me the Money!The reality is that making games isn't just about art and creativity, though sometimes some of us wish that were the case. All art has economic considerations. Creative people need food, shelter and safe creative spaces to work within. Thus, one way or another the question of the economics of games is going to prove important. So understanding the flow of money in the game industry, as well as how to protect your own ideas will prove paramount in being able to make the craft of making games an economically justifiable activity.Games are Made of PeopleI think one of the most important things to realize about the business of games is that games are made up of people. While I'm borrowing the line from \"Soylent Green\" to be a bit funny, the reality is that creative people really do live and breath the games that they make and a game can't exist without a good team behind it. In this module, you will explore the fundamentals of game production and teamwork. You will get a foundation in some of the project management tools and techniques that while you may not use them on this project will help you be a better game developer in the long run.Pitching Your Game and YourselfIt may seem a bit cliché, but the idea that perception is reality is perhaps doubly important in games. This doesn't mean that style rules over substance, but that they ultimately both have to exist. That can be a hard thing to hear, that how you present something (including yourself) is as important as what you are saying. This is why in this module we want you to think about presenting yourself or your game and how to best position it or you to get a job or interest people in your project. We're not asking you to write this time, so get ready to pitch!Entrepreneurship and Starting a CompanyStarting a company isn't for everyone. But it is also good to know what goes into starting a company even if you're not the one doing it. Often times, as an employee, it can feel pretty arbitrary why a company makes the decisions it does (and sometimes it is, but for the sake of argument, we'll assume that the person at the helm of the company isn't just making random decisions). But, often there is a logic there and understanding why a company does what it does is often rooted in the logics that we will be discussing here.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Business of Games and Entrepreneurship", 
    "price": 0, 
    "instructors": "Brian Winn, David Wheeler and Casey O'Donnell", 
    "institution_name": [
        "Michigan State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/gamedev-business", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}