{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours vous permettra d’identifier et d’évaluer des opportunités de création d’entreprises technologiques et d’en comprendre les principaux enjeux humains, techniques, commerciaux, environnementaux et financiers.\n\nVous aurez ainsi des bases solides pour créer votre entreprise high tech ou décider d'en rejoindre une.\n\nDécider de créer ou de rejoindre une entreprise technologique dans ses premières années est la promesse d’une aventure hors du commun mais ce n’est pas un acte anodin : il faut être capable d’accepter que toutes les « bonnes » idées ne conduiront pas au succès, que seule une minorité de projets débouchera sur un immense succès. Il faut aussi renverser votre rapport à l’échec, qui est une source d’expérience et doit être géré selon la logique de la « perte acceptable » : l’entrepreneur aime l’incertitude, pas le risque démesuré. La création d’entreprises technologiques vous offre une réelle occasion de contribuer à changer le monde mais nécessite que vous adoptiez un certain état d’esprit et que vous puissiez acquérir des savoirs, des savoir-faire et des savoir être, ainsi qu’une expérience la plus large possible.\n\nVous aurez l'occasion de côtoyer des personnes passionnantes et passionnées issues d'horizons très différents. A partir d’une vision et d’une technologie de pointe, ces femmes et ces hommes ont souvent bâti des entreprises d’envergure mondiale.\n\nLa trajectoire de développement d'une entreprise technologique est pleine d’imprévus qui vous demanderont à la fois de l’agilité et une préparation importante pour partir d’une idée forte, sélectionner votre marché, développer votre offre, réunir une équipe à la hauteur des enjeux et trouver des financements.\n\nCe cours se compose de sessions méthodologiques ainsi que de témoignages d'entrepreneurs et d’acteurs emblématiques de la création d'entreprises technologiques. Vous pourrez ainsi vous familiariser avec les dilemmes essentiels auxquels sont confrontés les créateurs d'une entreprise high tech, à commencer par la décision de créer sa propre structure, qui représente un véritable choix de vie. \n\nVous verrez également que la création d'une entreprise technologique est davantage une aventure collective qu’un parcours individuel.\n\n                                            Syllabus\n                        De l’innovation au marché : comment repérer des opportunités d’innovationAvant toute considération technique ou économique, la création d’une entreprise technologique est avant tout une aventure humaine qui nécessite, pour chaque associé, de s’interroger sur ses choix de vie. Au-delà de l’intuition initiale d’une nouvelle offre basée sur une technologie de pointe, nous souhaitons vous familiariser avec plusieurs pratiques et méthodes de conception. Nous verrons notamment que l’innovation n’est pas une trajectoire balistique mais plutôt un cheminement ni très linéaire et encore moins séquentiel. Un des principaux enjeux est d’accumuler des connaissances en effectuant de nombreux allers-retours entre conception innovante et application sur des marchés. Vous serez plus spécifiquement invités à explorer les usages auxquels votre offre pourra répondre et les différentes manières de vous distinguer des offres existantes. Maturation d’un projet d’innovation technologiqueCette séance vous familiarisera avec les étapes clés de la maturation d’un projet innovant. Nous vous présenterons les fondamentaux du management de projet et le processus d’acquisition de connaissances qui permet de prendre graduellement des décisions cruciales pour votre entreprise. Vous découvrirez les principaux piliers de votre projet stratégique et quelques principes de la stratégie d’entreprise. Vous serez invités à comprendre la dynamique du marché que vous visez et à identifier les moyens d’être leader sur votre segment. Vos marges de manœuvre ne seront pas les mêmes si votre innovation crée un nouveau marché ou si elle se substitue à une offre existante. Nous vous inviterons également à analyser la valeur d’utilité perçue par vos clients, tant sur le plan des bénéfices que des sacrifices perçus. Enfin, vous pourrez vous familiariser avec un aspect essentiel en matière de valorisation d’une technologie et de développement d’une entreprise : la propriété intellectuelle, dont nous vous donnerons quelques clés pour l’utiliser à bon escient.Un aperçu de l’écosystème d’innovationLes jeunes entreprises technologiques sont souvent issues de travaux de recherche réalisés dans des laboratoires publics ou privés. La valorisation de ces travaux peut directement passer par des accords de licence mais, dans certains cas, la création d’une entreprise ex-nihilo est l’option retenue pour transformer des travaux académiques en un produit ou un service innovant. Cette séance vous permettra de vous familiariser avec la logique du service de valorisation d’une université de premier rang en matière de production scientifique. Vous bénéficierez du témoignage d’un jeune chercheur ayant décidé de créer son entreprise pour valoriser ses travaux de recherches, directement après sa thèse.Nous reviendrons une fois de plus sur l’importance de l’équipe et la manière dont se structurent les jeunes entreprises innovantes. Nous examinerons notamment le rôle du leader et la gestion des conflits, qui sont monnaie courante dans les startups. Vous bénéficierez enfin du témoignage de deux chercheurs en sciences de gestion qui ont étudié l’émergence de plusieurs dizaines de projets scientifiques collectifs au sein de l’Ecole polytechnique.Calculez vos besoins de financement et trouvez des partenaires financiersLe développement d’une innovation technologique est une aventure passionnante qui s’apparente souvent à une course d’obstacles lorsqu’il s’agit de trouver les premiers financements. Les nouvelles technologies fascinent mais beaucoup d’investisseurs sont frileux lorsqu’il s’agit de les financer car les risques techniques, commerciaux et humains sont réels. Pour autant, il existe de nombreuses sources de financement et les créateurs d’entreprises innovantes déploient des trésors de créativité pour franchir avec succès les étapes qui vont du développement d’une technologie de pointe à la commercialisation d’une offre innovante et rentable.Cette séance relative au financement de l’innovation vous permettra de voir comment déterminer vos besoins de financement et comment trouver les ressources correspondantes. Vous pourrez également avoir un aperçu de la logique des investisseurs, qui financent parfois des entreprises à un stade très précoce.Modèle économique, plan de développement et exemples de modalités de valorisationLe développement d’une technologie, la constitution d’une équipe et le financement du démarrage ne sont pas les seuls défis auxquels vous et vos collègues seront confrontés. L’élaboration d’une proposition de valeur crédible et d’un business model scalable et rentable nécessitent de nombreux allers-retours avec le terrain car les clients et les modalités de commercialisation de votre offre seront souvent très différents de ce qui était initialement envisagé.Pour convaincre des partenaires financiers, vous serez amenés à présenter l’essentiel de votre projet d’entreprise au sein d’un business plan dont nous vous présenterons les principales composantes. Enfin, vous bénéficierez à nouveau du témoignage d’entrepreneurs ayant créé leur entreprise sur la base de leurs travaux de recherche. L’un d’entre eux a cédé son entreprise et l’autre a réalisé plusieurs augmentations de capital avant d’introduire sa société en bourse pour accélérer son développement.Examen finalThe description goes here\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Créer et développer une startup technologique", 
    "price": 0, 
    "instructors": "Etienne Krieger", 
    "institution_name": [
        "École Polytechnique", 
        "HEC Paris"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/startup-technologique", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}