{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Ce MOOC est dédié à la création d’entreprises innovantes. Tous les types d’innovation sont intégrés, pas seulement l’innovation technologique mais aussi l’innovation en marketing, dans la relation client, dans le business model ou encore dans sa dimension sociale. Le MOOC concerne les innovations de produits mais aussi de services.\r\nLa création peut se représenter comme un parcours composé d’étapes clés : de l’idée au projet, du projet à sa réalisation. Ce MOOC se propose de décrire en 6 semaines chacune de ces phases essentielles à la réussite du projet entrepreneurial.\r\nEn suivant ce cours, les apprenants auront donc un aperçu global de la création d’entreprise et seront capables d’en comprendre les différents aspects. Des éléments de réponses aux questions indispensables de la création d’entreprise seront abordés :\r\nComment évaluer la validité, la faisabilité d’une idée innovante ? Comment passer de l’idée au projet grâce à un Business Model adapté ? Comment monter un Business Plan financier ? Comment financer l’entreprise innovante et quels sont les critères des investisseurs ? Quels aides et conseils sont à la disposition des porteurs de projet ?\r\nA l’issue de ce MOOC, les participants ayant un projet de création auront les outils pour le concrétiser. Les apprenants qui n’ont pas de projet, auront un aperçu clair du processus qu’est la création d’entreprise et l’avis de plusieurs experts du domaine.\n\n                                            Syllabus\n                        INTRODUCTION : Découverte de la plateforme FUN, de l'organisation et du déroulement du cours, des objectifs pédagogiques, intégrer la communauté du MOOC.SEMAINE 1 : Introduction à la création d’entrepriseSEMAINE 2 : Le Business ModelSEMAINE 3 : Les points clés du Business ModelSEMAINE 4 : Le Business PlanSEMAINE 5 : Financer l’entreprise innovanteSEMAINE 6 : Les aides et conseils\n                                    ", 
    "end_date": "2015-12-17T00:00:00Z", 
    "title": "Création d'entreprises innovantes : de l'idée à la start-up", 
    "price": 0, 
    "instructors": "Véronique Bessière", 
    "institution_name": [
        "Université Montpellier 2"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/umontpellier/08003/session01/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-11-05T00:00:00Z"
}