{
    "selfpaced": true, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Ce cours est conçu pour accompagner toutes les personnes qui veulent avoir un impact positif dans la société, mais qui ne savent pas comment agir. Quel que soit votre âge ou votre formation académique, ce cours vous aidera à trouver la voie qui vous correspond pour faire bouger les lignes ! Vous apprendrez comment passer de l’envie à l’idée, et de l’idée à l’action.\n\n                                            Syllabus\n                        IntroductionBienvenue ! Retrouvez dans ce chapitre d'introduction toutes les informations sur le fonctionnement du MOOCS’inspirer : comment chacun peut devenir entrepreneur du changementL’objectif de ce chapitre sera de vous montrer que changer le monde, c’est possible ! Si, si, c’est vraiment possible. Et surtout, on essaiera de vous montrer, qu’en plus, c’est possible de pleins de manières différentes. \nVous allez voir !Comprendre les grands enjeux : comment identifier des opportunités dans les problèmes du mondeCe chapitre va vous permettre d’aborder, sous un autre angle, un sujet qui n’est pas toujours évident. En effet, nous allons parler des grands enjeux actuels, non pas dans le but de vous accabler mais afin de vous donner envie d’agir à votre échelle ! Vous vous rendrez compte que tous les défis majeurs auxquels nous faisons face peuvent être vus comme des opportunités formidables d’agir comme entrepreneur du changement, chacun à son échelle.Découvrir son potentiel : comment trouver sa propre voie d'entrepreneur du changementNous sommes dans la partie centrale du processus en U : l’introspection. C’est un moment essentiel pour prendre du recul, trouver un moment pour soi, apprendre à mieux se connaître et identifier sa place dans le monde, ce qui permettra de mieux définir sa mission, avant de se replonger dans l’action.Générer des idées : comment construire son projet à partir de sa mission socialeLe but de cette semaine est de commencer à vous saisir de votre mission sociale, de la définir et de générer vos premières idées de projet. Pas d’inquiétude, on ne parle pas ici d’un “eurêka!”, mais de méthodes pour développer ou re-formuler vos premières idées.Agir dans la durée : comment développer un modèle économique ​pérenneVous apprendrez à connaître et apprivoiser le Social Business Model de votre projet. Vous serez guidé tout au long du chapitre pour poser les fondations de votre modèle économique et ainsi commencer à définir comment pérenniser votre projet social.Gagner en impact : comment s'outiller pour implémenter son projetA ce stade, vous avez commencé à définir votre projet, sa mission sociale, et son modèle économique. Dans ce chapitre, vous découvrirez des outils indispensables pour lancer votre projet et faire les premiers pas pour passer à l’ACTION.Se lancer !Nous sommes à la fin du processus en U et du passage à l’action. Depuis le lancement de ce MOOC nous avons été impressionnés par l'intensité avec laquelle vous avez tous travaillé ! Nous sommes fiers de voir que des projets ont pu éclore de ces 7 chapitres, ou que vous avez pu faire un sacré bout de chemin sur votre parcours d’entrepreneurs du changement ! Dans ce chapitre, nous allons vous donner les derniers éléments essentiels pour vous lancer et surtout vous booster avant la fin de ce MOOC avec de très très nombreux conseils précieux que l’ensemble des pionniers nous ont transmis pour vous !Bonus - Hangouts en direct de la session de février à avril 2015Cette section est optionnelle mais nous avons pensé que vous pouviez être intéressés de découvrir les réponses apportées aux étudiants de la session de 2015 par les experts et professeurs.\n                                    ", 
    "end_date": "2015-04-21T00:00:00Z", 
    "title": "Devenir entrepreneur du changement", 
    "price": 0, 
    "instructors": "Bénédicte Faivre-Tavignot, Frédéric Dalsace, Nathalie Lugagne, Florian Hoos, Aymeric Marmorat, Lise Penillard, Matthieu Dardaillon and Joséphine Bouchez", 
    "institution_name": [
        "HEC Paris"
    ], 
    "commitment": "2-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/course/entrepchangement", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-02-24T00:00:00Z"
}