{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Ce Mooc vous permettra de découvrir l’innovation par le Design Thinking dans le management de projet, ses concepts et sa démarche au travers d'un ensemble de mises en pratique et d'exemples.\n\n                                            Syllabus\n                        Semaine 1 : L'innovation, pourquoi et comment ?\r\nCette semaine est consacrée à la définition de l'innovation et aux approches classiques comme celles de Bill Buxton ou de Tim Brown. Nous étudierons pourquoi il est nécessaire de convoquer les industries créatives dans la démarche d'innovation et quelles sont les principales approches reconnues sur le plan international.\r\nÀ la fin de la semaine 1, les étudiants comprendront ce qu’est l’innovation et connaîtront les approches efficaces pour l’intégrer dans un projet.\r\nSemaine 2 : Savoir faire un état de l’art au-delà du benchmark\r\nLa deuxième semaine est consacrée à la description concrète de la démarche de projet de type Design Thinking. Nous étudierons la méthode d’organisation d’un travail de recherche préliminaire et nous nous intéresserons aux champs d’investigation à explorer.\r\nÀ la fin de la semaine 2, vous saurez faire une veille élargie alimentée par les états de l’art et les champs connexes de manière à réinterroger un brief de départ.\r\nSemaine 3 : Savoir poser des axes de développement ou hypothèses de travail\r\nCette semaine est consacrée à la question suivante : comment passer du travail de veille à la proposition d’hypothèses de travail ou de « concepts design » ? Nous appréhenderons par ailleurs la notion d’univers formels et de codification formelle.\r\nÀ la fin de la semaine 3, vous saurez agréger des données multiples de champs disciplinaires hétéroclites pour élaborer des hypothèses de travail et définir des axes de développement.\r\nSemaine 4 : À la recherche de solutions : expérimentations et solutions\r\nCette semaine vous permettra d'apprendre comment développer des hypothèses de travail par un travail sur les usages, les utilisateurs et le contexte économique et social de la proposition. Nous traiterons par ailleurs la notion de réseau d'acteurs.\r\nÀ la fin de la session 4, vous saurez poser les bases d’avant-projets alimentés par des enquêtes d’usages et la construction d’un réseau d’acteurs\r\nSemaine 5 : Intégration/Finalisation de la proposition\r\nCette semaine est consacrée à la question suivante : comment valider une proposition finale en intégrant les notions de viabilité technique, de faisabilité économique, de désirabilité et de matérialisation de la proposition ?\r\nÀ la fin de la session 5, vous saurez synthétiser une proposition finale.\r\nSemaine 6 : Valorisation du projet sur les plans entrepreneuriat et médiation\r\nCette dernière session vous permettra d'apprendre à établir la médiation du projet, d'identifier les éléments essentiels à communiquer et d'entreprendre la valorisation économique du projet par une démarche entrepreneuriale appuyée sur un réseau d’acteurs.\r\nÀ la fin de la session 6, vous saurez valoriser le projet par sa communication et la construction d’un projet entrepreneurial.\n                                    ", 
    "end_date": "2014-07-07T00:00:00Z", 
    "title": "Devenir Entrepreneur De L’innovation Par Le Design Thinking", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "http://www.unow.fr/index.php/mooc-idea", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2014-05-26T00:00:00Z"
}