{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    L’objectif du cours est de faire découvrir l’effectuation, qui est la logique d’action utilisée par les entrepreneurs experts, révélée par les travaux pionniers de la chercheuse américano-indienne Saras Sarasvathy. Le cours vous montrera que l’entrepreneuriat n’est pas réservé à des super-héros, mais au contraire accessible à tous. Il vous présentera les cinq principes d’action utilisés par les entrepreneurs experts vous permettant, vous aussi, de vous lancer.\n\n                                            Syllabus\n                        Présentation du cours &amp; Semaine 1 : Les Mythes de l'entrepreneuriatLa première semaine est consacrée à évoquer quelques mythes tenaces sur l’entrepreneuriat que l’effectuation remet en question. On pense souvent qu’il faut être visionnaire pour être entrepreneur, que les entrepreneurs aiment le risque, sont capables de prédire l’avenir, et réussissent seuls. À la fin de la semaine 1, vous aurez développé une vision réaliste de ce qu’est l’entrepreneuriat tel qu’il se fait vraiment, loin des mythes qui le caractérisent souvent.Semaine 2 : Les principes de l'effectuation La deuxième semaine est consacrée à la présentation des quatre grands principes de l’effectuation : un tiens vaut mieux que deux tu l’auras, le raisonnement en pertes acceptables, le patchwork fou ainsi que le principe de la limonade. Derrière ces noms un peu étranges se cachent des principes aux implications très pratiques qui permettent aux entrepreneurs de développer leur entreprise.\n\nÀ la fin de la semaine 2, vous serez capable d’expliquer ce qu’est l’effectuation et de détailler ses quatre grands principes. Semaine 3 - Le processus entrepreneurialEn troisième semaine, nous étudierons le processus entrepreneurial, c’est à dire comment les principes de l’effectuation s’agencent dans l’action de l’entrepreneur au cours du temps pour développer son projet. Nous étudierons ce processus au travers d’un exemple réel. Cela nous permettra de définir ensuite quelques concepts fondamentaux de l’entrepreneuriat comme l’idée initiale, l’opportunité, la viabilité d’un projet, etc…\n\nÀ la fin de la semaine 3, vous serez capable d’expliquer le processus entrepreneurial.Semaine 4 - La notion d'incertitudeCette semaine sera consacrée à la notion d’incertitude, omniprésente dans un contexte entrepreneurial et pourtant généralement mal comprise et confondue avec le risque. Une fois le concept clarifié, nous étudierons comment les entrepreneurs prennent leurs décisions en situation d’incertitude. Nous verrons notamment l’importance du rôle que jouent les parties prenantes au projet entrepreneurial : partenaires, fournisseurs et bien sûr premiers clients. Nous évoquerons à propos de ces derniers l’approche dite par “co-création” et montrerons pourquoi elle est essentielle à la réussite de l’entrepreneur face à l’incertitude.\n\nÀ la fin de la semaine 4, vous serez capable d’expliquer ce qu’est l’incertitude, en quoi elle diffère du risque, et pourquoi elle est importante dans l’entrepreneuriat. Semaine 5 - Le 5ème principeCette semaine conclut le cours en revenant sur les concepts les plus importants. Nous montrerons d’abord comment l’effectuation remet en question les mythes de l’entrepreneuriat que nous aurons évoqués dans la première semaine. Ensuite, nous indiquerons le contexte dans lequel l’effectuation est pertinente et ceux dans lesquels il vaut mieux utiliser une approche plus classique. Nous présenterons ensuite le 5e principe que nous aurons gardé pour la fin tant il exprime la philosophie qui sous-tend l’effectuation, c’est à dire que le monde est le résultat de notre action, et que sa transformation est possible par tous.\n\nÀ la fin de la semaine 5, vous serez capable de déterminer dans quel contexte l’effectuation est pertinente et d’expliquer le 5ème principe de l’effectuation.Semaine 6 - Examen final et conclusion du MOOCBienvenue dans cette dernière ligne droite du MOOC, consacrée à l'examen final du MOOC. Pour clôre ce MOOC, un petit souvenir vous est proposé sous la forme d'une \"map\" (carte) récapitulative du MOOC dans son ensemble.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Effectuation : l'entrepreneuriat pour tous", 
    "price": 0, 
    "instructors": "Philippe Silberzhan", 
    "institution_name": [
        "EMLYON Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/effectuation", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}