{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    abcemprendimiento-001\n                                                                    abcemprendimiento-002\n                                                                    abcemprendimiento-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    A pesar de que una gran parte de la literatura sobre emprendimiento prepara\n    al “candidato emprendedor” a cómo hacer planes de negocio para conseguir\n    financiamiento proveniente de supuestos inversionistas, tal y como lo hace\n    la tradición norteamericana de enseñanza del emprendimiento, la realidad\n    de negocios nos dice que inclusive en los países desarrollados los proyectos\n    emprendedores inician con sus recursos financieros propios y normalmente\n    muy escasos.La principal herramienta para estos emprendimientos no\nes el plan de negocios ni el financiamiento, sino la creatividad empresarial. \nPor lo que, para una enseñanza efectiva del proceso emprendedor, hay que\npartir de esta realidad y no solo imitar lo que sucede en universidades,\nprincipalmente norteamericanas, con un contexto muy diferente al resto\ndel mundo. Por otro lado, pareciera un misterio el por qué solo muy pocos\nproyectos de empresa o de negocio tienen éxito, pareciera una combinación\nentre el “culto” a la personalidad del emprendedor y suerte; sin embargo\nla realidad nos demuestra que los proceso emprendedores que tienen éxito,\nsi bien tiene una influencia la importante motivación y la persona, siguen\nun proceso con etapas específicas, un patrón de acciones muy similar, aunque\nlos emprendedores no se hayan dado cuenta de este proceso.\n\n\nEste curso invita al participante a tener la persistencia para seguir\n    este proceso emprendedor basado en la experimentación.\n\n                                            Syllabus\n                        \n\n    Los mitos del emprendedor. (2 h)\n    Emprendiendo por necesidad y emprendiendo por oportunidad. (2 h)\n    La observación del mercado, en busca de oportunidades, descubriendo el\n        \"dolor de mercado\". (6 h)\n    ¿Qué es lo que los clientes valoran? (4 h)\n    La creatividad, innovación empresarial y la primera aproximación de concepto\n        de negocio. (4 h)\n    Aprendiendo a escuchar el mercado. (2 h)\n    La experimentación y la observación de mercado como parte fundamental\n        del proceso emprendedor. (4 h)\n    La flexibilidad y el fracaso como herramientas fundamentales en el aprendizaje\n        emprendedor. (2 h)\n    El ajuste de la propuesta de negocios o  propuesta de valor. (2 h)\n    El modelo de operación como parte esencial de la propuesta de valor. (8\n        h)\n\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "El ABC del emprendimiento esbelto ", 
    "price": 0, 
    "instructors": "Sergio  Ortiz Valdés", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/course/abcemprendimiento", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-01-26T00:00:00Z"
}