{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    El curso Emprender la emprendeduría tiene por objetivo promover las competencias emprendedoras en aquellas personas que están pensando en orientar su vida profesional hacia la creación de su propia empresa en el sector audiovisual. \nEl curso ha sido desarrollado por un conjunto de profesores de la Universidad de Barcelona, expertos en diferentes áreas de conocimientos como la psicología, la educación, la filología, el derecho, pero con el común denominador de una dilatada experiencia en el sector audiovisual.\n\nEl curso se estructura en 4 módulos, en los que aprenderás cómo analizar la viabilidad económica de tu proyecto audiovisual, qué aspectos jurídicos debes tener en cuenta y qué procedimientos administrativos debes seguir.\nEl curso finaliza con las recomendaciones de algunos de los profesionales más importantes del sector, sobre los aspectos que ellos consideran clave a la hora de emprender un proyecto audiovisual.\n\n                                            Syllabus\n                        Valorar la viabilidadEn este módulo se trasmitirán conocimientos sencillos y prácticos para poder valorar la viabilidad de un proyecto o empresa audiovisual. Para ello, pondremos a disposición del alumno una serie de lecturas y unas infografías que servirán para afianzar y sintetizar conceptos estudiados en el bloque. Para finalizar, se propone un ejercicio de autoevaluación para comprobar la adquisición de los conocimientos transmitidos.Formas jurídicas para emprenderEn este módulo conocerás los tipos de empresa que puedes crear si quieres trabajar por cuenta propia. También aprenderás qué trámites exige cada modelo de empresa. Concretamente, verás que son dos los modelos de empresa que se proponen: trabajar como autónomo o constituir una sociedad. Pero hay también distintos tipos de sociedades. Las dos formas, autónomo y sociedad, implican obligaciones y responsabilidades. Trámites necesariosEn este módulo recibirás indicaciones sobre qué tipo de empresa es más idóneo en cada grado de desarrollo de una actividad empresarial. Verás, además, que en ocasiones es mejor recurrir a un asesoramiento experto para iniciar los trámites de constitución de una empresa, llevar la contabilidad y tener al día las obligaciones fiscales. Eso sí, sobre todo, si tu empresa tiene una actividad que sobrepasa las fronteras de tu comunidad autónoma.Identificación de oportunidadesA través de este bloque, nos acercaremos al estado actual de la relación creador-espectador y presentaremos posibles vías para lograr este encuentro. Pondremos las bases para reconocer dónde puede haber una oportunidad y dónde no. Para alcanzar este objectivo, partiremos de una serie de vídeos en el que diferentes emprendedores del sector nos explican sus experiencias y nos hablan sobre cómo decidieron optar por nuevas vías en las que vieron una oportunidad.\n\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Emprender la emprendeduría", 
    "price": 0, 
    "instructors": "Marina Romeo and Montserrat Yepes", 
    "institution_name": [
        "University of Barcelona"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/emprender", 
    "duration": "3 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}