{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Start-ups can benefit from a wide variety of financing options on the path to profitability, but how do you know which one to choose? This course explores different financing models, including bootstrapping, organic growth, debt and risk capital, and also provides a clear overview of equity financing including the key types of investors: angels, venture capital, and crowdfunding. You’ll learn about terms, and term sheets, exit modes and what exit strategy might be best for you. By the end of this course, you’ll have an understanding of what success looks like and how it can be financed. You’ll also be ready for the capstone project, in which you will get feedback on your own pitch deck, and may even be selected to pitch to investors from venture capital firms.\n\n                                            Syllabus\n                        Business Models and Keeping CustomersThis module was designed to introduce you to some of the key activities you can do in order to reach and sustain profitability. You'll learn the most important rule of entrepreneurship, the different kinds of business models, how to determine who your best customers are and how to develop strategies to retain them. You'll also hear from a successful entrepreneur and venture capitalist from Greylock Partners, who will talk about what indicators of success his firms looks for when deciding where to invest. By the end of this module, you'll be able to use business models to create customers who will come back for more, and know what key attributes to emphasize if you want to attract investment from venture capital.Financing, Valuation, and TermsIn this module, you'll learn the five most common methods of financing, and explore the financing process in depth. You'll also learn strategies for valuing your own company, and how venture capital and angel investors use valuations in negotiating milestones, influence and control. You'll discover how term sheets work, and what the terms mean, and you'll also examine the other terms used when financing with angel investors, friends and family, loans, and crowdfunding.  By the end of this module, you'll be able to pick the financing pathway that's best for your enterprise, use common valuation strategies to set a reasonable price for your company, and negotiate favorable terms.Private and Public Financing, and Calculating BreakevenThis module was designed to give you a closer look at the advantages and disadvantages of both public and private financing, and to provide you with some simple but powerful tools for estimating how much capital you will need. You'll learn about the added benefits of working with venture capital firms, when and why to consider debt financing, and the latest trends in crowdfunding. You'll also learn to calculate how much money you are losing each month (the burn rate), and when you can expect to become self-sustaining (the breakeven point). By the end of this module, you'll be able to perform your own breakeven analysis so you can make a more informed choice about the best source of financing for you company.Elements of the Pitch and Exit StrategiesIn this module, you'll learn the three key elements of your pitch to funders, and the examine the most common methods of exiting the entrepreneurial phase. You'll learn the structure and best practices for an executive summary, your pitch deck, and your pro-forma financial statements, and discover why these are so important to potential investors. You'll also learn the key differences between taking your company public and having it acquired by another, larger firm, and explore which method is best for preserving innovation. By the end of this module, you'll be able to create an effective pitch, and begin developing an exit strategy for your company that's relevant, effective and profitable.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Entrepreneurship 4: Financing and Profitability", 
    "price": 0, 
    "instructors": "David Bell, Ethan Mollick, Laura Huang, David Hsu, Karl  T. Ulrich, Lori Rosenkopf and Kartik Hosanagar", 
    "institution_name": [
        "University of Pennsylvania", 
        "Wharton School of the University of Pennsylvania"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/wharton-entrepreneurship-financing-profitabilty", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}