{
    "selfpaced": true, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Entrepreneurship is the art of creating value through making the world a better place for both yourself and those who get in touch with your business activities. Taking this module, you will learn and practice the basics of entrepreneurship and most importantly, you will make money. As a matter of fact, making money is a requirement to successfully complete this module.\r\nIn this module you will learn about the following topics.\r\n1. Why Entrepreneurship? Entrepreneurship is the art of making the world a better place, through orchestrating various resources with the intention of creating value and enriching life. Entrepreneurship represents a set of skills that can be utilised by anyone to enhance the quality of life in both for-profit and non-for-profit contexts. In this module you will work on a real-life project, together with your on-campus and online colleagues with the intention of adding value. You will have the opportunity for your work to be assessed by successful Entrepreneurs and the learning will be fun.\r\n2. Create Value like an Entrepreneur Entrepreneurs create products and services that we need and desire to have. These products and services make life easier, safer and more enjoyable. They affect the way work, study and play. Entrepreneurs achieve this through creating a balance between what is technologically feasible, economically viable and humanly desirable. Through this balance, products such as iPhone are born.\r\n3. Think like an Entrepreneur Entrepreneurs are very optimistic people. They see opportunities where others see problems and obstacles and they keep a rather romantic view of the world, believing that they can make it a better place. In this lecture, you will learn language and thinking skills and techniques that will help you think like an Entrepreneur, identifying opportunities and taking appropriate actions to realise them.\r\n4. Build an Entrepreneur dream team An Entrepreneurs’ goal is not fix all their weaknesses, but rather to amplify their strengths and surround themselves with people who can complement them. Building a successful team is a highly important skill and in this tutorial you will have the opportunity to build your own team of both on-campus and online students to work with you throughout the semester on a project of your choice.\r\n5. Execute like an Entrepreneur This exercise will give you the opportunity to work with your team members on a short project. The project will need to be completed within 24 hours. This will give you the chance to assess the skill of you and your team members as well as learn from the experience of other teams.\r\n6. Focus like an Entrepreneur Being able to focus your energy and other resources on a particular project is important, especially as you start a new project. This lecture will outline the basic structure of a business plan that you could show to potential investors eventually.\r\n7. Communicate like an Entrepreneur Business is all about people. Whether your staff, customers, investors or the governmental officials, you will need to communicate, communicate and communicate. This lecture will provide you with a framework for an effective communication that can use not only in business context, but in your life at large.\r\n8. Sell like an Entrepreneur Understanding markets and marketing is an important skill for an Entrepreneur. This lecture will introduce you to the essentials of marketing.\r\n9. Inspire like an Entrepreneur Entrepreneurship is a journey that you will need to inspire people to join you on. In this lecture, you will learn the importance of well articulated Vision and Mission for a business as well as functions of management.\r\n10. Manageme Money like an Entrepreneur This lecture will expose you to the fundamental finance knowledge for your business.\r\n11.  Closure An epic activity as a finale for the course to reflect the learning that took place.\n\n                                    ", 
    "end_date": "2013-07-01T00:00:00Z", 
    "title": "Entrepreneurship", 
    "price": 0, 
    "instructors": "Mushtak Al-Atabi", 
    "institution_name": [
        "Taylor's University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.openlearning.com/courses/Entrepreneurship", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "OpenLearning"
    ], 
    "start_date": "2013-03-25T00:00:00Z"
}