{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso tiene como objetivo fortalecer las capacidades de gestión de pequeños y medianos empresarios, y personas interesadas en emprender. El Programa Pyme de la Pontificia Universidad Católica de Chile te invita a profundizar sobre lo que se requiere para ser un empresario exitoso y a aprender buenas prácticas en dirección de empresas que permitan crear valor al cliente, a través del marketing y herramientas comerciales.  Te ayudará también a comprender las principales decisiones financieras que enfrenta la empresa, la contabilidad y su utilidad para la gestión y control del negocio; asimismo, conocerás las claves para seleccionar y dirigir personas y equipos, procurando su mayor productividad y desarrollo humano integral.\n \nEl diseño de este curso está basado en la experiencia del Programa Pyme UC, que ayuda a empresarios a hacer más competitivas sus empresas, con Mentores ex alumnos con amplia experiencia en negocios y Cursos dictados por Profesores de la Escuela de Administración UC. Más información en www.pyme.uc.cl.\n\n                                            Syllabus\n                        IntroducciónSer Empresario y la Gestión de EmpresasEl módulo \"Ser Empresario y la Gestión de Empresas\", es expuesto por el profesor José Rivera. A través del material presentado, podrá conocer los aspectos esenciales de la gestión de empresa y los principales requisitos para formarse como buen empresario y emprendedor. Este módulo está compuesto por una serie de videos, además de material complementario el que estará disponible en formato de descargable, y que será de gran ayuda para diagnosticar la gestión al interior de su empresa. Para finalizar, deberás responder un cuestionario para evaluar tus aprendizajes de este módulo.  Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Marketing y Creación de ValorEste módulo llamado \"Marketing y Creación de valor\", es protagonizado por el profesor Andrés Ibáñez. A través de los contenidos expuestos, principalmente en videos, podrá aprender sobre las principales características del marketing, la relevancia de éste en su  empresa y cómo puede generar valor. También, conocerá como a través de la innovación es posible crear nuevos modelos de negocio. Además, encontrará una actividad de autoevaluación, que le permitirá diagnosticar algunos elementos del modelo de negocios que ha podido incorporar en su empresa. A modo de cierre de este módulo deberá responder un cuestionario el cual es requisito para la aprobación del curso. Tiene un porcentaje de evaluación de 60%.Una Mirada FinancieraEl módulo \"Una Mirada Financiera\" presentado por el profesor Julio Gálvez, tiene como principal objetivo conocer y medir, desde una mirada financiera, los objetivos y la gestión de la empresa. A través de los contenidos, podrás identificar conceptos como estado financiero y rentabilidad. Además, podrás responder las interrogantes ¿Cuándo hay creación de valor?,¿Cuándo la gestión de una empresa puede ser catalogada como eficiente? Para finalizar, deberás responder un cuestionario para evaluar tus aprendizajes de este módulo.  Este es un requisito para la aprobación del curso, obteniendo más de un 60%.Gestión de PersonasEste módulo llamado \"Gestión de Personas\", es protagonizado por el profesor Carlos Portales. Tiene como propósito principal generar un modelo integral de personas en la empresa, buscando productividad y un desarrollo global de las personas al interior de la organización. Además de los contenidos, presentaremos algunas herramientas que serán de gran ayuda para enfrentar de mejor forma del proceso de reclutamiento de personal. Para finalizar, deberás responder un cuestionario para evaluar tus aprendizajes de este módulo.  Este es un requisito para la aprobación del curso, obteniendo más de un 60%.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Gestión Empresarial Exitosa para Pymes", 
    "price": 0, 
    "instructors": "José Rivera Izam, Andrés Ibáñez Tardel, Julio Gálvez Boizard  and Carlos Portales Echeverría ", 
    "institution_name": [
        "Pontificia Universidad Católica de Chile"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/gestionempresarialpyme", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}