{
    "selfpaced": true, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    This course focuses on the common human resource (\"people\") challenges faced by existing private businesses when they attempt to grow substantially. PART 1 OF THE GROW TO GREATNESS COURSE IS NOT A PREREQUISITE FOR TAKING THIS COURSE.\n\n                                            Syllabus\n                        Course OverviewStart here! The Entrepreneur Must Grow Too!This week will look at the role of the entrepreneur in growing a business. The required reading is Edward D. Hess, “Barbara Lynch Gruppo: An Entrepreneurial Journey,” Case Study. There are two optional readings “Global Medical Imaging, LLC” and “Growth is the Dynamic Confluence of Strategy” in this module also.The Secret of High Performance is High Employee EngagementThe required reading for this module is “Trilogy Health Services, LLC: Building a Great Service Company” by Gosia Glinkska and Edward D.  Hess. There is an optional reading also: “Leaders Bank: Creating A Great Place To Work” Case Study.Growth is Much More Than a Strategy—It Requires a SystemThe required reading is Edward D. Hess, “Room &amp; Board” Case Study.  The second required reading is “Growth Is Much More Than Just A Strategy: It’s A System.”Building a Senior Management TeamThe required reading is “SecureWorks.”Final ExamThis is the final exam. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Grow to Greatness: Smart Growth for Private Businesses, Part II", 
    "price": 0, 
    "instructors": "Edward D. Hess", 
    "institution_name": [
        "University of Virginia"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/smart-growth-strategy-2", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}