{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Who?\n\nIf you’re an entrepreneur at any stage of your journey, or even an aspiring one, and you need money to start or grow your business, this course is for you.\n\nWhat?\n\nThis course will introduce, and help you put to use in your startup, the five models through which your customers can – and will, if you ask them! – fund your business. These five time-tested models have been put to use by entrepreneurial superstars like Michael Dell, Bill Gates, Richard Branson and more. Sadly, though, the five models are rarely talked about and not widely understood. Until now!\n\nThe five models will be brought to life by the real-world stories of an inspiring collection of incredibly creative entrepreneurs from around the world – including successes and failures – through a series of captivating no-holds-barred interviews with founders and others, and investors, too.  \n\nWhy?\n\nMore than two generations ago, the venture capital community – VC’s, business angels, incubators, and others – convinced the entrepreneurial world that writing business plans and raising venture capital constituted the twin centerpieces of entrepreneurial endeavor. They did so for very good reasons: the sometimes astonishing returns they’ve delivered to their investors and the incredibly large and valuable companies their ecosystem has created. \n\nBut the vast majority of fast growing companies never take any angel or venture funding. Are they onto something that most of today’s entrepreneurial ecosystem has missed? Indeed, should a business angel or VC be seen as the first port of call for getting your nascent entrepreneurial venture off the ground or growing it faster? Perhaps not. \n\nHow?\n\nYou’ll be asked to do a series of exercises – out in the real world – to put your growing toolkit to use in your business or the one you hope to start. Hands-on, practical tools to help your business start and thrive – without venture capital. You’ll join our discussion board of fellow participants, if you like, and learn from others who are putting the tools to work, just as you are. And to suit today’s fast-paced lifestyles, we’ve broken what you’ll get – short lessons, interviews, thought-provoking questions, even some optional things to read – into bite-sized chunks, so you can log in and grab them whenever and wherever you are.\n\n                                            Syllabus\n                        Introduction: Why this course?A widely-held notion in entrepreneurial circles is that the way to start and grow a thriving business is to come up with a great “idea”, write a great business plan, raise capital from angels or VCs, flawlessly execute the plan, and (Voila!) get rich! But it hardly ever happens that way. In fact, the vast majority of fast-growing companies never raise any venture capital.  How do they do it, and how can you do it? This MOOC holds the answer. So let's get going! Module 1: Why taking venture capital is a bad ideaWelcome to Module 1! As you can see by the title of this first module, I hope to convince you in this chunk of the course that seeking (and taking) money from an angel or VC investor, at least early in the life of your venture, is an exceedingly bad idea. Here we go!Module 2: Matchmaker modelsWelcome to Module 2! In this module we're going to focus on matchmaker models (sometimes called marketplaces - eBay, Airbnb, and Uber and the like) and how you can put them to work in your business.  We'll see examples of both successes and failures and, as in Module 1, we'll get several perspectives other than mine, including that of a VC investor who knows this kind of business intimately. Ready? Let's go! Module 3: Pay-in-advance modelsWelcome to Module 3! In this module we'll see that taking a problem-solving perspective will be useful as we look at how to put pay-in-advance models to work in your business. You're also going to learn from another failure story, this one in India - from rags to riches and back to rags again - as well as travel to Latin America to get the lay of the land there. And you'll see that social entrepreneurs can use customer-funded models, too, even one tackling a problem as challenging as youth literacy! Here we go! Module 4: Subscription modelsWelcome to Module 4! In this module we'll dig into the economics of subscription models, while exploring the key building blocks that underlie many other kinds of e-commerce models, too.  Because subscription models have been, in my view, over-hyped, you're going to hear about a handful of failure stories in this module, along with the story of a fast-growing online wine business that's put a subscription model to work in a novel way. Are you ready for this one? Let's go! JohnModule 5: Scarcity modelsWelcome to Module 5! In this module, we're going to look at the most counter-intuitive of the five models: the scarcity model. You'll get the story of a fashion retailer that's making life difficult for others in its industry, you'll get an extensive advice-laden interview with an entrepreneur who used scarcity to his benefit, and we'll travel to India to explore today's funding environment there. Let's go!  Module 6: Service-to-product modelsWelcome to Module 6! In this module, we're going to hear from an entrepreneur who started with nothing in 2003 and sold his business less than 8 years later for nearly $100 million. We'll also hear from his partner, whose entry into the business midway into its journey raised its sights, and from a growth capital investor who backed the business in its later days without actually putting any capital into the business. Why? The customer-funded business didn't need their money! The three sides of a deal - a very special story that will surely inspire you. Here we go! Module 7: Putting a customer-funded model to work in your businessWelcome to Module 7!  In this final module we're going to draw the learning of this entire MOOC together and get started on implementing one or more of the five customer-funded models in your business. And you're going to hear an interview with someone who can get you up to speed in understanding customers well enough that you can get to what is called product-market fit - sooner instead of later! Even better, I'm going to tee up some final questions to get you started on what I hope will be a customer-funded journey that takes you wherever you'd like to go. I'm looking forward to wrapping things up and setting you off on your journey! \n                                    ", 
    "end_date": "2016-08-09T00:00:00Z", 
    "title": "How to Finance and Grow Your Startup – Without VC", 
    "price": 0, 
    "instructors": "John Mullins", 
    "institution_name": [
        "University of London International Programmes", 
        "London Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/startup-financing-without-vc", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-21T00:00:00Z"
}