{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    This course will explore the distinct mindset and essential knowledge base vital to the establishment and success of any music-related entrepreneurial endeavor. It will highlight the notion that, whether they know it or not, musicians are natural entrepreneurs!  \n\n   • Repurpose your skills as a musician to envision and develop a business.\n\n   • Leverage your fundamental “multipreneurial” nature as a musician.\n\n   • Create opportunities around your diverse musical skills.   \n\n   • Conceive, form, launch, market, and manage a music-related business.\n\nThis free course is composed of select modules from MMI 530 Entrepreneurship for Musicians, a popular course at the Frost School of Music also offered through Frost Online. It offers a unique opportunity to experience the convenience and rewards of online learning. \n\n\n                                            Syllabus\n                        Session 1: The Entrepreneurial Musician This session is all about the entrepreneurial mindset and how it relates to musicians. I'll also introduce you to a pair of tools that may help you clarify your goals and asses your risk tolerance.\r\nSession 2: Business Planning For Musicians In this session we'll focus on the planning stage of your business. I'll introduce you to the Business Model Canvas as well as the most commonly used business structures.\r\nSession 3: Finances And Musicians In this session we'll concentrate on managing your business finances. We'll explore the basics of accounting, taxes, and financial matters important to musicians.\r\nSession 4: Branding And Marketing This session will explore branding and marketing for musicians. We'll outline the marketing process and review the \"mix\" of a successful marketing program.\r\nSession 5: Wrap Up - How To Start What are your next steps? In this final session we'll discuss the importance of testing your business in the real world as soon as possible.\n                                    ", 
    "end_date": "2016-02-16T00:00:00Z", 
    "title": "Introducing Entrepreneurship for Musicians", 
    "price": 0, 
    "instructors": "Rey Sanchez", 
    "institution_name": [
        "University of Miami, Frost School of Music"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.kadenze.com/courses/introducing-entrepreneurship-for-musicians-iii/info", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-01-12T00:00:00Z"
}