{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    This is an action-oriented course to help develop your entrepreneurial leadership skills, whether or not you intend to start a new business, and will offer the elements needed to take initiative from any organizational position. It will help you reexamine your mindset about leadership -- constantly seeking opportunities, action to test possibilities, learning and new actions. You will develop your vision of what kind of leader you want to be, your ability to engage with colleagues to create a high performing team, and your skills at influencing the many people whose cooperation you need even though you can’t give them orders.\r\nThe course assumes that leadership is about more than being the one formally in charge, although it includes that, and requires enlisting the efforts of others to accomplish organizational goals. You will have a chance to formulate a vision of what kind of leader you want to be, work with a (virtual) team, practice giving and receiving feedback on team performance, and role play influencing someone you will actually need to influence to accomplish your goals.\r\nThis will be an interactive course, requiring not only individual learning but teamwork for completion. You will learn from short video lectures, online discussion of brief videos of people interacting at work, experiential exercises, use of personal examples, team discussion, feedback among team members on contributions to team discussions, and development of a personal leadership vision. You will interact with your team members and classmates from around the world.\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Lead Like an Entrepreneur", 
    "price": 0, 
    "instructors": "David Bradford and Allan Cohen", 
    "institution_name": [
        "Babson Global"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/entrepreneur", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-03-24T00:00:00Z"
}