{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Lean for Social Change draws on the latest thinking in Silicon Valley on how to build companies that maximize customer value while minimizing wasted effort and makes it relevant for social innovators. The lean approach relies on validated learning, experimentation, and iterative product releases to shorten product development cycles, measure progress, and gain valuable customer feedback. In an environment where the majority of startups fail, lean principles aim to give startups a better chance of success by helping entrepreneurs learn more quickly what works and discard what doesn’t.\r\nThese principles aren’t just for high tech startups but tools for life for any innovator, especially those determined to solve the world’s toughest social problems.\r\nWhat you’ll learn:\r\nBy the conclusion of this course you will:\r\n\r\nHave a framework for taking a social impact idea and assessing its potential for creating long-lasting impact and achieving financial sustainability\r\nUnderstand how to create and validate a business model intended to create social impact.\r\nDevelop a “lean mindset” for tackling problems of poverty that can be applied to other settings in the corporate, public, and NGO sectors\r\n\r\nYou’ll love this course if:\r\n\r\nYou’re an aspiring or very early stage social entrepreneur/founding team member that is building an impact enterprise to tackle a specific problem of poverty\r\nYou’re looking to learn the lean mindset to drive a social change initiative in a larger organization. (For example, you could be an employee within an established business, public sector organization or non-profit).\r\nYou just completed the Human-Centered Design for Social Innovation course and are ready to take your project to the next level.\r\n\r\nHow this course works:\r\nThis is a practical but intensive class where you will learn by doing. In this course you will:\r\n\r\nBe expected to come with an idea for a new model to solve a problem of poverty\r\nWork in teams learning how to take your idea and assess its potential for achieving long-lasting impact and financial sustainability\r\nLearn how to use a tool called The Business Model Canvas to brainstorm each part of a business, and Customer Development, a systematic approach that forces you to get out of the building to see whether anyone other than you would actually want to use your product/service.\r\n\r\nAlong the way you’ll have the opportunity to recruit a mentor from Acumen’s community to accompany you through the course, And at the end, the top-ranked teams will get a chance to pitch their ideas for feedback to a virtual panel of social impact investors.\r\nYou can take this course by yourself but it will be a lot of work. We highly recommend you form a team of 3-4 people, preferably located in the same place. You may enter the course with a team or find a team using the course platform once the course starts.\n\n                                    ", 
    "end_date": "2016-11-15T00:00:00Z", 
    "title": "Lean Startup Principles for Social Impact", 
    "price": 0, 
    "instructors": "Bob Dorf and Sasha Dichter", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "10 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/lean-principles-2016-2", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-09-20T00:00:00Z"
}