{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    This course is for aspiring or active entrepreneurs who wants to understand how to secure funding for their company. This course will demystify key financing concepts to give entrepreneurs and aspiring entrepreneurs a guide to secure funding. \n\nExamine the many financing options available to get your new venture funded. Learn the basics of finance, valuations, dilution and non-dilutive funding sources. Understand capital structure for new ventures, term sheets and how to negotiate them, and the differences between early-stage versus later-stage financing. Develop an understanding of how to develop winning investor pitches, who and when to pitch, how to avoid common mistakes that limit the effectiveness of the pitch, and how to ‘get to the close’. Key questions answered within the course include:\n\n* When to raise outside capital?\n* What kind of investors invest by stage and where to find them?\n* What are your fundraising options?\n* What are the key components of the term sheet?\n* How to perform company valuations?\n* How to pitch to investors?\n* What techniques help the entrepreneur ‘get to the close’?\n\nWith this course, students experience a sampling of the ideas and techniques explored in the University of Maryland's master's degree in technology entrepreneurship, an innovative 100% online program. Learn more at http://mte.umd.edu.\n\n                                            Syllabus\n                        The Early Stage Investment LandscapeThis session provides insights into the investment landscape, to include how investors and lenders evaluate new ventures. Key terminology and principles are addressed to provide learners without an accounting or finance background with an understanding of these areas. Sources of Capital for the Early Stage CompanyThis session examines the options that entrepreneurs face in where to raise their financial capital from in the early stages of their venture. From friends and family, to angel investors and venture capitalists, the pros and cons of each source of capital are explored.Getting Funded – Steps in the Funding ProcessThis session discusses the techniques and tools to secure funding for a new venture. This provides insights into how entrepreneurs can create a comprehensive funding strategy for their new venture.Pitching Investors and Closing the RoundThis final session instructs learners on how to share their investment opportunity with investors and partners. With practical tips on the do's and don'ts of pitching, learners are able to develop a compelling story for their new venture.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "New Venture Finance: Startup Funding for Entrepreneurs", 
    "price": 0, 
    "instructors": "Michael Pratt", 
    "institution_name": [
        "University of Maryland, College Park"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/startup-funding", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}