{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    According to Steven Blank a business startup, or any new venture startup is essentially a proto-type. Thus the startup process essentially becomes a learning process to refine that business proto-type into a scalable, replicable finished 'product'.\n\nAt the end of this course learners will be able to:\n   -complete a business model summarizing assumptions about what value they will offer to whom, and how they will make \n    money.\n   - systematically test and validate these assumptions within the constraints of their available resources, and\n   - use these validated assumptions to generate financial projections that are based on actual resources and efforts expended.\n\nThe days of the 40 page business plan have certainly passed, but the role of planning in the business creation process is one of extreme importance. In this course we will explore the important components that you need to explore in detail prior to business creation. Action without planning is a recipe for disaster and we will make sure you have a rock solid foundation for future actions.\n\nThe planning here is focused on learning. It is unrealistic for anyone to document in detail all of the actions they should take to make a new venture or activity successful when they (and often no one else) has any experience with the new venture and the conditions which it is likely to face. Thus the business plan based largely on assumptions and aggregate, non-applicable data is replaced with the business model which organizes the key assumptions determining what value the business will offer to whom, and how it will make money. The course will guide learners through the process of systematically testing and validating these assumptions, and obtaining specific, applicable data. It will then show learners how to use these validated assumptions to generate pro-forma financial statements directly tied to actions and resources based on this business model.\n\n                                            Syllabus\n                        INTRODUCTIONThis module re-establishes that the ultimate goal of the business development process is the Business Franchise Model - Business Plan. It then provides an overview of the components of this business development process,and the process to create them. \n\nLearning Goals:  every arduous journey needs a clear and ever-visible goal to guide it. After successfully completing this module, you will be able to do the following.\n\n1) Explain why the 'Business Franchise Model - Business Plan is the ultimate goal of the business development process, making it your clear and ever-visible goal. \n\n2) You will also be able to list the core milestones of this business development process process and the steps to achieve them. Thus enabling you to follow those steps to achieve those milestones towards creating your own business. PRINCIPLED PLANNINGPlanning is a critical part of the business development process. The planning required by the 'New Business Paradigm' requires a different perspective and processing than what is traditionally thought of as planning. It seeks continual discovery as opposed to a static right solution.\n\nLearning Goals: Steve Jobs famously said, \"Think Different\". He wasn't just referring to what you think, but also how you think. After successfully completing this module, you will be able to do the following.\n\n1)\tYou will be capable of thinking differently with respect to planning.\n\n2)\tYou will be able to provide a rationale for this different way of thinking based on your understanding of its conceptual foundations.\n\n3)\tAfter reviewing several illustrative examples for this type of planning, and illustrative examples of its execution you will move towards mastering the principles of this new planning process.\n\nNote! Mastering the principles that underlie this planning approach is a 'profession skill' required for all professionals, not just entrepreneurs in our new economy.CREATING THE VALUE THAT WILL CREATE A CUSTOMERThe ultimate goal of any business, in fact the only goal is to create a customer. First and foremost in creating a customer is to create value. This lesson the nature of the value you have identified for your business and how it is expressed in a value proposition. \n\nAfter successfully completing this module, you will be able to do the following.\n\n1.\tDissect the problem you are trying to address in the market place into three categories: jobs or tasks the prospective customer is trying to achieve; the gains or benefits they seek in through those jobs or tasks; and the pains they are trying to relieve through those jobs or tasks, or the pains they endure in trying to perform those jobs or tasks.\n\n2.\tBe able to compose a value proposition statement identifying what you believe to be the critical jobs, gains, or pains prospective customers will be willing to pay for.\n\n3.\tBe able to test and validate that the jobs, gains, and/or pains you have identified are in fact the one most important to prospective customers, and that they are willing to pay for them.\n\n4.\tBe able to make a compelling argument for why a prospective customer should in fact be your customer through your composition of this validated value proposition statement.Construction Zone Two: Value PropositionWe have said several times that this course is somewhat unique as a online experience. Our goals involve more than just mastery of some content, or the execution of some task. Our goals include a tangible accomplishment: an ongoing business. You can put a time limit on an exam or an assignment, you can not dictate the time frame for a successful business. With this in mind we want to give you the learner extended time to truly engage your market and develop one of the most important aspects of one of your business development milestone. That being the value proposition. After successfully completing this model you will have successfully completed a set of activities that will give you a much clearer picture of the extent to which you have created a value that can potentially create a customer.PROPOSING THE BUSINESS CONCEPT STATEMENTThis course presented six milestones in the business development process. This module presents lessons that guide the development (proposing) and testing (proofing) of the first of these, the business concept statement which includes a detailed value proposition statement. \nAfter successfully completing this module, you will be able to do the following.\n\n1.\tDevelop a Business Concept Statement. \n2.\tAssess the quality of a Business Concept Statement in terms of whether all the required components are contained. \n3.\tBe able to determine the validity of a Business Concept Statement.In addition to these capabilities, you will have completed the first of five milestones in your journey to have a functioning business at the end of the specialization.The Business Model and Launch PlanThis module continues with the milestones of the Quad-P planning process presented in this course. It presents lessons that guide the development (proposing) and testing (proofing) of the Business Model and Launch Plan milestones. These milestones transition the business concept into a profitable business. After successfully completing this module you will 1) be able to recognize and categorize various business models in terms of their impact on financial documents, their narrative, or their infrastructure; and 2) be proficient in developing a business model canvas.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Planning: Principled, Proposing, Proofing, and Practicing to a Success Plan", 
    "price": 0, 
    "instructors": "David Wheeler, Forrest S. Carter and Ken Szymusiak", 
    "institution_name": [
        "Michigan State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/business-planning", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}