{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    The success of every venture depends on scaling: on sustaining and enhancing its effectiveness as it adds more employees, customers, and locations. The problem, however, is that scaling comes with inherent risk. Even the best founders and teams face setbacks, make mistakes, and must muddle through stretches of confusion and uncertainty.Professors Huggy Rao and Bob Sutton devoted seven years to understanding the differences between organizations that scale well and those that scale badly. In the process, they have identified what leaders can do to increase their organization’s odds of success. They compiled the lessons they learned into the Wall Street Journal best-selling book Scaling Up Excellence: How to Get More Without Settling for Less. In this course, you will learn the principles that will help you scale up your venture without screwing up.You’ll address questions that cut to the heart of the scaling challenge:\r\n\r\nHow can you avoid the illusion, impatience, and incompetence that are hallmarks for botched scaling efforts?\r\nWhat should your strategy be? Should you be more “Catholic” and replicate one model as you grow? Or should you take a more “Buddhist” approach and encourage local customization as your footprint expands?\r\nHow can you avoid cognitive overload on yourself and those you lead, while at the same time, add necessary complexity as your team and organizations grows?\r\n\r\nThe five-week course consists of assigned readings, lectures, exercises, and video interviews. Each week will present you with different questions, and assigned readings from Scaling Up Excellence. Additionally, lectures that extend the insights of the book have been prepared, and the video interviews provide rich practical advice. The video interviews feature some of the most successful venture capitalists and entrepreneurs in Silicon Valley, such as:\r\n\r\nBen Horowitz of renowned venture capital firm Andreessen Horowitz\r\nMichael Dearing - the early stage venture investing guru of Silicon Valley\r\nAnkit Gupta and Akshay Kothari - two Stanford students whose class project turned into Pulse, a venture acquired by LinkedIn\r\nClara Shih, the founder of Hearsay Social, and a board member of Starbucks\r\nSelina Tobaccowala, President and CTO of SurveyMonkey and co-founder of Evite\r\n​Anthony Coles, former CEO of Onyx Pharmaceuticals, which his team grew and then sold to Amgen for 10 billion dollars\r\nKaye Foster-Cheek, former Senior Vice President of Human Resources for Onyx Pharmaceuticals\r\nDr. Jordan Kassalow, founder and co-chairman of VisionSpring, an organization that gives individuals in the developing world access to eyeglasses\r\nKevin Hassey, CEO of VisionSpring\r\n\r\nThrough the exercises, you will be able to apply the learnings directly to develop your scaling plan. At the end of the course, there is a live webinar during which some of the best works from the class will be showcased.\n\n                                    ", 
    "end_date": "2016-03-14T00:00:00Z", 
    "title": "Scaling Up Your Venture Without Screwing Up", 
    "price": 0, 
    "instructors": "Robert Sutton and Huggy Rao", 
    "institution_name": [
        "Stanford Graduate School of Business", 
        "Stanford University"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/scaling-up-your-venture", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-02-01T00:00:00Z"
}