{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Ever dream of changing the world or making a difference? You are invited to roll up your sleeves and join a group of entrepreneurs on a journey to change lives by changing systems. In this 4 week course from +Acumen, you'll learn to apply entrepreneurial skills to social problems and design lasting solutions. Built from Acumen's years of experience investing in social entrepreneurs, this course will also featuring firsthand stories and advice from 4 inspiring founders: Charles Best of DonorsChoose.org, Thulsiraj Ravilla of Aravind Eyecare, Leila Janah of Sama Group, and JB Schramm of College Summit.\r\nDesigned for anyone approaching social entrepreneurship for the first time, this interactive learning experience will give you an overview of the sector. It will help you explore pathways for initial engagement with social enterprises and uncover your relevant passions and skills.\r\nBy the end of this course, you'll have found a concrete way to contribute to a social enterprise OR you'll be engaged in early stage ideation for your own venture. Specifically, you'll begin to identify a problem you care about, understand the considerations needed for impact and financial sustainability, and learn about how various social entrepreneurs have thought about scale. Sign up to get started!\r\n \n\n                                    ", 
    "end_date": "2016-10-18T00:00:00Z", 
    "title": "Social Entrepreneurship 101: Discovering Your Path and Passion to Change the World", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "+Acumen"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://novoed.com/social-entrepreneurship-2016-2", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2016-09-13T00:00:00Z"
}