{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/socialimpact\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/socialimpact-002/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    socialimpact-001\n                                                                    socialimpact-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Social entrepreneurs and social innovators are tackling and diminishing many of the world's problems. They achieve significant positive social impact through the creative and aggressive mobilization of people and other resources:In Africa, a social entrepreneur-built an enterprise delivers\n70 million daily protein servings into the region at significantly lower cost and\nat higher quality than before.  In India,\nrice husks are burned to generate power enabling families to live, read,\nand learn after the sun goes down. In\nLatin America, makeshift informal housing is converted from fire-trap\nshanties into safe, concrete-based homes.\n\nThis course will cover a select set of topics associated with social innovation and entrepreneurship whether\nnonprofit or for-profit. By taking this course you will share in our combined 45 years\nof social entrepreneurship experience, and you will learn how to:Launch social entrepreneurship projects which have\nhigh-potential of significant positive social impactDirect energy and limited resources to efficiently\nlaunching those projects with the most promiseApply tools and frameworks to testing and\nscaling your own social enterprise\n\n\n\n\n\n\n\nThe 24 most promising social entrepreneurs who\nsuccessfully complete the University of Pennsylvania's Coursera Course on\nSocial Entrepreneurship will be selected as fellows for the 2016 Global Social\nImpact House (GSIH). GSIH is a seven-day residential program that provides\nfellows with the tools, community and training they need to advance their\nventures. Workshops are customized and explore advanced concepts in business\nmodels, design thinking and personal leadership. The program is also designed\nto help fellows build meaningful, global connections while living together in a\nbeautiful ecolodge in Costa Rica.The Center for Social Impact Strategy at\nthe University of Pennsylvania will provide full scholarships to every fellow,\nincluding room and board. Fellows are responsible for covering travel and\nvisa-related expenses to and from Costa Rica. \n\n\n\nProgram\nDates: January 11 - 17, 2016\nProgram Location: Rancho\nMargot, Costa Rica\nApplication Deadline: October 26, 2015\nApply: www.socialimpactstrategy.org/residential/gsih \n\n                                            Syllabus\n                        Week 1 - What is Social Enterprise?TopicsIntroduction &amp; Course OverviewSocial Enterprise PlanningDesign Thinking for Social InnovationHomeworkMind MapProblem/Solution StatementLogistics QuizWeek 2 - Deciding Who to Help and HowTopicsPerformance CriteriaSegmentationIntroduction to Logic ModelsHow to Build a Logic ModelHomeworkPerformance Criteria: Unit of Revenue &amp; Unit of Social ImpactSegmentation: Market SegmentsLogic ModelWeek 3 - Understanding Your Beneficiaries and their AlternativesTopicsUnderstanding the BeneficiaryOperations RealitiesOperations RequirementsCompetitive AnalysisHomework Beneficiary Experience TableDeliverables TableCompetitive Analysis MatrixWeek 4 - Testing Assumptions and Measuring PerformanceTopicsTest of Concept PlausibilityPerformance MeasurementFraming and ScopingCost TableHomeworkTest of Concept PlausibilityFraming and Scoping (Social Impact &amp; Financial Goals)Cost TableWeek 5 - Organizational Form and Stakeholder ManagementTopicsPerspective on Organizational Form: IPerspective on Organizational Form: IIStakeholder AnalysisSociopoliticsSummary &amp; Next StepsHomeworkOrganizational FormStakeholder Analysis\n                                    ", 
    "end_date": "2015-10-19T00:00:00Z", 
    "title": "Social Entrepreneurship", 
    "price": 0, 
    "instructors": "Ian MacMillan, James Thompson and Peter  Frumkin", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/course/socialimpact", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}