{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Learn to think like a futurist! Futurism is not about predicting the future, but making informed decisions today that will impact future developments. The Emerging Future: Technology Issues and Trends MOOC offered by the School of Library and Information Science at San José State University provides the planning skills and technology trends needed to create your personal and organization’s future. Knowing who and what to watch will keep you informed on the latest technology issues and trends that will impact the future.\r\nThe Emerging Future MOOC is a professional development opportunity designed for information professionals and those interested in the topic. The MOOC is not offered for academic credit. SJSU SLIS graduate students who participate in the MOOC will not receive credit toward their master's degrees.\r\nThe technology landscape changes rapidly, and these changes have economic, social, and ethical significance for individuals, organizations, and the entire world. The Emerging Future: Technology Issues and Trends MOOC brings focus to the planning skills that are needed, the issues that are involved, and the current trends as we explore the potential impact of technological innovations.Participants will experience an interactive online learning environment via a wide range of tools and diverse materials (e.g., freely accessible readings, recorded presentations, and online videos), and they will have an opportunity to:\r\n\r\nExplore the current technological environment\r\nBecome immersed in the literature and practices of current futurists\r\nSelect appropriate resources to use in planning for new technologies.\r\nDiscuss key impact factors and trends affecting our personal and global existence\r\nEngage with peers and instructors, heightening their learning and taking full advantage of this professional development opportunity.\r\nEarn badges and MOOC certification on completion of activities related to each of the modules.\r\n\n\n                                    ", 
    "end_date": "2014-11-03T00:00:00Z", 
    "title": "The Emerging Future: Technology Issues and Trends", 
    "price": 0, 
    "instructors": "Sue Alman, PhD and Jennifer Jumba, MLIS", 
    "institution_name": [
        "San Jose State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.canvas.net/courses/the-emerging-future-technology-issues-and-trends", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2014-09-22T00:00:00Z"
}