{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Engineering is an extremely exciting profession! Engineers are behind many of the advancements we are taking for granted today including computers, the Internet, smartphones, medical tools and cars. Engineers use science and math to create cool products and machines that make life worth living. \r\nEngineering is not only a field of study. It is a way of thinking. The word 'engineer' is from the Latin word ingenium, which shares the same root as the word 'genius'. Adopting an engineering way of thinking can improve our performance in our daily life regardless of our field.\r\nThis course combines the engineering thinking (CDIO) with entrepreneurial behaviour leading towards the creation of purpose-driven technopreneurs.\r\nLet's change the world together.\r\nDream big. Be different. Have fun.\n\n                                            Syllabus\n                        1. Technopreneurship: Learning, Language and the Brain\r\nIn this lecture we will explore how Technopreneurship as a frame of mind can be learned and nurtured. Through the use of the right language and the correct technique, we can build myelin around our rewired brains to be highly effective technopreneurs who recognise opportunity and deliver value and make a difference in the world.  \r\n2. Think Like a Technopreneur\r\nIn this lecture we will explore how engineers think and where do they draw their inspiration from. You will get to learn how engineers Conceive the cool things that they make and will start working on your own engineering project.\r\n3. The Lean Startup\r\nIn this lecture we will explore the lean startup process, of which Kal Joffres from Tandemic will speak on his experiences as a social entrepreneur.\r\n4. Crowd Funding\r\nIn this lecture we will explore the basics of crowd funding so that you can run a successful crowd funding campaign for your project. The lecture is delivered by Sam Shafie from PitchIn, the crowd funding platform that we are collaborating with in this course.\r\n4. Technopreneurial Eco System\r\nIn this lecture we will explore the basic components of the eco system in which value is created and delivers to the customers. Technopreneurs create products and services that are desirable and they achieve this through creating a balance between what is technologically feasible, economically viable and humanly desirable. The value is created and delivered to customers and funders within an eco system.\r\n5. Build a Technopreneurial Dream Team\r\nIn this lecture we will explore the basics of building effective teams that will work towards having the core competencies necessary to deliver the promised value to the stakeholders.\r\n6. Communicate Like a Technopreneur\r\nIn this lecture we will explore the framework for an effective communication that can be used not only in business context, but also in your life at large.\r\n7. Business Plan\r\nIn this lecture we will explore how technopreneurs communicate their ideas and plans of new ventures through business plan. A business plan is a document that outlines the venture’s potential including the business value, the customers’ segments, the resources needed and the expected profit.\r\n8. Market and Marketing\r\nIn this lecture we will explore how to market a product or a service effectively as well as how to segment a market and how to penetrate new markets.\r\n9. Money in the Organisation\r\nIn this lecture we will explore various terminologies and concepts related to managing money within a business.\r\n10. Return on Failure\n                                    ", 
    "end_date": "2015-07-06T00:00:00Z", 
    "title": "Think like an Engineer", 
    "price": 0, 
    "instructors": "Mushtak Al-Atabi", 
    "institution_name": [
        "Taylor's University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.openlearning.com/courses/thinklikeanengineer", 
    "duration": "14 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "OpenLearning"
    ], 
    "start_date": "2015-03-30T00:00:00Z"
}