{
    "selfpaced": true, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Die Digitalisierung bürgt eine Vielzahl von Chancen, auch für die Gründung neuer Unternehmen. So sind immer mehr neue Geschäftsmodelle im IT-Sektor zu beobachten, wie z. B. Cloud Computing Lösungen und Plattformen zum Austausch von physischen Gütern und Serviceangeboten, welche bestehende Anbieter und Märkte verdrängen. Der Einsatz neuer IT-Technologien gibt einer Vielzahl potenzieller Gründer zudem die Möglichkeit heutzutage relativ kostenarm ihre Geschäftsidee zu testen und marktfähige Produkte zu entwickeln.Vor diesem Hintergrund lernen Sie in diesem Workshop zuerst, was es heißt „Entrepreneur“ zu sein und welche Dinge sie schon im Vorfeld beim Teamaufbau und der Suche nach einer Geschäftsidee beachten sollten. Anschließend erläutern wir, warum es wichtig ist, von Beginn an ein Geschäftsmodell zu verfolgen und stellen Methoden zur Erfassung und Weiterentwicklung ihres Geschäftsmodells dar. Danach betrachten wir die Aspekte einer kundenfokussierten Produktentwicklung und widmen uns der Frage, was es heißt ein innovatives IT-Produkt am Markt einzuführen und erfolgreich, auch in späteren Phasen, zu positionieren. Abschließend gehen wir auf das Thema Finanzierung ein und analysieren diverse Finanzierungsinstrumente in der Gründungsphase.Das Ziel ist es, dem Teilnehmer einen praxisorientierten Einblick in die Herausforderungen und Fallstricke bei der Gründung eines IT-Start-ups zu geben – wir wollen dem Teilnehmer nicht die wirtschaftstheoretischen Hintergründe erläutern, sondern ihm das „Toolkit“ in die Hand geben, um erfolgreich ein IT-Start-up zu gründen.\n\n                                    ", 
    "end_date": "2016-04-25T00:00:00Z", 
    "title": "Unternehmensgründung im IT-Bereich - Wie gründe ich erfolgreich ein IT-Startup?", 
    "price": 0, 
    "instructors": "Manuel Effenberg", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://open.hpi.de/courses/startup2016", 
    "duration": "3 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "openHPI"
    ], 
    "start_date": "2016-04-04T00:00:00Z"
}