{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso está estructurado para desarrollar la capacidad de entender el proceso de financiamiento de tu emprendimiento, es decir, la financiación de tu empresa para su creación, puesta en marcha y posterior crecimiento.  Durante el curso podrás entender los elementos y la estructura de la financiación de tu proyecto, los recursos requeridos para llevarlo a cabo, y finalmente los métodos de identificación y obtención de dichos recursos. \n\nEl curso permitirá una aproximación al tema de las finanzas desde la perspectiva del comportamiento de la empresa en su etapa de inicio, explica los conceptos básicos de una manera aplicada para acercarte al tema de los números aunque no tengas bases fuertes en este tema. Si tienes una base financiera sólida, el curso te ofrece alternativas para usar ese conocimiento en la gestión y administración de los recursos de financiación para lograr un óptimo resultado en la gestión de la empresa en una etapa temprana. \n\nObjetivos de aprendizaje:\n\n1. Validar la estructura de ingresos y de costos, los flujos de efectivo, la rentabilidad y las necesidades de financiación del proyecto.\n\n2. Identificar, desde los números, las deficiencias e incoherencias del proyecto desarrollado hasta ahora.\n\n3. Identificar posibles fuentes y mecanismos de financiación apropiados para el proyecto.\n\n4. Sintetizar la lógica financiera básica del proyecto y comunicarla efectivamente a posibles financiadores y aliados.\n\nEl desarrollo de estos objetivos te permitirá definir los números básicos de tu proyecto, los cuales serán utilizados para la búsqueda de recursos financieros que permita el arranque del mismo. Es un curso de aprendizaje de herramientas prácticas fundamentales para todo emprendedor.\n\nTen en cuenta que este curso hace parte del programa en Desarrollo de nuevas empresas, en el que podrás llevar tu inquietud emprendedora desde una idea hasta la realidad. El primer curso del programa se llama \"¿Cómo convertir mi idea en empresa?\" y el segundo \"¿Cómo construir mi modelo de negocio?\". Te recomendamos que te inscribas y participes en ambos si no lo has hecho. Cuando completes estos tres cursos del programa, podrás inscribirte en el último curso, llamado \"Mi nueva empresa: los siguientes pasos\", al cabo del cual estarás listo para llevar tu emprendimiento o negocio a la realidad.\n\n                                            Syllabus\n                        Construcción de la estructura de ingresos y egresos del proyectoEn el primer módulo de este curso obtendrás orientaciones para identificar los numeros básicos para tu empresa, de tal manera que los puedas proyectar en el tiempo, con elementos adicionales que te permitan validarlos y tener cifras que se acercan más a la realidad de tu empresa.Análisis comparativo de ingresos y egresosEn este módulo aprenderás a comparar tus estimaciones de ingresos y egresos operativos.  Esta comparación te ayudará a determinar el punto de equilibrio, los requerimientos de financiación y los beneficios de tu empresa. Adicionalmente conocerás las herramientas financieras básicas que se usan para organizar esa información en tu empresa.Las fuentes de financiaciónEn este módulo conocerás los dos tipos principales de financiación para tu empresa, el crédito y el capital,  y las fuentes potenciales en cada uno de estos tipos. Además, conocerás las ventajas y requisitos para acceder a estos tipos de financiación y las posibilidades que tienes para combinarlos de manera que obtengas el mejor financiamiento para tu empresa. Negociación de la financiaciónEn este último módulo conocerás cómo elaborar un documento de financiación para tu empresa y qué debe tener tu \"Elevator Pitch\", así mismo identificarás cuáles son los temas que debes hablar con tus financiadores de tipo inversionistas una vez decidan invertir en tu empresa.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "¿Cómo financiar mi empresa?", 
    "price": 0, 
    "instructors": "Andrés Guerrero Alvarado", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/financiar-mi-empresa", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}