{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Este curso te ofrece un entrenamiento para la tarea de descubrir quién será el consumidor de tu producto o servicio y cuáles serán los atributos y características del mismo. Al terminar el curso, habrás identificado una oportunidad de negocio que te permitirá utilizar tus fortalezas personales; habrás identificado un grupo de consumidores y sus necesidades; habrás creado un producto o servicio para atender esas necesidades y lo habrás prototipado con consumidores reales, obteniendo claridad con respecto a cuáles son los atributos del producto que el consumidor realmente desea y por los cuales está dispuesto a pagar. \n\nObjetivos de aprendizaje: \n\n1. Identificar las capacidades que tienes como individuo y te hacen especial (lo que eres, lo que sabes y a quien conoces), e  identificar cómo estas capacidades pueden implicar ventajas en tu entorno. Se introduce aquí la idea de ventaja injusta, que hace referencia a las capacidades individuales que resultan raras, valiosas y difíciles de replicar en el medio. \n2. Identificar con precisión una necesidad en el entorno, que pueda ser resuelta por ti como individuo, a partir de tus capacidades personales.  \n3. Proponer una solución que pueda funcionar bien como un producto o servicio en el mercado.  Precisar la propuesta de valor teniendo en cuenta sus elementos constitutivos: productos y servicios, canales, relación con el cliente y la forma de cobro.\n\nTen en cuenta que este curso es el primero de cuatro cursos que hacen parte del programa en Desarrollo de nuevas empresas, en el que podrás llevar tu inquietud emprendedora desde una idea hasta la realidad. Te recomendamos que te inscribas y participes en todos los cursos incluyendo el último curso, denominado \"Mi nueva empresa: los siguientes pasos\", al cabo del cual estarás listo para llevar tu emprendimiento o negocio a la realidad.\n\n                                            Syllabus\n                        Módulo 1: ¿Cuál es tu \"ventaja injusta\"?Con este módulo damos inicio al primer curso del \"Programa en desarrollo de nuevas empresas\". Aquí, profundizaremos en algunas nociones iniciales que te irán permitiendo descubrir cómo tus capacidades individuales que resultan raras, valiosas, difíciles de replicar en el medio y que pueden ser aplicadas al aprovechamiento de una tendencia; es decir, lo que denominaremos en adelante como \"Ventaja Injusta\".   Módulo 2: Conoce a tu consumidor y prototipa tu ideaEn este módulo comenzarás a diseñar el contacto con tus clientes. Para ello, te propondremos un análisis de las necesidades del cliente desde el concepto de Jobs To Be Done (JTBD) y un mecanismo de validación de tu conocimiento de esas necesidades, a partir de la elaboración de un prototipo.Módulo 3: Validación de tu prototipoEn este módulo tendrás la oportunidad validar el prototipo de tu producto o servicio que definiste el módulo, buscando que tenga las características mínimas necesarias para lograr vender. El objetivo fundamental es maximizar tu aprendizaje sobre la forma como el consumidor entiende y aprecia tu producto o servicio y sobre las características que éste debería tener para ser exitoso. Utilizarás el prototipo para realizar un ejercicio de venta, como un mecanismo que confirmará si realmente  estás creando valor para tu consumidor y te indicará las brechas que  debes resolver para lograr ese objetivo.Módulo 4: ¿Cómo aprendo de mi prototipo?En este módulo aprenderás cómo trabajar con la información que obtuviste en el ejercicio de prototipado para alcanzar un conocimiento más profundo de tu consumidor. Verás cómo las críticas y observaciones negativas que hicieron algunos consumidores potenciales respecto a tu prototipo tienen un gran valor, pues te permitirán apreciar con mayor claridad cómo tu consumidor entiende sus propias necesidades y cuáles son las características que esperaría ver en tu producto o servicio como condición para llegar a una decisión de compra. Verás frutos del trabajo que has realizado, pues entenderás cuáles son los detalles ganadores que debes introducir en tu producto.Módulo 5: La evolución de mi proyectoEn este módulo vas a tomar los resultados de tu reflexión sobre tu prototipo y vas a producir una segunda versión. Al hacer el segundo prototipo, vas a aprovechar el nuevo conocimiento adquirido a partir de tu observación de los participantes en el primer ejercicio. Ahora tienes un conocimiento más claro sobre quiénes pueden ser tus mejores clientes y cuáles son sus deseos y los criterios que utilizan para evaluar si un producto responde  a sus necesidades. Con ese conocimiento como tu arma, vas a crear un nuevo prototipo que estará totalmente enfocado en las necesidades del usuario.Módulo 6: Comparte tu proyecto con el mundo¡Bienvenido al último módulo del curso! En este módulo vas a utilizar lo que has aprendido de tu cliente y de tu proyecto para construir los siguientes pasos hacia el desarrollo de tu negocio. Identificarás los próximos hitos que debes cumplir y qué recursos debes obtener para lograrlos. Con esta información, construirás la primera pieza promocional de tu negocio con la que intentarás atraer a actores clave que deseen acompañarte en el desarrollo de tu proyecto. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "¿Cómo convertir mi idea en empresa?", 
    "price": 0, 
    "instructors": "Rafael Vesga Fajardo and Felipe Estrada Prada", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/idea-empresa", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}