{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Любой растущей компании могут потребоваться инвестиции для финансирования дальнейшего роста. Для решения этой задачи в условиях нарастания неустойчивости деловой среды Вам понадобится понимание механизмов работы венчурной индустрии. Курс входит в специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и заключительный прикладной проект “Мастерство создания стоимости компании”.\n\nЭтот курс позволит вам узнать:\n- как финансируется бизнес на этапе роста, \n- почему появились и как работают венчурные фонды и фонды прямых инвестиций,\n- кого они хотят видеть в качестве объекта инвестирования,\n- как готовить заявку на инвестиции и как она рассматривается фондом,\n- как фонд и компания сотрудничают в увеличении стоимости бизнеса,\n- когда и как осуществляется капитализация этой стоимости путем выхода венчурного инвестора из компании.\n\nДля освоения курса Вам потребуются знания финансовой отчетности, оценки стоимости и эффективности инвестиционных проектов, оптимизации структуры источников финансирования, которые предлагаются в курсах 1-3 специализации и уметь работать с Excel.\n\nВ ходе курса Вас ждут интересные лекции и увлекательные задания.\nКаждое из 4-х занятий предполагает оценочные тесты и заключительное экзаменационное задание.\n\n                                            Syllabus\n                        ВведениеЛюбой компании могут потребоваться инвестиции в капитал для финансирования дальнейшего роста. Для решения этой задачи требуется понимание механизмов работы венчурной индустрии. В рамках этого курса мы изучим как финансируется бизнес на этапе роста, почему появились и как работают венчурные фонды и фонды прямых инвестиций, кого они хотят видеть в качестве объекта инвестирования, узнаем как готовить заявку на инвестиции, как она рассматривается фондом, как фонд и компания сотрудничают в увеличении стоимости бизнеса, познакомимся c тем, как осуществляется капитализация этой стоимости и выход из инвестиций.Управление капиталом растущей компании Добрый день, уважаемый слушатель! В этом модуле «Управление капиталом растущей компании» вы научитесь анализировать бизнес, сможете нарастить мастерство управления, усилить профессиональные позиции в аналитической, управленческой и в предпринимательской среде. После прохождения данного модуля Вы сможете: оценивать перспективы бизнеса с помощью рыночных сравнений и понимать специфику оценки стоимости в различных отраслях бизнеса; выработать направления корпоративной стратегии компании; отличать цели и задачи современного бизнеса; понимать основные принципы портфельного подхода к инвестированию, оценивать требуемую доходность и источники инвестиций и многое другое. Для эффективного освоения модуля Вам необходимы начальные знания бухгалтерского учета и основ финансов. После прохождения данного модуля Вам потребуется выполнить контрольное задание в виде тестирования, а по окончании всего курса - итоговое задание - самостоятельно подготовить Заявку на инвестиции в венчурный фонд. Пользуйтесь ресурсами курса и будьте внимательны при решении тестовых заданий! Успехов!Рынок венчурного капитала, выбор источникаДобрый день, уважаемый слушатель! В этом модуле «Рынок венчурного капитала, выбор источника» вы получите представление об индустрии венчурного капитала и о роли государства и институтов развития в венчурной индустрии, познакомитесь с основными правовыми формами венчурных фондов и фондов прямых инвестиций, научитесь выбирать фонды для обращения за инвестициями. После прохождения данного модуля Вы сможете: оценивать виды финансирования доступные компании, выявлять их преимущества, недостатки и способы их получения; определять долговую нагрузку компании; понимать, как определяются цены на разнообразные финансовые ресурсы, что собой представляют принципы инвестиционного управления: отношения между инвесторами, инвестиционным комитетом и управляющим фондом и многое другое. Для эффективного освоения модуля Вам необходимы начальные знания бухгалтерского учета и основ финансов. После прохождения данного модуля Вам потребуется выполнить контрольное задание в виде тестирования, а по окончании всего курса - итоговое задание - самостоятельно подготовить Заявку на инвестиции в венчурный фонд. Пользуйтесь ресурсами курса и будьте внимательны при решении тестовых заданий! Успехов!Структурирование сделок с использованием венчурного финансированияДобрый день, уважаемый слушатель! В этом модуле «Структурирование сделок с использованием венчурного финансирования» вы получите представление об основных этапах взаимодействия фонда и компании: формировании пайплайн, заявки на инвестиции и переговоры, подготовки term-sheet, due diligence, закрытии сделки, совместной работе по повышению стоимости бизнеса; научитесь составлять заявку на инвестиции, вести переговоры с фондом венчурных инвестиций. После прохождения данного модуля Вы сможете: участвовать в разработке term-sheet и пройти процедуру due diligence, принимать решения об инвестировании и закрытие сделки. Для эффективного освоения модуля Вам необходимы начальные знания бухгалтерского учета и основ финансов. После прохождения данного модуля Вам потребуется выполнить контрольное задание в виде тестирования, а по окончании всего курса - итоговое задание - самостоятельно подготовить Заявку на инвестиции в венчурный фонд. Пользуйтесь ресурсами курса и будьте внимательны при решении тестовых заданий! Успехов!Работа с инвесторами и выход из инвестицииДобрый день, уважаемый слушатель! В этом модуле «Работа с инвесторами и выход из инвестиции» вы получите представление о совместной работе с инвестором по повышению стоимости компании и управлению инвестициями, о выходе из инвестиций (Exit) и его вариантах (МВО/LBO, продажа активов и продажа другим фондам, продажа стратегическому инфесторы и продажа на публичном рынке), научитесь сотрудничать с инвестором в части повышения стоимости бизнеса, выходить из инвестиции. После прохождения данного модуля Вы сможете: различать стратегии выхода из инвестиций, оценивать их преимущества и недостатки с точки зрения финансового инвестора и других акционеров компании. Для эффективного освоения модуля Вам необходимы начальные знания бухгалтерского учета и основ финансов. После прохождения данного модуля Вам потребуется выполнить контрольное задание в виде тестирования, а по окончании всего курса - итоговое задание - самостоятельно подготовить Заявку на инвестиции в венчурный фонд. Пользуйтесь ресурсами курса и будьте внимательны при решении тестовых заданий! Успехов!\n                                    ", 
    "end_date": "2016-07-04T00:00:00Z", 
    "title": "Венчурный капитал", 
    "price": 0, 
    "instructors": "Иван Иванович Родионов", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/venchurnyj-kapital", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}