{
    "selfpaced": false, 
    "topic_name": [
        "Entrepreneurship"
    ], 
    "description": "\n\n                    \n                    \n                    Любая компания, независимо от ее правовой формы, обладает стоимостью, и все принимаемые в ней решения влияют на ее величину. В этом курсе мы ставим задачу научить Вас инструментам мониторинга изменений в фундаментальной стоимости компании. Курс завершает специализацию “Корпоративные финансы и стоимость компании”, включающую 5 связанных курсов и необходим для выполнения заключительного прикладного проекта “Мастерство создания стоимости компании”.\n\nКурс полезен тем, кто уже создал бизнес или обдумывает предпринимательскую концепцию создания новой компании, а также специалистам, работающим в управленческой команде в бизнесе.\nВ результате успешного освоения курса Вы будете знать, как определить вклад управленческих решений менеджеров в приращение или падение стоимости компании; каким образом советы директоров компаний могут увеличивать ее стоимость; какие инструменты нужно использовать для оперативной оценки текущей деятельности компании по критерию приращения ее стоимости и мониторинга ее создания.\n\nВ ходе курса вас ждут лекции и интервью с профессиональным консультантами, работающими  в международном стратегическом и финансовом консалтинге России. По итогам каждой из 4-х недель Вы выполняете оценочное задание и по итогам курса - заключительное экзаменационное задание.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Управление стоимостью компании", 
    "price": 0, 
    "instructors": "Ивашковская Ирина Васильевна", 
    "institution_name": [
        "Higher School of Economics"
    ], 
    "commitment": "", 
    "subject_name": [
        "Business & Management"
    ], 
    "course_url": "https://www.coursera.org/learn/mastering-value-creation", 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-30T00:00:00Z"
}