{"selfpaced": false, "topic_name": ["Industry Specific"], "description": "\n\n                    \n                    \n                    Aimed at a general business audience, this course provides an overview of a wide range of additive manufacturing technologies and offers a framework to help learners understand the business implications of these technologies. The course is relevant for professionals working in product design, manufacturing, supply chain, strategy, and other disciplines. Through the course, participants will build a knowledge base on additive manufacturing to help them engage in discussions with colleagues, customers, and suppliers about how the technology applies to their business.\r\nParticipants will explore many topics in this course including:\r\n\r\nWhat is additive manufacturing? Learn the processes and technologies that fall under the AM umbrella and gain an understanding of where they fit within the universe of manufacturing technologies.\r\nHow will AM impact my business? Explore a framework based on economic principles that helps explain how AM will influence product and supply chain evolution.\r\nWhat is happening in key sectors impacted by AM? Understand the current and potential uses of AM in sectors including medical technology, automotive, and aerospace &amp; defense, and learn how you can analyze your own industry and company to define a path forward with AM\r\nWhat factors influence the business case for AM? Explore the key dynamics and general factors you should consider when building a business case for AM.\r\n\r\nThe course consists of approximately 2.5 hours of video content divided into approximately six-minute mini lectures. Quizzes allow you to check and consolidate your knowledge. And assignments reviewed by peers can take you deeper and give you practical information to take back to your job.\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "3D Opportunity: Additive Manufacturing for Business Leaders", "price": 0, "instructors": "Mark Cotteleer", "institution_name": ["Deloitte University Press"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://novoed.com/3d-opportunity-spring-2016", "duration": null, "language_name": ["English"], "provider_name": ["NovoEd"], "start_date": "2016-02-06T00:00:00Z"}