{"selfpaced": false, "topic_name": ["Industry Specific"], "description": "\n\n                    \n                    \n                    With the world's first MOOOOO-C, you will gain a broad and comprehensive understanding of all aspects of dairy management such as genetics, nutrition, reproduction, animal health, farm economics, and sustainability of dairy production systems. There's something here for everyone whether you are just looking for the basics or have years of experience in the dairy industry.\n\nThis is an eight-week course. Each week consists of four to nine video lectures, additional reading materials, and a multiple-choice questions quiz. Estimated study time is between three and five hours per week. Learners have the option to purchase a Course Certificate for 49.00 USD. The certificate can be purchased at any time, but you must verify your identify before taking the course quizzes in order to be eligible. For those who cannot afford the certificate fee, financial aid is available through Coursera.\n\nWhy is producing milk efficiently and sustainably so important? \n\nMilk provides humans with over 16 essential nutrients, such as: Energy, Protein and Essential Amino acids, Vitamin A, Vitamin D, several B vitamins, including B12, Pantothenic and Folic acids, and essential minerals such as Calcium, Magnesium, Phosphorus, Potassium, Zinc, as well as other minerals. Did you know that one glass of milk provides a 5-year old child with 21% of his/her daily protein requirements and 8% of their energy needs?\n\nMost milk in the world, about 85%, is produced from cattle. However, water buffaloes, goats, sheep, and camel are also dairy animals. The United States, India, the European Union, Brazil, and New Zealand are among the largest dairy producers in the world. Yet among these dairy-producing countries there are varied methods to generate milk with highly variable productivity and efficiency. Dairy production is vital for the survival of billions of people. Globally, around 150 million small-scale dairy households, equivalent to 750 million people, are engaged in milk production. The number and size of dairy farms varies among countries, but in India alone, there are estimated 78 million dairy farms! In the United States, one of the leading milk-producing countries in the world, total milk production has been steadily increasing in the last decades, reaching over 205 billion pounds (93 billion kilograms) in 2014. This was accompanied by a steady increase in average milk yield per cow, reaching 22,260 lb (over 10,100 kg) per lactation in 2014. How has this efficiency been achieved? What methods are necessary to ensure production of high quality milk? How do we balance milk production efficiency with animal health and environmental protection? This course will provide the student with information to better understand dairy production systems and their role in feeding the world population.\n\nIn this MOOOOO-C, you will learn about the dairy enterprise from internationally recognized dairy science professors who have delivered highly regarded dairy education programs within the United States and internationally.\n\nCourse Sponsors\n\nThis course was supported by the generous contributions of Pancosma North America and RP Nutrients, Inc., which provided funding support at a Bronze Level.  The Pennsylvania State University has final responsibility for the academic content of this course.\n\n                                            Syllabus\n                        Orientation and Dairy GeneticsIn the Dairy Genetics module, you will learn about the different breeds of dairy cattle, their popularity and how performance varies from one breed to the next. We will consider the many different traits that are evaluated by farmers and breeders during genetic selection, and how we collect data to conduct genetic evaluations. In order to simplify the selection process we will consider selection indexes. You will learn how dairy cattle have changed over the last half-century, and the factors that alter the rate of genetic progress. Finally, you will learn about the technologies that have helped to accelerate genetic gain in dairy cattle such as artificial insemination and genomic testing. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. We hope you enjoy learning about the genetics of the dairy cow!  Forage Production and Pasture ManagementThis week you will learn about what forages are, why they are important and the multiple roles they play on the dairy farm. We will also review some of the basic management considerations that are involved in the establishment, production and harvesting of these crops. The first lecture will focus on the multiple roles that forages play on the farm on considerations that are necessary to develop an effective forage production system. In the second lecture we will discuss some common perennial forage crops and their management. This will include alfalfa, alfalfa grass mixtures and grasses. In the third lecture, we will discuss the annual forages commonly used on dairy farms: corn, sorghums and small grains.  You will learn how to utilize pastures in dairy production systems. The fourth lecture will discuss grazing and pasture management, including challenges of grazing systems, how grazing management has evolved, and proper grazing management for optimum forage and animal productivity. The fifth lecture will focus on nutrition for grazing herds, including nutrient content of pasture relative to the nutrient requirements of lactating dairy cows and strategic supplementation strategies for optimal animal health and milk production. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!Feeds, Hay and Silage Making, and Feed ProcessingThis week you will learn about feeds commonly fed to dairy cows and feed processing. We will first discuss the feeding characteristics of forages such as corn silage, alfalfa haylage, grass and small grain silages, will then move to concentrate feeds that provide energy or protein in a dairy ration, and at the end will discuss feed additives. You will also learn about the most important factors in making high quality hay and silage for dairy cows. The final lecture of this week will introduce you to processing methods designed to increase the nutritive value of forages, the importance of particle size and effective fiber in dairy rations, and most common processing methods for cereal grains and oilseeds. At the end, we will discuss how to read and understand forage analysis reports. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!  Nutrition Basics, Requirements, and Feeding of Lactating Cows This week you will be introduced to the principles of animal nutrition, basic nutrients and their metabolism, sources for these nutrients in a dairy diet, the anatomy of the digestive tract of a ruminant animal, the wonderful world of the rumen microbes, and major end-product of ruminal fermentation. Further, you will learn about energy and protein metabolism and nutrition, and nutrient requirements and their importance in feeding dairy cows. In the last segment of Week 4, we will discuss the life cycle of a dairy cow, lactation curve, grouping strategies, diet formulation basics, typical sources of energy and protein in dairy diets, will touch on mineral and vitamin nutrition, summarize nutritional recommendations for the various stages of the lactation, and diet preparation techniques. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course! Calf and Heifer Nutrition and Feeding of Dry CowsCalf health, growth, and productivity rely heavily on nutrition and management practices. Every heifer calf born on a dairy farm represents an opportunity to maintain or increase herd size, to improve the herd genetically, or to improve economic returns to the farm. The objectives of raising the newborn calf to weaning age are optimizing growth and minimizing health problems. In this video we will discuss the development of the calf's digestive system, learn how important colostrum is for the immune system, and the nutrients the calf needs to be healthy and grow well. We will discuss critical phases of growth for the dairy heifer, the importance of good facilities, and how nutrition plays an important role in getting a healthy well grown heifer ready to be bred and prepared to have her first calf.Proper management and nutrition of the dairy cow transitioning into lactation is very important for obtaining a healthy calf, increased reproductive efficiency and optimal milk production in the following lactation. We will learn how this can be achieved by feeding balanced diets, providing good cow comfort, and assuring the cow is in good body condition before and after she calves. There are many feeding strategies that work for feeding dry cows however the goal should always be to provide high quality feed sources, consistent availability of feed, adequate bunk space and a comfortable environment. We will discuss  how best to manage and feed the dry cow prior to calving so she can transition into lactation with a healthy calf and produce high quality milk. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!Dairy Reproduction This week you will learn basic concepts related to reproduction on dairy farms. We will start with a discussion of the life cycle of the dairy cow and how to adequately prepare a heifer for her fist calving. Next will be a discussion of the basic anatomy and function of the male and female reproductive tracts. This will be followed by an overview of the bovine estrous cycle and the main hormones and ovarian structures that control the cycle. We will follow this with a discussion of factors controlling the expression of estrus by dairy cows and how to be more effective at detecting estrus. We will highlight the critical need to time ovulation and insemination to maximize conception rates and will discuss some of the factors which reduce conception rates. This will be illustrated by a discussion of the key reproductive metric, pregnancy rate. Viewers will learn about strategies to increase pregnancy rates and will better understand methods used for pregnancy detection along with the critical need for early and accurate pregnancy detection to maximize the farms’ pregnancy rates. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!Animal Health and Milk QualityIn Week 7 of this course, you will learn about disease concerns of dairy cows and calves and management practices addressing diagnosis and prevention. Our discussions will progress from first establishing disease prevention concepts of biosecurity and evolutionary change to dairy herd health programs. The next three discussions will focus on disease issues related to the calving cow, calf and lactating cow. These lessons will provide background information and practical skills in recognizing disease problems early in an effort to minimize adverse consequences on animal health and performance. The last two discussions will focus on disease treatment and prevention practices in addressing important conceptual approaches as specific mechanisms for treatment and prevention are dependent upon regulatory issues within a given country. We will address the controversial issue of antibiotic usage in the treatment of cows as an important concern for food production, but also as part of good animal care and ensuring animal welfare. Preventive practices of vaccination strategies and parasite control will be framed in a conceptual approach that could be applied to differing farm situations. Finally our discussion will emphasize the importance of good nutrition, thus linking information from other course modules, to establishing proper dairy management practices to ensuring quality cow care and minimizing disease risks. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!Farm Economics and EnvironmentIn Week 8 of the course, you will learn about the basics of dairy farm management and identify some key aspects of farm level economics that impact farm productivity and profitability.  From crops to cows to cash, the dairy farm is an economic engine that has positive impacts on local communities. The second part of this series expands on dairy’s local impact to provide a global view of dairy markets around the world. From price volatility to seasonal milk supplies, the world marketplace for dairy products is complex. In the last lectures of this course we will discuss the environmental implications of dairy production and strategies for decreasing nitrogen, phosphorus, and greenhouse gas emissions from dairy operations. Those of you, who would like to get more engaged in discussions and are interested in completing the Course Certificate requirements, can participate in discussion forums and take the weekly quiz. Enjoy this week's material and the entire course!\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Dairy Production and Management", "price": 0, "instructors": "Alexander Hristov, Greg Roth, Gabriella Varga, Troy Ott, Robert VanSaun, Lisa Holden, James Dunn, Chad Dechow, Kathy Soder and Bhushan Jayarao", "institution_name": ["Pennsylvania State University"], "commitment": "3-6 hours", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/dairy-production", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}