{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t The &ldquo;Krank Systems At-Home Fat Loss Program&rdquo; will turn you into a  lean, mean, fat burning machine with just 3 workouts per week. Our  proven system is something the &ldquo;fitness gurus&rdquo; have been hiding from the  public for years, and we are here to reveal the secrets! We will be by  your side, step-by-step, for every movement for the next 12 weeks to  transform you into the healthy and fit person you have always dreamed  of!  </p>  <p>  \t We understand how frustrating visiting the gym can  be, especially with no guidance. Our At-Home Fat Loss Program includes  12 weeks of body movement workouts with minimal equipment and consists  of 3 fat burning workouts per week -- each lasting under 1 hour. During  this course, the Krank Systems Professionals and Certified Trainers will  educate on the correct warm-ups and daily exercise methods to achieve  the utmost experience and body transformation all within the comfort of  your own home.  </p>  <p>  \t Achievements include:  </p>  <p>  \t * Never joining a gym  </p>  <p>  \t * Never hiring a personal trainer  </p>  <p>  \t * Never needing a dietitian or &ldquo;diet&rdquo;  </p>  <p>  \t * Eliminating unwanted body fat  </p>  <p>  \t * Increase lean muscle tone  </p>  <p>  \t * Complete body strengthening  </p>  <p>  \t * Building stamina  </p>  <p>  \t * Flattening your stomach  </p>  <p>  \t * Shrinking your waist size  </p>  <p>  \t * Losing weight the correct way  </p>  <p>  \t * Creating confidence and self esteem  </p>  <p>  \t * Being in the BEST shape ever  </p>  <p>  \t Also  included in the program are &ldquo;Test Outs&rdquo; which will moderate your  progression and a &ldquo;Nutritional Guideline&rdquo; that will teach you how to  fuel the body the correct way. This Nutritional Guideline, prepared by  the KRANK System Professionals and Certified Trainers, will enhance the  body&rsquo;s natural energy levels, burn unwanted fat, and properly tone the  body.  </p>  <p>  \t The KRANK Systems At-Home Fat Loss Program  guarantees that by following the warm-ups, daily exercises, and  Nutritional Guideline for 12 weeks, you will be in tip-top shape and  ready to conquer!  </p>  <p>  \t You are only one click away from a lifetime supply of healthiness, well-being, and being in the best shape of your life!  </p>", 
    "end_date": null, 
    "title": "12 Weeks to Fat Loss-Krank Systems At-Home Fat Loss Program", 
    "price": "20.00", 
    "instructors": "Krank Systems", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138974_4909_5.jpg", 
    "course_url": "https://www.udemy.com/kranksystemsfatloss/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-28T20:57:45Z"
}