{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Course Fully Updated for May 2016</strong></strong></p>\n\n<p><strong>Learn how to eat clean 12 weeks!</strong></p>\n\n<p>\tAre you frustrated of starting over whenever losing weight?</p>\n\n<p>\tSick and tired of trying to stay motivated?</p>\n\n<p>\tDo you feel like you'll never be as fit as you want to be?</p>\n\n<p>\tI get how you feel because I've been there...</p>\n\n<ul><li>I know what it's like having to restrict myself from certain foods that I enjoy only to end up feeling guilty about eating them later.</li><li>I know what it's like to go from workout program to workout program only to end up starting at square one.</li><li>I know what it feels like to feel like I'll never lose my weight.</li></ul>\n\n<p>\tIf you feel like you're stuck or frustrated, it's not your fault...</p>\n\n<p>\tThe \"12 Week Lean and Fit Nutrition Program\" is your opportunity to take on your health goals head on without feeling overwhelmed.</p>\n\n<p><strong class=\"redactor-inline-converted\">All you have to do is do one simple action step a week. </strong></p>\n\n<p>Let's face it, many of us have busy lives and trying to figure out what to eat every single second can be time consuming.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">My philosophy is simple: simplicity and consistency breeds success.</strong></p>\n\n<p>Just take a look at my personal transformation and my client transformations to see for yourself! The image is down below for you to preview!</p>\n\n<p>Once I simplified the whole process by doing small action steps at a time, I lost about 20 pounds and went from 20% body fat to 9.9% body fat! </p>\n\n<p>And a lot of my clients have been achieving similar results!</p>\n\n<p>\t<strong class=\"redactor-inline-converted\"><em>\"I felt like I tried everything on my own. I got results but whenever I got busy I just fell off the band wagon and I just lost the motivation to keep going. Following the program I lost about 12 pounds in 2 weeks.\" -Francis Manaog, Pharmacist</em></strong></p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Imagine...</strong></p>\n\n<ul>\t<li>No longer having from program to program</li>\t<li>Not having to worry about staying motivated</li>\t<li>No more yo-yoing.</li>\t<li>Not having to start over any more.</li>\t<li>Not having to worry about what you're eating every single second.</li>  </ul>\n\n<p>\t<strong class=\"redactor-inline-converted\">Join The Course If You...</strong></p>\n\n<ul>\t<li>Want to achieve your health and fat loss goals</li>\t<li>Want to be pushed beyond your comfort zone</li>\t<li>Want to follow a simple format in losing weight.</li>\t<li>Want to be held accountable for your goals.</li>  </ul>\n\n<p>\t<strong class=\"redactor-inline-converted\">Don't Join The Course If You...</strong></p>\n\n<ul>\t<li>Aren't committed to your health and fat loss goals.</li>\t<li>Are satisfied with where you're currently at with your health.</li>\t<li>Are not ready to take your health to the next level.</li>\t<li>Don't see the value in investing in yourself.</li>\t<li>Are not committed to completing your goals</li>\t<li>Are not ready to be held accountable</li>  </ul>\n\n<p>\t<strong class=\"redactor-inline-converted\"><em>\"Down 13 lbs. total, I don't plan on stopping. It's become a way off life to stay active and fuel myself with the right kinds of things, and I want to continue bettering myself and getting stronger\" -Ashley O'Neill, Hair Stylist</em></strong></p>\n\n<p>\t<strong class=\"redactor-inline-converted\">No Risk. Money 30-Day Money Back Guarantee.</strong> I believe so strongly in this course that I'll take on all the risk. If you enroll and don't like it, you can have your money back within the first 30 Days.</p>\n\n<p>\t<strong class=\"redactor-inline-converted\">The Question Now Is: Are You Going To Step Up?</strong></p>\n\n<p>\tI've told you everything you need to know in regards to the challenge. The ball's in your court now.</p>\n\n<p>\tYou can either continue trying diet after diet, workout program after workout program or...</p>\n\n<p>\tYou can join the Lean and Fit Nutrition Program where you'll be given clear steps and guidelines you need without over complicating anything.</p>\n\n<p>\tThe only thing between you and where you want to go is enrolling up for the course. Enroll Now.</p>", 
    "end_date": null, 
    "title": "12 Weeks to Clean Eating Without Losing Your Mind", 
    "price": "20.00", 
    "instructors": "Emeroy Bernardo", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88782_035a_4.jpg", 
    "course_url": "https://www.udemy.com/12-weeks-to-clean-eating-without-losing-your-mind/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-05T20:45:39Z"
}