{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t DIETING SUCKS!  </p>  <p style=\"\">  \t .. and I feel your pain!  </p>  <p style=\"\">  \t Let me tell you something, its not your fault, so stop being so hard on yourself.  </p>  <p style=\"\">  \t If you&#039;re one of those who has spent most of your life battling the &quot;diet&quot; merry-go-round, then you&#039;ll know how frustrating it is stick to diets, depriving yourself of some of your favourite treats, exercising like mad and remaining motivated for the long haul...sound familiar?  </p>  <p style=\"\">  \t Do you find it frustrating when your skinny friends eat whatever they want and never gain a pound?  </p>  <p style=\"\">  \t Well I&#039;ve seen clients like yourself many times in my practice, and the first thing I tell them is that <em style=\"\">&quot;the word &quot;diet&quot; is banned, i don&#039;t want to hear it pass your lips again&quot;.</em>  </p>  <p style=\"\">  \t This is the same for you. I want to show you how you can kiss goodbye to diets, slimming clubs, shakes, pills, potions and even the weighing scale. This is about you making a firm decision to change once and for all and never be held ransom by another diet EVER AGAIN.  </p>  <p style=\"\">  \t By making simple changes to your lifestyle and conditioning your mind you can:  </p>  <ul style=\"\">  \t<li style=\"\"> Lose weight</li>  \t<li style=\"\"> Be leaner</li>  \t<li style=\"\"> Get fitter</li>  \t<li style=\"\"> Fit into those skinny jeans</li>  \t<li style=\"\"> Love the reflection staring back at you in the mirror</li>  \t<li style=\"\"> Feel healthier</li>  \t<li style=\"\"> Reduce your risk of heart disease, diabetes, strokes etc.</li>  \t<li style=\"\"> Feel motivated </li>  \t<li style=\"\"> Be in control of our life and getting the most out of it</li>  \t<li style=\"\"> Revitalise your relationships</li>  \t<li style=\"\"> And feel so proud of yourself </li>  </ul>  <p style=\"\">  \t I want to share with you the very same simple hacks that I go through with my clients. These hacks are so simple and effective, that you&#039;ll be asking yourself <em style=\"\">&quot;Is that it?&quot;..</em> and I&#039;ll be replying <em style=\"\">&quot;YES&quot;. </em>  </p>  <p style=\"\">  \t You see, you&#039;ve overcomplicated the whole issue of losing weight, you&#039;ve spent all your life chasing the &quot;magic pill&quot;, the latest diet fad, you may have tried the &quot;suck in your gut pants&quot;. You&#039;ve put the whole &quot;I&#039;ve got to lose weight&quot; notion on a little pedastool and given all your thoughts and energy to it, and each and everytime is hasn&#039;t worked the way you hoped, you eroded your belief in yourself. Well I&#039;ll let you into a secret, you&#039;ve had the answers all along, you&#039;ve been looking in the wrong places...the solutions aren&#039;t out there. You&#039;ll find the answers within you if you take a closer more honest look.  </p>  <p style=\"\">  \t Going through the course won&#039;t take long, in just a few hours you&#039;ll have everything you need to change right now, you might be suprised at the changes you start to experience.  </p>  <p style=\"\">  \t Each hack is a technique in itself, and you can decide in which order you want to put them into action now.  </p>  <p style=\"\">  \t All I ask of you is that you trust your instinct a little more. Stop looking elsewhere, put these hacks to good use, take ownership of them and make them part of you. Say to yourself, &quot;enough is enough, never again&quot; and get to work.  </p>  <p style=\"\">  \t I&#039;m here to support you in whichever way I can.  </p>  <p style=\"\">  \t Talk soon and best wishes  </p>  <p style=\"\">  \t Umesh  </p>  <p style=\"\">  \t <strong style=\"\">P.S.</strong> The $47 investment in yourself is an introductory offer so grab it before it goes up to its full price of $77  </p>", 
    "end_date": null, 
    "title": "27 Hacks to Lose Weight Without Dieting", 
    "price": "45.00", 
    "instructors": "Umesh Damania", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/136766_3ec4_8.jpg", 
    "course_url": "https://www.udemy.com/27-hacks-to-lose-weight-without-dieting/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-22T15:54:21Z"
}