{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Heart disease is a leading cause of death among men and women around the globe, while over 40% of adults suffer from elevated blood pressure worldwide. In this course, you will learn exactly what puts you at risk for these deadly diseases and what you can do about it. You will discover the practical and simple steps you can implement daily to shed pounds, burn belly fat, bring down blood pressure, and dramatically reduce your heart disease risk. Internationally renowned nutrition &amp; fitness expert Erin Palinski-Wade, RD, CDE, CPT will show you just how to do it in over 22 interactive video lectures! In just 30 days, you will lose weight, lower your blood pressure, boost energy levels, and improve heart health and longevity. </p><p style=\"\">This course will not only improve your knowledge of how nutrition and fitness impacts heart health and blood pressure, but you will learn exactly what changes you need to make each and every day to achieve amazing results faster than you thought possible. Every lecture provides you with a simple “call to action&quot;- an easy activity to start implementing each and every that will lead you on your way to a achieving your health and weight loss goals. Whether you have been diagnosed with heart disease or hypertension, are at risk, or just want to improve your overall health- this course offers something for everyone!</p><p style=\"\">It&#039;s never been so easy to eat your way to a healthier you! You can&#039;t afford NOT to take this course. Get started today!</p>", 
    "end_date": null, 
    "title": "30 Days to a Healthy Heart & Lower Blood Pressure", 
    "price": "30.00", 
    "instructors": "Erin Palinski-Wade, RD, CDE", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/449478_7b6f_3.jpg", 
    "course_url": "https://www.udemy.com/30-days-to-a-healthy-heart-lower-blood-pressure/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-17T14:52:23Z"
}