{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<span>Making changes to your diet should be fun and easy! And it doesn&#039;t have to be expensive, either. This class is the perfect place to learn the in&#039;s and out&#039;s of healthier eating.</span>  </p>  <p>  \t<span></span><span>In the class, we will discuss:</span>  </p>  <ol style=\"\">  \t<li>The benefits of vegetables and fruits, plus easy and fun ways to incorporate them into your life; </li>  \t<li>Why foods with artificial colors affect your health, and how to find healthier alternatives; </li>  \t<li>How to make grains and beans more nutritious (and less flatulence producing!);</li>  \t<li>Why it’s a good idea to slow things down; </li>  \t<li>Why fast food will cost you in the long run; </li>  \t<li>An introduction to sugars and sweeteners; </li>  \t<li> How to find local resources; and </li>  \t<li>Why it’s important to celebrate and share what you’ve learned.</li>  </ol>  <p>  \t    PLUS, we’ll dive into the how and why of it all, with a little history on how we got here in the first place.  </p>  <p>  \t    In addition, you’ll have access to over 3 hours of lectures and over 25 pages of healthy recipes and documents you can print out to help you on this path.  </p>  <p>  \tIn the process, you&#039;ll be able to make food choices that make sense AND make you feel good. And you can always reach out to me if you have any questions.  </p>  <p>  \tHere&#039;s my own story, in case you&#039;re interested:  </p>  <p>  \tWhen I was in my 20s, I gained weight. I became horribly ill. The doctors didn’t know what was wrong with me.  </p>  <p>  \tSo I started to seek out on my own the answers I needed.  </p>  <p>  \tIt turns out that all of my problems were caused by the processed foods that I was eating. You see, I was a junk food JUNKIE! But as soon as I started to eat fresher foods and eliminate the junk, not only did my health improve, but I lost weight, too.  </p>  <p>  \tHad I continued on that path, I don’t know where I would be now — I suspect, I’d be a lot heavier and a lot more miserable!  </p>  <p>  \tInstead, I feel amazing. I’m frequently told that I look 10-15 years younger than I am, and I have more energy, endurance, and vigor than ever before. Life just keeps getting better and better.  </p>  <p>  \tThere’s no secret to my good health. It’s all about integrating small changes and making them stick. It’s about honoring this body — the only one I get! — with good food and healthy choices.  </p>  <p>  \tI have been studying nutrition and natural wellness for almost 20 years, and I am excited to share with you what I have learned.  </p>", 
    "end_date": null, 
    "title": "5 Easy and Fun Ways to Start Eating Real Food ", 
    "price": "50.00", 
    "instructors": "Jennifer Schmid, MSN, RN, CNL", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206792_d17b_3.jpg", 
    "course_url": "https://www.udemy.com/5-easy-steps-to-healthier-eating/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-28T20:47:38Z"
}