{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Feel and look your best with this 4-Week transformational course designed to revolutionize your dietary practice. </strong>  </p>  <p style=\"\">  \t <strong style=\"\">This course will introduce you to a culinary system and dietary practice that will last you a lifetime. <br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t <strong style=\"\">Discover the secrets to staying slim, radiant and energized. <br style=\"\">  \t </strong>  </p>  <ul style=\"\">  \t<li style=\"\"> Learn how to combine RAW Living Foods with the best of Cooked Foods</li>  \t<li style=\"\"> Learn the incredible - not to be missed - digestive power of Cultured/Fermented Foods.  Alleviate bloat and create flowing digestion. </li>  \t<li style=\"\"> Learn how to use healthy fats for beautiful skin, flexible joints, and luscious meals. </li>  \t<li style=\"\">Learn ancient traditions of powerful healing foods to build strong immunity.</li>  \t<li style=\"\">Learn how to keep it simple and nourish and please yourself with every bite. </li>  \t<li style=\"\">Learn how to stop dieting and start living with knowledge, skills and freedom.</li>  </ul>  <p style=\"\">  \t       Hi, I am Chef Teton, and I am 68 years old. I have studied nutrition and the culinary arts for over 25 years. I have learned to transform every ailment that historically comes with aging. I have learned to keep slim and strong while enjoying excellent energy, beautiful skin, harmonious moods, sound sleep, flowing digestion and flexible joints.  </p>  <p style=\"\">  \t     In other words, I live in a body that works well!  </p>  <p style=\"\">  \t     I learned to do it and so can you. I will be your coach and guide you for 4 weeks with:  </p>  <p style=\"\">  \t <strong style=\"\">How to&quot; Video Instruction</strong>: Learn how to soak, sprout, blend and dehydrate with my highly acclaimed instructional video series, divided and scheduled so that you can learn one step - one week at a time!  </p>  <p style=\"\">  \t <strong style=\"\">Award Winning Recipes:</strong> Included are all of my delicious recipes with, and without pictures, easy to view and easy to print.  </p>  <p style=\"\">  \t <strong style=\"\">Audio Recordings:</strong> Each week providing valuable little known facts about health, nutrition, and culinary shortcuts.  </p>  <p style=\"\">  \t <strong style=\"\">E-Book Articles:</strong> Providing the cutting edge &quot;high points&quot; about highly functional foods and healthy fats you will want in your body every day.  </p>  <p style=\"\">  \t       Week by Week: A winning formula breaking down the steps with instructions, recipes, pictures, audio, video, and shopping lists.  </p>  <p style=\"\">  \t       Resources: For traveling, purchasing equipment, specialty foods, and discounts.  </p>  <p style=\"\">  \t       Join Me Now!  </p>  <ul style=\"\">  \t<li style=\"\">Do  you have a pile of diet books, DVD&#039;s, recipes, and information from  magazine articles? </li>  \t<li style=\"\">Do you get confused? Do you struggle with finding  time to make the changes you want? </li>  \t<li style=\"\">Do you want to loose weight and keep it off? </li>  \t<li style=\"\">Do you want to heal parts  of your body that are beginning to break down? </li>  \t<li style=\"\">Do you want to look more  beautiful and turn back the clock? </li>  \t<li style=\"\">Do you want more pleasure and better results?</li>  </ul>  <p style=\"\">  \t       After selling thousands of my Essential Cuisine DVD series I created this Dietary Makeover Course, which includes the entire Essential Cuisine DVD series plus much more, so that you can use the these culinary treasures to your advantage. It is a one stop shop designed to give you everything you need to set a new foundational diet for a lifetime.  </p>  <p style=\"\">  \t       The Dietary Makeover Course:  </p>  <li style=\"\"> Combines the latest science in healthy nutrition, and ancient nutritional wisdom with innovative culinary methods.</li>  <li style=\"\"> Has deliciously nutritious, and affordable recipes.</li>  <li style=\"\"> Learn in the comfort of your own home.</li>  <li style=\"\">The videos will provide you with “at home” instruction, along with audio recording, course curricula, directions, and fabulously simply recipes. </li>  <li style=\"\"> Have an outstanding diet and/or meal program  that inspires optimal health for you body, mind and soul. This course  will give you the skills and tools you need for <em style=\"\">lasting</em> results.</li>  <li style=\"\">Creates a Beautiful You, a Highly Functional You!  A Healthy Body &amp; Mind is Your Greatest Source of Wealth.</li>  <li style=\"\"> Covers the latest in nutrition, the basics of raw food, the best of cooked, and cultured/fermented foods as well  – a treasure chest of lifestyle practices that get results for flowing  digestion, beautiful skin, flexible joints and vital energy. </li>  <li style=\"\"> A mind body component empowering you toward achieving your goals and keeping positive and inspired will be included.</li>  <li style=\"\"> Homework will be assigned so you can implement new recipes, scheduling and shopping practices to create lasting benefits. </li>  <br style=\"\">  <strong style=\"\">Course Highlights:</strong>  <p style=\"\">  \t<strong style=\"\">Raw: </strong>Learn to sprout, blend and dehydrate, make you own seed milks, cheeses, and the most luscious desserts on the planet.  </p>  <p style=\"\">  \t<strong style=\"\">Cooked Foods:</strong> Combining the best of raw and cooked. Learn which grains are alkaline and how to make simple meals from sauces, grains, veggies and legumes.  </p>  <p style=\"\">  \t<strong style=\"\">Fats &amp; Oils:</strong>  Which are safe and how to use and store them. Learn how to make  luscious sauces and dressing for raw and cooked foods alike. The secret  key to raw food is to always make sure your fats are raw.  </p>  <p style=\"\">  \t<strong style=\"\">Ayurvedic:</strong> How to use the herbs and spices which are the basics of this culinary system.  </p>  <p style=\"\">  \t<strong style=\"\">Healing Foods:</strong>  Learn how to mineralize your foods and ferment your foods to get  abundant probiotic flora for pennies a day. Learn basic cleansing  protocols.  </p>  <p style=\"\">  \t<strong style=\"\">Blending:</strong> The easy way to get your <em style=\"\">5 a Day</em> veggies.  </p>  <p style=\"\">  \t<strong style=\"\">Cultured &amp; Fermented Foods:</strong> Learn how to make your own and include them with every meal.  </p>  <p style=\"\">  \t<strong style=\"\">Supplements:</strong> The most important and how to achieve healthy absorption.  </p>  <p style=\"\">  \t<strong style=\"\">Body Mind Connection:</strong>  Certified in The Work of Byron Katie, and as an Avatar Master/Wizard I  have learned the vital connection our thinking and feelings have to do  with our health. We&#039;ll address these areas helping you to get in touch  with how your thoughts and feelings that may be causing you more harm  than the improper foods you may be eating.  </p>  <p style=\"\">  \t       ~~~~~~~~~~~~~~~~~~~~~~~  </p>  <p style=\"\">  \t <strong style=\"\">Testimonials about Chef Teton &amp; The Dietary Makeover Course:</strong>  </p>  <p style=\"\">  \t           Hi Chef Teton,  </p>  <p style=\"\">  \t           What I loved about the course was interacting with CT and other  like-minded people. The information has had a transforming effect on my  diet and my relationship with food. It was nourishing on every level. <strong style=\"\">The “how-to” conveyed by the DVDs was absolutely essential.</strong>. Having the recipes and shopping list ahead of time was essential too.  </p>  <p style=\"\">  \t           I also want to say that I love the Golden Elixer and the Carrot  Tahini Dressing. They are so versatile. Chef Teton, your speech on  “stewardship of the body” really made an impression on me. Also adding a  few super foods (green juice, cultured veggies &amp; kefir, healthy  oils) into my diet has, in effect, crowded out some of the not so great  things that I used to reach for. I like what is happening to my body as a  result of these changes. Thank you so much for such a wonderful course.  </p>  <p style=\"\">  \t <strong style=\"\">Anne S., Wisconsin</strong>  </p>  <p style=\"\">  \t   “Chef Teton, Your DVDs should be mandatory for every dietitian,  nutritionist and natural health practitioner! Each one contains  essential information that can turn on the genes for optimum health and  turn off the cycle of weight gain, degenerative disease, and serious  illness. Watching hands-on food preparation of natural foods by a pro is  the only way to master these kitchen cuisine secrets in a short period  of time. And they’re so pleasant to watch. Your smiling face and  professional style contributes greatly to their “addictiveness.” Now,  when I’m in the kitchen, I think, “What would Chef Teton do?” and you  gave me the courage to experiment more with raw and wholesome foods.  Great recipes, too! I’m referring your DVD series to every patient and  dear friend!”  </p>  <p style=\"\">  \t           – <strong style=\"\">Dr. Donna Schwontkowski, Chiropractic physician (ret), M.S. Nutrition, Masters in Herbology</strong>  </p>  <p style=\"\">  \t           &quot;Dear Susan,  </p>  <p style=\"\">  \t           I loved, loved, loved the course. I would be interested in  taking anything you offered. Or any other CDs you might do in the  future.  </p>  <p style=\"\">  \t           I thought the format was great. I have no suggestions of how to make it better.  </p>  <p style=\"\">  \t           I don’t know what I would have liked more of. I&#039;ve made  incredible changes. I now make my own cultured vegetables and eat them  daily. Never in a million years would I have ever thought that would  happen. Also I make cultured coconut milk and love it. I have  incorporated sea vegetables into my diet on a regular basis. These are  just some of the changes I have made because of this course.  </p>  <p style=\"\">  \t <strong style=\"\">Thank you for a fantastic course, Micki&quot;</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t           “When I became an herbalist, one of the courses was how to  incorporate raw and wholesome foods into the diet. I loved that class,  but over the years, wished I could find additional instruction so I  didn’t have to re-invent the wheel (and have cooking disasters along the  way). Your DVD series is exactly what I’ve been looking for and it is  so much more than what I ever expected to find. It’s vibrant, it’s  exciting, it’s real, and it’s full of tricks and tips to decrease the  learning curve… After just the first DVD, I was experimenting in the  kitchen again, and loving every minute of it! Thank you for all your  hard work. This DVD series will change the health of America, one  mouthful at a time.”  </p>  <p style=\"\">  \t <strong style=\"\">– Louisa Blackstone</strong>  </p>  <p style=\"\">  \t           “The course was beyond what I had expected it to be, so the  value of the course went way beyond what my expectations were. I was  hoping to get just a basic questions and answers for the course. Instead  I got new thoughts and directions that I did not even think about. This  course has gone way beyond what I was expecting.  </p>  <p style=\"\">  \t           I dropped 20 lbs so far without really trying, which is very  interesting. Need to buy some new pants though.”  </p>  <p style=\"\">  \t <strong style=\"\">Darin, Vancouver</strong>  </p>  <p style=\"\">  \t           &quot;The information has had a transforming effect on my diet and my  relationship with food. It was nourishing on many levels! The  scheduling was great. Having the recipes and shopping list ahead of time  was essential. The audios were especially nice!  </p>  <p style=\"\">  \t           I am happy with the results and the value for my investment.  </p>  <p style=\"\">  \t           Two important life-changers: 1) the CT speech on “stewardship of  the body” really made an impression on me, 2) adding a few super foods  (green juice, cultured veggies &amp; kefir, healthy oils) into my diet  has, in effect, crowded out some of the not so great things. I like what  is happening to my body as a result of these changes. Thank you so  much!&quot;  </p>  <p style=\"\">  \t <strong style=\"\">Elaine, Madison</strong>  </p>  <p style=\"\">  \t           I do want to take this opportunity to thank you for the  difference you have made in my eating habits. I have your CDs and took  your online course and am eating in a way I never thought I would.  </p>  <p style=\"\">  \t <strong style=\"\">Thank you, Kim H. Arizona</strong>  </p>  <p style=\"\">  \t           I am happy to tell you that the changes I made as a result of  “Dietary Makeover” are still with me. My husband is even on board. This  is because I incorporated new recipes one at a time, while shifting our  meals slightly over time. What a fabulous and comprehensive course that  works to last a lifetime.  </p>  <p style=\"\">  \t <strong style=\"\">Dawn W., Santa Barbara, CA</strong>  </p>  <p style=\"\">  \t           Dear Chef Teton,  </p>  <p style=\"\">  \t           The Dietary Makeover Course was great in that it allowed me a  focused time frame to integrate into my daily routine some new  techniques. I’m finally getting comfortable with healthy foods, that are  alternative to what I have been eating and what has caused me weight  gain. It is so valuable to learn about the food, read the recipes and  see instruction. This way I could shop and actually “do it” and know  how. I loved the cooking/preparation techniques – so helpful. This is a  great cutting edge course that everyone who wants to eat healthier  should take. Your life depends on it!  </p>  <p style=\"\">  \t           Mahalo Susan for putting it together. It has served me in many ways.  </p>  <p style=\"\">  \t           Chef Teton,  </p>  <p style=\"\">  \t           I must say that what I was able to accomplish was so worth the  cost and then some. I learned things about how to consume vitamins and  minerals. Using Sea Vegetables and where to find good sources of it.  </p>  <p style=\"\">  \t           The course for me was beyond what I had expected, so the value  of the course went way beyond what my expectations were. I was hoping to  get just a basic questions and answers for the course. Instead I got  new thoughts and directions that I did not even think about. I did not  realize how diverse the Raw Food industry really is and how it can  change ones health for the better. There is a saying that says let your  food be your medicine and your medicine be your food. I had found out I  was diagnosed with Colitis and was hoping it would help with the foods I  eat. Along the way I found out more things like the need to eliminate  Wheat and processed Sugars out of my Kitchen, which I have and boy has  this made a huge impact in my life. So this course has gone way beyond  what I was expecting.  </p>  <p style=\"\">  \t           The course served in that it presented new ideas and concepts  and took me in new directions that I never even thought were possible or  existed.  </p>  <p style=\"\">  \t           I have lost about 15 lbs, most of it was from the change in my  eating and eliminating Wheat from my diet. The other day I had to put on  a belt, which I was wearing pants I have not been able to where in over  2 years and now have to wear a belt with them.  </p>  <p style=\"\">  \t           I must say the direction that this course has taken me is  different in many areas I would not have thought possible. This course  is well  </p>  <p style=\"\">  \t           worth the price and then some.  </p>  <p style=\"\">  \t <strong style=\"\">David Johnson, N.Dakota</strong>  </p>  <p style=\"\">  \t           And update from David Johnson a Colitis patient:  </p>  <p style=\"\">  \t           I did not tell you some of my side benefits I am getting, which  is the Health Benefits I am getting. Going regular, which is great. The  other aspect is that I do not have problems going up or down stairs now,  which I was huffing and puffing at times. No more and no real  difficulties now. Something did not feel right at times with breathing  and that is gone. So some major side benefits of changing my diet to  more of a Plant based diet. It is very interesting with certain people  when you start to question the establishment with regards to what some  of these big companies want you to be eating when you start to change.  This was something I wanted to do, so maybe this was a blessing not a  bad thing at all. I really believe things happen for a reason and mine  not sure exactly yet, but I know I am on the right track where I am  going.  </p>  <p style=\"\">  \t   Oh, I also lost 18 lbs so far without even trying, which is fantastic!  </p>  <p style=\"\">  \t   Thank you again,<br style=\"\">  \t <strong style=\"\">David Johnson</strong>  </p>  <p style=\"\">  \t <strong style=\"\">Stephanie R., Hawaii</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t   “What Susan Campbell provides is simple: a powerful and effective path to enhanced health and the prevention of many chronic diseases. Her books, documentaries and DVDs will help millions to realize their optimum health potential.”  </p>  <p style=\"\">  \t           -<strong style=\"\"> John Robbins, author of Diet for A New America</strong>  </p>  <p style=\"\">  \t           “I love, love, love your DVD’s!!! I like how you explain things really well, you also demonstrate the easy basic things that are new to lots of people, and it’s very personal with you interacting with the viewer. WELL DONE and congratulations!!!”  </p>  <p style=\"\">  \t           -<strong style=\"\"> Amy Bacheller, M.Ed, NC, CMT</strong>  </p>  <p style=\"\">  \t           “Chef Teton is on a nutrition crusade to help give us Americans some exciting new &amp; tasty food ideas. I highly recommend her wonderful series of DVD’s which are a culmination of two decades of food knowledge.”  </p>  <p style=\"\">  \t           -<strong style=\"\"> GardenChef, Paul F. Wenner, author and founder of the GardenBurger</strong>  </p>  <p style=\"\">  \t           “Chef Teton opened the door of possibility of what to do with oils and salt!! Her food is fabulous!”  </p>  <p style=\"\">  \t           -<strong style=\"\"> Nancy Stroehecker, PR Consultant, LA, CA</strong>  </p>  <p style=\"\">  \t           “As a Colon Hydrotherapist I support people in the process of internal cleansing and detoxifying their bodies through diet. My clients are eager and ready to learn the basics and benefits of raw foods, and return to a more natural way of nourishing their bodies. And  Chef Teton does it all! With simplicity, elegance and flare, her DVD collection is a MUST for regenerating the body and spirit through living food.”  </p>  <p style=\"\">  \t           –<strong style=\"\"> Gyan Bohannon, Certified Colon Therapist, Makawao, Maui, Hawaii</strong>  </p>  <p style=\"\">  \t           “Chef Teton puts a whole new spin on nutritious eating. Not only did she show me how to create scrumptious easy to make meals, she informed me of the benefits of the food being prepared. From EFA rich oils, nuts, grains, fruits, vegetables, and salt, to where to find proteins, omega 3’s, and minerals that will keep my skin radiant and my joints flexible. The methods in Essential Cuisine makes for an easy transition to healthier eating habits with foods that are absolutely delicious.”  </p>  <p style=\"\">  \t <strong style=\"\">– Cheryle Easter, Film Maker, Portland, Oregon</strong>  </p>", 
    "end_date": null, 
    "title": "A Transformational Dietary Makeover for Weight Loss & Health", 
    "price": "50.00", 
    "instructors": "Susan Teton", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/127492_1652_8.jpg", 
    "course_url": "https://www.udemy.com/get-a-hot-body-4-week-dietary-makeover/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-01T01:55:43Z"
}