{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">Curso para:</strong>  </p>  <ul style=\"\">  \t<li>Mejorar tu alimentación y aliviar los síntomas del dolor.</li>  \t<li>Conocer el equilibrio nutricional para hacer frente al dolor.</li>  \t<li>Ganar información sobre nutrición y alimentación general.</li>  \t<li>Incorporar hábitos más saludables frente a la enfermedad.</li>  </ul>  <p>  \t<strong style=\"\">Material:</strong>  </p>  <p>  \t      Consta de 12 lecciones básicas , dividida en dos Secciones:  </p>  <ol style=\"\">  \t<li>Nutrición general.</li>  \t<li>Dietoterapia y alimentación útil frente al dolor.</li>  </ol>  <ul style=\"\">  \t<li>Encontrarás 7 power points editados al detalle y narrados, junto con 5 lecciones escritas y material descargable para tu uso personal: Tabla y dieta.</li>  </ul>  <p>  \t<strong style=\"\">  En unas dos horas</strong> habrás incorporado unos conocimientos <strong style=\"\">que mejoran tu salud facil y rapidamente.  </strong>  </p>  <p>  \t<strong style=\"\">  PORQUE REALIZAR ESTE CURSO:  </strong>  </p>  <ul style=\"\">  \t<li>Para equilibrar tu dieta y aliviar los dolores.</li>  \t<li>Conocer alimentos más perjudiciales y porque , así cuales son los más indicados.</li>  \t<li>Ganar motivación para aplicar los cambios a tu dia a dia.</li>  </ul>  <p>  \t    El dolor puede tener diferentes causas. En este curso trataremos de equilibrar tu dieta para evitar los alimentos más pro-inflamatorios e insanos y fomentar los anti-inflamatorios, para asegurarnos que tu capacidad de autocuración esta al máximo nivel, ganando así vitalidad y energía.  </p>  <p>  \t    Desde este punto de vista tienes que conocer cuales son los mejores hidratos de carbono, como nos afecta la carne, los lácteos, el azúcar blando, etc... cuales son las mejores grasas, cuales son las verduras más apropiadas, la importancia de la hidratación o el sueño, por ponerte solo algunos ejemplos.  </p>  <p>  \t    si quieres ganar salud, entenderás después de este curso como conseguir y mantenerla.  </p>", 
    "end_date": null, 
    "title": "Alimentación útil frente al dolor", 
    "price": "20.00", 
    "instructors": "Pascual Valle", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359642_c5e0_3.jpg", 
    "course_url": "https://www.udemy.com/alimentacion-util-frente-al-dolor/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-30T09:11:30Z"
}