{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong>Are you ready to take control of how fast or how slow you age by  learning the most powerful anti aging strategies on the planet?</strong></em></p><p>In today's world, eating right, getting plenty of sleep, and exercise is not enough.  You need to super charge your body with simple, yet potent protocols, that produce remarkable health and beauty results.</p><p>Once you implement these strategies you too will come to the conclusion that growing old, looking old and feeling old is NOT inevitable.  </p><p>Anti Aging Strategies Doctors Don't Talk About will:</p><ul><li>Reduce inflammation, the #1 cause of aging, by 40% in 30 days</li><li>Naturally boost the body's  production of  Human Growth Hormone to reverse aging</li><li>Teach you how to benefit from the real Fountain of Youth </li><li>Oxygenate your blood to create glowing skin</li><li>Educate you on the forgotten anti aging miracle food</li><li>Prevent sagging skin</li><li>Boost the immune system and your moods</li></ul><p>Yes\n all of this and so much more is covered in my course Anti Aging \nStrategies Doctors Don't Talk About.  Simple, yet powerful protocols that will help you look better,\n feel better, and age less.</p>You will walk away with everything you need to know to radically change the way you age.<ul><br><br></ul><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Anti Aging Strategies Doctors Don't Talk About", 
    "price": "50.00", 
    "instructors": "Cathey Painter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660108_e840_7.jpg", 
    "course_url": "https://www.udemy.com/anti-aging-strategies-doctors-dont-talk-about/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T15:34:43Z"
}