{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>BOOTY BOXING's 8 WEEKS TO A BEAUTIFUL BOOTY AT HOME TRAINING SYSTEM!</p><p>A t Booty Boxing we believe, better yet know that no one should be deprived of a great butt… On their own body that is! We also know that a great derrière, one of the things that we covet most as women and men is within everyone's reach… again, on your own body that is! So whether your butt looks like the flat plains of Utah or the rocky mountains of Colorado, we can help you to build and shape it up, or smooth and tone it down to look like the Gorgeous Apple of New York and the one in your mates eye!</p><p>Just how do we plan on doing this? I'm so glad you asked! With our awesome Butt-Blasting workout fused with Professional Kick-Butt Kickboxing techniques! You will gain confidence to get back in those old jeans or in that new pair you've been eyeing for a long time! Booty Boxing's main focus is….well what else, the BOOTY! Otherwise known as the butt, tush, fanny, buns, heinie, caboose and the more technical term the Gluteus Maximus. Booty Boxing is a totally fun and unique way to shape and tone those Glutes into the Booty you've always wanted but didn't know how to get. Booty Boxing concentrates specific intense hardcore butt and leg toning exercises with our Signature <strong>F•A•S•T </strong>Fat<strong> </strong>Blast Workout <strong> (Functional - Afterburn - Strength - Training),</strong> combined with our killer Boxing and Thai Kickboxing Routines to give you the butt lift you didn't think was possible! Anyone can have great buns with Booty Boxing!</p><p><strong>Benefits To You From Booty Boxing:</strong></p><ul><li>An Awesome New Apple Booty to show off and be envied!</li><li>Burn up to 1300 calories per workout</li><li>Burn Fat for 14 to 36 hours after one workout</li><li>Lose up to 20 to 30lbs &amp; 10% body fat</li><li>Gain lean muscle</li><li>Super stamina and endurance</li><li>Gain better 1-on-1 and overall confidence</li><li>Increased core strength</li><li>Workouts you can do anywhere…Except maybe the bathroom!! </li></ul><p></p><p><strong>What Y</strong><strong>ou Will Get With - The Booty Boxing 8 Weeks To a Beautiful Booty Training System:</strong></p><p>• Three - 50 minute workouts per week for 8 weeks - 24 workouts in total</p><p>• Nutritional guide</p><p>• Boxing &amp; Thai Kickboxing fundamentals video library</p><p>• Boxing &amp; Thai Kickboxing basic moves written guide</p><p>• <strong>Weeks 1 &amp; 2: Booty Boxing Basics</strong></p><p>“Learning how to kick butt!\"</p><p>• <strong>Week 3:</strong><strong> Bootylicious Beginnings</strong></p><p>\"Every Great Booty has a beginning!\"</p><p>• <strong>Week 4:</strong><strong> Bodacious Booty Bonanza</strong></p><p>“You can never have too much of a good thing!\"</p><p>• <strong>Week 5:</strong> <strong>Booty Burpee Blowout</strong></p><p>“Burpees til you Burp!\"</p><p>• <strong>Week 6: </strong><strong>Twerkin Time</strong></p><p>“Twerk til it don't work!\"</p><p>• <strong>Week 7: </strong><strong>Kray Kray Kombos</strong></p><p>“Kombos so Krazy you might need a straightjacket!\"</p><p>• <strong>Week 8:</strong><strong> Champion Booty Boxer</strong></p><p>“The Booty Boxing Championship Belt is up for grabs!!\"</p><p><strong></strong></p><p><strong>LITTLE TO NO EQUIPMENT REQUIRED!</strong></p><p>B•B•B believes that your body is the only equipment that you will ever truly need or have! This Is why our workouts are mainly designed around using your own body weight, however to enhance your workouts you will need to purchase Some equipment such as a <strong>(jump rope, timer, 12-14oz boxing gloves (optional), light to moderate dumbbells, 6-10lbs </strong><strong>medicine ball</strong><strong>)</strong>. The cheapest place to find these items on the Internet will be <strong>Muscle Driver USA </strong>OR <strong>Amazon!</strong> The best timers to use are the apps <strong>“Boxing Timer Pro\"</strong> <strong> \"Interval Timer Pro\" “Best Interval Timer\" &amp; “Seconds\" </strong>which you can find in the Mac App store or Android App store. If you find it difficult to purchase some or all of the items mentioned don't worry we have modified the workouts for what you do have at your home. <strong>NO EXCUSES!!</strong></p>", 
    "end_date": null, 
    "title": "BOOTY BOXING: Burn 1300 Cal Per Workout - Sculpt Your Booty ", 
    "price": "50.00", 
    "instructors": "Kevin Letrel", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464884_5e2b_6.jpg", 
    "course_url": "https://www.udemy.com/bootyboxing/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T10:32:49Z"
}