{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>*Course updated on August 2015</p><p>Did you know that <strong style=\"\">you can lose body weight while you eat delicious food with Paleo Diet?</strong> Do you know how?</p><p>Did you know that people who follow the Paleo Diet don&#039;t need to worry <strong style=\"\">about counting calories?? and that they don&#039;t need to eat every 3 hours ?<strong style=\"\"> </strong></strong>They can eat when they&#039;re hungry, and don&#039;t eat when they are not<strong style=\"\"><strong style=\"\">, </strong></strong>which it won&#039;t make you fall off the diet train.<strong style=\"\"><strong style=\"\"> There are NO RULES on this diet. Sounds crazy, right? </strong></strong>  </p><p>This course will teach you how to make easy, delicious and the most important, healthy recipes GUARANTEED or your money back!</p><p><strong style=\"\">Why the Paleo Diet?</strong></p><p>- Helps you to burn fat and lose weight naturally;</p><p>- Curbs your hunger and appetite so that you feel like you have control of your eating;</p><p>- Helps to control all of your important hormones such as testosterone, estrogen, cortisol;</p><p>- Eliminates many of the common food allergens;</p><p>- Reduces chronic pain;</p><p>- <strong style=\"\"></strong>Helps people to reduce anxiety, depression or other emotional problems;</p><p>- Prevents overweight, obesity, diabetes type II.</p><p><strong style=\"\">Here is what you will learn:</strong></p><p><strong style=\"\"><strong style=\"\"></strong></strong>- You will learn what the Paleo diet is;</p><p>- You will learn what kind of food is/not allowed to eat on this diet;</p><p>- You will learn the benefits of the Paleo diet;</p><p>- You will learn how to cook delicious chicken recipes;</p><p>- You will learn how to cook delicious beef recipes;</p><p>-You will learn how to cook delicious pork recipes;</p><p>- You will learn how to make great paleo desserts;</p><p>- You will learn how to make easy snacks;</p><p>- You will learn how to make breakfasts;</p><p>- You will learn about cooking health, easy and delicious recipes.</p><p><strong style=\"\">Bonuses:</strong></p><p>- You will regularly get new recipes EVERY week.</p><strong style=\"\">And if you are not 100% satisfied, you can receive a full refund within 30 days of your purchase! You have absolutely nothing to lose.</strong>", 
    "end_date": null, 
    "title": "Burn fat and build muscle the easy way with PALEO RECIPES.", 
    "price": "20.00", 
    "instructors": "The Kavegirl", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465264_5750_4.jpg", 
    "course_url": "https://www.udemy.com/burn-fat-and-build-muscle-the-easy-way-with-paleo-recipes/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T20:02:43Z"
}