{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">Si has hecho 1000 dietas</strong> y las abandonas a los pocos días,<strong style=\"\"> este es tu curso</strong>. Si crees que tu objetivo de perder peso es difícil, no tires la toalla. Vamos a encontrar un nuevo camino para llegar a él. </p><p>Este curso está especialmente diseñado para ayudarte a <strong style=\"\">mantener tu motivación durante una dieta de adelgazamiento</strong>. Aprenderás a comprender tus emociones relacionadas con la comida, y a canalizarlas adecuadamente. Te mostraremos además las técnicas más efectivas para que logres controlar lo que comes.<br style=\"\"></p>  <p>  \t        En 40 vídeos de entre 3 y 15 minutos, Miriam Magallón, psicóloga experta en motivación para adelgazar, te dará las pautas para que <strong style=\"\">tu próximo plan de adelgazamiento sea un éxito</strong>, y puedas mantener unos hábitos saludables para siempre. Junto a los videos encontrarás fichas de apoyo en las que podrás ir anotando todo lo que te surja para que continúes trabajando y consigas tus objetivos.  </p>  <p>Este completo curso está dirigido por el equipo de Medicadiet, una prestigiosa empresa española especializada en adelgazamiento y nutrición saludables. Sus más de 9.000 pacientes satisfechos avalan su amplia experiencia en cambio de hábitos nutricionales.<br style=\"\"></p>  <p>  \t        Miriam Magallón, ofrece apoyo psicológico en los centros Medicadiet. Ella ayuda a los pacientes a conseguir sus objetivos con sencillas técnicas para mantenerse motivados durante el plan de adelgazamiento.  </p>", 
    "end_date": null, 
    "title": "Cómo mantener tu Motivación cuando estás a Dieta", 
    "price": "40.00", 
    "instructors": "Medicadiet  -", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/162938_0b52_7.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-controlar-lo-que-comes-cuando-estas-a-dieta/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-12T17:25:02Z"
}