{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Mercury poisoning, a type of metal poisoning and a medical condition</strong>, is caused by exposure to mercury or its compounds. Mercury is a heavy metal. All forms of mercury <strong>produce toxicity or death with less than a gram</strong>. The damage done by elemental mercury is caused by blocking blood vessels. Mercury's zero oxidation state exists as vapor or as liquid metal, its mercurous state exists as inorganic salts, and its mercuric state may form either inorganic salts or organomercury compounds; the three groups vary in effects. Toxic results include <strong>damage to the brain, kidneys and lungs</strong>. Mercury poisoning can result in several diseases, including acrodynia (pink disease), Hunter-Russell syndrome, and Minamata disease.</p><p><strong>Identifying and removing the source of the mercury is crucial.</strong><strong></strong><br></p><p><em>Unfortunately, mercury is in our air and possibly in your teeth.</em></p><p><strong>Some of the toxic effects of mercury are partially or wholly reversible</strong>, either through specific therapy or through natural elimination of the metal after exposure has been discontinued.  Autopsy findings point to a half-life of inorganic mercury in human brains of 27.4 years. Heavy or prolonged exposure can do irreversible damage, in particular in fetuses, infants, and young children.Young's syndrome is believed to be a long-term consequence of early childhood mercury poisoning. Mercuric chloride may cause cancer as it has caused<strong> increases in several types of tumors</strong> in rats and mice, while methyl mercury has <strong>caused kidney tumors</strong> in male rats. The EPA has classified mercuric chloride and methyl mercury as <strong>possible human carcinogens</strong>.<br></p><p><strong>Fluorescent lamps contain mercury</strong> which is released when bulbs are broken. Mercury in bulbs is typically present as either elemental mercury liquid, vapor, or both, since the liquid evaporates at ambient temperature. <strong>When broken indoors, bulbs may emit sufficient mercury vapor to present health concerns</strong>.<br></p><p>In this course, we discuss <strong>the dangers of Mercury</strong>, where you can be exposed to it without knowing and what to do about it.</p><p>Then you learn about the mainstream medical approach and some pro's and con's of their processes.</p><p><strong>What is Nature's answer to Mercury?</strong></p><p>You'll discover:</p><ul><li><strong>Zeolite</strong></li><li>Fulvic Acid</li><li><strong>Cilantro and Chlorella</strong><strong></strong></li><li>The Importance of Sweating</li><li><strong>The Power of Ionic Foot Spa</strong><strong>s</strong></li></ul><p><span></span></p><p>Plus, as a student, you can ask questions and get further clarification and assistance from us!</p><p><strong>Enroll today with confidence because your enrollment is backed by our 30-day, no-questions-asked, money-back guarantee!</strong></p>", 
    "end_date": null, 
    "title": "Deadly Mercury: How to Detox - Prevent Heavy Metal Poisoning", 
    "price": "20.00", 
    "instructors": "Scott Paton, Martin Pytela", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617080_9e47.jpg", 
    "course_url": "https://www.udemy.com/mercury-how-to-detox-heavy-metal-poisoning/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T06:41:16Z"
}