{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Leiden Sie an einer Lebensmittelintoleranz, einer Allergie oder Zöliakie? Könnten Sie verzweifeln angesichts all der leckeren Dinge, die Sie nicht (mehr) essen können oder ärgern Sie sich über die dummen Kommentare, wenn Sie essen gehen? Keine Sorge, das sind ganz normale Gefühle rund um eine Lebensmittelallergie oder Intoleranz. Aber es gibt Wege, wie man damit umgehen kann!</p><p>In diesem Kurs erhalten Sie zuerst einen Überblick über die typischsten negativen Gefühle, die mit Lebensmittelintoleranzen und Allergien einhergehen, zum Beispiel: <br></p><ul><li>Man möchte weinen, weil man sein Lieblingsessen nicht mehr essen darf.</li><li>Man fragt sich: „Warum ich?“</li><li>Man ist entnervt, da man nur dumme Kommentare erntet, anstatt unterstützt wird.</li></ul><p>Nach diesem Teil erhalten Sie eine kurze Einführung in das Thema Achtsamkeit und lernen die 5 Schritte kennen, wie man negative Gefühle erkennt und mit ihnen konstruktiv umgeht.</p><p>Anschließend erhalten Sie Lösungen, Übungen und geführte Meditationen, die Ihnen helfen werden, achtsam mit diesen Gefühlen umzugehen. - was nicht so schwer ist, wie es sich anhört!</p><p>Egal welche Intoleranz oder Allergie Sie haben: dieser Kurs zeigt Ihnen einen einfachen Weg, wie Ihr Leben damit wieder besser wird!<br></p>", 
    "end_date": null, 
    "title": "Der emotionale Umgang mit Lebensmittelallergien/intoleranzen", 
    "price": "20.00", 
    "instructors": "Julia Stüber", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619228_5ba9.jpg", 
    "course_url": "https://www.udemy.com/der-emotionale-umgang-mit-lebensmittelallergien-intoleranzen/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T13:29:49Z"
}