{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Going on a diet in today’s world is hard. You’re busy juggling a lot of things, like work, errands, family, friends, and other extracurricular activities. Dieting is especially hard when you factor in work at the office, constantly being on the go, traveling, on your feet, or just don’t have time. </p>    <p>You try anyway. But, what happens when you can’t get it right? </p>    <p>You go through cycles of being on and off a diet, going through the frustration of not being able to sustain a “diet”. Then we fall into the same routines because we’re working at a desk, need to meet the demands of our job, and just can’t figure out how to eat healthy on a consistent basis. Sometimes we aren’t even aware the food that we’re eating is even unhealthy! </p>    <p>On top of all that, we’re inundated with nutrition and diet information that just isn’t practical for our daily lives.</p>    <p>It seems hard to imagine but conventional dieting, and the advice that comes with it, just doesn’t work. Eating right a majority of the time though does.  </p>    <p>If you’re someone who wants to obtain or maintain low body fat, feel healthy, and be confident with their body but struggles with eating right on a consistent basis because they’re a busy executive, then sign up for my course below. </p><p><strong>You’ll receive . . . </strong></p>    <ul><li>The secret behind why traditional diets fail </li><li>A Personal Daily Diet Template for You To Follow </li><li>Strategies on Sustainable Healthy Eating</li><li>6 Easy, Healthy, and Quick recipes that anyone can make </li><li>Insight into my daily diet routines</li><li>Over 41 lectures and 2 hours of content </li><li>Personal access to me for questions to any part of the course</li></ul><p><strong>Just Don't Take My Word for It ... Here's What Others Had to Say: </strong></p><p><em></em><em>\"We have people join the gym who\n were captains of their division 1 team to those who are beginning a \nworkout routine for the first time.  Regardless of their background, \neveryone is looking for nutrition advice and in today's \nculture especially, we are all busy.  Andrew Kobylarz's Desk Job Diet gives \nthe most sound nutrition advice I have ever seen.  He covers all the main \ntopics and give great tips for those who are short on time<strong>\". </strong></em></p><p><strong><em>-Adam Kant, Founder of Intrepid Gym</em></strong><em><br></em></p><p><em>\"In the daily rat race most of us run around in, trying to break down the\n complicated game of nutrition isn't always number 1 on our to do list. \nLucky for us, this course does it for us. Whether you're the fitness \nprofessional trying to help your clients stay on a healthy track, or a busy executive who wants to make a change and needs some guidance, this is the \nperfect course to do just that.\"</em><strong><em></em></strong></p><p><strong><em>-</em></strong><em><strong>Vanessa Checchio, Founder of Bachata and Barbells </strong></em><span></span></p><p><em>\"Andrew Kobylarz's course is a one stop shop to help establish healthy \nhabits in everyday life. He answers the question we all wonder about, how to stay healthy when you don't have time. I have, and will continue to, recommend this course to my clients and associates working a corporate 9am-5pm (really more like 7am-7pm) schedule.\"</em><em></em></p><p><em><strong>-Rock Tate, Co-Owner of Intrepid Montclair </strong></em><br></p><p><strong><em></em></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "DeskJob Diet ", 
    "price": "50.00", 
    "instructors": "Andrew Kobylarz", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691700_3543_2.jpg", 
    "course_url": "https://www.udemy.com/deskjob-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T03:34:15Z"
}