{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul>  \t<li>Diabetes Healed Naturally is a course about understanding Type II Diabetes and blood-sugar related symptoms and how to heal those symptoms naturally.</li>  \t<li>The terminology will be simple language</li>  \t<li>Slideshows, downloads and links are included in the course. Everything you need to get started on your way.</li>  \t<li>The course is designed to take 6 week, but you can go as quickly or as slowly as you need to.</li>  \t<li>There will be lectures and to-do&#039;s each week which will guide you through the process of healing without going on a deprivation diet or eating foods you don&#039;t like.</li>  \t<li>If you have been diagnosed with Type II Diabetes, Pre-Diabetes, Gestational Diabetes, Have Blood Sugar issues, Hypoglycemia, Depression if you are worried about Alzheimers or Cancer, or if Diabetes run&#039;s in your family - this is the course for you to heal and prevent high/low blood sugar complications.</li>  \t<li>You have the opportunity to connect with me on a LIVE call each week! I will clarify any topics for you and answer any questions. This alone is worth the price of the program.<br>  \t  I&#039;ll also be available to correspond to your questions throughout the program. You will have lots of ways of getting your questions and concerns answered as this program is intended to create a Unique plan for you!</li>  \t<li>I&#039;ll also cheer you on all the way, because I know you can do it!<br>  \tLots of positive reinforcement and a little bit of humor too.</li>  </ul>", 
    "end_date": null, 
    "title": "Diabetes (and Blood Sugar Issues) Healed Naturally", 
    "price": "40.00", 
    "instructors": "Nicole White, CHHC, AADP, RYT, Author of: Upgradeology", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268162_08b5_4.jpg", 
    "course_url": "https://www.udemy.com/diabetes-and-blood-sugar-issues-healed-naturally/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T17:13:10Z"
}