{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Did you know that common household items like cleaners, cookware and soap can pose a serious threat to our health and waistlines?</em>  </p>  <p style=\"\">  \t    Chemicals in common products which we use every day and in our environments are linked to rising rates of diseases including obesity, diabetes, thyroid diseases, behavioral problems, cancers and more.  </p>  <p style=\"\">  \t <em style=\"\">Are you eating healthy, whole foods, counting calories, exercising extensively and still cannot get rid of that stubborn weight?</em>  </p>  <p style=\"\">  \t <em style=\"\">Do you follow all of your doctor&rsquo;s instructions but still cannot get your blood sugar under control?</em>  </p>  <p style=\"\">  \t <em style=\"\">Are you curious about how you can take proactive steps to prevent obesity and diabetes in your future?</em>  </p>  <p style=\"\">  \t   This course is for you! You will learn about the ways in which a variety of factors impact our waistlines and overall health including the many chemicals which are pervasive in our environments.  </p>  <p style=\"\">  \t   In this course you will learn about the pervasive natural of toxic chemicals in our lives and how they impact our health. I will focus especially on the role that chemicals play in obesity and blood sugar balance. This is a huge topic and there is so much important information to learn about this area. The Simple | Pure | Whole<sup style=\"\">TM</sup> Wellness Method for cleansing your environment can help reduce your exposure and enhance your health!  </p>  <p style=\"\">  \t    Through video lectures and handouts you will explore the link between chemicals, obesity and your health.  </p>  <p style=\"\">  \t   I also offer some simple yet powerful steps from my Simple | Pure | Whole<sup style=\"\">TM</sup> Wellness Method for cleansing your environment and obtaining optimal health! You will be empowered with a set of simple yet powerful tools which you can implement in your life to reduce your exposure to toxic chemicals, optimize your weight and maintain great health!  </p>", 
    "end_date": null, 
    "title": "Does this toxicant make me look fat?", 
    "price": "20.00", 
    "instructors": "Jennifer Weinberg, MD, MPH, MBE", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119848_f689_6.jpg", 
    "course_url": "https://www.udemy.com/does-this-toxicant-make-me-look-fat/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T14:51:19Z"
}