{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you ready to lose weight naturally, enjoy better energy, help heal and prevent acute and chronic diseases, optimize your health, and create a healthy relationship with your food? </p><p>The <em>Eat Real Food: How to Eat a Whole-Food, Plant-Based Diet</em> will take you through 14 lessons that will help you create an optimal eating foundation for life. You will walk away knowing what real food is and how to nourish yourself in the best of ways, beyond any nutritional fads or diets. You will be provided with over 65 whole-food, plant-based recipes to practice and apply what you are learning along every step of the way.</p><p><strong>Liberate yourself from counting calories and obsessing about isolated nutrients, and eat based on the intelligent design of whole, plant foods!</strong></p><p>Whether you are interested in reducing animal products, like meat and dairy, or removing them from your diet, or looking to adopt a vegan or vegetarian diet in a nutritionally-sound manner, this course will educate, inspire, and empower you to know how to eat right with confidence.<br></p><p>You will gain skills to know:</p><ul><li>which foods to eat and why for best health, weight, energy, and longevity </li><li>how to optimize your grocery shopping experience</li><li>how to create quick and easy, wholesome, satisfying, and delicious meals </li><li>how to deal with concern foods like wheat, soy, oils, and sweeteners</li><li>how to eat optimally beyond your home and kitchen</li><li>how to make the whole-food, plant-based lifestyle successful and enjoyable</li></ul><p><strong>Gain an abundance of practical tips for optimal nourishment and meal preparation!</strong><br></p><p><strong></strong></p><p>The course will provide you with over 3 hours of content, divided into 3 sections. </p><ul><li>Section 1 will provide you with the basics of whole-food, plant-based eating.</li><li>Section 2 will present what whole plant foods to eat and why, and how to work with them in practical ways.</li><li>Section 3 will get even more practical by presenting the whole-food, plant-based eating lifestyle in action.</li></ul><p>Each of the 14 lectures feature additional resources in the forms of beautiful and handy summary handout sheets, food lists, articles, recipes and/or meal ideas. <br></p>", 
    "end_date": null, 
    "title": "Eat Real Food: How to Eat a Whole-Food, Plant-Based Diet", 
    "price": "30.00", 
    "instructors": "Evita Ochel", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756494_408d.jpg", 
    "course_url": "https://www.udemy.com/whole-food-plant-based-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T22:56:20Z"
}