{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This program isn&#039;t just for the intermediate bodybuilders and athletes who need to know about their proteins and supplements but for any individual who wants to learn about basics of healthful foods.</p><p>This program explains about why various individuals want to exercise and also about basics terms like basal metabolic rate, fat percentage and lean body mass along with details about dietary proteins, carbohydrates and fats. You will get a clear explanation to questions like “why the food we eat causes obesity and ailments like diabetes?” and motivate the students for understanding of foods that aid in fat loss. </p><p>The students must be aware of very basic terms like amino acids, triglycerides, proteins et cetera but there is no requirement to know advanced biochemistry of food to enroll into this course as every lecture commences with objectives and explains basic terminology. The lectures are also useful for advanced professionals as all the fundamental information is summed up in few minutes. </p><p>The lectures are AV presentations and these explain about macronutrients, micronutrients, hydration, bodybuilding supplements including but not limited to proteins, weight gaining stacks, meal replacements and pre-workout supplements. </p><p>The pre-workout and post-workout nutrition profiles have also been differentiated according to the goal of the sportsman. Special emphasis has been given to the safe usage of the supplements and risks involved in using sports supplements have also been highlighted wherever necessary. </p><p>There lectures are divided into smaller videos and the program can be completed in 4 hours. This course will strongly impact the lives of the students interested in achieving muscular growth. Students will also gain insight on components of everyday food items and gain logic to evaluate the bodybuilding supplements. </p><p>The lectures are easy to understand and there is support for answering any kind of queries from the students enrolled in this program. </p>", 
    "end_date": null, 
    "title": "Essentials of Sports Nutrition & Bodybuilding Supplements", 
    "price": "20.00", 
    "instructors": "Mandhir Arora", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530574_b976.jpg", 
    "course_url": "https://www.udemy.com/bodybuilding-articles-nutrition-supplements-course/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T18:23:06Z"
}