{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Due to our complex and busy modern lives, all too many of us have given up on our kitchens and healthy, wholesome homemade meals. In exchange, we see our health, weight, and energy levels failing us, and our quality of life degrading. What if there was something that you could do today that would provide you with one of the most powerful health boosts, in a quick and easy way? Thanks to <em>green smoothies</em>, there is! </p><p>With <em>green smoothies</em>, you can create an ultra-high nutrient-dense meal that is based on fresh, wholesome foods and is naturally low in calories, in less than 5 minutes! Thanks to <em>green smoothies, </em>you can enjoy a quick, easy, and simple way to incorporate whole, plant foods in their natural, raw forms, into your diet, including various fruits, vegetables, nuts, seeds, and superfoods. </p><p><strong></strong><strong>Green smoothies provide a powerful nutritional boost for you to optimize your health, lose weight, and improve your energy levels!</strong><strong></strong><strong></strong><br></p><p>This course will provide you with a comprehensive and practical foundation for knowing why green smoothies are one of the healthiest meal choices and how to create them in the healthiest of ways. You will discover the three, core ingredients needed to make whole-meal green smoothies and how to diversify these in abundant ways. Plus, you will learn twelve essential recipes to create your own delicious green smoothie combinations!<br></p><p>This course is intended for you, if you are interested in:</p><ul><li>Improving your health: healing present or preventing future disease</li><li>Losing weight or maintaining a healthy weight</li><li>Naturally gaining back your energy and vitality</li><li>Improving your diet to focus on more natural or raw, whole, plant foods</li><li>Incorporating more leafy greens into your diet</li><li>Balancing your body via alkalizing food sources</li><li>Getting your kids to eat healthier: more real, whole foods, especially fruits and vegetables</li><li>Learning how to create quick and easy wholesome meals</li><li>Ending the vicious cycle of being \"sick and tired\"</li></ul><p><strong><br></strong></p><p><strong>Learn the multitude of benefits green smoothies provide for your physical, mental, and emotional health and wellbeing! <span></span></strong></p>", 
    "end_date": null, 
    "title": "Essentials of Green Smoothies", 
    "price": "20.00", 
    "instructors": "Evita Ochel", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629672_a888_2.jpg", 
    "course_url": "https://www.udemy.com/green-smoothies/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-03T15:37:47Z"
}