{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t Have you ever worried about, or been diagnosed with, high blood pressure, diabetes or cancer? Have you tried to lose weight, but failed? A healthy diet filled with fruits and vegetables is an excellent weapon for preventing and battling cancer, heart disease and obesity. It is a proven fact: cancer cells have 20 times more receptors for sugar then normal cells. If your diet is full of sugar, cancer will be more likely to get triggered and will grow faster.  </p>  <p>  \t Unfortunately we have been conditioned to rely too heavily on powerful synthetic medicines to cure these ailments. Few think about changing their diets to combat them. But throughout the history of medicine doctors never made this artificial separation between food and medicine. Treating elevated blood pressure, heart disease, cancer and diabetes with synthetic chemical medications is a recent, and largely unsuccessful, trend. You simply cannot prevent disease or restore health by taking pills.  </p>  <p>  \t In this course I teach you how to rethink every dietary choice and its impact on your health. You need this foundational knowledge to evaluate nutritional and medical claims and to design &ndash; and stick to &ndash; the food plan that is best for you.  </p>  <p>  \t <br style=\"\">  \t  The course explains the key role of each nutritional building block for healthy cells. It consists of 10 short lectures, each about 10 to 15 minutes long.  </p>  <p>  \t <br style=\"\">  \t  The first lecture is on proteins. Amino acids are building blocks for proteins. You break down the proteins in your foods into individual amino acids in your digestive tract. These amino acids are then absorbed into your blood stream and sent to all of your cells. The cells then construct from these amino acids the exact proteins they need for cell health.  </p>  <p>  \t The second lecture is about fats. Your body requires fat to function, but there are good and bad dietary fats and you will learn to select the best ones for your health.  </p>  <p>  \t Lecture three is about &ldquo;simple&rdquo; and &ldquo;complex&rdquo; carbohydrates. Carbohydrates are the main source of energy. The body and brain need a steady dose of sugars, but simple carbs can wreak havoc with your health. In this lecture you will learn about the best foods to supply the carbs you need.<br style=\"\">  \t  Your body needs vitamins and minerals to get all your other nutrients to where they can do their jobs in your cells.  </p>  <p>  \t In lecture four you will learn about the best fruits and vegetables you can select as sources of vitamins, minerals, fibers and sugar.  </p>  <p>  \t Every few months a new diet makes a big splash in the media, promising instant health and weight reduction. Most of these diets are hazardous to your health, and diets cannot provide long-term weight reduction. In lecture five you will learn about the pros and cons of today&rsquo;s most popular diets, and how you can design your own eating plan to maintain optimum health and body weight.  </p>  <p>  \t Lecture six is about your &ldquo;healthy plate&rdquo;. It explains exactly what you should and should not put on your plate &ndash; and the right portion sizes - to make sure that you maximize your nutrients consumption to keep your body healthy and to restore health when struck with cancer, heart disease and other ailments.  </p>  <p>  \t Lectures 7, 8 and 9 are about structure and function of the digestive tract and it importance in overall health of your body and its cells. You will learn how a malfunctioning digestive tract will prevent absorption of nutrients, starve your cells, lead to disease, and prevent recovery.  </p>  <p>  \t Finally, in lecture 10 you will learn what happens to all the nutrients in your food once they get absorbed from the digestive tract into your blood stream. The emphasis will be on how you use these nutrients to build, protect, restore and repair your cellular structures to heal yourself and keep yourself in optimum health.  </p>  <p>  \t Some foods are not discussed in my lectures. For example: cookies, cakes, chips or French fries are not considered food, because they have so few nutrients and so much sugar that they can make you sick and keep you sick - you will be much better without them. Also, there are no canned foods on my &ldquo;healthy plate&rdquo;. Food from cans and jars has few vitamins, but is full of preservatives and coloring agents that may contribute to coronary disease, cancer. Long term health and vitality are out of questions if cookies, candy, ice cream and canned vegetables/fruit are part of your regular diet.  </p>  <p>  \t I hope to see you in my course. Here&rsquo;s to your health.  </p>", 
    "end_date": null, 
    "title": "Food is Your Best Medicine", 
    "price": "30.00", 
    "instructors": "Veronica Waks M.D., N.D.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71690_2f8f_5.jpg", 
    "course_url": "https://www.udemy.com/food-is-your-best-medicine/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-30T17:04:15Z"
}