{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Taught by a mother and Registered Dietitian Nutritionist who has had 2 pregnancies with gestational diabetes and other complications - and sold thousands of books on Amazon about this very topic! Now I want to share with you!</p><p>You are pregnant and now you are worried about gestational diabetes. Learning more is essential for all women today.</p><p>It's also essential to learn the ins and outs so you are not afraid but confident.</p><p>It's actually quite simple - there's a few simple, easy things to do .. but - and let's be honest here - your doctor and other sites on the internet don't really do a good job in explaining things in detail, do they?</p><p>I spent the last 18 years as a Registered Dietitian working through the testing, tweaking, re-testing, improving and eventually succeeding at managing diabetes .. and have now put this course together for you - to which you have full lifetime access, including all the updates, for free.</p><p>I \"take you by the hand\" and \"behind the scenes\" and show you everything, explaining it in simple \"no jargon allowed\" videos and support lectures.</p><p>You will need to be ready to change your diet to adjust the amount of calories and foods that you eat.  This course will show you what you need to change, and you can decide how much and based on the blood glucose changes you can make further changes.  You also will need to be able to multiply / divide numbers so you can calculate the amounts of carbohydrates, calories, proteins, and fats that you need for your diet.  </p><p>See exactly how you can be successful at overcoming gestational diabetes with a few tweaks and changes to your diet. Meal planning is key and so is taking insulin and both are discussed in detail in this course.</p><p>No outlay, nothing to buy or pay for.  No additional materials are required for the course.  </p><p>Nothing is left out - you see everything</p><p>... and my help and assistance to Udemy students is without question</p><p>+++++++++++++++++++++++++++++</p><p>And the unconditional, Udemy backed, 30 day money-back guarantee is not just any old guarantee, it's my personal promise to you that you will succeed ... I'm here to help.</p>", 
    "end_date": null, 
    "title": "Gestational Diabetes: Guide For A Healthy Mom & Baby", 
    "price": "50.00", 
    "instructors": "Mrs. Mathea Ford", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587828_fcb5_2.jpg", 
    "course_url": "https://www.udemy.com/gestational-diabetes-guide-for-a-healthy-mom-baby/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T21:15:30Z"
}