{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t                      Gluten.. what is it anyway? This pesky protein found in wheat, has been implicated in many health problems. Modern Wheat is a Brand Spankin&#039; New food that our bodies can&#039;t process very well (some have more trouble than others).  </p>  <p style=\"\">  \t                      This is Part One of the &quot;Get Out of the Gluten Glut&quot; series of courses. It covers the hows and whys of gluten&#039;s damaging effect on the body. (Please check out <a href=\"http://www.udemy.com/glutenglut2\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Part Two</a> &amp; <a href=\"http://www.udemy.com/glutenglut3\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Part Three</a>, as well!)  </p>  <p style=\"\">  \t             10 lectures, most fewer than 5 minutes long, answer the following questions, and more! (Each lecture is accompanied by a fill-in-the-blank worksheet that can be completed during or after the lecture.)  </p>  <ul style=\"\">  \t<li style=\"\">What is gluten?</li>  \t<li style=\"\">If wheat is so bad, why hasn&#039;t it killed us by now?</li>  \t<li style=\"\">How did gluten become such a problem?</li>  \t<li style=\"\">What is gluten doing to people?</li>  \t<li style=\"\">How is gluten causing weight gain &amp; preventing weight loss?</li>  \t<li style=\"\">How does gluten cause inflammation?</li>  \t<li style=\"\">How does wheat affect blood sugar?</li>  \t<li style=\"\">How does gluten cause autoimmune disease? (Much more detail on this in <a href=\"http://www.udemy.com/glutenglut3\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Part Three</a>)</li>  </ul>  <p style=\"\">  \t <strong style=\"\">       &gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;</strong>  </p>  <p style=\"\">  \t                       The new &quot;trend&quot; of gluten-free eating is not a trend at all! It&#039;s an important precaution against developing a chronic health condition or dangerous disease.  </p>  <p style=\"\">  \t                      Damage done by gluten can happen slowly over time so it might be confused with &ldquo;normal aging&rdquo;. But, the damage can be stopped... and can often be reversed!  </p>  <p style=\"\">  \t                 The material is not overly scientific- just enough to get the gist. And I tried to make it fun with animations and strong visuals.  </p>  <p style=\"\">  \t                      The two well-known conditions caused by wheat, Gluten Intolerance and Celiac Disease, have a frustratingly enormous variety of potential symptoms!  </p>  <p style=\"\">  \t <strong style=\"\">          &gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;</strong>  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">          What Are the Students Saying?</em></strong>  </p>  <ul style=\"\">  \t<li style=\"\">&quot;<strong style=\"\">So easy to follow! </strong>I love Anne Buzzelli&#039;s way of instructing. She makes everything very easy to visualize and <strong style=\"\">makes me laugh</strong>. I <strong style=\"\">had so much fun</strong> learning about gluten: how often can you say that?&quot; ~JB</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;<strong style=\"\">Great presentation</strong>: I was so impressed by this course, primarily because it presented the science in an <strong style=\"\">easy to understand way</strong> but did not talk down to the viewer. It was a <strong style=\"\">high quality production</strong> and very <strong style=\"\">enjoyable to watch</strong>. The <strong style=\"\">length was perfect</strong>, I think because it was so well organized. <strong style=\"\">An hour well spent in search of better health</strong>.&rdquo; ~AC</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;Explains why gluten can be dangerous: I found the information to be <strong style=\"\">enlightening</strong>. It was <strong style=\"\">concise</strong>, and it explained to me why Gluten or Gliadin could be a contributing factor to my health woes. I don&#039;t think it&#039;s too much to ask of us that are suffering from major health problems to go gluten free. <strong style=\"\">Is your health not worth that much?</strong>&rdquo; ~LH</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;<strong style=\"\">Science made simple!</strong>: Since going gluten free is trendy these days, up your cocktail party ante with <strong style=\"\">REAL SCIENTIFIC knowledge</strong> about why you don&#039;t indulge gluten. After watching this series, you will have your reasons - less likely to die an inflamed death, for example. Anne Buzzelli doesn&#039;t mince words but <strong style=\"\">eases you into the shocking truth</strong> with <strong style=\"\">clever graphics</strong> and <strong style=\"\">saucy time travel</strong>. I highly recommend this series for the gluten-curious.&rdquo; ~K</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;Entertaining and Informative! <strong style=\"\">Worth taking the course</strong>: The instructor, Anne, presents the adverse effect of modern wheat in a unique way that captures your attention. The <strong style=\"\">music, videos and cool animations are amazing as well</strong>! These lectures are <strong style=\"\">not boring</strong> like traditional ppt slideshows. I was shocked to find that the food that I consider healthy, like wholegrain bread, are killing me! Thanks Anne for sharing your knowledge and making us aware of the side-effects of gluten.&rdquo; ~AP</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;Excellent course!: Anne provides a very <strong style=\"\">thorough yet entertaining</strong> history of the wheat - from the beginning when hunter gatherers started consuming wheat to our current food system. This course also does an excellent job explaining the negative health effects of today&#039;s wheat. This is a <strong style=\"\">great course for healthcare professionals as well as anyone trying to get healthy!</strong>&rdquo; ~MW</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;<strong style=\"\">Informative and fun</strong>!: This course is <strong style=\"\">fantastic, evidence based, and interesting</strong>! She even <strong style=\"\">held my 5-year-old&#039;s attention</strong>! :)&rdquo; ~P</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;Nice efforts: I find this course <strong style=\"\">interesting</strong>. Some of the terms were bit technical to me but to summarize, genetically modified food have negative impact on human body and require more research to find alternative technology to overcome negative impact on human body.&rdquo; ~VJ</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;Awesome: An <strong style=\"\">excellent, easy to understand</strong>, explanation of Wheat and its dangers.&rdquo; ~PT</li>  </ul>  <p style=\"\">  \t <strong style=\"\">  &gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;~~&gt;&lt;</strong>  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">A full-length movie version of this video ran on YouTube for a short time and viewers had some great things to say!:</strong></em>  </p>  <ul style=\"\">  \t<li style=\"\">&ldquo;I was <strong style=\"\">amazed at how much I learned from a short video</strong>! I&#039;ve definitely been eating too much wheat in my diet and this video shed a lot of light on why so many parts of my body feel so inflamed!&rdquo; ~A in Pittsburgh</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&quot;The video does an <strong style=\"\">excellent job of teaching</strong>, which is the point! As a former teacher, I can really appreciate that. And I love the funny parts; <strong style=\"\">it kept me giggling</strong>.&quot; ~ K in Staunton</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;This video is <strong style=\"\">so informative in a playful, creative and thoroughly entertaining style</strong>! <strong style=\"\">Absolutely charming</strong>. My knowledge on wheat &amp; gluten dangers is so much clearer now. Thank you for creating this highly informative video!&rdquo; ~M in Beverly Hills</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;<strong style=\"\">Great video</strong>! You explained the issues in a <strong style=\"\">very clear and entertaining</strong> manner.&rdquo; ~ C in Colorado Springs</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&ldquo;<strong style=\"\">I wish your wheat video could be played in every primary school, middle school, high school and university!</strong>&rdquo; ~T in Bermuda</li>  </ul>  <ul style=\"\">  \t<li style=\"\">&quot;I LOVE your video! You have created an <strong style=\"\">easy to follow and entertaining</strong> presentation on the dangers of wheat! I am 9 months grain free (mostly Paleo) and I too love the Wheat Belly book! You put into <strong style=\"\">simple English</strong> what I have been trying to explain to my friends and family. I am sharing it with everyone I know. Thank you!&quot; ~J from Upland</li>  </ul>", 
    "end_date": null, 
    "title": "Get Out of the Gluten Glut (Part 1): Get to Know Gluten", 
    "price": "20.00", 
    "instructors": "Anne Buzzelli MS RD", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37160_ea44_12.jpg", 
    "course_url": "https://www.udemy.com/glutenglut/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-20T19:45:22Z"
}