{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    Green leafy vegetables like <strong style=\"\">arugula, cabbage, chard, chicory, collard greens, kale, lettuce, mustard greens and spinach</strong>, are some of the most concentrated sources of natural nutrition! They are great sources of life-promoting energy, valuable vitamins and minerals and cleansing fiber.  </p>  <p style=\"\">  \t      Packed with information and practical tools, this interactive workshop  and ecourse is a great way to learn more about the importance and value of leafy greens and incorporate some delicious new ways to enjoy these vegetables in your life! Whether you are just starting to embrace the goodness of kale and arugula or have been enjoying the vibrancy of dandelion and bok choy for years, this workshop will inform and inspire you to incorporate more of these amazing real foods!  </p>  <p style=\"\">  \t      This workshop will introduce you to the <strong style=\"\">facts and science about leafy green vegetables and provide simple and nutritious recipe ideas</strong> to help you easily incorporate these nutritional powerhouses into your diet. You will <strong style=\"\">discover vibrant health through knowledge and flavorful real food recipes</strong>!  </p>  <p style=\"\">  \t      You will dive into a world of <strong style=\"\">nutrients, vibrancy and energy</strong> that will change the way you eat forever as well as the way you look and feel inside and out! Incorporating leafy greens into your diet is one of the easiest and most effective ways to:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">balance your weight</strong></li>  \t<li style=\"\"><strong style=\"\">amp up your energy</strong></li>  \t<li style=\"\"><strong style=\"\">support immune health</strong></li>  \t<li style=\"\"><strong style=\"\">heal and rebalance the body</strong></li>  \t<li style=\"\"><strong style=\"\">increase vibrancy</strong></li>  \t<li style=\"\"><strong style=\"\">get clearer skin</strong></li>  \t<li style=\"\"><strong style=\"\">improve digestion</strong></li>  \t<li style=\"\"><strong style=\"\">prevent chronic disease</strong></li>  \t<li style=\"\"><strong style=\"\">decrease brain fog</strong></li>  \t<li style=\"\"><strong style=\"\">have more stable moods</strong></li>  \t<li style=\"\"><strong style=\"\">enhance your repertoire of healthy real food meals and snacks</strong></li>  </ul>  <p style=\"\">  \t<strong style=\"\">                                                                                                  ... and so much more!</strong>  </p>  <p style=\"\">  \t      This extraordinary workshop includes a <strong style=\"\">wealth of information, instruction and tools</strong>. You will find be introduced to greens in all of their glory and learn about the rich nutrients, variety and vitality that they offer.  </p>  <p style=\"\">  \t <strong style=\"\">This comprehensive workshop includes:</strong>  </p>  <p style=\"\">  \t    A <strong style=\"\">Workshop Guide</strong> which provides my proven Simple | pure |WholeTM Wellness Method for getting the most out of a wellness journey! This <strong style=\"\">interactive workbook and step-by-step guide</strong> will help you <strong style=\"\">establish your goals and intentions</strong> for using this workshop to ensure that you gain the greatest and most appropriate benefits for you!  </p>  <p style=\"\">  \t    A comprehensive <strong style=\"\">Glorious Greens for Great Health book</strong>. This book will teach you everything you need to know about leafy greens in <strong style=\"\">over 35 beautiful pages</strong>! Presented in an <strong style=\"\">easy-to-understand yet scientifically-based manner</strong>, you will gain knowledge about a wide variety of leafy greens and how they support and enhance your health! You will explore the many <strong style=\"\">phytonutrients</strong> in these vegetables and how they play a <strong style=\"\">role in building our bodies, healing and preventing disease</strong>.  </p>  <p style=\"\">  \t    A <strong style=\"\">BONUS guide</strong> with gorgeous and informative <strong style=\"\">fact sheets</strong> about a wide sampling of a dozen of the most popular and common Glorious Greens! These beautiful guides to each leafy green provide <strong style=\"\">almost 40 pages of</strong> <strong style=\"\">information on key nutrients and their role in our health, recipe tips, nutrition facts and more</strong>!  </p>  <p style=\"\">  \t    Your <strong style=\"\">Glorious Greens Cookbook and Recipe Guide</strong>! This valuable and fun resource provides guidance in <strong style=\"\">storing, preparing and cooking with a variety of leafy greens</strong>. You will learn about <strong style=\"\">basic cooking methods</strong> as well as <strong style=\"\">creative and delicious ways to incorporate greens into your meals and snacks</strong>. You will find almost <strong style=\"\">30 creative, healthy, balanced real-food recipes</strong> for inspiring you to use greens in your life! Included are recipes for <strong style=\"\">beverages and smoothies, salads, dressings, dips, sauces, soups, side dishes, entrees and even sweet treats and desserts</strong>! All my recipes are gluten-free, dairy-free, vegan-friendly, and made with only whole food ingredients!  </p>  <p style=\"\">  \t     Click <a href=\"http://healthcoach.integrativenutrition.com/sites/default/files/styles/large/public/Happy%20Digestion%20Saladc.png\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">here </a>for a <strong style=\"\">sample recipe</strong>!  </p>  <p style=\"\">  \t    An <strong style=\"\">Audio &amp; Video Seminar: An Introduction to Glorious Greens </strong>which introduces you to Glorious Greens and how these nutritious powerhouses can really benefit our health! The convenient mp4 format allows you to download this seminar and take it with you for learning on the go!  </p>  <p style=\"\">  \t    A <strong style=\"\">BONUS Audio &amp; Video Seminar: Sneaking in More Glorious Greens! </strong>This audio class provides you will easy and creative ways to incorporate more Glorious Greens into your life! The convenient mp3 format allows you to download this seminar and take it with you for learning on the go!  </p>  <p style=\"\">  \t    Get ready to build your knowledge of real food nutrition and learn creative new ways to nourish your body and build your health! As you begin to listen to your inner knowledge and your body’s true needs, you will naturally fill it with <strong style=\"\">Simple | Pure | Whole<sup style=\"\">TM </sup></strong>foods such as greens that truly nourish you!  </p>", 
    "end_date": null, 
    "title": "Glorious Greens for Great Health Workshop", 
    "price": "50.00", 
    "instructors": "Jennifer Weinberg, MD, MPH, MBE", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208712_c9a6_2.jpg", 
    "course_url": "https://www.udemy.com/glorious-greens/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-01T14:06:21Z"
}