{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t    On-Site Culinary Solution’s presentation of &quot;Gluten-Free Creations All Spiced Up!&quot; will be a series of lectures containing videos, slides, recipes, and cooking demonstrations that can also be downloaded for future reference.  </p>  <p style=\"\">  \t    We will be presenting items for participants to understand the principles of Gluten-Free cooking and how they should taste. Each lecture will have narrated, easy to grasp terminology, for all levels of chefs!  </p>  <p style=\"\">  \t    Participants are invited to share their experiences using a variety of grains and legumes as an alternate to gluten dishes and discuss regional/international cuisine standards that are gluten-free. Chef Jud Flynn will also be sharing three cooking demonstrations for video oriented learning. These demonstrations feature Asian oriented dishes, using a variety of spices, many of which a casual chef may not have even heard of prior to taking this course!  </p>  <p style=\"\">  \t    Many topics will be covered in this course: the science behind gluten, allowable and avoidable grains, reading food labels, gluten intolerance and how to overcome, Celiac Disease, what exactly living gluten free consists of, and how to cook delicious global gluten free cuisine. A recipe cookbook, with 29 recipes is also included on the last section of the course, as well as printouts for easy to reference points for your kitchen.  </p>  <p style=\"\">  \t    What separates this course from any other is the continuing educational hours obtained upon completion. Through the American Culinary Federation and the Academy of Nutrition and Dietetics, we are proud to offer 8 combined CEH’s to all who complete and wish to have documentation.  </p>  <p style=\"\">  \t    By the end of this course, you should have a complete understanding of gluten and how to avoid it in your diet. The gluten free lifestyle is not a fad – it’s here to stay! We hope you enjoy your learning experience, and thank you for choosing On Site Culinary for your professional development in the kitchen!  </p>", 
    "end_date": null, 
    "title": "Gluten Free Creations, All Spiced Up! © Certification", 
    "price": "25.00", 
    "instructors": "Jud Flynn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288656_498e_2.jpg", 
    "course_url": "https://www.udemy.com/gluten-free-creations-all-spiced-up/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-27T03:07:42Z"
}