{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>If you’re a whole foods cook that loves making new culinary discoveries, or simply a person who aspires to eat healthy meals prepared from whole foods, you’ll marvel at the way you can turn ancient grains such as quinoa, millet, teff, amaranth, basmati rice and wild rice, into gourmet dining pleasures. Whole, organically raised grains, when prepared in the traditional way, as our ancestors prepared them, offer to be healthful additions to many diets. They are a great source of fiber, minerals, nutrients, and energy-giving carbohydrates that keep your human ecology system in good working order. And, by adding whole grains to your lunch and dinner plates (instead of making meat the centerpiece of your meals), you can save and protect dwindling (and polluted) planetary resources such as land and water. You’ll also be doing your part to reduce global climate change, according to United Nations and the University of Chicago who researched this issue and reported on it.</p><p>Here’s a sample of the 96 savory recipes featured in my book that I show you how to make and serve in this course. The recipes are suitable for everyday dining as well as special occasions: <br></p><ol><li>Mexican Garden Fiesta Millet Dish</li><li>Country Herb (Dill) Millet Salad (with Lemon Dressing &amp; Toasted Walnuts)</li><li>Native American Millet Stuffing (with Corn, Black Beans, and Hot Sauce)</li><li>Savory Millet Stuffed Cabbage Rolls with Red Sauce</li><li>Quinoa Parmesan with Garlicky Green Beans and Tomatoes</li><li>Rustic Cheesy Quinoa Artichoke Bake (Not in Book)</li><li>Quinoa Tabouli Salad (with Lemon Garlic Yogurt Dressing &amp; Sun Sprouts)</li><li>Festive Moroccan Quinoa Party Salad (Not in book)</li><li>Northwoods Wild Rice with Craisins and Pecans</li><li>Savory, Melt in Your Mouth Wild Rice</li><li>Cranapple Waldorf Wild Rice Salad (with Pineapple Kefir Dressing)</li><li>Autumn Harvest Veggie Loaf</li><li>Sesame Buttered Brown Rice &amp; Vegetable Dish</li><li>Spanish Garden Rice with Tempeh ‘Bacon’</li><li>Curried Eggplant Basmati Rice</li><li>Himalayan Rice Dish with Ginger Curry Dal</li><li>Macaroni Spelt (Spelt with Cheddar Cheese Flavored Sauce)</li><li>Potato Salad Spelt</li><li>Eggplant Amaranth Bake</li><li>Veggie Stuffed Squash with Curry Butter Teff Sauce</li></ol><p>In this special package, you’ll get:</p><ul><li><strong>“Deep Dish Self-Inner View”</strong> (is a mini book) in which I interview myself about my book and recipes. You’ll get new insights about the origins of whole ancient grains (their legend and lore) and learn how grain consumption can lessen your ecological footprint. I’ll also share with you, the reason for soaking grains before cooking them. And, I’ll share stories from my own culinary life which reflect what it means, to cook with the right side of your brain! </li><li><strong>“Cookbook Chat”</strong> (15-20 min. video) from my backyard, in which I provide an overview of my book’s content and share inspiration for preparing my recipes.</li><li><strong>Gourmet Grains cookbook in a downloadable PDF format.</strong> <em> This is offered as a complete book and features:</em> <ul><li>The Aromatic Stovetop with grain cooking instructions, plus cookware and kitchen utensil tips.</li><li>Pantry of Splendor featuring condiments, seasonings, garnishes, sauces, nut butter, ghee, toasted nuts and seeds, sprouts, cheeses, vegetables, meatless ingredients, spices, herbs, and fortifiers, with a summary of their nutritional benefits and culinary uses.</li><li>20 Recipe demos from “Candia’s Kitchen”, to get you started making some of my delicious four-season recipe faves!</li><li>8 Tabletop TUTORS™ colorful infographics/teaching posters, including: </li></ul></li></ul><p style=\"\">1) Turning Cooking Into an Effort of the Soul<br>2) Choosing Eco-Friendly Cookware<br>3) Eating with the Seasons, -A Way to Stay Balanced<br>4) Butter for Your Bones, Your Brain, and Your Gut<br>5) Where Do the Fruits and Vegetables You Eat Come From<br>6) Why To Eat Salt<br>7) Processed Vegetable Oils: The Unappetizing Truth<br>8) 10 Ecological Reasons to Eat One Vegetarian Meal A Week</p>", 
    "end_date": null, 
    "title": "Gourmet Grains eBook Package: 96 Savory Recipes & 20 Videos!", 
    "price": "20.00", 
    "instructors": "Candia Lea Cole", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659812_35be_3.jpg", 
    "course_url": "https://www.udemy.com/gourmet-grains-ebook-package-96-savory-recipes-20-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T07:44:44Z"
}