{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Why Your Body Needs A Green Juice Now<br style=\"\">  \t</strong><br style=\"\">  \t    Do you want to get the fat and the waste OUT of your body the natural way?  </p>  <p style=\"\">  \t                    Do you want to feel ENERGIZED using raw, clean, green burning fuel?  </p>  <p style=\"\">  \t                    Do you want to END the cycles of fatigue, indigestion, and malnutrition?  </p>  <p style=\"\">  \t                    If you said YES to the above , then YOU can benefit from this juicing clinic.  </p>  <p style=\"\">  \t                    Green juicing pumps essential nutrients directly INTO your body and gets OUT the fat and the toxic waste that your body has been storing for a long time. <br style=\"\">  \t<br style=\"\">  \t    The result is an Oh My Gosh! clean and new feeling. Or in more detail, you feel renewed, lose weight, and get filled with boundless energy.  </p>  <p style=\"\">  \t                    You know the squeaky clean feeling after a nice long shower? Juicing does that for your insides. Imagine if you were to cleanse and rejuvenate the inside of your body the SAME way you do the outside!  </p>  <p style=\"\">  \t                    Juicing works and I am here to tell you the REALLY good stuff that works miracles of goodness on your body. No other type of nutrition, diet, exercise program, or eating style even comes close to the direct and nearly immediate benefits of green juicing.  </p>  <p style=\"\">  \t                    The best part: Juicing is the MOST natural way you can heal and reboot your body, lose weight and detoxify your organs for a fresh start.  </p>  <p style=\"\">  \t                    Now the green juice clinic is right for YOU if you nod YES to any or all of the following.  </p>  <ul style=\"\">  \t<li style=\"\">You are sick and tired of “Diet of the Day”, pills and supplements and what have you!</li>  \t<li style=\"\">You know something is missing in your daily foods but you don’t know what!</li>  \t<li style=\"\">You are eating your veggies and fruits but your body is still starving for real nutrition!</li>  \t<li style=\"\">You feel you are doing the right things for your health but you don’t see results yet!</li>  \t<li style=\"\">You have had some recent “health issues” and want to take better care of yourself!</li>  \t<li style=\"\">You want to return to holistic, natural way of taking care of your body!</li>  \t<li style=\"\">You are a tad apprehensive about the whole “juicing” thing but wanna find out more!</li>  \t<li style=\"\">You watched “Fat, Sick and Nearly Dead” and don’t want that to happen to you!<br style=\"\">  \t</li>  </ul>  <p style=\"\">  \t               Now be honest with yourself: Did you nod yes to any of list above?  </p>  <p style=\"\">  \t<strong style=\"\">What Exactly Do You Get in the Green Juicing Intensive Clinic?</strong>  </p>  <p style=\"\">  \t                    You will learn how to build the habit of green juicing in your daily routine here. You will get lifetime access to 21 comprehensive juicing lessons, a ton of juice recipes and an amazingly supportive and fun juicing community.  </p>  <p style=\"\">  \t              Here’s the full scoop:  </p>  <p style=\"\">  \t<strong style=\"\">      Lifetime Membership Access:</strong> You will have lifetime access to the 21 lessons, tons of juicing recipes, inspiring messages to keep you juicing, a copy of my Comprehensive Green Juicing book, a Juice Fast Guide, and the community support to keep you going strong.  </p>  <p style=\"\">  \t<strong style=\"\">      Video Lessons:</strong> You will have 7 video lessons to watch and do homework for. Here, I show you my fun secrets, top tips and tricks on making green juices, my systems and tools in the kitchen, and we even go shopping together at the Farmer’s Market!  </p>  <p style=\"\">  \t<strong style=\"\">      Audio Lessons: </strong>You will have 7 audio lessons to play on the go where I teach you more in-depth topics around green juicing and long-term commitment, and give you tools and systems to keep you going.  </p>  <p style=\"\">  \t<strong style=\"\">      Text Lessons: </strong>You will have 7 blog-post format lessons with smart and creative Green Juicing recipes, ideas and ways to integrate it into your life, travels, work, etc, and so much more!  </p>  <p style=\"\">  \t<strong style=\"\">Access to Private Facebook Support Group:</strong> You will get access to the private Facebook group where we discuss juicing, and pair up with juicing buddies for fasting and detoxing. Plus we answer all your questions. It’s like a live 24x7 Juice Support Center.  </p>  <p style=\"\">  \t<strong style=\"\">Over 100 Juicing Recipes:</strong> The Juicing Recipes Corner with large number of recipes and I update this section with new recipes so you never have to try the same juice recipe twice!  </p>  <p style=\"\">  \t<strong style=\"\">Don&#039;t know if the clinic is worth it?</strong>  </p>  <p style=\"\">  \t                    Well, let me ask you this: How much is your health worth to you? Forget the money for a minute, what about the time and effort it takes to take care of yourself even when you just get a cold? Do you know that the illnesses and discomforts are reduced drastically by those who juice regularly.  </p>  <p style=\"\">  \t                    Do you know the hours and hours of time that you are going to save by NOT going to the doctor’s office, NOT going to the pharmacy to get cough medicine, NOT staying in bed because you will be getting healthier and stronger.  </p>  <p style=\"\">  \t                    Then think about the money, the healthcare cost of going to a doctor for a visit, buying medicine, and maybe involving others to take care of you at their expense.  </p>  <p style=\"\">  \t                    Now if skipping all of that pain and frustration and money lost – not to mention the euphoria you get from juicing – is not even worth $97 to you, then, you know what, the clinic may not be for you after all.  </p>  <p style=\"\">  \t                    The juicing clinic is for you if you want to invest in your health and stay AND feel young and healthy as long as possible. That’s PRICELESS to me and those in the clinic. What is it worth to you? You decide!  </p>  <p style=\"\">  \t<strong style=\"\"> Who is teaching the clinic?</strong>  </p>  <p style=\"\">  \t          Hi, my name is Farnoosh. I left a long corporate job to start my own company so I can live the lifestyle of freedom, health, healing and a lot of juicing! You can find out more about me at Prolific Living..  </p>  <p style=\"\">  \t          Today, I have the immense pleasure of writing books on juicing and offering you an invitation to the Green Juicing Intensive Clinic.  </p>  <p style=\"\">  \t          I had my first juice in 2007 and it changed my body (and my life!)  </p>  <p style=\"\">  \t          The transformations to my body, mind and general happiness: remarkable, so I kept doing it. Five years later, I am still juicing regularly, fasting a few times a year, writing books and doing interviews about green juicing and spending time learning together with our great juicing community here.  </p>  <p style=\"\">  \t          In January 2012, I wrote this little best-selling juicing book: Your Comprehensive Green Juicing Guide- to my surprise, it has already sold well over five thousand copies on Amazon – and you, my dear, get the entire guide FREE when you join the clinic.  </p>  <p style=\"\">  \t          And in March 2013 my latest book, the Healthy Juicer’s Bible, came out in bookstores across the country. The book sold out of its first printing in less than a month. The clinic is where we put the book to practical application in life, so join us!  </p>  <p style=\"\">  \t          Ready to get started? I will show you just about everything you need to know and make sure you have a grand time in your green juicing journey!  </p>  <p style=\"\">  \t<strong style=\"\"> Still not sure?</strong>  </p>  <p style=\"\">  \t                    I can only tell you that if you neglect your body, you will regret it. That’s all. Juicing has done miracles for me, for every single member in this juicing clinic and you are no different. Juicing will do miracles for you too. You decide what that’s worth to you.  </p>  <p style=\"\">  \t                    But no worry if you are not ready for the clinic. My only warning is that you’re gonna miss out on this amazing price and the <strong style=\"\">LIFETIME MEMBERSHIP</strong> deal if you don’t join now.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">P.S.</strong>  </p>  <p style=\"\">  \t                    I know this is a tremendous step into for you to take, especially if you are brand new to green juicing. Don’t worry. You will be in good hands AND you will be part of a supportive loving community.  </p>  <p style=\"\">  \t                    Your body will LOVE you even if you juice a few times and just soak up the lessons and the love.  </p>  <p style=\"\">  \t                    Just in case you have reservations, I want you to know my husband, who used to swear he’d never drink a green juice for as long as he lives, is now begging me to make him a “Mean Green” in the mornings. Seriously, he’s a new person.  </p>  <p style=\"\">  \t                    Give juicing a serious go! You won’t regret it.  </p>  <p style=\"\">  \t                    This clinic is for the Juicing Enthusiast in You. I know it’s in there and I want to show you the same thing so you believe it too.  </p>  <p style=\"\">  \t                    See you in the clinic!  </p>", 
    "end_date": null, 
    "title": "Green Juicing Clinic: Detox, Cleanse, Feel Great", 
    "price": "35.00", 
    "instructors": "Farnoosh Brock", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132006_003d_5.jpg", 
    "course_url": "https://www.udemy.com/juiceclinic/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-10T19:44:52Z"
}