{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Very positive guide in dealing with your personal health and treating cancer via alternative method which everyone needs to be aware of! Everyone need to be in this course! </strong>  </p>  <p>  \t\t\t    - Salmy Malik</p><p><strong>An easy to follow information course. I like that it focus on what we can do to help ourselves as well as bringing to our attention the role of big companies that appear to be adding to our health issues.</strong></p><p><strong> </strong>- Annie Byway-Williden</p>  \t\t<p>  \t\t\t\t\t    --------------------</p><p>Tired of seeing a bucket of prescribed drugs which gives you no light at the end of the dark tunnel of your pain? Are you still subscribing to your doctor every month to collect your medication and spend hundreds of dollars for something that may or may not heal you?</p><p>If you do, now is the chance for you to save lots of money and heal your pain naturally!</p><p>You see, personally I have not taken any medication for more than 3 years! And during those years, I'm grateful that I'm only fall sick twice and I healed myself without having to buy medication from the doctors even when they insist me to buy their drugs!</p><p>However, I'm glad to have the knowledge to empower myself to heal naturally. I regard myself as a technician for my body and I just knew what to do when my body shows symptoms of breaking down and I'm sure you too would love to have the information that I have.</p><p>Here is what you will get when you buy this course.</p><p>1. A step by step guide on how to heal yourself - even from cancer - using the tool provided in the course.</p><p>2. Direct guide and concept in what are the 'tools' that is suitable to 'fix' the body.</p><p>3. Fully packed with simplified and easy to understand information without the need for basic knowlegde of nutrition and medical science.</p><p>I know it may sound unreal. Some people have labelled me with certain names. Truth is, all the information that you will find in this course are backed with scientific research and explanation!</p><p>Some of the world renowned professionals who practise natural healing are Charlotte Gerson, daughter of Dr Max Gerson of Gerson Institute, Louise Hay of Hay House, Ty Bollinger from Cancer Truth and many more!</p><p>I can go on and on but I want you to do this. If you want to learn this powerful tool to help heal yourself and your loved ones, join us in this course!</p><p>See you there!</p>", 
    "end_date": null, 
    "title": "Heal Yourself from Diseases - Especially Cancer - Naturally", 
    "price": "20.00", 
    "instructors": "Syarif Hidayat", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/358358_af95.jpg", 
    "course_url": "https://www.udemy.com/reverse-cancer-naturally/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-28T10:02:15Z"
}