{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>***<em><em>Course Fully Up-To-Date As Of January 2016***</em></em><br></p>\n\n<p><em><em>***100% 5 Star Health Improvement Course***</em></em></p>\n\n<p><em><em>***Join &gt;1400 Students And Improve Your Health Fast***</em></em></p>\n\n<p><em><em>-------------------------------------------------------------------------------------------------------------------</em></em></p>\n\n<p><em>\"I've just left a review to go with the rating but I wanted to thank you personally as well. I don't think I've ever written to an instructor before in this way, which says something. As I've gone through each lesson I've explained things to my wife and we have already started making big chances to our diet and lifestyle. Of course, there will be a lot more to come as well.</em></p>\n\n<p><em>I see from one of your answers to a previous student that you may be making more courses, and I hope you do. I'll almost certainly register when I see them\" - David Brand</em></p>\n\n<p><em>-------------------------------------------------------------------------------------------------------------------</em><br></p>\n\n<p><em>\"Even the latest WHO advice is in this well paced course. You will lose weight easily and feel fitter very fast. </em><em>Thanks for the advice :-)\"  -  Wil Bremers</em></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p><em>\"This is a quality course with quality information taught by a true expert. If you're interested in learning how to overcome fatigue, do not pass this course up.</em>\"  -  Steve MacIntyre<br></p>\n\n<p>-------------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Do You Want To Have Boundless Energy?</strong></p>\n\n<p>In this course I will teach you all about creating <strong>more energy</strong>. In comparison with other courses I will NOT limit myself to one topic. This course is all about creating more energy choosing the right foods, supplements, exercises and behaviour. You will also find secret tips about how stay fit and healthy.</p>\n\n<p>Maybe you are an athlete? Maybe you are an office worker, a housewife or a student. Or maybe you have a disease like fibromyalgia or chronic fatigue syndrome. This is the best course for you all!</p>\n\n<p>In comparison with other course this course will cover ALL the necessary knowledge and steps for creating more energy in your body. It's <strong>not only </strong>covering healthy foods. No, this is a <strong>complete course</strong>. Because there are more things to do then only taking the right nutrition. The ultimate goal is that this will help you to live a <strong>fit and happy</strong><strong> life</strong>.</p>\n\n<p><em>I will be updating this course regularly. So you can be sure that future developments in this field of knowledge is in this course. Now and in the future. </em></p>\n\n<p>You have lifetime access to all the lectures in this course. Enjoy en I'm convinced that this course can make a difference for you. How I know this? Because I've applied the principles in this course to many of my athletes and patients. <strong>And I can tell you.....it worked! </strong></p>\n\n<p><strong>Start learning now! And make a change.</strong></p>\n\n<p>After following this course you will be able to make that positive change in your life.</p>\n\n<ul><li>Start now and notice that you can lose weight <strong>easily</strong> and <strong>responsible</strong></li><li>Start now and notice that you are <strong>less tired</strong> during the day</li><li>Start now and notice that you can <strong>better sustain </strong>your work</li><li>Start now and notice that you can <strong>better sustain your sport</strong></li><li>Start now and get more control over diseases like <strong>fibromyalgia</strong> and <strong>chronic fatique syndrom</strong></li><li>Start now and live a <strong>healthy life </strong>with less chance of getting injured or sick</li><li>Start now! Learn about your body, the right food, bad food, supplements, stress, exercise, sleep and much, much more.</li></ul>\n\n<p>+++ENJOY+++</p>", 
    "end_date": null, 
    "title": "Health Improvement: How To Optimize Your Health in 30 days! ", 
    "price": "20.00", 
    "instructors": "Marc de Jong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587370_e4fc_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-more-energy-permanently/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T13:58:01Z"
}