{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Cannabidiol (CBD) is a compound in the Hemp/Marijuana plant that has healthy effects, but does not make people feel \"high\" and actually counteracts some of the effects tetrahydrocannabinol (THC) creates.</p><p>Compared with THC, cannabidiol is less psychoactive, and has a wider scope of health applications than THC.</p><p>For decades, only high-THC Cannabis was available, and now CBD-rich strains are being grown for medicinal purposes. The reduced psychoactivity of CBD-rich hemp makes it an appealing treatment option for patients seeking</p><ul><li><strong>anti-inflammatory</strong></li><li>anti-pain</li><li><strong>anti-anxiety</strong></li><li>anti-spasm effects</li></ul><p>WITHOUT the disconcerting effect of lethargy or euphoria.</p><p>Scientific and clinical studies indicate that CBD could be effective in easing symptoms of a wide range of difficult-to-control conditions, including:</p><ul><li><strong>Arthritis (including rheumatoid arthritis)</strong></li><li>Diabetes</li><li><strong>Alcoholism</strong></li><li>Post traumatic stress disorder (PTSD)</li><li><strong>Epilepsy and neurological disorders.</strong></li></ul><p>CBD has demonstrated <strong>neuroprotective effects, and its anticancer potential</strong> is currently being explored at several research centers in the US and other countries.</p><strong>The History of CBD</strong><p>In the spring of 1998, the British government licensed a company called GW Pharmaceuticals to grow Cannabis and develop a precisely consistent plant extract for use in clinical trials. GW's cofounder Geoffrey Guy, MD, was convinced - and had convinced the Home Office - that by using CBD-rich plants, GW could produce a Cannabis-based medicine with little or no psychoactive effect.</p><p>That summer Guy described his approach at a meeting of the International Cannabinoid Research Society. In addition to countering the psychoactivity of THC, Guy said, CBD conferred benefits of its own. Queen Victoria had used CBD-rich Cannabis for menstrual cramps. Indeed, <strong>animal studies suggest that CBD lessened anxiety and reduced the severity and frequency of seizures.</strong></p><p>It was assumed that generations of breeding for maximum THC had reduced CBD in California cannabis to trace levels. GW had gotten its CBD-rich strains by acquiring the genetic library of HortaPharm, a Dutch seed company run by American ex-pat naturalists, David Watson and Robert Clarke. Tod Mikuriya, MD, founder of the Society of Cannabis Clinicians, expressed hope that \"our Burbanks in the hills\" would have preserved or could develop CBD-rich strains if and when an analytic test lab began serving the medical Cannabis industry.</p><p>As the years went by, more and more promising studies involving CBD were described at meetings of the ICRS, the International Association for Cannabinoid Medicine, and Patients Out of Time. California doctors kept abreast of the research and O'Shaughnessy's reported on it, but we were merely observers, not participants - until the fall of 2008, when Oakland's Steep Hill Laboratory began testing samples provided by Harborside Health Center.</p><p>Approximately one in 750 samples of Cannabis being grown for medical use is turning out to be CBD-rich. (For data collection purposes, \"CBD-rich\" has been defined as 4% or more by dry weight). Doctors and patients now have a unique opportunity to evaluate its effects.</p><strong>CBD enhanced cannabis</strong><p>In November 2012, an Israeli medical cannabis facility announced a new strain of the plant which has only cannabidiol as an active ingredient, and virtually no THC, providing some of the medicinal benefits of cannabis without the euphoria.</p><p><strong>The researchers said the cannabis plant, enriched with CBD, \"can be used for treating diseases like rheumatoid arthritis, colitis, liver inflammation, heart disease and diabetes\".</strong></p><p>In this course, we take you through how CBD and Hemp Oils work. We introduce you to the top manufacturers of Hemp Oil and give you same history of Hemp.</p><p><strong>Register for this course today and learn how CBD's and Hemp Oil can help your quality of life.</strong></p>", 
    "end_date": null, 
    "title": "Hemp Oil Uses and Health Benefits", 
    "price": "20.00", 
    "instructors": "Scott Paton, Martin Pytela", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534426_bede.jpg", 
    "course_url": "https://www.udemy.com/hemp-oil-for-health-cannabis-marijuana/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T19:45:43Z"
}