{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Discover superfoods and herbs that have profound effects on your health. This \ncourse is designed for those that want to feel their best and have more \nenergy. When you are vibrant and strong on inside, it shows on the \noutside.</p><p>In this course we will cover superfoods and herbs that have been enhancing health and  quality of life for many cultures throughout history. They have been revered by long-lived sages as well as wisely incorporated into the diets of today. Even if new to you, these foods and herbs are readily available. Incorporate one new recipe into your eating habits for noticeable results. Add additional recipes as you go.</p><p>Benefits of specific superfoods and herbs covered in the course:<br></p><ul><li><strong>Endurance, stamina and energy</strong>: ginseng, burdock, lycium berry, ashwaganda, fo-ti, astragalus </li><li><strong>Anti-aging,  antioxidants and heart health</strong>: garlic, lycium berry, sesame seeds, cocoa, cayenne, royal jelly</li><li><strong>Nutrient dense</strong>: spirulina, nutritional yeast, seaweed, sesame seeds, bee pollen, dandelion, molasses</li></ul><p>We will also cover superfoods and herbs for boosting brain function, immune response, and countering the harmful effects of stress. </p><p>By end of course you will be able to:</p>    <ul><li>Know which foods truly make a difference to your to health</li><li>Create great tasting recipes loaded with a powerhouse of minerals and vitamins </li><li>Discover new and creative ways to use superfoods for ultimate health</li></ul>                <p>These remedies will easily and joyfully become a part of your everyday life.  </p>    Join me in this truly life changing course!", 
    "end_date": null, 
    "title": "Home Remedies: Best Superfoods & Herbs for Health & Energy", 
    "price": "20.00", 
    "instructors": "Elizabeth Heck", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665234_58d5_2.jpg", 
    "course_url": "https://www.udemy.com/home-remedies-optimum-health/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T22:05:25Z"
}