{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    Learn which foods create health and which create disease, which foods are best for your baby and which foods to avoid; raise a healthy, happy, and robust child.  </p>  <p>  \t<strong style=\"\">“Master Ancestral Wisdom Of Health And Nutrition And Raise A Healthy Happy And Robust Baby”</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t    Know the differences between breastfeeding and commercial formulas  </p>  <p>  \t    Learn how to make your own homemade formula that is healthy and safe  </p>  <p>  \t    Recognize what first foods are healthy for your baby and which to avoid  </p>  <p>  \t    Learn what our healthy Ancestors did for thousands of years  </p>  <ul style=\"\">  \t<li><strong style=\"\">Your baby’s health is in your hands - do it right the first time!</strong></li>  \t<li><strong style=\"\">Your baby’s health depends on what you know!</strong></li>  \t<li><strong style=\"\">Knowledge is power - give your baby the right start in life!</strong></li>  \t<li><strong style=\"\">Give your baby the right start in life - knowledge is power!</strong></li>  </ul>  <p>  \t    We’ll learn the time-tested Ancestral Wisdom about health and nourishment. Knowing this information will allow you to protect your baby from modern diseases and help your baby to grow healthy and strong. Following this Ancestral Wisdom will ensure your baby develops properly and gets the right start in life.  </p>  <p>  \t    This information is not something you will hear from the mainstream media. In fact, the food and pharmaceutical industries would prefer you don’t learn this, as the moment you learn this, they lose you and your child as consumers and patients. And that is precisely why you should learn this!  </p>  <p>  \t<strong style=\"\">Content and Overview</strong>  </p>  <p>  \t    As a mother myself I know how difficult it can be to know how to feed your child healthy in today’s commercialized world. I have spent many years studying Ancestral nutrition and have travelled the world researching what our Ancestors did that allowed them do live healthy and disease-free. I have become an expert in the field of Ancestral nutrition and want to share this knowledge with you and other moms.  </p>  <p>  \t    I designed this course to be an overview of the Ancestral nutrition with concrete step-by-step instructions on how to feed your baby the right way. This will help your baby to develop properly.  </p>  <p>  \t    Nutrition is the most crucial for your baby in the first months of life. These first months will determine the state of health for your child for the rest of his or her life. This course gives you an opportunity to learn, so you can help your baby grow healthy and strong.  </p>  <p>  \t    Do not rely on the commercial foods, as they are not adequate nutrition for your little one. Do you ever wonder why we have so many MODERN diseases and why they are called MODERN?  This course will answer these questions.  </p>  <p>  \t    Babies need real, nourishing foods that commercial baby formulas and baby foods do not provide. That is why you need to know what your baby truly needs and how to provide it for your baby.  </p>  <p>  \t    The only way to shield your little baby from the health damaging effects of the newfangled industrial foods is for you to gain knowledge. This course provides this knowledge and will allow you to take charge of your baby’s health and to nourish your precious child into a healthy and strong human being, safe from the onslaught of modern diseases.  </p>  <p>  \t    This course clears the confusion around food, as there are so many conflicting messages about food and nutrition all around us.  </p>  <p>  \t    You have to know this information - your baby develops only once! So get it right the first time.  </p>  <p>  \t    I have created this course to be a simple and fast paced learning experience as I know how busy you are as a new mom. You can complete this course in no time and start implementing changes right away!  </p>  <p>  \t    At the end of this course you will be able to discern which foods create health and which create future disease and chose only the right ones for your baby.  </p>  <p>  \t    I provide ongoing help and support. All future additional lectures and guides are included in your course - there&#039;s never anything extra or anything more to pay.  </p>", 
    "end_date": null, 
    "title": "How To Nourish Your Baby Properly For Healthy Life Ahead ", 
    "price": "20.00", 
    "instructors": "Anya Swanson", 
    "commitment": "29 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329174_0da5.jpg", 
    "course_url": "https://www.udemy.com/ancestralwisdomforhealthybabies/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T10:54:36Z"
}