{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  This course is designed for moms with young children. These moms care about their kids health and are looking to learn how to feed their children healthy foods. These moms sometimes feel confused about conflicting information about food and nutrition and want to know what is truly healthy for their children and what to avoid.  </p>  <p style=\"\">  \t  This course is about food our children eat today and how this food effects their health. It explains why we have an epidemic of <em style=\"\">modern</em> diseases that were pretty much unknown just 100 years ago.  We compare modern kids&#039; food to the food children ate back in time, before the Industrial Revolution and how their way of eating made them into strong and robust adults.  </p>  <p style=\"\">  \t  This course is designed to help moms to feed their children in the way that creates and supports strong health rather than creates some of the many <em style=\"\">modern</em> diseases in the future of their children.  </p>  <p style=\"\">  \t  This course will NOT teach mothers the same information that is taught in the mainstream nutritional schools or what they hear from their doctors daily. This mainstream information is supporting the many myths about the way our Ancestors lived and ate and how we should eat today.  </p>  <p style=\"\">  \t  The effects of this mainstream (mis)information, that largely supports the food and the pharmaceutical industries and not our health, are clearly visible all around us, in growing obesity, diabetes, heart disease, cancers, autism, and many other <em style=\"\">modern</em> disease rates.  </p>  <p style=\"\">  \t  Instead, from this course mothers will learn the general information on what worked for millions of years for our pre-Industrial Revolutionary Ancestors and that help our species to develop and survive in the world. They will also learn what to avoid in their kids diet and what to include on the daily basis, so that they can raise healthy, happy, smart, and balanced children…  </p>  <p style=\"\">  \t  This course consists of videos, text materials, and YouTube uploaded videos in supportive materials.  </p>", 
    "end_date": null, 
    "title": "How To Nourish Your Child Properly For Healthy Life Ahead ", 
    "price": "20.00", 
    "instructors": "Anya Swanson", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319980_4cd0_2.jpg", 
    "course_url": "https://www.udemy.com/ancestralwisdomforhealthychildren/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T06:55:11Z"
}