{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t                                        Is binge eating ruining your weight loss efforts? You are not alone! But if the binging continues, you'll make it harder to reach your ideal weight and may even open the door to future health problems. <br><br>Thankfully, you'll learn <strong>Biblical</strong> principles to regain control of your eating - one step at a time - in the new <strong>'How to Stop Binging'</strong> course.  </p>  <p>  \t                            Isn't it time to feel good about your health and finally make peace with food? You are worth it! Join us now.  </p>  <blockquote>  \t                                                  \"...having been a binge eater herself, Kim's enthusiasm and desire to help others radiates through her teaching. I feel as if she's talking to me personally. With the insight I've gained from this class, I've made a significant breakthrough in shedding 40 pounds of 'divorce weight'. This class has helped to halt my emotional eating.\"  - Cheryl I. Nolan<br>  </blockquote>  <p>  \t                        Emotional eating is the #1 obstacle that stands in the way of weight loss goals. But through the simple techniques in this new course, you will learn how to:  </p>  <ul>  \t<li>Stop the sabotaging behaviors that stand in the way of your desire to lose weight</li>  \t<li>Enjoy your food rather than it remaining an obsession</li>  \t<li>Manage your emotions effectively</li>  \t<li>Reduce your stress and enjoy life more</li>  </ul>  <p>  \t                        The tools and strategies you'll learn about in this course will help you experience peace, increase your self-respect, and make your life more fulfilling and enjoyable. You don't want to miss  out on this life-changing course. Check out the free previews below.  </p>  <p>  \t      This course also has a 30-day money back guarantee, so you can preview the whole course with no risk for 30 days. Join us today!  </p>", 
    "end_date": null, 
    "title": "How to Stop Binging", 
    "price": "20.00", 
    "instructors": "Kimberly Taylor", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130688_7e15_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-stop-binge-eating/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T23:50:46Z"
}