{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong style=\"\">Anyone with a patch of land can grow a food forest!</strong>&nbsp; A food forest, or forest garden,&nbsp; is a gardening technique that mimics a forest ecosystem but substitutes in edible trees, shrubs, perennials and annuals.&nbsp; A medicinal food forest has the added benefit of producing medicinal botanicals. Fruit and nut trees comprise the upper canopy of the forest while below are berry shrubs, edible perennials, herbs, root crops and annuals. Companion plants are included to attract beneficial insects, build the soil, and provide mulch.&nbsp; <strong style=\"\">Together they create a sustainable forest garden ecosystem able to produce high yields of food with less maintenance</strong>. <br style=\"\"></p><p> In this course Michael Pilarski, permaculture and wildcrafting expert, teaches you how to turn your back yard into a food forest.&nbsp; Filmed on site in Michael&#039;s back yard, this is not a classroom-based course.&nbsp; Michael teaches the basics of food forest planting while planting his own medicinal food forest on 1/8 of an acre.&nbsp; Does an 1/8 of an acre sound big to you?&nbsp; Don&#039;t worry!&nbsp; <strong style=\"\">In this course Michael talks about how to scale what you&#039;re learning to your own back yard.&nbsp; </strong><br style=\"\"></p><p>Forest gardening is an ancient art and science that can teach you sustainable methods for growing your food and medicine.&nbsp; As Masanobu Fukuoka once said, <strong style=\"\">&quot;The ultimate goal of farming is not the   growing of crops, but the cultivation and perfection of human beings.&quot;</strong>&nbsp; Forest gardening allows you to experience ecology first hand.&nbsp; It provides you with a rare opportunity to live with nature and learn how to exist a little more sustainably.&nbsp; <br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How to Grow a Medicinal Food Forest", 
    "price": "45.00", 
    "instructors": "Michael Pilarski", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60857_d8fc_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-grow-a-medicinal-food-forest/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-19T05:50:27Z"
}