{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This life changing course created by a Registered Holistic Nutritional Consultant focuses on the key things you need to know to make the switch to a real food diet in a simple step by step format. It's no big mystery, dynamic health and well being are simply a matter of sourcing and eating real foods. So if you are tired of feeling crappy, and getting confused by so called expert nutritional advice and stealth advertising, and crave a simpler approach to healthy eating, this course will show you how. There's no need to be overwhelmed - feeding yourself well doesn't need to be complicated! You can make the switch to a real food diet without going broke, living in the kitchen or feeling deprived.</p><p><strong>You Will Be Inspired to Learn:</strong></p><p><strong>How to nourish yourself and family with real, natural foods.</strong></p><p><strong>How to transform your pantry from processed to nourishing.</strong></p><p><strong>How to prepare meals with Real Foods that are delicious, fresh, and tempting.</strong></p><p><strong>How to become Real Food savvy by knowing how to read food labels and avoid unhealthy processed and artificial foods.</strong></p><p><strong>How to Gather Real Foods, no matter where you shop or the size of your grocery budget. </strong></p><p><strong>Effective meal planning and kitchen tips to make eating Real a breeze.</strong></p><p>Course Materials Include: </p><p>Video Tutorials</p><p>Printer Friendly PDF Documents you can hang on your fridge</p><p>Comprehensive Curriculum Documents</p><p>128 Real Food Recipes - including how to make healthier versions of traditional store-bought foods</p><p>You will have unlimited access to this course and can take as long as you need to complete it.</p><p>Access to the Real Foodies FB group where you can mingle with other course participants and immerse yourself in all things delicious and healthy.</p>", 
    "end_date": null, 
    "title": "HOW TO MAKE THE SWITCH TO A REAL FOOD DIET IN 3 SIMPLE STEPS", 
    "price": "45.00", 
    "instructors": "Anastasia Akasha Kaur RHN, CYT", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513610_86cc_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-the-switch-to-a-real-food-diet-in-3-simple-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T12:39:23Z"
}