{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t                                                                    How To Self-Manage Your Chronic Illness Back To Wellness!” teaches the student how to analyze their own health needs using a Spiritual perspective.  This self-help healing course, which includes a \"FREE\" 90 page Natural Health reference e-book, which is for the student who is serious about their health and is ready to set goals for recovery with their mental and physical strength, energy and overall body wellness.  This course goes into depth on the self-help healing tools that are available without a Drs. Prescription for the purpose of assisting the body in restoring balance and obtaining the proper healing process.  While this course respects medical professionals and the vital role they play in modern society, it also critiques the “band aid” approach to solving many problems associated with chronic illnesses and medicine.  </p>  <p>  \t<br>  \t                                                                           According to \"How To Self-Manage Your Chronic Illness Back To Wellness!,” understanding that the key to good health is to develop a state of balance within the body. As your body gets closer to its intended balance, it will become considerably more effective at prevention and fighting any existing condition that may already exist. This course teaches the student, that which is needed to assist in regaining balance in the body as it pertains to nutritional deficiencies, toxin overload, hormonal imbalances and much more.  </p>  <p>  \t<br>  \t                                                                   “Perfect harmony is a state of dynamic balance within the body, where illness simply cannot exist,” explains Minister McClain.  “When the human body is in balance, it is an intricate machine that constantly repairs itself from foreign invaders, damage and mutant cells.” This course goes beyond that knowledge explained to you by modern medicines; it shows you.. the student how to bring overall balance back to your body and indirectly to your life.  </p>  <p>  \t                                                                          This is the premise for this course; from a Biblical perspective and even the biological model, the origin of the human body (or life, in the biological model) is compared to the biblical origin of man made from the dust of the earth.  Using this dynamic metaphor, Minister McClain shows the student how to analyze their own soil – or check their body to find out how the body is functioning at the cellular level. This course teaches that anyone can take a multivitamin/minerals in hopes that they will supplement that which might be deficient in their bodies, but not knowing how deficient one might be and not knowing if the recommended dosage on the bottle is a sufficient amount to regain balance is one of the biggest problems; thus supporting the increase in most chronic illnesses across many countries. This course explains where to obtain the simple tools that are available without prescription or doctors consent to help specifically understand each individuals body needs, their body weaknesses, their body strengths and how each person can further optimize their own body functions through the knowledge that the student will gain from these self-help tools. <br>  \t<br>  \t                                                                           The self-help healing tools that are described in this course are compared and akin to cultivating soil by achieving the optimal pH, mix of macronutrients, mix of micronutrients, and water content. When all of these are achieved, the soil is fertile and produces the best possible results. So too, the body is more energetic and prevents disease best when it is in optimal conditions for cellular functioning. <br>  \t<br>  \t                                                                           “On the contrary, when the body is out of balance, the body’s environment becomes a perfect host for the growth of many harmful parasites, fungi, viruses, bacterial growth and diseases,” explains Minister McClain, who was motivated to build this course \"How To Self-Manage Your Chronic Illness Back To Wellness!” and has written the FREE E-book, \"Analyzing Your Soil .. Preparing for a Plentiful Harvest: A Biblical Perspective on Health\" after spending years of struggling with chronic illnesses of both herself and some of her family members and the failure of diagnoses, inadequate treatment and almost two decades of research in the natural health arena.  </p>", 
    "end_date": null, 
    "title": "How To Self-Manage Your Chronic Illness Back To Wellness", 
    "price": "20.00", 
    "instructors": "Lolita McClain", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369516_aaf7_3.jpg", 
    "course_url": "https://www.udemy.com/healingnaturally/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T19:39:21Z"
}