{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Join over 1,000 people who are reclaiming freedom around food and creating a healthier and happier life for themselves!  </p>  <p style=\"\">  \t<em style=\"\">&quot;Amazing course to get back to happy life! Results are unbelievable!&quot; </em>- Aline  </p>  <p style=\"\">  \t  --------------------------------------------------------------------------------  </p>  <p style=\"\">  \t  The &quot;How To Stop Binge Eating: The First Step To Food Freedom&quot; course is the perfect starting point for anyone having a tortuous relationship with food - from binge eating to bulimia to food addiction to emotional eating. This course will give you all you need to clearly understand what&#039;s happening to you physically and how to stop your destructive eating patterns for good.  </p>  <p style=\"\">  \t  WITH THIS COURSE YOU&#039;LL:  </p>  <ul style=\"\">  \t<li>Understand how your BODY works</li>  \t<li>Use this knowledge to STOP binge eating QUICKLY &amp; EASILY</li>  \t<li>Achieve &amp; maintain your IDEAL WEIGHT</li>  \t<li>Regain self-worth &amp; confidence</li>  \t<li>Use powerful techniques to truly transform your life for the better!</li>  </ul>  <p style=\"\">  \t  The content covered in this course is very specific, condensed and powerful and is equal to approx. 2 to 3 months of 1:1 coaching (value: US$ 1,000 to 1,500).  </p>  <p style=\"\">  \t  Having recovered from more than 15 years of struggling with my own bulimia battle - this course has been especially designed and structured to help you to regain freedom over food with ease and grace.  </p>  <p style=\"\">  \t  This course is a powerful step-by-step process that has helped countless people recover from food issues worldwide. It&#039;s the first level of the full online program &#039;Stop Binge Eating &amp; Transform Your Life&#039;, available on Udemy as well.  </p>  <p style=\"\">  \t<strong style=\"\">Here is what people are saying about the course:</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I am free of my obsession with food, I feel light and good in my body and I now love myself fully and unconditionally. This changes EVERYTHING!&quot; </em>- Zoe  </p>  <p style=\"\">  \t<em style=\"\">“I am excited about the future and I know that RECOVERY IS 100% POSSIBLE for me.”</em>  </p>  <p style=\"\">  \t  - Jennifer  </p>  <p style=\"\">  \t<em style=\"\">“My life has completely changed in an extremely positive way: my eating disorder has gone and </em><em style=\"\">I AM NOW HAPPY!”</em>  </p>  <p style=\"\">  \t  - Alicia  </p>  <p style=\"\">  \t<em style=\"\">&quot;Amazing. This course is an absolute master piece. As the Gabrielle Bernstein of Nutritional Coaching Pauline creates not just miracles, but lasting changes forever. This program is full of powerful insights and scientifically supported tips (which I love as a scientist by trade) to finally make peace with food.</em>  </p>  <p style=\"\">  \t<em style=\"\">It is evident that Pauline has walked the path of self love, self respect and commitment herself in order to transform and elevate the relationship to her own body, mind and soul for good.</em>  </p>  <p style=\"\">  \t<em style=\"\">The course is very intelligently organized. It walks you step by step, inch by inch through profound wisdom and well known healing applications, to finally be able to step away from this awkward emotional roller-coaster when it comes to body love, food and joyful eating.&quot;</em>  </p>  <p style=\"\">  \t  - Alexa  </p>  <p style=\"\">  \t  Join over 1,000 people who are reclaiming freedom around food and creating a healthier and happier life for themselves!  </p>", 
    "end_date": null, 
    "title": "How To Stop Binge Eating: The First Step To Food Freedom", 
    "price": "20.00", 
    "instructors": "Pauline Hanuise", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412224_e9a0.jpg", 
    "course_url": "https://www.udemy.com/how-to-stop-binge-eating-your-bulimia-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T14:12:42Z"
}