{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>It starts with well meaning doctors injecting you with toxic vaccinations, and good relatives using sweets-as-rewards. Followed by the food processors adding neurotoxins to your drink or food, and farmers growing hollow foods on depleted soils. Then grocers soaking their carrots in chlorinated water to keep them clean, and teachers sterilizing every surface with antibacterials, or soap makers adding &quot;fragrance&quot; to your detergent, and everybody else asking you to sit, take a ride, and avoid hard work.</p><strong style=\"\">Toxicity, Malnutrition, Environment and Stagnation</strong><p><br style=\"\">At some point the immune system cracks. It begins to mistake some parts of your body as a foreign invader. Depending on a combination of factors - which nutrient is missing, which toxin has not been eliminated, which virus you contracted, and what type of stress you have endured - you develop one or more autoimmune disorder(s).<br style=\"\"><br style=\"\">The mainstream medical mindset focuses on symptoms and their suppression. It is possible to suppress a symptom using poisons, but unless the cause is dealt with, it will return with a greater strength, or at a broader and deeper level, which will be even more difficult to deal with. It is known as &quot;aging&quot;, and &quot;you&#039;ll have to get used to that.&quot; We don&#039;t quite agree with this.<br style=\"\"><br style=\"\"><strong style=\"\">Toxins</strong> - heavy metals, herbicides, pesticides, organo-chlorines, volatile organic compounds - they are all around you, in your air, water, food, clothes, beds, homes, cars, schools, offices.</p><p style=\"\"><strong style=\"\">Malnutrition</strong> - Is it possible to be fat and malnourished at the same time? Phytonutrients, Minerals, Enzymes, Vitamins, Microbes - the makings of healthy life are nearly absent from industrial processed food. When your food is a hollow, low nutrient density, calorie rich, taste enhanced pretender - you can never eat enough. Even after a meal your body says: &quot;Feed Me!&quot;. There is no wonder you are putting on weight.</p><p style=\"\"><strong style=\"\">Stagnation</strong> - All life is based on pulsating energy: inhale/exhale, shorten/lengthen, close/open, squeeze/relax. When these movements seize, you soon are dead. Your body is designed to function under load - it is in dynamic (not static) balance that we find life&#039;s expression. Sedentary life is the antithesis to healthy function. A stagnant body if water is a swamp - rotting, decomposing, putrid smelling. If your feet stink, or your breath is bad, it is because of stagnation - you need movement.</p><p style=\"\"><strong style=\"\">EMF</strong> stands for Electro-Magnetic Frequency. You cannot see it, but these days it is hard to find a place that is not being bombarded by signals of varying wave lengths. The shorter the wave, the higher the frequency, and the closer to affecting your health. It is used to deliver both energy and information, making our lives much more convenient, but at the same time it is threatening our health. <br style=\"\"></p><p>IN this course, you will learn more of how you got where you are and what you can do to get to where you want to be.</p><p>We have designed this course to provide you with the right knowledge, techniques and advice to be able to get back to your natural state of Peace, Love and Joy.<br style=\"\"></p><p><strong style=\"\">Our Motto: Restoring Vitality to You and The Planet!</strong></p>", 
    "end_date": null, 
    "title": "Inflammation - The Hidden Source of Disease and Chronic Pain", 
    "price": "20.00", 
    "instructors": "Scott Paton, Martin Pytela", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/386066_bf9e.jpg", 
    "course_url": "https://www.udemy.com/pain-relief/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T21:41:11Z"
}