{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Intermittent fasting is a nutrition strategy that alternates brief periods of fasting with non-fasting. Fasting periods are typically less than 24 hours and no more than three days per week. The health benefits are numerous and include weight reduction and improvement in brain function. In this one-hour course, Dr. Michael Lara, a board-certified physician (M.D.), will teach you everything you need to know to get started with intermittent fasting. Included in the course are 5 lectures covering the following topics:</p><p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">What is Intermittent Fasting?</span></li><li style=\"\"><span style=\"\">The Health Benefits of Intermittent Fasting</span></li><li style=\"\"><span style=\"\">The Different Types of Intermittent Fasting Programs&nbsp;</span></li><li style=\"\"><span style=\"\">What to Eat When NOT Fasting</span></li><li style=\"\"><span style=\"\">The Role of Exercise: Resistance Training versus Aerobic Training</span></li></ul><span style=\"\">You will also learn about how to integrate useful supplements such as fish oil, coconut oil, fiber, and branched chain amino acids to get the most out of this dynamic combination of diet and exercise.&nbsp;</span><br style=\"\"></p><p style=\"\"><span style=\"\">Included with each lesson are detailed transcripts of each lecture along with quizzes that highlight key points. Also included is the downloadable e-book, &quot;A Quick Start Guide To Intermittent Fasting&quot;.&nbsp;</span></p><p style=\"\">If your diet and exercise program isn&#039;t working for you, &quot;Get Pumped&quot; will show you an evidence-based strategy to finally meet your body composition goals.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "Intermittent Fasting for Maximal Weight Loss ", 
    "price": "30.00", 
    "instructors": "Michael Lara", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58892_8a22_6.jpg", 
    "course_url": "https://www.udemy.com/intermittentfasting/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-08T01:13:27Z"
}