{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>I often get asked by many women HOW I healed myself of PCOS naturally - without any prescription drugs. </p><p>The answer is.... it can be done despite what \"health professionals\" tell you.</p><p>Hi I'm Melissa Madgwick! A health professional and a real 29 year old woman who is on other side of healing from polycystic ovarian syndrome – <em>naturally. </em>I was a professional dancer in ballet, tap and jazz for 15 years. I have a university degree and am a passionate entrepreneur! Life shifted 3 years ago when I took my health into my own hands. For 10 years, my “normal adult life\" consisted of terrible acne breakouts lasting 3 months at a time, terrible menstrual pains and heavy bleeding, fluctuating weight, zero sex drive, horribly moody and on top of everything, I had an underactive thyroid too. </p><p>I am now HEALDED of PCOS and it's horrible symptoms. I've now decided to share my knowledge of how I actually did this with the whole world to change many lives. </p><p>PCOS now is the leading cause of infertility in the USA and these numbers are rising. Do you want to be another statistic? I didn't!</p><p>In this course, I will share with you some of the easy, and immediately implementable tips and strategies you can take away and start implementing TODAY to get you back in control of your PCOS. </p><p>The tools, methods and strategies I will present to you in these simple 'how to' video's are simple and applicable any woman suffering from PCOS. </p><p>If you want to get your life back, be in control, know you are NOT doomed to be infertile forever and start living the life you deserve to life and HAVE BABIES - then I'd love for you to come on this wonderful journey and change your life forever.</p><p>I am so excited to hear about your journey and health being changed forever - so let's get started!</p><p>Happy healing,<br style=\"\"> Melissa Madgwick<br style=\"\">Author - Heal My PCOS<br style=\"\">xoxo</p><p><strong>Real life testimonial:<br></strong></p><p><em>“Hi Mel – After only 1 month I don't have any cyst's on my ovaries anymore and Mel I have you and your book to thank for that. If it wasn't for you I don't think I would have got back to normal. Now I finally believe I have a chance at getting pregnant. I no longer get bloated when I have a period I no longer crave sugar. I truly hope every women buys your book. I can never thank you enough for all your help. In such a short time I've seen huge differences. Even my hubby says thank you.” <br> Amanda Humprhies. </em></p><p><strong>What are the requirements?</strong></p><ul><li>You'll need a computer with internet access and the determination to change your life</li><li>Your future self will thank you for starting today!</li></ul><p><strong>What am I going to get from this course?</strong></p><ul><li>A better understanding of PCOS and it's causes via simple how to videos and downloadable files to read</li><li>Use the same strategies I did to heal my PCOS and it's nasty symptoms</li><li>Use the simple strategies presented to take action today</li><li>Some of the exact strategies that Melissa has implemented with diet, exercise, supplements to get her PCOS back in control</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Women who are tired of being medicated and on medicine for their PCOS</li><li>Women who have been recently diagnosed with PCOS</li><li>Women who have been told their are doomed to be infertile (Not true!)</li><li>Women suffering from PCOS symptoms - acne, facial hair, weight gain and feel like they have lost all hope! You can Heal.</li></ul><p>Look forward to sharing the journey of health with you! :) </p><p><strong>DISCLAIMER: </strong>I have not attended medical school. I have not been licensed by any kind of committee or board or government to give any health advice. I have found, however, that most medical doctors have lost sight of the fact that food can be medicine, that humans are not inherently broken and that diseases can be cured by simple, healthful life choices.</p><p>I have read hundreds of blogs, and poured many hours of research into the journey of healing myself. </p><p> You are the captain of your own body and health, and I advise you to weigh my words, your doctor's words and everything you read against your own experience, instincts and knowledge. </p><p>With my love and light. This is for <em>you.</em></p><p>Melissa x</p>", 
    "end_date": null, 
    "title": "Learn How to Heal PCOS Naturally - A Real Life Story", 
    "price": "20.00", 
    "instructors": "Melissa Madgwick", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611524_c8bc_5.jpg", 
    "course_url": "https://www.udemy.com/healmypcos/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T09:46:03Z"
}