{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        ---------------------------------------------------------------------------  </p>  <p><strong><em>30 day no-risk money back </em></strong><strong>guarantee to make certain you are happy with your purchase. If you don't like what you see, I will give you 100% refund anytime in the first 30 days.</strong><br></p>  <p>  \t        ---------------------------------------------------------------------------  </p>  <p>  \t          Are you interested in learning more about nutrition?  </p>  <p>  \t          Do you have a desire to lose some weight or eat healthier to help maintain your weight and improve your well being?  </p>  <p>  \t          Using video, slides, animations, and text, we will work together to discuss basic nutrition; more specifically--an in depth look at carbohydrates, fats, and proteins and how our bodies process these for energy. You can expect to feel confident knowing about what you eat and how to make better choices regarding the types of food you eat to get and stay healthy. You will identify your health goals and how to get to them. We will look at food labels and explain their importance. By the end of the course you will have a clear understanding of the nutrition we need each day and what part protein plays in weight control. You will also learn a new and clinically proven way to keep track of calories that will help you re-learn good eating habits for weight loss and better weight control. The second half of the course focuses on using your new knowledge to lose weight using this clincally proven method.  </p>  <p>  \t                The course includes supplemental reference material and a quick start weight loss option for those who might be interested.  </p>", 
    "end_date": null, 
    "title": "Learn Optimum Nutrition for Improved Health and Weight Loss", 
    "price": "20.00", 
    "instructors": "Bradford Chase", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381774_a468.jpg", 
    "course_url": "https://www.udemy.com/optimum-nutrition/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T20:27:39Z"
}