{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "Are you ready to stop using food to feel better? To stop living in diet restriction? To start to feel better about yourself and your relationship with food?<br><br>What I&rsquo;ve come to learn about women and weight loss is that it&rsquo;s never just about the weight. The weight is always a symptom of what&rsquo;s going on the inside:<br><br><ul><li>Limiting beliefs</li><li>Self-esteem (or lack thereof)</li><li>Guilt</li></ul><br>These issues create voids, voids women try to fill with food.<br><br>You can shift these things! And the beautiful thing about those shifts is they change everything:<br><br><ul><li>How you feel about yourself</li><li>Your relationship with food</li><li>The energy you project</li></ul>That&#039;s why I created this course.<br><br>This resource and support-packed program includes:<br><br><ul><li>Creating a relationship with yourself. When you don&rsquo;t feel good about who you are, or have feelings of not being worthy, or deserving, there is a void inside. Most women try to fill this void with food. By building a relationship with yourself you fill the void from the inside out, which shifts your relationship with food.</li><li>Build beliefs that support your goals and reinforce success. This week we will show you how you can create supportive beliefs and change your mindset to set the stage for lifelong success.</li><li>Releasing emotional triggers. In this lesson we examine ways to release the emotions that lead to binge eating and reaching for comfort foods.</li><li>Letting go of guilt. This is one of the emotions that trigger emotional eating. By shifting the amount of guilt you are carrying you won&rsquo;t need to comfort yourself with food.</li><li>Identifying inner obstacles. Self-sabotage can be a stumbling block to success. Learn to identify what&rsquo;s coming up and how to shift it.</li></ul>These changes create a paradigm shift in your life. By filling the voids from the inside out you stop needing food the way you used to.<br><br>How do I know? Because my clients and I have experienced it: pushing the plate away when you&rsquo;re full, not needing candy every day, letting go of binge eating, feeling greater confidence.<br><br>Here are some of their stories:<br><br>&ldquo;Before working with Lynn my life was chaotic and depressing. Since then I have more confidence and tools to handle the challenges in life. I took an in depth look at myself with Lynn&rsquo;s help and made great progress in so many areas using the wonderful tools she gave us! I can do anything and I have tools for those &ldquo;OFF&rdquo; days to keep me on track. I have rituals that I learned that I can use and teach to my other coaching clients. If you wish to experience significant change and have tried many other things this is the program for you. This is the best coaching program I have done. You experience immediate results if you are willing to do the work! I loved it and continue to use the tools and rituals!&rdquo; - K. Chruma<br><br>&ldquo;I had been searching online for coaching programs. I knew that I needed help &ndash; and the minute I landed on Lynn&rsquo;s web site, it spoke to me. After a conversation with Lynn, I knew that I would make incredible progress with her. She told me what I needed to hear &ndash; not just what I wanted to hear.<br><br>Before working with Lynn, I was lost. I knew I was lost &ndash; but I never realized just how lost I was. I was angry, bitter and fat. I didn&rsquo;t enjoy life. Lynn showed me a different way. She was able to help stop negative thoughts before they had the ability to do more damage.<br><br>My life is completely different now. Lynn gave me a greater gift than just sparking something inside of me that changed my life (which she did); she gave me the tools so that I can continue that internal revolution. She believed the change was possible for me &ndash; and helped me believe in that myself. That is the most incredible gift anyone has ever given me.<br><br>I have been a more positive person and am enjoying the little things in life. Those closest to me have noticed the change as well. I feel so blessed to have had this weight lifted off of me. The ability to let go of the constant worrying and need for control have freed me from a lifetime of misery.<br><br>Life is good. I would have never made that statement before. To me, there isn&rsquo;t a bigger transformation.<br><br>I struggled with the question: &quot;is coaching actually going to help me?&quot; I debated &quot;is coaching something I can even afford?&quot; Looking back, those questions seem silly to me&hellip;because I can&rsquo;t imagine where I would be without the guidance I received from Lynn (all I know is that it wouldn&rsquo;t be a good place).<br><br>With Lynn, it wasn&rsquo;t about counting calories or limiting specific foods. It wasn&rsquo;t about exercising in a certain way. It was all about letting go of the baggage. It is that mental baggage that was the true culprit of my weight gain and my unhappiness. I have been holding on so tightly for so many years. Lynn helped me give myself permission to let go and live life to its fullest.<br><br>I am eternally grateful to all that Lynn has given to me. I know that her coaching program would be good for anyone. You will see results in the way that you look at life and how you approach problems. Once you can focus your mind and let go of everything else, anything is possible!&rdquo; - Julie Hoyer<br><br>&ldquo;After meeting Lynn through a mutual friend, I took the opportunity to have a free call with her. By the end of that call, I knew that I wanted to work with her &ndash; that her energy and inspiration were something I wanted/needed more of in my life!<br><br>I have struggled with weight and self-esteem issues since I was a child. Weight was a constant focus, food was always on my mind, junk food was always at hand. I felt pretty hopeless about making any changes in my weight. I was depressed and not very excited about my future.<br><br>I now feel hopeful about my future, about my weight, about my life!<br><br>I have started thinking more and more about what I&rsquo;m worth and not settling for less than that. I put myself &quot;out there&quot; and ended up with a new job &ndash; one that pays more than my other one and where my ideas are respected. I have moved away from wearing sweatpants and now wear &quot;real&quot; pants/jeans to work. I put on jewelry and makeup on most days. I know that I have to keep using the tools but if I keep it up, my body will shift in the same ways that my psyche has.<br><br>There were so many surprising things lurking below the surface and I would never have uncovered them without using her tools. She has helped me start to uncover the &quot;real&quot; me; this shift will change my body and has already changed my life. Taking care of myself can happen in real, meaningful ways that have nothing to do with food! The supportive, safe, inspiring environment she creates is the perfect space to manifest change!&rdquo; - Cindy Nacson-Schechter<br><br>&quot;When I started working with Lynn I know that I had a chip on my shoulder just waiting to prove to her that this was just another attempt that was going to fail.&nbsp; I gave the approach lip service and tried to be positive, but I was pretty sure I was going to fail. Again.&nbsp; Then I started reading the materials she suggested and doing the exercises.&nbsp; I found myself nodding in agreement as I read some of the information.&nbsp; It was clicking with me and felt like it truly applied to me and my situation.&nbsp; I began to feel more energetic and starting increasing my activity.&nbsp; In one of our first calls, Lynn asked what I would enjoy doing for an activity.&nbsp; My response was that I could walk on my treadmill.&nbsp; She asked if I enjoyed walking on the treadmill.&nbsp; No, I hate it! She asked why I would want to do something I disliked when there were other options.&nbsp; She suggested I look to my love of dance for inspiration and that dancing around in the kitchen was also activity.&nbsp; Now I understand that activity doesn&rsquo;t have to be some structured, arduous event.&nbsp; Just moving my body to music is activity.<br><br>In the six months I have worked with Lynn I have learned so much about myself.&nbsp; Before Lynn I kept searching for that event in my past that made me become an overweight person.&nbsp; I have seen enough TV shows and read magazine articles where the person uncovered a traumatic event where someone said something cruel or they were deprived in some way that caused emotional scars.&nbsp; I was looking to uncovered my event and have an epiphany; my Aha moment where it would all become clear and I would be cured&rdquo;.&nbsp; Lynn taught me that it doesn&rsquo;t always work that way.&nbsp; That sometimes it is just a series of small things that got you where you are today.&nbsp; Once I stopped searching for a big answer and started looking at the smaller parts, I started to really see results!&quot; - Karen Jones<br>\r\n", 
    "end_date": null, 
    "title": "Let Go and Lose Weight", 
    "price": "35.00", 
    "instructors": "Lynn Smith", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36005_14cc_6.jpg", 
    "course_url": "https://www.udemy.com/letgoandloseweight/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-13T22:32:33Z"
}