{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">HIGHLIGHTS:</strong></em></p><ul style=\"\"><li>A German scientist had a 90% cure rate for cancer - Learn how she did it</li><li>60 % of heart attacks can be prevented using a common mineral</li><li>Learn how to change the way people interact with you</li><li>Get rid of scars and wrinkles</li><li>Reboot your health and calm your spirit</li></ul><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">BONUS SECTION JUST ADDED</strong>: One hour of testimonials from patients<em style=\"\"><strong style=\"\"> cured of cancer </strong></em>using the method mentioned above</p><p style=\"\"><strong style=\"\">Let me ask you some questions:</strong></p><p style=\"\">Are you looking to enhance your sexual experiences?</p><p style=\"\">Are you tired all the time?<strong style=\"\"></strong></p><p style=\"\">Do you have trouble going to the bathroom on a regular basis?</p><p style=\"\">Do you have difficulty sleeping?</p><p style=\"\">Do you find it hard to get along with other people?</p><p style=\"\">Do you suffer from depression?</p><p style=\"\">Are you unable to lose weight or gain weight?</p><p style=\"\"><em style=\"\"></em>Do you have any digestive problems?</p><p style=\"\">Did You Answer <strong style=\"\">&quot;YES&quot;</strong> To Any Of These Questions?<strong style=\"\"> If so, this course is for you!</strong><em style=\"\"></em></p><p style=\"\"><strong style=\"\">These are just some of the issues addressed in these lectures and I will show you how to overcome them!</strong></p><p style=\"\"><strong style=\"\"></strong>If you could help reverse the aging process, would you? If using a few very easy and inexpensive techniques, made you look and feel young again, would you want to know about them and take advantage of them? </p><p style=\"\">While there is no fountain of youth, there does exist a body of knowledge that is not mainstream, it is not widely known, that can help you regain your youth and vitality. I have used these health tonics and procedures and have seen the results for myself. </p><p style=\"\"><strong style=\"\">I want to share them with you and I want you to look and feel young again. And as an added bonus: I will reveal some of my all natural and unique skin care recipes to you – Ones never seen before!</strong>   <strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Here are a few tidbits:</strong> </p><ul style=\"\"><li>Learn how to stop depression dead in its tracks – feel happy again</li><li>I will show you how to increase your sex drive and level of pleasure</li><li>Overcome one of the most persistent health issues (constipation) and then see how you look and feel when you do</li><li>Learn about simple forms of exercise that you can do at home and they produce   startling results – flatten your stomach is one such benefit</li><li>Change the way you feel inside and how people react toward you</li><li>Rid your body of toxins and watch how wonderful your skin becomes</li><li>Learn how to use a simple element, that when deficient in our body, has been linked to virtually every major illness – especially heart disease. </li></ul><p style=\"\">Please take this journey with me on the road to improved health and beauty and most importantly, learn how your spirit can be transformed, and how this new found self image can change the way you see the world and how others see you.  </p>", 
    "end_date": null, 
    "title": "Lose Weight Detox Heal - Proven Yet Little Known Remedies", 
    "price": "20.00", 
    "instructors": "Sam Sommer MBA, Heidi Preston", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559808_b2bf_5.jpg", 
    "course_url": "https://www.udemy.com/21-again-21-natural-ways-to-look-and-feel-21-again/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T21:43:02Z"
}