{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em><strong>=====&gt; Updated: 16 November 2015</strong></em></p><p><em><strong>- Bonus interview included with Amazon #1 Best Selling Author, CHEK Institute Panel Member and highly sought after speaker, Joanna Rushton.</strong></em></p><p>Nutrition &amp; Diet - Flexi Dieting: Count Your Macros &amp; Eat What You Want is a beginner's nutrition course that focuses on Carbohydrates, Fats and Proteins. Most importantly though, Mitch is qualified in Food Psychology, a ground breaking qualification that few posses. All diets and nutrition programs are useless, unless you know the behavioural patterns, behind the choices you are making.  </p>  <p>  \t<em>From Mitch:</em>  </p>  <p>  \t    \"If I could show you a way to change your diet, where you can still get the body of your dreams while still being able to eat your favourite sweet delights (in moderation of course) would that be something you would be interested in?\"  </p>  <p>  \t    Imagine if you could find the \"fountain of youth\" and experience boundless energy, vitality and newly discovered health through proper nutrition and dieting. Think about how you would FEEL if you could shake off chronic illnesses for good and step into a brand new body.  </p>  <p>  \t    What would it mean to you, to add another 5, 10 maybe even 20 years of prosperous life to watch your kids grow up into adults, and have children by having a proper nutrition plan or diet. Then you can watch those children have children and know you have lived and given as much love to your family as you possibly could.  </p>  <p>  \t    You will learn the following in this diet and nutrition course:  </p>  <p>  \t    • Nutritional Food Psychology  </p>  <p>  \t    • Why Do We Eat What We Eat?  </p>  <p>  \t    • What Drives Our Diet Choices?  </p>  <p>  \t    • What Are Macronutrients And Good Foods To Choose For Your Diet?  </p>  <p>  \t    - Fats  </p>  <p>  \t    - Carbohydrates  </p>  <p>  \t    -Protein  </p>  <p>  \t    -Alcohol  </p>  <p>  \t    • Diet Meal Timing &amp; Do You Really Need To Eat 7 Meals A Day?  </p>  <p>  \t    • Common Nutritional Tricks And Tactics That Are Misleading You  </p>  <p>  \t    • What Your Ideal Calorie And Macronutrient Intake Is For Your Diet!  </p>  <p>  \t    At the very least, watch the first video on nutrition. You will be given actionable steps for you to take away and use straight away in your diet, regardless of if you invest in this program or not.  </p>  <p>As you watch this online nutrition course in it's entirety you will Boost Cardiovascular Health, Increase Mental Health, Reach and Sustain Maximum Vitality. As well as Increase General Health, Reduce Stress and it will help you stay Disease Free.</p><p>Isn't it your turn to look and feel your best?</p><p>My passion in life is to inspire and reach as many people as I can to live a more fulfilled life through lifestyle and health awareness and coaching. This is just a small gift I give to you, to reboot your inner-self and get you on track to living a life where you thrive!</p><p><span></span>No matter who you are, I guarantee you'll learn at least one thing from this diet and nutrition class. Also as a huge bonus, I have added in a <strong><em>Voucher worth $198</em> </strong>that will benefit you more then you could ever know!</p>  <p>  \t    I will personally respond to any questions you may have as you go through the diet and nutrition course so there's no worry if you're not sure how to take all of the information and apply it to your life. So sign up now!  </p><p><em>The 100% Money Back Guarantee</em> - <em>This course comes with a 100%, no questions asked, money back guarantee. I am so confident in the course that if for whatever reason you are not fully satisfied, you will receive a full refund direct from Udemy. </em>So there is no risk on your part.</p><p><strong>Stop Sitting Around Any Longer, Click \"Take This Course\" At The Top Right, Enrol In This Course Now And Learn The Nutrition &amp; Health That Will Get You The Body You Desire!</strong></p><p>To your diet and nutritional success,</p><p>Mitch</p>", 
    "end_date": null, 
    "title": "Master Macronutrient Nutrition & Achieve Your Health Goals", 
    "price": "25.00", 
    "instructors": "Mitch Asser", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428788_34fc_4.jpg", 
    "course_url": "https://www.udemy.com/flexi-dieting/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T00:29:26Z"
}