{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is meant to teach you how much they should eat, how create a meal plan based on that amount, turn that mean plan into a shopping list and stick to it. </p>\n\n<p>Once you have all the items, the course walks you through preparing foods to be cooked at a later date, as well as portioning out prepared foods, to be served later. \n\n  </p>\n\n<p>This course includes 7 videos that walk you through each step of the processes, as well as templates for meal plans and shopping lists. </p><p>Calculations for calories, blog posts for reference, example meal plans, and bonus budgeting tips are also included. I am easily accessible for questions if you get stuck or run into any confusion along the way. </p>\n\n<p>This course will not take you a very long time to watch and learn from, however implementing the information will probably require you to come back and reference the videos multiple times. \n\n  </p>\n\n<p>My personal recommendation is to watch through all the videos, and then implement them one at a time, re-watching each one.  The course is laid out in the order you would complete each task, so that should not be a problem. \n\n  </p>\n\n<p>I believe that you should take this course because too many times people waste money on pre made meal plans, or pre made food, at a huge inflation. \n\n  </p>\n\n<p>Pre made meal plans are not set to exactly what you, and your family, like to eat. They don’t take into consideration trips, days off, or nights out. \n\n  </p>\n\n<p>Pre made food is often full of chemicals and the packaging associated with it really is a waste. Plus you spend double, if not triple, what you would by cooking for yourself.  \n\n  </p>\n\n<p>Taking this course puts the control of your food, and finances, back in your own hands! \n\n  </p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Meal Planning and Food Prep for Real Life", 
    "price": "20.00", 
    "instructors": "Amber Snow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711574_586a_2.jpg", 
    "course_url": "https://www.udemy.com/introtomealplanning/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T04:54:34Z"
}