{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t      If you&#039;ve ever wanted to improve the health of your brain and memory by 100%, 200%, 300% (or more), then this may be the most important video course you will ever take.  </p>  <p>  \t<strong style=\"\">Here is why: </strong>  </p>  <p>  \t      As you probably already know, diet is one of the only games in life that can be truly beaten. Unlike your career, finances or some of the things that happen by random chance, your diet is something that can be controlled. This means that the outcome of the health of your brain and your memory is entirely in your hands.  </p>  <p>  \t      That sounds simple enough, doesn&#039;t it?  </p>  <p>  \t      But it really isn&#039;t, and in this course, you&#039;ll learn what it truly means to eat healthy and in a way that increases the quality of your memory.  </p>  <p>  \t      To win at the diet game, you&#039;ve got to pay attention to the finer points. That&#039;s why this quick course focuses on the most relevant details. Instead of struggling through extremely complex books about what works and doesn&#039;t when it comes to brain and memory health, you can quickly walk away with all the information you need to make informed eating decisions.  </p>  <p>  \t<strong style=\"\">What About How To Eat?</strong>  </p>  <p>  \t      Many resources on eating well talk about what to eat. But the truth is that you also need to know <em style=\"\">how </em>to eat the foods that support a good memory. Just think how great it would be if you had a simple system you can revisit any time that tells you not only what to eat but how to approach your new diet in the right way.  </p>  <p>  \t      Would you like to try this amazing course on what not to eat, what to focus on instead and how to eat it? Would you like to see for yourself how easy and beneficial this can be for your memory?  </p>  <p>  \t      Sure you would!  </p>  <p>  \t      And now, here&#039;s the best part of all:  </p>  <p>  \t      This video course not only covers everything you need to remove from your diet, everything you need to introduce into your diet and exactly how to go about eating for brain health. It also includes the Ebook version of the entire course!  </p>  <p>  \t      You cannot lose in the game of dieting for brain health and memory when you take this course.  </p>  <p>  \t      Join today.  </p>", 
    "end_date": null, 
    "title": "Memory Destroying Foods: And What To Eat Instead!", 
    "price": "20.00", 
    "instructors": "Anthony Metivier", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315746_4dc7.jpg", 
    "course_url": "https://www.udemy.com/brain-health-memory-diet-video-course/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T11:17:58Z"
}