{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t<strong>  Men</strong> have unique physiology and health needs that are often neglected.  </p>  <p style=\"\">  \t<em>Life is short - why not live an optimized life.</em>  </p>  <p>When it comes to men's health care issues, there is a lot of information around, but very few authoritative sources.</p><p>Usually when someone talks about men and their bodies, they talk about big muscles, getting ripped, and getting women. There might be some people who want that, but the vast majority of my patients &amp; clients want to understand how to achieve optimal health. </p><p>What is optimal health?</p><ul><li>Healthy body weight – Getting in shape without trying to be Mr. Universe</li> <li>Heart health – Lowering cholesterol and blood pressure without prescriptions</li> <li>Taking supplements – Knowing which supplements work and which to skip</li> <li>Reducing inflammation – Preventing pain in joints and illnesses caused by cellular damage</li> <li>Better sleep – Understanding how to sleep well so you can be alert and active</li> <li>Improving gut health – A strong immune system and easy digestion are based on healthy eating and probiotics </li> <li>Stress management – Managing your responses so that they don't manage you</li> <li>Hair loss – Learning the reasons for and prevention of this common problem</li> <li>Erectile dysfunction – Why you are struggling with something you couldn't stop for decades</li></ul><p>All of these\nand many more men's health issues are covered in my course, The Optimal Living\nProgram. It's all about mind and body health leading you to optimal energy,\nfitness, stamina, performance, and longevity.</p><p>2,300 men\nhave already joined the program, each getting the information they need to get\nhealthy and stay healthy.</p>", 
    "end_date": null, 
    "title": "Men's Health 1.0 - Journey To Optimal Health", 
    "price": "20.00", 
    "instructors": "Mitchel Schwindt", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/359254_be5f_2.jpg", 
    "course_url": "https://www.udemy.com/mens-health-journey-to-optimal-living/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-29T18:52:20Z"
}