{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">If you are tired of overeating and feeling out of control around food, and diets just haven&#039;t worked for you, this is the course for you.  This course will teach you how to fundamentally change the way you eat.  By the end of the course you&#039;ll be transformed from a mindless eater into a mindful eater.</p><p style=\"\">In the beginning of the course you&#039;ll learn how to do a basic mindful eating exercise.  After you have that foundation, you can move on to the Mindful Eating Solutions section which targets specific eating problems.  You choose which lessons to do based on what issues you want to address.  </p><p style=\"\">Speed eaters: You&#039;ll learn how to slow down and enjoy your food.  Constant snackers: You&#039;ll learn how to wake up, break the spell, and start eating with intention.  Restaurant gorgers: you&#039;ll learn how to curb the habit while enjoying your food more than ever.  Social overeaters: You&#039;ll learn the root cause of your issue and how to overcome it.  Junk food junkies: You&#039;ll learn to listen to what your body really wants and how to nourish it effortlessly.</p><p style=\"\">If you think of yourself as the kind of person who just isn&#039;t a healthy eater, prepare to be surprised.  Your body knows what it needs.  You just have to learn how to listen to what your body is telling you.  Mindfulness is the key to unlock your inner healthy eater.</p>", 
    "end_date": null, 
    "title": "Mindful Eating: How to Stop Overeating and Enjoy Your Food", 
    "price": "25.00", 
    "instructors": "Daxle Collier", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438340_7bbf_3.jpg", 
    "course_url": "https://www.udemy.com/mindful-eating-how-to-stop-overeating-and-enjoy-your-food/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T05:46:37Z"
}