{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>What this course offers:</p><ol><li>Introduction to the Body's Digestive System<ol><li>Internal Digestive System Anatomy and Physiology</li></ol></li><li>Food<ol><li>Food Choices, Whole Foods, Eating Habits</li></ol></li><li>Nutrient Acquisition<ol><li>Metabolism, Body Fat, Endocrine System</li></ol></li><li>Digestive Pathology<ol><li>7 Digestive Diseases</li></ol></li></ol>Remedies<ol><li>Digestive Herbs, Vitamins, Minerals, Stress Control</li></ol><p>This course it taught with video lectures and some downloadable documents</p><p>Useful EBOOK (only +$2.99!</p><p><strong>Why you need to be in this course:</strong></p><ol><li><em><strong>You probably forgot what you learned back in high school or college biology.</strong> This course will be a refresher. If you want to be confident in your recommendations as a community healer or while giving advice to friends or family, you must understand the basics – the foundation!</em></li><li><em></em><em><strong>The gut is a mysterious system in our bodies that we consciously and subconsciously interact with on a daily basis. Do you know your gut? Would you like to know it better?</strong> People always ask me questions like “is gluten really bad?” or “how does the digestive system affect the sex organs?” or “should I use probiotics”? </em><em>We’ll this is your chance to get the majority of your questions answered. There’s so much stuff out there that is in the way of the pertinent and correct information you need, so this course will help you (1) filter better, and (2) answer your questions about the gut (that you may be afraid to ask – lol!) </em><em>I’ll tell you right now, I don’t know everything, and I don’t want to. But, I can help you make knowledgable decisions about gut health.</em></li><li><strong><em>You know that poor digestion comes from artificial foods, and poor digestion is the root of almost every disease... </em></strong><em>Well, maybe you didn’t know, so that’s a good reason why you should take this course.</em><em>The digestive system is where we take in nutrients to use as energy to power all of our organs &amp; tissues. Yes, we do get energy from the sun, and air (breathatarians), but most of us get the majority from the food we consume. Therefore, having a healthy gut is 1) important and 2) easy to mess up. Especially, if we are constantly consuming food and drink that’s harmful to us. After taking the course…no more guessing about what’s good, what’s not, what’s clean, what’s healthy, what’s harmful. That’s for the birds! You’ll get Straight Talk and the info to make up your own mind! Lesson 2 of the course is all about FOOD. We’ll talk about types of foods (whole, processed, frankenfoods), food choices and habits, and types of eating. What type of eater are you?</em></li></ol><p><em></em></p>", 
    "end_date": null, 
    "title": "Natural Ways to Healthy Digestion ", 
    "price": "40.00", 
    "instructors": "Jennifer Hutchison MSc, CCMH", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670338_6eb4.jpg", 
    "course_url": "https://www.udemy.com/natural-ways-to-healthy-digestion/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-15T14:08:15Z"
}