{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \tMany people desperately want to eat the “right” foods. But eating the right foods can seem impossible because every month or so there’s a new way to eat healthy. Should we eat dairy or not? Should we eat whole grains, or avoid gluten? Is soy good or bad? The list goes on.  </p>  <p style=\"\">  \tThe message changes all the time and becomes impossible to follow, especially because no diet or trend seems to make any more sense than any other diet or trend. To make it worse, there doesn’t seem to be any one authority that we can trust.  </p>  <p style=\"\">  \tThat’s why trying to eat right is so hard for so many people—how can you “eat right” when you can’t be sure what it means to eat right in the first place?  </p>  <p style=\"\">  \t<strong style=\"\">This course will teach you a straightforward, clear, and logical way to understand human nutrition in about as much time as it takes to go to the movies.</strong>  </p>  <p style=\"\">  \tIn this course, we will cover:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">The crazy inaccuracies in the so-called Nutrition Facts panel (in the first video)</span></li>  \t<li style=\"\"><span style=\"\">The importance of healthy fats, and what healthy fats really are</span></li>  \t<li style=\"\"><span style=\"\">Why those added antioxidants might not be doing you any favors</span></li>  \t<li style=\"\"><span style=\"\">The truly optimal fuel for your body that you must consume each day</span></li>  \t<li style=\"\"><span style=\"\">How grains actually fit into a healthy diet</span></li>  \t<li style=\"\"><span style=\"\">What kind of animal products you’ll want to eat (and avoid)</span></li>  \t<li style=\"\"><span style=\"\">What cleansing actually is, and what to do about it</span></li>  \t<li style=\"\"><span style=\"\">Why we crave what we crave</span></li>  \t<li style=\"\"><span style=\"\">What “natural food” really is and why it matters</span></li>  \t<li style=\"\"><span style=\"\">The critical connection between diet and exercise</span></li>  \t<li style=\"\"><span style=\"\">… and much more!</span></li>  </ul>  <p style=\"\">  \t<strong style=\"\">You really can finally understand what is healthy, what is not and why—all in less than three hours.</strong>  </p>  <p style=\"\">  \tThe best part of this course is that it&#039;s designed to be clear and concise, so you can understand and apply the information without needing any advanced understanding of nutrition or biology.  </p>  <p style=\"\">  \tWe’ll look at ten themed video lectures covering important topics like Fat, Grains, Fruit, and Cravings. Then we’ll look at a catch-all lecture for all the important issues that aren’t specifically related to the content covered in the other videos. Finally, we’ll review all the major points from each lecture, and close with four key actions we need to take to put these ideas in action.  </p>  <p style=\"\">  \tThe ideal student for this course is feels unsure about what it really means to eat healthy, and wants to clear up the confusion once and for all. If you&#039;re interested in finally understanding what’s healthy and what’s not, click the enroll button and get started today.  </p>", 
    "end_date": null, 
    "title": "Never Diet: Simple, Clear, Reasonable Human Nutrition", 
    "price": "20.00", 
    "instructors": "Patrick Barrett", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375738_690b.jpg", 
    "course_url": "https://www.udemy.com/never-diet-simple-clear-reasonable-human-nutrition/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T18:21:34Z"
}