{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>¿Alguna vez te has sentido triste y has comido sin fin? ¿Te notas estresado y te liberas comiendo? ¿Consideras que comes demasiado y crees que no tienes control sobre lo que comes? ¿Te has puesto a comer una tarrina grande de helado que sin darte cuenta has terminado por completo? ¿Has estado alguna vez en una comilona, te has sentido lleno pero aún así tomas postre y terminas de explotar? Todas estas situaciones nos llevan a lo que se llama comer inconscientemente. En este curso, vas a aprender a comer plenamente consciente. </p><p><strong>Cultivar el Comer con Conciencia de una Manera Sencilla, Conociendo las Necesidades de tu Cuerpo y Mente.</strong></p><ul><li>Reconocer y diferenciar tus hábitos inconscientes y conscientes a la hora de comer.</li><li>Aprender a escuchar a tu cuerpo y saber cuales son sus necesidades.</li><li>Aprender a estar en armonía con lo que comes.</li></ul><p><strong><br></strong></p><p><strong>Construir un vínculo sano y equilibrado con nuestra comida.</strong></p><p>En el curso vamos a ver cómo llegar a entender cómo es nuestra alimentación y por qué comemos como comemos. Poder ser más consciente de lo que estás comiendo. Saber si de verdad tienes hambre o estás comiendo porque estás estresado, tienes ansiedad u otras emociones. Comer plenamente consciente te va a ayudar a alcanzar una relación sana y equilibrada con la comida y así, poder disfrutarla más.</p><p>Antes de centrarme en lo que es comer conscientemente, explico unos conceptos básicos e nutrición y cómo ha ido cambiando a lo largo del tiempo. También explico los conceptos básicos sobre el estrés y cómo nos afecta estar estresados a comer. Comer inconscientemente incluye cómo nos afecta nuestro ambiente y nuestro alrededor a la manera en la que comemos. Por último, comer plenamente conscientes lo explico desde dos enfoques de diferentes autores. Ambos para llegar al mismo objetivo pero de diferentes maneras. Así, puede haber ejercicios de un enfoque que se adapten más a unas personas y ejercicios del otro enfoque a otras personas.</p>", 
    "end_date": null, 
    "title": "Nutrición: mejora tu relación con la comida, \"eat mindfully\"", 
    "price": "30.00", 
    "instructors": "Catriona Villagarcía Balmer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743800_81e7.jpg", 
    "course_url": "https://www.udemy.com/nutricion-mejora-tu-relacion-con-la-comida-eat-mindfully/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T17:20:50Z"
}