{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li><strong>Content updated November 2015</strong></li><li><strong>1147 students enrolled in the first month</strong></li><li><strong>100% five-star reviews</strong></li></ul><p>---------------------------------------------------------------------------------------------------------------------------</p><p>Recent reviews: </p><p>\"Some really great comprehensive and informative nutrition advice that can be followed by everyone not just entrepreneurs. Some very useful hints and tips that can be put into action straight away. I've always been I into health and nutrition but even I gained a lot of new info from this course, especially in relaation to sugar and gluten - 2 things on which there is so much misinformation on out there. The guys have done a superb job putting this course together and I cannot recommend it enough\"<br></p><p>\"I have always been focused the relationship of high levels of mental performance with fitness and diet. This course delves deep into gluten and refined sugars which I have always known were detrimental to my energy, but had never taken the time to do the comprehensive research needed to change my diet properly. This course is an extremely helpful shortcut to the correct path.<span>\"</span></p><p><span>---------------------------------------------------------------------------------------------------------------------------<span><br></span></span></p><p>Learn how to implement two simple rules that will help you drastically improve your energy levels, lose weight and improve your long term health: stop eating gluten and refined sugar.</p><p><strong>No more counting calories, complicated diets and worrying about how much you eat.</strong></p><ul><li>What foods to avoid </li><li>What foods to focus on  </li><li>How to implement this in your life</li><li>How to make it fun and sustainable </li></ul><p><strong>A Simple but Powerful Way to a Healthier Lifestyle</strong><br></p><p>Why this is a great hack for entrepreneurs like you is (1) the rules are easy to learn, (2) don’t require additional time, and (3) they provide you increased energy levels in a relatively short time. <br></p><p>Jasper and Ian both follow these rules in their own lives. Jasper lost five pounds in the first month and Ian lost over 35 pounds in nine months, both without exercising and both have much higher, more consistent energy levels than they did before. </p><p><strong>Why is excluding sugar and gluten so effective?</strong> </p><ol>\n<li>You don’t have to worry about counting calories </li>\n<li>You can eat as much as you want</li>\n<li>All you need to do is choose the right type of foods</li>\n<li>You can still have cheat meals, you don’t have to become a food-extremist </li>\n</ol><p>It’s an 80-20 approach, you <strong>spend very little time and energy</strong> implementing the changes, but they will lead to a <strong>very significant results</strong>. Is it perfect?</p><p>The most powerful aspect of this diet is that the simplicity makes it <em>sustainable</em> and <em>easy to implement</em>. After all, we all know what’s healthy, the trick is to adopt a diet that you can stick with in the long term. </p><p><strong>Who is this course for? </strong></p><p>This course is suitable for entrepreneurs in any niche. As an entrepreneur, you don't have time to spend hours a day figuring out what to eat, counting calories and preparing your own food. You may be traveling a lot and eating out in restaurants often. </p><p>You need a simple and sustainable way to improve your energy levels and stay healthy and fit. This course will teach you exactly how to do that. </p><p><strong>Course content</strong></p><p>Through this short and to-the-point course of 30 lectures and just over an hour of video, you’ll learn exactly what foods to eat and how to make the change in a sustainable, fun and efficient way. </p><p>The course also provides background information as to why these rules work and make sense, as well as a very detailed overview of a daily food intake example, including all nutritional values.</p><p>Go ahead and watch the promo video or some of the free preview videos and we look forward to seeing you inside! </p><p>Jasper &amp; Ian. </p>", 
    "end_date": null, 
    "title": "Nutrition Hacks for Entrepreneurs - Get Healthy and Fit ", 
    "price": "20.00", 
    "instructors": "Ian Bednowitz, Jasper Ribbers", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657142_5c23_3.jpg", 
    "course_url": "https://www.udemy.com/nutrition-hacks-for-entrepreneurs-get-healthy-and-fit/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T17:36:15Z"
}