{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Una correcta nutrición es vital para cualquier persona que quiera vivir sana, estar en forma y prevenir un sinfín de enfermedades, destacando el sobrepeso y obesidad. Por eso, en este curso podrás aprender todo lo relacionado con nutrición, desde un aspecto científico actualizado, por lo que estarás invirtiendo no solo en conocimiento, si no en lo más importante: Salud. </p><p>Aprenderás a ser reflexivo, a discriminar alimentos, a desterrar mitos, hacer la compra y a no incluir ciertos alimentos en tu día a día, pero lejos de lo absurdo de pasar hambre, o tener ansiedad por la comida o por la dieta. Conocerás trucos y obtendrás herramientas valiosas para hacer compras inteligentes en el supermercado, para controlar tu peso, para que algún ''atracón'' esporádico no resulte tan devastador</p><p>Vas a cambiar la perspectiva que tenías de muchos aspectos relacionados con la nutrición, ya sean alimentos, hábitos, mitos...y vas a tomar conciencia de todo, para que puedas hacerte el control de tu salud y que nadie te engañe. </p><p>Conseguirás sentirte vital, con una mejor composición corporal y estética y mayor energía para afrontar tu día a día, por lo que rendirás más en tu trabajo, estudios o deporte que realices. </p><p>Más de 2 horas de aprendizaje. Siéntate y disfruta a lo largo de los 35 vídeos que hay preparados para ti, en los que además tendrás contenido descargable y un montón de recursos para maximizar tu aprendizaje. </p><p><br></p>", 
    "end_date": null, 
    "title": "Nutrición Vital: Guía definitiva de Nutrición y Salud", 
    "price": "50.00", 
    "instructors": "Daniel Sánchez", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615610_d576_4.jpg", 
    "course_url": "https://www.udemy.com/nutricion-vital-guia-definitiva-de-nutricion-y-salud/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T08:59:43Z"
}