{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The dream of staying youthful is as old as mankind, yet few progresses have been made in gerontology, the science of aging. Yet since the 1930s a dietary intervention has been increasing the lifespan of several lab species. </p><p><strong>Learn what calorie restriction with optimal nutrition (CRON) is, why it may prolong your healthspan and lifespan and master the basics to practice it in a safe and rational manner. </strong></p><p><strong><strong></strong></strong><strong>At the end of this online course, you will:</strong><strong><strong></strong></strong></p><ul><li>Know what calorie restriction with optimal nutrition is and what is not</li><li>Be familiar with the basic principles of calorie restriction with optimal nutrition</li><li>Learn when skipping calories is a bad idea, when it may be postponed and when it's the right thing to do</li><li>Know how to monitor themselves before and after at least 6 months on calorie restriction with optimal nutrition</li><li>Be familiar with calorie restriction mimetics, approaches that may substitute or complement skipping calories in the future</li></ul><p><strong>Anyone can skip calories today. Learn how to do it safely to increase your healthspan first and lifespan second. Recognize the main classes of Calorie Restriction Mimetics, approaches and drugs that mimic calorie restriction without limiting food intake. </strong></p><p><strong></strong>This online course contains video lectures, quizzes and a bibliography for delving into the scientific studies done on calorie restriction with optimal nutrition.</p><p>I designed this course to be easily understood by absolute beginners with no background in nutrition or medicine in general. Of course, if you have such a background, you will enjoy it even more. </p><p>You will receive a certificate of completion upon finishing the course. <strong></strong></p>", 
    "end_date": null, 
    "title": "Optimize your nutrition in less than 1 hour!", 
    "price": "20.00", 
    "instructors": "Anca Ioviţă", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416576_5310_3.jpg", 
    "course_url": "https://www.udemy.com/eat-less-live-longer-beginner-level/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T16:49:47Z"
}