{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>The Cycle Diet has been tested and proven for 30 years! The Cycle Diet has been used successfully by clients in the <em>real-world</em> to stay lean while enjoying fun cheat days where truly \"anything goes\"!</strong></p><p><span></span></p><p>+++++++++++++++++++++++</p><p><em>\"I've been a coaching client of Scott for over a decade now and have been using the cycle diet for almost that length of time too. I can say without any hesitation that this is the best diet to follow to stay ripped year round and indulge in all your favourite foods all while making cosmetic improvements to your physique.\"</em><em></em></p><p>- Andy Sinclair, fitness model (Andy is featured in the course!)</p><p>+++++++++++++++++++++++</p><p><span></span>The Cycle Diet is not like other diets out there that promise you that you can lose weight eating whatever you want. No. The Cycle Diet is a reasonable, sustainable lifestyle, but it also takes a certain level of discipline. </p><p>For example, with the Cycle Diet, you don't just \"add in a cheat day.\" <strong>Instead, y</strong><strong>ou put your body in what we call \"Supercompensation Mode\" so that a huge influx of calories (a \"cheat day\") is exactly what your body needs.</strong></p><p>In this course, you will learn everything you need to know to start Cycle Dieting: what foods to eat and how much, how to read your biofeedback,how to get into supercompensation mode and stay there, and much more.</p><p><br></p><p><strong>\"COAX THE BODY AND IT RESPONDS; FORCE THE BODY AND IT REACTS\"</strong></p><p>The Cycle Diet is all about coaxing your body and your body's metabolism and your bodyweight setpoint. I've always said that the metabolic and hormonal environment into which calories enter is what <em>really</em> matters for sustainable weight loss. The Cycle Diet is all about manipulating that same metabolic and hormonal environment over the long term, as a sustainable solution to weight loss and weight maintenance.</p><p>Most diets only think in the very immediate realm of time. However, you have to consider the immediate effects, the residual effects, and the more long-term cumulative effects. Most diets \"feel great\" as you're losing fat at first, but under the surface the body is responding metabolically and hormonally, and eventually you get the inevitable \"diet rebound.\" You can only force the body for so long before it reacts. To achieve longterm results, you have to coax your body. In other words, don't work \"on\" your body; work \"with\" your body. </p><p>This is what the Cycle Diet was designed to do. <strong>The Cycle Diet is NOT a \"weight loss\" diet; it is a \"metabolism\" diet. </strong>This is because any sustainable solution must be \"metabolism first\" in my opinion.</p><p>To my mind, any diet strategy must meet two essential criteria:<em></em></p><ol><li><em>It must serve the body.</em></li><li><em>It must be sustainable.</em></li></ol><p>I have been doing the Cycle Diet myself and with clients for 30 years, so I consider it <em>very</em> sustainable. I used it myself to stay \"guest posing\" ready for bodybuilding contests, and near photoshoot ready year-round. Andy, a fitness model whom you heard from above, uses it to stay within \"striking distance\" of photoshoot ready: meaning that when he has a photoshoot, all he does is cut out a cheat day or two beforehand, and he's ready for the covers of magazines. (I should add that Andy is a fitness model, so that's just for the magazines. Truth is he still looks fantastic even when he has the cheat day.) <strong>Check out the free preview of the \"The 'Goals' of the Cycle Diet\" video, as well as some of the CASE STUDIES videos, to see more examples of what I mean.</strong></p><p><br></p><p><strong>You Will Learn:</strong></p><ul><li>How cheat days and overfeeds <strong>can serve the body</strong> IF you are in the right metabolic and hormonal state, what's called \"supercompensation mode,\" or simply, \"Supercomp.\"</li></ul><ul><li>How to <strong>read your own body's biofeedback</strong> to determine when you are in \"supercompensation mode\" and a cheat day is exactly what your body NEEDS.</li><li><strong>How to \"graduate\" from simple cheat meals, to half-day cheats, to full-day cheats.</strong></li><li><strong>The Right Mindsets </strong>for making this diet part of a reasonable, sustainable lifestyle.</li><li><strong>Actual daily meal plans</strong> for your diet days, plus information on how to tweak them, or construct your own from scratch.</li><li>What kind of weight training works best with the Cycle Diet.</li><li><strong>How to evaluate if a cheat day \"went well\" </strong>and whether you should keep them in your diet. (And what to do if it didn't go well!)</li><li>How to determine <strong>what foods to include in your diet day meals plans</strong>, based on your own body's needs and signals.</li><li><strong>Variations of the Cycle Diet</strong> that Scott has \"tweaked\" with different clients, depending on their needs, backgrounds, and goals.</li></ul><p><strong>...and MUCH MORE!</strong></p>", 
    "end_date": null, 
    "title": "Optimize Metabolism with Fun Cheat Days and \"The Cycle Diet\"", 
    "price": "45.00", 
    "instructors": "Scott Abel,  Michael Lesiuk", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664122_cc99_6.jpg", 
    "course_url": "https://www.udemy.com/cycle-diet-optimize-metabolism-with-cheat-days/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T21:26:58Z"
}