{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">Chef Teton - 68 Years Young.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>&quot;This picture was  spontaneously taken with an Iphone by a friend October 6, 2012, fresh  out of the water dripping wet, no air-brushing.  </p>  <p style=\"\">  \t       It   took me a  lifetime to learn everything I have about nutrition. I   discovered  through a vibrant path that started with learning &quot;Raw   Living&quot; foods  in 1990. Pounds drifted away and I became in love with all  the amazing  foods I got to eat. Then I learned more!  </p>  <p style=\"\">  \t       Through the next 20  years I went on to devour  everything I could about nutrition, health  trends with the emerging  natural foods industry. I have had the  pleasure with working with the  best health professionals and chefs in  the world.  </p>  <p style=\"\">  \t       But my body and the  results  others achieved were my best teachers. From &quot;Raw Living&quot; foods I  went on  to incorporate the best of &quot;Cooked Foods&quot; and blended them with  the ancient  traditions of Ayurvedic cooking and &quot;Cultured and  Fermented&quot; foods.  </p>  <p style=\"\">  \t       People raved about my  skin and remarked that I had reversed the signs of aging. I became  free! Now you can too. It is simple, fun and rewarding!  </p>  <p style=\"\">  \t  I began my nutrition and cooking career 24 years ago to create what I call, &ldquo;<strong style=\"\">Essential Cuisine</strong>&rdquo;.  </p>  <p style=\"\">  \t<strong style=\"\">Essential Cuisine</strong> is not an either/or dietary practice. It instead is a both/and if you know what I mean.  </p>  <p style=\"\">  \t  Six years ago I produced <strong style=\"\">Essential Cuisine&rsquo;s 6 Set DVD</strong> series with 55 cooking shows that teach the basics of what a person needs to know to establish a foundational - nutritionally sound diet to last a lifetime.  </p>  <p style=\"\">  \t  I produced visual shows because that is how I learned, by watching a passionate, knowledgeable teacher. The shows are professional - two camera angle cooking shows, along with nutrition education and recipes.  </p>  <p style=\"\">  \t  The series includes how to make <strong style=\"\">Raw Foods</strong>, with the best of <strong style=\"\">Cooked Foods</strong> and <strong style=\"\">Cultured/Fermented Foods</strong> - All things &quot;<strong style=\"\">Essential&quot;</strong> for a thriving healthy life.  </p>  <p style=\"\">  \t  This <strong style=\"\">Essential Cuisine</strong> series is now available in this course.  </p>  <p style=\"\">  \t  A note about Raw: Raw food is particularly difficult to learn by a book. Raw food cuisine involves a whole new way of working with nuts and seeds. It is really simple once you learn it.  </p>  <p style=\"\">  \t  Also, a Raw Food Diet is not a sustainable diet for most. People want cooked foods too, and there are simple and delicious methods to include cooked veggies and grains into your daily meals. Some foods are always best raw, and there are others that are better cooked. In this course, you will learn the difference.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">*Note:</em></strong><em style=\"\"> To read more about the Raw part of this course, please see my Udemy Course on Raw Foods. The Raw, Cooked &amp; Cultured Couse here includes the Raw Course <strong style=\"\">PLUS</strong> a complete section on mixing raw and cooked together along along with Cultured Foods AND a Bonus series on Raw Cacao Desserts. </em>  </p>  <p style=\"\">  \t  There is more. The Centenarians, those people who live to be a healthy 100 years old in various locations in the world, all have a naturally fermenting food in their diet. What does this mean? It means that a naturally fermented food (like un-pasteurized Sauerkraut and Kim Chi) will most likely support your body with what it needs to grow old healthfully.  </p>  <p style=\"\">  \t  Naturally fermented foods aid digestion, assimilation and immune building capabilities. Having an inner eco-system, or intestinal track, that is full of friendly Flora and brimming with good bacteria, which are present in naturally fermented foods, is one of the best ways to digest and absorb the nutrients from your meals.  </p>  <p style=\"\">  \t<strong style=\"\">In this course you will discover the secrets to staying slim, healthy and energized!</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Learn how to combine RAW Living Foods with the best of      Cooked Foods</li>  \t<li style=\"\">Learn the incredible - not to be missed - digestive      power of Cultured/Fermented Foods</li>  \t<li style=\"\">Learn ancient traditions of powerful healing foods to      build strong immunity</li>  </ul>  <p style=\"\">  \t<strong style=\"\">With &quot;how to&quot; Video Instruction: </strong>  </p>  <p style=\"\">  \t<strong style=\"\">1. Learn how to soak, sprout, blend and dehydrate, the necessary steps to learn raw food culinary skills. Then you will be able to pick up any raw food cook (or un-cook) book and understand the basics.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">2. Learn how to blend Raw Food and Cooked Food together. Understand what is best to keep raw, and what is best cooked is vital to a diet is not only wholesome and nutritious, but also simple and sustainable. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">3. Learn to make highly nutritious sauces and dressings that awaken cooked veggies and wholesome alkaline grains.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">4. Learn what fats nourish your cells and can actually aid you in weight loss. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">5. Learn how to get the Essential Fatty Acids and Omega 3 fats into your diet the delicious way.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">6. Learn the secrets of how to mineralize your meals and coordinate simple meals that nourish and taste amazing. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">7. Make delicious and oh so nutritious desserts - good enough to swoon over. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">8. Finally, you will learn how to make your Cultured Vegetables and Kefir. Cultured Veggies are the rave because they are the missing link in most people&rsquo;s diet that are absolutely needed for a strong digestive and immune system. In addition, they are delicious, making every meal complete!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Award Winning Recipes: Included are all of my delicious recipes with, and without, pictures so they are easy to view and easy to print. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Resources: For traveling, purchasing equipment, and specialty foods. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">Plus a BONUS: The Raw Cacao Dessert series!</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">This course is for people </strong>who want to learn a &quot;way of life&quot; not a temporary diet. They want to loose weight and keep it off. They want to heal and prevent disease. They want to look and feel as beautiful as possible.  </p>  <p style=\"\">  \t  And, they want the pleasure of eating the most delicious food on the planet!  </p>  <p style=\"\">  \t<strong style=\"\">Join Me Now!</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Do you      have a pile of diet books, DVD&#039;s, recipes, and information from magazine      articles? </strong></li>  \t<li style=\"\"><strong style=\"\">Do you      get confused? Do you struggle with finding time to make the changes you      want? </strong></li>  \t<li style=\"\"><strong style=\"\">Do you      want to loose weight and keep it off? </strong></li>  \t<li style=\"\"><strong style=\"\">Do you      want to heal parts of your body that are beginning to break down? </strong></li>  \t<li style=\"\"><strong style=\"\">Do you      want to look more beautiful and turn back the clock? </strong></li>  \t<li style=\"\"><strong style=\"\">Do you      want more pleasure and better results?</strong></li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t  &ldquo;What Susan Campbell provides is simple: a powerful and effective path to enhanced health and the prevention of many chronic diseases. Her books, documentari<strong style=\"\"><strong style=\"\">es and </strong></strong>DVDs will help millions to realize their optimum health potential.&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\">- John Robbins, author of Diet for A New America</strong>  </p>  <p style=\"\">  \t  &quot;I love, love, love your DVD&rsquo;s!!! I like how you explain things really well, you also demonstrate the easy basic things that are new to lots of people, and it&rsquo;s very personal with you interacting with the viewer. WELL DONE and congratulations!!!&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">- Amy Bacheller, M.Ed, NC, CMT</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;Chef Teton is on a nutrition crusade to help give us Americans some exciting new &amp; tasty food ideas. I highly recommend her wonderful series of DVD&rsquo;s which are a culmination of two decades of food knowledge.  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\"><strong style=\"\">- GardenChef, Paul F. Wenner, author and founder of the GardenBurger</strong></strong></strong>  </p>  <p style=\"\">  \t  &ldquo;Chef Teton opened the door of possibility of what to do with oils and salt!! Her food is fabulous!&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">- Nancy Stroehecker, PR Consultant, LA, CA</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;As a Colon Hydrotherapist I support people in the process of internal cleansing and detoxifying their bodies through diet. My clients are eager and ready to learn the basics and benefits of raw foods, and return to a more natural way of nourishing their bodies. And Chef Teton does it all! With simplicity, elegance and flare, her DVD collection is a MUST for regenerating the body and spirit through living food.&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">&ndash; Gyan Bohannon, Certified Colon Therapist, Makawao, Maui, Hawaii</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;Chef Teton, Your DVDs should be mandatory for every dietitian, nutritionist and natural health practitioner! Each one contains essential information that can turn on the genes for optimum health and turn off the cycle of weight gain, degenerative disease, and serious illness. Watching hands-on food preparation of natural foods by a pro is the only way to master these kitchen cuisine secrets in a short period of time. And they&rsquo;re so pleasant to watch. Your smiling face and professional style contributes greatly to their &ldquo;addictiveness.&rdquo; Now, when I&rsquo;m in the kitchen, I think, &ldquo;What would Chef Teton do?&rdquo; and you gave me the courage to experiment more with raw and wholesome foods. Great recipes, too! I&rsquo;m referring your DVD series to every patient and dear friend!&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">&ndash; Dr. Donna Schwontkowski, Chiropractic physician (ret), M.S. Nutrition, Masters in Herbology</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;Chef Teton puts a whole new spin on nutritious eating. Not only did she show me how to create scrumptious easy to make meals, she informed me of the benefits of the food being prepared. From EFA rich oils, nuts, grains, fruits, vegetables, and salt, to where to find proteins, omega 3&rsquo;s, and minerals that will keep my skin radiant and my joints flexible. The methods in Essential Cuisine makes for an easy transition to healthier eating habits with foods that are absolutely delicious.&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">&ndash; Cheryle Easter, Film Maker, Portland, Oregon</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;When I became an herbalist, one of the courses was how to incorporate raw and wholesome foods into the diet. I loved that class, but over the years, wished I could find additional instruction so I didn&rsquo;t have to re-invent the wheel (and have cooking disasters along the way). Your DVD series is exactly what I&rsquo;ve been looking for and it is so much more than what I ever expected to find. It&rsquo;s vibrant, it&rsquo;s exciting, it&rsquo;s real, and it&rsquo;s full of tricks and tips to decrease the learning curve&hellip; After just the first DVD, I was experimenting in the kitchen again, and loving every minute of it! Thank you for all your hard work. This DVD series will change the health of America, one mouthful at a time.&rdquo;  </p>  <p style=\"\">  \t<strong style=\"\"><strong style=\"\">&ndash; Louisa Blackstone</strong></strong>  </p>  <p style=\"\">  \t  &ldquo;The course was beyond what I had expected it to be, so the value of the course went way beyond what my expectations were. I was hoping to get just a basic questions and answers. Instead I got new thoughts and directions that I did not even think about. This series went way beyond what I was expecting.  </p>  <p style=\"\">  \t <strong style=\"\">With Chef Teton&rsquo;s Essential Cuisine DVD Series </strong>  </p>  <p style=\"\">  \t <em style=\"\"><strong style=\"\">And Award Winning Recipes!</strong></em>  </p>  <p style=\"\">  \t       Now you can have the <strong style=\"\">BEST</strong> possible diet in your life in the comfort of your own home and with your own personal coach!  </p>  <p style=\"\">  \t <strong style=\"\">This power packed DVD video series is designed to help you incorporate a a new diet to last a Lifetime.</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Watch unwanted pounds melt away without going hungry!</li>  \t<li style=\"\">Create radiantly beautiful skin!</li>  \t<li style=\"\">Have the flat stomach you always wanted!</li>  \t<li style=\"\">Enjoy abundant energy and deep sleeps!</li>  \t<li style=\"\">Move again with flexible joints! </li>  \t<li style=\"\">Create flowing digestion!</li>  \t<li style=\"\">Enjoy a balanced emotional body and mental clarity!</li>  \t<li style=\"\">Enjoy rich, delicious, and sensuous food every day!</li>  </ul>  <p style=\"\">  \t <strong style=\"\">Do this and more by discovering the secrets to staying slim, healthy and energized!</strong>  </p>", 
    "end_date": null, 
    "title": "Raw, Cooked & Cultured/Fermented Foods", 
    "price": "40.00", 
    "instructors": "Susan Teton", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125410_1c1a_13.jpg", 
    "course_url": "https://www.udemy.com/eat-to-look-feel-fantastic/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-26T02:30:16Z"
}