{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This course is designed to help you fine tune your own RebalanceDiabetes nutrition plan. It contains all the information and tools to help you </p>\n\n<ul><li>identify your own individual micro-nutrient requirements </li><li>tap into the wisdom inherent in traditional Chinese dietetics. </li></ul>\n\n\n\n<p>It sits in the family of RebalanceDiabetes courses all written to provide effective guidance and support for anyone affected by diabetes or blood sugar problems. It will also help anyone interested in healthy eating or healthy weight loss. <br></p>\n\n\n\n<p>My videos have been professionally produced, filmed and edited to bring you a quality learning experience, and are accompanied by relevant downloadable materials, including an entire chapter excerpted from my boo 'the 6 diet'. You'll learn more about your own nutritional requirements and exactly how to source minerals and vitamins to maximise the benefits you can achieve through your RebalanceDiabetes nutrition plan. You'll be provided with my specially designed questionnaires to help you assess your own needs, and nutritional tables to access your ideal solutions.</p>\n\n\n\n<p> RebalanceDiabetes has helped many people successfully gain control of their diabetes or to avoid diabetes, lose excess body fat and look and feel better with more energy and vitality. If these are the results you're looking for this is a must for you.</p>", 
    "end_date": null, 
    "title": "RebalanceDiabetes Tailored Plan", 
    "price": "50.00", 
    "instructors": "Elaine Wilson", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827838_09e9.jpg", 
    "course_url": "https://www.udemy.com/rebalancediabetes-tailored-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T07:12:05Z"
}