{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \tEstamos diseñados para consumir ciertos alimentos que estaban disponibles durante millones de años mientras evolucionábamos como especie. Desde que descubrimos la agricultura y más aún recientemente hemos cambiado drásticamente lo que comemos (sobre todo inventando ciertos alimentos procesados), nuestro cuerpo no ha podido evolucionar lo suficientemente rápido y el exceso en el consumo de estos alimentos nos enferma (malestares como insomnio, acumulación de grasa corporal, bajos niveles de energía, enfermedades en la piel, cambios de humor y eventualmente enfermedades muy graves como diabetes, obesidad, Alzheimer, Cáncer, Parkinson, artritis, etc.)  </p>  <p>  \tPor el contrario lo que sí estamos diseñados para comer no solo nos hace bien sino que contiene todo lo necesario para mantener tu organismo fuerte y saludable.  </p>  <p>  \tConseguiremos entre otras cosas:  </p>  <div>  \t-Sana relación con la comida.  \t<p>  \t\t-Quema de grasa corporal acumulada.  \t</p>  \t<p>  \t\t-Reducir alergias.  \t</p>  \t<p>  \t\t-Energía estable todo el día.  \t</p>  \t<p>  \t\t-Niveles estables de azúcar en la sangre.  \t</p>  \t<p>  \t\t-Dormir más y mejor.  \t</p>  \t<p>  \t\t-Romper con la adicción al azúcar.  \t</p>  \t<p>  \t\t-Un sistema inmunológico en óptimo funcionamiento.  \t</p>  \t<p>  \t\tSe que suena difícil regresar a comer como nuestros antepasados pero, en realidad, es mucho más simple de lo que crees. Simplemente se trata de comer más de las cosas que te hacen bien, mucho menos de aquello que te esta enfermando y encontrar un equilibrio sostenible y saludable…  \t</p>  \t<p>  \t\tPara ello diseñamos el Reto Paleo que consta de 2 partes. Primero un curso muy completo diseñado para aprender a profundidad la nutrición (necesito que sepas qué es la comida, cómo funciona en tu cuerpo, qué te hace bien, qué te hace mal, qué y cómo comer, etc.).  \t</p>  \t<p>  \t\tDespués, de manera opcional y completamente GRATIS puedes hacer con nosotros un reto de 30 días comiendo con nuestras recomendaciones sin ninguna trampa, lo cual te ayudará a perder la adicción a los alimentos procesados y a reajustar tu organismo con increíbles resultados. Si no quieres o no puedes hacer el reto no es obligatorio. De igual forma podrás aplicar perfectamente los principios que aprenderás en la medida que creas conveniente.  \t</p>  \t<p>  \t\tSi decides hacer el reto :D Te incluiremos en nuestro grupo privado en donde esta toda la gente que hará el reto y algunos que ya lo hicieron en el pasado, aquí subimos fotos, recetas, consejos, dudas, etc.  \t</p>  \t<p>  \t\tAl terminar este reto se trata de encontrar un equilibro que para ti sea el adecuado. Quiero que la comida realmente saludable sea la regla en tu vida y la comida que no es muy saludable pero que a veces nos gusta mucho sea la excepción. Se trata de volverte más saludable, no de convertirte en un robot.  \t</p>  </div>", 
    "end_date": null, 
    "title": "Reto Paleo: El desafío nutricional que cambiará tu vida", 
    "price": "35.00", 
    "instructors": "Javier del Cueto", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366000_0014_5.jpg", 
    "course_url": "https://www.udemy.com/reto-paleo/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T18:52:18Z"
}