{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>----Introductory Price ONLY - Increasing to $30 Soon---</strong> </p>\n\n<p><strong>----Updated for April 2016---</strong></p>\n\n\n\n\n\n<p>Are you a <strong>busy person</strong>, who still loves to <strong>live healthy</strong>? Living healthy takes time and I know it is <strong>EXTREMELY time consuming</strong>! - You have to do groceries, prepare all these raw products into something tasty, look for recipes, follow preparation steps, cook and then you can eat.</p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you'll be able to make smoothies which are ready within 5 minutes. You can live healthy without taking hours to prepare something nice.</strong></p>\n\n\n\n\n\n<p>That's why we created <strong>SIMPLE SMOOTHOLOGY!</strong></p>\n\n\n\n\n\n<p>Simple Smoothology is a complete course for you on how to make smoothies! Besides that Simple Smoothology contains <strong>10 incredibely good and delicious recipes</strong> for every situation! With these <strong>STEP BY STEP</strong> instructional video's there is ABSOLUTELY NO WAY you can go wrong. </p>\n\n\n\n\n\n<p>We will also include an interactive ebook with all the recipes written down for you. Simple Smoothology contains the 10 smoothie recipes you'll ever need to know. </p>\n\n\n\n\n\n<p>Simple Smoothology is taught by Virgina, an incredible <strong>smoothie expert</strong>, who is going to teach <strong>AMAZING tips</strong> on making smoothies, what type of blender to use, how to never waste money on rotten vegetables anymore, but above all.. the <strong>10 incredible Simple Smoothology recipes</strong> which are:<em></em></p>\n\n\n\n\n\n<ol><li><em>Digestive Smoothie</em></li><li><em>Hangover Smoothie (Green Smoothie!)</em></li><li><em>Tan Booster</em></li><li><em>Fat Burner (Green Smoothie!)</em></li><li><em>Detox Smoothie (Green Smoothie!)</em></li><li><em>Tropical Smoothie</em></li><li><em>Berrylicious Smoothie</em></li><li><em>Sweet Milkshake Smoothie</em></li><li><em>Coffee Lovers</em></li><li><em>Weight Loss Smoothie (Green Smoothie!)</em></li></ol>\n\n\n\n\n\n<p>We are also including the following bonusses, only if you order your copy of Simple Smoothology TODAY!<br></p>\n\n\n\n\n\n<li><em>Video on how to make any kind of nut milk (valued at: $17)</em></li><li><em>Infographic on how to make any type of smoothie combination taste incredible (valued at: $12)</em></li><li><em>Ebook on how to make any kind of nut milk (valuted at: $17)</em></li><li><em>Access to the Secret Simple Smoothology Facebook Group (valued at: $47)</em></li><li><em>That's $93 dollars worth of value for FREE only if you order NOW!</em></li>Stop procrastinating, eating pizza's and living unhealthy. <strong>Start living healthy today!</strong>\n\n<p>Order your copy of Simple Smoothology today by clicking the button to your right!</p>", 
    "end_date": null, 
    "title": "Simple Smoothie - 10 Smoothies - With Green Smoothie Recipes", 
    "price": "20.00", 
    "instructors": "Paleo Tips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513126_67c5_2.jpg", 
    "course_url": "https://www.udemy.com/simplesmoothology/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T20:54:48Z"
}