{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t         This course is about <strong>how to eat fresh, healthy food and feel great while you are traveling</strong>, whether by land or by sea, for business or for pleasure. Never feel like you have to scrap by on airplane pretzels and fast-food again!  </p>  <p>  \t    In this course I offer specific suggestions for different situations, including what kinds of foods work well on an airplane vs a train trip. You will learn how food anxiety (worrying about what you will be able to eat or what you should choose) can impact your digestion and how to avoid it. Eating well can be a challenge for anyone, but it is especially tough for those of us with <strong>food allergies or sensitivities</strong>, so I include special considerations for those following a health-driven diet (eg gluten-free, dairy-free, etc).  </p>  <p>  \t        Anyone who finds the idea of eating healthfully on the road challenging or stressful should definitely take this course! You will walk away with concrete examples of how to pack for different situations and an understanding of how taking care of yourself on your travels will make your trip more enjoyable. Course participation is highly encouraged :)  </p>  <p>  \t      Of course, this course includes a Udemy-backed<strong> 30-day satisfaction guarantee</strong> so there is no risk. <strong>Enroll today</strong> and join the discussion!  </p>  <p></p>", 
    "end_date": null, 
    "title": "Stress-free Strategy to Stick to a Healthy Diet on the Road ", 
    "price": "20.00", 
    "instructors": "Erin Knight", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206198_2c87_2.jpg", 
    "course_url": "https://www.udemy.com/stress-free-eating-on-the-road/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T21:30:18Z"
}