{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">THE #1 SUGAR DETOX COURSE ON UDEMY! </em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">8 HOURS OF CONTENT + 800 SUCCESSFUL STUDENTS. PROVEN SUGAR DETOX PROGRAM...GUARANTEED RESULTS!</em></strong></p>\n\n\n\n<p><strong><em>SPECIAL LIMITED DISCOUNT: GET OFF SUGAR FOR JUST £15 UNTIL THE END OF JUNE 2016</em></strong></p>\n\n<p>----------------------------------------------------------------------------------------------------------------</p>\n\n\n\n<p>Do you feel at the mercy of your sweet tooth? This course is for you if: </p>\n\n\n\n<ul><li>You need to have something sweet at certain times e.g after a meal</li><li>You use sugary food when stressed, bored, tired</li><li>You can't ever imagine not craving sweet food on a daily basis</li><li>Sometimes you feel agitated if you can't get your hands on something sweet</li><li>Sugar &amp; food often dominates your thoughts, your days, your life</li><li>You're generally quite healthy but sweet food is your last 'vice'</li><li>You're aware of the health implications but you just can't stop</li><li>You suffer from binge-guilt-frustration cycles</li><li>You over exercise or control calories elsewhere so you can eat sugary food</li></ul>\n\n\n\n<p>You also feel confused at the prospect of 'quitting sugar' - you want to simply have a healthy relationship with it where you can have a piece of cake on a special occasion if you want to.</p>\n\n\n\n<p>Trust me, I know how it feels because I was also there too and so have most of my clients.</p>\n\n\n\n<p>Let me tell you the good news: It doesn't have to be a painful diet or process to change your relationship with sugar forever. You just need to work on ALL pieces of the puzzle (not just embark on another 'sugar detox' diet plan)</p>\n\n\n\n<p>This course is going to show you how to transform your relationship with sweet food using a proven methodology and all the techniques that I've used successfully on my clients.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Get ready to change your life and the way you think about sweet food forever! I am excited for you!!</em></strong></p>\n\n\n\n<p>In this course you will learn how to:</p>\n\n\n\n<ul><li>Physically reduce your taste preference to sweet food and appreciate fruit for it's natural sweetness</li><li>Understand your sugar cravings in more depth</li><li>Learn how to change your habits so they stick</li><li>Gain a wealth of knowledge around sugar and healthy eating that will serve your for life</li><li>Learn how to manage your emotional eating</li><li>Start trusting yourself around sweet food so you can live happily in peace with sugar</li></ul>\n\n\n\n<p>There are many reasons why you might want to change your unhealthy relationship with sugar:</p>\n\n\n\n<ul><li>You want to lose weight</li><li>You want to reduce the risk of diseases like diabetes,</li><li>You want to increase your energy</li><li>You want to feel fuller for longer</li><li>You want to stop losing control over portion size and be sensible around your snacking</li><li>You want to improve your skin and hair quality, reduce wrinkles or see if reducing the sugar can make a difference to your appearance</li><li>In addition you will emerge feeling more:</li></ul>\n\n\n\n<ul><li>Healthy</li><li>Energetic</li><li>Empowered</li><li>Proud</li><li>In control</li><li>Free</li></ul>\n\n\n\n<p>I explain how to transform your relationship with sweet food through a mixed range of headshot lectures, powerpoint presentations and written guides and workbooks. You will also get a FREE recipe book with 55 delicious sugar-free recipes and 6 weeks of time saving meal plans.</p>\n\n\n\n<p>Many of the detailed lectures have written PDFs which you can download, print and keep. There are lots of printable worksheets and guides for you too within the programme and there's external links to my favourite extra learning resources.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">Don't let sugar rule you! You can take control today and overcome this dangerous addictive substance! </em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">I have been successfully running this course for the past 2 years on my own website but have bought it Udemy so more can access and occasionally do really cheap special offers on! The recipe book is worth the price alone! </em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">Grab it at the best price - get you and sugar sorted!</em></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>I'm in no doubt that you'll get so much personally from this course and you don't even have to stick to it perfectly for it to work. Just commit to trying and this could be the best health decision you make in your life!</p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">I offer a full refund and guarantee if you decide it's not for you after purchasing. No questions asked.</em></em></p>\n\n\n\n<p>See you on the other side!!</p>", 
    "end_date": null, 
    "title": "Sugar Detox: Get Healthy! Change Your Sweet Food Habits Now", 
    "price": "20.00", 
    "instructors": "Laura Thomas", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426696_82ba_3.jpg", 
    "course_url": "https://www.udemy.com/sugar-detox-transform-your-relationship-with-sweet-food/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T09:59:18Z"
}