{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Detox For Sugar Addicts is a mild, food-based cleanse, designed to help you manage and conquer your addiction to sugar. And with the added benefit of being a vegan cleanse, you&#039;ll detox at a deeper lever, as you will remove foods that cause acidity and inflammation. This process can help you reduce cravings, balance your hormone and eliminate symptoms like pain, energy crashes and recurrent headaches (among others).</p><p style=\"\">This sugar detox is suitable for anyone who struggles with excess weight (especially around the middle), mood swings and for those who consume too many simple carbohydrates and soft drinks.</p><p style=\"\">Even as a healthy eater, if you have regular afternoon &quot;crashes&quot;, require coffee to &quot;function&quot; in the mornings or if you have a hard time boosting your metabolism and losing weight, this cleanse may be just what you need.</p><p style=\"\">The course is organized into 5 sections, with 26 short video lessons, shopping list, meal plan and plenty of yummy vegan recipes to choose from. It also includes a few powerful tips to boost your detox and help ensure your success.</p><p style=\"\">This detox cleanse requires minimal prep time and can be viewed in its entirety in just a couple of hours. Then, you can download the program guidelines, recipes and meal plan and schedule your cleanse based on your own timeline. The course is extremely easy to follow and designed to ensure your success.</p><p style=\"\">You will learn a ton about yourself and about cleansing and can do this plan well beyond the 14 days. And who knows, maybe it will become a fun new lifestyle to follow for the rest of your life!</p><p style=\"\">So if you&#039;re ready to take back control of your body, start losing weight and have loads of energy (without stimulants), you&#039;ve come to the right place!</p>", 
    "end_date": null, 
    "title": "Sugar Detox Made Simple", 
    "price": "50.00", 
    "instructors": "Jovanka Ciares", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427920_6b95_2.jpg", 
    "course_url": "https://www.udemy.com/detox-for-sugar-addicts/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T18:50:46Z"
}