{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>It is time to learn how to choose a superfood blend in the overflowing market of protein powders, energy bars, and smoothie recipes. Why do I need a superfood drink, and which one should I choose?</p>\n\n<p>Our focus in making a superfood blend isn't moderating disease symptoms. We focus on<strong> creating healthy functions</strong>. With abundant health, disease is simply crowded out and replaced with optimal performance.</p>\n\n\n\n\n\n\n\n<p>You can <strong>gain good performance</strong> back. The momentum of the \"normal\" downward spiral of declining health and shorter lifespan can be slowed, and eventually reversed to add many precious moments and experiences in the coming years.</p>\n\n\n\n\n\n\n\n<p>Delaying the onset of typical middle-age-related problems, especially the decline in sexual health, is hard to explain to people who did not experience it. </p>\n\n\n\n\n\n\n\n<p>Effects of feeding yourself right will include:</p>\n\n\n\n\n\n<ul>\n<li>Reduced fat - increased muscle = solid body shape.</li>\n<li>Enhanced immune function = resistance to infections.</li>\n<li>Enhanced memory, ambition, attitude and brain power.</li>\n<li>Reduction of joint and body muscle aches and pains.</li>\n<li>Substantial increase in sexual health, interest, ability</li>\n<li>Increased stamina for both women and for men</li>\n<li>More youthful appearance and body functions</li>\n<li>Extended life span quality and quantity.</li>\n</ul>\n\n\n\n\n\n\n\n\n\n<p><br>You will learn about nutrients like Coenzyme Q10, Saffron, Ginkgo Biloba, Bilberry, Siberian Ginseng, Garlic, Vitamins A-&amp;E, Niacin, Vitamin C, Pycnogenols and Bioflavonoids, plus key minerals like Chromium, as well as the Essential Fatty Acids GLA and Omega 3.</p>\n\n\n\n\n\n\n\n<p>The result is <strong>understanding how nutrition affects your health</strong>, and how it affects your ability to function, which nutrients, and in which amounts are required for optimal performance.</p>\n\n\n\n<p><strong>Special Section: Vegetarian Bodybuilders</strong></p>\n\n\n\n<p>There is a belief that bodybuilders need meat in order to get the protein they require to build lean muscle mass. Nothing could be further from the truth. Many weight lifters thrive on meatless, even vegan diets. Plant protein can be superior to meat in many ways.</p>\n\n\n\n<p>In this special section, we look at Superfoods for high end athletes.</p>", 
    "end_date": null, 
    "title": "Superfoods and Your Health", 
    "price": "20.00", 
    "instructors": "Scott Paton, Martin Pytela", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801980_86eb.jpg", 
    "course_url": "https://www.udemy.com/superfoods/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T15:19:49Z"
}