{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you ready to look slimmer, healthier, and have a flat belly than you've had  in years? </p><p>Are you ready to finally be able to fit back into your skinny jeans and lose that <strong>STUBBORN </strong>belly fat for good?<br></p><p>Well...There are a lot of conflicting information floating around on the web as to weight loss.</p><p>The solution has <strong>NOTHING</strong> to do with taking  pills, powders, potions or exercise gadgets to try and fix the problem overnight.</p><p>It has <strong>EVERYTHING</strong> to do with naturally getting rid of <strong>harmful toxins and pollutants</strong> that are circulating inside your body right now…</p><p>The fact is diet's <strong>DON'T work!</strong><span></span></p><p>Carrying extra \nweight is a <strong>HEALTH RISK</strong>, but recent scientific studies have linked certain foods to such potentially life-threatening conditions as high blood \npressure, high cholesterol, diabetes, depression, heart disease, and \ncancer.</p><p>Believe it or not, Americans spend <strong>BILLIONS</strong> of dollars on weight loss\n Pills, Powders, Potions and ridiculous exercise gadgets that do nothing in the long term.</p><p>The most vital component to getting in the <strong>BEST</strong> shape of your life is to create an environment that is healthy inside the body <strong>FIRST!</strong></p><p><strong>This is where creating GREAT tasting and Fat burning juicing recipes was born.</strong></p><p>\nBy consuming freshly juiced vegetables \nevery single day… you can  completely transform your body from not only the inside but on the outside.\n</p><p>\nAnd you can totally change your life around plus live longer.\n</p><p>\nYou'll also notice an immediate<strong> INCREASE</strong> in ENERGY, more PASSION and desire in your relationships, your digestive \nsystem will become normal, and most of <strong>ALL</strong> you'll <strong>ENJOY</strong> your diet and new healthy \nlifestyle!\n</p><p>\n\tBy drinking freshly juiced vegetables (mixed in with some fruits) you'll finally start to see fat melt away and never  have to struggle again  on achieving the body you've always wanted.</p><p>\n\tThat's right, I'm talking about <strong>Fat Burning Juicing Recipes</strong> that you'll enjoy and be easy to make WITHOUT the headache and hassle.  <br></p><p>\n\tYou'll discover how to detoxify your body of pollutants that have \nbeen circulating inside your body, keeping you from having the <strong>sexy \nbody</strong> you desire.</p><p>If you are someone who exercises and applies these healthy <strong>Fat Burning Juicing Recipes…</strong> you'll \nfinally begin to see your body fat and your weight <strong>DROP</strong> like it has \nnever before.<br>\n\t</p><p>And you'll get <strong>AMAZING</strong> results !</p><p>So let's get started and I'll see you inside.<br></p><p><br></p><p><strong><br></strong>\n</p>", 
    "end_date": null, 
    "title": "Superfoods That Promote Fat Loss - Juicing Made EASY!", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764832_69ec.jpg", 
    "course_url": "https://www.udemy.com/everything-juicing-lose-up-to-10-pounds-in-10-days/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T22:19:20Z"
}