{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Most people acknowledge the effect that nutrition can have on performance, but so many tennis players are getting it wrong! Not eating or drinking the right things on the court, running out of gas in the third set, not recovering properly between matches, and cramping that could have been prevented by proper electrolyte intake. </p>\n\n<p>\n</p>\n\n\n\n\n\n\n\n<p>I am a sports dietitian who currently works with a number of high-level tennis players including Grand Slam winners as well as up and coming pros and collegiate players.  Having also spent time as a college tennis coach, I know that getting players to buy-in to new ideas can be a major challenge. I also know that budget plays a role in the foods coaches can provide for players as well as in the choices players make on their own. With all of that in mind, this course was set up to offer cost-effective and easy to implement information.</p>\n\n\n\n\n\n\n\n<p>\n</p>\n\n\n\n\n\n\n\n<p>Years of both research and practical experience in tennis have allowed me to create a course that offers coaches and players an understanding of the key sports nutrition concepts in a format that is easy to follow. Topics are broken down into short modules that can be viewed over a period of days or weeks, and you won’t need a nutrition degree to understand it and take away helpful information that will improve your results. </p>", 
    "end_date": null, 
    "title": "Tennis Nutrition", 
    "price": "40.00", 
    "instructors": "Jeffrey Rothschild", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806386_6661_5.jpg", 
    "course_url": "https://www.udemy.com/tennis-nutrition/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T18:13:23Z"
}