{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Are you ready to create the health, beauty, and life you truly desire? </strong></p><p>Create the health you truly desire while still enjoying the things you love. 7 Days to Skinny Strong will show you how.</p><p><strong>About the Course:</strong></p><p>This self-paced program begins with the eCourse to mentally, physically and emotionally prepare you for a cleanse. You'll be invited to join us for a 7-day cleanse where we'll send you a journal, workbook, shopping lists, meal plans and recipes, in addition to all of the most important information you'll find in the eCourse. Once you start the cleanse, you’ll receive a daily email from Cindy Rodriguez with uplifting videos, tips, resources, and a daily checklist to keep you on track and in line with your health, beauty and lifestyle goals.</p><p><strong>What kind of materials are included?</strong></p><p>7 Days to Skinny Strong will prepare, support, and guide you through a health, beauty and lifestyle cleanse.</p><ul><li><strong>Daily Protocol: </strong>Stay on track with our easy to follow, printable documents - perfect to post on your fridge! Receive daily email check-ins from Cindy during the cleanse.</li></ul><ul><li><strong>Recipes &amp; Structured Meal Plans: </strong>You won’t need to own a juicer, fancy kitchen gadgets, or deny yourself the pleasure of delicious food. Transition into a healthy lifestyle you can actually live with.</li></ul><ul><li><strong>Food Journal &amp; Daily Diary: </strong>Connect the dots between what you eat and how you feel. The Skinny Strong Workbook will fully accompany you on your cleanse at the end of the eCourse.</li></ul><ul><li><strong>Education &amp; Knowledge: </strong>Enjoy the various Skinny Strong handouts of useful information to apply for maximum benefits.</li></ul><ul><li><strong>Transition Diet: </strong>Our cleanse provides options for both newbies and advanced cleansers so you can make sure this cleanse work for YOU.</li></ul><p><span></span></p>", 
    "end_date": null, 
    "title": "The Skinny Strong 7 Day Lifestyle Cleanse", 
    "price": "20.00", 
    "instructors": "Cindy Rodriguez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697664_de28_2.jpg", 
    "course_url": "https://www.udemy.com/7-days-to-skinny-strong/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T00:16:58Z"
}