{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Having great health and getting into your ideal dress size is not about a tireless hamster wheel of eating less and exercising more, it’s about 7 key lifestyle elements that work in harmony with your body’s acid-alkaline internal balance (and it’s much less hard work too).<br><br><strong>Get Your Body Into Alkaline Balance &amp; You’ll Be Nicely Surprised How Easy It Is To Achieve A Permanently Slender Body, More Energy &amp; Noticeable Signs Of Great Health &amp; Healing. </strong><br></p><p>There are thousands of diets out there to confuse us but it’s only these 7 Keys to Extraordinary Health that are proven fundamentals to moving us away from degenerative disease and towards true vitality.<br><br><strong>In this course we look specifically at these 7 Keys to Extraordinary Health:</strong><br><br>1. Sunlight &amp; Deep Oxygenation<br>2. Pure Hydration<br>3. Sleep &amp; Balancing Rest<br>4. Living Alkaline Foods<br>5. Eliminating Acidic Toxins<br>6. Movement &amp; Posture<br>7. Positive Mindset &amp; Emotions<br><br>The Alkaline diet is not new, it’s not rocket science but in this course, I’ve made it simple and accessible and in less than 2 hours you’ll be crystal clear on how to achieve extraordinary health and your ideal weight - no matter what your starting point and how distant that might seem right now.</p><p><strong>ALKALINE DIET FACTS:</strong><br></p><p>When we maintain proper alkaline balance, by eating more alkaline foods and reducing acidic foods, this increases the Oxygen in your body.</p><p>The Nobel Prize winning work of Dr Otto Warburg in 1931 showed that cells weaken, mutate, or die in the absence of Oxygen. Several years later, two-time Nobel Prize winner Dr Linus Pauling was the first to show that... <em><br><strong></strong></em></p><p><em><strong>Cancer cells are unable grow in an Oxygen-rich, alkaline environment. Therefore, oxygenated cells promote good health and Oxygen-depleted cells promotes ill health and disease.</strong></em></p><p><strong>What you’ll learn:</strong><br></p><p>By the time you’ve finished this course, you’ll have the tools to establish simple alkalising habits that you can incorporate within your normal daily routines. </p><p>You’ll know exactly what foods are alkaline and health-producing and what foods are acidic and more toxic, as well as household and beauty product chemicals to avoid. <br></p><p>You’ll also know how to have a much better quality night’s sleep, how to properly hydrate your body with pure water that’s not full of toxins and chemicals, best practices for exercise and choosing activities that work best for you and a powerful technique for getting into great mental and emotional wellbeing. <br></p><p>As per normal on Udemy, this course is delivered mainly by HD video but you also get the ‘7 Keys’ printable framework PDF and course slides to accompany the videos.<br></p>", 
    "end_date": null, 
    "title": "The 7 Keys To Extraordinary Health With The Alkaline Diet ", 
    "price": "20.00", 
    "instructors": "Laura Wilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697294_25a6_3.jpg", 
    "course_url": "https://www.udemy.com/7-keys-to-extraordinary-health-with-the-alkaline-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T16:49:47Z"
}