{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>It's About You Looking Fabulous and Feeling Great ... in minutes a day!</p><p>Is this your year to get healthier?  Do you want to start juicing and blending, or have you started, but you aren't very consistent, because you just cannot seem to find the time?  Well, juicing and blending is probably the single best habit that you can add to your life - It is one of the first steps to a healthier, happier, you.</p><p>But yes ... it does takes a time commitment to get our green juices in every day ... time which we sometimes don't have. I know first hand, being a busy Mom and Entrepreneur! </p><p>But what if I made it easy for you.  What if I gave you some simple strategies that I have picked up over the last eight years, which would make juicing and blending fit right into your busy lifestyle ... which would allow you to rock out delicious juices and smoothies in just minutes a day? Then ... would you be ready?</p><ul><li>Would you be ready for <strong>glowing skin, increased energy, laser focus, rock solid immune system AND a jumpstart to the weightloss that you want</strong>?</li><li>Would you be ready to ditch the toxins that have been building up in your body for years ... <strong>and the fatigue, weight gain, food cravings, headaches, mood swings ...</strong> that go along with it?</li><li>Would you be ready to take the first step - a simple habit that will get you on the path to <strong>HEALTHY, HAPPY &amp; HOT!</strong></li></ul><p>If you said <strong>\"YES\"</strong>, then this one hour video course with a handy resource guide is perfect for you!  </p><p>Here is what you will learn:</p><p>- <strong>My best tips and tricks to save time in the kitchen</strong></p><p>- The best way to prepare</p><p>- The <strong>best juicers and blenders</strong> - specifically for busy people</p><p>- The<strong> best juice bars for fresh, organic produce</strong> ... and how to find one near you, that also probably delivers!</p><p>- If you only have a Jamba Juice - <strong>which juices should you stay away from, and which should you order</strong> - so you are not just getting a sugar bomb</p><p>- Which brands are the best to buy at your local market ... and which should you avoid</p><p>- Green powders are all the rage - are they good or bad? When to use them, and which to buy?</p><p>- Over <strong>20 recipes </strong>of delicious smoothies and juices with <strong>5 ingredients or less</strong></p><p>- And if you are just starting out ... don't worry - I go over the benefits of juicing and blending, the differences between the two, how to choose the right one for you ... and yes ... I reveal my favorite :-).</p><p>Juicing pros and newbies alike ... I'll help you to fit juicing and blending into your busy lifestyle.</p><p>So if you are \"ready\" ... then I've got your back!  </p>", 
    "end_date": null, 
    "title": "The Ultimate Juice & Smoothie Guide For Busy People", 
    "price": "30.00", 
    "instructors": "Chantelle Streete", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/745158_9e72_2.jpg", 
    "course_url": "https://www.udemy.com/your-juices-and-smoothies-on-the-go-go-go/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-28T20:08:05Z"
}