{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \tLearning how to consume pure foods that are rich in probiotics and live enzymes, dense nutrients, etc, will bring the potential for totally restructuring our gut microbiome, where 80% of our immune system resides! Many people who embrace regular consumption of fermented and nutritionally dense foods and beverages achieve optimal health, optimal weight, and overall happiness. Its because cooks who make these become deeply nourished by the vital nutrients made available through fermentation.  </p>  <p style=\"\">  \t Students will end the course with a wealth of information that will allow them to feel comfortable, confident, and excited to make their own fermented products at home, which will allow them to save money while increasing the health of their families!  </p>  <p style=\"\">  \tThe ideal student has a vested interest in improving their health and well being, and enjoys learning new skills that they can share with others.  They have been thinking for a while, that they want to make a positive, lasting change in their lives, that aligns with their values of how they want to treat their bodies and the planet...or maybe they just happen to love kraut and want to know how to make it:)  Perhaps they are in a great deal of suffering and they are looking for a new path to wellbeing.  </p>  <p style=\"\">  \tThese courses will offer something for all levels, whether you are beginning fermentor or advanced, students will learn about the value of traditional lacto-fermented foods, how to prepare these foods, how to have fun and get creative with fermentation, proper sanitation techniques, how to pair these foods with meals, how to create amazing condiments with lacto-fermentation, as well as how to assess the proper mixing and length stored.  Students will learn how to use their intuition and creativity and let go of their fear of the unknown surrounding the fermentation experience.  </p>", 
    "end_date": null, 
    "title": "The Art of Fermentation: Strategies & Best Practices", 
    "price": "40.00", 
    "instructors": "Kelly Dearie", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371614_06ed_3.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-fermentation/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T17:02:02Z"
}