{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t        Do you have a premature baby less than six months old (adjusted age)?  Do you want to learn how to provide the best nutrition for your preemie to help your baby thrive?  </p>  <p>  \t            The Pebbles of Hope Thrive Guide for Parents of Premature Babies is an interactive course with expert information, parent testimonials, graphics and video to provide parents and other caregivers of premature infants with the information they need to provide their babies with the best care. This is the first module of the Thrive Guide, focusing on nutrition for the first six months (adjusted age), and covers topics such as breastfeeding, expressing breast milk and Kangaroo Care as a means to stimulate milk production.  </p>  <p>  \t            Topics covered in this module include:  </p>  <ul>  \t<li>Challenges preemies face</li>  \t<li>Ways to feed your baby</li>  \t<li>Methods to      provide breast milk for preemies, techniques to stimulate milk      production and how to store milk </li>  \t<li>Guidance for successful breastfeeding and bottlefeeding</li>  \t<li>Nutrition tips for mothers providing breast milk</li>  \t<li>Techniques for performing Kangaroo Care</li>  </ul>  <p>  \t            This module takes approximately 1.5 hours to complete, and additional materials, such as a lactation log, sample meal plans for lactating mothers, and a checklist for breast milk storage, are also made available for download throughout the course. Additional materials have also been provided by La Leche League USA.  All content has been reviewed and approved by our expert advisory panel of neonatologists, perinatologists, neonatal nurses, pediatricians, pediatric nutritionists and occupational therapists prior to inclusion within the course.  </p>", 
    "end_date": null, 
    "title": "Thrive Guide for Parents of Premature Babies", 
    "price": 0, 
    "instructors": "Pebbles Of  Hope", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410104_d8f8_3.jpg", 
    "course_url": "https://www.udemy.com/thrive-guide-nutrition-part1/", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-01T17:44:23Z"
}