{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<h5 style=\"\">30-Day Workout To Change Your Life</h5>  <p style=\"\">This fitness course program is a complete holistic body renovation  program. I will be taking you through the program step by step, and when you  come out the other side in 30 days time, your body will be renovated, rejuvenated  and rehabilitated both inside and out!</p>    <p style=\"\">This fitness course program is about the structure of your 30 days, it  is your <strong style=\"\">HOW TO guide</strong> to get your body in shape.</p>    <p style=\"\">So throughout the next 30 days you will eat a clean  healthy diet, you will exercise to <strong style=\"\">turn your body into a fat burning machine</strong> and  you will get rest and relaxation into your life. A complete holistic approach  about getting results the right way. You will be renovating your bodies at a  cellular level so in 30 days time you will be a brand new you.</p>    <p style=\"\">These 30 days are about getting back to basics,  removing fake processed, packaged foods from your diet. We focus on foods that  are nutrient dense and full of mineral and vitamins your body requires for  optimal health. It’s about giving you the facts as to why this way of eating  works and you will experience the results for yourself.</p>  <h5 style=\"\"><strong style=\"\">&nbsp;Nutrition</strong></h5>    <p style=\"\">You will learn the right types of foods to eat</p>    <p style=\"\">You will be given:</p>    <ul style=\"\">  \t<li style=\"\">grocery lists</li>  \t<li style=\"\">eating guidelines</li>  \t<li style=\"\">menu plans</li>  \t<li style=\"\">recipes</li>  </ul>  <p style=\"\">I will teach you how to order good food at a restaurant that fits within these parameters. You will learn what to have for post workout meals. And most of all, over the 30 days you will begin to&nbsp;<strong style=\"\">change your eating habits</strong>&nbsp;and the types of foods you are eating, and you will begin to notice how amazing you feel, how much energy and vitality you have, and these healthy habits will&nbsp;<strong style=\"\">set you up for the rest of your life.</strong></p>  <br style=\"\">  <h5 style=\"\"><strong style=\"\">Workouts&nbsp;</strong></h5>  <br style=\"\">    <p style=\"\">You will be given complete exercise workouts that move your body functionally in such a way that it burns fat not only during your workout but afterwards also,<strong style=\"\">giving you energy and vibrancy</strong>&nbsp;for your everyday life.</p>    <p style=\"\">Over the next thirty days, you are going to make life easy for your body. You are going to eliminate all foods that cause your body to store body fat, and you are going to eat more foods that help you burn body fat. Your nutrition is crucial if you are&nbsp;<strong style=\"\">serious about getting results.</strong></p>    <p style=\"\">Workouts you will receive that allow you to workout at home or wherever it suits you (no equipment required):</p>    <ul style=\"\">  <li style=\"\">4 complete Sculpt and Tone video workouts</li>  <li style=\"\">4 complete High Intensity Interval Training (HIIT) workouts</li>  <li style=\"\">4 complete Yoga &amp; Stretching routines</li>  <li style=\"\">4 complete Lite workouts that are a reduced intensity to the HIITs</li>  </ul>  \t  <h5 style=\"\">Fitness Course: 30-Day Workout Body Renovation Summary</h5>  <ul style=\"\">  <li style=\"\">I will give you options on the right treats you can eat and when you should eat them.</li>  \t<li style=\"\">You will learn how to listen to your body and understand what foods you should be avoiding if you are wanting to&nbsp;<strong style=\"\">get lean and toned</strong>&nbsp;and get the results you desire.</li>  \t<li style=\"\">You will understand where chemicals come into foods and avoid them when possible.</li>  </ul>  <p style=\"\">Avoiding toxins is important for long term health and taking extra stresses off your body. These 30 days aren’t just about weight loss, they are about removing toxic load and stresses&nbsp;from your body so that you can&nbsp;<strong style=\"\">renovate your health</strong>&nbsp;right down to the cellular level.</p><p style=\"\"><p style=\"\">Take this ultimate Fitness Course now and shape your body with  30 day workout body  renovation detox program.&nbsp;</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Transform Your Health In This 30 Day Body Renovation Detox", 
    "price": "45.00", 
    "instructors": "Nicola Reilly", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35771_cf63_5.jpg", 
    "course_url": "https://www.udemy.com/30-day-body-renovation/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-11T19:39:53Z"
}