{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>APRIL 4, 2016 UPDATE: </strong>Udemy has introduced a new pricing structure today. Please message me with any questions you may have regarding this.<br><strong></strong></p><p><strong>Your body requires a variety of substances to function properly. Learn about all of them in one convenient course!</strong></p>\n\n<p>Let's be honest; we all desire greater health and vitality. Vitamins and minerals may be able to help you achieve it.</p>\n\n<p>Did you know that, according to the Mayo Clinic, mild vitamin B6 deficiency is \"common\"? But who thinks about their B6 intake on a daily basis? Few to none, I'm afraid.</p>\n\n<p>Iron deficiency, which produces anemia, is quite common among women.</p>\n\n<p>Potassium deficiency can produce painful muscle cramps, especially in the feet.</p>\n\n<p>I could go on and on... but I want you to know...</p>\n\n<p><strong>This course is all about a <em>balanced approach to health and nutrition.</em></strong></p>\n\n<p><strong>I'm not going to tell you that vitamins and minerals are the cure for everything. </strong>That's just ridiculous.</p>\n\n<p>However, many people are living in a fantasy world, where they believe they are getting enough of the vital nutrients their bodies require from their typical western diet.</p>\n\n<p>That just isn't the case.<strong></strong></p>\n\n<p><strong>Would you like to learn what foods to eat in order to develop a well-rounded and balanced diet? Enroll today, because that's what this course is all about!</strong><strong></strong></p>\n\n<p><strong>All course updates are 100% FREE. </strong>Buy this course one time and you own it for life. Not only that, but you will also gain lifetime access to me as your personal instructor. Have a question about vitamins and minerals? Just ask! You, as my student, will always be my #1 priority.</p>\n\n<p><strong>Wait, you're still reading this?! </strong>The course comes with a genuine 30 day, no hassles, money-back guarantee. So, there is absolutely nothing to risk here. <strong>Enroll today!</strong></p>", 
    "end_date": null, 
    "title": "What Are Vitamins and Minerals, and Why Do We Need Them?", 
    "price": "20.00", 
    "instructors": "Cody Ray Miller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513802_cd95_5.jpg", 
    "course_url": "https://www.udemy.com/what-are-vitamins-and-minerals/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T16:46:15Z"
}