{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t <em style=\"\">Have you ever tried a popular diet that just did not work for you?</em>  </p>  <p>  \t <em style=\"\">Are you confused by the numerous claims about the &ldquo;right&rdquo; way to eat?</em>  </p>  <p>  \t <em style=\"\">Do you follow the latest popular diet with initial success but always seem to gain the weight back?</em>  </p>  <p>  \t <em style=\"\">Are you curious about how you can take proactive steps to prevent chronic disease in your future?</em>  </p>  <p>  \t <em style=\"\">Do you fight cravings for foods you think you shouldn&rsquo;t eat?</em>  </p>  <p>  \t <em style=\"\">Would you like to return to an instinctual, balanced way of eating that naturally gives you vibrant energy, great body and clear thinking?</em>  </p>  <p>  \t This course is for you! You will learn about why healthy nutrition for one person may not be the same as what is healthy for another individual.  </p>  <p>  \t I also offer some simple yet powerful steps from my <a href=\"http://www.jenniferweinbergmd.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Simple | Pure | WholeTM Wellness Method</a> for utilizing cravings as wise messages and reconnecting with an intuitive, balanced way of eating!  </p>  <p>  \tIn this course we will discuss why my healthy nutrition may not be the same as your healthy nutrition or how each of us has individual health and nutrition needs that can change throughout our lives. You will become empowered to view cravings as insightful messages about your body&rsquo;s needs and gain powerful tools for addressing them.  </p>  <p>  \tYou will also learn about different patterns of healthy and unhealthy eating and how to reconnect with your intuition in order to naturally nourish your body in a balanced way and obtain and maintain your optimal weight, metabolism and health. I will support you in creating your own natural, Simple Pure Whole way of eating that will work for you for the long term!  </p>  <p>  \tInstead of investing in another diet book or setting unrealistic resolutions to loose weight simply to regain it all back and more, my intention in this course is to permanently change the way you think about healthy nutrition and guide you in finding a customized way of eating that works for your unique body and lifestyle.  </p>  <p>  \tThe wealth of knowledge and education you will receive by completing this course is invaluable. But what really distinguishes the <a href=\"http://www.jenniferweinbergmd.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Simple | Pure | WholeTM Wellness Method</a> is the practical approach I take in providing you with skills and tools to help you implement what you are learning in your own life. The power behind my approach is that you are not just learning theory or statistics, but become empowered with ways to change your lifestyle and habits and build a strong foundation for sustainable wellness. In this way, the benefits of this course last well beyond the lectures.  </p>  <p>  \tThroughout the course, you will find <strong style=\"\">Insight Exercises</strong> designed to parallel the course material and guide you in experimenting with this information in your own life. I have also included some <strong style=\"\">BONUS materials</strong> to make this course experience truly transformational!  </p>  <p>  \tAs a participant in the course you will receive:  </p>  <ul style=\"\">  \t<li>a <strong style=\"\">comprehensive course workbook and guide</strong></li>  \t<li><strong style=\"\"></strong>several <strong style=\"\">handouts</strong></li>  \t<li><strong style=\"\"></strong>extra <strong style=\"\">worksheets</strong></li>  \t<li><strong style=\"\"></strong>my popular S<strong style=\"\">imple | Pure | WholeTM </strong><strong style=\"\">Nourishment Journal</strong> and </li>  \t<li>a <strong style=\"\">Guide to Mindful Eating </strong>as my special BONUS FREE gifts!</li>  </ul>", 
    "end_date": null, 
    "title": "What to eat? An eater's guide to health", 
    "price": "30.00", 
    "instructors": "Jennifer Weinberg, MD, MPH, MBE", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133276_c2fe_7.jpg", 
    "course_url": "https://www.udemy.com/what-to-eat/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-13T20:05:33Z"
}