{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><u>Attention Every Man and Woman Trying to Lose Weight after a weekend of BINGE eating:</u> Is it <em>REALLY</em> Possible to Lose fat after a weekend of BINGE eating?</strong></p>\n\n<p>\"Completely Transform Your Body To Look Your <strong class=\"redactor-inline-converted\"><u>Best</u> </strong><strong class=\"redactor-inline-converted\"><u>Ever</u></strong> In ONLY 30 Days With The Most <em>Strategic</em>, <u><strong class=\"redactor-inline-converted\">Fastest</strong></u> Fat Loss Program EVER Developed—All While Eating WHATEVER You Want <u><strong class=\"redactor-inline-converted\">On Weekends Every</strong></u> 5 Days...\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Yes, it's TRUE! For the first time in<u> EVER</u> you can actually…</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Enjoy eating whatever you want on weekends with friends and family <br>WITHOUT suffering the consequences of getting fat the next day.</li><li>Cheat NOT once, but twice a week on weekends WITHOUT suffering the consequences of getting fat.</li><li>Strategically indulge in delicious, fattening foods on WEEKENDS to <br>trigger a flood of fat burning hormones with Multi-Functional Cheat \nDays.</li><li>Experience NO rebound weight gain after your cheat day weekend!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<h4>Keep Reading Below and You'll Discover the <u>EXACT</u> Method…</h4>\n\n\n\n\n\n\n\n\n\n\n\n<p>Dear friend,</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Have you ever thought that you could still hang out with friends and family eating whatever you want on weekends WITHOUT suffering the consequences of fat gain by over indulging in your favorite cheat foods?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I'm here to tell you, YOU CAN!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">WARNING:</strong>  This is NOT a gimmick—if you're simply looking for another pill-popping, zero-effort \"quick fix\", then I'm afraid you've landed on the wrong course.  But, if you're looking for REAL solutions founded on REAL science and cutting-edge strategy, then the information I'm about to share with you just may be the most important FAST fat loss information you've ever read.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I finally realized after a weekend of BINGE eating that <strong class=\"redactor-inline-converted\">there was a certain pattern of eating and moving that made rapid fat loss CERTAIN for me.</strong> I accidentally followed this synergistic 3-step pattern without even knowing it…I was able to  melt away fat so quickly that my friends and family wanted to know exactly how I was able to eat ALL this bad food over the course of a holiday weekend and actually lose weight.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Enter:  <strong class=\"redactor-inline-converted\">XFLB Strategic Synergy Pyramid</strong></p>\n\n\n\n\n\n\n\n<ol><li>Quickly empty your body of carbohydrate stores and muscle energy <br>so that your metabolism has NO other choice but to use your stubborn fat\n as it's sole source of energy.</li><li>Strategically indulge in delicious, fattening foods on WEEKENDS totrigger a flood of fat burning hormones with Multi-Functional Cheat Days.</li><li>Time  your foods with exercise using a VERY strategic diet and exercise <br>protocol to help release, burn, and FLUSH out all of your \nstubborn fat…FAST!</li><p><br></p></ol>\n\n\n\n<p>Every year when I don't follow a strategic plan…I end up packing on the holiday pounds get fatter and fatter just like you probably do when going out to hang with friends and family.</p>\n\n\n\n\n\n<p>I've had my fair share of ups and downs in life where I've \nhit rock bottom with my dieting and training.</p>\n\n\n\n\n\n\n\n<p>In other words, I'm a busy Husband, Dad, and Business Owner with another child on the way. I simply \ndon’t have time for short cuts and gimmicks. That's  one of the many \nreason I created the XFLB course.</p>\n\n<p><strong>This Step by Step Rapid Fat Loss Course Is Strategically \nDesigned For <u>Extreme</u> Results <em>Without</em> Extreme \nStarvation where you'll be able to enjoy ALL your favorite cheat foods WITHOUT the guilt and incinerate stubborn body fat!</strong></p>\n\n<p>Test it and see for yourself.  There is a 60 day money back guarantee and if you don't see results in your first 10 days, ask for a full refund with NO questions asked.</p>\n\n<p><strong class=\"redactor-inline-converted\">I'm that confident that you'll get AMAZING results!</strong></p>\n\n<p>See you in the course,</p>\n\n<p>Tim<br></p>", 
    "end_date": null, 
    "title": "Xtreme Fat Loss Blueprint For Weekend Binge Eating", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/863748_7348.jpg", 
    "course_url": "https://www.udemy.com/xtreme-fat-loss-blueprint-for-weekend-binge-eating/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-30T15:10:39Z"
}