{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t   ¿Qué me pueden aportar los zumos de frutas y verduras en la vida diaria? ¿Cuál es la diferencia entre zumo, batido y smoothie? ¿Es mejor la licuadora o el extractor de presión en frío? ¿Qué tienen los zumos verdes? ¿Cuáles son las recetas más deliciosas? ¿Hay alguna contraindicación? ¿Qué pasa con la leche de soja? ¿Cómo se hace la bebida de almendras y horchata?  </p>  <p>  \t   Estas y muchas más preguntas se contestan en este curso en el que aprenderás todos los trucos y consejos para preparar en tu casa zumos y bebidas deliciosas y saludables de forma fácil y que gusten a toda la familia.  </p>  <p>  \t   El curso de zumos y bebidas vegetales ofrece explicaciones detalladas sobre los beneficios de estos alimentos, las diferentes preparaciones y aparatos existentes, recomendaciones para incluirlos en la rutina diaria con sencillez y más de 100 recetas para no aburrirse nunca.  </p>  <p>  \t   Además, se entrevista en vídeo a la Dra Odile Fernández, experta internacional en alimentación anticáncer, que ofrecerá consejos sobre estos cócteles de salud.  </p>  <p>  \t   El curso se compone de 15 vídeos muy pedagógicos y un documento final en pdf de 58 páginas con la transcripción de la entrevista y toda la información detallada.  </p>  <p>  \t   La instructora, María del Mar Jiménez, es profesora de cocina y divulgadora de vida sana y lleva más de 14 años elaborando zumos y bebidas sanas para su familia, y varios años impartiendo clases sobre estos temas.  </p>  <p>  \t   Bienvenidos al fascinante mundo de los zumos y bebidas vegetales. Mejorar la alimentación y la salud nunca ha sido tan fácil.  </p>", 
    "end_date": null, 
    "title": "Zumos y Bebidas Vegetales", 
    "price": "50.00", 
    "instructors": "María del Mar Jiménez Redal", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268140_7f6c.jpg", 
    "course_url": "https://www.udemy.com/zumos-y-bebidas-vegetales/", 
    "currency": "USD", 
    "subject_name": [
        "Nutrition"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T16:47:24Z"
}