{"selfpaced": false, "topic_name": ["Foundations of Mathematics"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    distributions-001\n                                                                    distributions-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Dans plusieurs domaines des sciences (physique, mécanique, analyse numérique, etc.) apparaît la nécessité de développer un calcul différentiel \"généralisé\" pour des fonctions peu régulières, par exemple discontinues. La première leçon présente une situation de ce genre. L'objet de ce cours est d'introduire la théorie des distributions qui fournit une réponse élégante à ce problème.Dans un premier temps, nous présentons la notion de distribution, généralisant la notion de fonction, et les premières propriétés de ces objets mathématiques. On montre ensuite comment certaines opérations bien connues sur les fonctions, en particulier la dérivation, se prolongent naturellement au cadre des distributions. Le cours s'achève sur quelques applications à des exemples classiques d'équations aux dérivées partielles linéaires.\n\n                                            Syllabus\n                        Semaine 1 :EDP d'ordre 1 et méthode des caractéristiquesL'équation de HopfFonctions testSemaine 2 :Définition des distributions Dérivation des distributions Semaine 3 :Autres opérations sur les distributionsFormule des sauts en dimension 1Intégration sur les courbes et les surfaces Semaine 4 :Formule des sauts en dimension &gt;1 et applications Distributions à support compactConvolution des distributions par des fonctions régulières Semaine 5 :Régularisation des distributions Convolution des distributions Distributions tempérées Semaine 6 :Transformation de Fourier sur la classe de SchwartzTransformation de Fourier pour les distributions tempéréesSemaine 7 :Introduction à l'étude des EDPExemples de solutions élémentairesDétermination de quelques solutions élémentaires Semaine 8 :Fonctions harmoniques Equation de PoissonSemaine 9 :Problème de Cauchy au sens des distributionsExemples d'EDP d'évolution d'ordre 1Un exemple d'EDP d'évolution d'ordre 2 \n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Initiation à la théorie des distributions", "price": 0, "instructors": "François  Golse and Yvan Martel", "institution_name": ["École Polytechnique"], "commitment": "3-5 hours", "subject_name": ["Mathematics"], "course_url": "https://www.coursera.org/course/distributions", "duration": null, "language_name": ["Others"], "provider_name": ["Coursera"], "start_date": "2015-01-19T00:00:00Z"}