{"selfpaced": false, "topic_name": ["Foundations of Mathematics"], "description": "\n\n                    \n                    \n                    Upon completion of the course, students will have acquired fundamental knowledge that is valuable in itself and will serve as the foundation for other studies. For example, software engineers strongly rely on logic-mathematical theories in their work.\r\n• Natural languages possess a number of flaws - inaccuracy, polysemy, complexity.• Knowledge of the simple yet powerful methods of mathematical statement transformations made possible by the language of logic is just as vital as is the knowledge of elementary algebra. No need to reinvent the wheel.• Invented almost a century ago to address the needs of mathematics, mathematical logic has found application in theoretical and practical programming.• When dealing with applied problems, a researcher has to switch between the descriptive language, mathematical language, the language of numerical methods and algorithms, and specific programming languages. The language of mathematical logic offers a great opportunity to practice this translation between languages and is used as a powerful formalised tool for transmission of information between distant languages.\n\n                                            Syllabus\n                        Chapter 1 - Mission of mathematical logic:\r\nGoals, objectives, methods.Relation between mathematics and mathematical logic.Examples of logical errors, sophisms and paradoxes.Brief history of mathematical logic, discussing how problems mathematical logic faced and solved in its development, and how mathematical logic integrates further and further into programming.\r\nChapter 2 - Foundations of the set theory:\r\nSet theory is the basis for development of languages.\r\nChapter 3 - Propositional logic:\r\nPropositional logic studies the simplest yet the most important formal language.\r\nChapter 4 - First-order languages:\r\nThe language of propositional logic has limited tools, so we talk about more complex languages based on predicate logic. The language of predicate logic offers tools for full and exact description of any formal notions and statements.\r\nChapter 5 - Axiomatic method:\r\nThe axiomatic method makes it possible to solve many logical problems, errors and paradoxes. It is widely used in today's mathematics and the knowledge of it is vital for anyone using functional and logical programming languages.\r\nChapter 6 - Mathematical proof:\r\nDiscussion of the types of mathematical proof and how proof can be aided with a computer.\r\nChapter 7 - Algorithm theory:\r\nTo learn about the possibilities of the algorithmic approach and the limitations of calculations, one must know the rigorous definition of algorithms and computability. The module offers these definitions and defines algorithmically unsolvable problems. The module introduces the concept of algorithm complexity, which is an important factor when selecting algorithms to solve problems. The module also compares problems by complexity - this knowledge makes it possible to use any search algorithm to solve problem instead of search for the good algorithm.\r\n \n                                    ", "end_date": "2016-06-19T00:00:00Z", "title": "Mathematical Logic and Algorithms Theory", "price": 0, "instructors": "Nadezhda Khabibulina and Valentin Zyuzkov", "institution_name": ["Tomsk State University"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://iversity.org/en/courses/mathematical-logic-and-algorithms-theory", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["iversity"], "start_date": "2016-05-01T00:00:00Z"}