{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Do you lack confidence when it comes to Permutations and Combinations (<strong>PnC</strong>) problems? A solid understanding of this topic is a <strong>prerequisite</strong> for scoring well on most Test Prep exams. It's our philosophy that the best way to understand is by having <strong>strong foundations</strong>, which is why we start right from the basics of PnC. We take you on a <strong>step by step journey</strong> so you will be able to tackle the most difficult problems with <strong>ease and speed</strong>. Each video consists of well researched <strong>explanations</strong> as well as <strong>time saving techniques</strong>. There are also more than 30 plus real life <strong>examples</strong> that will keep you hooked whilst learning.</p>\n\n<p>By the end of our course solving PnC problems will be like second nature!</p>\n\n<p>Please remember to leave a review or star-rating.</p>\n\n<p><strong>About the Instructor </strong>:</p>\n\n<p><strong>This course was created by Ganesh Pai, founder of Don't Memorise. </strong>A voice over artist has been used to keep a neutral tone to the audio of all lessons.</p>\n\n<p>With his love of math and fascination for simplifying complex problems Ganesh made his first educational video whilst tutoring online. Here, he experienced first-hand the ways in which edutech<em> </em>can revitalize education and the space it creates for anytime, anywhere learning. From this grew his long passion and term vision to create free learner centric ‘lessons’ through technology for students from all walks of life in India and ultimately across the globe. </p>\n\n<p>In 2013 he established ‘Don’t Memorise’ with three core objectives. Firstly, and most importantly all resources always remain free of cost to end users. Ganesh is committed to the belief high quality education is a basic right regardless of economic circumstance. Secondly, all videos follow his ‘Don’t Memorise, Know More!’ philosophy. This entails videos having a strong conceptual element to bridge the gap between theory and application. In general, a simple story format is used to relate theory to real life. Finally, content needs to be relevant in order to have the maximum impact. His educational content can be used by anyone anywhere however it is currently being developed to meet learning needs of students in India. </p>\n\n<p>Ganesh has written the content for over 1,300 math related videos, ranging from middle school math to Test Prep lessons that are available on his website Don't Memorise (dot) com. He has personally trained and developed a highly capable small technical team to work with him. </p>\n\n<p>In just over two years Ganesh and ‘Don’t Memorise’ has developed a loyal and growing learner base that regularly access their resources from over a 170 countries. January 2015 saw the launch of Don’t Memorise’s own YouTube channel, its success marked with over 830k of views to date. His videos are also embedded in over 30 different educational websites. Aside from creating educational resources Ganesh interacts on various educational sites helping students solve specific problems. On one such site, Socratic(dot)org, around 32,000 students in 150 countries have had their learning support!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "GMAT and GRE Math - Master 'Permutations and Combinations'", 
    "price": 0, 
    "instructors": "Don't Memorise", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577354_778b_5.jpg", 
    "course_url": "https://www.udemy.com/dontmemorise_permutations_combinations/", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T12:03:18Z"
}