{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Learn all the concepts of mathematics and the problem solving techniques required to perform well in the quantitative section of the GMAT. </p>\n\n<p><strong class=\"redactor-inline-converted\">Get a thorough overview of the wide range of mathematics topics covered in the GMAT quantitative section, prepare easily through techniques and get rid of your fear of Mathematics.</strong> </p>\n\n\n\n\n\n<p>   Formulas and Problem Solving Techniques</p>\n\n\n\n\n\n<p>   Number Theory, Fractions and Exponents</p>\n\n\n\n\n\n<p>   Products, Powers and Roots</p>\n\n\n\n\n\n<p>   Percentages and Absolute Value</p>\n\n\n\n\n\n<p>   Algebra, Remainders and Word problems</p>\n\n\n\n\n\n<p>   Distance and Work Word Problems</p>\n\n\n\n\n\n<p>   Advanced Overlapping Sets</p>\n\n\n\n\n\n<p>   Triangles, Polygons and Circles</p>\n\n\n\n\n\n<p>  Coordinate Geometry, Standard Deviation and Probability</p>\n\n\n\n\n\n<p>  Combinations and Permutations</p>\n\n\n\n\n\n<p>  Sequences and Progressions</p>\n\n\n\n\n\n<p>  3-D Geometries</p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Effectively Prepare in Limited Time and Boost your Quant scores</strong></p>\n\n<p><strong class=\"redactor-inline-converted\"></strong>Learning to solve problems under time pressure is an important part of preparing for the GMAT. Of course, you should do everything you can do to maximize your ability to perform at the highest level on as many questions as possible. Of course, that’s what any responsible person preparing for the GMAT will strive to do. But the best laid plans of mice and men go oft astray. As well as you prepare and as diligently as you practice, you may still find yourself at the end of a section on a real GMAT running out of time. The strategies in this course will help you to tackle such situations and improve your performance. </p>\n\n\n\n<p><strong><br></strong></p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p><strong></strong>Whether you are starting your preparation or want to brush up all the topics after your preparation, this course serves you to the greatest extent possible. Start your math preparation now and excel in the quantitative section of GMAT.</p>\n\n\n\n\n\n<p>Want to get the maximum possible score on the GMAT? Maximize your quantitative score which is going to maximize your overall score. We will learn all concepts thoroughly required for performing effectively on the GMAT with efficient techniques which come in handy on the actual GMAT examination.</p>\n\n\n\n\n\n<p>This course covers all concepts of GMAT Math section and things to keep in mind while preparing for GMAT. It helps you to get an overview of all the concepts and shows you the way to practice through examples. I have covered a wide variety of topics needed to excel in the math section. Even for those who are scared of mathematics, this course is a motivation and a good resource to achieve a high score on the GMAT math section. It is a good start for students preparing for GMAT.</p>", 
    "end_date": null, 
    "title": "GMAT Math Preparation Course", 
    "price": "20.00", 
    "instructors": "Sri Suryadevara", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/824630_cb09_3.jpg", 
    "course_url": "https://www.udemy.com/gmat-math-highscore/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-17T23:57:30Z"
}