{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>Hi my name is Olu Sanya and I welcome you to this GRE Prep course. The # 1 question I get from students in our GMAT Prep Classes is, OLU <em>how do I start the question</em>? I have designed this GMAT course with that question in mind, <strong>In this course you will learn how to start &amp; completely solve the most commonly asked questions types on the GMAT test by seeing how I breakdown 230 GMAT questions from the Data Sufficiency section (starting from Pg 277) of The Official Guide for GMAT Review 2016</strong>. <em>You don't have to worry if you have been out of school for 5 months or 5 years, in this course I assume you know nothing so I take my time to break every question down as I start from the basics</em>. Checkout the free videos.</p><p><strong>Textbook : </strong><strong>The Official Guide for GMAT Review 2016 </strong><strong>(starting from Pg 277)</strong></p><p><strong>Buy on Amazon</strong><strong> : </strong><strong>ISBN-10: 1119042488 | ISBN-13: 978-1119042488</strong></p><p><strong><br></strong></p><p><strong>Included when you buy this Course</strong></p><ul><li><strong>I assume you know nothing</strong>, so I take time to breakdown each questions carefully.</li><li><strong>174</strong> GMAT Problem Solving Math Solution Videos from <strong>The Official Guide for GMAT Review 2016 </strong><strong>(starting from Pg 277)</strong></li><li>The videos progress from easy topics like Basic Arithmetic to more challenging topics like Probability &amp; Word Problems.</li><li><strong>FREE</strong> GMAT Math formula Sheet PDF (available for download in Lecture 3)</li><li><strong>FREE</strong> 1 hr Skype Session on GMAT Math or General Business School admissions questions.</li></ul><p><strong>Study Plan</strong></p><ol><li><strong>Start on </strong><strong>Pg 277 </strong><strong>in</strong><strong> The Official Guide for GMAT Review 2016 Textbook</strong></li><li><strong></strong>Attempt solving 5 or more questions in a roll in that section using the <strong>The Official Guide for GMAT Review 2016</strong> then use the video solution as an instruction tool for whichever question you get wrong or if you need a different way to solve the question.</li></ol>", 
    "end_date": null, 
    "title": "GMAT Prep Course | Data Sufficiency : 174 Solved Questions", 
    "price": "20.00", 
    "instructors": "Olu Sanya", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770118_647d_2.jpg", 
    "course_url": "https://www.udemy.com/gmat-prep-course-data-sufficiency-174-solved-questions/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T03:21:30Z"
}