{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>The Graduate Record Examination (GRE) is a standardized test created and administered by Educational Testing Service (ETS) since 1949. The GRE test score has a major contribution in your applications to universities in the United States and Europe. The GRE exam is a computer based test which aims to measure verbal reasoning, quantitative reasoning, analytical writing, and critical thinking skills that have been acquired over a long period of time and that are not related to any specific field of study.</p><p>The Quantitative Reasoning section in GRE constitutes to 50% of the total score. Unlike other competitive examinations, the GRE Quant section comprises of basic mathematics. At an academic level, the scope of the questions appearing is limited to the mathematical concepts learnt up to tenth grade. Thus, this section has become a goldmine which necessarily has to be targeted to ensure a high score.</p><p>To excel in the Quantitative Reasoning section, the rule of thumb used by toppers has been to focus on understanding concepts thoroughly and maintaining high speed and precision while solving. This course has been designed to comprehensively prepare an aspirant in these two aspects. In this online GRE course, each individual topic is explained right from the grassroots level. Ability to solve problems becomes an automatic progress if you understand all concepts across topics with high clarity. Next, problem solving skills have to be perfected by enhancing speed as well as the accuracy of answers. This can be achieved by practicing the numerous solved example problems and answering GRE practice tests that have been provided. Problem solving tips, shortcuts and easy hacks mentioned in the course will help you work on enhancing your speed. Self-assessment at each step will ensure continuous progress and will stand you in good stead on the day of the exam.</p><p>In summary, the salient features of this GRE Quants tutorial are:</p><ol><li>In depth explanations of concepts across topics in the GRE syllabus, along with unique insights.</li><li>Several solved example problems provided after each section, aimed at helping you grasp the implementation of concepts.</li><li>Comprehensive GRE practice tests at the end of each section to give you a clear picture about the difficulty and range of questions which could appear in the GRE exam.</li><li>Tips, tricks and shortcuts to enhance speed and accuracy.</li></ol><p>Acing the Quantitative Reasoning section in the GRE is a must for every serious aspirant. Focus Academy for Career Enhancement, India’s largest employability skill development company, has designed this Quants course with various insights gained over the years by teaching aptitude to over a million students. Diligently following instructions given in the course and working hard will guarantee an excellent GRE Quants score.</p>", 
    "end_date": null, 
    "title": "GRE Prep: Crack the Quantitative Reasoning Section", 
    "price": "40.00", 
    "instructors": "FACE Prep", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725198_251f_5.jpg", 
    "course_url": "https://www.udemy.com/gre-prep-crack-the-quantitative-reasoning-section/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T06:52:15Z"
}