{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p style=\"\">  \t      Not a child genius? Not a problem.  My name is Corey and I’m here to guide you  through an interactive course on quantitative problem solving for mastering the  math section of the GRE and GMAT exams. These problems are not duplicates of the long, tedious, subpar GRE and GMAT course books that you&#039;ve already purchased (such as the Barron&#039;s or Manhattan series which deviate from the actual GRE given by ETS and assume that you have infinite preparation time to work through their long lists of questions), so you will be getting brand new problems modeled after REAL GRE and GMAT questions that will challenge you in a unique way.  This course is vitally important for anyone planning to apply to most graduate programs and the GRE and GMAT math  questions come fully annotated solutions.   This course is also ideal for high school students preparing for the  SAT, as many of the harder math questions on the SAT will seem simple after  mastering these questions. Feel free to preview sample solutions so that you  have an idea of what to expect in the rest of the course.  Thank you for your time and I look forward to  helping you maximize your math proficiency.  </p>  <p style=\"\">  \t       Feel free submit questions through the course or directly to my email (hokiesalum[AT_symbol]]gmail[DOT]com ; include Udemy in the subject line). I want to do my best to make sure that you succeed! :-)  </p>", 
    "end_date": null, 
    "title": "GRE and GMAT Math - So Easy a Child Could Do It", 
    "price": "45.00", 
    "instructors": "Corey Moore", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67860_524c_10.jpg", 
    "course_url": "https://www.udemy.com/gre-math/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-22T05:46:48Z"
}