{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>\t Hi my name is Olu Sanya and I welcome you to this GRE Prep course. The # 1 question I get from students in our GRE Prep Classes is, OLU <em>how do I start the question</em>? I have designed this GRE course with that question in mind, <strong>In this course you will learn how to start &amp; completely solve the most commonly asked questions types on the GRE test by seeing how I breakdown 240 categorized GRE questions</strong>. <em>You don't have to worry if you have been out of school for 5 months or 5 years, in this course I assume you know nothing so I take my time to break every question down as I start from the basics</em>. Checkout the free videos.</p><p><strong><br></strong></p><p><strong>Textbook required for this course</strong> : <strong>Barron's 6 GRE Practice Tests, 2nd Edition</strong></p><p><strong>ISBN-10: </strong><strong>1438006292</strong></p><p><strong></strong></p><p><strong><strong>ISBN-13: 978-1438006291</strong><br></strong></p><p><strong><br></strong></p>  <p>\t<strong>Included when you buy this Course</strong>  </p>  <ul>\t<li><strong>I assume you know nothing</strong>, so I take time to breakdown each questions carefully.</li>\t<li><strong>240</strong> GRE Math Video Solutions</li>\t<li>The videos are categorized by topics so you can progress from easy topics like Basic Arithmetic to more challenging topics like Probability.</li>\t<li><strong>FREE</strong> GRE Math formula Sheet PDF (available for download in Lecture 3)</li>\t<li><strong>FREE</strong> 1 hr Skype Session on GRE Math or General Graduate School admissions questions.</li>  </ul>  <p>\t<strong>Study Plan</strong>  </p>  <ol>\t<li><strong></strong>Start each section by watching a few of the videos in that section.</li>\t<li>Change video setting to \"<strong>1080p</strong>\" button at bottom right of Video for improved Video quality</li>\t<li>Attempt solving 3 or more questions in a roll in that section using the <strong>Barron's 6 GRE PRACTICE TESTS 2nd Edition Textbook</strong> then use the video solution as an instruction tool for whichever question you get wrong or if you need a different way to solve the question.</li>  </ol>", 
    "end_date": null, 
    "title": "GRE Math Prep Course | The A - Z on GRE Math Topic by Topic", 
    "price": "20.00", 
    "instructors": "Olu Sanya", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262202_387c_4.jpg", 
    "course_url": "https://www.udemy.com/gre-math-prep-course/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-16T02:14:50Z"
}