{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>O QG do Enem oferece a todos que se submeterão ao Exame Nacional do Ensino Médio um curso completo de Redação de 30 horas.</p><p>Detalhes do Curso de Redação para ENEM 2015:</p><p>• <strong style=\"\">30 horas de aulas</strong>, com conteúdo totalmente atualizado.</p><p>• <strong style=\"\">Material de apoio</strong> para todas as aulas, contendo exercícios<br style=\"\"></p><p>CARGA HORÁRIA - 30.0H<br style=\"\"></p><p>DESCRIÇÃO DA GRAVAÇÃO DAS AULAS</p><p>O curso oferece 30 horas/aula, sendo cada aula dividida em 3 blocos de 20 minutos, de acordo com a carga horária, para que você estude com tranquilidade e tenha um ótimo aproveitamento ao longo do ano.</p><p>*A equipe de professores poderá ser alterada a qualquer momento, por motivo de força maior, cabendo à coordenação pedagógica do QG do Enem essa alteração.</p><p><strong style=\"\">Informações adicionais sobre as aulas:</strong></p><p>1) O curso estará disponível para compra até o dia anterior à realização do ENEM, em data esta divulgada pelo INEP.</p><p>2) As aulas ficam disponíveis na Área do Aluno até o dia 31/12/15.</p><p>3) As aulas disponibilizadas no curso foram desmembradas do Curso Completo.</p><p>4) As aulas são gravadas de janeiro a maio de 2015. Até o final de maio, todas as aulas e os materiais de download estão disponíveis na área do aluno. Gravamos as aulas ao longo de 2015 para garantir que o conteúdo seja o mais atualizado e contextualizado possível.</p><p>5) O aluno poderá assistir cada aula do curso até 03 (três) vezes, no horário que achar conveniente, basta possuir acesso à internet banda larga.</p><p>6) Em hipótese alguma será permitida a gravação ou download das aulas, vindo a incorrer em sanções penais e cíveis quem o fizer.</p>", 
    "end_date": null, 
    "title": "Intensivo de Redação para o Enem 2015 - Mão na Massa", 
    "price": "35.00", 
    "instructors": "QG do Enem", 
    "commitment": "31 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607968_8581_2.jpg", 
    "course_url": "https://www.udemy.com/redacao-curso-preparatorio-para-o-enem-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T13:20:48Z"
}