{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>A matemática é mais do que imaginamos. Um bom conhecimento da matemática básica, nos traz um bom desempenho em outras matérias como, por exemplo, Química e Física. A correção do Enem acontece de acordo com a Teoria de Resposta do Item (TRI). Isso significa que as perguntas são dividas entre fáceis, médias e difíceis e depois misturadas ao longo da prova. Através de estatísticas, as respostas dos alunos são analisadas. Caso o candidato tenha errado muitas questões fáceis e acertado as difíceis, o resultado é considerado improvável e por isso deduz-se ser fruto de chute. Assim, a média do aluno cai.</p><p>Conclusão, o conhecimento básico da matemática é extremamente fundamental para um bom resultado no Enem. Pensando nisso, o QG do Enem preparou tudo que você precisa saber de mais básico da Matemática que estará no Exame Nacional do Ensino Médio. São 20 horas de aulas com muita teoria, resoluções de exercícios, material de apoio e mensagem direta ao professor.</p>CARGA HORÁRIA - 20.0H<p>PROFESSOR - Prof. Rodrigo Sacramento</p><p>AULAS- 20</p><p>DESCRIÇÃO DA GRAVAÇÃO DAS AULAS<br></p><p><strong>Informações adicionais sobre as aulas:</strong></p><p>1) As aulas serão postadas a partir do dia 08/01/16.</p><p>2)<strong> </strong>Em hipótese alguma será permitida a gravação ou download das aulas, vindo a incorrer em sanções penais e cíveis quem o fizer.</p>", 
    "end_date": null, 
    "title": "Matemática do Zero para o Enem", 
    "price": "20.00", 
    "instructors": "QG do Enem", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725986_c4f3_3.jpg", 
    "course_url": "https://www.udemy.com/matematica-do-zero-para-o-enem-qg-do-enem/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T19:15:36Z"
}