{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>B-School applicants, get ready for your interviews! Whether you’ve already received an interview invitation or are hoping to get an invite over the next few weeks, you want to make sure you’re prepared to do your best when the big day arrives. This course will prepare you for common MBA-interview questions.</p><p>In this tutorial, we help you effectively prepare for your business school interview. The guide contains a compilation of the most important lessons we’ve learned over the years . We discuss all aspects of the interview - personal questions, career objectives, common questions and more. After reviewing the lessons, you will know what to expect and will be in the best position to shine when you appear for the interview with a representative from your target business school. </p><p>You will be able to prepare in a productive way, choosing the best subjects and stories for your interviews and avoiding the pitfalls that trip up many interviewees. We have assembled a list of the fundamental qualities and attributes that business schools values, so that you can be sure to emphasize and accent these characteristics, as they apply to you, in your interview.  Study this list closely, pay close attention to the qualities that describe you, and use your stories to supply the admissions officers with convincing reasons to believe that you possess these characteristics. </p><p>We also present you with common interview questions with sample scripted answers and an accompanying analysis. By applying this information to your interview preparation, you will greatly improve your execution on the stories you decide to share with the interviewer, enabling you to most effectively represent the best of who you are.</p>", 
    "end_date": null, 
    "title": "MBA Admission Interview - You got it", 
    "price": "50.00", 
    "instructors": "CollMission Advisors", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/772212_8a06_6.jpg", 
    "course_url": "https://www.udemy.com/mba-admission-interview-you-got-it/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-23T21:47:45Z"
}