{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p>✓ 5 hours of engaging, fully-animated content<br></p><p>✓ Hundreds of guided practice problems explained thoroughly by our GRE experts</p><p>✓ Analysis and explanation of essential test-taking strategies<br></p><p>✓ Created by a team of test preparation experts hailing from the nation's most prestigious universities</p><p>Nobody enjoys the GRE. It's boring, time consuming and worst of all, it's actually pretty important.<br></p><p>So how do you overcome the boredom of the GRE and score well?</p><p>Welcome to TutorMe's GRE course, the first ever fully-animated GRE course, where we teach you the GRE like nobody has before. It's fully-animated and will teach you the concepts tested on the GRE like never before. The boring black and white problems of standardized testing will be brought to life in an engaging and entertaining manner. With over 5 hours of original content, you won't find more in depth coverage of the concepts tested on the GRE. On top of that, we've added an additional 500 practice problems taken directly from the GRE. That's over two full tests of extra material.</p><p>Knowing <em>how </em>to take the GRE is almost as important as knowing what's <em>on </em>the GRE. Remember, this is a <em>Standardized </em>Test, meaning that the questions on the test will change every time you take it, but the skills and concepts tested won't. The GRE is <u>predictable</u>. If you study it, you will know exactly what to expect and when to expect it. There are important test taking strategies that you won't learn from Test Prep Books. We'll help you master the most effective strategies to tackling the test. We're here to help.<br></p><p>At the end of the day, the GRE tests concepts you have learned in High School and College, but it also tests how well you take the GRE. We'll make you an expert on both.</p><p>Why is the GRE so important?</p><ul><li>GRE scores are critical to a student's grad school opportunities</li><li>A higher GRE score can lead to more scholarship money</li><li>Some employers require GRE scores well beyond graduation</li></ul>", 
    "end_date": null, 
    "title": "Premium GRE® Prep Course: Improve Your GRE Score", 
    "price": "20.00", 
    "instructors": "TutorMe Test Prep", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685310_5a5b.jpg", 
    "course_url": "https://www.udemy.com/tutorme-gre/", 
    "currency": "USD", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T20:05:10Z"
}