{
    "selfpaced": true, 
    "topic_name": [
        "Test Prep"
    ], 
    "description": "<p><strong>Why take this course?</strong></p><p>This is a complete and comprehensive course for all levels and abilities, covering the fundamental core aspects of the GMAT AWA Essay. This course will prepare you to take this Analytical Writing Assessment component of the GMAT. A separately scored and mandatory section of the GMAT. </p><p><strong>What will it provide?</strong></p><p>It will provide you with the essential tools, strategies, approaches &amp; techniques in order to obtain the highest possible score 6.0 in the GMAT Essay. </p><p>In addition to the complete comprehensive video lectures there are several downloadable resources and material included with this course including the Official AWA Question List, the Essay Template, the AWA Scoring Criteria and a set of real fully worked GMAT questions and answers.</p><p><strong>How will I learn?</strong></p><p>This Ultimate GMAT course is structured in an easy to follow, digestible structure - so that you can learn and absorb the techniques and strategies in order to maximise your score potential. Also included is a set of actual GMAT Essay questions and answers - fully explained in granular detail. </p><p><strong>What impact will it have?</strong></p><p>This course is a crucial and important resource that all GMAT test takers should use to familiarise and build confidence in answering the essay question in the GMAT. Universities are likely to request transcripts of your actual essay responses for interview purposes - so it makes sense that you really ace this section with flair!</p>", 
    "end_date": null, 
    "title": "Ultimate GMAT Essay - Ace the Essay in 1 week", 
    "price": 0, 
    "instructors": "Irfan Ali", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534142_dfa1_3.jpg", 
    "course_url": "https://www.udemy.com/ultimate-gmat-analytical-writing-assessment-awa-essay/", 
    "subject_name": [
        "Grad Entry Exam"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T13:58:56Z"
}