{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      The course is about the 10 numbers every business owner should know - as they are running a business, and all numbers tell a story.  </p>  <p>  \t        The course will take approx 1 hour to complete.  </p>  <p>  \t        It's  an ideal course if you are working in the accounts /  finance department  and/or if you are thinking of embarking on a career  in accountancy or  bookkeeping and part of your requirement is to do some number crunching and report back to the owners of the  firm.  </p>  <p>  \t        If you are thinking of  starting your own business and want to  understand how the numbers work, and what they're saying to you - then this course is  for you.  </p><p>We look at numbers which relate to a companies liquidity, profitability, solvency, debt and what they mean. Doing the accounts / bookkeeping isn't a futile exercise. All numbers paint a picture, and this course will help you to understand what that picture is, whether that picture looks any good, and how to make that picture look better.</p><p>These numbers are useful for you in your own organizations. You can compare the results you are getting now, to what you were getting at the same time last year, you can compare the numbers to your competitors, you can compare the results to your industry benchmark and averages and you can also set yourself goals/targets and assess whether or not you are reaching those targets. Its far better to have objective measurable goals in a business, as opposed to subjective guesswork.<br></p>", 
    "end_date": null, 
    "title": "10 Numbers Every Business Owner Should Know", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302450_4299_4.jpg", 
    "course_url": "https://www.udemy.com/10-numbers-every-business-owner-should-know/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:03:18Z"
}