{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  ¿Quieres aprender a encontrar  qué acciones tienen mayor potencial de  revalorización en los próximos meses? ¿Quieres saber qué debes hacer  para no ponerte nervioso y cerrar una operación en la que vas ganando  demasiado rápido por miedo a perder? ¿Quieres saber cuándo es mejor  asumir una pérdida y vender a aguantar una operación perdedora y que  cada vez sea mayor la pérdida? ¿Quieres estar seguro de qué el Fondo de  Inversión en el qué te recomiendan invertir es realmente lo que te están  diciendo? ¿Tienes claro qué lo que te están recomendando que inviertas es lo más conveniente para ti?  </p>  <p style=\"\">  \t<br style=\"\">  \t   Con este curso aprenderás a responder todas las preguntas anteriores  entre otros conceptos. También hablaremos de la renta fija, veremos que a  pesar de qué muchos inversores creen que la renta fija garantiza el  100% de su capital, hay que tener en cuenta en qué producto de renta  fija  estamos invirtiendo para así evitar casos como lo de las  preferentes.  </p>  <p style=\"\">  \t  Hablaremos de:  </p>  <ul style=\"\">  \t<li style=\"\">Acciones</li>  \t<li style=\"\">Análisis Técnico</li>  \t<li style=\"\">Conocimiento y manejo de una plataforma de inversión con ejemplos</li>  \t<li style=\"\">Distintas órdenes</li>  \t<li style=\"\">Gestión del capital</li>  \t<li style=\"\">Diversificar la cartera</li>  \t<li style=\"\">Control de las emociones</li>  \t<li style=\"\">Saber buscar Fondos de Inversión adecuados a nuestro perfil</li>  \t<li style=\"\">Tipos de Renta Fija, Deuda Pública, Privada...</li>  \t<li style=\"\">Invertir a través de ETF&#039;s</li>  \t<li style=\"\">Cómo afecta fiscalmente nuestras inversiones.</li>  </ul>", 
    "end_date": null, 
    "title": "15 Mandamientos para ganar dinero en Bolsa", 
    "price": "20.00", 
    "instructors": "Ramón  Cardó", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315716_d5a8.jpg", 
    "course_url": "https://www.udemy.com/15-mandamientos-para-ganar-dinero-en-bolsa/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T10:25:26Z"
}