{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Do you ever want to live your life doing things you love?</p><p style=\"\">Do you want to how to increase your wealth substantially and achieve financial freedom?</p><p style=\"\">Do you want to quit your average 9 to 5 job and travel the world? Is it possible? Some may say this is a dream but why are there still people who are able to achieve this? People are often interested in getting rich and achieving your financial freedom but why do they fail to do so? The reason is simple; they do not know how to achieve this. Bad news is, majority of people in the entire world do not know how but good news is, you will know how soon by taking this course.</p><p style=\"\">This course teaches you how easy it can be to multiply your income regardless of how much you are earning at the moment now. All you need is to implement the steps taught here into your daily life and you will be on track to financial freedom.</p><p style=\"\">Concepts are explained in a simple form and as such, everyone can do it regardless of your knowledge on financials. You will be able to follow along and gain confidence in analyzing business on your own in no-time. Upon successful completion of this course you will be able to:</p><p style=\"\">✔ Understand why people fail to achieve financial freedom and how you can avoid it. </p><p style=\"\">✔ Learn how to save more money instantly.</p><p style=\"\">✔ Learn how some low risk and high return techniques in investing your money</p><p style=\"\">✔ Tips and tricks the wealthy use in daily life to achieve financial success..</p><p style=\"\">If you are serious about building your wealth and multiplying your income, click 'Take This Course' now and start building up millionaire portfolio.</p>", 
    "end_date": null, 
    "title": "2 Easy Steps To Investment And Avoiding Traps", 
    "price": "20.00", 
    "instructors": "Key To Financial  Success", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486240_2a5b_6.jpg", 
    "course_url": "https://www.udemy.com/easy-steps-to-investment/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-25T20:22:10Z"
}