{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                In this course, you will learn to create a basic but highly professional financial model in less than 2 hours. You will learn finance and accounting principles such as how to build a set of integrated financial statements, and you will leave with the skills and tools to build a professional-quality financial model.  </p>  <p>  \tYou will get a free 2-week trial of the SpringExcel financial model template or use promo code UDEMY50 to get 50% off when you upgrade to the paid version ($50 value).  </p>  <p>  \t                  You should take this course if you want to:  </p>  <ul>  \t<li>learn the basics of financial modeling quickly.</li>  \t<li>make a financial model for your business.</li>  \t<li>improve your finance, accounting and business model generation skills.</li>  \t<li>stick out in a job interview.</li>  </ul>  <p>  \t                  This course is designed to be helpful for people who are learning finance, accounting or entrepreneurship as well as people who just want to create a quality financial model for their business. It was created by an MBA-trained entrepreneur who has made financial models to raise over $20M for multiple startup technology companies.  </p>  <p>  \t                In order to maximize the speed of your learning, this course is intended to be used with the SpringExcel financial model template, which uses Microsoft Excel and is free to download. There are a total of 9 videos totaling less then 2 hours in length, with additional presentation slides to teach you financial modeling best practices. Follow along on your computer as I build a financial model for a fictitious startup called Waggsy. By the end, you will understand how to setup a financial model and you will quickly learn a few modeling best practices that take many professionals years to develop.  </p>  <p>  \t          You could complete this course in one sitting or spread it out over a few days.  </p>", 
    "end_date": null, 
    "title": "2-Hour Financial Model", 
    "price": 0, 
    "instructors": "Jeff LeBrun", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279740_0f9a_4.jpg", 
    "course_url": "https://www.udemy.com/2-hour-financial-model/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T22:21:05Z"
}