{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong> 8 Steps To Achieve Financial Freedom And Escape Debt</strong> guaranteed to help you increase cash, eliminate debt, retire wealthy and enjoy life. </p>  <p>I designed this course to teach you about money for Safe Wealth Creation to achieve your dreams. You’ll learn the easy ways to increase your cash flow and save money tax-free to replace your future salary, business or career income.  At that point, you won’t <em>need</em> to work any longer. You may <em>choose</em> to work but not <em>need</em> to work. </p>  <p>That’s financial independence where your dreams actually can come true.  Would you like to know how to get there as soon as possible?</p>  <p><strong>Learn and Master the 8 Simple Steps to Financial Freedom Safely</strong></p>  <ul><li>The Problem 96% of people don’t know they have</li><li>The Painless Solution</li><li>Eliminate Debt</li><li>Improve Your Cash flow</li><li>Protect Your Cash</li><li>Leave A Legacy</li><li>How to turn $1.40 into $40,000 and then into $ millions in a way you’ll never forget</li><li>Design your plan to achieve your financial independence.</li></ul>                <p>I designed this course for the entrepreneur, manager or rising star. You want to have enough money to enjoy your lifestyle today and in the future but maybe you’re not sure how to make the right choices or what are the right questions to ask to become financially independent safely.  </p>  <p>This course and I will help you achieve your dreams.</p>  <p>The course is broken into 11 Sections for each of the 8 Steps to Financial Freedom plus an introductory section and a wrap-up section with a Bonus lecture.  Each Section has 2 or more lectures averaging 5 minutes and a short Quiz to test your understanding to that point followed by a Conclusion. Total time to take this course is approximately 5 hours. </p>  <p>Several lectures have supplemental downloadable resources such as a PDF whitepaper, worksheet or a link to an outside online resource such as our Facebook Mastermind Group for our student community, as well as online calculators for social security, mortgage payments and an emergency fund.  </p>  <p>In this course, you’ll learn stuff that will amaze, shock and surprise you. What you do with what you learn will determine your future.  It’s simple stuff wealthy people do every day.  Interested to learn more? Feel free to look through the course description and I look forward to meeting with you inside.</p>", 
    "end_date": null, 
    "title": "8 Steps To Achieve Financial Freedom And Escape Debt", 
    "price": "40.00", 
    "instructors": "Gail Nichols", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614668_fb27_3.jpg", 
    "course_url": "https://www.udemy.com/achieve-financial-freedom-and-escape-debt/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T10:31:03Z"
}