{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t         Learn the techniques a full-time Professional Trader uses every day for Swing Trading and Day Trading.  Analyzing daily charts and weekly charts is important when Swing Trading.  To be a successful Day Trader,  it is imperative to know how to quickly and correctly read  stock charts.  </p>  <p style=\"\">  \t  These 50 video lessons, that total up to 8.5 hours of playtime, will teach you all about stock charts and the many Technical Indicators you can load onto them.  The most common and useful indicators will be covered first, and after the 15th lecture, Stock Chart Setup #1 is presented, which is something you can start to use in your trading right away!  </p>  <p style=\"\">  \t Each lesson begins with a brief explanation of each Technical Indicator.  The majority of each 10 minute lesson is spent showing you exactly how an experienced trader uses them. Every video shows numerous chart examples of each indicator in Action.  </p>  <p style=\"\">  \t The final lesson on &quot;Multicollinearity&quot; - or - &quot;There are SO many indicators! Which ones do I USE?&quot;, explains how indicators are grouped, and how to avoid a common problem chartists have, by using too many of the same types of indicators on their charts.  This lesson will show you how to choose your favorites from each category to get best results.  </p>  <p style=\"\">  \t   Questions from students will be answered promptly, and Live Sessions will be planned for one on one discussion about your favorite stock charts.  </p>", 
    "end_date": null, 
    "title": "A Beginners Guide to Technical Analysis of Stock Charts", 
    "price": "20.00", 
    "instructors": "Tom Watson", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66383_23c7_8.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-technical-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-17T22:57:14Z"
}