{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>New Upcoming Lectures (Coming Soon !!!): Choosing your broker wisely and real live trades via the ''Trend Channelor'' strategy.</strong>  </p>  <p>  \t              The whole course is broken down into four main areas. The very first area is mainly focused on the basic aspects of Forex, such as important definitions and terms, as well the so called ''MT4'' software widely used by brokers and traders nowadays.  </p>  <p>  \t                    The second part is a simulation into the real world of Forex, describing in detail the major traps beginner traders fall into, as well as the key characteristics successful traders possess.  </p>  <p>  \t                    Furthermore, the third section of the curriculum highlights the financial aspects every trader must have in mind, such as the key steps needed prior to placing an order or a deal, the profit and loss factor associated per deal, and the various methods needed in maintaining consistency during the trading process.  </p>  <p>  \t                    Last but not least, and the most important section of this course, is the introduction and implementation of the so called ''Trend Channelor'' strategy, a methodology that myself have been using for a long time now, thus making my predictions in relation to the various currency pairs available in the market.  </p>  <p>  \t                    Graphical illustrations and tables have been used as part of the teaching and lecturing procedure. The course's duration is approximately fifty minutes.  </p>  <p>  \t                    New comers and existing traders will have the opportunity via this course to learn what is specifically needed thus making a living via trading the markets.  </p>", 
    "end_date": null, 
    "title": "A Complete Guide to Becoming a Trader on the Forex Market", 
    "price": "25.00", 
    "instructors": "Elias Kazamias", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247558_1679_3.jpg", 
    "course_url": "https://www.udemy.com/make-a-living-with-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-21T08:04:19Z"
}