{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ever read Robert Kiyosaki's book \"Rich Dad Poor Dad\"?  One of the important messages in Robert Kiyosaki's book is that we can increase our financial wealth by increasing our financial intelligence.He mentions that financial intelligence is made up of four technical skills – Accounting, Investing, Understanding Markets and the Law. The goal of this course is to learn one of those essential technical skills  - understanding markets. The key to understanding markets is to understand economic indicators such as growth, inflation, interest rates, the impact of these indicators on the financial markets (stock, bond and FX) and central bank's reaction to these indicators. This our goal as a first step towards financial intelligence, which can be achieved through this course.</p>\n\n<p>We find bits and pieces of information on macro economic indicators, news headlines on how the markets rise and fall on the release of these macroeconomic indicators, how politicians and citizens react on a sudden rise in unemployment rates and how the central bank decides to increase interest rates by a 0.25%. But to make the connections between economic entities, indicators, financial markets, central banks and politics we need a much deeper insight to their workings.</p>\n\n\n\n\n\n\n\n<p>We first understand the determinants of financial instruments. Next we understand how growth is measured by the Gross Domestic Product, the historical context of growth in the US and the components of growth. We look how each macroeconomic indicator tells us a story on either growth or inflation, who releases them and their dates. We see how these indicators act on the determinants of financial instruments and why the central bank reacts to these indicators. We will make all these connections between economic entities, factors, markets and central bank policies through the use of an economic map. </p>\n\n\n\n\n\n\n\n<p>We specifically study the US economy and US economic indicators since the US markets are followed worldwide. The economic indicators we will study are </p>\n\n\n\n\n\n\n\n<ul><li>The Quarterly GDP Report</li><li>Car Sales Report</li><li>Retail Sales Report</li><li>Personal Income and Outlays Report</li><li>Housing Starts</li><li>Durable Goods</li><li>Factory Orders and Manufacturing Inventories</li><li>Construction Spending</li><li>Trade Balance Report</li><li> Purchasing Manager's Index</li><li>Employment</li><li>Industrial Production</li><li>Leading Economic Indicators</li><li>Beige Book</li><li>Consumer Confidence Index</li><li>Consumer Credit Report</li><li>GDP Deflators</li><li>Consumer Price Index</li><li>Producer Price Index</li></ul>\n\n\n\n<p>By the end of this course you will have all the tools necessary to start making the connections between the economy, financial markets and central banks.<br></p>", 
    "end_date": null, 
    "title": "A Layman's Guide to the US Economy: Demystifying Indicators", 
    "price": "20.00", 
    "instructors": "Investment Banker, IT Consultant Mikesh Shah", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/642060_8541_5.jpg", 
    "course_url": "https://www.udemy.com/a-laymans-guide-to-the-us-economy-demystifying-indicators/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-16T04:16:24Z"
}