{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\"><br style=\"\"><li>Learn <strong style=\"\"></strong>the<strong style=\"\"> 4 steps to think and operate like a Value Investor</strong></li><li>Get familiar with the <strong style=\"\">Stock Market</strong></li><li>Learn the <strong style=\"\">Key Financial Ratios</strong> used in business analysis</li><li>Learn to analyze <strong style=\"\">Financial Statements</strong></li><li>Learn <strong style=\"\">5 Stock Screening Guidelines</strong> used by the greats</li><li>Learn how to select the <strong style=\"\">Best Bargains</strong> in the stock market and get a <strong style=\"\">High Return</strong>?</li><li>Learn <strong style=\"\">2 techniques</strong> that will <strong style=\"\">run your Portfolio on Autopilot</strong></li></ul><p>..............................................................................................................</p><p><em style=\"\"></em>Have you ever wanted to invest in the stock market, but don't want to risk losing your savings?  </p>  <p>  \t      Ever wondered if there was a way to invest smart?  </p>  <p>  \t      And if you are like us, you probably don't want to waste weeks or months reading finance books.  </p>  <p>  \t      That's why we created a straightforward, simple course that will take you from beginner to value investor in under 2 hours.  </p>  <p>  \t      Do you need any previous experience or finance knowledge? Absolutely not! We will guide you from the very basic level.  </p>  <p>  \t      This course doesn't just teach one technique, we cover the stock market basics, financial statements and stock market vocabulory.  </p>  <p>  \t      After laying the foundation, the course teaches two main techniques. One is for the person who has time and energy to analyze stocks; the benefit is that his gains will be high!  </p>  <p>  \t      Other technique is for someone who doesn't have the time for all that, but still wants a piece of the stock market action; we call the second technique 'portfolio on autopilot'  </p>  <p>  \t      Both these methods are targeted at the long term. This means the risk is minimum and you can continuously make money in the stock market!  </p>  <p>  \t      If you are ready to start your career in investing, try the course today at this introductory price of $97. Good luck to you!  </p>", 
    "end_date": null, 
    "title": "A Value Investing Approach to the Stock Market", 
    "price": "20.00", 
    "instructors": "Kas Education", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366514_a1d1_8.jpg", 
    "course_url": "https://www.udemy.com/start-investing-the-right-way/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T10:09:40Z"
}