{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Accounting 1 Simplified for You </strong>- is a unique, no-nonsense and meaningful way of understanding accounting basics by illustrating how business transactions are recorded in simple terms and step-by-step easy to follow exercises. Discover how easy it is to prepare financial statements and  design your own accounting information system.    </p><p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tEmpower yourself with the advantage of knowing and understanding your organization's economic conditions through financial statements. Possess the ability to convert data into information that is meaningful to you. Convert your fear in accounting to confidence based on understanding the \"jargon\" in your own terms. Sharpen your analytical skills and empower yourself with understanding accounting for your business.               \t</p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\tIn this class, you will have a series of thoughtfully prepared video lectures, using real-life business examples and practice exercises after each section to reinforce your learning. Dr. Jacinto promotes and encourages lively discussions and feedback sessions. All your questions directly related to the topic will be answered within 24 hours. This course is ideal  for college business and accounting students, bookkeepers, business owners, managers and anyone who wants to better understand accounting in business in a way that makes sense to you. This is an excellent study guide and supplement for students in accounting and those who are looking for a quick refresher. This course is an excellent complement to Accounting 2 Simplified You.                            \t</p>", 
    "end_date": null, 
    "title": "Accounting 1 Simplified for You", 
    "price": "30.00", 
    "instructors": "Majo Jacinto", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317572_251d_12.jpg", 
    "course_url": "https://www.udemy.com/accounting-1-simplified-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-11T03:25:52Z"
}