{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">This instructor facilitates the process of understanding the cashflow statement - providing details between the inflows and outflows during a given period of time. Plus tips are provided to keep your organization in the $$$.- Edie (Student)</strong></em></p><p>  \t  You are thinking about your business idea but the thought of putting together some financial leaves you in utter paralyses. Perhaps you want a quick way of getting your cash-flow projections together. Or you might even be a seasoned business owner who is seeking some fresh insight on how to create a cash-flow forecast. If any of these apply to you then you are in the right place!  </p>  <p>  \t  Since cash is king then the flow of cash in and out of the business is the life blood! For those not sure of the exact amount needed to start their business; a cash-flow is the answer. For existing businesses that need financial re-engineering; a cash-flow is the answer as well. If you are looking for a reality check on your business viability; then a cash-flow is the answer too.  </p>  <p>  \t  In these videos you will actually watch me build a cashflow forecast from scratch! These look over my shoulder series of videos will enable you to capture the essential skills necessary to create your own cashflow projections.  </p>", 
    "end_date": null, 
    "title": "Accounting: Learn Cashflow Forecasting in 60 Minutes!", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267984_4b76_3.jpg", 
    "course_url": "https://www.udemy.com/cashflow-forecasting-made-easy-learn-it-in-40-mins/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T11:40:30Z"
}