{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "Welcome to this course on Accounting for Deferred Taxes      Are you an Accounting / Finance / Auditing Student?        Are you a Banker / Financial or Project Consultant?        Are you coming across Deferred Taxes often in Financial Statements as well as in your discussions but couldnt get a grip on the basics of it?        Then, this course is for you!        This course teaches you the basics and rationale behind the concept of Deferred Tax.    Yes! Deferred Tax concept has sound rationale and its accounting is very important for getting clear picture of financial performance and position of any business entity.    But many of us doesnot appreciate the intent of that tax accounting and tend to ignore it in view of the complexity in the computation as well as in the interpretation part.         Generally, business entities will be arriving at their profits by following generally accepted accounting practices. But tax authorities will have their own rules and regulations and they will arrive at profits of business entities in a different way. Hence, Tax liability for a business entity is a result of various adjustments based on the tax law.  This may result in postponing tax liabilities some times which will result in sizeable profits  in that year but in the later years when this postponed liability is caught, it would affect the liquidity of the business. Hence, to avoid all these mishaps, deferred tax accounting is practised.        This course tries to clear the above by providing lectures on each and every concept like    a) What is Tax    b) Why Deferred Tax should be accounted    c) What is the Generally Accepted Accounting Procedures for Deferred Tax    d) What are the basic terms associated with Deferred Tax    e) What is the difference between Accounting Income and Taxable Income    f) What is the impact of Timing Differences    g) What are Deferred Tax Asset and Liability    h) What are Reasonable Certainty and Virtual Certainty     I) How to recognise Deferred Tax in Financial Statements.        This course uses terms and terminologies related with Accounts and Tax. Hence, it is important that you should have basic knowledge on Accounts and Financial Statements.         This course has 10 Video lectures explaining the concepts and ends with example lecture.    This course is structured in self paced learning style.        If you want to know the basics of deferred tax accounting, then you are in right place.", 
    "end_date": null, 
    "title": "Accounting for Deferred Taxes (Professional Course Level)", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394636_3ce0.jpg", 
    "course_url": "https://www.udemy.com/accounting-for-deferred-taxes/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T06:42:57Z"
}