{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t        Hi everyone,  </p>  <p>  \t        I’m very happy to welcome you to this course which I hope will answer your questions about accounting.  </p>  <p>  \t        The course title is &quot;Accounting for everyone&quot;. Obviously you can&#039;t learn all the accounting techniques in an hour -unless you get all that information uploaded into your brain. So, the objective of this course is to give you the basic instruments to help you understand financial statements. This is the first step before you are able to analyze financial statements and diagnose a problem.  </p>  <p>  \t        The target audience for this course is entrepreneurs, accounting students, business students and anyone who wants to be a corporate banker, an investment banker or a management consultant. This course is not going to be very technical or use a very complicated jargon. It will be part of a series of courses which will help you improve your ability to diagnose corporate problems and find the appropriate remedy to them.  </p>  <p>  \t        The lectures are presented in the form of a simple power point presentation narrated by Axile (that’s me). I will also create a Google hangout so students can ask more questions about this topic or get some advice on the banking industry. I will also add some exercises and quiz to make sure that YOU understand the different concepts.  </p>  <p>  \t        If this is what you are looking for…enjoy the course and don’t hesitate to ask questions!  </p>  <p>  \t        Looking forward to working with you!  </p>  <p>  \t        Axile  </p>", 
    "end_date": null, 
    "title": "Accounting for everyone! ", 
    "price": "20.00", 
    "instructors": "Axile Talout", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298044_6b74_3.jpg", 
    "course_url": "https://www.udemy.com/accounting-for-everyone/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T00:13:42Z"
}