{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  This is not your typical accounting course!  </p>  <p>  \t  Professor Turner has taught thousands of students basic accounting.  He has developed shortcuts and analogies to make learning accounting easy.  If you want to understand this subject in a simple, fun way then this brief introductory course is for you.  </p>  <p>  \t  This course will show you the very basics of accounting.  You can complete it in about an hour.  The course includes videos of the instructor at the whiteboard.  You will complete simple quizzes to reinforce what you have learned.  This course is intended for business owners, business students, managers or anyone who wants to understand basic accounting.  It presents the information in an understandable format.  Even if you have taken an accounting course you will find the material insightful.  </p>  <p>  \t  The course introduces  </p>  <ul style=\"\">  \t<li>The Accounting Equation (One you can understand!)</li>  \t<li>Balance Sheets</li>  \t<li>Income Statements</li>  \t<li>Debits and Credits (And how to know which is which!)</li>  \t<li>Why Profit Does Not Equal Cash!</li>  </ul>  <p>  \t  If you have dreaded the thought of learning accounting, this is exactly the introduction you will welcome!  </p>  <p>  \t  Why should take this course?  </p>  <p>  \t  You are a business owner.  You want your business to succeed and you know that you need a better understanding of how the numbers are put together.  </p>  <p>  \t  You are a manager.  You deal with accounting staff, bookkeepers, owners and subordinates.  You hear accounting terms daily but you want to know more about what accounting means.  </p>  <p>  \t  You are a business student.  You dread taking your first accounting course.  Or maybe you are in an introductory class right now.  It all sounds so complicated.  You want to find a simple explanation of what you are trying to learn.  </p>  <p>  \t  You are an accounting student.  You feel that you really did not get a firm grasp of the basics.  You would like to start from scratch in an easy to learn format.  </p>", 
    "end_date": null, 
    "title": "Accounting in 60 Minutes - A Brief Introduction", 
    "price": 0, 
    "instructors": "Vincent Turner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/48841_9110_7.jpg", 
    "course_url": "https://www.udemy.com/accounting-in-60-minutes-a-brief-introduction/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-07T19:54:50Z"
}