{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>----------------------------------------------------------------------------------------------------------------------------</p><p style=\"\"> <strong style=\"\">This course is excellent!!</strong> </p><p style=\"\">The basic concepts of accounting are made very clear through crisp explanations .The lecturer Mr. Raja has got in-depth understanding of the subject matter. I highly recommend this course to people who wants to have strong foundation in Finance.</p><p style=\"\"> <strong style=\"\">Excellent visual presentation</strong> </p><p style=\"\">The title has been aptly chosen for this course. The visuals really make this course interesting and easy to understand the basics of accounting. Wonderful!</p><p>-----------------------------------------------------------------------------------------------------------------------------<br style=\"\"><br style=\"\">Welcome to this course “Accounting through Visual Presentation&quot;</p><p>If you are looking out a way to understand the basics of accounting in a simplest way, then this course is for you.</p><p>There are lots of courses on accounting in online platforms. How this course is going to be different? </p><p>Will this course, teach you different accounting methodology?</p><p>No, it cannot be.</p><p>Then how this course is going to be different?</p><p>It is different in terms of its presentation. </p><p>Visual Presentation.</p><p>Traditionally accounting is taught with too many numbers. But, in this course, you will see life behind those numbers.</p><p>It is said, seeing is believing. </p><p>You will see lot more in this course, so you will appreciate that accounting is not mere recording of numbers but it is an important process and it has lot many to communicate.</p><p>In this course, you will have three missions. </p><p>Mission 1 – You will be equipped to prepare Financial Statements without any basic knowledge in Accounting.</p><p>Mission 2 – You will understand Debits and Credits in Accounting with utmost clarity.</p><p>Mission 3 – You will understand and appreciate the Golden rules of Accounting so you will have absolute authority in the fundamentals. </p><p>This course is a journey, an accounting journey, and you will carry sense of satisfaction after the end of each mission. </p><p><strong style=\"\">Structure of the Course:</strong></p><p>This course is structured in self-paced learning style.</p><p>You can learn at your convenience.</p><p><strong style=\"\">Terminologies used in the course:</strong></p><p>Very simple language is used with soothing music background.</p><p><strong style=\"\">Material used in this course:</strong></p><p>Video lectures were used in this course to present the course content.</p><p>Why you should take this course?</p><p>You should take this course, if</p> <ul style=\"\"><li style=\"\">a)You want to learn about the basics of accounting.</li> <li style=\"\">b)You want to understand the basics with utmost clarity.</li> <li style=\"\">c)You want to enjoy the learning process.</li></ul>", 
    "end_date": null, 
    "title": "Accounting Basics in 66 Minutes (absolutely for beginners)", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441112_acc6_4.jpg", 
    "course_url": "https://www.udemy.com/accounting-through-visual-presentation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T09:49:31Z"
}