{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>There are not many courses available on the market that make a complex and dry subject understandable and even fun. This course does just that!</p><p>In no time you will be able to learn the essentials of Accounting and Bookkeeping two of the fundamental tools for a successful career in Finance.</p><p><strong>Accounting Made Easy: A Quick Guide To Financial Accounting</strong> will help you understand basic accounting concepts and offer extra practice on topics such as:</p><p>...Bookkeeping, Debits, Credits, the Chart of Accounts, General and Subsidiary Ledgers, T-Accounts, Income Statement and Balance Sheet items, The Accounting Equation, the Double-Entry Principles and more...</p><p><strong><em>In no time you will be able to:</em></strong></p><ul><li>Set up an accounting system</li><li>Recording accounting transactions</li><li>Making accounting entries</li><li>Preparing Income Statements and Balance Sheets</li><li>Understand Financial Statements</li></ul><p>The course is suitable for people with no previous Accounting or Business knowledge. You can complete it in a couple of hours and instantly improve your understanding of financial statements and accounting transactions!</p><p><strong><em>What makes this course different from the rest of the Accounting courses that are out there?</em></strong></p><ul><li>High quality of production – HD video and animations (This isn’t a collection of boring lectures!)</li><li>Knowledgeable instructor (experience in Big 4 Accounting + Master in Finance)</li><li>A Complete Case Study that will help you reinforce everything that you’ve learned</li><li>Excellent support: If you don’t understand a concept or you simply want to drop us a line, you’ll receive an answer within 24 hours</li><li>Dynamic: We don’t want to waste your time! The instructor keeps up a very good pace throughout the whole course.</li></ul><p><strong><em>How come Accounting is so important?</em></strong></p><p>It’s about money, right? If you want to understand how money is coming in and going out of a business, you will have to learn accounting.</p><p>Here are <strong><em>5 more reasons</em></strong> why you should take this course and learn accounting:</p><ul><li>Jobs. A solid understanding of accounting usually lands you a sweet job as an accountant and opens doors for a number of career paths.</li><li>Promotions. Accountants are promoted very easily inside large corporations</li><li>Mick Jagger studied accounting</li><li>Secure Future. Accounting skills remain with you and provide extra security. You won’t ever have to fear unemployment</li><li>Girls dig accountants! Guys who can tell the difference between debits and credits are proven to be the most popular with women</li></ul><p>Please don’t forget that the course comes with <strong><em>Udemy’s 30-day unconditional money-back-in-full guarantee</em></strong>. And why not give such a guarantee, when we are convinced that the course will provide a ton of value for you?</p><p>So what are you waiting for?<strong><em> Click the \"Take this Course\" button and start learning now!</em></strong></p>", 
    "end_date": null, 
    "title": "Accounting Made Easy: A Quick Guide to Financial Accounting", 
    "price": "20.00", 
    "instructors": "365 Careers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640062_92c6_2.jpg", 
    "course_url": "https://www.udemy.com/accounting-made-easy-a-quick-guide-to-financial-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T06:33:08Z"
}