{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>------------------------------------------------------------------------------------------------------------------------</p><p>Welcome to one of the comprehensive ever course on Accounting Basics. </p>  <p>This course starts from “What is Accounting”, “Need for Accounting” to various Practical aspects in Accounting. Enjoy lectures for each and every concept in accounting presented in digital hand written format followed by Solved Case Studies Video.</p>  New videos are being added at frequent intervals and this course will be the longest one in Accounting soon.<p>------------------------------------------------------------------------------------------------------------------------</p>Welcome to Accounting Basics - A Complete Study Course!  This is one of the comprehensive course in Fundamentals of Accounting covering theory as well as practice.  In this course, you will learn Fundamentals of Accounting, step by step covering the following:  Section 1: a)\tIntroduction to Accounting; b)\tBook Keeping; c)\tAccounting – Objectives and Process; d)\tAccounting Cycle; e)\tAccountancy, Accounting and Book Keeping; f)\tUsers of Accounting Information; g)\tBranches of Accounting; h)\tBasic Accounting Terms; i)\tBasic Assumptions in Accounting; j)\tBasic Concepts in Accounting; k)\tModifying Principles of Accounting; l)\tAccounting Standards;  Section 2: m)\tDouble Entry System in Accounting; n)\tAccounting Equation; o)\tGolden Rules of Accounting;  Section 3: p)\tSource Documents; q)\tCash Memo; r)\tInvoice; s)\tReceipt; t)\tDebit Note; u)\tCredit Note; v)\tPay in Slip; w)\tCheque; x)\tVouchers;  Section 4: y)\tBooks of Original Entry; z)\tJournal and Format aa)\tSteps in Journalising; bb)\tJournal Illustrations; cc)\tCompound Journal Entry;  Section 5: dd)\tLedger; ee)\tUtility of Ledger; ff)\tFormat of Ledger; gg)\tPosting; hh)\tProcedure for Posting; ii)\tPosting of Compound Journal Entry; jj)\tPosting the Opening Entry; kk)\tBalancing an Account; ll)\tSignificance of Balancing; mm)\tBalancing of Different Accounts; nn)\tProcedure for Balancing;  Section 6 - covering Trial Balance and Final Accounts.  This course is structured in self paced learning style.  Video lectures are used for delivering the course content.  Take this course to create strong foundation in fundamentals of accountancy.", 
    "end_date": null, 
    "title": "Accounting Basics - A Complete Study", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494800_7c0f.jpg", 
    "course_url": "https://www.udemy.com/fundamentals-of-accounting-a-complete-study/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T06:12:26Z"
}