{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tWelcome to the course on Accounting Standards Basics .  </p>  <p style=\"\">  \tThis course is going to take you through the  </p>  <p style=\"\">  \t-concept,  </p>  <p style=\"\">  \t-objectives,  </p>  <p style=\"\">  \t-benefits,  </p>  <p style=\"\">  \t-limitations  </p>  <p style=\"\">  \tof Accounting Standards.  </p>  <p style=\"\">  \tSo why at all Accounting Standards are required?<br style=\"\">  \t<br style=\"\">  \tAccounting standards are necessary so that financial statements are meaningful across a wide variety of businesses; otherwise, the accounting rules of different companies would make comparative analysis almost impossible.<br style=\"\">  \t<br style=\"\">  \tAccounting Standards reduces the scope for creative accounting. The creative accounting refers to twisting of accounting policies to produce financial statements favourable to a particular interest group.  </p>  <p style=\"\">  \tAccounting Standards aim at improving the quality of financial reporting by promoting comparability, consistency and transparency, in the interests of users of financial statements.  </p>  <p style=\"\">  \tWith the emergence of trans-national corporations in search of money, not only for growth but also to sustain activities has necessitated raising of capital from all parts of the world. Hence, countries across the world are going towards single set of accounting standards in the interest of public. Global standards will facilitate cross border flow of money, global listing and comparability of financial statements.  </p>  <p style=\"\">  \tThis course may use technical terms related with accounting. Hence, the learner must have basic knowledge of accounting and financial statements.  </p>  <p style=\"\">  \tThis course is structured in self paced learning style.  </p>  <p style=\"\">  \tTake this course to understand the basics of accounting standards.  </p>", 
    "end_date": null, 
    "title": "Accounting Standards Basics (Professional Course Level)", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415802_08d2.jpg", 
    "course_url": "https://www.udemy.com/basics-of-accounting-standards/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T14:26:01Z"
}