{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><span><strong>Accounting II Simplified for You</strong> – is a continuation of a unique, no-nonsense and meaningful approach of understanding basic accounting principles, with special focus in </span><strong>merchandising, inventories, internal control, cash management, fixed assets, receivables, liabilities and payroll</strong>. <span>Business transactions are illustrated in simple terms using relevant examples and easy to follow step-by-step instructions. </span></p>    <p>  \t\t\t\t\t\t\t\t\t\t\t                    As the saying goes, “Accounting is the language of business.\" But you are NOT an accountant, so should you be left behind?  ABSOLUTELY NOT! You do not need be an accountant to learn accounting.  Give yourself the competitive edge of understanding accounting principles and concepts to better navigate the business environment.  \t\t\t\t\t\t\t\t\t\t</p>  \t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t                This is a perfect complement to my course Accounting 1 Simplified for You -where you learn the basic framework of accounting, the recording process, the accounting cycle and financial statement preparation. These 2 courses combined will provide you with the framework you need to fully understand and apply accounting in business for any type of industry.                   \t</p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t                In this class, you will have a <strong>series of thoughtfully prepared video lectures </strong>using real-life business examples, <strong>handouts comes with every lecture</strong> and <strong>quizzes </strong><strong>after each section</strong> to reinforce your learning. Dr. Jacinto promotes and encourages lively discussions and feedback sessions. All your questions directly related to the topic will be answered within 24 hours. This course is ideal for college business and accounting students, bookkeepers, business owners, managers and anyone who wants to better understand accounting in business in a way that makes sense to you. For <strong>work</strong> - this is an excellent go-to accounting course &amp; guide whenever you need a quick refresher; and for <strong>school </strong>- a perfect study  guide and supplement for students in accounting and business.  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Accounting 2 Simplified for You", 
    "price": "30.00", 
    "instructors": "Majo Jacinto", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354324_6c83_3.jpg", 
    "course_url": "https://www.udemy.com/accounting-2-simplified-for-you/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-23T08:07:00Z"
}