{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Learn advanced small business accounting, covering specific topics that every growing startup will face such as options, warrants, taxes, and more with seasoned startup CFO Chris Benjamin!</strong>  </p>  <p>  \tThis course goes into further detail, continuing on from my <a href=\"https://www.udemy.com/finance-and-accounting-for-startups/#/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Finance and Accounting For Startups</a> course.  We will focus on some general accounting topics that impact all companies, as well as specific topics of interest to growing companies.  </p>  <p>  \tIssues such as deferred revenue, inter company accounting, international transactions accounting, and foreign currency accounting are discussed.  While interrelated, these modules can be taken individually if there are specific issues you want to focus on.  </p>  <p>  \tAdditionally, we talk about accounting for partnerships, as well as how to treat options, warrants, and other forms of derivatives.  Included are examples, the pros and cons of various instruments, and how they will impact your finances.  </p>  <p>  \tThe last part of the course focuses on financial reporting for multiple entities by consolidating subsidiaries, how to handle intangible assets, and lastly how to determine the type of lease agreements and accounting for them.  </p>  <p>  \tThere is a downloadable item for each section, typically a checklist or example (for example, a sample partnership agreement).  There is also a quiz for each section.  </p>  <p>  \tThe video content for the course is approximately 5 hours.  Students should as well expect to spent approximately 2 hours completing quizzes, and an additional 2 hours reviewing the downloadable content.  </p>  <p>  \tIf you are a startup CEO or small business, don&#039;t be scared any longer of business accounting and finance.  Learn today how to manage your finances and grow your business!  </p>", 
    "end_date": null, 
    "title": "Advanced Finance and Accounting for Startups", 
    "price": "40.00", 
    "instructors": "Chris Benjamin", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42146_16bb_7.jpg", 
    "course_url": "https://www.udemy.com/advanced-finance-and-accounting-for-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T01:09:31Z"
}