{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>We have added more practice exercises for your learning. If you have any queries regarding the same, feel free to post on discussion board or email us.</strong></em><br></p><p><strong>What is this course about?</strong></p><p><strong></strong>This course is about learning advanced excel functions to help analyze large data. This course teaches you how you can make flexible financial models, derive insights from large data set and summarize information from large data.</p><p><strong>How is the course taught?</strong><br></p><p>As with all our courses, we have followed an illustration based approach to teach these advanced excel functions. There are examples from practical situations that we leverage to teach all the advanced excel functions. We strongly recommend that you carry out the practical exercises along with the instructor so that we can have the same setup. </p><p><strong>Why take this course?</strong><br></p><p>This course is going to be very useful to you if you are financial analyst, job seeker in financial modeling roles or college students. This course has one of the richest content in helping somebody learn about advanced excel functions. We are confident if you sign up for the course, you can learn something very practical on how to apply advanced excel functions.</p><p><strong>What functions are we going to learn?</strong><br></p><p>We are going to learn about the following functions-</p><p>1) List</p><p>2) Offset</p><p>3) Sumproduct</p><p>4) Goal-seek</p><p>5) Index Match (3 dimensional data)</p><p>6) Pivot tables</p><p>7) Indirect </p><p>All functions are taught with some examples</p><p><strong>How long will the course take?</strong><br></p><p>The course is around an hour long but if you practice the exercises, it make take you around 3 hours to completely learn the entire course.</p>", 
    "end_date": null, 
    "title": "Advanced Excel functions to analyze large data", 
    "price": "20.00", 
    "instructors": "Skillfin Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722682_2679_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-excel-functions-to-analyze-large-data/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T11:18:25Z"
}