{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Updated Monday, May 23, 2016, 10:41 A.M.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How's this for Stellar Profits?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>6.24% one day profit of <strong class=\"redactor-inline-converted\">$9,760.05 </strong>on FB calls [9-2-2014]</li><li>2.75% one day profit of <strong class=\"redactor-inline-converted\">$3,430.87</strong> on FB calls [10-21-2014]</li><li>9.39% one day profit of <strong class=\"redactor-inline-converted\">$8,054.73</strong> on FB calls [12-18-2014]</li><li>26.67% one day profit of <strong class=\"redactor-inline-converted\">$21,607.50 </strong>on AAPL calls [1-28-2015]</li><li>16.49% one day profit of <strong class=\"redactor-inline-converted\">$16,390.50</strong> on AAPL calls [1-29-2015]</li><li>6.47% one day profit of <strong class=\"redactor-inline-converted\">$7,740.00</strong> on APPL calls [2-10-2015]</li><li>6.25% one day profit of <strong class=\"redactor-inline-converted\">$15,688.10</strong> on APPL calls [2-23-2015]</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">They add up.</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Had you been one of the lucky few who followed <strong class=\"redactor-inline-converted\">Dr. Brown</strong> in 2013 and 2014 you would have watched him extract a 60 and 66% return — <em>not on one lucky trade</em> — on account. These are the returns in his single stock <strong class=\"redactor-inline-converted\">option portfolio</strong>. Read on to find out how you may reap these kind of gains this year with this best kept secret from the academic <strong class=\"redactor-inline-converted\">genius </strong>side of Wall Street. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course you will be introduced to the <strong class=\"redactor-inline-converted\">one perfect option strategy</strong>.  The buzz is palpable ...</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">[Student email on 1st of October 2015]</strong> \"<em>On another note, I wanted to tell you how well presented I thought the options course you put on udemy is. I've liked all your productions but this one is probably the best, in my opinion. Very nicely articulated in a relaxed but poignant manner, great graphics that engage the viewers attention while absorbing the audio material, and providing a simple, usable and profitable method for option trading. The best part is you cut right through all the other crap that brokers and charlatans use as their mainstay for option services and slap them down with academic studies that disprove it all. Really, really nice job :) Cheers!</em>\"  <strong class=\"redactor-inline-converted\">-Mountain Man</strong> </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Dear fellow <strong class=\"redactor-inline-converted\">investor</strong>, </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is <strong class=\"redactor-inline-converted\">Scott</strong>. I am a successful academic <strong class=\"redactor-inline-converted\">expert </strong>in options with extensive actual experience as a professional trader for my own account. By successful I mean that I am able to make <strong class=\"redactor-inline-converted\">significant </strong>amounts of money for my family. I watch over our finances as a financial <strong class=\"redactor-inline-converted\">steward</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sometimes I am asked how I was able to become so <strong class=\"redactor-inline-converted\">successful </strong>in such a difficult game. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I became obsessed with finance from trading <strong class=\"redactor-inline-converted\">futures</strong>. This led me to obtain a Ph.D. in finance from the <strong class=\"redactor-inline-converted\">University of South Carolina</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This was no small <strong class=\"redactor-inline-converted\">feat</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The Ph.D. in <strong class=\"redactor-inline-converted\">finance </strong>at the University of South Carolina accepts just two students every two years from large application pools. The two applicants who win admission have tuition waived for <strong class=\"redactor-inline-converted\">free</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Competition </strong>is fierce because we live on pensions during the 5 years it takes to earn a doctoral degree in financial economics. Nobody with a finance Ph.D. from an <strong class=\"redactor-inline-converted\">AACSB </strong>business school owes student loans.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The <strong class=\"redactor-inline-converted\">American Assembly of Collegiate Schools of Business (AACSB) </strong>provides internationally recognized, specialized accreditation for business and accounting programs at the bachelor's, master's, and doctoral level. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Senator Elizabeth Warren</strong> shows that a university professor with a highly quantitative Ph.D. such as finance almost never endures bankruptcy because of this.  It also helps that we <strong class=\"redactor-inline-converted\">command </strong>high pay.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">But If You Thought Medical School Was Tough ...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>For this reason about a <strong class=\"redactor-inline-converted\">hundred </strong>new doctorates in finance become new professors each year at the worlds best business schools.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Another <strong class=\"redactor-inline-converted\">reason </strong>we make more is that we are such hard workers in finance.  This is one of the last old world style <strong class=\"redactor-inline-converted\">apprentice </strong>systems.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>We work 365 days per year as research assistance to the brightest financial academics in the world.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The finance faculty from whom we strive to earn a <strong class=\"redactor-inline-converted\">doctorate </strong>in finance owns us. After years of grinding through tomes of mathematical <strong class=\"redactor-inline-converted\">derivations </strong>half of us become finance professors with medical school faculty sized <strong class=\"redactor-inline-converted\">salaries</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That's because the other half pumps up our market price by starting on <strong class=\"redactor-inline-converted\">Wall Street </strong>at $350K per year or more. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One of us in my <strong class=\"redactor-inline-converted\">class </strong>did just that. The last family photo we saw was that of his wife draped over the <strong class=\"redactor-inline-converted\">Maserati </strong>in front of their mansion in the Hamptons. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>When I caught up to him this <strong class=\"redactor-inline-converted\">summer </strong>he corrected me. It was not the Maserati, they has <strong class=\"redactor-inline-converted\">sold </strong>that the year before. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>She was draped over the new <strong class=\"redactor-inline-converted\">Lamborghini</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I chuckle when a <strong class=\"redactor-inline-converted\">Wolf of Wall Street </strong>misleads individual retail investors into believing that we teach because we can't trade. The reality could not be further from the truth. Go back and peruse my personal <strong class=\"redactor-inline-converted\">results </strong>I have posted above. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>These results have been audited by <strong class=\"redactor-inline-converted\">TD Ameritrade</strong> and <strong class=\"redactor-inline-converted\">OptionsXpress</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">HEADS UP!</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Stop reading investment newsletter <strong class=\"redactor-inline-converted\">recommendations </strong>written by drunks, con artists and imbeciles.  Learn to find your option trades on your <strong class=\"redactor-inline-converted\">own</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Sidestep these bad option trading strategies that will bleed your account dry faster than a <strong class=\"redactor-inline-converted\">one armed bandit</strong> on the Las Vegas strip. <strong class=\"redactor-inline-converted\">Losing </strong>stock option strategies are routinely touted by marketing cheats, scoundrels and incompetents operating major investment newsletters. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And it's official that I am at the top of the <strong class=\"redactor-inline-converted\">Wolves of Wall Street enemy list</strong>. My shocking revelations of Wall Street's investment newsletters have boosted me right up to<strong class=\"redactor-inline-converted\"> numero uno</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Now, <strong class=\"redactor-inline-converted\">making #1 </strong>on this list is not such an easy feat. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>After all, professor <strong class=\"redactor-inline-converted\">Bill Christie</strong> of Vanderbilt university stirred up quite a list of “enemy\" brokers, directors, presidents and the CEO.  Dr. Christie's research revealed that the <strong class=\"redactor-inline-converted\">NASDAQ </strong>was ripping off millions of retail investors with illegally excessive transaction costs in the form of an artificially wide bid ask spread. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So how did I — another simple finance <strong class=\"redactor-inline-converted\">professor </strong>from a major state university — make it to the top? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Maybe it was my exposé on the investment newsletter industry that was featured in the <strong class=\"redactor-inline-converted\">Certified Financial Analysis CFA Digest</strong>. This research was published at the top of financial academia in the prestigious academic journal <strong class=\"redactor-inline-converted\">Financial Management</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Brown, Cao and Powers (2013) <em>Do Investment Newsletters Move markets. </em><strong class=\"redactor-inline-converted\">Financial Management 42(2). </strong>315-338.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This crucial study showed that widely subscribed investment newsletters in the <strong class=\"redactor-inline-converted\">Mark Hulbert Financial Digest</strong> offer nothing but loss and emotional pain to their subscribers — despite routine claims of return percentages in the hundreds.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Study This or Go Broke! </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It could be for this reason — or a dozen other <strong class=\"redactor-inline-converted\">revelations </strong>like them. The kind I <strong class=\"redactor-inline-converted\">publish </strong>every month in this course's bulletin, “<em>Strategic Option Intelligence</em>.\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In <strong class=\"redactor-inline-converted\">fact</strong>, I've been called the “<em>most fearless financial academic in the world today</em>.\" </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But you won't read my writing in any <strong class=\"redactor-inline-converted\">mainstream </strong>financial press. They don't have the — well, let's just say the <strong class=\"redactor-inline-converted\">guts </strong>— to publish my insights and findings. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In short, I will bring you the <strong class=\"redactor-inline-converted\">financial stories</strong> that no one else will touch. These are stories that will shape your financial <strong class=\"redactor-inline-converted\">world </strong>of tomorrow. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I will go <strong class=\"redactor-inline-converted\">anywhere </strong>and do anything to get the truth. And I will <strong class=\"redactor-inline-converted\">tell </strong>it to you, no matter who objects. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My <strong class=\"redactor-inline-converted\">fearless </strong>style has made me a lot of enemies — some of them in the highest places in the Wolves of Wall Street pack. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That is why the <strong class=\"redactor-inline-converted\">CFA Digest</strong> did a cover piece on my research. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This most <strong class=\"redactor-inline-converted\">prestigious </strong>paragon of proper financial conduct felt that getting the word out about my research was of paramount importance to you. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here Is the Student Response ...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>Dr. Scott Brown is one of the sharpest guys I know. Highly recommended.</em>\"  — <strong class=\"redactor-inline-converted\">Alex Green</strong>, New York Times Best Selling author of the “Gone Fishing Portfolio\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>“<em>Most newsletters and trainers want you just trust them that they will make you money. But Dr. Brown is a unique combination of academic prowess and street smarts skill. He is the man to take you from a mere patriot of others to a knowledgeable trader. If you want to add discernment to your tool box and make money in the process, you must learn from the Doctor</em>.\" — <strong class=\"redactor-inline-converted\">Joe Martinson</strong>, Los Angeles, California, USA</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>Keep doing what you're doing. What you are teaching is 100% correct. Marketing is a tough business, especially with the plethora of BS out there on how easy it is to make money trading... Keep it real and grounded in facts and you should attract long term clients who will enhance your service. I really appreciate your efforts in sharing.</em>\" <strong class=\"redactor-inline-converted\">–F.M.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>Dear Doc Brown, I am writing this email to express my heartfelt gratitude for this course you have put up. I have completed the course and the reading part, and it has brought a lot of light and richness to my perception of viewing markets. I shall come back to you to share with you how well did I fare. That would be another story, another time. </em><em>As of now, only wanted to tell you that just viewing your lectures has brought me lot of joy in itself. Thank you very much... May the creator bless you with abundance of love, laughter and happiness!</em>\" Sincerely, <strong class=\"redactor-inline-converted\">— </strong><strong class=\"redactor-inline-converted\">Rajkumar Mehta</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>Yep, got it now. Thanks Scott. By the way, the DITM Call strategy seems to be working very well for me...started about two months ago with two positions and both are working well...thanks for that too!</em>\"  <strong class=\"redactor-inline-converted\">— </strong><strong class=\"redactor-inline-converted\">Bob Crandalls.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>My brain is mush right now (I wish I could say it was from beer). IMy brain is mush because I've just went through </em><em><strong class=\"redactor-inline-converted\">280</strong> charts in about 30 minutes. WOW! I am as happy as a fat hog in slop. Was this your brainchild? What a great idea. Not only does it really cut through the burden of time and effort, but it seems to instill confidence in me, knowing I have a great place to start and drill down on these great possibilities that present themselves, and if I just follow along my criteria that you have instilled in me, we should be sailing together on a world cruise in a few years.  </em><em>I'm very happy to have found you,</em>\" <strong class=\"redactor-inline-converted\">— </strong><strong class=\"redactor-inline-converted\">T. Swan</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"<em>There are very few people I trust enough to take their blanket recommendations....that is why this is so helpful..... learning to cherry pick the best trades and to run trailing stops or </em><em>hedge using appropriate shorts .......</em>\" <strong class=\"redactor-inline-converted\">— </strong><strong class=\"redactor-inline-converted\">RR, California (Retired Radiologist)</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Doc Brown Delivers Stories Others Are Afraid to Touch</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you look at my research you can see why the Wolves of Wall Street would like to <strong class=\"redactor-inline-converted\">silence </strong>me. My work shows that every penny spent on investment newsletter advice is money flushed down the <strong class=\"redactor-inline-converted\">toilet</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That is because those who can make <strong class=\"redactor-inline-converted\">money </strong>in the market won't bother with the technical problems of running an investment newsletter. Newsletter <strong class=\"redactor-inline-converted\">editors </strong>who make enough writing an investment newsletter do so because they can't make money in the market. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And that is just what the <strong class=\"redactor-inline-converted\">newsletters </strong>are trying to get you to do what they say when they write “<em>buy this</em>\" or “<em>sell that</em>.\" Here is an actual <strong class=\"redactor-inline-converted\">line </strong>that just hit my mailbox, </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>“<em>The true story of how this trader turned $2,000 into $10 million from his kitchen table, in 9 months</em>.\" Don't for a moment believe this <strong class=\"redactor-inline-converted\">lie</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p> If these <strong class=\"redactor-inline-converted\">marketers </strong>can get you to take action in your trading account they know one thing for certain. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It will be a <strong class=\"redactor-inline-converted\">snap </strong>to get you to buy their next dud of an expensive annual fee investment newsletter, $5,000 course or $20,000 boot camp — glossed up with fancy promises and fancy sales copy writing. These marketers make their money selling shiny ideas <strong class=\"redactor-inline-converted\">without </strong>regard to the true returns underlying each strategy. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The underlying economics of the newsletter industry I reveal to you is quite <strong class=\"redactor-inline-converted\">bizarre</strong>. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Investment newsletter subscribers <strong class=\"redactor-inline-converted\">lose </strong>millions every year investing in bad ideas. Investment newsletter publishers make <strong class=\"redactor-inline-converted\">millions </strong>in annual subscription fees. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But now I have uncovered the <strong class=\"redactor-inline-converted\">ultimate </strong>lie from the Wolves of Wall Street. This investment fib truly pukes up losses of <strong class=\"redactor-inline-converted\">scandalous</strong> proportions. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Which Option Strategies Are Tailor Made For Those Born to Lose?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you have ever been interested in options there are a few strategies you must immediately become aware of to avoid like the <strong class=\"redactor-inline-converted\">plague</strong>. These fundamental options trading techniques are guaranteed to <strong class=\"redactor-inline-converted\">lose </strong>straight out of the barrel. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And they form the basis for <strong class=\"redactor-inline-converted\">compound </strong>option trading strategies that expose investors to very big losses. Why are these strategies so <strong class=\"redactor-inline-converted\">popular </strong>among brokers as well as newsletter editors? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Compound option strategies don't just cause complex <strong class=\"redactor-inline-converted\">losses </strong>they also kick out vastly larger brokerage fees. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But the true returns to investors of these <strong class=\"redactor-inline-converted\">strategies </strong>have been so hard to calculate that it was impossible to “<em>prove</em>\" the danger to investor accounts. So it was easy for investment newsletter marketers to falsely claim that these <strong class=\"redactor-inline-converted\">horrific </strong>options trading strategies actually made money. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Until <strong class=\"redactor-inline-converted\">now</strong>! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>A seminal option trading article came out last year in the #1 ranked <strong class=\"redactor-inline-converted\">Journal of Finance</strong>.  This probing study proves that most <strong class=\"redactor-inline-converted\">strategies </strong>touted by the financial media are a sure ticket to the poor house. And the Wolves of Wall Street are biting their nails in hopes that you never learn the <strong class=\"redactor-inline-converted\">truth </strong>that emerges from this article. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Watch Advanced Training 2 — Stock Options as Lotteries</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The research is so full of “<strong class=\"redactor-inline-converted\">rocket science</strong>\" <strong class=\"redactor-inline-converted\">math </strong>that the true meaning has never been revealed to the public — until now by me to you. This cutting edge <strong class=\"redactor-inline-converted\">research </strong>proves beyond a shadow of a doubt that only one of these options strategies is a winner.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Buying </strong>index and ETF options.</li><li><strong class=\"redactor-inline-converted\">Selling </strong>Index and ETF options.</li><li><strong class=\"redactor-inline-converted\">Covered Calls</strong></li><li><strong class=\"redactor-inline-converted\">Put Selling</strong></li><li>Short Expiration <strong class=\"redactor-inline-converted\">Call</strong></li><li>Short Expiration <strong class=\"redactor-inline-converted\">Put</strong></li><li><strong class=\"redactor-inline-converted\">Protective Put</strong></li><li><strong class=\"redactor-inline-converted\">Bull Spread</strong></li><li><strong class=\"redactor-inline-converted\">Bear Spread</strong></li><li><strong class=\"redactor-inline-converted\">Iron Condor </strong>Spread</li><li><strong class=\"redactor-inline-converted\">Butterfly </strong>Spread</li><li>Deep in the Money Far Expiration <strong class=\"redactor-inline-converted\">Call</strong></li><li><strong class=\"redactor-inline-converted\">Straddle</strong></li><li><strong class=\"redactor-inline-converted\">Strangle</strong></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>isn't that <strong class=\"redactor-inline-converted\">crazy</strong>? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Only one of the <strong class=\"redactor-inline-converted\">strategies </strong>above is a winner?! Can you guess <strong class=\"redactor-inline-converted\">which</strong>? </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Most option strategies c are outright <strong class=\"redactor-inline-converted\">disastrous </strong>or produce mediocre returns to the investors who try them.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>One <strong class=\"redactor-inline-converted\">strategy </strong>alone on the list above actually stands to make investors big money. Do you want to know <strong class=\"redactor-inline-converted\">which</strong>?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It truly is the <strong class=\"redactor-inline-converted\">one perfect option strategy</strong>. Enroll <strong class=\"redactor-inline-converted\">now </strong>and here is what you get…</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course <strong class=\"redactor-inline-converted\">teaches </strong>you how to trade the one — perfect — option strategy. I take you by the hand and <strong class=\"redactor-inline-converted\">mentor </strong>you through each step of my unique ultra-high beta controlled leverage long term investment process. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Introduction 1 — The Option Mechanics Toolbox Every Savvy Stock Investor Must Master</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Benefits </strong>to you …</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Laser impress <strong class=\"redactor-inline-converted\">permanently </strong>into your mind the precise mechanics of exercise and strike.</li><li>See why <strong class=\"redactor-inline-converted\">index </strong>options can be very different beasts from plain vanilla stock options.</li><li>Marvel at the modern American invention of the <strong class=\"redactor-inline-converted\">derivative</strong>.</li><li>How options derive their value from underlying <strong class=\"redactor-inline-converted\">investments</strong>.</li><li>Watch as I <strong class=\"redactor-inline-converted\">reveal </strong>to you how the option price is derived from the underlying.</li><li>Grasp the power of extrinsic time value above and beyond <strong class=\"redactor-inline-converted\">intrinsic </strong>option premium price.</li><li>Develop a strong sense of <strong class=\"redactor-inline-converted\">moneyness</strong>.</li><li>Utilize payoff diagrams for serious real money <strong class=\"redactor-inline-converted\">campaigns</strong>.</li><li>See how a covered call is the same as a bank deposit, a call and a <strong class=\"redactor-inline-converted\">short </strong>stock.</li><li>Employ a time decay chart to clearly see your best option bets for maximal <strong class=\"redactor-inline-converted\">probable </strong>profits.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Introduction 2 — Basic Option Pricing with Binomial Outcome Trees for Valuation!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>More <strong class=\"redactor-inline-converted\">benefits </strong>to you …</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Model option value on <strong class=\"redactor-inline-converted\">expiration </strong>date.</li><li>Calculate the hedge ratio also known as <strong class=\"redactor-inline-converted\">delta</strong>.</li><li>See how option premium changes for each unit rise of <strong class=\"redactor-inline-converted\">underlying </strong>stock.</li><li>Grasp how options trade in a parallel yet <strong class=\"redactor-inline-converted\">connected </strong>universe with equity markets.</li><li>See risk neutrality as a special case of certainty <strong class=\"redactor-inline-converted\">equivalence</strong>.</li><li>Marvel at how call option <strong class=\"redactor-inline-converted\">payoff </strong>is zero in the binomial down state.</li><li>Reintroduce yourself to <strong class=\"redactor-inline-converted\">Euler's </strong>number from high school math.</li><li>Create a pyramidal <strong class=\"redactor-inline-converted\">matrix </strong>of possible share prices.</li><li>Use the risk free rate of <strong class=\"redactor-inline-converted\">return </strong>to model forward up and down share price movements.</li><li>Plug <strong class=\"redactor-inline-converted\">probabilities </strong>of a rise or fall into the binomial model. </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Introduction 3 — Black Scholes Option Pricing Theory and the Real World Impacts!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Even <strong class=\"redactor-inline-converted\">more </strong>benefits …<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Recognize the five key variables Fischer Black and Myron Scholes used to model option pricing.</li><li>Utilize the knowledge of how fluctuations of the underlying stock influence the price of puts and calls.</li><li>Know when underlying volatility is pumping up option values.</li><li>Wonder at how increasing interest rates actually increases call values but hammer put prices.</li><li>Employ the VXN to compare the implied volatility of the NASDAQ to that of any other stock market index.</li><li>Grasp the value of a call as the share price less a bank loan.</li><li>Blaze into your mind via a time decay chart the reality that the farther out in expiration an option is the more valuable it becomes.</li><li>Derive year fractional expiration as days remaining divided by 365.</li><li>Value any call as delta times the underlying share price less a bank loan.</li><li>Repulse at how warrants gifted to fat cats dilute your ownership share in private placement investments. </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Introduction 4 — Real Options Offer Insights Into Your Real Estate Investments!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Yet <strong class=\"redactor-inline-converted\">still </strong>more benefits …<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Analyze the choice of two real estate option projects under high and low demand.</li><li>Consider the real option case of oil tankers that can be mothballed when unprofitable.</li><li>Reflect on the combination-turbine electricity market from a real options perspective.</li><li>Ponder how large aircraft assembly firms streamline sales with real options.</li><li>Peruse a graph that proves that the NPV of a real option decision to purchase an expensive asset is about zero with long time to delivery.</li><li>Why real options are rarely available in practice.</li><li>See how real options apply to pharmaceutical share pricing as firms move through consecutive FDA approval trails.</li><li>Examine how real options can change underlying pricing conditions.</li><li>Build your understanding of how real estate options can help you.</li><li>Strengthen your economic intuition with knowledge of real options.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Enjoy the Advantage of Superior Information</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And this is just a <strong class=\"redactor-inline-converted\">smattering </strong>of the total benefits of this program. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you <strong class=\"redactor-inline-converted\">enroll </strong>right now you get the best option training on the web today. To get the same quality of options trading training anywhere else would cost you <strong class=\"redactor-inline-converted\">$185,052</strong> in elite MBA mentoring at a school such as <strong class=\"redactor-inline-converted\">New York University Stern</strong> or <strong class=\"redactor-inline-converted\">Harvard</strong> Schools of Business.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>To enroll now mash that rectangular blue <strong class=\"redactor-inline-converted\">button</strong> to the right up there. It has these words “<em>Take This Course.</em>\" </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Invest some of your <strong class=\"redactor-inline-converted\">PayPal </strong>electronic pocket change towards a brighter financial future!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">-Scott</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Dr. Scott Brown, </strong><em>Associate Professor of Finance of the AACSB Accredited Graduate School of Business of the University of Puerto Rico</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">P.S. </strong><em>This is a risk free offer. Udemy extends to </em><em>you a 30 day money back guarantee.</em></p>", 
    "end_date": null, 
    "title": "Advanced Stock Options — for Graduate Level Equity Investors", 
    "price": "25.00", 
    "instructors": "Dr. Scott Brown", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530768_7403_3.jpg", 
    "course_url": "https://www.udemy.com/bullet-proof-options-controlled-leverage-investing-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T23:18:15Z"
}