{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to this course Advanced Accounting A Complete Study for CA / CMA / CFA / CS Students. As the name says, this course is structured keeping in mind academic curriculum of Advanced Accounting Paper meant for CA IPCC / CMA Inter / CS / CFA Students. </p><p>In this course, you will learn advanced Accounting topics like</p><p>a) Branch Accounts </p>\n\n<p>b) Departmental Accounts <br></p>\n\n<p>c) Accounting for Royalties</p>\n\n<p>d) Accounting for Hire Purchase Transactions</p>\n\n<p>e) Self Balancing Ledgers</p>\n\n<p>f) Sectional Balancing Ledgers</p>\n\n<p>g) Accounting for Service Sectors, Project Accounting, etc.</p>\n\n<p>h) Accounting for Service Sectors like Software, ITES, Telecommunication, Entertainment, Hospital, Educational Institutions.</p>\n\n<p>i) Accounting for Special Transactions - Bill of Exchange</p>\n\n<p>j) Accounting for Special Transactions - Consignment</p>\n\n<p>k) Accounting for Special Transactions - Joint Venture</p>\n\n<p>l) Accounting for Special Transactions - Sale of goods on Approval or Return Basis</p>\n\n<p>m) Accounting for Special Transactions - Account Current</p>\n\n<p>n) Accounting for Special Transactions - Investment Accounts</p>\n\n<p>o) Accounting for Special Transactions - Insurance Claim (Loss of Stock and Loss of Profit)</p>\n\n<p>p) Accounting for Banking, Electricity and Insurance Companies.</p>\n\n<p><strong>Please Note</strong>: Of the above topics, videos lectures have been so far added for Branch Accounts and Departmental Accounts. (Status as on 16th June 2016). Video lectures for the remaining topics will be added before before 31st July 2016. This long duration required in view of wide coverage of topics.</p><p>This course is structured in self paced learning style. Theoretical back ground for each and every topic will be explained followed by numerous case studies and most of them will be past examination tested problems.<br></p>\n\n<p>Take this course and gain complete understanding of Advanced Concepts in Accounting and prepare confident-ally for Professional Course Examinations.</p>", 
    "end_date": null, 
    "title": "Advanced Accounting A Complete Study for CA / CMA / CFA / CS", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "14 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/866584_d8fc_2.jpg", 
    "course_url": "https://www.udemy.com/branch-accounts-a-complete-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-02T07:15:08Z"
}