{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><em>Trading, FOREX, Stocks, Algorithmic Trading, Automated Trading, Quantitative Finance, Computational Finance - all that areas of knowledge are relevant for this course.</em></em></p>\n\n<p><em>LAST UPDATE</em>: 31 May 2016</p>\n\n<p><strong>Join 1400+ delighted Students On This Amazing Algorithmic Trading Course</strong></p><p><strong></strong></p>\n\n<p><strong>****</strong></p>\n\n<p><strong></strong><strong>In the last chapter, we will show you a special method, which allows you to take <em>typical trading strategy</em> and convert it into <em>new one</em>, which will bring you $1'461'350 from $10'000 in 4 years!</strong></p>\n\n<p><strong>****</strong></p>\n\n<p>This course will show you how to create, test and analyze <em>algorithmic trading strategies on financial markets (forex, stocks etc.)</em> in MATLAB by using the WFAToolbox application, which can make development process comfortable and interesting, as well as provides reliable results, reducing the whole process from weeks or months to couple of minutes.</p>\n\n<p>This course is intended for those, who know MATLAB language basics and has some experience in financial trading on financial markets (forex, stocks etc.), but even if you are not familiar with MATLAB, our course includes all the links for necessary resources, which will allow you to understand everything as soon as possible.</p>\n\n<p>By the end of this course you will be able to load free data from Google Finance directly into MATLAB, describe rules of your <strong>trading strategy on financial markets (forex, stocks etc.) in MATLAB</strong> language, perform visual walk-forward analysis by using parallelization of processes and genetic algorithms, as well as perform detailed analysis of your tests. </p>\n\n<p>In the final part we will tell and show you special method, which allows you to take typical <em>trading strategy on financial markets (forex, stocks etc.)</em> and convert it into new one, which will bring you $1'461'350 from $10'000 in 4 years! There's no magic or secret in this method, it uses pure math.</p>\n\n<p><strong>Main features and duration of the course</strong></p>\n\n<p>This course is a little bit untraditional for Udemy, because it was made by a group of people and work took more than 1,5 months. In our modern world time converts into a really expensive asset, that's why we become really surprised when we see that some authors are proudly telling us that their course takes 7 or even 15 hours - where can one find time to watch it? Therefore, we made great and hard job to be sure that you will understand all the information during 30 minutes, as well as learn all the specific methods and instruments, which are described in the name of the course. We tried to make everything maximally capacious, informative and to the point. Can you remember episode from The Matrix movie, where Neo was connected to one cable to know Kung Fu in couple of seconds? We tried to make it possible for you to understand the WFAToolbox with the same speed... or almost the same ☺</p>\n\n<p><strong>The story about hedge funds making billions of dollars each year using MATLAB (and the way for you to \"steal their technologies\")</strong></p>\n\n<p>Do you know which technology is used by hedge fund departments of J.P. Morgan or Deutsche Bank in order to create their <strong>highly effective algorithmic strategies</strong>? Yes, sometimes developers write everything from the scratch, but in most majority of cases they use MATLAB system! Because it speeds up development process of trading systems on financial markets (forex, stocks etc.), and visual analysis can be performed even by student. The most important that it has all necessary things for advanced <strong>quantitative finance</strong> analysis and <strong>financial engineering</strong>: digital signal processing (nonlinear adaptive filters, kalman filters), neural networks, support vector machines, genetic algorithms and many other and most modern. In our modern world, someone can be considered as indecent person if he or she publishes article about new method of data analyzing or time series prediction without attachment of such code in MATLAB language!</p>\n\n<p>Until very recently, MATLAB was available only for highly paid professionals from investment banks and hedge funds, because price of basic version was equal to $4400, but recently MathWorks company offers Home-license for personal use just for $135 – great fact that such version has full functionality and allows you to use all the features of MATLAB. During studying you can install free Trial version and avoid payment until you are sure that you need this product. </p>\n\n<p>Availability of MATLAB gave new and unprecedented opportunities for <em>private investors</em> and <em>traders</em>, which are interested in creation of <strong>highly profitable algorithmic trading strategies on financial markets (forex, stocks etc.)</strong>. But we have to mention that <em>institutional investors</em> usually use not one single person, but whole team to create their strategies even in MATLAB, because some processes have to be integrated into one existing structure (e.g. bank structure), therefore some of required processes have never existed or require connection to expensive services.</p>\n\n<p>But these days we finally have the <strong>WFAToolbox</strong>. This application (in fact it's add-on) that works under MATLAB, which allows to carry out all necessary processes to <em>create, test and analyze trading strategies on financial markets (forex, stocks etc.)</em> in MATLAB, providing maximum comfort and speed and using modern optimization and data visualization systems without any affection on limitless opportunities of data analysis systems usage, prediction and so on, which are the part of MATLAB itself.</p>", 
    "end_date": null, 
    "title": "Algorithmic Trading with MATLAB in 2 days (Forex & Stocks)", 
    "price": "20.00", 
    "instructors": "WFAToolbox Team", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517938_c68d_7.jpg", 
    "course_url": "https://www.udemy.com/algorithmic-trading-with-matlab-wfatoolbox/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T10:46:04Z"
}