{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em>Latest News: Course Updated Again in <strong>July</strong><strong> 2015 (MT4 Build 840+)</strong></em></p>    <p>Learn to program in MQL4 and develop, test, and optimize your own algorithmic trading systems. This course assumes no prior programming or Forex knowledge, just a desire to learn and be successful</p>  <p>  \t                           In the <strong>first section</strong> of this course we will install MetaTrader 4, open a free demo account, and learn the essential theory behind algorithmic trading.  </p>  <p>  \t                           The <strong>second section </strong>focuses on fundamentals of programming. Even if you have never programmed before, this part of the course will quickly bring you up to speed. Moreover, MQL4 is a C-based programming language and everything you learn in this section will also be applicable in languages like C / C++ / C# / Java / etc.  </p>  <p>  \t<strong>Section three </strong>introduces trading system design and gradually blends it with the programming knowledge you developed in section two. Here you will learn how to open your first order through a program also created by you, and how to then work with that order to modify or close it at your discretion.  </p>  <p>  \t                           Finally, everything is put together in the <strong>fourth section</strong> of the course, where we will come up with a unique trading strategy idea and turn it into a holistic Algorithmic Trading system. Also, I will briefly show you how to test and optimize your Forex Robot in the MetaTrader 4 strategy tester.</p><p>Enrol today and kick-start your Algorithmic Trading journey!</p><p>I'll see you inside</p>", 
    "end_date": null, 
    "title": "Algorithmic Trading In Forex: Create Your First Forex Robot!", 
    "price": "20.00", 
    "instructors": "Kirill Eremenko", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258232_52db_5.jpg", 
    "course_url": "https://www.udemy.com/learn-mql4/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-09T08:44:08Z"
}