{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Updated in June'16! Learn how to make 95% of profit in just 14 months!</strong></p>\n\n<p>Learn how to choose <strong>automated trading strategies</strong> and force them to earn money for you!</p>\n\n<p>In this course I will show you <strong>several platforms</strong> where you can find a variety of <strong>trading robots</strong>. But, more importantly, I will give you a list of <strong>criteria</strong> to choose perfect strategies and teach you how to select them <strong>in practice</strong>.</p>\n\n<p>I will explain what to take into account when you have to choose between two similar strategies. You will also get a <strong>basic knowledge</strong> of trading algorithms, their <strong>advantages</strong> as compared to manual trading, which <strong>markets</strong> it's better to trade using automated trading strategies.</p>\n\n<p>I believe by the end of this course you will be able to build your own <strong>portfolio</strong> and make <strong>profits</strong>.</p>\n\n<p>Take this course now and learn from my 12+ years of experience.</p>\n\n<p>This course is for beginners as well as for <strong>advanced traders</strong> and <strong>algorithm developers</strong>! All you need is just your aspiration to learn!<br></p>\n\n<p>With this course you also get:</p>\n\n<ul><li><strong>unlimited lifetime access at no extra costs</strong></li><li>all future additional lectures, <strong>live trading examples</strong></li><li>never any questions asked <strong>full 30 day money-back-in-full guarantee</strong></li></ul>\n\n<p>Do not hesitate to ask me any questions concerning this course or trading financial markets!<br></p><p>Viktor</p>", 
    "end_date": null, 
    "title": "Algorithmic futures trading - Investing with no experience", 
    "price": "25.00", 
    "instructors": "Viktor Neustroev", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594936_672c.jpg", 
    "course_url": "https://www.udemy.com/algorithmic-futures-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T12:40:58Z"
}