{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>How to do you create 100's of Algorithmic Trading Strategies really fast without </strong><strong>programming?</strong></p>\n\n<p>The course is designed to teach anyone interested in Trading on how to create trading strategies really fast without programming for live trading in the markets. You won't have to worry about strategy creation anymore!!</p>\n\n<p>I will walk you through on how you can create a \"strategy factory\" in your room that's constantly finding strategies for you, even when you sleep. <br></p>\n\n<p>And the best thing about it is that its all automated. </p>\n\n<p>I wont even need to explain to you how Automated Trading Systems work too much, so you can actually concentrate on other more important tasks in trading system development. </p>\n\n<p>Learn the easiest and best way to create strategies fast and get started in one of the world biggest and liquid markets, Forex or Stocks. This course will walk you through the best practices of ATS creation. No programming or coding knowledge required.</p>\n\n\n\n<p>In this course, I will show you how you can take advantage of the latest technologies out there so you can create automated trading strategies really fast and eventually build your own income stream. </p>\n\n<p>You will learn how to create many different types of strategies and find the ones that suit your needs the most.</p>\n\n<p><u><em>Join this course right now and learn from my long experience so that you can avoid wasting time on a strategy programming  - a very time consuming area</em></u></p>\n\n<p><u><em></em></u><strong>Enroll</strong><strong> Right Now to Automate Your Trading! I ll see you on the other-side!</strong></p>\n\n\n\n<ul><li>Unlimited Lifetime Access</li><li>Future extra lectures and updates given away for free!</li><li>All my work is guaranteed, 30 day money back guarantee, if you don’t think its the best training you’ve ever had in this field then ask for your money back, no harm, no foul I am happy to give it back.</li></ul>", 
    "end_date": null, 
    "title": "Algo Trading Strategies: The Fastest Way To Create Them", 
    "price": "50.00", 
    "instructors": "Justin Barauskas, Rimantas Petrauskas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683464_c097.jpg", 
    "course_url": "https://www.udemy.com/algo-trading-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T17:59:43Z"
}