{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Trade Live In Webinar And Learn the professional concepts of Fibonacci tool that banks used to trade for a decade to be able to succeed in the Forex market.</p><p><strong style=\"\">Build a Strong foundation in Forex market with this tutorial for beginners and professionals.</strong></p><p>How to trade Fibonacci with 100% success rate</p><p>Mistakes to avoid that 95% make in trading Fibonacci tool</p><p>How Much you can grow your account in upcoming months</p><p>Secret banks know and retail traders does not know</p><p><strong style=\"\">A Powerful Trading Strategy at your fingertips</strong></p><p>Learning the technicals on how to trading the Fibonacci pattern like the banks and other big financial institutions to win every trade with having reasons for each single trade as it is a 4 trillion dollar business and in order to trade successfully in the Forex market a retail trader should need to be educated in terms of been on the right direction of the market. </p><p>This course is suitable for beginners and professionals as after watching the lecture you will be able to master the Fibonacci tool and make constant returns on monthly basis without losing money again from the Forex market .</p><p>As in this course you will learn how banks trade Fibonacci for over a decade to make profits constantly without losing and why retails traders do not keep control over there emotions.</p><p>Students completing the course will have professional knowledge on trading the Fibonacci like the banks way.</p><p>As after you complete the course i will always be there to assist you with anything you need to learn and understand so that our relation will not end after you purchase the course it will stay forever.  </p>", 
    "end_date": null, 
    "title": "All Time Winning Trading Pattern 2 Market Success", 
    "price": 0, 
    "instructors": "2smart 2trade", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532146_9c1e_7.jpg", 
    "course_url": "https://www.udemy.com/2smart2trade/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T13:22:34Z"
}