{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            The aim of this course is to stop you from having to watch your Forex trading screen for hours on end to identify trading opportunities. It shows you how to create MT4 alerts using email, sounds and notifications quickly and easily. These alerts will tell you when the price movement  has reached the levels you want to trade at.  </p>  <p>  \t          The ability is good for manual traders and EA traders who use price-level sensitive trading techniques  </p>  <p>  \t                            The course will give you your life back so that you can do other things while trading. It will also protect you valuable eyes from premature deterioration and make your family and friends much happier.  </p>  <p>  \t                            You can be setup in the next 30 minutes so don&#039;t delay.  </p>  <p>  \t                          Why is this an Introduction?  </p>  <p>  \t                          The standard MT4 platform only has the ability to do price-level alerts. This course only covers the ability to create price-level alerts to mobile devices or by sound..  </p>  <p>  \t                          In future courses we will cover more advanced alerts that cover indicator levels and non horizontal alert activation reasons such as a trend-line violations, indicator and EA based alerts etc.  </p>  <p>  \t                        When downloading the MT4 App on your mobile in order to receive notifications you will also create the ability to trade remotely using your mobile device. Please use your own broker website to see if they support mobile device Forex trading. Most do these days.  </p>", 
    "end_date": null, 
    "title": "An Introduction: MT4 Email, Sound, Notification Forex Alerts", 
    "price": "20.00", 
    "instructors": "Alex du Plooy", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323828_bf8b_2.jpg", 
    "course_url": "https://www.udemy.com/create-mt4-forex-email-sound-and-notification-alerts/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T06:07:35Z"
}