{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>An Integrated Approach to the Fundamentals of Accounting - a comprehensive MOOC for those that want to learn how to take accounts from source documents to Trial Balance</p><p><strong>Learn how to bring accounts from raw documents to the Trial balance</strong></p><p>Do you need to understand the fundamentals of Accounting and Bookkeeping? Are you considering a career in Bookkeeping or Accounting? <strong><em>THEN REGISTER NOW</em></strong></p><p><strong>Course Overview</strong></p><p>Section 1 of this course is an introduction section.</p><p> In section 2 we will introduce you to the role of a bookkeeper and accountant, key terms and key documents that you will come across through out this course.</p><p>In section 3 we will move into Sales. We will look at preparing invoices and credits, with and without trade and settlement discounts. We will look at a statements and we will discuss the role of the AR department. After this we will look at the prime books of entry, cross totting and transferring information from invoices and credits to the sales and sales returns day books. Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:</p><ul><li>Prepare sales invoices and credits with and without discounts and sales tax</li><li>Prepare customer statement</li><li>Enter sales transaction to the day books and then close the day books</li></ul><p>Section 4 of this course is about Purchases. We will look at the purchasing process and the documents involved and we will also look at checking purchase invoices for approval. After we have checked the invoices and credits we will also spend some time coding invoices for different analysis. We will then transfer the data from the purchase transactions into the purchase and purchase returns day books. Finally we will do some creditor reconciliations. Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:</p><ul><li>Check and approve purchase invoices</li><li>Code purchase invoices and credits</li><li>Enter purchase transaction to the day books and then close the day books</li><li>Reconcile creditors statements</li></ul><p>In section 5 we will move into Petty Cash. We will walk through each step of the petty cash process from raising petty cash vouchers, entering data to the daybook and reconciling and replenishing the petty cash. Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:</p><ul><li>Raise petty cash vouchers</li><li>Enter petty cash transactions to the petty cash daybook</li><li>Close the daybook and calculate the balance carried down</li><li>Reconcile the petty cash</li><li>Replenish the petty cash</li></ul><p>Section 6 of this course is about Banking Transactions. Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:</p><ul><li>Check remittance advice</li><li>Enter payments and receipts to the 3 column and analysis cash book</li><li>Close the cash book and calculate the balance carried down</li><li>Reconcile the bank</li></ul><p>In section 7 we will learn about the accounting equation and double entry. We will also prepare T-accounts. we will record transactions from the sales day book and the sales returns day book to the Receivables control account, the general ledger and the memorandum ledgers. we will record transactions from the sales day book and the sales returns day book to the Receivables control account, the general ledger and the memorandum ledgers. We will record transactions from the purchase and purchase returns prime books to the Payable's control accounts, the general ledger and the memorandum accounts. We will then record transactions from the bank and cash. This will complete the receivables and payable's control account. After this we will look at closing the controls accounts.</p><p>Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:<span></span></p><ul><li>Prepare double entry transactions</li><li>Prepare and record transactions in T-accounts</li></ul><ul><li>Transfer sales and sales returns transactions from the day books to the general ledger, memorandum accounts and receivables control account.</li><li>Transfer purchase and purchase returns transactions from the day books to the general ledger, memorandum accounts and payable's control account</li></ul><ul><li>Transfer the left and the right side of the cash books to the general ledgers</li><li>Close the control accounts</li></ul><p>In section 8 we will move into Journals. We will look at the need for journals and we will also produce and prepare the journals day books. We will then look at Payroll. We will look at calculating gross pay and net pay and we will also look at the need for employers to deduct payroll journals. After this we will then prepare the payroll journals and enter the transactions to the general ledger.  Followed bu this will be a high level overview of control accounts finishing with the preparation of Initial Trial balance and we will look at the steps you can take it if does not balance.<span></span><br></p><p>Through out this section you will have a number of activities using the case study presented and these activities will give you the opportunity to:<br></p><ul><li>Prepare Journals for adjustment and payroll and record them in the General Ledger</li><li>Close the general ledger accounts</li><li>Calculate gross and net pay</li><li>Prepare an initial trial balance</li></ul><p><strong>This course contains:</strong></p><p>Narrated story boards to help you put this learning into a work based context created by a team of instructional designers</p><p>A case study that we will use through out this course</p><p>Workbooks to download <br></p><p>Activities to complete</p><p>Quiz </p><p>Certificate of Completion</p><p>******BONUS****** FREE Join a community of other learners where you can interact with each other and with the instructor.</p><p><strong>********************************************************************************************</strong></p><p><strong>REGISTER NOW and get started with An Integrated Approach to the Fundamentals of Accounting !</strong></p><p><strong>*******************************************************************************************</strong></p><p>By the end of this course, you'll have the knowledge and confidence to carry out the responsibilities of a bookkeeper or assistant accountant<br></p><p>********************************************************************************************</p><p>Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you don't learn anything new from this course, simply request a refund within your 30 day period for your money back, no questions asked.</p>", 
    "end_date": null, 
    "title": "* An Integrated Approach to the Fundamentals of Accounting", 
    "price": "50.00", 
    "instructors": "Paula Guilfoyle & CO, Dioworks Learning, Talk To Us", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/768028_a2fa_4.jpg", 
    "course_url": "https://www.udemy.com/an-integrated-approach-to-the-fundamentals-of-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-19T20:38:41Z"
}