{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>A tomada de decisão sempre foi um fator crítico de sucesso, tanto na nossa vida pessoal como profissional. Nos dias de hoje, então, essa necessidade de tomar as melhores decisões é vital, tantas são as solicitações e as dúvidas que temos face a tanta informação, a qual nem sempre nos é apresentada da forma mais simples.<br></p>\n\n<p>Daí, por vezes, tomarmos decisões erradas guiados pela emoção do momento, que acaba por nos condicionar a razão e o pensamento.\n\n  </p>\n\n<p>Amortizo um crédito antecipadamente ou continuo a pagar as prestações? Que vantagens tenho nisso? \n\n  </p>\n\n<p>Qual a melhor forma de aplicar as minhas poupanças? Que rentabilidade terá esta ou aquela aplicação?\n\n  </p>\n\n<p>Tudo isto são questões que devem ser respondidas da forma mais assertiva possível.\n\n  </p>\n\n<p>Pois é aqui que entra o <strong>Cálculo Financeiro</strong>. \n\n  </p>\n\n<p>O objetivo deste curso passa por transmitir-lhe conhecimentos que lhe permitam dominar os conceitos e fundamentos da matemática associada às operações financeiras, operações essas que têm associadas o valor temporal do dinheiro.\n\n  </p>\n\n<p>Refiro-me a conceitos tais como juros, regimes de capitalização e de desconto, rendas financeiras, empréstimos, leasings, letras, livranças, etc.\n\n  </p>\n\n<p>Com o domínio destas temáticas, estamos em posição de avaliar melhor as nossas opções, sendo assim menos influenciados pela emoção.\n\n  </p>\n\n<p>Essencialmente, este curso é destinado a todos aqueles que têm que tomar decisões financeiras, tanto a nível pessoal como profissional, ou seja, todos nós, que queremos decidir com a maior assertividade possível.\n\n  </p>\n\n<p>Muito obrigado pela atenção! Conto consigo neste curso!</p>", 
    "end_date": null, 
    "title": "Aprenda Cálculo Financeiro de Forma Simples", 
    "price": "20.00", 
    "instructors": "PSZ Academy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865630_7428.jpg", 
    "course_url": "https://www.udemy.com/aprenda-calculo-financeiro-de-forma-simples/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T11:20:11Z"
}