{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Aprende a invertir en bolsa con el Professor Chart</strong></em> es un curso de bolsa interactivo que permite practicar cada concepto que se aprende a través de ejercicios y casos reales.</p><p style=\"\">Este curso recopila y sintetiza las estrategias de inversión de los mejores inversores de la historia, que han demostrado tener éxito y rentabilizar su capital. Hemos utilizado las enseñanzas de ilustres como John J. Murphy, Martin Zweig, Peter Lynch o Warren Buffet, y más adelante cuando estudiemos el el análisis fundamental de históricos como William O&#039;Neil y Benjamin Graham.</p><p style=\"\">Evitaremos que se pierda en la inmensa bibliografía existente y aceleraremos su curva de aprendizaje para que pronto pueda gestionar una cartera de inversión.</p><p style=\"\">Este curso es ideal para iniciarse en la bolsa, en los mercados financieros, el análisis técnico y el análisis de gráficos. Al finalizar este curso será capaz de aplicar distintas estrategias de inversión que se irán viendo en detalle lección a lección.</p><p style=\"\">Al adquirir el curso en Udemy tendrá<strong style=\"\"> también acceso al curso a través de distintas plataformas</strong>: Android, iOS y navegadores sobre Mac y Windows. De este modo, tendrá también acceso al contenido interactivo que permite realizar prácticas y ejercicios, además de los vídeos de Udemy.</p><p style=\"\">A medida que avance en el curso, le daremos también acceso exclusivo a <strong style=\"\">paquetes de ejercicios adicionales</strong>, para poder reforzar más aún todo lo aprendido.</p><p style=\"\">Pondremos a su disposición las herramientas necesarias para que pueda demostrase a sí mismo que es capaz de gestionar una cartera rentable antes de empezar a invertir con capital real. </p><p style=\"\">Una de las principales motivaciones de este curso será poder gestionar su patrimonio, sin depender de ningún gestor o banco para invertir sus ahorros o planificar su plan de pensiones.</p><p style=\"\">La compra del curso le da acceso indefinido al contenido del curso y a las actualizaciones y mejoras que se vayan realizando. También tendrá acceso a los paquetes de ejercicios que iremos creando.</p><p style=\"\">Finalmente, para resolver sus dudas pondremos a su disposición un correo electrónico al que responderá nuestro equipo de expertos.</p>", 
    "end_date": null, 
    "title": "Aprende a invertir practicando", 
    "price": "35.00", 
    "instructors": "Professor Chart", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501996_a375_2.jpg", 
    "course_url": "https://www.udemy.com/aprende-a-invertir-practicando/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T14:34:07Z"
}