{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong></p><p>Con el desarrollo de los contenidos programados en este curso se pretende que el estudiante aprenda a manejar una aplicación de contabilidad informatizada. La aplicación que se explica es el ContaSol. Se trata de una aplicación gratuita sin ningún tipo de restricción y que permite la llevanza de la contabilidad. Fundamentalmente me centraré en los siguientes aspectos de la aplicación:</p><p>- Introducción de asientos y su modificación.</p><p>- Gestión del impuesto sobre el valor añadido.</p><p>- Gestión de la tesorería de la empresa: vencimientos, cobros, pagos...</p><p>- Gestión del inmovilizado: altas, bajas, amortización...</p><p>- Consultas de documentos contables.</p><p>En definitiva,  se pretende familiarizar a los estudiantes con el uso de la informática tanto desde el punto de vista del registro de las operaciones diarias como en la consulta de documentos contables, apoyándonos en una de las aplicaciones informáticas de uso mas generalizado en la actualidad, como es el ContaSol.</p>    Este curso, es especialmente idóneo para el público en general con una formación básica en contabilidad.<p>Es importante resaltar que una vez se aprende a llevar la contabilidad con una aplicación informática, después la transición para el uso de otra aplicación diferente resulta muy sencilla.<span></span><br></p><p><span></span><br></p>", 
    "end_date": null, 
    "title": "Aprende a llevar la contabilidad de forma informatizada", 
    "price": "20.00", 
    "instructors": "Pedro Carmona Ibáñez", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734280_8708_3.jpg", 
    "course_url": "https://www.udemy.com/contabilidad-informatizada/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T16:11:31Z"
}