{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>\"<em>An investment in knowledge pays the best interest</em>.\" - Benjamin Franklin</strong></p><p>Asset Protection is a key part of good Asset Management, which is in turn an essential component of personal finance. Good financial planning involves being able to protect what we already own. Keeping the money is as important as making money.</p><p>Do you know that your assets may be exposed to various threats which include creditor claims, frivolous lawsuits or even divorces? The statistics show that such threats are becoming more real. With this course, you will learn the techniques to shield your assets from these threats and explore the legal entities which the Rich use to protect their wealth. We will also explore why using offshore companies and trusts can provide the extra protection which your assets deserve. </p><p>With this course, you can achieve:</p><ul><li>An expert in planning and shielding your money from unwanted lawsuits and creditors</li></ul><ul><li>Understand how Asset Protection form part of good Asset Management.</li></ul><ul><li>Understand how the rich use legal entities to stay rich</li></ul><ul><li>Structure and plan your finances better!</li></ul><ul><li>Park your stocks, bonds, houses and gold into offshore entities</li></ul>In the course, we will also go into the differences between offshore companies in different jurisdictions. A company domiciled in the Cayman Islands is subject to different laws than one domiciled in the British Virgin Islands. Want to know which jurisdiction to choose if you were to incorporate a mutual fund? This course answers the question.At times, we will go into the specifics, as in why a BVI Corporation offers more advantages relative to a US Corporation. We also talk about the costs of incorporating and maintaining an offshore business. Another important concept which will be covered is that of business liability, personal liability and limited liability.Remember, with the <strong>30-day Money Back Guarantee</strong>, you have absolutely nothing to lose. Take this course and see how it changes the way you view and protect your assets.", 
    "end_date": null, 
    "title": "Asset Protection Using Offshore Companies", 
    "price": "20.00", 
    "instructors": "Linus Tham", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577198_67c2.jpg", 
    "course_url": "https://www.udemy.com/asset-protection-using-offshore-companies/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T08:02:01Z"
}