{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong>Automate Your Personal Finances</strong>  </p>  <p>  \t         A how-to course on putting 99% of your monthly financials on auto-pilot.  </p>  <p>  \t<strong>BENEFITS</strong>  </p>  <p>  \t        By implementing this course, you will you:  </p>  <p>  \t        1. Eliminate Late Payments: by using auto-withdraw  </p>  <p>  \t        2. Increase Your Savings: Out-of-Sight, Into-Savings Strategy  </p>  <p>  \t        3. Get Back Time (Once Lost): never again will you pay bills on different days, at different times (that’s time consuming).  </p>  <p>  \t        4. Free Up Mental Burden: put your mind at ease, knowing everything financially is taken care of.  </p>  <p>  \t<strong>FIVE-MINUTE MONTHLY FINANCES</strong>  </p>  <p>  \t        Through this course you will be taught how to manage your monthly finances in five minutes or less, without using any fancy or expensive software.  </p>  <p>  \t <strong>INSIDE THE COURSE: 16 Videos / 45 Minutes of Content!</strong>  </p>  <p>  \t        The course is set up in 16 different video lessons, consisting of 45 minutes of one-on-one instruction. Also included with the program is an easy-to-use and simple-to-understand financial management spreadsheet. Throughout the videos the instructor will breakdown and explain the use of the spreadsheet to you, and help you set-up your own automated financial management system.  </p>  <p>  \t        A detail will not go unsaid, leaving you feeling educated about the automation of your monthly expenses. The Five-Minute Monthly Finance approach will change you the way your feel about your financial plan, leaving you to save more money and feeling less stressed about the juggling act of monthly expenses.  </p>  <p>  \t        Never overdraft, miss a payment or worry about a bill due date again. Instead earn back lost time spent paying bills and eliminate mental burden and stress of worrying, and start saving today!  </p>  <p>  \t<strong>*BONUS CONTENT (My Gift To You!)</strong>  </p>  <p>  \t<strong>1. Get Paid To Automate</strong>  </p>  <p>  \t  Do you like free money? This course requires a checking account and credit card...therefore I show you how to get a minimum of $450 for free (no strings), by leveraging internet deals to open these needed accounts. Sound too good to be true? It&#039;s not -- trust me.  </p>  <p>  \t<strong>2. Travel Hacking System</strong>  </p>  <p>  \t      Do you &quot;Travel-Hack&quot;? This system gives you a way to track and manage your credit cards and expenses. No more confusion. Finally, an easy system to quickly change credit cards (and expenses) and reap the benefits of the reward programs!  </p>", 
    "end_date": null, 
    "title": "Automate Your Finances", 
    "price": "20.00", 
    "instructors": "Calvin Johannsen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/213154_c85a_5.jpg", 
    "course_url": "https://www.udemy.com/automate-your-personal-finances/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-08T14:54:48Z"
}