{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Since 1494 when Luca Pacioli, for the first time, described the Double Entry System, the world has never been the same. Ever since Accounting became the language of business. Therefore, like when you go to a foreign country the first thing you do is to learn their spoken language. Before you can deeply understand business you must understand how accounting works. </p><p>From this course you can expect to deeply understand basic accounting concepts such us: </p><ul><li>GAAP </li><li>Double-Entry (how to make journal entries)</li><li>General Ledger </li><li>Accounting Procedures and Processes </li><li>Main financial Statements (Balance Sheet and Income Statement</li></ul><p>How? </p><ul><li>Intuitive E-Learning through white board method</li><li>Free Exercises </li><li>Final Quiz</li><li>Extra Slides</li></ul><p><strong>About the Instructor:</strong><br></p><p>Gennaro Cuofano matured international experience for over Ten years between Europe and US. After graduating from Law School, he worked for a while in the legal field. His passion for finance and international business brought him to become an International MBA, with concentration in Corporate Finance. </p><p>After completing his MBA in Italy, at Luiss Business School; he flew to California, where he completed the International MBA at University of San Diego, California. There, he had the chance to attend Corporate Finance courses held by Thomas Copeland, former head of the Corporate Finance Practice at McKinsey. Then, he worked as consultant for a multinational company. With an international team from China and Germany he built a system to assess the employees engagement and knowledge about the product. After that <strong>Gennaro matured three years of experience in a Real Estate Investment company, based in San Diego, California as Financial Analyst/Assistant Controller</strong>.<span></span></p>", 
    "end_date": null, 
    "title": "Awaken the Accountant in You | Master the Accounting Basics ", 
    "price": "20.00", 
    "instructors": "The Four-Week MBA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627706_120a_2.jpg", 
    "course_url": "https://www.udemy.com/enlightened-accountant-master-accounting-basics-in-no-time/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T06:21:23Z"
}