{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      ----------------------------------------------------------------------------------------------------------------</p><p style=\"\"> <strong style=\"\">BEST FOR CREDIT ANALYSIS</strong> </p><p style=\"\">THIS IS BEST LECTURE EXPLAINED IN SIMPLE METHOD WITH EXAMPLES FOR CREDIT PROFESSIONAL.Also it would def help on the job purpose as well.Would def recommend</p><p style=\"\">------------------------------------------------------------------------------------------------------------------<br style=\"\"></p><p style=\"\"><br style=\"\">Credit Analysis is the core process adopted by any Bank to understand, evaluate and appreciate about the Customers Identity, Integrity, Financial Position, - Repayment Capacity, Etc.  </p>  <p style=\"\">  \t      Every Banker should be through with Credit Analysis Process because day in day out they have to deal with new customers and before sanctioning any new loans to them, Banker should have made detailed study of their customers.  </p>  <p style=\"\">  \t      No Banker can raise to top unless he becomes conversant with Credit Analysis Process.  </p>  <p style=\"\">  \t      Bank would generally throw employees on to the job before they get opportunity to be trained. This is with more specific reference to Credit Analysis where Bankers should under detailed learning process, else their mistakes in the process will be Very Costly beyond their manageable Position.  </p>  <p style=\"\">  \t      Hence, this course will provide platform to Bankers to have fall back reference on the Critical Aspects of Credit Analysis Process, Banking/ Management Consultants can also use this course for the equipping themselves to the expectations of the Bankers while handling Credit Proposals.  </p>  <p style=\"\">  \t      This Course has been Structured in self paced Learning Style.  </p>  <p style=\"\">  \t      Learners can Learn Credit Analysis process at their own time, Convenience and place.  </p>  <p style=\"\">  \t      Materials used in this Course will enable the participants to understand credit Analysis Process with almost Clarity.  </p>", 
    "end_date": null, 
    "title": "Banking Credit Analysis Process (for Bankers)", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260066_a43b_3.jpg", 
    "course_url": "https://www.udemy.com/credit-analysis-process/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-12T08:33:59Z"
}