{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Technical analysis involves predicting future price movements for stocks, commodities, currency, and bonds. The person performing technical analysis is called the technical analyst.</p><p>The technical analyst uses charts and technical indicators to predict the future price movements. Technical analysts are known for forecasting the probabilities of future price movements.</p><p>Anybody who wants to make effective investment in equity market should have knowledge on basic technical analysis and the most important fact is that it is not so tough. If you love the charts then the chart will tell you the secret of unlocking them.</p><p>While preparing this course, the instructor has kept some very interesting points in mind, like:-</p> <ul style=\"\"><li>She has tried to keep each video length in between 6-7 minutes because the average human brain can deeply concentrate on anything for 6 minutes at a time.</li><li></li> <li>Each lecture is explained with charts and images because a study has proven that charts or images can explain better than the words and these charts have long term effects on the learner&#039;s mind.</li> <li> </li> <li>Every lecture/module is accompanied with different practice lessons because practice makes us to understand better.</li></ul> <p> Anyone who will take the course along with different practice lessons, will be an expert in basic technical analysis . If anybody who wants to be master in technical analysis , can opt for our another course i.e. “Advance Technical Analysis&quot;. This two courses are the complete guide in technical analysis field and almost everything in technical analysis have been covered here.</p><p><strong style=\"\">What you are getting from this course?</strong></p> <ul style=\"\"><li>2 hours lectures divided into short videos.</li> <li>Almost each lecture is explained with charts to make it interesting</li> <li>Discussion on assumptions of technical analysis, trends, trend-lines, charts and gap analysis</li> <li>Easily explained popular classic chart patterns </li> <li>Explained videos showing how to find patterns in real life</li> <li>Discussions on usage of most popular technical indicators</li> <li>Numerous exercises, reference materials and quizzes</li></ul>", 
    "end_date": null, 
    "title": "Basic Technical Analysis", 
    "price": "25.00", 
    "instructors": "Moonmoon Biswas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479496_2543_2.jpg", 
    "course_url": "https://www.udemy.com/basic-technical-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T03:05:46Z"
}