{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            Accounting for Entrepreneurs is a <strong style=\"\">unique course, </strong>designed to teach Accounting to Non-Accounting professionals. This course covers all the basic concepts of Accounting that a business person needs to know to handle his business financials. For example,  </p>  <ul style=\"\">  \t<li style=\"\">Accounting terms</li>  \t<li style=\"\">Cash and Accrual Accounting</li>  \t<li style=\"\">Double entry concept</li>  \t<li style=\"\">General Ledger and Chart of Accounts</li>  \t<li style=\"\">Trial Balance and Financial Statements</li>  \t<li style=\"\">Fixed Assets and Depreciation</li>  \t<li style=\"\">Intangible Assets and Amortization</li>  \t<li style=\"\">GST and its Accounting treatment</li>  </ul>  <ul style=\"\">  </ul>  <p>  \t            This built of the course is fairly easy, the format is beautifully designed interesting interactive video, the course flows from basis to Accounting to the preparation of financial statements first and then the more complex and frequently used areas of Accounting have been dealt with. This course also covers various practical concepts which are quite useful when you are maintaining your books in an accounting software. In short, in the next 30 minutes you will be able to understand all the basis aspects of Accounting that you need to know to well handle your business financials.  </p>  <p>  \t            This course is also ideal for <strong style=\"\">entrepreneurs</strong>, <strong style=\"\">non financial managers</strong> and <strong style=\"\">new students to accountancy</strong>, as they will be able to learn accounting in <strong style=\"\">more natural and practical style </strong>rather than typical class room lectures. You don&#039;t need any previous knowledge or experience to learn this course.  </p>  <p>  \t<strong style=\"\">How I am uniquely qualified to teach this course:  </strong>  </p>  <p>  \t          I am Certified Chartered Accountant with 7 years of professional work and teaching experience and have taught more than 4000 students! I have implemented accounting software and ERP at various organizations and have expertise in financial transformation. I have been leading accountancy practice for small and medium sized entities for the last 4 months and have frequent interaction with entrepreneurs. So I know what exactly do entrepreneurs need to know to well manage their books.  </p>", 
    "end_date": null, 
    "title": "Basic Accounting Terms", 
    "price": 0, 
    "instructors": "Irfan Sharif", 
    "commitment": "26 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400858_48be_3.jpg", 
    "course_url": "https://www.udemy.com/accounting-for-entrepreneurs/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-22T06:23:02Z"
}