{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Basic Excel for Basic Bookkeeping - an introductory course for those that are new to Excel and new to Bookkeeping.</p><p><strong>In This Course You Will Learn The Basics Of Excel, The Very Basics of </strong><strong>Bookkeeping, And How You Can Do Simple and Basic Bookkeeping in Excel.</strong></p><p style=\"\">If you need to record basic transactions for your business. If you are new to Excel? If you would like  a <strong><em>FREE</em></strong> template of professional day-books in Excel to download? THEN REGISTER NOW</p><p style=\"\"><strong>Course Overview</strong></p><p style=\"\">We will begin this course by introducing you to Excel, where you will learn the very basics. We will introduce you to a workbook and the ribbons, and you will learn how to select, enter and delete data.</p><p style=\"\"> In section 2 we will move into the very basics of bookkeeping, we will introduce you to the day books that you should keep and we will identify key details that you should record in these day-books.  These day-books, prepared in Excel, are available for download, and we will use them in the rest of this course while we are working in Excel.</p><p style=\"\">In section 3 - Excel working with data, you will learn how insert, remove and merge cells, rows and columns.  We will also look at find and replace, hide and unhide and Special paste. After this we will move on to entering basic formula and some formatting.</p><p style=\"\">Section 4 of this course - Excel Organizing and sorting data, will give you the opportunity to organize the day-books using tables, filters, names and data validation</p><p style=\"\">Finally in section 5 Excel Analyzing data you will be introduced to Excels recommended charts and recommended pivot tables.</p><p style=\"\"><strong>This course contains:</strong></p><p style=\"\">Notes to download - Available Now</p><p style=\"\">Sample practice day-books - Available Now</p><p style=\"\">Exercises to complete - Available Now</p><p style=\"\">Certificate of Completion</p><p style=\"\"><strong>****BONUS******FREE Professional Day-books templates in Excel**************** </strong>NOT YET AVAILABLE (this course will remain free until the Professional Day-books template is ready)</p><p style=\"\"><strong>*****BONUS****** FREE Join a community</strong> of other learners where you can interact with each other and with the instructor.</p><p><strong>********************************************************************************************</strong></p><p><strong>REGISTER NOW and get started with Bookkeeping in Excel Today!</strong></p><p><strong>*******************************************************************************************</strong></p><p>By the end of this course, you'll have the knowledge and confidence to record your basic bookkeeping transaction in Excel.  You will also be confident in using the basics of Excel for almost any task. In addition to this you will also have the foundations to move on to a more advanced Excel or Bookkeeping course.<br style=\"\"></p><p><strong>********************************************************************************************</strong></p><p><strong>Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you don't learn anything new from this course, simply request a refund within your 30 day period for your money back, no questions asked.</strong></p>", 
    "end_date": null, 
    "title": "Basic Excel for Basic Bookkeeping and Accounting", 
    "price": 0, 
    "instructors": "Paula Guilfoyle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596598_993f_6.jpg", 
    "course_url": "https://www.udemy.com/basic-excel-for-basic-bookkeeping/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T09:46:39Z"
}