{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t  The aim of this course is to give you the knowledge, training and confidence to go from having never seen a futures contract to trading on the live market.  Lectures are reinforced by real-live trading examples, informative commentary and relevant trading drills.\r\n</p>\r\n<p>\r\n\t  Build a solid foundation for your new trading career by learning to develop your OWN trading style and MAXIMIZING your trading potential.\r\n</p>\r\n<p>\r\n\t<strong><strong>Teacher Background</strong></strong>\r\n</p>\r\n<p>\r\n\t   As an experienced trader and trading mentor with over 8 years of day trading experience, I always take pride in seeing my students take the right steps to reach their trading potential.\r\n</p>\r\n<p>\r\n\t   In mentoring numerous new and experienced traders, I have noticed a clear trend in the rate at which new traders can accelerate their progress by being taught the fundamental  knowledge I have put together in this course into their own trading plans.\r\n</p>\r\n<p>\r\n\t  The topics covered in this course are no secret to experienced futures traders. However, if you are like many one of my students playing catch up then you can <strong><strong>save time and money </strong></strong>by learning what you need to know today.\r\n</p>\r\n<p>\r\n\t<strong><strong>Is this another Trading System?</strong></strong>\r\n</p>\r\n<p>\r\n\t   Every trader I have encountered has been unique. Hence, every trading style and system is unique to each trader’s personality, risk tolerance and goals. There is no one size fits all to trading.\r\n</p>\r\n<p>\r\n\t  This course is structured to give you the ingredients to develop your own trading system. Only by developing their own system are successful traders able to adapt to changing market conditions and <strong><strong>consistently profit from low or high volatility markets.</strong></strong>\r\n</p>\r\n<p>\r\n\t<strong><u><strong>I already trade stocks, options, forex etc. How can this help me?</strong></u></strong>\r\n</p>\r\n<p>\r\n\t  With over 2 hours of real trade screen recordings and insightful commentary from an experienced trader, you will be able to see the difference in price action and technical indicators that identify opportunities in futures. Furthermore, with futures markets open 24 hrs a day, increase your trading profits by <strong><strong>Adding Futures To Your Trading Arsenal.</strong></strong>\r\n</p>", 
    "end_date": null, 
    "title": "Become a Career Day Trader: Asian-Pacific Futures Markets", 
    "price": "20.00", 
    "instructors": "Infinity Trading", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148028_1b4e_2.jpg", 
    "course_url": "https://www.udemy.com/become-a-career-day-trader/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-16T23:03:08Z"
}