{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><em>Do you want to learn how to use Excel in a real working environment?</em></strong>  </p>\n\n<p>  \t<strong><em>Are you about to graduate from university and look for your first job?</em></strong>  </p>\n\n\n\n\n\n<p>  \t<strong><em>Are you a young professional who is looking to establish himself at his new position?</em></strong>  </p>\n\n\n\n\n\n<p>  \t<em><strong>Would you like to become your team's go-to guy when it comes to Financial Modeling in Excel?</strong></em>  </p>\n\n\n\n\n\n<p>  \t<em><strong>If so, then this is the right course for you!</strong></em>  </p>\n\n\n\n\n\n<p>  \t<em><strong>Join over 8,500 successful students taking this course!!</strong></em></p>\n\n\n\n\n\n<p>  \t                        The instructor of this course has extensive experience in Financial Modeling:  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t                        ·Worked in the Financial advisory unit of a top-tier consulting firm  \t</p>  \t<p>  \t\t                        ·Experience in transactions carried out in Italy, Germany, Switzerland and Poland  \t</p>  \t<p>  \t\t                        ·Worked in the in-house Mergers &amp; Acquisitions department of a large multinational corporation</p>  \t<p>  \t\t                        ·Financial advisor in multiple M&amp;A deals with sizes ranging from €2 million up to €5 billion  \t</p>  \t<p>  \t\t                        ·Worked on company valuations, due diligence analysis, impairment tests, bankruptcy proceedings, cash flow analysis etc.  \t</p>  </ul>\n\n\n\n\n\n<p>  \t                        Learn the subtleties of Financial Modeling from someone who has walked the same path. Leap well ahead on the learning curve and stand out from your colleagues.  </p>\n\n\n\n\n\n<p>  \t<em><strong>A comprehensive guide to Financial Modeling in Excel:</strong></em>  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t                                                           ·<em>Become an Excel expert</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Learn how to build sound Financial Models and stand out at your job</em>  \t</p>  \t<p>  \t\t                                                           ·<em>An in-depth understanding of the mechanics of Company Valuation </em>  \t</p>  \t<p>  \t\t                                                           ·<em>Build your files in a professional way </em>  \t</p>  \t<p>  \t\t                                                           ·<em>Demonstrate superior Excel skills at work</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Be prepared from day one for your Investment Banking, Financial Advisory or Consulting job</em>  \t</p>  </ul>\n\n\n\n\n\n<p>  \t<em>What we offer:</em>  </p>\n\n\n\n\n\n<p>  \t<em>Well-designed and easy-to-understand materials</em>  </p>\n\n\n\n\n\n<p>  \t<em>Detailed explanations with comprehensible Case Studies based on real situations</em>  </p>\n\n\n\n\n\n<p>  \t<em>Downloadable course materials </em>  </p>\n\n\n\n\n\n<p>  \t<em>Regular course updates</em>  </p>\n\n\n\n\n\n<p>  \t<em>NEW! Includes professional chart examples that are 1:1 with those used by major banks and consulting firms</em>  </p>\n\n\n\n\n\n<p>  \t<em>By the completion of this course you will:</em>  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t                                                           ·<em>Work comfortably with Microsoft Excel and many of its advanced features</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Become one of the top Excel users in your team</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Be much quicker at carrying out regular tasks</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Be able to build a P&amp;L statement from a raw data extraction</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Be able to build a Cash Flow statement</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Know how to value a company</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Be able to build a Valuation model from scratch</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Know how to create a model with multiple scenarios</em>  \t</p>  \t<p>  \t\t                                                           ·<em>Know how to create professional and good-looking advanced charts</em>  \t</p>  </ul>\n\n\n\n\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n\n\n\n\n<p>Students of this course who complete 50% of the lessons get full, lifetime access to our five-star rated course “PowerPoint MasterClass: Beginner to Pro in PowerPoint”. It has a full price of $20.</p>\n\n\n\n\n\n<p>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n\n\n\n\n<p>Students of this course who complete 100% of the lessons get full, lifetime access to our five-star rated course “Job Search Success Strategies: Proven Job Hunting Strategies”. It has a full price of $20.</p>\n\n\n\n\n\n<p>  \t                                                           +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>\n\n\n\n\n\n<ul>  \t<p>  \t\t                                                           About the course:  \t</p>  \t<p>  \t\t                                                           ·An unconditional Udemy 30-day money-back guarantee – because we believe in the quality of our content  \t</p>  \t<p>  \t\t                                                           ·No significant previous experience is needed in order to understand the course well and fully benefit from its content  \t</p>  \t<p>  \t\t                                                           ·Unlimited access to all course materials  \t</p>  \t<p>  \t\t                                                           ·Emphasis on learning by doing  \t</p>  \t<p>  \t\t                                                           ·<strong>You can always contact us for any clarification completely free of charge</strong>  \t</p>  \t<p>  \t\t                                                           ·<strong>Our goal is to take your Microsoft Excel and Financial Modeling skills to the next level</strong>  \t</p>  </ul>\n\n\n\n\n\n<p>  \t                                                           Make an investment that will be highly rewarded in terms of career prospects, positive feedback and personal growth.  </p>\n\n\n\n\n\n<p>  \t                                                             This course is particularly suitable for graduates who aspire to become investment bankers as it  includes a well-structured DCF model and goes through the theoretical concepts behind it. Moreover, it will help you to be more confident when coping with daily tasks and will provide you with an edge when the firm has to decide whether to confirm you for a full-time position.  </p>\n\n\n\n\n\n<p>  \t                                                             People with basic knowledge of Excel who go through the course will dramatically increase their Excel skills.  </p>\n\n\n\n\n\n<p>  \t                                                           Just go ahead and subscribe to this course! If you don't acquire these skills now you will miss an opportunity to separate yourself from the others. Don't risk your future success! Let's start learning together now!  </p>", 
    "end_date": null, 
    "title": "Beginner to Pro in Excel: Financial Modeling and Valuation", 
    "price": "30.00", 
    "instructors": "365 Careers", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321410_d9c5_2.jpg", 
    "course_url": "https://www.udemy.com/beginner-to-pro-in-excel-financial-modeling-and-valuation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T08:39:52Z"
}