{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    This course has been designed to deliver you a practical, actionable, and robust method for analyzing any company. Whether you&#039;re completely new to investing and finance, or if you have some experience but want to up your game, beginning this course now will immediately pay dividends and boost your returns.  </p>  <p style=\"\">  \t   It all starts with the fundamental building blocks of value investing.  </p>  <p style=\"\">  \t    The course begins with the most fundamental elements of investing and financial analysis -- the financial statements. After gaining an understanding for the purpose, structure, theory, and application of the income statement, balance sheet and statement of cash flow, we move on to the meat of the course.  </p>  <p style=\"\">  \t We develop and apply our 11-step methodology for analyzing and understanding any company. We sequentially discuss and apply each step using a case study to explain the concepts and demonstrate how the method is used in &quot;the real world.&quot; At the end of this section, each student will be able to take the method and conclusions we draw in the course and apply them to any business, large or small. YOU will be ready to analyze any company like an investment professional!  </p>  <p style=\"\">  \t    Lastly, we take a step back and look at the big picture. We&#039;ll share our philosophy and some great resources for discovering investment opportunities on your own. We will discuss our methods for sourcing potential investment ideas--we avoid the mainstream media and seek to find opportunities before they make the headlines. At the end of the section you&#039;ll find yourself identifying companies all around you ripe for an investment.  </p>  <p style=\"\">  \t    The instructors in this course are co-founders of the investment research and publishing company, Sabre Capital Group. Both instructors have extensive backgrounds in finance and have applied these theories and methods in real world applications in both investment and commercial banking. The methodology we teach here is robust, it&#039;s straightforward, and it&#039;s real-world tested and approved.  </p>  <p style=\"\">  \t    Each section is supplemented with a case study, learning aids, and resources for further study.  </p>  <p style=\"\">  \t    We believe that successful investing starts with developing a deep understanding of the companies in which we invest. That starts with financial analysis. Jump start your investing success by beginning this course now!  </p>", 
    "end_date": null, 
    "title": "Beginner Financial Analysis: Invest Like Warren Buffett", 
    "price": "50.00", 
    "instructors": "Sabre Capital Group LLC", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94532_b097_3.jpg", 
    "course_url": "https://www.udemy.com/beginner-financial-analysis-invest-like-warren-buffett/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T15:13:07Z"
}