{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Looking to expand your knowledge on Bitcoin further?</em></strong></p><p><strong><em>Having trouble understanding the latest Bitcoin Developments?</em></strong></p><p><strong><em>Maybe you want to gain a grassroots understanding of how Bitcoin works?</em></strong></p><p>Whatever your motivation is to understand Bitcoin further, you’ve come to the right place to get started as everything is discussed in this podcast course.</p><p><strong><em>Bitcoin Podcast: Understand The Developments In The Bitcoin Ecosystem</em></strong>, is the most frequently updated Bitcoin podcast course you’ll find on the internet discussing the latest on Bitcoin.</p><p>It’s the one place with everything you need to truly understand the latest developments in the Bitcoin field, and feel comfortable with knowing you’re learning from a credible resource!</p><p>This is an <strong><em>effective and practical podcast course that will take you from not understanding the latest developments in the Bitcoin field, to feeling comfortable with explaining them to others.</em></strong></p><p>While there are plenty of Bitcoin blogs on the web, it’s hard to find a specific and frequently updated resource that discusses Bitcoins latest developments on a regular basis, allowing those listening to feel a part of a growing Bitcoin community.</p><p>Nothing is kept a secret. <strong><em>I reveal everything about Bitcoins latest developments. I will be adding new episodes to this podcast every Tuesday – at no extra cost, this will always remain free!</em></strong></p><p>This podcast course is designed for anyone who wants to gain a grassroots understanding of Bitcoin, and the latest developments in the Bitcoin field weekly. So if you’re a complete newbie, or someone who is aware of Bitcoin but doesn’t understand how it all works, you’re in the right place.</p>", 
    "end_date": null, 
    "title": "Bitcoin Podcast: Understand The Latest Bitcoin Developments", 
    "price": 0, 
    "instructors": "Ravinder Deol", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774174_05da_3.jpg", 
    "course_url": "https://www.udemy.com/bitcoin-podcast/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T17:32:03Z"
}