{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Looking to become an active Bitcoin investor?</em></strong></p><p><strong><em>Having trouble predicting when Bitcoins value will rise and fall?</em></strong></p><p><strong><em>Maybe you want to know Bitcoins long-term value?</em></strong></p><p>Whatever your motivation to become a Bitcoin investor, you’ve come to the right place.</p><p><strong><em>Bitcoin Investing: The Complete Buy &amp; Hold Strategy For 2016</em></strong>, is the most comprehensive Bitcoin investing course you’ll find on the internet.</p><p>It’s the one place with everything you need to start investing in Bitcoin for the long-term like a professional, and profit from the volatile markets that Bitcoin is accustomed to!</p><p>This is a <strong><em>fast and effective course that takes you from zero Bitcoin investing skills, to an active Bitcoin investor, with the know-how on predicting the rise &amp; fall in Bitcoins value in order to profit.</em></strong></p><p>While there are plenty of investing courses that focus on profiting from the stock, and forex markets, it’s hard to find a comprehensive Bitcoin investing course like this one, which is for complete beginners, and anyone who wants to invest in Bitcoin for the long-term and profit from its volatile markets.</p><p>Nothing is a kept secret. <strong><em>I reveal everything about investing in Bitcoin for the long-term, and will add new lectures to this course constantly - at no extra cost to you!</em></strong></p><p>This course is designed for anyone who wants to become an active Bitcoin investor, and profit from the volatility of Bitcoin. So if you’re a complete newbie, or someone who has been investing in Bitcoin but needs help, you’re in the right place.</p>", 
    "end_date": null, 
    "title": "Bitcoin Investing: The Complete Buy & Hold Strategy For 2016", 
    "price": "20.00", 
    "instructors": "Ravinder Deol", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702138_e226_23.jpg", 
    "course_url": "https://www.udemy.com/bitcoin-investing/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-20T13:14:07Z"
}