{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\"></strong><strong style=\"\">“Bitcoin for Beginners\"</strong> is the new Udemy Video Training Series designed to help anyone who wants to know more about <em style=\"\">“The Future of Money\"</em>, but needs someone to show them how it works in the real world, and do it in simple language anyone can understand.  Whether it is used as a store of value, an investment, for sending money worldwide for virtually nothing, or for those just looking to experience the latest in global financial technology, <em style=\"\">Bitcoin</em> has something for everyone. This will take soemone who has no knowledge of <em style=\"\">Bitcoin</em> and bring them a solid understanding of what it is and why it is here to stay, and a worthwhile investment in your future.  </p>  <p>  \t       Included is the <strong style=\"\">\"Bitcoin Bonanza\"</strong> eBook, the <strong style=\"\"><em style=\"\">20-Video Bitcoin Training Series</em></strong>, which provides the latest information on <em style=\"\">Bitcoin</em> with 3 hours of content. And I've included some extra bonus material with 3 extra <em style=\"\">Bitcoin</em> videos and Volume One of the <strong style=\"\">\"Bitcoin Bonanza Newsletter\"</strong>, giving you an international perspective on the global phenomenon that is Bitcoin. With two PDFs, 23 videos, and hours of training videos, you will have everything you need to invest in <em style=\"\">Bitcoin</em> with confidence!  </p>", 
    "end_date": null, 
    "title": "Bitcoin For Beginners", 
    "price": "50.00", 
    "instructors": "Evander Smart", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/370440_fae8_4.jpg", 
    "course_url": "https://www.udemy.com/bitcoinforbeginners/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-15T03:34:36Z"
}