{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t       Have you heard anything about Bitcoin yet?  </p>  <p>  \t Bitcoin currently creating controversy and history at the same time.  </p>  <p>  \t       Will it eliminate credit cards and become as big as the Internet in the 90s? Take a look at the recent media buzz about Bitcoin:  </p>  <p>  \t               “The next revolution to hit the Web after social media\" <em>Bloomberg</em>  </p>  <p>  \t               “A major means of payment for e-commerce\", <em>Bank of America</em>  </p>    <p>  \t         \"96% of Merchant would recommend Bitcoin to Peers\"<em> Coindesk</em>  </p>  <p>  \t           As Bitcoin enters mainstream media, now is the time for you to better understand what Bitcoin is, how it works and why it's emerging as a significant breakthrough in the financial system!  </p>  <p>  \t         Don't miss your  to seize the moment. <strong>Take this course</strong> to make your own mind whether it's time to expand your financial portfolio, adopt it in your business as a new payment method with no transaction fees or simply be well versed at a dinner party.  </p>  <p>  \t               Although the Internet is full of information about Bitcoin, it's often very technical and hard to understand unless you have a Ph.D. in cryptography or can afford to spend hours researching the subject. <strong>Save your precious time by taking this course</strong> and learning the practical information you will need to decide if Bitcoin is for you and how to use it.  </p>  <p>  \t               We've prepared a concise and very visual tutorial that is easy to follow and explains the fundamentals of Bitcoin in plain English. We are honored to take you by the hand and lead you into the exciting new world of Bitcoin!  </p>  <p>  \t               Part I of our course is all about the concept of Bitcoin – Here are highlights of what you will learn:  </p>  <p>  \t               * What is Bitcoin  </p>  <p>  \t               * Where Did Bitcoin Come From  </p>  <p>  \t               * How Bitcoin Works  </p>  <p>  \t               * Who Created Bitcoin  </p>  <p>  \t               * Bitcoin Benefits &amp; Drawbacks.  </p>  <p>  \t          * Regulation of Bitcoin and MtGox Collapse  </p>  <p>  \t          * Future Outlook  </p>", 
    "end_date": null, 
    "title": "BITCOIN VISUALLY. Part I.", 
    "price": "50.00", 
    "instructors": "Expert in Finance", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153926_6a49_4.jpg", 
    "course_url": "https://www.udemy.com/bitcoin-visually-part-i/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-28T04:54:38Z"
}