{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>La tecnología de bitcoin está revolucionando la industria de servicios financieros y en sí al mundo.</p>\n\n<p>Aprenderás algo que muchas veces ni en la escuela, ni en la universidad, ni nuestras familias nos enseñan pero que curiosamente es algo tan importante que no puede pasar un sólo día sin que lo utilicemos y es el entender que es el dinero y por supuesto como se acrecenta.</p>\n\n\n\n<p>Contactanos y te daremos la razón clave por la que debes de atender este curso de inmediato.</p>\n\n\n\n<p>Cada día más y más se habla de la manera en que las empresas invierten en software que automatiza labores relacionadas con el registro y el análisis de la información. Durante mucho tiempo se ha escuchado que en un futuro cada vez más cercano no sean necesarias personas que se encarguen de la contabilidad y/o de las finanzas de las empresas.</p>\n\n\n\n<p>Y esta realidad es cada vez más tangible. Otro tipo de profesionistas se han sentido seguros hasta el momento y nos referimos a los asesores financieros e incluso otras posiciones similares de la industria financiera como los traders de forex.</p>\n\n\n\n<p>Sin embargo, cada vez mas y más se desarrolla tecnología como los robo-asesores que están poniendo en riesgo seriamente los trabajos de muchas trabajadores de cuello blanco de esta industria.</p>\n\n\n\n<p>El mundo está cambiando y la pregunta ahora es: ¿ vas a aprender acerca de las innovaciones tecnológicas que están sacudiendo al mundo o te vas a quedar al margen y afrontarás las pérdidas?</p>\n\n\n\n<p>Esta inversión puede ser la diferencia entre generar más ingresos o quedar en la calle.</p>\n\n\n\n<p>Claro está, que el cambio del que estamos hablando es de impacto general y mundial. Y a lo que nos referimos es que no solo si te desarrollas en esta industria te debe de importar Bitcoin y las criptodivisas. Este es un cambio que ofrece oportunidades sin precedentes a cualquier persona que haya utilizado dinero alguna vez para efectuar una transacción que prácticamente es cualquier persona en este mundo.</p>\n\n\n\n<p>Hay incluso personas que están formulando sus tesis alrededor de Bitcoin y otras dedicando su vida a la tecnología que sirve como base de las criptodivisas.<br> <br>Es de interés también para economistas que analizan y se sorprenden de como las nuevas generaciones están cambiando las formes tradicionales de pensamiento y no solo se esta creando esta nueva base tecnológica sino que además los miembros más jóvenes están dispuestos a innovar y a ser los que tempranamente adoptan estos cambios revolucionado industrias enteras</p>\n\n\n\n<p>Así que no importa tu formación, el contenido de este curso te interesa. Así que una vez más: ¿qué esperas para conocer todo lo que significa Bitcoin y el por que ya es considerado como el futuro del dinero ? No pierdas más tiempo, contactanos y quedarás convencido de inmediato.</p>", 
    "end_date": null, 
    "title": "Bitcoin: el futuro del dinero, hoy", 
    "price": "50.00", 
    "instructors": "Knowledge Motion Works", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/867440_6970_2.jpg", 
    "course_url": "https://www.udemy.com/bitcoin-el-futuro-del-dinero-hoy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-03T02:28:56Z"
}