{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t Have you ever wondered what is up with this crypto currency that people are talking about? Do you even know what crypto currency is? There are so many cropping up now that it is hard not to run across them on your internet travels. Bitcoin is and has been the leader in all things crypto currency, with one coin selling for $600 and up in cash.  </p>  <p style=\"\">  \t They are also becoming more common, being used in stores and for many sites online. It is no longer uncommon to see your favorite site offering you a new way to pay, with Bitcoins.  </p>  <p style=\"\">  \t But what are Bitcoins? Where do they come from? How do I get some? All questions you are probably asking yourself if you have wound up here. And they are all questions that will be answered by the end of this course.  </p>  <p style=\"\">  \t In Bitcoin - Past, Present, Future you will learn about the creation of Bitcoin, and thus the creation of crypto currency. You will learn about such things as a wallet, where you store the Bitcoins, about mining and even the pitfalls of Bitcoin.  </p>  <p style=\"\">  \t By the end of this course, you will have a handle on what Bitcoin is, in turn what crypto currency is and be well on your way to figuring out how to get some for yourself.  </p>  <p style=\"\">  \t So please enjoy Bitcoin - Past, Present, Future  </p>", 
    "end_date": null, 
    "title": "Bitcoins - Past, Present, Future", 
    "price": "20.00", 
    "instructors": "Patrick Hatt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/201942_30fc_4.jpg", 
    "course_url": "https://www.udemy.com/bitcoins-past-present-future/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T02:14:35Z"
}