{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the basics of a manual bookkeeping system and use them to understand how the key financial statements, namely the Profit and Loss account (Income Statement) and the Balance Sheet (Statement of Financial Position) are constructed.</p><p><strong style=\"\">If You Understand Double Entry Bookkeeping, You&#039;ll Build A Great Foundation For A Career in Bookkeeping And Accounting, With This Tutorial For Beginners.</strong></p><ul style=\"\"><li>Learn how the accounting equation impacts the Balance Sheet.</li><li>Know how to use the basic rules of double entry to produce T Accounts.</li><li>Learn how to balance off accounts and prepare a Trial Balance.</li><li>Be able to write up a cash book.</li><li>Perform a bank reconciliation.</li><li>Operate a petty cash system.</li><li>Prepare a Profit and Loss account.</li><li>Understand and prepare a Balance Sheet.</li></ul><p><strong style=\"\">Short lessons in bookkeeping for the busy person.</strong></p><p><strong style=\"\"></strong>You might be returning to work after a long absence (looking after the kids), if so, then this course is a gentle introduction to the bookkeeping basics that will help you decide whether bookkeeping is the right job choice for you.</p><p>It is a proven fact that if you gain more skills and qualifications in the workplace then you will open up more opportunities for yourself and you will become more employable as a result. </p><p>If you want to excel in a bookkeeping career, you need to fully understand the basic bookkeeping principles and techniques that we cover in this course. You&#039;ll find that many of the professional bookkeeping and accounting qualifications start with manual bookkeeping as a foundation basis for your studies.</p><p>You may not be interested in obtaining qualifications, you might already own a business and simply want to get to grips with bookkeeping basics so that you can understand what your accountant is talking about! </p><p>In this Bookkeeping course, we use lots of examples to demonstrate the techniques and then we also add a worksheet at the end of every lesson to check your understanding of the subject covered. There are also some quizzes to try as well!</p><p>Each lesson is short and is designed to be studied in short bite sized sections. Perfect for a coffee break or lunchtime session.</p><p><strong style=\"\">Contents and Overview of the course</strong></p><p>At the start of the course, you will learn about the accounting equation and how it impacts the Balance Sheet. In particular you will learn about assets, liabilities and capital. </p><p>We devote a whole section of the course to double entry bookkeeping and we learn the rules using a number of different transactions to illustrate how the double entry rules work, as well as how they impact  the Balance Sheet. </p><p>Later in the course you will learn the differences between revenue and expenses and you will see how these are shown within a Profit and Loss account, but perhaps more importantly you will understand the double entry rules associated with them.</p><p>We use T accounts to illustrate how the debit and credit entries are applied to each account, using a series of transactions to demonstrate the rules. Finally having shown you how to balance off these accounts, you are shown how to create a Trial Balance.</p><p>The Trial Balance that you prepare will then enable you to create both a Profit and Loss account and a Balance Sheet. There are worksheets in every section to check your knowledge as you progress through the course.</p><p>From a practical perspective, we also show you how to prepare a bank reconciliation and how to maintain a cash book, including a petty cash book.</p><p>Finally, we provide you with some bonus materials which include checklists for monthly accounts as well as templates for petty cash vouchers.</p><p>This course focuses entirely on manual bookkeeping methods but since double entry bookkeeping is the foundation of all accounting transactions, then this is a very good place to start. Most people these days use a computerised accounting system, but the processes are exactly the same. It is better for you to understand the basic principles surrounding accounts because then you will realise what entries are being posted within a computerised accounting system. Also when you fully understand double entry bookkeeping, you will be able to confidently write journals when adjustments need to be made within the accounts.</p><p><strong style=\"\"><br style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Bitesize Bookkeeping for busy people", 
    "price": "20.00", 
    "instructors": "Jane Kelly", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101038_4ecf_3.jpg", 
    "course_url": "https://www.udemy.com/bitesize-bookkeeping-for-busy-people/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-03T15:01:56Z"
}