{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Bloomberg Market Concepts (BMC) is an educational program that teaches the history and mechanics of the financial markets using insights from the Bloomberg Terminal. </p>\n\n<p><strong>BMC was specifically made for avid investors and people who are interested in understanding the dynamics of the financial markets. The course emphasizes a practitioner's approach to understanding the financial markets, utilizing tools and data primarily accessible to institutional investors and traders (i.e. data, news, and analytics from the Bloomberg Terminal). </strong><strong>If you have access to the Bloomberg Terminal, it may be helpful to follow along, but it is not necessary to grasp the content.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In this course, you will learn the pillars of the world economic markets: Economic Indicators and Currencies. </p>\n\n\n\n\n\n\n\n\n\n<p>First, we will cover the main economic indicators that investors follow and explain how to interpret them to help forecast the market. You will learn: </p>\n\n\n\n\n\n\n\n<ul><li>The importance of GDP to investors and how they monitor and forecast GDP</li><li>How to use economical indicators to gauge the health of the economy</li><li>The qualities of good economic indicators and the 5 main indicators to forecast the US market.</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Second, we will cover how the world currency markets operate and explain the three main drivers of currency valuation. You will learn: </p>\n\n\n\n\n\n<ul><li>How economic surprises influence and move the currency markets </li><li>How central banks protect from inflation and deflation </li><li>How investors and businesses manage currency risk</li></ul>\n\n\n\n\n\n\n\n\n\n<p>We hope you enjoy this introduction to the financial markets and find value in seeing the world economy via the Bloomberg Terminal. </p>", 
    "end_date": null, 
    "title": "Bloomberg Market Concepts: Economic Indicators & Currencies", 
    "price": "50.00", 
    "instructors": "Bloomberg LP", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/863978_2ae2_5.jpg", 
    "course_url": "https://www.udemy.com/bloomberg-market-concepts-economic-indicators-currencies/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-30T19:27:52Z"
}