{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The course is about bookkeeping systems - how the manual accounting records (namely the books of prime entry) interrelate with each other and we compare this to the alternative option of using a computerised system - we look at Quickbooks desktop.  </p>  <p style=\"\">  \t  Whether you are in an office or work from home - you&#039;ll need to make a decision as to which bookkeeping system (manual or computerised) will be most appropriate for you. We explain bookkeeping terminology such as assets, liabilities, income and expenses, books of prime entry – sales ledger, purchase ledger, nominal ledger, bank account, petty cash, journals - and where these items are found in an accounting system.  </p>  <p style=\"\">  \t  If you understand the mechanics behind a manual accounting system, then you’ll be able to understand literally any computerised accounting system because the principal will be the same. Many people jump straight into a computerised system without the understanding of what is really going on behind the scenes – this course will help you to understand about bookkeeping systems – manual and computerised.  </p>  <p style=\"\">  \t  The course will take approx 1 hour to complete.  </p>  <p style=\"\">  \t  It&#039;s an ideal course if you are working in the accounts / finance department and/or if you are thinking of embarking on a career in accountancy or bookkeeping and part of your requirement is to do the books, organise yourself and set up a bookkeeping system and report back to the owners of the firm. If you’ve always wondered how the manual system relates to the computerised system (or vice versa), then this course will help.  </p>  <p style=\"\">  \t  The course includes a booklet. The structure is a video lecture - you follow along with the booklet.  </p>  <p style=\"\">  \t  If you are thinking of starting your own business and want to understand what is required to set up a bookkeeping system then this course is for you.  </p>", 
    "end_date": null, 
    "title": "Bookkeeping Systems", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304414_b1d3_2.jpg", 
    "course_url": "https://www.udemy.com/bookkeeping-systems/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T20:32:29Z"
}