{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">The course is about how to do a bank reconciliation on excel and how to complete a UK VAT return on excel.</p><p style=\"\">We&#039;ll cover terminology such as bank rec, nominal codes, VAT (codes and rates). Plus we&#039;ll look at how to take these figures to prepare a simple profit and loss account.</p><p style=\"\">The course will take approx 1 hour to complete.</p><p style=\"\">The course is structured in such a way to show you how to do bookkeeping using an excel template. This template is included to download so that you can have a go at using this yourself.</p><p style=\"\">The template is a cashbook, and the bookkeeping is done on a cash basis. The template is in the form of a Microsoft Excel spreadsheet, version 2003, thus you will need Excel 2003 or a newer edition (2007, 2010...) in order to open the spreadsheet.</p><p style=\"\">Once the bookkeeping is done, these figures can then be used to complete the VAT return. The VAT return is based on the UK laws and rules. The course shows you how to use the figures to do the VAT return.</p><p style=\"\">The template has codes embedded which are the nominal codes. The course covers what nominal codes are and how they work with the template.</p><p style=\"\">There is a worked example of a bank reconciliation.</p><p style=\"\">It&#039;s an ideal course if you are working in the accounts / finance department and/or if you are thinking of embarking on a career in accountancy or bookkeeping and part of your requirement is to run the VAT return or do the bank rec and report back to the owners of the firm.</p><p style=\"\">If you are thinking of starting your own business and want to understand how to do a bank rec and VAT on excel, then this course is for you.</p><p style=\"\">If you have already began a business, and want a simple, effective method to do your bookkeeping - then this course is for you.</p><p style=\"\">You need to know how to navigate around excel - a basic level of competence is needed. The template is sufficient for you to use in your own business. If you&#039;re comfortable with excel and prefer to do your books on this system, and not a specific accounting software, then you&#039;ll find this course useful.</p>", 
    "end_date": null, 
    "title": "Bookkeeping Made Simple", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302456_a7eb_6.jpg", 
    "course_url": "https://www.udemy.com/bookkeeping-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T22:08:40Z"
}