{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      The course is about how to calculate the break even point (in terms of units of sale and also in terms of financial sales targets) and it covers how to estimate the sales. The course shows you how to calculate the breakeven point using a calculation and also using a graph.  </p>  <p>  \t    We look at the different types of costs within a business - fixed costs, semi variable costs, variable costs and the profit margins on units of sale. The costs to produce a product or service will effect how we price that product / service, so we also cover this. This is called the &#039;pricing decision&#039;.  </p>  <p>  \t    We cover what needs to go into making a pricing decision for a product, pricing strategy and how it affects the marketing efforts and the various pricing options available to a business. The accountant and the marketeer will have a different view on pricing - we look at them both.  </p>  <p>  \t    There are videos which explain the concepts of breakeven, pricing, breakeven point, breakeven analysis and sales forecasting.  </p>  <p>  \t      The course will take approx 1 hour to complete.  </p>  <p>  \t      It&#039;s  an ideal course if you are working in the accounts / finance department  and/or if you are thinking of embarking on a career in accountancy or  bookkeeping and part of your requirement is to do the management accounts, make pricing decisions and  report back to the owners of the firm.  </p>  <p>  \t      If you are thinking of  starting your own business and want to understand your numbers better and at what point your business is doing well, and how you can improve  upon those numbers, then this course is for you.  </p>  <p>  \t    Also, if you are studying accounts or marketing and you have a module on breakeven or pricing then this will be a handy additional resource for you.  </p>  <p>  \t    The materials which you can download include the handbook for the course. The videos explain the material in the handbook. You can then apply this to your own situation if you run your own business, or to solve a business problem if you are studying breakeven points in other areas.  </p>", 
    "end_date": null, 
    "title": "Breakeven Analysis and Pricing", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304420_5077_2.jpg", 
    "course_url": "https://www.udemy.com/breakeven-analysis-and-pricing/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T20:37:24Z"
}