{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Begin your investment plan with a proven approach that you can easily understand and implement. Ron DeLegge's Udemy course has already been taken by more than 150 students in 15 different countries. </em><br><br>LATEST UPDATE: This course was just updated with a brand new Q&amp;A session between students and Ron DeLegge. If you have <em>ANY</em> investing questions, this is the right place to ask them!</strong></p>\n\n<p>Do you want an investment portfolio that's easy to manage and helps you to reach your financial goals? To do this it's critical that you don't just build a portfolio of investments -but <em>grow</em> and <em>protect</em> it. And this course will help you to accomplish that!<br></p>\n\n\n\n<p>Why do some people have impressive and very large portfolios that are built rock solid, while the vast majority don't? How did the successful investors get that way and what are they doing differently? </p>\n\n\n\n<p>It's quite simple - and there's a few easy steps you can take...but let's be honest - Wall Street and your local financial advisor don't really care about you and besides that, they're not good at explaining things in plain English, right? </p>\n\n\n\n<p>In this course, I take you by the hand and behind the scenes to show you step-by-step everything you need to know - teaching you <em>proven</em> investing strategies that are easy and simple to implement. </p>\n\n\n\n<p>I put my 20+ years of hands-on experience in the financial services industry to work for you!</p>\n\n\n\n<p>As the inventor of the Portfolio Report Report Card service, which has now been used to analyze and grade over $120 million in investment accounts, and as the Founder of ETFguide, I have personally helped thousands of investors just like you. </p>\n\n\n\n<p>By the end of this course, you'll have the confidence to manage your own investments and you'll know exactly where to start and what to do.<br></p>\n\n\n\n<p>+++++++++++++++++++<br></p>\n\n\n\n<p><em>...and you also get the unconditional Udemy backed 30 day money-back guarantee PLUS my personal promise that if you apply yourself, you will succeed. </em><br></p>\n\n\n\n<p><strong>How will I benefit from this course?</strong></p>\n\n\n\n<ul><li>Learn how to instantly reduce the risk of your IRA, 401(k), and other investments</li><li>Learn how to immediately cut your investing fees and taxes in half</li><li>Learn how to be 100% in control of your money at all times</li><li>Eliminate worries about saving and investing for retirement, college for kids, etc.</li><li>Save time with 3 magic steps that makes your portfolio easy to manage and understand</li><li>Substantially increase your portfolio's value many times over</li><li>Find out why you don't have to be an investing guru to make profitable decisions</li><li>Find out which funds and ETFs are the right building blocks for your portfolio</li><li>Get proven money making strategies to instantly boost your portfolio's bottom line</li><li>Get amazingly simple techniques for protecting your money from crashing markets</li><li>See why you don't need to own lots of stocks and funds to have a healthy portfolio</li><li>Spend less time managing your money and more time with your family</li><li>Get more wealth with less effort</li></ul>\n\n\n\n<p><strong><br>Who should take this course?</strong><br></p>\n\n<ul><li>Anyone who owns stocks, bonds, real estate, mutual funds, and ETFs</li><li>Anyone with a 401(k), 403(b), 457, IRA, Roth IRA, or another retirement plan</li><li>Anyone who wants timely and practical strategies for their investments</li><li>Anyone who wants to grow and protect their investments</li></ul>", 
    "end_date": null, 
    "title": "Build, Grow, and Protect Your Assets: A Step-by-Step Guide", 
    "price": "50.00", 
    "instructors": "Ronald DeLegge", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598722_ecab_5.jpg", 
    "course_url": "https://www.udemy.com/ron-delegges-crash-course-for-investors/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T22:56:29Z"
}