{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Tired of the same\nold \"personal finance for dummies\" advice? Fed up with\nhigh-fees, low-return mutual funds? Are you ready to build a\ncustomized asset portfolio like the experts? Is it time to super-charge your finances to finally reach your goals?</p>\n\n<p>Bulletproof Personal Finance: Expert Asset Allocation is your solution!</p>\n\n\n\n\n\n<p>The average person today completes twelve-to-sixteen years worth\nof formal education and graduates with no useful information\nregarding personal finance or money management. This leaves the\naverage person with a predicament as they progress in their career:\nwhat should I do with my money? Where should I go to learn actionable\npersonal financial strategies? \n</p>\n\n\n\n\n\n\n\n<p>This course was written to answer those questions and fill that\nvoid. Bulletproof Money Management will show you how to construct a\ncustomized asset allocation model, and how to integrate each asset\nclass into your portfolio. The course will walk you through several\nscreencasts to demonstrate this where necessary.</p>\n\n\n\n\n\n\n\n<p>All of the concepts presented in this course are rooted in a\nfundamental understanding of money, economics, and current\nmacroeconomic trends based upon years of independent research. These\nconcepts are more than abstract theory, however; they are the\nstrategies used by the instructor to build a sustainable asset\nportfolio and quit his job within five years time. \n</p>\n\n\n\n\n\n\n\n<p>Keep in mind, there are no get-rich-quick schemes. This course is\ndesigned with proper risk management techniques in mind. The number\none rule of money management is: don't lose money. Remember –\nopportunities are endless, but capital is finite. As such, this\ncourse best suited for self-disciplined people with a long-term\nperspective.</p>\n\n\n\n\n\n\n\n<p>Bulletproof Personal Finance is clear, concise, and to the point -\nyou won't find any hype or filler here. To add additional value to\nthis course, the instructor is completely willing to answer any and\nall questions you may have as you go through the material as well.</p>\n\n\n\n\n\n\n\n<p>Do not take a backseat when it comes to your own finances. Learn\neverything you need to know to build a customized asset portfolio\nlike the pro's by enrolling in <em>Bulletproof Personal Finance</em>\ntoday!</p>", 
    "end_date": null, 
    "title": "Bulletproof Personal Finance: Expert Asset Allocation", 
    "price": "20.00", 
    "instructors": "Joe Withrow", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757450_5abf_2.jpg", 
    "course_url": "https://www.udemy.com/bulletproof-personal-finance-expert-asset-allocation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T18:17:07Z"
}