{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The whole point of running a business is to make a profit. But the only way to know if you are actually making a profit is to understand your management accounts. Most managers and business owners don&#039;t like to admit it, but business accounts can seem very confusing. So they leave it to their accountant to figure out how the business is doing.  </p>  <p style=\"\">  \t  They get their profit and loss account and file them away with that thing called a balance sheet without even understanding what those documents are telling them. Instead they just look at how much money is in the bank and hope that if they generate enough turnover then there must be some profit in their somewhere.  </p>  <p style=\"\">  \t  But how do you know which products or services are making you money and which are actually costing you money? I love gut feelings, but I trust the numbers and you should as well.  </p>  <p style=\"\">  \tYou see your business accounts are actually very simple. At the simplest level business involves money coming in - that&#039;s your revenues - and money going out - that&#039;s your costs. Your accounts simply show where the money came from and where it went. And more importantly how much money you have left!  </p>  <p style=\"\">  \t  To run a successful business it&#039;s vital that you know what your break even figures are for each revenue stream you operate. That way you will know which ones to promote more and which ones to ditch! To do that you first need to split up your costs into the right categories and apply them in a methodical way to your price calculations.  </p>  <p style=\"\">  \t  If you don&#039;t know the difference between your mark-up and your margin or  think that depreciation is just about keeping track of what your assets  are worth, then this course is for you. But I want to take you beyond the basics and show you how to read your accounts and how to work out the key financial ratios for your business.  </p>  <p style=\"\">  \t  You need to know how to construct your cash flow forecast, know what figures to leave out of your profit and loss statement - and which ones to put in - and how to demystify your balance sheet.  </p>  <p style=\"\">  \t  But once you know how to do it, that doesn&#039;t mean you need to do them. What it does mean is that you will be able to make better use of your accountant. They usually charge by the hour and if you are going to get your money&#039;s worth then you need to know which ratios you want them to give you and what they mean for your business.  </p>  <p style=\"\">  \t  Learn why terms such as  ROCE and EBITDA are actually very simple and why you should know what they mean for your business. Learn why you need to stop looking at the numbers and get to know your financial ratios. Your business accounts contain huge amounts of information about how a business is performing - if you know how to read them. And understanding them can often mean the difference between bankruptcy and growing a prosperous business.  </p>  <p style=\"\">  \t  So now, for less than the cost of an hour with an average accountant you can have the knowledge you need to make sense of your accounts and have productive meetings with your accountant. In business, ignorance is never bliss. And that is especially true when it comes to your accounts. So sign up to this course today and learn how to use the numbers to build a better business.  </p>", 
    "end_date": null, 
    "title": "Business Accounts For Managers", 
    "price": "40.00", 
    "instructors": "Eric Sutherland", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46933_fd23_6.jpg", 
    "course_url": "https://www.udemy.com/business-accounts-for-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-22T07:54:42Z"
}