{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>&quot;Business Banking 101, everything you ever wanted to know about betting a bank loan&quot; is designed as a road map for anyone tasked with securing bank financing for a business. Your instructor, Bruce Tretzen, has been in the commercial lending industry since 1999 and currently works as a business banker in Seattle. He has created this course based on real-life experiences working with business clients.</p><p>This course gives insight into what banks look for and how to increase your odds of being approved for a bank loan. These tips, tricks, and resources will help a business owner analyze their financial condition prior meeting with a bank. You will even learn how to choose the right bank to fit your business needs.</p><p>At the end of this course you will know how to present your loan request to a bank in a clear concise way. You will impress your banker by giving them the financial information they want before even asking for it. In addition, you will know how to negotiate for the best possible rate and terms. </p><p>If you are a business owner, accountant, CPA or consultant, this course will expand you business banking knowledge as you learn the secrets of business banking. This course is especially valuable to new business owners who have never applied for a business loan from a bank. Or perhaps you are thinking about starting a business and wonder if you even qualify for a bank loan. You will even learn about options available if your loan request is denied.</p><p>I invite you to step inside my classroom and learn how to negotiate like a business banker.</p>", 
    "end_date": null, 
    "title": "Business Banking 101", 
    "price": "25.00", 
    "instructors": "Bruce Tretzen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/462474_dad9_2.jpg", 
    "course_url": "https://www.udemy.com/business-banking-101/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-29T23:23:12Z"
}