{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">SECTION I - BUY A CALL OPTION (CHIPOTLE MEXICAN GRILL)</strong>  </p>  <p>  \t Buying a Call Option is the most basic of all the Option strategies and is the most efficient strategy to optimize a bullish outlook on a stock. In this course, we take the example of Chipotle Mexican Grill (CMG) and show how the trade played out. We analyze the rationale behind entering the trade, the risk/reward profile, chart analysis and point of entry, choice of expiry and &quot;moneyness&quot; of the Option, time decay considerations, margin requirements, profit expectations, exit criteria, Greek analysis, its Profit and Loss profile and various other considerations. We provide a 360-degree analysis before trade entry. This is a real trade and over 15 days, and we navigate the trade to its exit point.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>When should you consider a Stock for a Long Call position</li>  \t<li>What are the criteria for good entry</li>  \t<li>What are the Implied Volatility and time decay considerations</li>  \t<li>What should we look for in terms of changes in Implied Volatility</li>  \t<li>How do we analyze the Pilot&#039;s &quot;map&quot; - the Profit and Loss graph</li>  \t<li>Which Option strike price should we choose to optimize our position</li>  \t<li>Which Option series should we choose when buying call options</li>  \t<li>When do we exit - what is a good profit point</li>  \t<li>What external market considerations should we watch for</li>  \t<li>Understand the ROI (Return on your investment) metrics of a trade</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t<strong style=\"\">SECTION II - BUYING A PUT OPTION (FXE EURO ETF)</strong>  </p>  <p>  \t Buying a Put Option serves two purposes - exploit a bearish move in the stock or be the ultimate protector of your stock. In this part of the course, we take the example of the Euro ETF (FXE) and show how the trade played out in about 25 days time. We analyze the rationale behind entering the trade, the risk/reward profile, chart analysis and point of entry, choice of expiry and &quot;moneyness&quot; of the Option, time decay considerations, margin requirements, profit expectations, exit criteria, Greek analysis, its Profit and Loss profile and various other considerations. We provide a 360-degree analysis before trade entry. We show you how to &quot;let your winners run&quot; in a controlled manner.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>When should you consider a Stock for a Long Put position</li>  \t<li>What are the criteria for good entry</li>  \t<li>What are the Implied Volatility and time decay considerations</li>  \t<li>What we should for in terms of changes in Implied Volatility</li>  \t<li>How do we analyze the Pilot&#039;s &quot;map&quot; - the Profit and Loss graph</li>  \t<li>Which Option should we choose to optimize our position</li>  \t<li>When do we exit - what is a good profit point</li>  \t<li>What external market considerations should we watch for</li>  \t<li>Understand the ROI (Return on your investment) metrics of a trade</li>  \t<li>How should we scale out of a hugely profitable position</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t<strong style=\"\">SECTION III - STRATEGY AND OPTIMIZATION</strong>  </p>  <p>  \t The Option strategy optimization course brings all the 4 Options strategies together. The 4 strategies are comprised of 2 bullish and 2 bearish strategies, but how and when should we choose a particular strategy over the other. We create a helpful &quot;4 strategies box&quot; to distinguish and connect one strategy to the other. Most importantly, what are all the considerations before we choose a strategy. Our choice of strategy depends not only on what the stock is currently doing, but also on various market externalities as well as a few key Option metrics like Implied Volatility. This course also provides a sneak peek into advanced Option topics like the VIX (Fear index&quot;), trade simulation as well as trade adjustment parameters.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>How to differentiate between the 2 bullish and 2 bearish strategies</li>  \t<li>If you were bullish, would you choose a Long call or Short Put</li>  \t<li>If you were bearish, would you choose a Long Put or a Short Call</li>  \t<li>Why our outlook on the trade is the most important consideration</li>  \t<li>What are the Implied Volatility and time decay considerations</li>  \t<li>Which Option should we choose to optimize our outlook</li>  \t<li>What external market considerations should we watch for </li>  </ul>  <p>  \t<span class=\"Apple-style-span\"><strong style=\"\"><br style=\"\">  \t </strong></span><span class=\"Apple-style-span\"><strong style=\"\">SECTION IV - SINGLE OPTION ADJUSTMENTS</strong> </span>  </p>  <p>  \t<br style=\"\">  \t  This course studies the need for Option adjustments, and why adjustments are as critical to the success of your position as good entry or analysis. We consider all the four basic strategies - the Long Call, Short Call, Long Put, and the Short Put and look at various adjustments to these positions if they get into trouble. Every investor has a &quot;pain point&quot; - this is the point at which they adjust their position. Applying a rigorous approach to this pain point enables investors to control risk while maximizing the opportunity to profit. The course also discusses various details like early adjustments, over-adjusting and adjusting profitable trades as well as the importance of the investor&#039;s outlook for the stock when considering adjustments.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>What are adjustments and why do we need to adjust positions</li>  \t<li>Why adjustments are a feature of Options that should be taken advantage of</li>  \t<li>What are the considerations for making a good adjustment</li>  \t<li>Are adjustments different for different strategies</li>  \t<li>Sneak peek into &quot;Option Spreads&quot; - the focus of Module III</li>  \t<li>How much of an adjustment should we make</li>  \t<li>What is over-adjustment and why we should try to avoid it</li>  \t<li>How should we adjust when our outlook for the stock changes</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">This is Course III of a 4-course step-by-step program to achieving Options mastery. </strong>  </p>  <p>  \tCourse I - Introduction to Options<a href=\"http://optiontiger.com/category/473/options-beginner/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> - Learn about <a href=\"http://optiontiger.com/course/call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Call Options</a> and <a href=\"http://optiontiger.com/course/put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> is a detailed step-by-step explanation of Options, Call Options and Put Options with theory and practical application with Apple (AAPL) Options  </p>  <p>  \tCourse II - Options Foundation - <a href=\"http://optiontiger.com/course/time-decay/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Time Decay</a>, <a href=\"http://optiontiger.com/course/implied-volatility/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Implied Volatility</a> and <a href=\"http://optiontiger.com/course/option-greeks/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Greeks</a>will complete your theoretical understanding of Options.  </p>  <p>  \tCourse III is Options strategies for Beginners - <a href=\"http://optiontiger.com/course/buying-call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Buying Call Options</a> and <a href=\"http://optiontiger.com/course/buying-put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> where we actually put live trades and manage them to their exit points.  </p>  <p>  \tCourse IV is on <a href=\"http://optiontiger.com/course/option-spreads-philosophy/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Spreads</a> - This is the heart of Options Trading.<a href=\"https://www.udemy.com/options-spreads-explained/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> Once you master Options spreads, you have acquired a skill that can generate consistent monthly income for the rest of your life.  </p>  <p>  \t<strong style=\"\">Please feel free to browse this page for a <a href=\"http://optiontiger.com/testimonials/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">complete list of Testimonials</a> from our clients, <a href=\"http://blog.optiontiger.com/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Blog</a> readers and <a href=\"http://www.linkedin.com/groups/Stock-Options-Trading-Group-4581863?gid=4581863&amp;trk=hb_side_g\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Linkedin group</a> members.</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Buying Call and Put Options - Options beginner strategies", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42040_7d1f_14.jpg", 
    "course_url": "https://www.udemy.com/buy-call-options-buy-put-options-trading-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-17T03:11:05Z"
}