{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>For the first time, a course that reveals the historical performance of all the classic candlestick patterns.</strong></p>\n\n<p>Candlestick charts are the number one way to present financial price data. I love them because they allow me to quickly and easily visualise the market and analyse recent price action before placing a trade.<br></p>\n\n\n\n\n\n<p>Whether it’s in a particular stock, a currency pair, or a commodity, once you know how to read candlestick charts you can very quickly gauge strength or weakness in the market of your choice.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Now, candlestick charts have been around for centuries and there are numerous books and courses that detail specific candlestick patterns. Patterns such as the shooting star, the Doji and the Hammer. </p>\n\n\n\n\n\n\n\n\n\n<p>However, most of these books and courses fail to address just how good these patterns really are.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>On this course, not only will I teach you all about Japanese candlestick charts and how to find the most popular candlestick patterns, but I will show you the historical performance of 25 of the best patterns. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In other words, I’m going to show you which candlestick patterns are the best and which ones you should pay attention to in your trading. And I'm going to show you which ones you should simply ignore.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I’ve analysed 21 different futures and forex markets, over 100 stocks and I’ve made thousands of historical trades to see which patterns produce the most profitable results. And the results are indeed surprising.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In fact, the results suggest that some patterns are not profitable at all and I present the results clearly for you to see. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>However, the results also reveal that one specific candlestick pattern is better than every other candlestick pattern that I tested. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>On this course, you’ll learn precisely which candlestick pattern that is.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’re also going to learn how to spot the candlestick patterns and how to incorporate them into your own trading and investing. Then, I put what we’ve learnt into action when I build a fully fledged trading system based on the best patterns found.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">But that’s not all you're going to get.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Because, when you take the course today, you’ll also receive a number of bonuses. </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonus 1:</strong> you'll get the A3 candlestick cheat sheet so you can quickly locate candlestick patterns by eye. You can even print this out and stick in on the wall if you want to.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonus 2:</strong> you’re going to get access to the accompanying eBook and all the tables of results.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">B</strong><strong class=\"redactor-inline-converted\">onus 3:</strong> you’re going to receive the formulas that I used to code up each candlestick pattern. If you have the back-testing program Amibroker, you’ll be able to use this code to run an exploration and scan for the latest candlestick signals on your own machine.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So, if you want to learn how the professionals use financial charts and you want to take your candlestick trading to another level, just click take this course now and let’s get started learning about Japanese Candlesticks.</p>\n\n\n\n\n\n\n\n\n\n<p>All the best of luck with your own trading and learning.</p>", 
    "end_date": null, 
    "title": "Candlestick Analysis For Professional Traders", 
    "price": "50.00", 
    "instructors": "Joe Marwood", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808506_07f3.jpg", 
    "course_url": "https://www.udemy.com/testing-candlesticks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T20:31:44Z"
}