{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   The Capital Market Immersion program provides a solid and deep introduction of the capital markets, and is designed to provide  professionals with a solid understanding of the functions and roles  played by modern financial institutions and their key lines of business,  as well as foundational knowledge of the industry’s basic products and  service functions.  </p>  <p>  \t     The program&#039;s framework consists of lectures covering 7 separate topics:  </p>  <ol style=\"\">  \t<li><strong style=\"\">The Capital Markets Road Map</strong> (Highlights the primary participants,  issuers, investors, intermediaries in capital markets, what they trade there, and the  applications to which market participants make use of the instruments and the roles they play.)</li>  \t<li><strong style=\"\">Fundamental Financial Math </strong>(Introduces you to a wide variety of calculations and  related concepts that are used by financial market participants in a plethora of applications - calculating prices, rates of return, and  yields for example.)</li>  \t<li><strong style=\"\">Yield Curve Dynamics </strong>(Covers a variety of issues relating to yield curves, their construction,  and their use in a variety of analytical applications to assess risk and  return.)</li>  \t<li><strong style=\"\">Fixed Income Securities </strong>(Introduces you to the market for fixed income securities, provides you  with a lot of details on the characteristics of fixed income securities  in general, as well as discuss specific characteristics of specific  sectors of the fixed income market - insurers, investors, and a wide  variety of concepts relating to the analysis and validation of those  securities.)</li>  \t<li><strong style=\"\">Equity Products</strong> (Introduces equities by providing an overview of the types of products,  including both direct and indirect products; and demonstrating types of  shares and exchanges, investors, diversification and volatility.)</li>  \t<li><strong style=\"\">Futures &amp; Options</strong> (Introduces derivatives in general, to demonstrate the common features of  derivatives and how they differ from other sorts of financial  instruments. Futures and options contracts&#039; key characteristics will be identified, and contract features, pricing,  applications, risk management, and hedging will be discussed.)</li>  \t<li><strong style=\"\">Interest Rate Swaps</strong> (A look at interest rate swaps in detail. First, swaps in general are  introduced, then the structure of the most common  type of interest rate swap - the fixed or floating interest rate swap - will be addressed. A variety of different structures, pricing and  valuation, and applications - both risk management and speculative - will be discussed.)</li>  </ol>  <p>  \t     In all, there are 142 total lectures (video clips) and over 24 hours of total viewable content. This program also includes supplemental PDFs as downloadable attachments that you can use to follow along with each lecture&#039;s instructor.  </p>  <p>  \t     We have assessed our clientele thoroughly in order to design a program that includes all of the necessary elements of capital markets, designed toward an approach that enables you to accomplish the key takeaway of becoming fully immersed with a high level understanding of capital market industry, products, and roles.  </p>", 
    "end_date": null, 
    "title": "Capital Market Immersion", 
    "price": "50.00", 
    "instructors": "Paul Siegel", 
    "commitment": "24.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169662_b90a_4.jpg", 
    "course_url": "https://www.udemy.com/capital-market-immersion/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T13:11:34Z"
}