{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t            Learn the importance of increasing the financial IQ of the children in your home and the necessity of implementing a financial management system they can use for the rest of their life.  </p>  <p style=\"\">  \t<strong style=\"\">Raising financially savvy kids will give them a winning edge throughout their life.</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Learn the current financial statistics of families in North America</li>  \t<li style=\"\">Learn the 5 approaches to teaching your kids about money that don&#039;t work.</li>  \t<li style=\"\">Uncover the 6 keys to raising CashKidz</li>  \t<li style=\"\">Learn about the 5 budgeting accounts for kids</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Take control of your child&#039;s financial education.</strong>  </p>  <p style=\"\">  \t      In this course I will be sharing with you my personal journey of wanting to teach my children good financial principles. During this research I found people telling me all the things that everyone does - and those things did not work. A new and better system was needed to teach my children about finances so I created CashKidz.  </p>  <p style=\"\">  \t      You will learn from my years of creating and altering this system what works, what does not work and why it is important to empower your children financially at a very young age.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \tThis course is designed for parents, grandparents and guardians of children ages 4-14 to help increase your personal financial IQ and understand the importance of teaching basic money management principles to your children.  </p>  <p style=\"\">  \tYou will learn that it is important to get started NOW teaching them about money and not leave it up to the academic education system because they are not likely to learn it there.  </p>", 
    "end_date": null, 
    "title": "CashKidz - An Introduction", 
    "price": 0, 
    "instructors": "David Senft", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/426954_b959_4.jpg", 
    "course_url": "https://www.udemy.com/cashkidz-an-introduction/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T15:56:16Z"
}