{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Course Introduction:</strong>  </p>  <p>  \t Knowledge of management accounting helps in designing the most appropriate internal financial information systems. The Management Accounting course explains how you can analyse financial statements to make the right decisions in the day-to-day activities in an organisation, which in turn will help add value to the organisation.  </p>  <h5><u style=\"\">Why Learn Management Accounting?</u></h5>  <p>  \t With the help of financial data, managers make decisions regarding day-to-day activities in the organisation. Management accounting helps in taking the right decisions. It is concerned with providing information to managers, that is, people in an organisation who direct and control its operation. Managerial accounting is manager-oriented and provides the essential data with which the organisations are actually run.<br style=\"\">  \t Management accounting is much broader than financial accounting because it includes aspects of managerial economics, industrial engineering, and management science. However, management accounting and financial accounting are part of the total accounting information system. The content of management accounting system is driven by the needs of the financial accounting system. A firm’s profitability is of interest to investors but managers need to know the profitability of individual products. The accounting system should be designed to provide total profits and profits for individual products. Hence, accounting system should be able to supply different information for different purposes.<br style=\"\">  \t Join us on this exciting journey as we learn about Management Accounting and how to apply it in organisations.  </p>  <h5><u style=\"\">Learning Plan</u></h5>  <p>  \t You are expected to spend the following effort in completing this course:  </p>  <p>  \t Activity                                           Time Spent (hrs.)  </p>  <p>  \t Read Learner Handbook                        1  </p>  <p>  \t Watch videos for all modules                 20  </p>  <p>  \t Self-Assessment Exercises                   5  </p>  <p>  \t Total                                                        26  </p>  <h5>  <p>  \t What Next?  </p>  <p>  \t This course provided you an overview of the field of Management Accounting. To gain further competency as a Management Accounting professional you would need to gain an understanding of one or more of the following areas:  </p>  <ul style=\"\">  \t<li><span style=\" color:inherit;\">Finance for Non-Finance</span></li>  \t<li><span style=\" color:inherit;\">Basic Corporate Finance</span></li>  \t<li><span style=\" color:inherit;\">Equity Research</span></li>  \t<li><span style=\" color:inherit;\">Financial Risk Management</span></li>  \t<li><span style=\" color:inherit;\">Private Equity</span></li>  </ul>  <p>  \t Management Accounting is a powerful and important field for all organisations.  To remain employable and competitive, you need to be frequently taking courses and learning about all the different aspects of Management Accounting and how they are applied across companies.  </p>  </h5>  <h5><br style=\"\">   </h5>  <h5></h5>  <h5></h5>", 
    "end_date": null, 
    "title": "Certificate Program In Management Accounting", 
    "price": "50.00", 
    "instructors": "Manipal  Global", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192576_114b_3.jpg", 
    "course_url": "https://www.udemy.com/management-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-02T03:10:31Z"
}