{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Course Introduction:</strong>  </p>  <p>  \t  The Financial Accounting course will introduce you to the world of finance. It will explain you with the fundamentals of financial accounting concepts, principles and policies. It will also explain the concepts of double entry accounting and what subsidiary books are and show you how to create a trial balance and the final accounts.  </p>  <p>  \t<strong style=\"\">Why Learn Financial Accounting?</strong>  </p>  <p>  \t  Financial accounting is the process of summarising financial data taken from an organisation&#039;s accounting records and publishing in the form of annual (or more frequent) reports for the benefit of people outside the organisation. Financial accountants are responsible for creating and issuing the company&#039;s financial statements, providing accurate and timely information to the management, and ensuring that all the regulatory reporting requirements are met. It provides valuable, accurate, and reliable information.  </p>  <p>  \t  The Financial Accounting course will introduce you to the world of finance. It will provide you with a basic knowledge of financial accounting concepts, principles and policies. It will also explain to you the concepts of double entry accounting, tell you what subsidiary books are and show you how to create a trial balance and the final accounts.  </p>  <p>  \t  Join us on this exciting journey as we learn about Financial Accounting and how to apply it in organisations. In the next few pages of the Learner’s Handbook, we will tell you more about the curriculum, duration, teaching methods and career options available to you after the completion of this course.  </p>  <p>  \t<strong style=\"\">Learning Plan</strong>  </p>  <p>  \t  You are expected to spend the following effort in completing this course:  </p>  <p>  \t  Activity                                      Time Spent (hrs.)  </p>  <p>  \t  Read Learner Handbook                   1  </p>  <p>  \t  Watch videos for all modules           20  </p>  <p>  \t  Self-Assessment Exercises             5  </p>  <p>  \t  Total                                                  26  </p>  <p>  \t<strong style=\"\">What Next?</strong>  </p>  <p>  \t  This course provided you an overview of the field of Financial Accounting. To gain further competency as a Finance professional you would need to gain an understanding of one or more of the following areas:  </p>  <p>  \t  Management Accounting  </p>  <p>  \t  Finance for Non-Finance  </p>  <p>  \t  Basic Corporate Finance  </p>  <p>  \t  Equity Research  </p>  <p>  \t  Financial Risk Management  </p>  <p>  \t  Private Equity  </p>  <p>  \t  Financial Accounting is a powerful and important field for all organisations.  To remain employable and competitive, you need to be frequently taking courses and learning about all the different aspects of Finance and how they are applied across companies.  </p>", 
    "end_date": null, 
    "title": "Certificate Program in Financial Accounting", 
    "price": "50.00", 
    "instructors": "Manipal  Global", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192724_5db7_5.jpg", 
    "course_url": "https://www.udemy.com/certificate-program-in-financial-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-02T11:22:57Z"
}