{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to Certificate in MYOB AccountRight Course 2016</p>  <p><strong>What is Certificate in MYOB AccountRight Course 2016?</strong></p>  <p>Certificate in MYOB AccountRight Course 2016 is a proven MYOB and Accounting course designed to teach you the essential of double entry accounting or bookkeeping system as well as MYOB AccountRight Premier Version 2016 step by step from basic to advance level through video lectures and supplementary resources. Based on our research and client feedback, it is the first MYOB course that integrates both MYOB &amp; Accounting skills to give you all the necessary knowledge and skills required to be successful in managing real business accounts in your business or at your workplace if you are working for an employer.</p>  <p><strong>What does this course cover?</strong></p>  <p>The course covers the following courses:</p>  <ol><li>Accounting for absolute beginners course </li><li>MYOB Setup course-basic level</li><li>MYOB day-to-day transaction course-Intermediate level </li><li>MYOB Advanced course-Advance level</li></ol>        <p>For full course topics and contents, refer to the course outline file.</p>  <p><strong>What are the benefits of this course?</strong></p>  <ul><li>You learn form an experienced and qualified accountant and MYOB, XERO &amp; Payroll Certified Trainer</li><li>You have answer for all exercises to make sure you are doing right before you move on to the next exercise </li><li>You become a confident MYOB user in just 4 weeks</li><li>You gain great accounting knowledge and skills</li><li>You obtain great business insight</li><li>You learn MYOB in a step by step manner from scratch</li><li>You increase your employment chance</li><li>You work with real business and accounting data to learn MYOB</li><li>You receive FREE ongoing instructor support both during your course and long after you finished your course</li><li>You receive a completion certificate</li><li>You save more than $1200 so it is great value for money </li></ul>                      <p><strong>How this course is taught?</strong></p>  <p>Unlike other training providers, I don’t believe in teaching in isolation, use of random and unrelated examples and more importantly, I don’t make unnecessary and dangerous assumptions about my learners. Instead I endeavour to deliver my teaching in a holistic, integrated, interactive and enjoyable manner. The course uses real business data from the very beginning right through to end so that you learn the entire accounting and MYOB process through clear and real business examples and follow the model answer for all exercises covered in this course.</p>  <p><strong>What should you enrol in this course?</strong></p>  <ul><li>You get 10 times more contents </li><li>MYOB &amp; Accounting skills are highly-sought-after skills and in high demand</li><li>MYOB is used by over 1.2 million businesses in New Zealand and Australia alone</li><li>You learn both MYOB &amp; Accounting in the same course for the same price</li><li>You increase your employment chance</li><li>You can get job with higher pay</li><li>You don’t need to have any previous accounting or MYOB knowledge to enrol in this course</li><li>The course suits all skill levels</li><li>You become a confident MYOB user</li><li>You get 4 courses for a fraction of the price of one course</li><li>You receive Instructor’s FREE ongoing support both during your course and long after you finish your course</li><li>You have a 30 days money back guarantee so what have you got to lose?</li></ul>                          <p>Don’t take my words for it, watch the testimonial video to find out what my clients says about my courses.</p>          <p><strong> Enrol now to discover how you can become a confident MYOB user in just 4 weeks and achieve your certificate in MYOB AccountRight Premier 2016 plus rip all the benefits this course has to offer for just $49.</strong></p>  <p><strong> </strong></p>", 
    "end_date": null, 
    "title": "Certificate in MYOB AccountRight Premier 2016 Course", 
    "price": "50.00", 
    "instructors": "Abdullah Hussaini", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725872_2304_2.jpg", 
    "course_url": "https://www.udemy.com/certificate-in-myob-accountright-premier-2016-valued-1250/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T17:53:46Z"
}