{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is a series of short lectures which will answer a students queries regarding the CFA program. </p><p>Many a times, it's seen that students are either not aware about the higher studies avenues available in Finance field or they are confused about certain programs.</p><p>CFA is considered a Gold standard in the Investment Industry and it is a global certification which is well recognised and rewarded. However, it's also a difficult goal to achieve and it's exam pattern and course of study are very different than most other courses and certifications. </p><p>Students may be better positioned to complete this program if they had more information about it, while such information is widely available on the Internet and even on the CFA official website, in no one place are all the answers of CFA aspirants consolidated. </p><p>I have therefore, launched this course to bridge this gap. Through this series of short videos, the student can get all the information they seek regarding the CFA program in a very short span of time and in one place.</p><p>The course is split up in two sessions, one for those who are indecisive about the CFA program and the other for those who have decided to go ahead with it.</p><p>To help you decide whether or not to do CFA by helping them answer questions such as What is CFA, Why Should you do CFA? Is CFA the right course for you?, What does it take to do CFA?, CFA Structure and course of Study and Historical pass rates.</p><p>Once you have decided to pursue CFA then you would like to know the Structure of each level exam, Prep guidelines for Each Level, Tips for taking Each Level exam and the like.<span></span></p><p>This is a very interesting and informative series which will help finance students immenesly! </p>", 
    "end_date": null, 
    "title": "CFA: Fast Track your career in Finance", 
    "price": "20.00", 
    "instructors": "Tanuja Yadav", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619296_c5aa_2.jpg", 
    "course_url": "https://www.udemy.com/cfapreparebetter/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T14:25:37Z"
}