{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Looking for a way to bring the CFA Level I curriculum to life?  </p>  <p style=\"\">  \t      Let AFT&#039;s expert tutors break down the Study Sessions into easy-to-digest video lectures.  </p>  <p style=\"\">  \t      Our charterholder faculty have been preparing  candidates for the CFA exams for over 15 years, and every one of our  tutors knows what it’s like to balance work with the demanding CFA  exams. Our Tutors will help you make the most of your revision time  with this comprehensive set of video lectures.  </p>  <p style=\"\">  \t      Who takes the CFA exams?  </p>  <p style=\"\">  \t   The CFA charter is an  elite designation. It is considered the gold standard within the  investment profession, and its typical candidates include fund managers,  analysts, investment bankers, portfolio managers and traders. The  designation is career-enhancing, well respected, credible, globally  recognised and globally relevant.  </p>  <p style=\"\">  \t      What does the Level I Portfolio Management curriculum cover?  </p>  <p style=\"\">  \t      How does the Level I exam work?  </p>  <p style=\"\">  \t  The Level I exam is  held twice a year, in June and December, at a number of test centres  around the globe. At Level I, the exam consists of two 3-hour multiple  choice papers, each containing 120 questions, which are both taken on  the same day. The exams are administered by CFA Institute, the leading  global association of investment professionals, who recommend candidates  spend a minimum of 300 hours preparing for each Level.  </p>", 
    "end_date": null, 
    "title": "CFA® Level 1 2014 – Portfolio Management", 
    "price": "40.00", 
    "instructors": "Academy of Financial Training AFT -", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/410576_366c.jpg", 
    "course_url": "https://www.udemy.com/portfolio-management-cfa-level-1/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T06:08:07Z"
}