{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you currently a certified coach but business finance and operations scare you so you stay small instead of building a booming coaching business?  If you want to learn a simple step-by-step approach to</strong> business finance and operations basics, you are in the right place! <strong>Course updated March 28, 2016!</strong></p>\n\n<p><strong>Coaching Business Basics: Business Finance and Operations is for you if:</strong></p>\n\n\n\n\n\n<ul><li>You have been certified as a Coach but you struggle with business finance and this impacts your income.  You see the potential of learning how to run a business but need the best insight for how to get started.</li><li>You are ready for life as a small business owner but just need to know the business finance and business operation foundation pieces so you feel more confident with your decision to start a business.</li><li>You want practical business operations strategies and business finance advice that have already been tested, proven and used by others.</li><li>You would like creative yet logical ways on running a coaching business that most profitable small businesses follow.</li><li>You would like to know how you can increase your business profits without working 90 hours a week.</li><li>You are committed to following through with what you're about to learn.</li></ul>\n\n\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n\n\n<p><strong>Why Take Coaching Business Basics: Business Finance and Operations?</strong></p>\n\n\n\n\n\n<p>This is why you are here because you want to learn business finance and business operations without having to take a PHD level course - you're too busy!</p>\n\n\n\n\n\n<p>You want to know how to run a business so you make a great profit, enjoy a great life without being frazzled by paperwork and numbers. </p>\n\n\n\n\n\n<p>Now keep this in mind. Every piece of business finance advice, business operations strategies and logical approach to running a business has been tested; none of this is theory. </p>\n\n\n\n\n\n<p> I understand how to run a business; both a home-based business and a franchise business plus I have worked at a bank so I understand business finance.  </p>\n\n\n\n\n\n<p>You are receiving training from someone who understands plus lives this life on a daily basis.  I make it easy and simple.  Here is a brief sampling of what you'll learn:</p>\n\n\n\n\n\n<p><strong>What is covered in  Coaching Business Basics: Business Finance and Operations Course?</strong></p>\n\n\n\n\n\n<ol><li>In <strong>section 1</strong> you learn the #1 success strategy that most small business owners never implement.  Once you know this, you can build a solid framework that makes everything else in your business run smooth.</li><li>In <strong>section 2 </strong>you discover How to Run a Business Like a Pro.  You will learn how to run a business including the first steps to running a business that most small business owners don’t consider yet are necessary for your business to be profitable. </li><li>In <strong>section 3</strong> you get the Business Finance Simplified Strategies.  You will learn easy business finance foundation pieces that most small business owners don’t know yet can cause small business failure; you discover the business finance know-how for profits</li><li>In <strong>section 4 </strong>you get the Business Operations Simplified System.  You will discover that operating a small business can be easy and fun; you receive templates, checklists, and resources that you can use to develop a business operations manual plus much more.</li><li>In <strong>section 5</strong> you are guided through a hands-on Business Project where you will learn how to register a business plus get an easy checklist that keeps you on top of your business finances so you can focus on profits</li><li>In <strong>section 6</strong> you receive business finance coaching and consulting that gets you on track financially. You learn the business finance break-down of what should be on your business financial plan.</li><li>In <strong>section 7</strong> you will walk away with a profitable small business success plan that is simple to follow and implement.</li></ol>\n\n\n\n\n\n<p>****************************************************************************************************************</p>\n\n\n\n\n\n<p><strong>How will Coaching Business Basics: Business Finance and Operations Course Benefit You?</strong></p>\n\n\n\n\n\n<p>I know you are busy and I have meticulously created this course with your success in mind. This training is no-fluff essential information you need to succeed easily and quickly. </p>\n\n\n\n\n\n<p>Let me show you how to run a coaching business, either part-time or full-time without sacrificing what you value. You get insights that guide you past business finance mistakes. </p>\n\n\n\n\n\n<p>You get the inside track on what you need to do to operate a business plus what you need to plan your business growth.</p>\n\n\n\n\n\n<p>If that's something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you will have a good solid foundation to run your business easily. </p>\n\n\n\n\n\n<p>Remember,<strong> </strong>it doesn't matter if you are just starting your business or already in full swing, I've been there and I can show you how to make it happen.</p>\n\n\n\n\n\n<p><strong>When Can You Take Coaching Business Basics: Business Finance and Operations Course?</strong></p>\n\n\n\n\n\n<p>What are you waiting for? If you’re looking for a basic how to run a business course that shows you business finance and operations, then look no further.</p>\n\n\n\n\n\n<p>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</p>\n\n\n\n\n\n<p>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; NO EXTRA COST TO YOU.</p>\n\n\n\n\n\n<p>REMEMBER: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</p>\n\n\n\n\n\n<p>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</p>\n\n\n\n\n\n<p>Still not convinced? Make sure you watch some of the FREE PREVIEWS available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n\n\n<p><strong>What People Are Saying About Coaching Business Basics: Business Finance and Operations</strong> created by Louise Anne Maurice of Womanly Wealth Academy:</p>\n\n\n\n\n\n<p><em>\"Generous and Knowledgeable Instructor - One comment the instructor said has stuck with me; you can only receive in business what you are capable of dealing with so If business finances and business operations intimidate you, then your business will not grow and not make as much money as it could. Take this course if you want the simplified version of business finance and operations. The instructor has worked at a bank and understands finance plus is a business owner who understands operations. She doesn’t just tell you what to do but shows you and gives you checklists so you don’t have to reinvent the wheel.\"</em></p>", 
    "end_date": null, 
    "title": "Coaching Business Basics: Finance and Operations          ", 
    "price": "20.00", 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455120_2c6d_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-run-a-business-business-finance-operations/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T20:52:55Z"
}