{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is the most comprehensive introduction to investing for Beginners and Intermediate levels, and is suitable for people from all backgrounds. If you have between 0 and 2 years of experience in Financial markets, this course will take you up at least 3 levels higher.</p><p><strong>WHAT YOU WILL LEARN</strong></p><ul><li>First, the global \"macro\" Finance and Investment cycles and how big money is invested</li><li>Core investing principles and detailed study of all the market and stock terminology</li><li>Detailed analysis of Stocks, Investing styles, and Best Practices</li><li>A thorough comparison of <strong>Mutual Funds and ETFs - Pros and Cons</strong></li><li>Learn about the all-important <strong>Bond Markets, Interest rates and Inflation</strong></li><li>How to <strong>invest into Commodities - Gold, Oil etc</strong></li><li>Study of the <strong>Spot Forex, Forex Futures and Currency ETFs</strong></li><li>An advanced introduction to <strong>Futures and Options</strong></li><li><strong>10 Live trades on Stocks,ETFs, Bonds, Gold, Euro Futures, British Pound ETF</strong> </li><li>Live demonstration of all concepts on a Live trading platform (Practical investing)</li><li>Monitoring of positions, and trade and risk management</li><li>The Human Element - How to avoid extreme emotional points in Investing</li></ul><p><br></p><p><strong>FOUR KEY BONUS STRATEGIES FOR IMMEDIATE PROFITS</strong></p><p>This course <strong>includes FOUR key strategies for long term investors and traders</strong>. These can produce hundreds of dollars or more a month immediately after you take the courses</p><ol><li>A Low-risk high reward ETF strategy based on sector rotation</li><li>How to Buy Stocks at much lower prices that its trading for, and MAKE INCOME</li><li>If you already own stocks, this strategy will put money in your bank every month</li><li>If you think a stock is going to crash, this low-cost strategy will protect your position</li></ol><p><strong>And an additional BONUS: How to hedge your stock during Volatile Earnings events</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Comprehensive Guide to Financial Markets, Investing &Trading", 
    "price": "40.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765562_252a.jpg", 
    "course_url": "https://www.udemy.com/financial-markets-a-to-z-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T16:26:09Z"
}