{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tAccounting students and learners! I am Cliff Hendren, a Certified Public Accountant with an MBA from the University of Tennessee. I have over 5 years experience teaching online accounting classes for the major online universities. I have designed this class so you get EXACTLY what you need to be successful in your understanding of accounting. And in particular, this class is like a 24 hour, 7 day per week tutoring session for your university accounting class.  </p>  <p>  \t        The Financial Accounting Standards Board (FASB) Conceptual Framework is very challenging for accounting students because it is theory based. It is the building block of all the accounting rules that are included in Generally Accepted Accounting Principles (GAAP). By understanding the conceptual framework, you will get insight into the basis for the accounting rules. Example concepts that drive the accounting rules are:  </p>  <ul style=\"\">  \t<li>The Matching Principle</li>  \t<li>The Monetary Unit Assumption</li>  \t<li>The Going-Concern Assumption</li>  \t<li>Materiality</li>  \t<li>The Entity Assumption</li>  </ul>  <p>  \t        The course will give you everything that you need to know for the FASB Conceptual Framework, which is typically Chapter 2 of most Intermediate Accounting texts. The material presented is in a condensed format in 5 lectures so that you get everything you need to be successful in your Intermediate Accounting class.  </p>  <p>  \tYou will get videos walk throughs of homework problems with explanations, a power point presentation of all the key concepts that you NEED TO KNOW, example exam questions and a 20 question quiz with explanations that detail the concepts that YOU NEED TO KNOW. In addition, you will be able to download the PowerPoint presentation slides, download lecture notes with all the key concepts, and download the example homework problems that I have worked for you! You will have all the tools that you need to understand the FASB Conceptual Framework!  </p>", 
    "end_date": null, 
    "title": "Conceptual Framework of Accounting, YOU NEED TO KNOW for CPA", 
    "price": 0, 
    "instructors": "Prof. Kenneth \"Cliff\" Hendren", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419304_d338_3.jpg", 
    "course_url": "https://www.udemy.com/intermediate-accounting-1-chapter-2-conceptual-framework/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T14:52:11Z"
}