{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is for entrepreneurs and self employed business people who need to fill in a UK Corporation Tax return for simple UK accounts and don&#039;t have the hundreds of pounds to pay an accountant to do it for them - and want to do it themselves.</p><p style=\"\">This course will go through the CT600 tax form and give you two examples of filing in this form - page by page. The tax form is like an online questionnaire - answer the questions and the site itself will calculate your tax amount due.</p><p style=\"\">No materials are included - but we look at two limited company accounts (which are very simple and have barely traded), and fill in their first years company tax return based on the information.</p><p style=\"\">The course will tae approx 1 hour to complete. The purpose isn&#039;t to go into the theory of tax or its complications or to recite difficult ot complicated tax law - the main purpose of this course is to show you how to fill out and complete a UK Company Tax return form - specifically the CT600. The two example companies used in the course are professional services firms that have low trading activity.</p><p style=\"\">The course takes you through parts 1 to 6 of the Ct600 form. It&#039;ll give you a good overview of the answers for the form, and how to fill it in, and what figures should go where. If you want to increase your confidence in filling out your own CT600 Company Tax form, then this course is for you.</p><p style=\"\">Whilst the course tutor has a first class honours degree from Middlesex University in Accounting with Marketing and is a Fellow member of the AAT (Association of Accounting Technicians) - one cannot answer individual and personal tax return enquiries or complications. If you are in need of tax advice, we would suggest contacting a local tax accountant or your local HMRC tax office to discuss your private and personal tax affairs.</p><p style=\"\">This course aims to demystify the task of filing out a CT600 Corporation tax return form and it goes through the entire process in a speedy, non-boring way.</p><p style=\"\">We also breifly cover filing out the Companies House Annual Return - another annual administrative task which many people get charged a small fortune by their accountants to do, which they could probably do themselves.</p>", 
    "end_date": null, 
    "title": "Corporation Tax Returns UK", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/548044_28db_4.jpg", 
    "course_url": "https://www.udemy.com/corporation-tax-returns-uk/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T15:59:11Z"
}