{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The study session on Corporate Finance covers the principles that corporations use to make their investing and financing decisions. </p><p>The first reading covers capital budgeting. Capital budgeting is the process of making decisions about which long-term projects the corporation should accept for investment and which it should reject. Both the expected and required rates of return for a project should be taken into account. </p><p>The second reading explains how the required rate of return for a project is developed using economically sound methods. </p><p>The third reading discusses measures of leverage and how they affect a company's earnings and financial ratios. In managing or evaluating the riskiness of earnings, analysts and corporate managers need to evaluate operating leverage (the use of fixed costs in operations) and financial leverage (the use of debt in financing operations). </p><p>The fourth reading deals with important features of the alternative means of distributing earnings, dividends and share repurchases. </p><p>The fifth reading discusses short-term liquidity and working capital management. </p><p>The final reading in this study session is on corporate governance practices. Inadequate corporate governance can expose a company to negative effects, including damage to reputation and loss of business and market value. </p><p>With Corporate Finance done, the student will be prepared for 7% of the CFA L1 course in the shortest possible time, I am extending this delightful experience further by providing the study session for Alternate Investments free with this course so that an additional 4% of the course prep is completed!</p>", 
    "end_date": null, 
    "title": "Corporate Finance and Alternative Investment for CFA L1", 
    "price": "20.00", 
    "instructors": "Tanuja Yadav", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612528_094a_2.jpg", 
    "course_url": "https://www.udemy.com/corporate-finance-and-alternative-investment-for-cfa-l1/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-15T08:25:55Z"
}