{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>A zoom-in, zoom-out, connect-the-dots tour of Equity valuation</strong></p><p><strong>Let's parse that</strong></p>\n\n<ul><li><strong>'connect the dots':</strong> Equity valuation is conceptually complex - that's why plenty of folks mechanically follow the procedures, but don't understand the valuation they end up with. This course makes sure that won't happen to you.</li><li><strong>'zoom in':</strong> Getting the details is very important in equity valuation - a small change in an assumption, and the value output by your model changes dramatically. This course gets the details right where they are important.</li><li><strong>'zoom out':</strong> Details are important, but not always.  This course knows when to switch to the big picture.</li></ul>\n\n<p><strong>What's Covered:</strong></p>\n\n<ul><li><strong>Equity Valuation Introduced: </strong>intrinsic value, price, valuation and market capitalisation.</li><li><strong>Absolute Valuation Techniques</strong> focus on getting a point estimate of a company's intrinsic value. This is invariably done by discounting a series of cash flows projected into the future. </li><li><strong>Net Present Value and Discounting Cash Flows:</strong> NPV is a crucial concept in finance - and in life. Understand what the present value of an asset is, how it relates to the rate of return on the asset, and how risky cash flow streams are handled.</li><li><strong>CAPM, Weighted Average Cost of Capital and Required Equity Return:</strong> These are key concepts required in valuing the risky stream of cash flows that represent a company's value.</li><li><strong>Dividend Discount Models:</strong> A family of absolute value models that discount the dividends from a stock. Despite their seeming simplicity, there is some real wisdom embedded into these models. Understand them.</li><li><strong>Free Cash Flow Valuation</strong><strong>: </strong>FCF valuation is a serious valuation tool. Understand how to use it right - and when not to use it.</li><li><strong>FCFF and FCFE</strong>: The fine print on calculating Free Cash Flows to the Firm, and to Equity holders.</li></ul>\n\n<p><strong>Talk to us!</strong><br></p><p>Mail us about anything - <strong>anything!</strong> - and we will always reply :-)<br></p>", 
    "end_date": null, 
    "title": "Corporate Finance 101: Equity Valuation", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/804298_243f_2.jpg", 
    "course_url": "https://www.udemy.com/corp-fin-101-equity-valuation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-26T06:12:35Z"
}