{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This is a zoo</strong><strong>m-in, zoom-out, connect-the-dots tour of Financial Statement Analysis</strong></p>\n\n<p><strong>Let's parse that</strong></p>\n\n\n\n<ul><li><strong>'connect the dots':</strong> Financial Statement Analysis gets a bad rep because its hard to connect the nitty-gritty of the financial statements to the company as a whole. This course makes a serious effort to do exactly that.</li><li><strong>'zoom in':</strong> Getting the details is very important in corporate finance - a small typo, or a minor misunderstanding can cost a company big. This course gets the details right where they are important. </li><li><strong>'zoom out':</strong> Details are important, but not always. You probably don't care about the nitty gritty of accounting for contingent liabilities if you don't know what accounts payable are. This course knows when to switch to the big picture.<strong></strong></li></ul>\n\n\n\n<p><strong>What's Covered:</strong><br></p>\n\n\n\n<ul><li><strong>Corporate Finance Introduced: </strong>partnerships, proprietorships and the corporation</li><li><strong>The Agency Problem:</strong> How auditors, the board of directors and the capital markets regulator play a role</li><li><strong>Financial Statements:</strong> Balance Sheet, Income Statement, Statement of Comprehensive Income and Cash Flow Statement at exactly the right level of detail</li><li><strong>Ratios:</strong> Five important types of ratios: liquidity ratios, leverage ratios, turnover ratios, profitability ratios and valuation ratios</li><li><strong>Dupont's Identity:</strong> Return-on-equity can be decomposed into 3 elements: profits, asset-leanness and leverage.</li><li><strong>External Financing Needed (EFN) and the Sustainable Rate of Growth: </strong>How fast can a company grow if it chooses to forgo external funding? Every startup should know this, really.</li><li><strong>Common Accounting Shenanigans</strong>: The playbook of financial statement cheats has been studied by auditors and regulators - learn from history so you are not condemned to repeat it.</li></ul>\n\n\n\n<p><strong>Case Studies:</strong></p>\n\n\n\n<p><strong>Understanding a company entirely from its investor filings</strong></p>\n\n\n\n<ul><li><strong>Facebook</strong>: Fast-growing and profitable, this is the dream stock right now.</li><li><strong>LinkedIn</strong>: Versatile, but struggling to break through - the jury seems out on LinkedIn</li><li><strong>Twitter</strong>: Bleeding red and slowing growth - Twitter seems to be in trouble.</li></ul>\n\n\n\n<p><strong>Talk to us!</strong></p>\n\n\n\n<p>Mail us about anything - <strong>anything!</strong> - and we will always reply :-)</p>", 
    "end_date": null, 
    "title": "Corporate Finance 101: Financial Statement Analysis & Ratios", 
    "price": "20.00", 
    "instructors": "Loony Corn", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/797762_0b90_2.jpg", 
    "course_url": "https://www.udemy.com/corp-fin-101-fsa-ratios/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-19T07:00:08Z"
}