{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to Cost Accounting - A Comprehensive Study Course.</p><p>Yes! This is a comprehensive course because you are going to learn all the following in this single course:</p><p>a) Basics of Costing Accounting (22 Lectures covering Introduction to Costing, Cost Classifications and Cost Sheet)</p><p>b) Material costing (11 Lectures covering covering Basics of Material Costing)</p><p>c) Labour Costing (23 Lectures)</p><p>d) Overheads Costing (18 Lectures)</p><p>e) Standard Costing Techniques (13 Lectures)</p><p>f) Standard Costing Variances (17 Lectures)</p><p>g) Operating Costing (6 Lectures)</p><p>h) Marginal Costing(30 Lectures)</p><p>Altogether, you get to access 118 Lectures.</p><p>So, how this course is relevant for you?</p><p>If you a Professional course student in the line of Finance or Accounting, then you would have Cost Accounting as part of your major subject. This course will explain theory and practical concepts in Cost Accounting which will help you to excel in Academic Examinations.</p><p>If you are an Accounting or Finance or Cost Accounting Executive, this course will help you to brush up you basics in Cost Accounting and all the contents have immediate practical relevance and application. </p><p>With this course, you will be able to understand </p><p>-basic concepts and processes used to determine product costs;</p><p>-understand Cost Accounting Statements;</p><p>-solve simple case studies.This course is structured in self paced learning style.Video lectures were used for delivering the course content.</p><p>All the sections of this are also available as individual courses.</p><p>If you aspire to gain strong foundation in Cost Accounting, then this course is for you.</p><p>Happy Learning and Best Wishes!</p>", 
    "end_date": null, 
    "title": "Cost Accounting - A Comprehensive Study", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485889_942e.jpg", 
    "course_url": "https://www.udemy.com/cost-accounting-a-comprehensive-study/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-25T05:34:54Z"
}