{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to this crash course on Capital Budgeting Techniques.</p><p style=\"\">This course is about Tools and Techniques available for evaluating Business Investment Opportunities.</p><p style=\"\">Yes! Every business takes decisions with regard to Investments in Projects. It may be starting a New Business, Expansion of Existing Business, Modernisation, Backward and Forward Integration, etc.</p><p style=\"\">But, how those decisions are taken by the Business entities? What Financial factors are evaluated before taking those decisions?</p><p style=\"\">This course will give you overview about the process adopted.</p><p style=\"\">There are various Capital Budgeting tools available which will evaluate Investment Opportunities and would tell us whether to take up or not to take up the projects and that process is called Capital Budgeting.</p><p style=\"\">Capital budgeting is the process most companies use to authorize capital spending on long‐term projects and on other projects requiring significant investments of capital.</p><p style=\"\">Capital budgeting is also concerned with the setting of criteria about which projects should receive investment funding to increase the value of the firm, and whether to finance that investment with equity or debt capital. Investments should be made on the basis of value-added to the future of the corporation.</p><p style=\"\">Businesses should pursue all projects and opportunities that enhance shareholder value. However, because the amount of capital available at any given time for new projects is limited, management needs to use capital budgeting techniques to determine which projects will yield the most return over an applicable period of time.</p><p style=\"\">Investment evaluation tools ranges from simple Pay Back Period, Accounting Rate of Return to cash discounting tools like NPV, IRR, MIRR, Profitability Index, etc.</p><p style=\"\">Overviews covered in the course:<br style=\"\"></p><p style=\"\">NPV can be described as the “difference amount\" between the sums of discounted: cash inflows and cash outflows. It compares the present value of money today to the present value of money in the future, taking inflation and returns into account.</p><p style=\"\">IRR:</p><p style=\"\">The (IRR) is defined as the discount rate that gives a NPV of zero. It is a commonly used measure of investment efficiency.</p><p style=\"\">Need for Capital Budgeting:</p><ol style=\"\"><li style=\"\">As large sum of money is involved which influences the profitability of the firm making capital budgeting an important task.</li><li style=\"\">Long term investment once made can not be reversed without significance loss of invested capital. The investment becomes sunk and mistakes, rather than being readily rectified,must often be borne until the firm can be withdrawn through depreciation charges or liquidation. It influences the whole conduct of the business for the years to come.</li><li style=\"\">Investment decision are the base on which the profit will be earned and probably measured through the return on the capital. A proper mix of capital investment is quite important to ensure adequate rate of return on investment, calling for the need of capital budgeting.</li><li style=\"\">The implication of long term investment decisions are more extensive than those of short run decisions because of time factor involved, capital budgeting decisions are subject to the higher degree of risk and uncertainty than short run decision</li></ol><p style=\"\">COURSE REQUIREMENTS:</p><ol style=\"\"><li style=\"\">PC / Laptop / Android / iOS</li><li style=\"\">Good Internet Connection</li><li style=\"\">No Prior Knowledge is required</li></ol><p style=\"\">WHO SHOULD ATTEND?</p><ol style=\"\"><li style=\"\">Entrepreneurs</li><li style=\"\">MBA Students</li><li style=\"\">CA / CFA / CPA / CMA Students<br style=\"\"><br style=\"\">Welcome to this course and all the very best!<br style=\"\"></li></ol>", 
    "end_date": null, 
    "title": "Crash Course on Capital Budgeting Techniques", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471804_4605.jpg", 
    "course_url": "https://www.udemy.com/crash-course-on-capital-budgeting-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T11:42:10Z"
}