{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to this crash course on Cost of Capital and Capital Structuring. </p><p style=\"\">In this course, you will have overview of Cost of Capital and Capital Structure matters.</p><p style=\"\"><strong style=\"\">About Cost of Capital:</strong></p><p style=\"\">Every business raise various forms of Capital for running the business.</p><p style=\"\">None of the funds are free.</p><p style=\"\">Each fund comes with a cost.</p><p style=\"\">Every Entrepreneur, every Finance Manager should be aware of the Cost of Capital of their business.</p><p style=\"\">Many businesses fail, because the management itself would not be aware of the Cost of Capital of the business.</p><p style=\"\">Unless the returns earned from the business is greater than or equal to cost of capital, no business can sustain / grow.</p><p style=\"\">Cost of Capital is used to evaluate new projects of a company. It is the minimum return that investors expect for providing capital to the company, thus setting a benchmark that a new project has to meet.</p><p style=\"\"><strong style=\"\">About Capital Structure of Business:</strong></p><p style=\"\">All the Business entities in this world, will work on this topic.</p><p style=\"\">Because, Capital Structuring Decisions, would decide the long term stability of any business.</p><p style=\"\">Business entities can have mix of their own funds and debt funds for running their business. But the mix should be an optimum one.</p><p style=\"\">Wrong decisions in Capital Structuring would spoil the business which otherwise would have plenty scope for growth.</p><p style=\"\">The capital structuring of the business also decides the leverage and returns for the owners.</p><p style=\"\"><strong style=\"\">About this course structure:</strong><br style=\"\"></p><p style=\"\">This course is structured in self paced learning style. </p><p style=\"\">Video lectures are used for delivering course content.</p><p style=\"\">Welcome to this course and all the very best.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Crash Course on Cost of Capital and Capital Structuring", 
    "price": 0, 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471428_3ce1.jpg", 
    "course_url": "https://www.udemy.com/crash-course-on-cost-of-capital-and-capital-structuring/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T01:59:47Z"
}