{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Would You Spend An Extra 20 Minutes A Week To Retire With A Million Dollars?</p>\n\n<p>Welcome To <strong>CREATE YOUR OWN HEDGE FUND. </strong>Learn how to double your money every year.</p>\n\n<p>Learn How To Trade The SlingShot Mean-Reversion Setup And Properly Leverage Your Account For 100% Annual Gains.</p>\n\n<p>Here Is What You Get With <strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND:</strong><br></p>\n\n<ul><li>16 Lectures + 2 Screencasts Packed With 100% 'How-To' Tactics And Strategy</li><li>A Definitive Step-By-Step Blueprint For Wealth Creation</li><li>The Ultimate Guide For Trend Trading</li><li>A Tactical Strategy For Precision Setups And Risk Control</li><li>The Only Method You Will Ever Need To Harness The Power Of The Financial Markets</li></ul>\n\n<p>This course comes with a PERFORMANCE GUARANTEE: You will acquire a trading skill which will enable you to locate low-risk, high-probability trades and make consistent profits trading any market that can be charted.</p>\n\n<p>Plus you will receive prompt responses to ALL email questions and forum posts.</p>\n\n<p><strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> is brought to you by a top UDEMY Instructor and Stock Trading NINJA - voted one of \"Best Of Udemy\" 2014.</p>\n\n<p>This course will forever change the way you look at the financial markets.</p>\n\n<p><strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> takes you behind the curtain, guided every step of the way by a 20-year trading veteran who was mentored by market insiders - traders who banked massive profit month after month because they understood the game.</p>\n\n<ul><li>Learn why <em>WHAT</em> you trade is just as important as <em>HOW</em> you trade</li><li>Why most traders never make any money trading - let alone rake in a fortune</li><li>Learn a simple quantitative analysis model that will keep you laser-focused on the best markets</li></ul>\n\n<p>Knowing how to trade is not enough. You must know what to trade, how to manage it and how to stay positioned in the BIG MOVES with enough leverage to make a difference.</p>\n\n<p><strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> will teach you:</p>\n\n<ul><li>A simple quantitative analysis model - so you know WHAT to trade</li><li>A mean-reversion trading strategy - so you know HOW to trade</li><li>Advanced Account Management tactics - so you know how to leverage your investments for maximum gains</li></ul>\n\n<p>This strategy is effective in ANY market - Stocks, Forex, Commodities or any liquid 'chartable' security and time interval.</p>\n\n<p>But I will show you how to harness the awesome power of the 17 trillion dollar U.S economy and the massive institutional accumulation of growth companies.</p>\n\n<p>The age of the individual investor is long gone. The markets are dominated by big institutions: banks, billion-dollar hedge funds and program trading. This course details exactly what you need to know in order to take advantage of the market - how to detect the institutional 'footprint' which leads to enormous price appreciation.</p>\n\n<p>The secret lies in targeting securities with very unique fundamental attributes for massive potential appreciation.</p>\n\n<p>Every year there are securities which appreciate 100%, 200%, 300% or more, sometimes within just a few weeks or months. </p>\n\n<p>At any one time only about 5% of all securities even meet the minimum criteria for doubling or tripling. </p>\n\n<p>Without the knowledge of this key fundamental criteria, traders and investors have little chance of being in the big winners with enough life-changing leverage to make a difference.</p>\n\n<p>Have you ever wondered how the big hedge funds make such impressive returns?</p>\n\n<p>Learn all about mean-reversion and how to use it to take control of your financial future:<br></p>\n\n<ul><li>How to trade the SlingShot setup: the best low-risk, high-probability mean-reversion strategy</li><li>Target specific price-action patterns to tactically set up trades and control risk</li><li>Learn the 3 management objectives which enable you to take total control of the trade</li></ul>\n\n<p>With <strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> you will be trading like a Wall Street insider with a Harvard MBA.</p>\n\n<p>But it does not stop there - <strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> takes you one step further and details how to set up your trading desk with all the tools you need to simplify your investments and double your returns:</p>\n\n<ul><li>Configuring chart layouts for maximum efficiency</li><li>How to quickly and easily incorporate a quantitative analysis model right at your fingertips</li><li>How to scan, analyze and manage your trades and portfolio in just 20 minutes a week</li></ul>\n\n<p>I designed this course for the Stock, Option or Forex trader looking for a tactical, proven strategy.</p>\n\n<p>And when you finish the last lecture, you will be able to incorporate a hedge fund trading system and sound account management tactics into a simple, effective method for wealth-creation and double digit returns.</p>\n\n<p><strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> comes with a 30-DAY MONEY BACK GUARANTEE. </p>\n\n<p>If you are a trader struggling to make consistent profits or an investor frustrated by poor returns with no way to manage risk, then <strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong> is a must-have.</p>\n\n<p>Why try to learn how to trade on your own? Get a comprehensive system and trade plan you can use IMMEDIATELY to profit.</p>\n\n<p>Let a 20-year veteran of the trading game guide you step-by-step through the process.</p>\n\n<p>Enroll TODAY in <strong class=\"redactor-inline-converted\">CREATE YOUR OWN HEDGE FUND</strong>. And learn how to double your money every year.</p>\n\n<p>Includes:<br></p>\n\n<ul><li>Lifetime Access To Course</li><li>Video Module Training Center</li><li>30 Day Money Back Guarantee</li></ul>", 
    "end_date": null, 
    "title": "Create Your Own Hedge Fund - Trade Like A Wall Street Wizard", 
    "price": "20.00", 
    "instructors": "Frank Bunn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447362_3599_4.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-hedge-fund-double-your-money-every-year/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-14T17:43:04Z"
}