{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>***UPDATED FOR 2016***</strong></p>\n\n<p><strong><em>Now join the exclusive 2,050+ group of students who have changed their financial lives by taking this course to LEAVE THEIR JOB, ESCAPE THE 9-5, AND WORK FROM HOME MAKING MONEY ONLINE BUYING PENNY STOCKS!</em></strong></p>\n\n<p>If you are like the average person, you know that there is money to be made outside of just working 9-5. But the problem is you just don't know how. </p>\n\n<p>You have probably heard of people making a killing in the stock market but the problem is 90% of traders lose money.</p>\n\n<p>But that does not have to be you. Anybody can make money in penny stocks if they do it the right way. </p>\n\n<p>If you're tired to hearing about these crazy riches to be made in the markets but can't find any reliable source of information and learning to be able to share in those riches, THIS IS THE COURSE FOR YOU! </p>\n\n<p>You can be on your way to leaving your job and knowing how to make money for yourself, but not by yourself, because you can get InPennyStock expertise every step of the way.</p>\n\n<p> These are the same strategies that the 10% who make money use to make money day in and day out. </p>\n\n<p>This is the ultimate video collection that will tell you everything and we do mean everything you need to be successful in the penny stock market.</p>\n\n<p>What would you do with an extra $5,000 a day? If you could finally<strong> make profits daily </strong>what would that mean to you? </p>\n\n<p><strong>Would you</strong><strong> </strong><strong></strong> </p>\n\n<p><strong>Pay off debts?</strong> </p>\n\n<p><strong>Fund your retirement account?</strong> </p>\n\n<p><strong>Put your kids through college debt free?</strong> </p>\n\n<p> This course is designed for anyone who wants to discover proven profitable trading strategies and for those who are interested in making money trading stocks. </p>\n\n<p>Packed with over 10 different video lessons and hours of content, Mubarak Shah spills everything you need to make money trading penny stocks. </p>\n\n<p> In this training course, you are going to learn how you can make consistent money trading stocks and how to utilize the most profitable trading strategies. </p>\n\n<p>This course will cover everything from the basics to the advanced, and also set you up to continue working on improving your trading and perfecting your strategies. </p>\n\n<p>In these videos, I give you surefire proven strategies for trading and how to become a successful and profitable trader. </p>\n\n<p> The profitable patterns that are mentioned in these videos have been successfully duplicated to give you the freedom to easily build a consistently profitable trading system. </p>\n\n<p>Now you'll be able to win more trades and make greater profits, so you can finally take control of your financial future. </p>\n\n<p> Get started on your path to a profitable, stress-free stock trading lifestyle by signing up for this course NOW. </p>\n\n<p> The purpose of this course is to teach anybody how to acquire a professional trader mindset. </p>\n\n<p>This course also will teach you what set of techniques and tools professionals use in the market every day to create wealth. </p>\n\n<p> Anybody who devotes time and study to this course will be in a very good position to profit from the markets and to achieve financial freedom. </p>", 
    "end_date": null, 
    "title": "Create A Business From Home Trading Penny Stocks Today", 
    "price": "25.00", 
    "instructors": "Mubarak Shah", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506568_a1d0_2.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-buying-penny-stocks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-19T20:38:15Z"
}