{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this course you will learn how to build trading automation in Excel, the most popular spreadsheet software on the market. In Excel, there are no limits to what you can build! You are limited only by your imagination! The course is built around learning Visual Basic for applications (VBA) and we'll be examining a simplified version of the system I built for trading called Ranger1.0. We'll use this system as an example to show you how to build your own automation. Every student will be able to download a copy of Ranger1.0 for their own use. By the end of the course you will understand the code that runs Ranger1.0 and be able to customize it to fit your ideas. You will also be able to use what you've learned to build your own automated system from the ground up, if that's what you choose to do. </p><p>The focus of this course is on trading stocks. It is possible to trade futures, currencies, options, and bonds through Ranger1.0, but examples on how to trade these are not covered in detail. However, by the end of this course you will have enough knowledge in Visual Basic to be able to create your own custom automation to trade whatever you want however you want!</p><p>The sky is the limit! With excel you really can build just about anything you can imagine. This course will get you started using Visual Basic, even if you've never written any code before. You will learn how to automate the order life cycle, how to build timers, play sounds, record live data, do backtesting, and even how to build a decision making AI!</p><p>Finally, I will guide you through everything you need to know to set up an account with Interactive Brokers, how to set up the Excel API, and how to trade using a simulated \"Paper\" trading account. An Interactive Brokers account is required to receive live streaming data and to send orders, but even if you do not have an account, I will show you how to get historical data for excel that you can do backtesting on right away, and even get you started with a trading system (that you can optimize further) that is already profitable! </p>", 
    "end_date": null, 
    "title": "Create Your Own Automated Stock Trading Robot In EXCEL!", 
    "price": "40.00", 
    "instructors": "Peter Titus", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/676764_a35d_5.jpg", 
    "course_url": "https://www.udemy.com/automated-trading-excel/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-21T20:25:25Z"
}