{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t<strong>How to safely and successfully repair, build and protect your credit using bankers secrets! <br>\r\n\t </strong>\r\n</p>\r\n<p>\r\n\t <strong>Upon completion of this course, you will get a certificate of completion AND you will have enough knowledge of the credit industry that you can seek a new career in the financial field as a loan officer, loan processor, or other high paying jobs.</strong><br>\r\n\t <strong></strong><strong></strong>\r\n</p>\r\n<p>\r\n\t<strong> </strong>This course will teach you the proven secrets that banks and financial institutions have been using for decades with their non prime credit customers to help them achieve their credit goals.  This course is the fastest and safest way to credit approval because it was designed as such.  With specific instructions, the only purpose of this course is to generate credit approvals, credit repair just happens to be part of the process.\r\n</p>\r\n<p>\r\n\t   This short course is only about half a day long to view and it was designed with easy to understand language so anyone from any walk of life can successfully achieve their goals.  Provided will be some forms to help you with your credit target as well as support.  As a reminder, you will never share any personal information with anyone! It is completely anonymous.\r\n</p>\r\n<p>\r\n\t   As you take the course, you will learn the following:\r\n</p>\r\n<p>\r\n\t<strong></strong>\r\n</p>\r\n<ul>\r\n\t<li><strong>What is credit and what is not credit</strong></li>\r\n\t<li><strong>How to read a credit report</strong></li>\r\n\t<li><strong>How to deal with negative accounts (collections and such)</strong></li>\r\n\t<li><strong>How to add credit (even if have been denied before)</strong></li>\r\n\t<li><strong>How to protect your credit</strong></li>\r\n\t<li><strong>Home Loan Boot Camp </strong></li>\r\n\t<li><strong>How to buy a home without a home loan</strong></li>\r\n</ul>\r\n<p>\r\n\t  Although this seems like a ton of information, it is actually extremely simple to understand and most of the procedures you already do every day, like leave a voice mail, check your mail, and send/receive a fax.\r\n</p>\r\n<p>\r\n\t  This is not new information, this course is the video format of the online guide at www.creditrevamper.com.  The tactics outlined in this course have been in practice within nationwide banks for decades.\r\n</p>\r\n<ul>\r\n</ul>", 
    "end_date": null, 
    "title": "Credit Repair from a Financial Institution", 
    "price": "20.00", 
    "instructors": "Michael Cabrera", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138560_007c_7.jpg", 
    "course_url": "https://www.udemy.com/credit-repair-from-a-financial-institution/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-27T16:07:19Z"
}