{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5>CREDIT SPREAD SURGERY - ADVANCED CREDIT SPREADS</h5>  <p>  \tConsider this Option Trading Strategies course as<strong style=\"\"> &quot;Advanced Credit Spreads&quot;</strong>. Both these spreads are dissected to convey an advanced level of knowledge and skill in using these credit spreads. Everything on How to Trade Options from the ideal credit spread trade setup, trade management, adjustments and exit. You&#039;re expected to know what a Bull Put and Bear call spread is.  </p>  <p>  \tThis is a <strong style=\"\">BUSY PROFESSIONALS SERIES</strong> course. If you have a regular job, then you need Option Trading Strategies that allow you to focus on your job, but yet create a somewhat stable and reliable income stream from your investments. The Covered Call, which we covered in Module II, is an excellent example of such a strategy. In this course, we dig deep into credit spreads and understand why being an Option seller (risk defined of course - no naked selling) may not be that bad after all. We analyze Probability, Time decay and Volatility considerations and come up with some pretty good stuff on How to Trade Options.  </p>  <p>  \tThese spreads form the foundation blocks of <strong style=\"\">&quot;Monthly Income&quot; strategies</strong>. And not surprisingly, all advanced strategies like Iron Condors or Backspreads use some variation of the Bear Call or the Bull Put spreads. Anyone wanting to create a consistent monthly income of 2% to 5% will use these strategies as part of their &quot;Income&quot; portion of their portfolio.  </p>  <p>  \t<strong style=\"\">What you will master</strong>  </p>  <p>  \t&lt;/p&gt;  </p>  <ul style=\"\">  \t<li>With Spreads, you can now be a seller of Options</li>  \t<li>The meaning of &quot;defined risk&quot; Options investing</li>  \t<li>Cutting-edge trade entry analysis</li>  \t<li>Selection of the right expiry series</li>  \t<li>Selection of the appropriate strike prices</li>  \t<li>Volatility considerations</li>  \t<li>Setting the optimal &quot;width&quot; of the Spread</li>  \t<li>Set your monthly target that can still let you sleep at night</li>  \t<li>Optimize Time decay, Probability and Premium collection variables</li>  \t<li>Set &quot;pain points&quot;, and plan the exact nature of adjustments</li>  \t<li>Setup trades that require little monitoring</li>  \t<li>Why you can be wrong on direction and still make a profit</li>  \t<li>Ideal strategies for losing positions</li>  \t<li>How do you handle your position when your short strike prices are in danger</li>  </ul>  <p>  \t<span class=\"Apple-style-span\">You should be knowledgeable about Debit spreads and Credit Spreads, which are covered in the </span><span class=\"Apple-style-span\"><a href=\"http://optiontiger.com/course/option-spreads-philosophy/\" target=\"_blank\" rel=\"nofollow\" class=\"external-link\" style=\"\">Options Spreads course</a>. <a href=\"https://www.udemy.com/options-spreads-explained/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a> The Options spreads course and Advanced credit spreads course is available as a bundle. The bundle is available for a 20% discount.</span>  </p>  <p>  \t<span class=\"Apple-style-span\"><br style=\"\">  \t</span>  </p>", 
    "end_date": null, 
    "title": "CREDIT SPREAD SURGERY - Bear Call and Bull Put Mastery ", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42491_3383_10.jpg", 
    "course_url": "https://www.udemy.com/advanced-credit-spreads/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T00:59:46Z"
}