{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will guide you through every stage of planning, creating and running your film crowdfunding campaign. Crowdfunding is the only method of film finance open to all filmmakers, anywhere in the world and over $250 million has already been raised for films on Kickstarter.  </p><p>The course has been created by Stephen Follows, who brings his experience of teaching at some of the world’s best film schools, running a leading online video agency and as a film industry data expert to the topic of crowdfunding. </p><p>It’s based on Stephen’s data research on over 50,000 film crowdfunding campaigns, interviews with over 50 filmmakers who have run a crowdfunding campaign and interviews with some of the top people at major crowdfunding platforms and services.</p><p>Topics covered by the course include…</p><ul><li>An introduction to crowdfunding</li><li>Guided tour of the major crowdfunding sites for filmmakers</li><li>How to build a film crowdfunding campaign from scratch</li><li>Budgeting and scheduling your campaign</li><li>Marketing and outreach to build an audience</li><li>Building and managing a crowdfunding team</li><li>How to run the actual campaign and what to do afterwards</li></ul><p>It also includes examples and templates of key documents as well as interviews with filmmakers and representatives from major crowdfunding companies and services.</p>", 
    "end_date": null, 
    "title": "Crowdfunding for Filmmakers", 
    "price": "20.00", 
    "instructors": "Stephen Follows", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/685190_c767_4.jpg", 
    "course_url": "https://www.udemy.com/crowdfunding-for-filmmakers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T17:51:38Z"
}