{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn about a transformative financial technology <strong class=\"redactor-inline-converted\">just legalized</strong> in the US (May of 2016) and everything you need to be in the know about crowdfund investing (sometimes called Equity Crowdfunding).</p>\n\n<p><strong class=\"redactor-inline-converted\">Build the vocabulary, rules, and use cases of crowdfund investing in 25 minutes.</strong></p>\n\n\n\n\n\n<ul><li>Why startup / small business investing via the internet is transformative</li><li>How crowdfund investing and crowdfunding (e.g. Kickstarter) are completely different</li><li>What the law allows for entrepreneurs, investors, and funding portals</li><li>Where business and social change fits into this equation</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Big opportunities to be early to the game</strong><br>Learning the basics of crowdfund investing (CFI) puts a very powerful tool into your hands. CFI’s use cases may include startup funding, small business “mini-IPOs”, and internet-based fundraising for larger projects. <em>Opportunities for consultants, entrepreneurs, and investors in this space are likely to increase exponentially over the next 10 years.</em></p>\n\n\n\n\n\n\n\n<p><strong>Content and Overview</strong><br>You’ll start by learning the basics of crowdfund investing, then move on to how this financial innovation can fit into a business’ financial lifecycle. Then, you’ll learn the basics of securities as they apply to crowdfund investing, including how equities, bonds, and profit-sharing arrangements work under this model. Next, you’ll learn how funding portals work and how businesses need to approach discussing financial information during these transactions. We’ll wrap up with a look at some of the socioeconomic impacts of the new law and access to additional resources.</p>", 
    "end_date": null, 
    "title": "Crowdfund Investing 101: The Basics of Equity Crowdfunding", 
    "price": 0, 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/851106_e254_2.jpg", 
    "course_url": "https://www.udemy.com/crowdfund-investing-101-the-basics-of-equity-crowdfunding/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T19:25:52Z"
}