{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to rest while your bitcoins work for you?</p><p>We are introducing CryptoArbitrager, a trading robot that allows you to profit from exchange rate differences between bitcoin and litecoin.</p><p>How does it work?</p><p>At cryptocurrency exchanges prices of bitcoin and litecoin rise and fall depending on many factors: laws, new vulnerabilities, politicians’ statements, rumors, and so on.</p><p>All this is very unpredictable, and will have different impacts on the rates. However, when all cryptocurrencies in general are becoming attractive for investment, prices are rising, and when demand declines—they fall. So there is cointegration and interdependence between the courses.</p><p>When cointegration appears, the rate of one cryptocurrency may respond differently to unpredictable events, but on the course of another cryptocurrency it will stay in a certain range, without deviating too much. This creates predictability, which means—a profitable opportunity.</p><p>Once there is a deviation, CryptoArbitrager automatically buys bitcoin and sells short litecoin. When courses come back into balance, the position is closed, and you get a profit. And vice versa. And again and again, 24 hours a day, 7 days a week . . . While you sip your margarita.</p><p>CryptoArbitrager—let your bitcoins work for you!</p>", 
    "end_date": null, 
    "title": "CryptoArbitrager: Trade Bitcoin vs. Litecoin with Robot 24/7", 
    "price": "20.00", 
    "instructors": "WFAToolbox Team", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/773934_d09c_2.jpg", 
    "course_url": "https://www.udemy.com/cryptoarbitrager-trade-bitcoin-vs-litecoin-with-arbitrage-robot/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T13:25:18Z"
}