{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hello and welcome!</p>  <p>Please <strong>watch the promo-video</strong>, as it goes directly through the course!</p>  <p><strong>This course has approximately 2 hours of video-content.</strong></p>  <p>The course is updated in <strong>December </strong><strong>2015!</strong></p><p>Here, in this course, I represent magic and amazing natural force, that<strong> moves the markets, prices of commodities, stocks or Forex pairs</strong>. Although course is called <strong>Crystal</strong><strong> ball trading</strong>, there is no mystique or wizard craft :)<br></p>  <p>If you traded before or just thinking about to start trading<em> </em><em>Forex, Stock or commodity futures or even options on commodity futures</em>, I suggest you encountered with the biggest trading mystery – <strong>what lays behind right side of the chart</strong>, where the price will go further up or down – so you can <strong>open trading position</strong>.</p>  <p>There are many <strong>different methods and indicators</strong>, which are based on the price action of the past day, week or month. But the problem is that past time period (weeks of months) is not indicative and you might have losses, when trust technical analysis.</p>  <p>However, the <strong>seasonal price pattern</strong> takes its place every year, every season.</p>  <p>The key to succeed in trading – <strong>to know seasonality of traded assets</strong>! Some assets have higher <strong>seasonal tendencies</strong>, based on seasonal supply – e.g. harvest coming to the market, or seasonal demand - e.g. natural gas consumption rise before winter cold times.</p>  <p>And some assets – <em>like Forex currencies or stock indices have statistically proved direction</em> on some particular time period.</p>  <p>From this course you will learn about 5 <strong>seasonality information providers, and methodology of using them. </strong>You will be able<strong> to predict the future price</strong> of traded asset in the nearest future.</p><p>It is suitable for<strong> beginner or advanced level traders</strong>, <em>with or without previous trading experience.</em><em></em><br></p><p><strong>Section 4</strong> contains trading <em>live </em>seasonal trading calls and results.</p><p>On December seasonal Lean Hogs sale brought <strong>$800 USD</strong> on sold options and <strong>$890 USD </strong>on sold single Lean Hog futures contract. The account of USD $3 000 is enough to complete such trades.</p><p>You don't need any specific knowledge or skills! All information, software and links are provided!<br></p><p><strong> </strong><em>Easy to understand words, pictures and examples</em> show that <strong>considering seasonal pattern</strong>s in your trading may significantly increase revenue results!</p>  <p><strong>No secrets kept from you,</strong><strong> </strong>I undercover how it works, and <strong>stay at your side</strong> to answer any questions that may occur.</p>  <p><em>Every penny paid</em><em> </em>for this course <strong>worth hundreds of dollars and months</strong><strong> </strong>of my personal experience.</p>  <p><strong>The knowledge is priceless!!</strong></p>  <p>I'll see you in there!</p><p>Alex</p><p>P.S. Check my other<strong> </strong><strong>3 option courses</strong>, related to this one!<br></p>", 
    "end_date": null, 
    "title": "Crystal ball trading - foresee price with seasonal patterns", 
    "price": "20.00", 
    "instructors": "Alex Gorbunov", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514036_f8c2_3.jpg", 
    "course_url": "https://www.udemy.com/seasonality/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T20:55:59Z"
}