{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>El éxito en este tipo de inversión depende de tres cosas: psicología, análisis de mercado y sistemas de trading. Este curso se divide en tres partes. En primer lugar veremos algunos principios de psicología de la inversión que tenemos que tener muy en cuenta a la hora de manejar nuestras emociones. Veremos también como comprender el comportamiento de la multitud para beneficiarnos de sus vaivenes y no dejarnos arrastrar por su agitación.</p><p><strong><br>En segundo lugar profundizaremos en el análisis de gráficos. Aprenderemos a analizar tendencias y a manejarnos con los indicadores que nos van a ayudar a leer al detalle todo lo que sucede y a ganar dinero con técnicas profesionales. Nos meteremos también en el análisis de las figuras más importantes y en estrategias de inversión japonesas con la lectura de velas.<br><strong><br>Finalmente, en la tercera parte, profundizaremos en técnicas de gestión del capital, donde aprenderemos a limitar las pérdidas y a multiplicar los beneficios mediante el uso de stops automáticos. En esta parte aprenderemos también como hacer un análisis para abrir una posición y como sostenerla de forma rentable a lo largo del tiempo. La idea es que al final del curso los alumnos tengan los conocimientos suficientes como para continuar este camino por su cuenta definiendo un sistema propio y que se ajuste a la esencia de cada uno.<br></strong></strong></p>", 
    "end_date": null, 
    "title": "Cómo ganar dinero invirtiendo en bolsa", 
    "price": 0, 
    "instructors": "Don Alejandro López Garrido", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369726_beb8_2.jpg", 
    "course_url": "https://www.udemy.com/como-ganar-dinero-invirtiendo-en-bolsa/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T19:51:24Z"
}