{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you have to submit your personal tax return to HMRC by January the 31st deadline?</p><p>Does the thought of doing a tax return seem daunting and do you at times struggle to understand what information they are asking?</p><p>This course will teach you the elements of a tax return in simple to understand language.</p><p><strong>This Course Really Does Make Submitting Your Personal Tax Return Easy!</strong></p><p>What does the course include:</p><ul><li>Over an hour of videos and 14 lectures</li><li>Free downloadable business expense template and profit calculator</li><li>A walk-through example of completing a tax return</li><li>A breakdown of the common entries in a tax return</li><li>Learn how to calculate your self employment income</li><li>Learn what expenses you can claim for</li></ul><p><br></p><p>I am a chartered accountant working in practice and have discovered that many people who work for themselves find submitting their tax return a daunting experience - especially if it is the first year!</p><p>The tax return is actually very simple to submit in the majority of cases and I will show you what you need to include in each section of the return as we go along.  </p><p><strong>How is the course taught?</strong><br></p><p>This course is taught via a series of videos and at the end of the course we actually go through a full tax return so you can understand where you input all the information you have learned throughout the course.</p><p><br></p><p>Upon completing this course you will be able to submit your own tax return (without the cost of an accountant) and feel confident at calculating your own self employed income and expenses.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Demystifying Your Personal Tax Return", 
    "price": 0, 
    "instructors": "Emily Hyland", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666910_3bcd.jpg", 
    "course_url": "https://www.udemy.com/demystifying-your-personal-tax-return/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T16:19:42Z"
}