{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\"><li>A final de mes tienes <strong style=\"\">problemas pagando cuentas</strong>?</li> <li>Los <strong style=\"\">recibos</strong> cada día son <strong style=\"\">más caros</strong> y no es fácil pagarlos?</li> <li><strong style=\"\">Quisieres ahorrar</strong> para poder tomar unas vacaciones o para invertir?</li></ul> <p>Si contestaste que <strong style=\"\">SI</strong> a alguna de las preguntas, <strong style=\"\">este curso te interesa!</strong></p><p>Este curso está realizado para <strong style=\"\">ayudarte</strong> a manejar las <strong style=\"\">finanzas en el hogar</strong> por medio de simples y sencillos consejos que te permitirán <strong style=\"\">manejar</strong> mucho mejor tus <strong style=\"\">cuentas y deudas</strong> como familia.</p><p>Se mirará y analizará como las finanzas del hogar es responsabilidad de toda la familia así como el trabajar unidos es posible alcanzar mucho más fácil los objetivos que se planteen, viendo cómo ahorrar con los servicios públicos y el manejo adecuado de créditos y tarjetas de crédito.</p><p>Está compuesto por más de<strong style=\"\"> 60 minutos de explicaciones en vídeos</strong>, usando un lenguaje sencillo y de fácil entendimiento, y con una guía en PDF para que puedas controlar tu avance.</p><p><strong style=\"\">Si estas interesado(a) en adquirir valiosos conceptos, información de muy alta calidad e importancia</strong> y quieres mejorar tus finanzas en el hogar este curso es el necesitas y quieres.</p><p><strong style=\"\">QUE ESPERAS PARA MEJORAR? Comienza ya!</strong></p>", 
    "end_date": null, 
    "title": "Disminuye deudas en tu hogar en menos de 30 días", 
    "price": "20.00", 
    "instructors": "DMW Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499504_a6cd_2.jpg", 
    "course_url": "https://www.udemy.com/disminuye-deudas-en-tu-hogar/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T00:16:57Z"
}