{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tThis course is for the self-employed, busy, business owner/manager who is looking for a simple, easy way to do their bookkeeping using an excel spreadsheet. Likewise, it is ideal for the bookkeeper who is looking for a simple way to do their clients accounts.  </p>  <p>  \tWith the course you get a reusable template excel spreadsheet which acts as a cashbook, as well as prepares a profit and loss for you – which will help you to submit your self assessment tax return (UK filing) – and its also (due to complying with international accounting standards) suitable globally, for providing a profit and loss account.  </p>  <p>  \tThe course looks at a fictitious company and it takes two months worth of bank statements. We use this information and enter it into the cashbook, which then provides the basis for the accounts. The accounts are populated automatically on the spreadsheet, based on the figures typed into the cashbook.  </p>  <p>  \tThe template excel cashbook is included, and you download the fictitious company bank statements. In real life, you’d simply use your own bank statements to fill in the cashbook.  </p>  <p>  \tThe course will take approx 90 minutes to complete. With the course tutor, you enter month 1 together, then you have a go at month 2 by yourself, and then watch the lecture to see if you got month 2 correct. We then go a step further by looking at some accounting concepts, and the physical aspects of keeping accounting records.  </p>  <p>  \tIt’s an ideal course if you just want a simple, but very effective many to manage your small business bookkeeping using an excel spreadsheet. No accounting knowledge is needed or presumed. You can use this template to do your own accounts, and then send it to your accountant. With the accounts now in a much better shape, you should ask for a reduction in accountancy fees, so their course should save you time and money.  </p>", 
    "end_date": null, 
    "title": "Do Your Own Accounts", 
    "price": "25.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417088_62a4_2.jpg", 
    "course_url": "https://www.udemy.com/doyourownaccounts/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T08:12:09Z"
}