{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Controlling Customer Debt and Managing the Ledger</strong></p><p><strong>Small business owners:</strong></p><ul><li><strong><strong></strong></strong>Wouldn't you like a strategy to reduce your current customer debt?</li><li>Wouldn't you like a strategy to manage your ongoing customer debt?</li><li>Wouldn't you like to streamline your office procedures and save money?</li><li>Wouldn't you like to be in control of your ledger?</li></ul><p>\"Don't Let Your Customers Run Your Business\" is not just about debt collection.  It is about proactively managing a debtor's ledger, controlling customer debt and getting customers to pay by due date.  There is no point in making a sale if it is not paid. </p><p><strong>My Experience to Deliver this Course</strong></p><p>I am a business manager, qualified trainer and small business owner.  My background has been in office administration and then business management for over years in 20 different industries.  Cash flow control and cost management in addition to accounting, budgeting and debt collection has been by strengths.  After initially delivering debt collection courses I designed this course to encompass accounts receivable, assessing a new customer for creditworthiness, debt collection, policies and procedures, training employees, customer negotiation skills, meetings for monitoring customer debt and evaluating office procedures.</p><p><strong>What You Will Learn</strong></p><p><strong>Managing a Debtor's Ledger and Debt Collection Skills</strong></p><p><strong>Cost of Running a Ledger</strong><span></span></p><ul><li><strong></strong>Why don't customer pay?  You will learn some reasons.</li><li>The cost of running a debtor's ledger.  The cost may shock you.</li><li>The cost to the business to write off a sale.</li></ul><p><strong>Evaluating Office Procedures</strong></p><ul><li>Evaluate office procedures to identify inefficiencies.  A detailed Debtor's Ledger Health Check questionnaire is attached to the course to assist in the evaluation</li></ul><p><strong>Can your Business Afford to Give Credit</strong></p><ul><li>Identify the best credit method for a particular business type</li><li>Issues to determine whether to give credit and who to give it to</li></ul><p><strong>Setting up Policies and Procedures</strong></p><ul><li>The importance of policies and procedures in a business</li><li>Which are the important policies needed to manage the ledger? </li><li>There are 4 and each are discussed in detail</li></ul><p><strong>Strategy to Reduce the Current Debt</strong></p><ul><li>Evaluate the current customer debt and using a strategy to reduce it</li><li>Clean up the old ledger to set up an efficient new system</li></ul><p><strong>Strategy to Manage the Ongoing Ledger</strong></p><p><strong>Step by step to advice to:</strong></p><ul><li><strong></strong>Negotiate your terms of trade with the customer so they pay bt due date</li><li>Assess the new customer for creditworthiness</li><li>Set up the customer account</li><li>Process invoices, payments, credits, complaints and reports</li><li>How to enhance customer relationships</li><li>Use the overdue invoice Strategy</li><li>Deal with customer excuses</li><li>Run customer debt monitoring meetings with an agenda</li><li>Use a detailed phone call script to give callers confidence</li></ul><strong>What am I going to get from this Course?</strong><p><strong>For Everyone:</strong></p><ul><li>28 lectures and over 2.5 hours of content</li><li>Learn how to control customer debt, reduce your stress and save money</li><li>Many forms and templates such as:</li><li>  Debtor's Ledger Health Check questionnaire</li><li> A phone script - for people who are uncomfortable making collection calls</li><li>  Collection letters</li><li>  An agenda for meetings</li><li>  Credit application and trade reference questionnaire</li><li>  Customer approval and decline letters</li><li>  Payment installment agreement</li><li>  The strategy to reduce the current debt</li><li>  Simple spreadsheet to track payment plan customers</li></ul><p><strong>For Small Business Owners in Particular:</strong></p><ul><li>Debtor's Ledger Health Check questionnaire</li><li>A strategy to reduce the current customer debt</li><li>A strategy to proactively manage the ongoing ledger</li></ul><p><strong>For Current and Future Bookkeeping and Accounts Receivable employees</strong></p><ul><li>Efficient methods of controlling customer debt</li><li>Ways of dealing with customer excuses</li><li>Ways of streamlining your office procedures</li></ul><strong>Join me in the course</strong><p>I am sure you are like most people who go into business; you are doing it to make money, and you feel you need to give credit to make sales.  Debt collecting cost you money.  so let's give you a new strategy of running your business, so you can reduce that cost considerably and keep a good relationship your customer.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Don't Let Your Customers Run Your Business", 
    "price": "20.00", 
    "instructors": "Zanette Phillips", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597084_ffa2_7.jpg", 
    "course_url": "https://www.udemy.com/dont-let-your-customers-run-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T02:32:23Z"
}