{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">What do we do!</strong>  </p>  <p style=\"\">  \t Veritas Traders show you how to trade like a professional and trade profitably with ease. We have spent over 3 years designing our trading programs that will allow you to trade with minimum time and effort. In the Futures, Forex and shares market we get maximum successful results.  </p>  <p style=\"\">  \t <strong style=\"\">How</strong>  </p>  <p style=\"\">  \t We are the only trading company in the UK that has an extensive video archive of all our trading methods. We make it available to you so that you can PROFIT from our experience. Talk is cheap! Action PAYS well. Most trader coaching companies do not perform live trading; it is because they do not get the results.  </p>  <p style=\"\">  \t At Veritas traders our trading program is very different and unique in comparison to other Trader coaching companies. We show you how to make successful trades and also how to handle the risks involved. Our courses are tailor made to suit your requirements. We take care of the beginners and the experienced traders to provide each one of you the best trading experience.  </p>  <p style=\"\">  \t We focus on the following  </p>  <p style=\"\">  \t 1.  The correct markets  </p>  <p style=\"\">  \t 2.  Strategies that can help you maximise your gains from trading  </p>  <p style=\"\">  \t 3.  YOU!  </p>  <p style=\"\">  \t  Benefits  </p>  <li style=\"\">    You will get a hands-on experience about what we do and the reasons behind it</li>  <li style=\"\">    You will no longer feel alone and lost.</li>  <li style=\"\">    You can get all your queries solved and thus evolve into more successful traders</li>  <li style=\"\">    You will develop greater confidence in trading.</li>  <p style=\"\">  \t   Veritas Traders has created a unique trader training course that will teach <u style=\"\">you </u>how to successfully trade Forex and futures markets. With easy-to-follow videos and one-to-one guidance and mentoring, we give you the inside track on profit-making strategies used by the City professional.  </p>  <p style=\"\">  \t    Our programme will fast-track your trading career by sharing our many years&#039; industry experience with you. We will give you all the tools and support you need to quickly set you up as a trading entity and boost your income!  </p>", 
    "end_date": null, 
    "title": "Easy Forex and Futures Trading", 
    "price": "50.00", 
    "instructors": "Eamon Phillips, Brigid Arcari", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81064_1293_9.jpg", 
    "course_url": "https://www.udemy.com/easy-forex-and-futures-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-20T05:29:20Z"
}