{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Erase any doubts, hesitation, and fear over what stocks to buy or when to invest. Let the step-by-step hand holding and profit-accumulating strategies in this book be your guide.</p><p>Designed with beginners in mind, this book contains simple techniques you can use to turn the Tables of Wall Street in your favor… effortlessly soar past their financial traps... and profit from investment gems they try to keep for themselves!</p><p><em>Easy Market Profits</em> is not high-panic-trading or a get rich quick gimmick where you must keep your eyes glued to your investments hour by hour. Instead, it's a complete investing strategy that provides you with the peace of mind that your hard earned money is safely invested in strong, low-risk stocks.</p><p>You'll learn the specifics of how to easily identify great investments and safely increase your profits without taking on excessive risks. Whether you're just getting started or are looking for another proven battle-tested investment strategy, <em>Easy Market Profits</em> is for you.</p><p>Here's just a Glimpse of what you'll discover and experience after you read <em>Easy Market Profits</em>:</p> <ul> <li>The precision, no-math-required approach designed for beginners to easily reduce investment risk without sacrificing long term profits</li> <li>The back-door strategy to discovering great investments previously only known to a handful of insiders that lets you avoid buying the wrong stocks at the wrong time</li> <li>The Little Guy Advantage - Your personal road map to hacking the financial markets, turning your small account size into an advantage over big mutual funds and hedge funds</li> <li>The #1 KILLER when it comes to profiting in the markets and why you must AVOID this at all costs (note: this is a mistake even PROS make, and it will ruin your portfolio's returns)</li> <li>Rockefeller's Secret to a Billion Dollar Empire - How you can follow his example to build lasting stock market wealth</li> </ul> <p>AND MORE!</p><p>Yes, You Can be a Savvy, Profitable Investor</p><p>Make one of the smartest investing moves you can and click the \"Take this Course Now\" button at the top of the page to secure your access to Easy Market Profits Course right now.</p>", 
    "end_date": null, 
    "title": "Easy Market Profits: 3 Step Stock Investing Strategy", 
    "price": "20.00", 
    "instructors": "Jason Whaling", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619716_96bb.jpg", 
    "course_url": "https://www.udemy.com/make-money-from-the-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T21:00:27Z"
}