{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Solid stock options trading strategies and accurate market indicators are crucial. But when push comes to shove, the glue that binds them is your emotional state at any given time. When things go south, the best trading system will collapse like a house of cards--if you allow it to.</p><p><em>EFT for Stock Options Trading Success</em> provides the tools you need to ensure this never happens to you by helping you understand and use your emotions when it counts most. It's the key to long-term trading success.</p><p>Until now, no other Udemy course has provided a practical, detailed method for achieving the mental edge in trading. What you'll find inside is based on intensive research into the minds of today's most profitable traders.</p><p><em>EFT for Stock Options Trading Success</em> explains the immutable relationship of human thought, emotion, and behavior and reveals how to:</p><ul><li>Overcome Your Fear of Risking and Losing Money</li><li>Conquer your underlying Greed by understanding where it comes from</li><li>Calm innate anxieties before you start your trading day</li><li>Use EFT (Emotional Freedom Technique) as a \"tool\" for profitability</li><li>Remain vigilant as to why you are placing each and every trade</li></ul><p>This complete trading-improvement course gives you the information you need to determine and improve your personality traits, remove the negative charge from your emotions, and use this system to adapt your behavior for more successful trading.</p><p>This course is aimed at any one who wants to be more successful in daytrading and is real easy to follow.</p><p>Each video features demonstrations of the EFT Tapping technique which is used to release negative emotions and fears and set the stage for profitable stock option trades.</p><p>Students simply follow along with the instructor and with practise, your self-sabotaging behaviors will go away.</p><p>Releasing your fears is not hard, you simply tap specific acupuncture points and focus the mind on the profitable stock option trades you want.</p><p>Join today, you'll be glad you did!</p>", 
    "end_date": null, 
    "title": "EFT for Stock Options Trading Success & Making Better Trades", 
    "price": "30.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512400_1791.jpg", 
    "course_url": "https://www.udemy.com/eft-for-stock-option-trading-success/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T01:30:45Z"
}