{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Llevo más de diez años viendo como hay contables profesionales que no entienden completamente lo que hacen, esto se va a acabar. Los fundamentos de contabilidad nunca fueron explicados de manera tan visual y entretenida, utilizando los conceptos de flujo y nivel de la dinámica de sistemas de Forrester. </p><p style=\"\">Crea asientos en un diario, anotaciones en el mayor, genera balances de situación y  cuenta de resultados. </p><p style=\"\">En menos de 30 minutos de vídeo aprenderás todo lo que necesitas saber para poder ganar dinero dando clases de contabilidad o encontrando un empleo como contable.</p><p style=\"\">Bueno, en menos de 30 minutos verás los vídeos, luego tendrás que practicar, practicar y practicar por tu cuenta.</p><p style=\"\">Contesta los exámenes y resuelve por tu cuenta el excel que descargarás para poner en práctica lo aprendido para un ciclo contable completo, desde la apertura hasta el cierre.</p><p style=\"\">Los tres primeros vídeos, de menos de 7 minutos, te muestran las claves teóricas para la llevanza de contabilidad por partida doble, el cuarto vídeo resuelve un ciclo contable completo en diario, mayo, cuenta de resultados y balance.</p><p style=\"\">No pierdas más tiempo y empieza a descubrir los fundamentos de contabilidad. Ganar dinero como docente en contabilidad está a unos pocos pasos.</p><p style=\"\">Póntelo fácil, con foli.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "entiende la contabilidad y consigue un aumento de salario", 
    "price": "20.00", 
    "instructors": "Foli Centre d'Estudis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616564_d769_2.jpg", 
    "course_url": "https://www.udemy.com/fundamentos_de_contabilidad_foli/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T11:40:23Z"
}