{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\">Join Pro Market Advisors (PMA) founding partners Rick Swope  and Shawn Howell as they introduce you to some of the core principles and  teach you the strategies necessary to becoming a skilled option  trader.&nbsp; </p>    <p style=\"\">Designed for novice stock investors and beginning option  traders, the PMA Essential Options course:&nbsp;  provides twenty-five video recordings from PMA’s online webinar training  sessions along with their 58 page Intro to Options color manual in PDF and  three 20 questions quizzes to test your knowledge.&nbsp; In total you&#039;ll receive over four hours of  video training. The Stock  Market Training course covers topics such as Technical Analysis, Risk  Management, Stock Selection and Six Basic Option Strategies (Long Calls,  Speculative Puts, Protective Puts, Covered Call/Buy Write, The Collar and Bull  Call Spreads. </p>    <p style=\"\">Rick Swope and Shawn Howell founded Pro Market Advisors to  offer you quality, non-hyped, real world financial education.&nbsp; PMA partnerships include the leaders in  trading and investing: E*TRADE, Chicago Board Options Exchange, The Options  Industry Council, NYSE Euronext, NASDAQ, and ISE.&nbsp; Rick and Shawn are also the co-authors of  Trading By Numbers (Wiley Global Finance, 2012).</p>    <p style=\"\">Take this ultimate Stock Market Training course and learn stock market for beginners  with 6 essential&nbsp; strategies.&nbsp;</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Essential Options: Strategies for Mastering the Stock Market", 
    "price": "50.00", 
    "instructors": "Pro Market Advisors", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38456_180d_7.jpg", 
    "course_url": "https://www.udemy.com/essentialoptions/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-27T03:53:02Z"
}