{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">I have taught many students Finance and Investment. I will show you the way to understand finance and investment in an easy way and apply the information to practice.</p><p style=\"\">This course will provide you with essentials of finance and investment. You will grasp the basics to prepare for finance modules in university as well as other professional programmes like CFA. You will be equipped with a sound foundation for further advanced finance study and research. This course is best suited for university students who are studying business, finance, accounting, economics or any other finance related programmes. This course is also for anyone who is interested to know more about the beauty of Finance and Investment, how to make good investments. Remember No Investment, No Rich!</p><p style=\"\">No prior finance knowledge is required. The course covers:</p> <ul style=\"\"><li style=\"\">Time value of Money, Present Value, Future Value</li> <li style=\"\">Compounding, Discounting</li> <li style=\"\">Perpertuity, Annuity, Stream of cash flows</li> <li style=\"\">Interest Rates</li> <li style=\"\">Investment Decision Making Rules: NPV, IRR, Payback</li> <li style=\"\">Bonds: characteristics, zero-coupon, coupon bonds, yield to maturity</li> <li style=\"\">Bond interest rate risk (sensitivity), Duration, Convexity</li></ul> <p style=\"\">Why should take this course?</p><p style=\"\">You are a finance student. You are really struggling into finance related modules and lie on the verge of a fail. You would like to start from scratch in an esay-to-learn format and you want a motivation to love the subject.</p><p style=\"\">You are a manager. You have to make investment decisions. You have to choose between projects.</p><p style=\"\">You are an investor. You want to know more about investment and different investment markets.</p><p style=\"\">You are just interested in finance. You want to know more about why finance and investment are essential in our lives and you are planning to make investments in the future.</p><p style=\"\">The course includes videos of the instructor teaching at the whiteboard for you to understand more easily.</p>", 
    "end_date": null, 
    "title": "Essentials of Finance and Investment in 2 hours", 
    "price": "20.00", 
    "instructors": "Top Instructor, Investor Hien Minh Luu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422918_8f82_5.jpg", 
    "course_url": "https://www.udemy.com/finance-hien-minh-luu/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-16T02:19:45Z"
}