{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><b>Are you a manager (or a would-be manager) who is baffled by balance sheets or confused by cash flow statements? </b></p><p>We're not all financial wizards, but it's not just accountants that have to deal with numbers in their everyday business. As a manager, whether you like it or not, you're going to have to spend some time on spreadsheets and have some sort of financial reconciliation as part of your job duties. Understanding those numbers, and using them to make key changes, is often vital to an organisation's success. </p><p>You don't need a degree in accounting to learn the in's and out's of your company's finances. You only need a foundation and understanding of the essentials. </p><ul><li><b>Understand the ins and outs of financial record keeping. </b>With a fundamental understanding of accounting practices, managers can make decisions that add to their bottom line. Your day-to-day business can give you a view of how your employees and various departments function, but there's no substitute to understanding your business finances.</li><li><b>Take control of your organisation's financial health. </b>Your organisation's financial statements contain valuable data about your company's operating results, financial viability, and profitability. The relationship between certain items of financial information can be used to identify areas where your organisation excels and, more importantly, where there are opportunities for improvement. Using, understanding, and interpreting these statements will help you make much better business decisions.</li><li><b>Get the skills you need to help your make vital financial decisions. <strong></strong></b>Essential Finance for Managers is packed with 79 lectures of fundamental instruction to help you improve your skills and learn how to harness the power of number crunching to maximize your success.</li></ul>", 
    "end_date": null, 
    "title": "Essential Finance For Managers", 
    "price": "25.00", 
    "instructors": "Global Finance School", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443502_8e2e_2.jpg", 
    "course_url": "https://www.udemy.com/finance-for-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T07:50:30Z"
}