{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>El curso de Estrategias de Inversión es un curso que nos ayudará a entender y aplicar diferentes estrategias de inversión.</p><p><br>A la hora de hablar de estrategias de inversión debemos conocer el significado de ambos conceptos.<br>De esta manera, Estrategia se define como la disciplina de coordinar las acciones y recursos para conseguir una finalidad e Inversión como el acto mediante el cual se usan ciertos bienes con el ánimo de obtener unos ingresos o rentas a lo largo del tiempo.</p><p><br>El objetivo de este curso es aprender a combinar ambos conceptos, aprender a usar estrategias de inversión reales a nuestro capital con el objeto de poder aumentar nuestro capital.</p><p><br>Para ello el curso se estructura en una serie de módulos con la siguiente estructura:</p><p><br>Módulo 1. Introducción<br>Módulo 2. Análisis de Valores<br>Módulo 3. Estrategias de inversión basadas en EMA<br>                Técnica de trading basada en cruces de EMA<br>                Estrategia de cruces de tres medias móviles exponenciales<br>                Estrategia del cruce dorado de medias móviles<br>                Sistema de rompimiento para gráficos de 4 horas basado en EMA<br>Módulo 4. Estrategias de inversión con indicadores<br>                Técnica de trading con ADX<br>                Técnica de trading basada en el indicador estocástico<br>                Estrategia combinada oscilador estocástico y medias móviles<br>Módulo 5. Estrategias de inversión basadas en Fibonacci<br>                Técnica de trading basada en Fibonacci<br>                Estrategia basada en Retrocesos de Fibonacci<br>Módulo 6. Estrategias de inversión basada en Bollinger<br>                Estrategia de inversión Doble Bollinger<br>Módulo7. Otras estrategias de inversión<br>                Estrategia de inversión basada en el precio<br>                Estrategia basada en soportes y resistencias<br>                Técnica de trading basada en la acción del precio<br>                Técnica de trading con patrones Pinbar<br>                Estrategia basada en la triple pantalla<br>                Estrategia basada en velas maestras<br></p><p>A la hora de realizar una inversión debemos de tener en cuenta que invertir bien tiene dos pilares fundamentales:<br> •Selección adecuada de los activos.<br> •Diversificación óptima de la cartera.<br>Podemos establecer dos tipos de teorías:<br>1. Teorías que aceptan el principio de mercado eficiente. Los precios de los activos reflejan toda la información disponible y se ajustan total y rápidamente a los cambios o a la nueva información disponible.<br>Según esta teoría, únicamente se pueden realizar beneficios tomando posiciones en acciones que presenten un nivel de riesgo superior al promedio del mercado, es decir, en un mercado no existen valores sobre o infravalorados.<br>El mercado es totalmente racional, sin implicar que lo sean todos sus participantes. Las reacciones de los inversores ante las noticias pueden ser aleatorias para que no sea posible obtener un beneficio que supere al mercado de forma consistente.<br>En cuanto a la diversificación, la teoría de mercado eficiente afirma que el precio de las acciones incorpora toda la información disponible.<br>Dado que el futuro es incierto, es conveniente disponer de una amplia franja de valores para aumentar las posibilidades de obtener beneficio de la subida general del mercado.<br>2. Teorías que aceptan que es posible vencer al mercado. Este tipo de teorías trata de analizar la influencia del comportamiento humano en la toma de decisiones de inversión.<br>La victoria se consigue mediante la selección adecuada de activos.<br>El curso dispone de contenido teórico en donde se sientan las bases necesarias para aprender a definir cada una de las estrategias de inversión y dicho contenido teórico se refuerza con contenido práctico en el que sobre casos reales se aplican los conceptos teóricos adquiridos.<br>Hay que tener en cuenta que ninguna estrategia de inversión tiene una fiabilidad del 100% por lo que todo lo aprendido en este curso no servirá para alcanzar beneficios de forma segura pero si para saber definir y aplicar nuestra propia estrategia de inversión.<br>La estrategia de inversión que definamos, se deberá poner en práctica y una vez realizado debemos de analizar los resultados de la misma para evaluar posibles cambios o redefinición de la misma.<br>Se trata por tanto de un curso de inversión para aquellas personas que deseen definir su propia operativa de trading, eligiendo aquellas estrategias que mejor se adapten a su perfil de inversor.<br>Todas las estrategias definidas a lo largo del curso son estrategias de inversión reales que convenientemente aplicadas nos pueden llevar a lograr plusvalías.</p>", 
    "end_date": null, 
    "title": "Estrategias de Inversión aplicadas al mundo del trading", 
    "price": "20.00", 
    "instructors": "Lucas Mop", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737182_6edb_3.jpg", 
    "course_url": "https://www.udemy.com/estrategias-de-inversion/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T20:21:09Z"
}