{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    O Curso é introdutório ao tema Captação de Recursos. Aprenda como captar recursos subsidiados de longo prazo do BNDES, BNB, BASA, BB, DESENVOLVE SP, AGÊNCIAS ESTADUAIS DE DESENVOLVIMENTO E BANCOS PRIVADOS.  </p><p>Num ambiente de elevadas taxas, obter recursos a 6,5% ao ano representa uma grande oportunidade. Já pensou, pagar o financiamento em prazos que chegam a 20 anos?</p><p>Atuando como consultor, você pode levar esses recursos para as empresas. As empresas podem buscar esses recursos com suas próprias equipes.</p><p>Após conclusão do curso, receba em seu endereço nosso PACOTE DE SOLUÇÕES junto com o certificado de 8 horas/aula.</p><p>Conheça hoje mesmo um grande campo de oportunidades para o progresso dos seus negócios.</p><p><strong>A QUEM SE DESTINA O CURSO</strong></p>  <p>  \t                   O curso ESTRATÉGIAS PROFISSIONAIS DE CAPTAÇÃO DE RECURSOS SUBSIDIADOS DE LONGO PRAZO é de interesse das empresas de todos os portes e empreendedores que desejam captar recursos subsidiados de longo prazo para implantação de novos negócios, também para modernização, ampliação, relocalização e reforma de negócios já implantados.  </p>  <p>  \tO curso também é de interesse de profissionais da área financeira, consultores elaboradores de projetos, estudantes, acadêmicos e demais interessados em aprender como desenvolver e elaborar projetos de captação de recursos de longo prazo..  </p>  <p>  \tEmpresas de contabilidade, escritórios de advocacia e empresas de consultoria em geral que já possuem uma carteira de clientes cativos encontrarão nesse mercado excelentes oportunidades para diversificarem seus portfólios.  </p>  <p>  \t<strong>APÓS O CURSO O PARTICIPANTE SERÁ CAPAZ DE:</strong>  </p>  <ul>  \t<li>Conhecer e utilizar soluções para captar recursos subsidiados de longo prazo com as finalidades de implantação de novos negócios, ampliação, relocalização, modernização e reforma.</li>  \t<li>Conhecer em detalhes o processo de captação de recursos subsidiados de longo prazo praticados pelos bancos de desenvolvimento.</li>  \t<li>Gerenciar esse processo com ferramenta profissional.</li>  \t<li>Compreender a importância do projeto de negócios e receber um modelo de elaboração de projeto de negócios.</li>  \t<li>Começar a utilizar o software SEAP – Sistema de Elaboração e Análise de Projetos.</li>  \t<li>Realizar a simulação de um projeto no SEAP em menos de 5 minutos.</li>  \t<li>Conhecer como atua um consultor num mercado de trabalho que oferta mais de R$ 200 bilhões por ano para empreendedores e empresas.</li>  \t<li>Avaliar em 30 minutos a aptidão de qualquer empresa para o crédito de longo prazo: os 10 passos para acessar o crédito.</li>  \t<li>Aumentar o desempenho profissional, caso já atue no setor.</li>  \t<li>Elaborar uma proposta comercial para realização do trabalho de captação de recursos subsidiados de longo prazo.</li>  \t<li>Elaborar um contrato de prestação de serviços para realização do trabalho de captação de recursos subsidiados de longo prazo.</li>  \t<li>Conhecer as condições e oportunidades de recursos subsidiados de longo prazo dos bancos abaixo:</li>  </ul>  <ol>  \t<li>BNDES</li>  \t<li>BANCO DO BRASIL</li>  \t<li>BANCO DO NORDESTE DO BRASIL</li>  \t<li>BANCO DA AMAZÔNIA</li>  \t<li>BANCOS PRIVADOS FILIADOS AO BNDES</li>  \t<li>BANCO DE DESENVOLVIMENTO DE ANGOLA</li>  \t<li>AGÊNCIAS ESTADUAIS DE DESENVOLVIMENTO</li>  </ol>  <p>  \t<strong>O QUE É O SEAP</strong>  </p>  <p>  \t    O SEAP é o Sistema de Elaboração e Análise de Projetos, desenvolvido pelo Banco do Nordeste do Brasil. O SEAP é oferecido gratuitamente para o mercado.  </p>  <p>  \t    Esse software, desenvolvido como uma ferramenta universal de Elaboração e Análise de Projetos, atende as premissas de elaboração de planos de negócios e projetos econômico-financeiros exigidos por qualquer Banco ou Investidor Privado.  </p>  <p>  \t    A GigaMedia Consultoria conta com o autor do SEAP do BNB na coordenação e aplicação do treinamento para orientar empresas que desejam elaborar seus projetos econômico-financeiros e consultores que querem atuar no mercado de captação de recursos, possuindo experiência nacional e internacional, com mais de 23 anos trabalhando no setor.  </p>  <p>  \t    O SEAP será entregue junto com o Pacote de Soluções.  </p>  <p><strong>RECEBA EM SEU ENDEREÇO NOSSO PACOTE DE SOLUÇÕES JUNTO COM O CERTIFICADO DE 8 HORAS/AULA</strong></p><p>O Pacote de Soluções da GigaMedia Consultoria contém:</p><ol><li>Modelo completo de projeto (Arquivo Word editável; Arquivo Excel Editável; Projeto no SEAP);</li><li>Todas as ferramentas, normas, softwares, roteiros e minutas necessários para realização do trabalho de captação de recursos;</li><li>Software GigaFluxo;</li><li>Modelo de Contrato de Prestação de Serviços;</li><li>Modelo de Proposta Comercial;</li><li>Modelo de procuração do cliente para o consultor para representação junto ao Agente Financeiro;</li><li>Carta Encaminhamento do Projeto;</li><li>Check-List sintético para elaboração de carta-consulta e projeto;</li><li>Check-List analítico para elaboração de carta-consulta e projeto;</li><li>Estimativa de Investimentos e Garantias;</li><li>Ficha de Cadastro – primeiro contato;</li><li>Justificativa de Orçamento com apenas 1 carta proposta;</li><li>Pedido de orçamento;</li><li>Roteiro de Elaboração de Projetos;</li><li>Modelo de Procuração para representação do cliente pelo consultor/empresa de consultoria.</li></ol><p><strong>TESTEMUNHOS</strong></p>  <p>  \t      \"EXCELENTE!!! - É impossível mensurar, o valor de cada segundo que passei a frente de meu computador assistindo, lendo e escutando todo o material disponibilizado pela GIGAMEDIA. GIGAMEDIA, parabéns pelo material e muito obrigado por disponibilizar esse material e abrir novas formas de visão de mercado.\" (João)  </p>  <p>  \t      \"Curso muito bom, que favorece o aprendizado. Fiquei surpreso. Agradeço a Gigamedia por essa oportunidade\". (Renato Júnior)  </p>  <p>  \t      \"Excelente. Há muito tempo estava procurando um curso exatamente nos moldes deste, e agora encontrei e recomendo.\" (Douglas Pereira Rodrigues)  </p>  <p>  \t      \"Um passo para o sucesso! - Este curso é excelente porque nos ajuda a identificar bem as atividades, e saber colocá-las em prática. Oferece um roteiro objetivo de fazer um bom trabalho e nos desperta rumo ao profissionalismo de excelência!\" (Raimundo Jose Da Silva Neto)  </p>  <p>  \t      \"Curso com linguagem de fácil compreensão, que possibilita até mesmo quem não é da área ter a visão macro do negócios. Parabéns a Gigamedia\". (Fagner Calegário)  </p>", 
    "end_date": null, 
    "title": "Estratégias profissionais de captação de recursos", 
    "price": "20.00", 
    "instructors": "Arnóbio Albuquerque, M.Sc.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/107310_b2b5_14.jpg", 
    "course_url": "https://www.udemy.com/estrategias-comerciais-no-trabalho-de-captacao-de-recursos/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-17T20:12:42Z"
}