{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is designed to replicate Richard Starkey's (the primary instructor) face to face classes for students studying through UNISA, specifically for the FAC1601 Module. The online version of the classes are more suited to most of our clients as the lectures are broken down into shorter sections and are available on demand - so you get to study at times that are convenient to you!</p>\n\n<p>This course summarises the necessary theory for each of the study units within FAC1601, and provides you with a systematic approach to passing your exam that you will write with UNISA.</p>\n\n<p>Many non UNISA students have found our FAC1502 and FAC1601 courses useful as a foundation in accounting and finance, so feel free to sign up even if you are not registered to study with UNISA.</p>\n\n<p><strong>The teaching approach is as follows:</strong></p>\n\n<ul><li>You will need to download my course notes and summaries, and have them ready to make notes and perform workings while watching my lectures and tutorials;</li><li>I cover the theory in short, principle based lectures that are designed to teach you the theories and principles you need in the most efficient manner;</li><li>I then work through exam type questions with you to teach you exam technique to ensure you pass your UNISA exam.</li></ul>\n\n<p>The course is structured to be aligned with the UNISA Study Units, and should be easy to follow and complete.<strong>How long is the course?</strong>The course is designed around a UNISA semester, and therefore the course should take 10 to 13 weeks to complete depending on your weekly study time commitment. Your best chance of success is to start early in the semester and work consistently throughout a semester. Semester 1 runs from February to May, and Semester 2 runs from July to October.<strong>Final thoughts from the instructor (Richard Starkey) </strong>I truly believe that this course will be your best chance at passing this very tough module with UNISA. For those of you competing for personal development purposes, you will find this to be a great foundation course especially if you register for the FAC1502 course with us as well. Don't struggle to pass this exam on your own, join this course and let Richard and the Tabaldi Team help improve your chances of success!</p>", 
    "end_date": null, 
    "title": "FAC1601-Financial Accounting Reporting", 
    "price": "50.00", 
    "instructors": "Tabaldi Accounting Education", 
    "commitment": "23 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418246_c881_6.jpg", 
    "course_url": "https://www.udemy.com/fac1601-financial-accounting-reporting2/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T12:45:54Z"
}