{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Made famous by the Italian mathematician Leonardo Fibonacci, the Fibonacci\n number series holds a Golden Ratio that is universally found in nature. Fibonacci is often used in trading and it is a very popular tool among technical traders.</p><p>Using Fibonacci in trading is an extremely effective method for \nachieving greater profitability in stocks, futures, and Forex markets.<br></p><p>When used correctly, Fibonacci analysis protects your trades by helping \nyou identify the strongest levels of support and resistance. This \ninsight can help guide you in picking a market direction.</p><p>Fibonacci can help determine patterns with precision and accuracy. You\n will learn how to combine the Fibonacci number sequencing to other\n aspects of your trading to give you an edge up.<br></p><p>This course is designed to give you a complete understanding of trading with Fibonacci and give you the total capability of applying Fibonacci into your trading.<br></p><p>Whether you are a stock trader, forex trader or any other type of trader, this course will benefit you as we cover many of the core concepts of Fibonacci. Even if you are an experienced trader, we highly suggest you complete \nthis curriculum as we go over trading with Fibonacci. </p><p>Students who complete this course will understand the core concepts of Fibonacci analysis and be able to make real-world application within their own trading plan.</p>", 
    "end_date": null, 
    "title": "Fibonacci Trading: Learn How to Trade with Fibonacci", 
    "price": "25.00", 
    "instructors": "Joshua H., Smarter Trades Group", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633106_9dea_2.jpg", 
    "course_url": "https://www.udemy.com/fibonacci-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T03:10:05Z"
}