{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for UK Company Directors and Company Secretaries and any bookkeepers or accountants who are responsible for filing the annual return for UK limited companies. We look at two company examples of online annual return filing and we then look at other ideas surrounding Companies House - such as how to open and close a limited company and access to information which is filed with Companies House.</p><p>There are specific rules and guidelines for UK limited companies and that is what this course covers. We don&#039;t look at or draw any comparison with US filing rules or regulations. </p><p>There is a guidance notes booklet with screenshots of the filing which you can download and follow.</p><p>The course will take approx 1/2 hour to compete. </p><p>The way the course is structured, is we look at two UK limited companies. We have the annual return for two UK limited companies and we file them both online. We also look at the statutory obligations when you have a UK limited company and what is expected of you. We discuss some things to take into account before forming a limited company and how to close a limited company and the various services which are available at Companies House.</p><p>This course is ideal if you want something quick which will explain how Companies House annual filing works, and if you&#039;ve been given the task of filing the annual return for yourself or for a client and its not something that you&#039;ve ever done before. This course gives you the hand-holding/guidance that you need to complete the task.</p>", 
    "end_date": null, 
    "title": "Filing with Companies House UK", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441016_3adc_4.jpg", 
    "course_url": "https://www.udemy.com/filing-with-companies-house-uk/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-07T04:47:52Z"
}