{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The course is about some very important and basic topics of financial accounting. The most important function of financial accounting is to prepare statements and reports that depict the financial and performance positions of a company. For that purpose statements such as income statement, balance sheet and statement of cash flow are prepared. I have very simply explained the procedures and steps to prepare such reports. The course also includes transactions related to a business that include discounts allowed. Cash-based and accrual-based accounting have been clearly differentiated. The most important transactions and their treatment such as those related to expenses, cost of goods sold and revenues have also been discussed. Each important topic not only includes theoretical presentation but practical examples have been included so that the concepts of students are cleared. The whole accounting cycle has been classified into steps so that students can easily pick up the basic concepts and procedures of financial accounting.</p><p>Students who want to learn accounting cycle which leads to financial statements will find this course very helpful and simple to understand. The course has been divided into topics and then further into sections.</p><p>I expect students to take this course as it has been prepared so that students as well as entrepreneurs can easily pick up not only the concepts of theoretical accounting but use them practically also.</p>", 
    "end_date": null, 
    "title": "Financial Accounting,  its cycle & Financial Reports", 
    "price": "40.00", 
    "instructors": "Sajid Khan", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757508_329d_18.jpg", 
    "course_url": "https://www.udemy.com/financial-accounting-in-360-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T19:24:54Z"
}