{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Our Udemy Courses have helped over 3,000 students to gain insight knowledge into the financial world.</strong> </p><p>A career in finance can be very satisfying at personal and economical level. Statistics show that Analysts can <em><strong>earn anywhere from $45K up to $82K in US alone and we are talking about entry-level positions!</strong></em></p><p>If you are a person, which likes a challenging and dynamic lifestyle, then this course is for you! </p><p>In today's world where financial information is everywhere, it is very easy to confuse noise for good financial insights. <br></p><p>Through this course you will gain a deep understanding of how organizations work. By acquiring the skills of the analyst you will be able to independently analyze companies, without having to listen to news and noise. </p><p><strong>Who is this course for? </strong></p><ul><li>you want to undertake a career in finance</li><li>you have to write a financial report for your boss, which looks very professional</li><li>you are a student or a newbie to the finance world and you want to learn everything from scratch</li></ul><p><strong>What can you expect from this course?</strong></p><ul><li>understanding of the financial world. From financial statements to how to write professional reports</li><li>be able to perform a financial analysis for any listed company</li><li>gain access into the secrets of the financial world</li></ul><p><strong>Why is this course different? </strong></p><ul><li>100% practical approach. Although you will learn the theoretical part as well</li><li>step by step explanations. From how to build financial statements, run financial ratios, use excel for analysis, analyze a multinational company through a case study and write a professional report</li><li>anyone can join this course. What makes this course different is its very simple language (technical jargon when used will be explained) </li></ul><p><strong><em>The skills contained in this course are worth thousand of dollars and have been offered for just 1/1000 of its real value! </em></strong></p><p><strong><em>If you want to become an expert in investment, join the course that will make you financially independent!</em></strong></p><p> <br></p>", 
    "end_date": null, 
    "title": "Financial Analysis from Scratch to Professional Level", 
    "price": "20.00", 
    "instructors": "The Four-Week MBA", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743568_079a.jpg", 
    "course_url": "https://www.udemy.com/financial-analysis-from-scratch-to-professional-level/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T13:55:02Z"
}