{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn small business accounting,&nbsp;entrepreneurial&nbsp;finance, budgets, capital raising and exit strategies with seasoned startup CFO Chris Benjamin!</strong></p><p>This course teaches entrepreneurs, startups and small businesses all things business accounting and&nbsp;<span>entrepreneurial</span><strong>&nbsp;</strong><span>finance related, A to Z. &nbsp;Starting with an introduction to accounting concepts, we move into financial reports and how to create them, understand them and analyze them. &nbsp;</span></p><p>As well we talk about budgeting and forecasting. &nbsp;Next we discuss growing your company, how to understand and analyze it using non conventional reports.&nbsp;</p><p>After growing your company, we talk about raising capital and what is involved and avenues you can take. &nbsp;One section is devoted to the initial public offering process and the timing, costs and best business practices involved.</p><p>Last, we discuss exit strategies and how to give your investors and yourself a payoff for your hard work.</p><p><em>&quot;<strong>Excellent course!</strong></em></p><p><em>I was looking for an introductory course to accounting as I am an investor in early stage startups, and accounting/finance always seems to be an area which is confusing for founders. Chris Benjamin definitely has used his real world experience and education to create a course which teaches entrepreneurs and startups everything they should know from the start. Kudos!&nbsp;</em></p><p><em>JT Lexington, Maven Capital&quot;</em><br></p><p><br></p><p>If you are a startup CEO or small business, don&#039;t be scared any longer of business accounting and finance. &nbsp;Learn today how to manage your finances and grow your business!</p>  ", 
    "end_date": null, 
    "title": "Finance and Accounting for Startups", 
    "price": "50.00", 
    "instructors": "Chris Benjamin", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/32908_4e19_4.jpg", 
    "course_url": "https://www.udemy.com/finance-and-accounting-for-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-12-17T18:08:28Z"
}