{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>***** Over 28,000 successful Students *****  </em></strong>\n\n  </p>\n\n<p><strong><em>***** 1,500 positive Reviews *****</em></strong>\n\n  </p>\n\n\n\n<p><strong><em>***** The No.1 Provider of Corporate Finance courses on Udemy *****</em></strong>\n\n  </p>\n\n\n\n<p>Looking to boost your income as a financial analyst? \n\n  </p>\n\n\n\n<p>Willing to acquire valuable skills that will set you aside from the competition?\n\n  </p>\n\n\n\n<p><strong><em>You’ve come to the right place!</em></strong>\n\n  </p>\n\n\n\n<p><strong><em>Financial Planning &amp; Analysis: Building a Company’s Budget from Scratch</em></strong> is our newest course on Udemy. It guides you through the core principles of Financial Planning and helps you to understand how a company prepares its budget. The video lessons touch on several technical topics such as <strong><em>revenue forecasting, cost planning, working capital development, fixed assets roll-forward, and cash flow calculation</em></strong>. Besides that, we will discuss why firms need budgets, which are the financial statements that a company uses to create its budget, what types of budgets are there, which are the main techniques used in financial planning, who is involved in the preparation of a budget, and who is interested in the final numbers that are signed-off in the budget. Specializing in these topics will turn you into a valuable, indispensable member of any company’s Finance team. \n\n  </p>\n\n\n\n<p><strong><em>Experienced Instructor</em></strong>\n\n  </p>\n\n\n\n<p>In this course 365 Careers brings in a guest lecturer - a Finance professional with significant real world experience working for companies like 3M and Coca-Cola. As part of the Financial Planning &amp; Analysis department of these firms, Marian has participated in a complete budgeting exercise on several occasions. He is the right teacher for you because he understands how to explain a rather complicated topic in an easy to comprehend way. He is passionate about teaching and will always be available to answer your questions.\n\n  </p>\n\n\n\n<p><strong><em>Well structured  </em></strong>\n\n  </p>\n\n\n\n<p>This course shows it all, with no steps skipped. The lessons are <strong><em>easy, time-efficient and well structured.</em></strong> We have used a number of teaching methods! <strong><em>Video lectures, Theory, Real business Examples, Animations, Quiz Questions, Case Studies, a Course Challenge</em></strong> ... you name it! \n\n  </p>\n\n\n\n<p><strong><em>Why should you learn about FP&amp;A and Budgeting?</em></strong>\n\n  </p>\n\n\n\n<p>·         One of the most important activities in Corporate Finance\n\n  </p>\n\n\n\n<p>·         A key topic in interviews, especially when hiring people with a few years of experience\n\n  </p>\n\n\n\n<p>·         Budgeting is great for networking – you communicate with some of the most important individuals in a company\n\n  </p>\n\n\n\n<p>·         Salary. FP&amp;A specialists enjoy a very well-paid career\n\n  </p>\n\n\n\n<p>·         Promotions. Financial Planning Analysts acquire valuable technical skills and are well-known throughout the organization, which makes them the leading candidates for senior roles\n\n  </p>\n\n\n\n<p>·         Growth. Forecasting what will occur in the future is always interesting and full of surprises \n\n  </p>\n\n\n\n<p><strong><em>Interactive experience</em></strong>\n\n  </p>\n\n\n\n<p>Here comes the fun part!\n\n  </p>\n\n\n\n<p>We have a challenge for you! After each major block you have covered, you will be asked to solve a challenge. You will:\n\n  </p>\n\n\n\n<p>-          Forecast a company’s sales\n\n  </p>\n\n\n\n<p>-          Create a budget plan for costs that will support the forecasted level of sales\n\n  </p>\n\n\n\n<p>-          Work on a Production Budget\n\n  </p>\n\n\n\n<p>-          Calculate a Cash Flow\n\n  </p>\n\n\n\n<p>-          Produce an Income Statement and Balance Sheet\n\n  </p>\n\n\n\n<p><strong><em>Sounds interesting, right?</em></strong>\n\n  </p>\n\n\n\n<p>At the end of the challenge, you will send us the work that you’ve done, and we will send back personalized feedback to you. This makes for an interactive student experience that optimizes what you will learn from the course.\n\n  </p>\n\n\n\n<p>The students who complete the task will participate in our monthly Amazon Gift Card lottery with the chance of winning a $10 gift card, rewarding them for their engagement.\n\n  </p>\n\n\n\n<p><strong><em>What makes this course different from the rest of the Finance courses that are out there?</em></strong><strong></strong>\n\n  </p>\n\n\n\n<p>·         High quality of production – Full HD video and animations (This isn’t a collection of boring lectures!)\n\n  </p>\n\n\n\n<p>·         Knowledgeable instructor (experience working for companies like 3M and Coca-Cola)\n\n  </p>\n\n\n\n<p>·         Specialized training – the only course that covers this topic on Udemy\n\n  </p>\n\n\n\n<p>·         An extensive Case Studies that will help you reinforce everything you’ve learned\n\n  </p>\n\n\n\n<p>·         Course Challenge: Solve our Course Challenge and make this course an interactive experience\n\n  </p>\n\n\n\n<p>·         Excellent support: If you don’t understand a concept, or you simply want to drop us a line, you’ll receive an answer within 1 business day\n\n  </p>\n\n\n\n<p>·         Dynamic: We don’t want to waste your time! The instructor keeps up a very good pace throughout the whole course.\n\n  </p>\n\n\n\n<p>Bonus prize: Upon completion of 100% of the course, you will receive a bonus gifts\n\n  </p>\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n  </p>\n\n\n\n<p>Students of this course who complete 50% of the lessons will receive our student favorite Accounting e-book.\n\n  </p>\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n  </p>\n\n\n\n<p>Students of this course who complete 100% of the lessons get full, lifetime access to our five-star rated course “Job Search Success Strategies: Proven Job Hunting Strategies”, which normally has a price of $20.\n\n  </p>\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n  </p>\n\n\n\n<p>All students who complete the course and send us their solutions for the Course Challenge will:\n\n  </p>\n\n\n\n<p>-          Receive personalized feedback\n\n  </p>\n\n\n\n<p>-          Receive a gift\n\n  </p>\n\n\n\n<p>-          Participate in our monthly Amazon Gift Card Lottery(!)\n\n  </p>\n\n\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++\n\n  </p>\n\n\n\n<p>Please don’t forget that the course comes with Udemy’s 30-day, unconditional money-back-in-full guarantee. And why not give such a guarantee, when we are convinced that the course will provide a ton of value for you?</p>", 
    "end_date": null, 
    "title": "Financial Planning & Analysis: Building a Company's Budget", 
    "price": "20.00", 
    "instructors": "365 Careers", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739390_f2ec.jpg", 
    "course_url": "https://www.udemy.com/financial-planning-analysis-building-a-companys-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T00:13:07Z"
}