{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Updated: May 26, 2016 from Austin, TX</em></p>\n\n<p><strong>What is this Course about?</strong><br></p>\n\n<p>Through engaging power point lectures and practical excel exercises, you will learn how to read financial statements more effectively. <strong>Explore the power of accounting and how it can impact your career.</strong> </p>\n\n<p>I structured this course for you. Throughout my years of teaching, my students complain that most professors just don't teach with the student in mind. They have the accounting expertise but can't properly convey the material in easily understood terms. That's where I come in. I will teach you the essentials of accounting. No fluff. I use fun analogies to help break down tricky accounting concepts into bite sized, manageable material. </p>\n\n<p>This course covers the importance of accounting principles and allows professionals to become more <strong>proficient at reading, understanding and interpreting financial statements.</strong> </p>\n\n<p>Beginning with accounting basics, we will explore the importance of communication and purpose of financial statements. From there, you will learn how to <strong>Create an Income Statement, Balance Sheet and Cash Flow Statement</strong> in excel.  Then I will introduce you to financial ratios and how they are used to interpret those tricky numbers on the income statement, balance sheet and cash flow statement. Wrapping up, we will explore a real world company using Yahoo Finance so you can learn exactly how each statement connects together. </p>\n\n<p>This is a wonderful course for anyone wanting to learn the basics of accounting and how to read financial statements. </p>\n\n<p><strong><br></strong></p>\n\n<p><strong>What Materials are Included in this Course?</strong><br></p>\n\n<ul><li>Multiple Quizzes to Test your Knowledge</li><li>Engaging Video Lectures</li><li>Useful Excel Practice Examples</li></ul>\n\n<p><br></p>\n\n<p><strong>Questions this Course Answers?</strong><br></p>\n\n<ul><li>How to Read Financial Statements?</li><li>What is Accounting?</li><li>How to Invest Smarter?</li><li>How to Use Financial Ratios to Assess Company’s Financial Health?</li></ul>\n\n<p><br></p>\n\n<p><strong>My Promise to You</strong><br></p>\n\n<p>In all honestly, I love to teach. All Feedback, Encouragement, Criticism is Welcome. My goal is to do everything in my power to improve this course for my Students. Your Education is Top Priority to Me. I love questions because I believe that is the true way to learn. Looking forward to hearing from you! Be on the lookout for future Accounting Courses :)</p>\n\n<p><br><br></p>", 
    "end_date": null, 
    "title": "Financial Statements: Learn Accounting. Unlock the Numbers.", 
    "price": "30.00", 
    "instructors": "Nathaniel Garrett", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746366_fde1_13.jpg", 
    "course_url": "https://www.udemy.com/learn-accounting-unlock-the-numbers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-29T22:40:57Z"
}