{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The topics covered under the subject 'Financial Accounting' have been designed and developed by Knowledge Horizon with the objective of demystifying these concepts for those with no prior knowledge. This is achieved with the help of our innovative, simple and easy to understand instructional strategy. These topics will equip you with the knowledge and tools to apply them in your field and functional areas. Through innovative instructional and presentational methodologies, we have tried to simplify a quantitative, and often complicated, subject like Financial Accounting with the help of animation, hence the title Animated Business Concepts (ABC). Not only do these topics save lots of your precious time, but they provide a productive and efficient learning experience owing to the use of excellent audio-visual presentational strategies. The idea is to make the concepts simple, easily accessible and enjoyable; concepts which you can use as quick reference learning material and which will fill in any knowledge gaps on the subject of Accounting easily, allowing you to apply what you learn according to your specific requirements.</p><p>This course encompasses all the fundamentals of Accounting and builds solid knowledge on the following nine issues:</p><ul style=\"\"><li>Accounting Principles</li></ul><ul style=\"\"><li>Accounting Equations</li></ul><ul style=\"\"><li>Journal</li></ul><ul style=\"\"><li>T-account &amp; Trial Balance</li></ul><ul style=\"\"><li>Income Statement</li></ul><ul style=\"\"><li>Balance Sheet</li></ul><ul style=\"\"><li>Journal to Balance Sheet</li></ul><ul style=\"\"><li>Cash Flow Statement</li></ul><ul style=\"\"><li>Interrelationship between Financial Statements</li></ul><p>The above topics are explained through videos, easy to remember job aids and ready-to-use material and assessments to confirm your understanding on the relevant subject matter.</p>", 
    "end_date": null, 
    "title": "Financial Accounting Made Easy for All", 
    "price": "20.00", 
    "instructors": "Dr. Ma'en Al Qatamin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562668_44ba_3.jpg", 
    "course_url": "https://www.udemy.com/financialaccounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T14:28:07Z"
}