{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong>   Financial Modeling in Excel for Startups - Learn how to build an investor quality, dynamic and error free budget/forecast for your company. </strong>  </p>  <p>  \t    As an entrepreneur, you will have many uses for a budget/financial model.  If you are looking for investors, one of the first things someone will ask for is your projections.  As well for your own peace of mind, don&#039;t you want to be able to forecast forward and see how the business will perform given a set of assumptions?  All of this can be accomplished with a solid financial model.  </p>  <p>  \t    This course will be taught primarily by following along in Excel as we build a financial model for a fictional company.  We will start with a completely blank Excel workbook, and by the end of the course have a fully functioning financial model.  </p>  <p>  \t    Students are encouraged to take the course twice.  The first time, just follow along, understand not only the formulas, but also the &quot;why&quot; of what we are doing.  See the financial model grow and become &quot;alive&quot; as we work through the various tabs.  The second time, follow along and work on your own personal financial model.  </p>  <p>  \t  The time of the course in video content is 5.5 hours, although expect to spend 10 - 20 hours taking this course.  In that time we will build a basic financial model which is fully functioning.  The additional time is so you can work on your own financial model in between the lectures.  </p>  <p>  \t    The course is structured in a very step by step methodology.  As we work through each section, we&#039;ll progress towards the final financial model.  </p>  <p>  \t    I encourage all entrepreneurs and financially minded people alike to take the course.  </p>  <p>  \t    Why listen to Chris Benjamin, Rogue CFO?  </p>  <p>  \t    I&#039;ve worked with startup ventures exclusively for over 6 years now.  In that time, I&#039;ve built close to 100 different financial models for companies from early stage startups to several publicly traded ventures.  I&#039;ve also presented to angel investors and venture capitalists many times, and know what they are looking for when considering investing in your company.  Learn from someone who not only can teach you how to build a model in excel, but also knows what to include and tips and tricks of building a usable, attractive financial model.  </p>  <p>  \t <em>&quot;<strong>Financial modeling made simple</strong></em>  </p>  <p>  \t <em>Being a CFO I&#039;ve built my fair share of financials models as well, but I can say I never quite felt comfortable with them.  They seemed too big, too cumbersome, and it just seemed like there should be a better way.  Chris definitely knows what he is doing and couldn&#039;t be a better instructor. Finally I feel empowered to build a solid financial model, in less time, and with much better quality. </em>  </p>  <p>  \t <em>Robert Matthews, CFO at (company name omitted for privacy)&quot;</em>  </p>", 
    "end_date": null, 
    "title": "Financial Modeling in Excel for Startups", 
    "price": "50.00", 
    "instructors": "Chris Benjamin", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/130298_9a8e_6.jpg", 
    "course_url": "https://www.udemy.com/financial-modeling-in-excel-for-startups/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-07T01:09:37Z"
}