{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Aims and audience:</strong>  </p>  <p style=\"\">  \tFinancial Model Basics teaches you how to create a basic financial model, from start to finish.  The course is targeted at business managers, finance professionals or business students who need to forecast the finances of a business.  </p>  <p style=\"\">  \t<strong style=\"\">Outline:</strong>  </p>  <p style=\"\">  \tWe start with the benefits of modelling and the structure to be followed. I then take you through analysing historical data, defining key ratios and building the first sheet - the input sheet. Then we move on to calculations and the output sheets. Finally we look at analysis and sensitivity tables. By the end of the course, you will be able to build a basic financial model.  </p>  <p style=\"\">  \t<strong style=\"\">Format and materials:</strong>  </p>  <p style=\"\">  \tAll of the lessons are videos in which I talk you through each step of building the financial model. In addition, I give you Excel files in each lesson, so you can download the files and work on the spreadsheets yourself. I also give you PDF or PowerPoint files that contain lesson notes.  </p>  <p style=\"\">  \t<strong style=\"\">Requirements:</strong>  </p>  <p style=\"\">  \t-Microsoft Excel  </p>  <p style=\"\">  \t-Basic Excel skills  </p>  <p style=\"\">  \t-Basic understanding of financial concepts (eg gross profit, variable costs)  </p>", 
    "end_date": null, 
    "title": "Financial Model Basics: Build a model from start to finish", 
    "price": "20.00", 
    "instructors": "Andrew de Bruyn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407984_3442_4.jpg", 
    "course_url": "https://www.udemy.com/financial-model-basics-build-a-model-from-start-to-finish/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T18:02:26Z"
}