{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Este es un curso completamente nuevo PARA QUIENES QUIEREN INVERTIR EN TENER UNA EDUCACIÓN FINANCIERA que mejore su situación económica. Nadie le da importancia a este tema de finanzas personales hasta que tiene serios problemas de dinero. ESTE ES UN CURSO EDUCATIVO Y PREVENTIVO para evitar que tengas problemas de dinero y comiences a construir tu patrimonio familiar desde ya. </strong></p>\n\n<p><strong>Generalmente </strong><strong class=\"redactor-inline-converted\">tenemos dinero para GASTAR pero no para INVERTIR</strong>, adicional de muy malos hábitos de uso del dinero que son síntomas inequívocos de malas finanzas personales. Invierte en ti, en tu familia y en tu patrimonio. Este curso te dará lo necesario para mejorar tus finanzas personales.</p>\n\n\n\n<p>Los primeros 10 alumnos inscritos recibirán un regalo sorpresa que contribuirá a comenzar a generar mas ingresos extras desde casa. ¡Toma tu lugar ahora! <br></p>\n\n\n\n<p>Invertir en este curso te permitirá tener una mejor situación económica de la que tienes ahora pero sobretodo vas a desarrollar los hábitos y mentalidad adecuada para hacer que el dinero siga llegando a tu vida. Vas a conocer principios esenciales para tener finanzas saludables y evitar la dolorosa caída a la bancarrota. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Este es un curso preventivo para evitar que tengas problemas de dinero pero también es correctivo si ya vives con problemas de dinero, sigue las recomendaciones mostradas y comienza a mejorar tu situación económica. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Descubre como tener una vida prospera sin problemas de dinero, aplica los principios mostrados en este curso para construir un patrimonio familiar solido. Aprende a ahorrar e invertir efectivamente para lograr los mejores rendimientos con tu dinero. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Desarrolla la mentalidad y hábitos de finanzas saludables que van a permitir que tengas mucho mas dinero del que tienes actualmente. Utiliza las herramientas simples y adecuadas recomendadas en el curso para tener un adecuado manejo de tu dinero. Toma el control de tu vida controlando efectivamente tus finanzas personales. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Evita caer en las trampas que te pueden llevar directo a bancarrota. Si ya tienes problemas de dinero descubre como puedes comenzar a generar mas ingresos incluso sin utilizar tu dinero. Resuelve tu problema de bancarrota aplicando los principios recomendados en este curso.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Finanzas Personales para Vivir Libre de Deudas", 
    "price": "20.00", 
    "instructors": "Gibran Sanchez", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815672_f603.jpg", 
    "course_url": "https://www.udemy.com/finanzas-personales-para-vivir-libre-de-deudas/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T17:12:03Z"
}