{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to this Financial Management Cash Budgeting Techniques</p><p style=\"\">Cash is the life line of any business.<br style=\"\"></p><p style=\"\">Business entities will deal with cash day in and day out. </p>If Cash is not available for daily rotation, let what ever be the strength, the business would face severe strain.<p style=\"\">Hence, it is very important to know, how cash will be generated for the business. i.e., What are the sources? </p><p style=\"\">How much from Cash Sales?</p><p style=\"\">How much can be realised from Credit Sales?</p><p style=\"\">How much can be generated from Own Funds?</p><p style=\"\">How much can be generated from Borrowing?<br style=\"\"></p><p style=\"\">And more importantly, when these cash flows will happen? </p><p style=\"\">Similarly, business entities should know when and how much they should be spending in the near future.</p><p style=\"\">All these can be known, if Cash Budget can be prepared. </p><p style=\"\">Cash Budget is a great tool in the hands of the Finance Manager and the Management to plan their business transactions.</p><p style=\"\">In this course, you will learn basics of Cash budget, followed by formats and various case studies to understand the concepts in-depth.</p><p style=\"\">This course is structured in self paced learning style.</p><p style=\"\">Video lectures are used for delivering the course content.<br style=\"\"></p><p style=\"\">Welcome to the course and all the very best.<br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Financial Management Cash Budgeting Techniques", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471556_66a2.jpg", 
    "course_url": "https://www.udemy.com/learn-cash-budgeting-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T05:04:06Z"
}