{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li><strong>Latest Course Update: 1st Nov, 2015.</strong></li></ul><p><em><strong><br></strong></em></p><p><em><strong>Be the businessperson &amp; investor you have always wanted to be...</strong></em><br></p><p><em><strong>With Financial Statement Fundamentals you will turn your accounting 'records' into value-creating, actionable information allowing increased profits, better cash flow &amp; a higher net worth.</strong></em></p><p>You will be given a clearly structured walkthrough of the three main financial statements. These documents, provided by your accountant or accounting software, will no longer appear to be written in an abstract, foreign language.</p><p>After the course you will be able to read and navigate through the Income Statement, Balance Sheet and Cash Flow Statement. And with this knowledge you will have an insight into your business or investments that you have never had the opportunity to see …and from then on, will never want to go without!</p><p><strong>Understand the Financial Statements with this Comprehensive Course and Prosper in Business &amp; Investing from Using Financial Data</strong></p><p>With this deep-dive course, you will:</p> <ul> <li>Find lessons in core accounting theory</li> <li>Learn how to read and navigate the Income Statement, Balance Sheet &amp; Cash Flow Statement</li> <li>Build on all your new knowledge and begin analysing financial statements</li> <li>Have all the support you need along this new (and exciting) journey</li> <li>Find free bonus resources attached to the course to assist with your learning</li> </ul> <p><em>When you take this course, understand the financial statements and start using them, you will never view your business and investments the same again.</em></p><p>For thousands of years there has been some form of accounting record keeping for reporting purposes. While the process has moved from stone carvings to the digital era, financial statements for financial reporting purposes continue to offer a high-level overview of the activities of a business or organisation. </p><p>Being able to view beyond the numbers of financial statements and tell the story of a business is a unique skill held by accountants and financial analysts. It enables them to advise businesses and investors on the best course of action to improve the returns on their client's capital. And while this course will not in itself be able to make you a professional advisor (although it can start you on that journey), it will allow you to view any business or any investment and assess its performance or position based on the three financial statements.</p><p>The course has been developed for small business owners and stock market investors who, while skilled in their own field, have no direct accounting or financial education or training.</p><p><strong>The course is structured as follows:</strong></p><p>It begins with an introductory section that describes the benefits and content of the complete course (including bonus resources) as well as a brief introduction to the financial statements and why they are unique and useful.</p><p>You then move on to learn some fundamental accounting theory. This is considered important (and thus included in the course) because it will help you understand what is going on 'under the hood' of the financial reports which you will later cover. </p><p>From here you will begin your journey through the financial statements. The income statement comes first, followed by the balance sheet and finally the cash flow statement. To keep it clear and straightforward the structure of each statement's section is quite similar so you can see the three statements in contrast to each other.</p><p>With your new grounding in the statements, you then study how they all can and do link with each other, as well as how you can find more information and detail in the 'notes' to the financial statements.</p><p>To assist your learning experience as greatly as possible and achieve the learning outcomes (as opposed to just watching videos) each section includes a revision quiz and many sections include 'Action Stations' where you are guided on how to begin to put theory into practice.</p><p><strong>Last but not least, you will find many free, attached bonus resources.</strong> Not only will you have example basic financial statements to study along the way, you will receive three free PDF eBooks that are normally only available for sale. These eBooks cover accounting foundations, income statement basics and balance sheet basics and provide more written detail, or at least another delivery method, in your accounting knowledge journey.</p><p><strong>Enrol now, take the leap and never look back, in your business and investments, again!</strong></p>", 
    "end_date": null, 
    "title": "Financial Statement Fundamentals for Small Biz & Investors", 
    "price": "30.00", 
    "instructors": "Mr Axel Tracy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387348_ca33_5.jpg", 
    "course_url": "https://www.udemy.com/financial-statement-fundamentals/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T03:37:49Z"
}