{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Fintech Basics is a short and simple guide for fintech beginners of any kind.</p><p>There is a lot of information related to fintech on the web. Dozens of articles on fintech features are published every day. While there are a lot of people wondering what fintech industry actually is. Those ones will find this course helpful.<br></p><p>I recommend to take this course because it is a comprehensive and in the same time laconic resource that allows a student to gain all necessary basic fintech knowledge fast and easy.</p><p>The majority of course lectures are video ones. However, there is a downloadable audio duplicate for each lecture for students' convenience.</p><p>The whole course will not take more than 1-1.5 hours. Some basic fintech stuff will be uncovered within this time, including main fintech terms, sectors, and business models.<br></p><p>The course consists of 10 sections. Each one covers a separate topic.<br></p><p>We'll consider what actually fintech is. Basic fintech terms and definitions will be learned. We'll take a  look at fintech’s distinctive aspects that differ it from the traditional financial market.<br></p><p>The hottest fintech sectors and the most successful fintech companies are also will be considered.</p><p>Moreover, students will know the most influential fintech people. Fintech founders and CEOs, venture capitalists and market analytics are gathered in one place.</p><p>Fintech investors also will get some attention. Students will take a look at both angel investors and VC firms that systematically invest into fintech startups and technologies.</p><p>Also we’ll speak about top fintech locations in the world. Where the best fintech regulation and where the biggest fintech hubs are.</p><p>A separate section is dedicated to Bitcoin currency and Blockchain technology. We’ll consider the most important facts about Bitcoin and Blockchain. Of course, the top bitcoin companies and persons won’t be passed over.</p><p>At the end students will find a brief overview of the best fintech resources providing only valuable and relevant information related to fintech.</p><p><br></p>", 
    "end_date": null, 
    "title": "Fintech Basics", 
    "price": 0, 
    "instructors": "Oleh Zaiats", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611752_e787_8.jpg", 
    "course_url": "https://www.udemy.com/fintech-basics/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T14:53:37Z"
}