{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">Il corso illustra come gestire autonomamente la propria posizione fiscale e il proprio denaro senza ricorrere a intermediari. Ma agendo direttamente e personalmente sui portali dell' Agenzia delle Entrate e dell' INPS.</em></p>\n\n<p><em class=\"redactor-inline-converted\">Il corso fa parte della serie \"Digital Leaf Academy\", un progetto che ha come scopo la produzione di corsi per incentivare l' autosufficienza e la sostenibilità in diversi settori. Nello specifico, questa volta, parliamo di finanza.</em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"></em></p>\n\n<p><em class=\"redactor-inline-converted\">Con una opportuna scelta degli strumenti finanziari non solo avremo meno spese in consulenze, ma riusciremo anche a pagare meno tasse.</em></p>\n\n<p><em class=\"redactor-inline-converted\"></em></p><em class=\"redactor-inline-converted\">\n\n<p> </p>\n\n</em><p><em class=\"redactor-inline-converted\">I conti in tasca, finalmente, ce li faremi da soli e diventeremo dei lavoratori autonomi in tutti i sensi: scadenze, versamenti e rimborsi saranno gestiti direttamente da noi.</em></p>\n\n<p><em class=\"redactor-inline-converted\">Questo corso non è stato prodotto da un consulente finanziario o da un esperto in materie economiche. Ma semplicemente da un contribuente che paga le tasse ogni anno. E che un giorno si è ritrovato i conti sbagliati per colpa di un commercialista incompetente.</em></p>\n\n<p><em> In fin dei conti, anche questa è una forma di autosufficienza e sostenibilità.</em></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Fiscal Survival in Italy", 
    "price": "20.00", 
    "instructors": "Francesco Ugolini", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/843560_7002_2.jpg", 
    "course_url": "https://www.udemy.com/fiscal-survival-in-italy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-09T07:36:18Z"
}