{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This Certificate Program Develops an outrageous, unrivaled, extreme professional strategy system, reaching top performance and precise Trend defining, Entry points, Stop loss placement, Taking profit &amp; exit strategies, as well as Position sizing.</p><p>The Program will start with a very low price, so that early birds who begin this journey with us will take an advantage in term of price over those late ones, price will increase gradually as more lectures are added</p><p>We will take you into a journey where you will explore the world of investment and specifically the FX market, from the course to the world of the web and back to the course again, you will discover where to find all the data &amp; information you need, which websites and resources to address and how to use them and get the most out of them, what to look for and what to ignore, at the end of the journey you will be a full fledged trader equipped with the most respected knowledge and technicalities, and have a bunch of the most versatile and useful resources.</p><p>How we made this program at a fraction of the price it should be paid for?</p><p>We compiled our knowledge &amp; experience through years of practice and learning, along with the best of what the web has to offer in one package program, the FMT \"FOREX MARKET TRADER\" Certificate.</p>", 
    "end_date": null, 
    "title": "FMT: Forex Market Trader Certificate", 
    "price": "20.00", 
    "instructors": "Ahmed Refaie Ali Refaie Abdo, KARIMUS SCHOOL OF BUSINESS, G.P.I. Global Partners Investments", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/782256_eeb0_7.jpg", 
    "course_url": "https://www.udemy.com/fmtcertificate/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-04T16:32:28Z"
}