{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Update 13/4/2016: Added a new introduction video as well as a FAQ video to answer your commonly asked questions</strong></p><p><strong>Update: I’ve gathered a good amount of feedback from students. In general most enjoyed the content, but there will be some areas that I will be adding videos to over the coming weeks so STAY TUNED!! </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Update: 850 students in the first 3 days!</strong></p>\n\n<p><strong>Update: I have received some feedback from some students, so i'll be making some updates and enhancements to the course along the way! stay tuned for more improvements here!!</strong></p>\n\n\n\n\n\n<p>This course will teach you everything you really need to know <strong class=\"redactor-inline-converted\">to start trading the forex market today</strong></p>\n\n\n\n\n\n\n\n\n\n<p>I will show you <strong class=\"redactor-inline-converted\">the exact strategies taught to me</strong> when I was trading in the banks, and you can use these to make <strong class=\"redactor-inline-converted\">consistent profits easily</strong>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I implement a method that I call the <strong class=\"redactor-inline-converted\">checklist method</strong>, which helps traders spot winning trades by filling up a checklist. This helps eliminate most of the uncertainty traders tend to have when entering into trades.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I know your time is precious and so I’ve condensed all the important material into <strong class=\"redactor-inline-converted\">this crash course</strong>. It won’t take you long to finish the material and get started on trading.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Nothing will be kept secret as I share all that I have learnt with you. Avoid all the mistakes that new traders make that prevent them from making consistent profits.</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>the <strong class=\"redactor-inline-converted\">initial free price will increase shortly</strong>, and i'll slowly be increasing the price</li><li>you have <strong class=\"redactor-inline-converted\">unlimited lifetime access at no extra costs, ever</strong></li><li>all future additional lectures, bonuses, etc in this course are always free</li><li>there's an unconditional, never any questions asked <strong class=\"redactor-inline-converted\">full 30 day money-back-in-full guarantee</strong></li><li><strong class=\"redactor-inline-converted\">my help is always available to you</strong> if you get stuck or have a question - my support is legendary in Udemy</li></ul>", 
    "end_date": null, 
    "title": "Forex Trading: Learn to Trade Forex Like the Banks", 
    "price": "20.00", 
    "instructors": "Thomas Beckwith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709500_1f3b_5.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-learn-the-same-strategies-used-by-banks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T10:33:28Z"
}