{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Updated as of 5/15/2016!</strong></p>\n\n<p>Course Description</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">IMPORTANT COURSE INFORMATION</strong></p>\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">You do not need to know how to trade forex to take this course. Learn how inside.</strong></li><li><strong class=\"redactor-inline-converted\">Students of this course get access to our money back guarantee and lifetime access.</strong></li><li><strong class=\"redactor-inline-converted\">Course will be updated with new set-ups </strong></li><li><strong class=\"redactor-inline-converted\">Just launched with hundreds of students already enrolled</strong></li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here is what some students are saying about this course:</strong></p>\n\n\n\n<p><em>____________________________________________________________________</em></p>\n\n\n\n<p>\"After finishing the course, I was amazed at how <strong class=\"redactor-inline-converted\">simple</strong> and <strong class=\"redactor-inline-converted\">practical</strong> this course is. The amazing thing is <strong class=\"redactor-inline-converted\">it works</strong>. The best things in the world are simple. I like the way you make use of the fibs. This course will work for any trader who is willing to take a bit of time practicing what they have learned. The best thing is there are live trade examples. Lee thank you for making this course available for traders who are not there yet.\"- <strong class=\"redactor-inline-converted\">Dave</strong></p><p>\"I am thoroughly enjoying this class. Lee Johnson presents the material in a very organized way. Just when I'm thinking now I need to understand something, it ends up being covered in the next lesson or so\".<strong class=\"redactor-inline-converted\"> I would gladly take another class with him as the instructor</strong>.- <strong class=\"redactor-inline-converted\">B Brady</strong><br></p><p><em>\"Lee <strong>does a great job breaking down what forex is and how to get started</strong>. Really well laid out, and great presentation. I enjoyed going through this\" - <strong class=\"redactor-inline-converted\">Brandon Hakim-Top Udemy Instructor</strong></em> </p>\n\n\n\n<p><em><em>____________________________________________________________________</em></em></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Want to learn how to supplement your income using forex?</strong></p>\n\n\n\n<p>Could you use an extra <strong class=\"redactor-inline-converted\">$500 a month</strong>? <strong class=\"redactor-inline-converted\">Well that's exactly what I'm going to show you in this course.  </strong>I am going to teach <strong class=\"redactor-inline-converted\">actionable setups</strong> that  you can implement <strong class=\"redactor-inline-converted\">right now</strong> to supplement your income by trading the forex market in your <strong class=\"redactor-inline-converted\">spare time</strong>.</p>\n\n\n\n<p>I am a retail trader<strong class=\"redactor-inline-converted\"> just like you</strong> who started trading forex back in 2007. My introduction into the forex market came when I met a hedge fund manager who traded equities, commodities, futures, and forex. Glancing at his trade platform with his screens, charts, and quotes, looked quite intimidating, however, he let me in on his secret. From that point I made a commitment to learn as much as I could about trading forex. </p>\n\n\n\n<p>Since then I have invested many years into learning the education, psychology, and most importantly the <strong class=\"redactor-inline-converted\">skill</strong> of live trading. Now I help beginners just like you learn to trade the forex market. This trading course represents many months of development and is a culmination of the trading knowledge I have gained in both trading and in helping others over the past 7 years. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">My goal is to share with you how you can learn to trade forex for yourself, and to condense many years and thousands of hours of learning into an actionable course to help you achieve your goals.</strong><br></p>\n\n<p>I am here to share with you all of the information <strong class=\"redactor-inline-converted\">I wish</strong> a knew back then. Simply put, this is the course I <strong class=\"redactor-inline-converted\">wish I had</strong> starting out!</p>\n\n\n\n<p>If you have been looking for a way to earn additional income in your spare time, then <strong class=\"redactor-inline-converted\">this is the course for you!</strong></p>\n\n\n\n<p>Learn everything you need to know to <strong class=\"redactor-inline-converted\">start Trading the Forex Market today</strong></p>\n\n\n\n<p>In this course <strong class=\"redactor-inline-converted\">I'm going to teach you</strong>:</p>\n\n\n\n<ul><li>What is forex and how you can <strong class=\"redactor-inline-converted\">take advantage</strong> of this $5 trillion dollar market</li></ul>\n\n\n\n<ul><li>Why forex could be a fantastic vehicle for you to <strong class=\"redactor-inline-converted\">earn additional income</strong></li><li>Techniques and <strong class=\"redactor-inline-converted\">LIVE trading examples</strong> that you can <strong class=\"redactor-inline-converted\">implement right away</strong></li><li><strong class=\"redactor-inline-converted\">Tips and strategies</strong> before placing your first trade</li><li><strong class=\"redactor-inline-converted\">See Proof</strong> that you can actually earn money</li><li>There is a <strong class=\"redactor-inline-converted\">no questions asked, no risk, full 30 day money-back guarantee, </strong></li><li>Remember, when you enroll, you have <strong class=\"redactor-inline-converted\">lifetime access</strong> to all the course lessons</li><li>Help is <strong class=\"redactor-inline-converted\">always available to</strong> you if have questions</li></ul>\n\n\n\n<p>By the end of this course you may not be cast to play a role in a hit Wall St movie, but <strong class=\"redactor-inline-converted\">you will</strong> learn <strong class=\"redactor-inline-converted\">how to trade </strong>the same types of financial instruments that they do to earn your own<strong class=\"redactor-inline-converted\"> extra money</strong>.</p>\n\n\n\n<p><em>This course is <strong class=\"redactor-inline-converted\">NOT</strong>:</em> <br></p>\n\n<p><em> A get rich quick scheme. You will need to learn and develop your skills just as you would when learning anything else and this will take some time. Can I guarantee that you are going to earn an additional $500-$1000 every month? Ofcourse not. There are too many factors involved and that will largely depend on your dedication and skill level. <em>What <strong class=\"redactor-inline-converted\">I can guarantee</strong> </em>is that you will have the basic building blocks necessary to begin creating your own strategy for earning extra money trading forex <strong class=\"redactor-inline-converted\">starting today</strong>. So let's not waste anymore time. </em></p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">Enroll now</strong> and let's get started! </em> </p>", 
    "end_date": null, 
    "title": "Forex Prep Academy for Beginners-Real trades!", 
    "price": "50.00", 
    "instructors": "Lee Johnson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/478598_95b7_4.jpg", 
    "course_url": "https://www.udemy.com/forex-prep-academy-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-17T01:37:37Z"
}