{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The aim of this course is to introduce new and aspiring traders to the simplest way of trading Forex. This course is designed for those with little or no knowledge about Trading.\n\n  </p>\n\n<p>I also recommend this course to those who have some sort of knowledge about Trading, but are finding it hard to make the transition to the real trading environment.\n\n  </p>\n\n<p>I always tell my students that “to become successful in Trading you must know the basics.” In this course you will learn the important basics of Forex trading that will give you an edge in your trading career.\n\n  </p>\n\n<p>I will teach you the key elements of Technical trading; we will cover topics that are related only to Forex trading.\n\n  </p>\n\n<p>This course is structured with the student in mind; it is designed to enable a good understanding of how to trade Forex..\n\n  </p>\n\n<p>It is presented in slides, with live charts, that focus only on the key areas that you need to know.\n\n  </p>\n\n<p>Overall, you will have access to, two hours worth of good content; I have deliberately made this course as short as possible because my aim is to teach you only what is needed and relevant. I don’t want to bore you with irrelevant information that will not be of any benefit to you.\n\n  </p>\n\n<p>I am confident that this course is great value for money and I can’t wait to see you inside.\n\n  </p>\n\n<p> </p>", 
    "end_date": null, 
    "title": "Forex Trading For Beginners: Technical Trading", 
    "price": "20.00", 
    "instructors": "Segun Ayanniyi", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830870_1bce_4.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-for-beginners-technical-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T20:49:24Z"
}