{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   Learn Forex Trading. Trade under real market conditions as long as you want, risk free, using a Practice trading platform which gives you virtual money that never expires.  </p>  <p style=\"\">  \t               The Foreign Exchange (often abbreviated as Forex or FX) market is the largest market in the world with daily trading volume of over 3.9 $trillion. With its high liquidity, low transaction cost and low entry barrier, the 24-hour market has attracted investors around the world.  </p>  <p style=\"\">  \t      Recent technological advancement has broken down the barriers that used to stand between retail clients of FX market and the inter-bank market. The online Forex trading revolution originated in the late 90&#039;s, opening doors to retail clients by connecting the market makers to the end users.  </p>  <p style=\"\">  \t               A chart is the most important tool for understanding what is going on in the market. Almost all traders today, particularly those who trade actively, use their preferred types of charts to analyse the market. In the end, a chart is a visual representation of the price movements, a reflection of the psychology of the market and a visualization of the interaction between buyers and sellers in the market.  </p>  <p style=\"\">  \t     This course is structured in short and easy to follow format and is targeted at students who want to trade small accounts and learn to trade in the FX markets. The course introduces the student to experience the forex trading environment and learn with real time data flow with a reputable broker in a practice trading platform. An easy to follow, methodical approached is taught to shortlist current pairs with high probability of success. time market entry, profit taking and stop loss. Students are taught techniques for capital preservation.  </p>", 
    "end_date": null, 
    "title": "FOREX Currency Trading For Beginners", 
    "price": "25.00", 
    "instructors": "PAUL UGWU", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/231256_d5d5_3.jpg", 
    "course_url": "https://www.udemy.com/forex-currency-trading-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-27T21:16:23Z"
}