{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hi I'm Thomas, forex trader and forex instructor at fxmasterclass. Have you ever been interested in learning to trade or perhaps you have already started but your having problems with your trading. Now Trading is a lifelong skill that when mastered will help give you more avenues to grow your income. However the Internet is full of information these days and many budding traders end up spending tonnes of time plunging through numerous articles one at a time trying to find the information they need to help them succeed. <br> <br> Well stop torturing yourself by doing this the slow and difficult way. And let me spell it out for you in the exact order that you should begin your trading journey. This course is going to cover all the important information that you need to know. It will guide you from knowing nothing to finally taking your very first trade. And by the end, you would be ready and well equipped to tackle the forex market <br> <br> So quit banging your head trying to figure trading out. Enroll today and speed up your learning curve dramatically</p>\n\n<p>Nothing will be kept secret as I share all that I have learnt with you. Avoid all the mistakes that new traders make that prevent them from making consistent profits.</p>\n\n<ul><li>the <strong>initial free price will increase shortly</strong>, and i'll slowly be increasing the price</li><li>you have <strong>unlimited lifetime access at no extra costs, ever</strong></li><li>all future additional lectures, bonuses, etc in this course are always free</li><li>there's an unconditional, never any questions asked <strong>full 30 day money-back-in-full guarantee</strong></li><li><strong>my help is always available to you</strong> if you get stuck or have a question - my support is legendary in Udemy</li></ul>", 
    "end_date": null, 
    "title": "Forex Trading: Ultimate Course to Get You Started", 
    "price": "20.00", 
    "instructors": "Thomas Beckwith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/881378_2130_2.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-ultimate-course-to-get-you-started/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-18T02:01:58Z"
}