{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This is a short and to the point course showing how to predict and enter the big moves in the Forex Market.  </p>  <p>  \t    It is based on the premise that the best type of trading focuses on getting High Return on Investment on your trades.  These High ROI trades are achieved by catching the big moves in Forex and using small risk in order to gain a potentailly huge reward.  </p>  <p>  \t    The techniques are based on best selling series of books.  </p>  <p>  \t    The 10XROI Trading System  </p>  <p>  \t    The Trade Around Your Job System  </p>  <p>  \t    The High ROI Scalping System  </p>  <p>  \t    The High ROI End of Day System  </p>  <p>  \t    Here are some comments from readers and students of the system.  </p>  <p>  \t    5.0 out of 5 stars <strong style=\"\">Nicely done! 10R trades are NOT pie in the sky...they are STRUCTURED!</strong>,  </p>  <p>  \t    This book offers a refreshing and bold assertion that there REALLY IS something more worthwhile to shoot for than a 1 to 1 reward/risk trade. My own work over the last few years in creating custom trading data analysis spreadsheets has led me to reach the inescapable conclusion that I must aim HIGHER than high win-rate, 1 to 1 RR methods in order to put the MATH on my side. Thomas&#039; approach fits SQUARELY into my own money managment parameters and actually EXCEEDS them. The information in this book is GOLD if you are willing to rethink and then CHANGE your paradigms about Reward/Risk and trade management. Well done!  </p>  <p>  \t    5.0 out of 5 stars <strong style=\"\">The 10xro1</strong>, March 2, 2014  </p>  <p>  \t    Good read and plan for trading. Following the formula for good results.  </p>  <p>  \t   Tom Casey  </p>  <p>  \tABOUT THE COURSE CREATOR  </p>  <p>  \tI have been a trader for 9 years and I know what a struggle it can be. I have been using my systems for the past three years and I decided to share them with other traders so they can hopefully short cut their time to becoming a profitable trader. I am a bestselling Amazon author and also run a blog where I keep my readers and students updated.  </p>  <p>  \tIt is important to note that ALL the trading systems were designed to slot into each other and to be traded together. This means that you can add each system to your trading system with confidence knowing that you are adding more opportunities and they can all be traded without conflict  </p>", 
    "end_date": null, 
    "title": "Forex - Catch the Big Market Moves in Forex", 
    "price": "20.00", 
    "instructors": "LR Thomas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235112_b35c_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-catch-the-big-market-moves-in-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T18:00:17Z"
}