{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li><strong class=\"redactor-inline-converted\">Life Change Forex Trading Course Complete A to Z</strong></li></ul>\n\n<p>Now this course You can <strong class=\"redactor-inline-converted\">Learn complete Forex Trading  basic to advance </strong>means 1 to z If you follow My all video and rule then you will be professional Forex trader soon so try my course leans its will give you Professional Trading Idea.Currency , Trading ,Bid and ask ,Spread ,Forex power system ,Forex Guru trading ,Forex no loss method .MACD RSI and many more also price action trading.</p>\n\n<p>I design this course special for all new trader and also professional trader its will give you more ideas how you can trad any market condition with just simple follow rule.ew lectures will be added to the course constantly  <strong>at no extra cost to you.</strong> This is a course that will continue to grow and grow.</p>\n\n<p>So if you wants professional trader then you need to understand all Forex trading rule. so i try give you my best idea for daily trading and i also give you one best <strong class=\"redactor-inline-converted\">Fore</strong><strong class=\"redactor-inline-converted\">x No Loss </strong><strong>Method </strong></p>\n\n\n\n<p>My all video with advance trading indicator give you daily accurate trading signals But you need to try one demo before real account trading also share many <strong class=\"redactor-inline-converted\">Forex trading indicator </strong><strong>strategy</strong> for daily market trend analysis with just simple follow setup its too much easy for understand daily market chart if you follow these Forex trading strategy.</p>\n\n\n\n\n\n<p>This course is for complete beginners and all professional With advanced trading system too much easy to understand  ! All you need is an open mind and a passion to be successful In Forex Trading.</p>", 
    "end_date": null, 
    "title": "Forex trading Basic to advance Professional Level course", 
    "price": "20.00", 
    "instructors": "Teaching Malik kashif", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/838260_c056_5.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-basic-to-advance-professional-level-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-03T08:12:22Z"
}