{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this training course I will share with you part of my 15+ years of trading experience. Binary options are becoming very popular in the last few years but most of the traders don't understand how they work and don't use them properly. I will describe to you how I trade my order flow based strategies with binary options.</p>\n\n<p>I will not promise you to reveal any secrets and make you millionaires like most trainers do. They are trainers and their job is to sell their training courses. I'm a trader and I will just share with you my experience. My strategies are simple and based on pure market logic - the analysis of the order flow.</p>\n\n<p>For the last 16 years I was individual trader, bank dealer and risk manager. I had the luck to see the market form different points of view and trade various financial instruments from FX spot, through forwards and plain vanilla options to complex options structures as Target Redemption Forwards with Knock-In barriers. I know that most of the traders don't have the chance to get this experience and to understand the order flow analysis and the options trading. That is why they don't have an advantage and are not able to make money in long run. Forex trading is like a zero sum game and when you make money someone else is losing. That is why you must have and edge to be in the 10% successful traders. Order flow analysis and binary options can give you this edge.</p>\n\n<p>For better understanding of the topics (my English is not perfect and I'm not a TV host) I have added some PDF lectures. They will help you to get a better idea of the binary options and the trading strategies I use for spot and options trading. All the subscribers will receive bonus materials - a binary option strategy for trading of DAX, more real trading examples. Just send me an e-mail to srm70@abv.bg when you enroll to the course.</p>", 
    "end_date": null, 
    "title": "Forex trading with binary options", 
    "price": "25.00", 
    "instructors": "Svetlin Minev", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850726_4caf_3.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-with-binary-options/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T14:35:35Z"
}