{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>  Have you ever wondered how professional Forex traders make consistent profits? Well this is your chance to find out.  </strong>  </p>  <p>  \t                        This course will teach you exactly how I trade two very simple breakout strategies that have been extremely profitable for me since 2011. The patterns and trading strategies taught here are easy to learn and can be applied by anyone, regardless of trading experience.  </p>  <p>  \t<strong>Who should take this course:</strong>  </p>  <ul>  \t<li>Anyone who wants to gain financial freedom through the Forex market</li>  \t<li>A new Forex trader in search of simple trading strategies that produce consistent profits</li>  \t<li>Intermediate to advanced traders who want to supplement their current trading strategies to make more profits with minimal risk.</li>  </ul>  <p>  \t                        So whether you&#039;re a new trader in search of a profitable strategy, or you simply want to add to your trading arsenal, this course is for you!  </p>  <p>  \t<strong>  This course will teach you how to:  </strong>  </p>  <ul>  \t<li>Quickly identify wedges and channels</li>  \t<li>Make precise entries based on price action</li>  \t<li>Protect your capital with an appropriate stop loss placement</li>  \t<li>Use a proper risk to reward ratio for massive profits with minimal risk</li>  \t<li>Profit each and every month with these simple strategies</li>  </ul>  <p>  \t                This course can be completed in one to two days. Lifetime support provided by Justin Bennett through the student discussion forum.  </p>", 
    "end_date": null, 
    "title": "Forex Breakout Profits: The Definitive Guide", 
    "price": "25.00", 
    "instructors": "Justin Bennett", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240256_c315_16.jpg", 
    "course_url": "https://www.udemy.com/forex-breakout-profits-the-definitive-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-09T20:08:05Z"
}