{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">The only forex training that you will ever need</strong>  </p>  <p>  \t“Trading forex can be low risk, easy to learn and does not have to use much of your time or cost a fortune to get involved in.” Jeff Fitzpatrick  </p>  <p>  \tThis complete, stand-alone course is revolutionary it:  </p>  <ul style=\"\">  \t<li>Minimises the risks in trading.</li>  \t<li>Takes trading down to a few minutes on a couple of days each month.</li>  \t<li>Makes learning very easy.</li>  \t<li>Minimises the cost of getting started.</li>  </ul>  <p>  \t<strong style=\"\">How the course works</strong>  </p>  <p>  \tFirst you set up a free “demo” trading account allowing you as much practice as you want without risking a penny. You can practise until you have proven to yourself that you can trade successfully.  </p>  <p>  \tThrough 22 short, punchy lectures you will quickly become familiar with trading terms. You will build a portfolio of proven strategies and tactics and will understand a professional trading platform that is also provided free of charge.  </p>  <p>  \t<strong style=\"\">Constantly updated supplementary material</strong>  </p>  <ul style=\"\">  \t<li>Training manuals allowing you to read up on the video material.</li>  \t<li>TV Documentaries about trading.</li>  \t<li>Unique, free trading tools to download.</li>  </ul>  <p>  \t<strong style=\"\">Support</strong>  </p>  <p>  \tOur support is second to none and lifelong. You will have unlimited, direct access to the trainers by email and Skype for as long as you need it.  </p>  <p>  \t<strong style=\"\">Bonus material</strong>  </p>  <p>  \tWe want to make this the best forex training available and the best value too. All students will therefore have access to Forex Trader Magazine, including all of our back issues.  </p>  <p>  \tThis is huge because it means that you will have direct access to ongoing personal development as a trader and all of the latest news and developments on an ongoing basis.  </p>  <p>  \tYou will also become a member of our growing community of successful home based traders.  </p>  <p>  \t<strong style=\"\">Get in touch</strong>  </p>  <p>  \tDon’t hesitate to contact us if you have any questions.  </p>", 
    "end_date": null, 
    "title": "Forex Trading", 
    "price": "30.00", 
    "instructors": "Jeff Fitzpatrick", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/324656_996e_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-trade-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T05:20:02Z"
}