{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Start making money, with no experience whatsoever, immediately - just like my current 5,500+ students!<br></p>  <p>  \t<strong>          No need to purchase a Forex Robot </strong>- I will give it away to you for FREE in this course for you to practice on a Demo account.  </p>  <p>  \t                                                                            See how I make <strong>6.75% profit in 10 days!</strong> LIVE, right in front of your eyes! No b.s. - I will be demonstrating everything on a Real Forex account with Real Money.  </p>  <p>  \t                                                                  You can expect to earn 175+% per annum with the techniques you learn from this course! <strong>Let Forex Robots work FOR YOU!</strong><em></em>  </p>  <p>  \t                                                                    Every single technique which I reveal in this course is easy to put into place in minutes - with any Forex Robot.  </p>  <p>  \t                                                                    This course will save you time, money, and effort. I will give you a step-by-step guide to <strong>getting the MAXIMUM returns from your Algorithmic Trading system.</strong>  </p>  <p>  \t                                                                    Nothing is kept secret - <em>I reveal all I know... </em>and as I test even more things, those that are successful are added to the course - at no extra cost to you! This is a course that will continue to grow and grow.</p>  <p>  \t<strong></strong>Click the \"take this course\" button, top right, now ... <em>every minute you delay is costing you money</em>...  </p>", 
    "end_date": null, 
    "title": "Forex Robots: Expect To Earn 175% P.A. Forex Robot Included!", 
    "price": "25.00", 
    "instructors": "Kirill Eremenko", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260470_bdcc_8.jpg", 
    "course_url": "https://www.udemy.com/backtesting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T10:42:51Z"
}