{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn everything you need to know to <strong>start Trading on the Forex Market today!</strong><br></p>  <p>  \t                      In this course I will show you how <strong>you can take advantage </strong>of currency movements to make profits. We will talk in detail about Currencies, Charts, Bulls &amp; Bears, Short Selling, and much more.  </p>  <p>  \t                I will thoroughly explain how Forex Brokers work, so that you are able to easily separate <strong>Honest Brokers </strong>from the unreliable ones when you are ready to open a Real Trading account. I even include a FREE guide to selecting a Forex broker, based on my own experience of Real trading.  </p>  <p>  \t                      In this course you will also learn how to read the <strong>Calendar of Economic events,</strong> which is imperative for Fundamental trading on Forex as well as other Financial marketplaces such as NYSE, London Stock Exchange, Futures Exchanges, and more.  </p>  <p>  \t                  I will also supply you with a Forex Market Hours wallpaper for YOUR timezone, allowing you to effortlessly monitor activity of Global Forex Market participants throughout the day.  </p>  <p>  \t                Nothing is kept secret. I reveal all I know... new lectures will be added to the course constantly - <strong>at no extra cost to you!</strong> This is a course that will continue to grow and grow.  </p>  <p>  \t                  Take this course now and learn from my 7+ years of experience. Avoid the most common pitfalls that catch 90% of traders!  </p>  <p>  \t                      This course is for complete beginners! All you need is an open mind and a passion to be successful!  </p>    <p>  \t<em><strong>As with all my courses:</strong></em></p><ul><li>you have <strong>unlimited lifetime access at no extra costs, ever</strong></li>  \t<li><strong>all future additional lectures, bonuses, etc in this course are always free</strong></li>  \t<li>there's an unconditional, never any questions asked<strong> full 30 day money-back-in-full guarantee</strong></li>  \t<li><strong>my help is always available to you</strong> if you get stuck or have a question - my support is legendary in Udemy</li>  </ul>  <p>  \t                  Can't wait to see you inside!  </p>  <p>  \t                  Kirill  </p>", 
    "end_date": null, 
    "title": "Forex Trading A-Z™ - With LIVE Examples of Forex Trading", 
    "price": "20.00", 
    "instructors": "Kirill Eremenko", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308690_6e17_2.jpg", 
    "course_url": "https://www.udemy.com/forex-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T22:56:36Z"
}