{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"> The course is structured to introduce those interested in understanding the importance of charting patterns and setups which can be applied to any FX, commodity or stock and can be applied to intra-day trading through to Daily and Weekly trading.</p><p style=\"\"> The videos will outline what is required on a personal level the basics to understanding what patterns are and the indicators we use to identify and apply trading rules to enter and exit trading positions. </p><p style=\"\"> It discusses and highlights when and why these patterns repeat themselves whilst giving an overall picture of how the charts repeat these patterns on any market and any timeframe. </p><p style=\"\"> An explanation of the role of the Futures Markets and the how to access the markets, through a broker entity. </p><p style=\"\"> The course will also explain the financial possibilities achievable by those who dedicated to following strict rules in regards to personal responsibility and the building of a personal trading plan that will suit each individual. </p><p style=\"\"> An introduction into charting software, we will be using the MT4 platform which is a freely downloadable charting software which allows the participant or trader to practice these methods using demonstration or dummy accounts before applying live capital to the market.</p><p style=\"\"> A lead into the Advanced course which will go into detail the software that is used, the trading platform setup and in-depth analysis on the technical indicators used to trade the markets with specific trade setups and money management strategies to successfully trade any market and anytime frame suited to the individual. </p><p style=\"\"> Our aim is to provide in-depth easy to understand fast-tracking course for those who wish to become private operators. </p><p style=\"\"> The setup of their trading business with a trading plan that will enable structured levels of learning and building of confidence to become independent and profitable. </p>", 
    "end_date": null, 
    "title": "FX Commodity Chart Trading Patterns for Success", 
    "price": "50.00", 
    "instructors": "G. Scott Martin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541824_7cce_2.jpg", 
    "course_url": "https://www.udemy.com/fx-commodity-chart-patterns-mt4-platform/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T02:49:34Z"
}