{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><p><strong style=\"\">THE VIX (&quot;FEAR&quot;) VOLATILITY  INDEX</strong></p>    <p>The VIX is one of the  most watched indicators in the markets, even by professionals. We take a look  at what this index is, Understanding VIX method of computation, and how this Index is  interpreted on a day-to-day basis in practical terms. We look at overall market  correlations with the VIX since the index was created in the 1990&#039;s. The VIX  may be called a Volatility Index, but it acts more like a Fear index in the  markets. The key lies in understanding the relationship of the VIX index to the  S&amp;P 500 Options.&nbsp;</p>  <p>A high or low levels  of VIX impacts all S&amp;P 500 Options as well as individual stocks. This  course looks at the example of the financial crisis of 2008 in detail when the  VIX levels spiked to unprecedented levels, and the impact it had on Options  prices. Every Options trader must watch the VIX index.</p>  <p>There are several  other Volatility indexes that track Volatility in the markets, and we cover the  important ones. It&#039;s hard to be a good investor if you don&#039;t follow the VIX.  Get the complete skinny here, this course is all action!!</p><p><strong style=\"\">What you will master</strong></p>&lt;/p&gt;  <ul style=\"\">  <li>Why is the VIX called a Fear Index and why is it feared</li>  <li>Why is it the most watched index in the market</li>  <li>How &nbsp;is this calculated</li>  <li>VIX values and the S&amp;P (non)correlations in the early 1990&#039;s</li>  <li>VIX values and strong correlations in the late 1990&#039;s and since</li>  <li>What does a high value of VIX do to Option prices</li>  <li>Flashback - lets got to 2008 and see what high VIX levels can do</li>  <li>What is the relationship of the VIX to the VIX Futures</li>  <li>Why is the Options on the VIX not a good trading vehicle</li>  </ul>  <p>&nbsp;</p>  <p>  </p>  ", 
    "end_date": null, 
    "title": "Get to know the VIX Index (aka \"The Fear Index\")", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45139_9121_6.jpg", 
    "course_url": "https://www.udemy.com/vix-index/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-08T01:52:03Z"
}