{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The biggest fear that banks and investors have when investing in your company is knowing how they will get their money back. When you know your business numbers, you will be able to answer confidently any difficult questions that they may throw at you.</p><p> This course will teach you how to understand the financial language that finance professionals, banks and investors all use. Once demystified, this understanding and knowledge will stay with you for a lifetime, for you to apply in all business situations.</p><p><strong style=\"\">Who is this course for?</strong></p><p>For owners and managers of small and medium-sized businesses, who want to be better prepared for those dreaded meetings with the bank manager or investors.</p><p><strong style=\"\">Why might I need this course?</strong></p><p> It can be challenging running your own business, particularly when you need access to finance and you and your bank manager seem to be speaking a different language. This could be your only chance this year of securing that overdraft or raising finance – why risk losing a golden opportunity? You wouldn&#039;t go into a sales meeting unprepared, without the right knowledge and language – why should it be any different when meeting your bank manager? </p><ul style=\"\"><li>The course is 51 minutes long, over 10 videos</li><li>An exclusive feature is the study guide to download, ahead of the course, so that you can complete the guide as the programme unfolds</li></ul><p><strong style=\"\">What am I going to get from this course?</strong></p><ol style=\"\"><li>Learn about the 3 financial statements you must understand before meeting your bank manager</li><li>Get to grips with cash flow</li><li>Know why profit isn&#039;t usually the same as cash</li><li>Look out for the warning signs in your business and know what to check every day</li><li>Gain the respect of your bank manager through demonstrating financial competency</li><li>Know what to say to suppliers when times get tough</li><li>Be prepared with 360° control over your finances</li><li>Get started on budgeting</li><li>Make it easier for yourself in managing finance on a daily basis</li><li>Free training guide to follow with the course</li></ol>", 
    "end_date": null, 
    "title": "Handle difficult questions the bank manager will ask you", 
    "price": "20.00", 
    "instructors": "Mr Jeremy Devlin-Thorp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580068_ae00.jpg", 
    "course_url": "https://www.udemy.com/handle-difficult-questions-the-bank-manager-will-ask-you/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T11:58:37Z"
}