{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you&#039;re a Stock trader who&#039;s always wanted to learn about Options, this course is for you. If you&#039;re a Stock trader wanting to significantly improve your Stock portfolio performance, this course is for you. If you&#039;re a Stock trader that was always interested in utilizing Options for better performance, but was always too confused as to how to use them, this course is for you. The course is a collection of key Options concepts, and how Options are different from Stocks. Most importantly, you&#039;ll receive 3 specific strategies to use Options in combination with your Stocks to double or even triple your performance.</p><p>Options trading has a learning curve, and its best to approach this learning process methodically and using Paper Money accounts as much as possible while you go through this learning process. There&#039;s also a 3-course Options Beginners Bundle that newcomers to Options will benefit from. Inside this course you&#039;ll find a very attractive coupon for purchasing this 3-course Bundle. However, with this course, you&#039;ll have all the basic information and knowledge required to execute these three specific strategies on a consistent basis.</p><p>The courseware is arranged in such a manner where we start with the differences between the two instruments, and lead into the more advanced tactics. All Stock traders and even some Options traders will find this material very useful. The final 3 videos explain how Stock traders can use simple Options strategies to significantly enhance their performance in Stock trading itself.</p>", 
    "end_date": null, 
    "title": "High performance Stock Trading using key Options techniques", 
    "price": "20.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474212_2f5c.jpg", 
    "course_url": "https://www.udemy.com/high-performance-stock-trading-using-options-trading-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T15:50:31Z"
}