{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>PLEASE FIRSTLY WATCH THE INTRODUCTORY VIDEO ABOVE!</em><br></p><p>Welcome to the High Frequency Trading course<strong> part 1: Basics, History and Strategies.</strong></p><p>My name is Igor Neunyvakin and I will be leading you through the course. I started my career as a financial analyst and trader in the Adekta company and even during my years in a university I started to manage a million-dollar fund. In a while, I switched to the sphere of technologies and became a consultant on financial markets in the Cognitive Finance Technologies company, which was developing matching systems for stock exchanges as well as trading terminals. Working hand-in-hand with many talented programmers and engineers, I was able to learn High Frequency Trading Forex, Stocks &amp; Commodities \"from the inside\" and understand it not only as a trader, but also as a technical expert.</p><p>My series of courses on High Frequency Trading on Forex, Stocks &amp; Commodities is intended for those people, who are interested in everything about financial markets and trading. After going through these courses you will know all the intricacies of High Frequency Trading: conceptions, strategies, technologies; you will destroy many myths and misconceptions about HFT on Forex, Stocks &amp; Commodities and will find a crystal clear understanding of how all the things work in reality. But that doesn't mean that it's necessary for you to start from the very first course, all of them are pretty independent, so you can start with this one…</p><p>From this <strong>Part1</strong> you will learn basics of high frequency trading, the story of its origin, as well as popular HFT-strategies in the modern world.</p><p><strong>During this first part of course series we will talk about:</strong></p><ul><li>various ways of High Frequency Trading definition, as a key to understand the profitability and potential difficulties for HFT traders;</li><li>we will look at the story of HFT in order to understand modern trends of its further development;</li><li>we will also discover main types of High Frequency Trading strategies, as well as their differences and features.</li></ul><p>The ideal student for this course is a beginner or already experienced trader, who already knows basic concepts of financial markets and trading and would like to widen his or her knowledge in such a popular, but widely misunderstood sphere, as High Frequency Trading on Forex, Stocks &amp; Commodities.</p>", 
    "end_date": null, 
    "title": "High-Frequency Trading #1: Basics, History & Strategies", 
    "price": "20.00", 
    "instructors": "WFAToolbox Team, Igor Neunyvakin", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600316_422a_2.jpg", 
    "course_url": "https://www.udemy.com/high-frequency-trading-1-basics-history-strategies-forex-stocks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T12:43:06Z"
}