{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to the High Frequency Trading course <strong>part 2: Structure, Instruments and Infrastructure.</strong></p>  <p>The series of courses on High Frequency Trading is intended for those people, who are interested in everything about financial markets and trading.  After going through these courses you will know all the intricacies of High Frequency Trading: conceptions, strategies, technologies; you will destroy many myths and misconceptions about HFT and will find a crystal clear understanding of how all the things work in reality. But that doesn't mean that it's necessary for you to start from the very first course, all of them are pretty independent, so you can start with this one…</p>  <p>From this Part2 you will learn about market structure change during the last few years, best trading assets for HFT, and infrastructure requirements of today's markets.</p>  <p>During this second part of course series we will talk about:</p>  <p>- dramatic changes of market structure during the last few years, and how this affected the strategies of traders;</p>  <p>- we will look at all the features, advantages and disadvantages of these new market entrants, such as ECN and Dark Pool, which are absorbing the vast majority of HFT traders;</p>  <p>- we will discover which trading assets are best suited for HFT;</p>  <p>- we will look on modern infrastructure requirements of today's markets: microseconds do count...</p>  <p>The ideal student for this course is a beginner or already experienced trader, who already knows basic concepts of financial markets and trading and would like to widen his or her knowledge in such a popular, but widely misunderstood sphere, as High Frequency Trading.</p>  <p>Feel free to take a look through the course description and click “Take This Course” button when you are ready. See you inside!</p>", 
    "end_date": null, 
    "title": "High-Frequency Trading #2: Market Structure & Instruments", 
    "price": "20.00", 
    "instructors": "WFAToolbox Team, Igor Neunyvakin", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631276_afe3_2.jpg", 
    "course_url": "https://www.udemy.com/high-frequency-trading-2-market-structure-instruments/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T12:57:35Z"
}