{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is for Entrepreneurs, Start-ups and Small businesses owners who feel <strong class=\"redactor-inline-converted\">overwhelmed </strong>by the endless amounts of information on what numbers and metrics you should use to help you with managing your business finances.\n\n  </p>\n\n<p>In only<em> 90 minutes</em> i will simplify and demystify your business numbers so you can build your <strong class=\"redactor-inline-converted\">own specific </strong>Personal and Business Finance model. Using some simple, easy to use templates,  understanding and populating the numbers will be easy and effortless.<br></p><p>If you want to grow a profitable business, safe in the knowledge you won’t get caught short on your money situation, this is the course for you!<br></p>\n\n\n\n<p>Learn \n\n  </p>\n\n\n\n<p>1.       How to set yourself effective budgets which will help you with managing your spending with <em class=\"redactor-inline-converted\">little effort</em>\n\n  </p>\n\n\n\n<p>2.       The much misunderstood<strong class=\"redactor-inline-converted\"> secret of effective cash management</strong> for small businesses owners. This will instantly give you insight into where your cash is getting trapped in your business and will help you to release cash back into your business so you can pay yourself more. \n\n  </p>\n\n\n\n<p>3.       How to measure the few but <strong class=\"redactor-inline-converted\">critical</strong> numbers for your business. This will allow you to keep track and grow your business, without having to spend hours every month on financial management.\n\n  </p>\n\n\n\n<p>4.       How to spend in the ‘right way’ so you don’t end up in a damaging spiral of debt.\n\n  </p>\n\n\n\n<p>5.       What are the immediate actions you need to take, where your model is flagging that you may be about to run out of cash?\n\n  </p>\n\n\n\n<p>6.       How to understand how to calculate my<strong> 2 most important </strong>sets of data which will help take your business to a £1m+ turnover company.</p>", 
    "end_date": null, 
    "title": "How to Grow your Small Business and not run out of Cash", 
    "price": "30.00", 
    "instructors": "Hayley Chiba", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787508_046d.jpg", 
    "course_url": "https://www.udemy.com/how-to-grow-your-small-business-and-not-run-out-of-cash/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T16:35:17Z"
}