{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In today's world, day trading is becoming increasingly popular especially in the volatile job market. Anyone can earn 30% return in a month on his capital through day trading and that too from home. But 70% of the starters fail due to lack of knowledge. No one needs to be an expert in technical analysis to succeed in day trading but everyone should know some working techniques.</p><p>A professional day trader uses some interesting and useful techniques in their trading. I also fall in the same category being a whole time trader for more than 8 years in Indian stock market.</p><p>In this course, I have demonstrated some very easy and effective trading techniques for the newcomers in day trading. These techniques are very useful and quite easy to follow. Anyone can be a successful day trader by using these simple methods.</p><p>This course features variety of trading examples which is very useful as learning accelerators. Whether you are a novice student or an intermediate investor or an advanced trader, this course can surely boost you up and can take you to the next level.</p><p>The goal of this course is to enable people to be self-sufficient in day trading.</p><p><strong>What you are getting from this course?</strong></p><ul><li>Over 27 lectures and more than 2 hours of content!</li><li>Basic concept of Technical analysis</li><li>Detailed discussion on the effective day trading strategies</li><li>Entry and Exit level determination through Fibonacci scales</li><li>Profit booking techniques using basic candlestick patterns</li><li>Effective usage of technical indicators in day trading</li><li>Four detailed Case Studies on popular stocks to illustrate profitable entry and exit levels</li><li>Numerous exercises, reference materials and quizzes</li></ul>", 
    "end_date": null, 
    "title": "How to become a successful day trader", 
    "price": "30.00", 
    "instructors": "Moonmoon Biswas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507778_a34b_2.jpg", 
    "course_url": "https://www.udemy.com/a-successful-day-trader/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T04:27:49Z"
}