{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This How to Read Financial Statements training will introduce the student and/or entrepreneur to the meaning behind the terms and descriptions included in the financial statements for small business entities. The author, John Whiteley, CPA has taken a practical approach to explaining the objective and content of the financial statements, based on his 25 years, plus, experience serving small business clients in all types of industries.</p><p>The busy entrepreneur will be able to quickly complete the course as well as find answers to specific questions about a financial statement.</p><p>The course contains 66 brief individual lectures which are grouped into eight different sections, including accounting definitions, income statement, retained earnings, cash flow, accountant&#039;s year end services, third party interests and financial indicators. The course expands on the areas of interest by the different third parties, including entrepreneurs, business owners, lenders, IRS and investors.</p><p>Each of the major financial statements types, is examined as to its content and the significant information conveyed to the reader.</p><p>Upon completion of the course, the student should have a better understanding of the information provided by financial statements and will be able to arrive at a more informed decision as to the financial position and operating status of a small business corporation.</p>", 
    "end_date": null, 
    "title": "How to Read Financial Statements", 
    "price": "20.00", 
    "instructors": "John Whiteley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589778_4d1d_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-read-financial-statements/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T19:42:14Z"
}