{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want be profitable on derivatives market? Do you want to earn as much as you spent analyzing value of the assets? It is not secret for professionals that key to success on the market is the right valuation. 90 percent of the people loose money on the market. Why? Because they use legacy approaches to valuation (Black and Scholes). Rationalism comes first when you trade on financial market. Therefore, we need new formula that explains value of the option. Let me present you my approach to option valuation. It is based on value investing strategy and covers all parameters of valuation of option. First, we get fair value of underlying asset than calculate accuracy of our forecast,  then we find difference between strike and fair price weighted on accuracy. Finally we find time value of money. Summarizing these parameters we get fair value of the option. It's new but its of high quality. Check it professionals will really enjoy this approach as it fully covered with logic of professional market trader and analysts. I started traded 13 years ago and got a team that traded using value investing principles. I managed best fund in Russia for 2004, was one of the best 3rd tier equity traders in Russia with result of 5300% on \"Tverskoy excavator\", closed 400% deal with IKEA on \"Domostroitel\" shares and much more. All that was reached because of the understanding market rationalism and fairness. i have many proprietary formulas and techniques of valuation of assets. It helped me reach these extraordinary result. Hope my approach will help you reach high profits. </p>", 
    "end_date": null, 
    "title": "How to trade options", 
    "price": "45.00", 
    "instructors": "Mr Andrei Li", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613944_f7ec_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-trade-options/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T17:41:05Z"
}