{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>*Course Fully Updated for June 2016</strong><br></p>\n\n<p>The don’t call me “The Trading Profit” for nothing. I have literally helped thousands of students become better, more profitable traders through my unique strategies taught on Udemy. One of the things I am well known for is trade adjustments. I advocate using special techniques to fix losing trades. In fact, many times it is possible to take a losing trade and turn it around into a winner!<br></p>\n\n<p>I’m excited to announce that I have a brand new killer strategy to teach you. I never thought I would reveal this system. It’s my bread and butter. It allows me to <u>win over 95% of my trades</u> with extremely little risk and a very high profit potential. In fact, it’s one of the safest systems there is in my experience. Plus, I can win in virtually every market environment…If the trade stays flat I can make money, if it goes down I can make money, and if it goes up I can make money!\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>One of the best things is that you can trade this strategy in only 30 minutes per week! And you don’t have to be in front of your computer while the market is open. You can simply enter your trades in the evenings after work, or whenever is convenient for you.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>It’s my most profitable trading strategy. It’s very low risk with huge income potential. It’s so reliable you can count on it for extra monthly income. I’ve never revealed this system to anyone before, until now. And you are lucky enough to be one of the first to get your hands on it. </p>\n\n\n\n\n\n\n\n<p>You will learn:\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          The strategy basics\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          How to setup your brokerage account\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          The best way to structure the trade\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          A simple trick to create high probability trades that almost never fails\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          The most profitable ticker symbols to trade\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          Proper money management\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          How to fix a losing trade and turn it from a loser into a winner\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>-          How to use what you learn to make consistent profits from the comfort of your home\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>And much, much more…..\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Plus there will be some amazing bonuses at the end of the course that you won’t want to miss.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Click the button at the top right of your screen to begin taking this course now.   Every minute you wait is money you could be putting in your own pocket.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>You will get all future course updates for free, in addition to <u>unlimited email support from me for any questions that may arise</u>.  If for any reason you aren’t convinced this is absolutely the best way to make a fortune trading the markets, you are entitled to a no-questions-asked 30-day 100% money back guarantee.</p>\n\n\n\n\n\n\n\n<p>- Jeff Tompkins</p>", 
    "end_date": null, 
    "title": "How to Win Over 95% of Your Stock Trades in 30 Days or Less", 
    "price": "30.00", 
    "instructors": "Jeff Tompkins", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/834836_e671.jpg", 
    "course_url": "https://www.udemy.com/winningstocktrades/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-28T22:33:42Z"
}