{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">This course is not for everyone, only persons that will appreciate watching the live trades of a professional trader as this is not a teaching course but a Trade journal.</strong></p>\n\n<p>This is my <strong class=\"redactor-inline-converted\">live trading Journal</strong>, take this course if you want to see the live trades of a successful trader. If you are a beginner the only value in this course for you is learning how to use the MT4 trading platform and the value that comes from watching the live trades of a professional, <strong class=\"redactor-inline-converted\">of course there are techniques I apply that you can just mimic and apply to your own trading.</strong></p>\n\n<p> <strong class=\"redactor-inline-converted\">When you take this Forex course you will see my live trades, you will see how I make $1400,$2400, $3500 etc sometimes in hours</strong>. You can try and learn my techniques as I discuss each trade I take. <strong class=\"redactor-inline-converted\">I repeat this is not a teaching course</strong>, I will not teach you techniques people pay thousands to learn for free, but you can watch the process I use in analyzing the market and do your own research.</p>\n\n\n\n<p><em><strong class=\"redactor-inline-converted\">This course will be constantly updated with more lectures and Live trades</strong> </em></p>\n\n\n\n<p>This course is a compilation of some of my live trades, <strong>you will see where I entered the market, where I exited the market and hear my analysis as to why I took the trade</strong>. You will see some of the techniques I use to analyse the market such as wave analysis and VSRA analysis.</p>\n\n\n\n<ul><li>Lecture two is for beginners that are not familiar with the MT4 platform. In this lecture we discuss how to place a trade on the MT4 platform and how to customize the MT4 platform</li><li>Lecture four shows a live trade I took on the EURAUD gaining 140 pips and a profit of $2800. Watch as I discuss the reasons why I took this trade</li><li>Lecture six, this video shows a live trade I took on the USDCAD gaining approximately 150 pips and a profit of $2300 . Watch as I go through my analysis and discuss some of the reasons why I took this trade</li><li>Lecture seven shows a live trade I took on the AUDUSD gaining 60-70 pips . Watch as I go through my analysis and discuss some of the reasons why I took this trade</li></ul>\n\n<p>If you are a beginner after joining this course send me a message and I will give you access to my beginners course </p>", 
    "end_date": null, 
    "title": "How I Trade Forex Successfully ", 
    "price": 0, 
    "instructors": "Luciano Kelly", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662450_8dd5_2.jpg", 
    "course_url": "https://www.udemy.com/how-trade-forex-successfully/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T21:29:15Z"
}