{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What is this course about?</strong></p><p>This course will help students to do a multiple based valuation of a company. There are detailed practical concepts covered as well an excel based illustration to teach you a real life example of how to do a valuation. </p><p><strong>What kind of materials are used?</strong></p><p>The teaching materials include detailed videos on conceptual and practical understanding of doing a multiples based valuation. There is also an excel spreadsheet to teach you an illustration of multiples based valuation technique.<br></p><p><strong>Why take this course?</strong></p><p> Few reasons why you should take this course from us:</p><p>1) <strong>Best content: </strong>We have done all the research and combined the best practices used in the industry to create this course for you. This course is structured to give you an industry ready flavor of doing valuation.</p><p>2) <strong>Global expertise: </strong>We have extensive and global expertise in the field of financial modeling and business analytics domain. We have worked with global companies including marquee consulting and asset management companies to bring you the flavor of what is required to be in this league.</p><p>3) <strong>Your professional development: </strong>We promise to be with you to help you in all content related queries even after the completion of the course. You can always reach out to us to discuss any issues you might face in the course and anything related to this course from your workplace as well.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to do a multiples based valuation of a company", 
    "price": 0, 
    "instructors": "Skillfin Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/862786_5f57_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-a-multiples-based-valuation-of-a-company/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-29T11:46:31Z"
}