{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong></strong><strong></strong><strong>***UPDATED FOR 2016***</strong> </p>\n\n<p>  \t\t<strong>Now join the exclusive 3150+ VIP students who have changed their financial lives by taking this course to REPLACE YOUR FULL TIME INCOME BY TRADING PENNY STOCKS!</strong>  \t</p>\n\n<p>  \t\t\t\t    This course is designed for students of ALL LEVELS. In this step by step training course, you're going to learn exactly what you need to start making large sums of money by knowing the exact tactics and strategies to trade penny stocks.  \t\t\t</p>\n\n<p>  \t\t\t\t\t\t\t         You will learn the top techniques and methods that Wall Street traders use to make massive profits, no matter if the market goes up or down.</p>\n\n<p> This is a proven system for making consistently profitable trades AND generating income!  \t\t\t\t\t\t</p>\n\n<p>  \t\t\t\t\t\t\t\t\t\t         You will learn all the tricks, from the role of randomness in the markets (that few traders recognize), to characteristic trend patterns pointing to huge profit potential, to specific price action setups that take the guess work and stress out of consistent application.  \t\t\t\t\t\t\t\t\t</p>\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t         What would you do with an extra $5,000 a day? If you could finally <strong>make profits daily </strong>what would that mean to you?  \t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<strong>Would you</strong>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n<ul>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li><strong>Pay off your debts?</strong></li>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li><strong>Fund your retirement account?</strong></li>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<li><strong>Put your kids through college debt free?</strong></li>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</ul>\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t         My proven strategy works for ANYONE regardless of experience or technical knowledge. Furthermore, it can be used on stocks, commodities and has even produced life-changing gains in the Forex market. </p>\n\n<p>This simple, yet highly-profitable trading system can generate amazing profits consistently, safely and reliably. Elite Trend Trader quickly and easily allows anyone to find profitable stock trades regardless of experience.  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>\n\n<p>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t<strong>*For a limited time only, members who sign up also get access to InPennyStock VIP free of charge! Simply contact me after you enroll in this course and you will be given access to a free trial of InPennyStock VIP\"</strong>  \t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "How to Replace Your Full Time Income By Trading Penny Stocks", 
    "price": "20.00", 
    "instructors": "Mubarak Shah", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/252396_6771_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-5000month-trading-penny-stocks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-29T05:30:26Z"
}