{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is geared toward students who have traded stocks or forex and want to trade futures. The course will introduce you to the background basics of futures and goes into the specifics required to properly select the correct contract dates to trade for the tightest spread and best liquidity (front month). Once you have understood the basics required we get into more advanced  strategies that are tailored to work best with futures. Having a strategy that is optimized for the market you trade will increase profitability and allow you to become an expert oil, index, or ag trader. This is a strategy you can use on a daily basis.</p><p>You'll learn how to apply conditional logic (If/Then statements) in your trading. This makes your approach to entering an order more automatic and easier to understand. </p><p>Instead of guessing and riding the emotional roller coaster you can refer to your checklist.</p><p>Did you know most traders with less than 5 years of full time experience still report feelings of angst, disgust, or extreme happiness?</p><p>Traders who don't have a plan they can follow everyday often end up searching for the next best thing, or what I like to call the holy grail. </p><p>Instead of searching for something that is probably unrealistic or too good to be true I found that letting go of subjective emotions and sticking to a plan. had more consistent results. </p><p>That's why I created the rules of engagement.  </p><p>It's a set of steps, or a system if you will of analyzing the market to see if an opportunity for entry exists. When there is no opportunity then there is no trade. It's that's simple. </p><p>This sounds great in hindsight but it's really based on statistics and probabilities, something that in the end always proves to be true since it's based on math. </p><p>Much of the content in the course is taken from the LIVE trade room where these same rules are followed in front of hundreds of live traders. In fact you will often see open trades with PnL displayed, something rarely seen in other trader education videos.</p><p>Traders who learn to follow a systematic rules based strategy that desribes exactly what to do immediately increases there performance. </p><p><br></p>", 
    "end_date": null, 
    "title": "How to Trade Futures for Massive Profitability and Longevity", 
    "price": "20.00", 
    "instructors": "Bruce Levy", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581598_12c6_9.jpg", 
    "course_url": "https://www.udemy.com/futures-day-trade-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-12T21:27:57Z"
}