{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h4>  <p>  \t&quot;<strong>The number one problem in today&#039;s generation and economy is the lack of financial literacy</strong>&quot; - Alan Greenspan,  Chairman of the U. S. Federal Reserve  1987 to 2006  </p>  </h4>  <p>  \tIf you are in business, you need to speak the language.  No matter if you’re in sales, marketing, manufacturing, purchasing, accounting, or finance, you need to speak the language of business.  Perhaps you own a small business or are an entrepreneur starting a business… or you need a better job and are thinking about going to business school… or you provide legal and consulting services to businesses.  You’ll be more credible, make better decisions, and enjoy more success if you speak the language of business.  </p>  <p>  \t<strong>The Importance of Financial Statements in Today’s World</strong><strong></strong>  </p>  <p>  \tThe language of business is encapsulated in financial statements.  Financial statements provide a scorecard for how a business is doing.  Over a series of years, it provides a map of the business’s performance.  Managers judge the success of their business with financial statements.  Investors make intelligent investing decisions with financial statements.  In addition, people in the business world are being held more accountable for their financial statement practices since Enron and WorldCom.  They need to know what goes into financial statements.  </p>  <p>  \t<strong>Learn to Read Financial Statements, Not Prepare Them.</strong>  </p>  <p>  \tJust as you don’t need to understand how to make a car in order to drive one, <strong>you don’t have to understand bookkeeping to read financial statements</strong>. I&#039;ve prepared a course that eliminates the bookkeeping drudgery and concentrates on the end product of accounting, how to read financial statements, not how to prepare them.  </p>  <p>  \tLike climbing a spiral staircase, I will teach you how to read three real company’s financial statements (Whole Foods, Sherwin Williams, and Facebook), starting with the simple and progressing to the complex, interspersing the statements with key accounting terms and concepts to help you build expertise.  </p>  <p>  \tSounds good? Here is exactly what we will cover:  </p>  <ul>  \t<li><strong>Read Financial Statements</strong><span>. What is a balance sheet, income statement and statement of cash flows and how each is different</span></li>  \t<li><strong>Quick Look: Read Financial Statements of Whole Foods</strong><span>. What are the major line items on Whole Foods’ balance sheet, income statement and statement of cash flows</span></li>  \t<li><strong>Where the numbers come from: Accrual Accounting Basics</strong><span>. What are some basic accounting concepts, why we can’t measure profits with cash, and why we need a separate statement for income and cash flow</span></li>  \t<li><strong>Deep Dive: Read Financial Statements of Sherwin Williams</strong><span>. What each line item means on Sherwin Williams’ balance sheet, income statement and statement of cash flows</span></li>  \t<li><strong>Test What you have learned: Facebook Case Study</strong><span>. A 28-question quiz about Facebook’s balance sheet, income statement and statement of cash flows with feedback</span></li>  \t<li><strong>What the Financial Statements Tell You Through Ratios</strong><span>. How to interpret a company’s performance with four ratios: return on equity, profit margin, asset turnover, and financial leverage. How to compute these ratios for Sherwin Williams and dig into their annual report for insight. How to compare financial statements among four different industries (distribution, manufacturing, service, and financial service)</span></li>  </ul>  <p>  \tThe course contains 20 three-to-eight-minute-videos each followed by a multiple-choice quiz. A case is provided for Facebook.  </p>  <p>  \tThe course will take 100 minutes to view the videos and another 45 minutes to take the quizzes and do the Facebook case.  </p>  <p>  \tAre you ready? Let&#039;s do this.  </p>", 
    "end_date": null, 
    "title": "How to Read Financial Statements:  Build Financial Literacy.", 
    "price": "20.00", 
    "instructors": "David Johnson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306360_f699.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-read-financial-statements/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T20:00:51Z"
}