{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t Financial Statements of Business Unit basically comprises Profit &amp; Loss Statement (Income Statement) and Balance Sheet. Income Statement will convey where as Balance Sheet will convey the financial position of the unit.  </p>  <p style=\"\">  \t Financial Statements will be used by various stake holders for various purposes.  </p>  <p style=\"\">  \t Investors will analyse the financial statements before taking decision to invest in Business Unit.  </p>  <p style=\"\">  \t Investors will analyse the financial Statements before lending money to the Business Unit.  </p>  <p style=\"\">  \t Tax and Statutory Authorities will review financial statements for levying various Taxes.  </p>  <p style=\"\">  \tHence the financial statements will be used by various stake holders. Therefore every key personnel and every one working in an Organization&#039;s balance Sheet before stake holders raises unanswerable Questions.  </p>  <p style=\"\">  \tDeveloping the skill to read Balance Sheet will help the Business units to understand their standing and analyse strength and weakness and plan for future.  </p>  <p style=\"\">  \tOne should develop the skill to read the Balance Sheet from various perspectives. This course will you provide all those perspectives.4  </p>  <p style=\"\">  \tThis course has been designed in self paced learning style. Hence, Learners will able to understand the concepts at their own place, timing and Convenience.  </p>  <p style=\"\">  \tNumerous and illustrations has been used to make the understanding process simple and clear .  </p>", 
    "end_date": null, 
    "title": "How to Read a Balance Sheet", 
    "price": "50.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258894_37bb.jpg", 
    "course_url": "https://www.udemy.com/how-to-read-balance-sheet/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T10:26:25Z"
}