{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>ATTENTION: </strong></em><em><strong>The <strong>CENSORED </strong>Truth About <strong>Workplace 401K Plans</strong> You Won't Read About in the Financial Media.</strong></em></p>\n\n<p><strong>   AS SEEN ON:</strong><em> <strong>NBC</strong>, <strong>ABC</strong>, <strong>CBS</strong>, and <strong>FOX</strong>!<strong> </strong></em><br></p>\n\n\n\n\n\n<p><em><strong><em>Updated Monday, May 23, 2016, 10:41 A.M.</em></strong></em></p>\n\n\n\n\n\n<p>Have you seen the <strong>PBS FRONTLINE</strong> documentary “<em>The Retirement Gamble</em>\" that aired on <em>April 23rd of 2013</em>? It struck a chord with <strong>Dr. Brown</strong> as he lay in his four poster bed in one of the most upscale neighborhoods in <em>San Juan</em>.</p>\n\n\n\n\n\n<p><strong>BULLET-PROOF 401K SUPERCHARGER</strong> teaches you how to employ his advanced doctoral knowledge of finance to avoid the pitfalls PBS journalists uncovered. It was eerie to watch <strong>PBS FRONTLINE</strong> correspondent Martin Smith realize that his retirement is underfunded in part because of the secret costs that come with a 401(k).</p>\n\n\n\n\n\n<p>This scathing documentary reveals the problem you face — that <strong>Dr. Brown</strong> has been helping those close to him — as well as his <em>MBA students</em> at the <strong>University of Puerto Rico Graduate School of Business</strong> with for quite some time. Forbes succinctly summarizes this as \"<em>Our retirement plan system is rigged to rip off Americans struggling to save for retirement.</em>\"</p>\n\n\n\n\n\n<p>“<em>The Retirement Gamble</em>\" identifies these dangers facing you today... </p>\n\n\n\n\n\n<p><strong>1.</strong> Just a minority of Americans have enough saved to cover a lengthy life as a retiree </p>\n\n\n\n\n\n<p><strong>2. </strong>Why our patchwork mess of retirement systems is a gold vein for financial predators in 401(k) and 403(b) plans. </p>\n\n\n\n\n\n<p> Benefit #1: Squash Wall Street's cockroaches before they squash you</p>\n\n\n\n\n\n<p><strong>3. </strong>The U.S. government will not protect your retirement from Wall Street goons. </p>\n\n\n\n\n\n<p><strong>4.</strong> No retirement adviser is as trusted as yourself. </p>\n\n\n\n\n\n<p><strong>5.</strong> Many plan participants don't know what they are invested in. </p>\n\n\n\n\n\n<p> <strong>Benefit #2: Learn why you should avoid annuities</strong></p>\n\n\n\n\n\n<p><strong>6. </strong>The God Father of index funds, <strong>John Bogle</strong> of <em>Vanguard</em> fame, points out that a 7% yield collapses to 5% under a low 2% annual fee. </p>\n\n\n\n\n\n<p><strong>7.</strong> Diversify away from your employer plan into multiple IRAs you alone control. Here are some quick solutions...</p>\n\n\n\n\n\n<p><strong>Benefit #3: </strong>Plan Screening...</p>\n\n\n\n\n\n<p>Check your <strong>401(k)</strong> or <strong>403(b)</strong> against this <em>national database</em>. Some employer sponsored plans are so bad you may want to consider not contributing. Doc Brown will show you a powerful alternative to your <strong>employer sponsored 401(k)</strong> or 403(b) plans fewer than 5% of Americans understand. Yet this alternative is available to all. </p>\n\n\n\n\n\n<p>Inside <strong>Dr. Brown</strong> will teach you how to carefully determine whether you should just say \"<em>no</em>\" to your current <strong>employer sponsored 401(k) plan</strong>. </p>\n\n\n\n\n\n<p>Even with a good plan you will contribute just up to the matching. Scott will teach you why you should never make the full contribution if you do not own the company. </p>\n\n\n\n\n\n<p>Discover why you should never contribute to an employer sponsored 401(k) with no matching. </p>\n\n\n\n\n\n<p><strong>Alternative Retirement Accounts...</strong></p>\n\n\n\n\n\n<p>Discover how to sock away even bigger wads of hard-cash-money in a <strong>Roth IRA</strong>. Scott will show you a secret way to invest in a Roth IRA even if your accountant or financial planner (wrongly) tells you that your income is too high. </p>\n\n\n\n\n\n<p><strong>Dr. Brown</strong> has proven that it is possible with the results he has garnered for his own family. </p>\n\n\n\n\n\n<p><strong>How to Find Low Cost Funds...</strong></p>\n\n\n\n\n\n<p>He will show you how to identify the lowest-cost mutual funds in your plan. Imagine saving up to 9% per year in fees!</p>\n\n\n\n\n\n<p><strong>How to Pay Your Family Forward...</strong></p>\n\n\n\n\n\n<p>You may have tens or even hundreds of thousands of dollars in your portfolio that you have simply forgotten. <em>Discover the most convenient steps to roll your old 401(k) or 403(b) retirement plans forward.</em> How to get money laying around off your ex-bosses' tables and out of their sticky fingers from that that old job you didn't like. </p>\n\n\n\n\n\n<p> <strong>Benefit #4: </strong>Develop a realistic approach to all of your retirement income streams. </p>\n\n\n\n\n\n<p><strong>How to Save, Save, and Save Even More...</strong></p>\n\n\n\n\n\n<p>How to set yourself up to take Social Security benefits. </p>\n\n\n\n\n\n<p><strong>Best Places to Retire...</strong></p>\n\n\n\n\n\n<p>He'll cover the best places to retire as you thrive in outliving your assets. </p>\n\n\n\n\n\n<p> <strong>Benefit #5: </strong>Avoid bad countries and nasty living locations. </p>\n\n\n\n\n\n<p><strong>How to Escape the Retirement Gamble...</strong></p>\n\n\n\n\n\n<p>\"<em>The Retirement Gamble</em>\" made enough of a stir to prompt a \"<em>piece about the piece</em>\" on <strong>MoneyWatch</strong>. The author emphasizes that underhanded dealings range from \"active funds that come with high fees and indecipherable disclosures\" to annuities sold to financially unsophisticated teachers where guaranteed returns were misrepresented. <strong>MoneyWatch</strong> concludes that \"<em>The Retirement Gamble</em>\" discloses abuses <strong>Allan Roth</strong> sees every day.</p>\n\n\n\n\n\n<p>He criticizes <strong>Christine Marcks</strong>, President of <strong>Prudential Retirement</strong>, of feigning ignorance of these abuses and hard evidence that indexing beats active investing.</p>\n\n\n\n\n\n<p>In <strong>BULLET-PROOF 401K SUPERCHARGER</strong> you'll discover a series of steps that will both protect your money from a catastrophic market crash AND maximize your 401K in the process. </p>\n\n\n\n\n\n<p><strong>Forbidden 401K Secrets your Boss Doesn't Want You to Know!</strong></p>\n\n\n\n\n\n<p>More importantly, you will tap into...</p>\n\n\n\n\n\n<p> <strong>Benefit #5: </strong>You'll be able to use the lowest cost strategy.</p>\n\n\n\n\n\n<p>Garner the highest likely return, that has dramatically grown our plans over the years. You'll learn:</p>\n\n\n\n\n\n<p> <strong>Benefit #6:</strong> A simple website to rank the cost of the selections in your 401K plan...</p>\n\n\n\n\n\n<p> <strong>Benefit #7: </strong>How you can beat the actively managed mutual fund managers at their own game with simple low cost index funds... </p>\n\n\n\n\n\n<p> Benefit #8: Why you should only invest up to the matching in your <strong>employer sponsored 401K</strong>...</p>\n\n\n\n\n\n<p> <strong>Benefit #9:</strong> What to do with the rest...</p>\n\n\n\n\n\n<p> <strong>Benefit #10: </strong>How to guarantee that your 401K survives the next wipeout...</p>\n\n\n\n\n\n<p> <strong>Benefit #11</strong>: How you can open an individual 401K even if you only earn a salary...</p>\n\n\n\n\n\n<p> <strong>Benefit #12:</strong> How to sidestep taxes on tens of thousands of dollars of otherwise taxable income per year with these simple tricks...</p>\n\n\n\n\n\n<p> <strong>Benefit #13: </strong>The truth about so-called \"emerging markets\" -- and why you should avoid them like the plague...</p>\n\n\n\n\n\n<p> <strong>Benefit #14:</strong> The only investment in your plan that will allow you to ride out the next crash without worry... </p>\n\n\n\n\n\n<p> <strong>Benefit #15: </strong>How to spot the lowest cost indexed fund most likely to double, triple, or quadruple your 401K in this or the next bull market...</p>\n\n\n\n\n\n<p>And much, much <strong>MORE</strong>...</p>\n\n\n\n\n\n<p><strong>Here's Your Elevator to the Leisure Class</strong></p>\n\n\n\n\n\n<p>In conclusion and in his own words: </p>\n\n\n\n\n\n<p>\"Join right now.I am waiting inside now to help you,</p>\n\n\n\n\n\n<p><strong><em>-Dr. Scott Brown</em></strong></p>\n\n\n\n\n\n<p><em>Associate Professor of Finance of the AACSB Accredited Graduate School of Business of the University of Puerto Rico.\"</em></p>\n\n\n\n\n\n<p><em><em><strong>P.S. </strong></em></em><em><em><em><em>30 DAY UNCONDITIONAL MONEY BACK GUARANTEE!</em></em></em></em></p>", 
    "end_date": null, 
    "title": "How to Build a Massive Retirement Plan from Scratch!", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532836_2c7a_3.jpg", 
    "course_url": "https://www.udemy.com/take-the-bulletproof-401k-super-charger-rat-race-off-ramp/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T11:40:53Z"
}