{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">What this course is about?</strong><br style=\"\"></p><p>This course is a practical one where we teach you how to make a financial model for projecting the financial position of a company in the future. In particular we look at estimating the income statement, balance sheet and cash flows statement and establish the linkage between them</p><p><span><strong style=\"\">What kind of materials that you will find?</strong></span><br style=\"\"></p><p><span>There is a video that consists of  a recorded exercise that we go through to understand the course. In the video, we are working through an excel spreadsheet which will be also be available to you for your practice.</span></p><p><strong style=\"\">How long will the course take to complete?<strong style=\"\"></strong></strong></p><strong style=\"\"></strong>The course will take around 1 hour to finish. But we strongly recommend that you practice the exercises on your own to understand the model and be able to do it on your own.<p><br style=\"\"></p><p><span></span><strong style=\"\">H</strong><strong style=\"\">ow is the course structured?</strong><br style=\"\"></p><p>The course is structured in a series of lectures. In each lecture, we look at one critical aspect of financial modeling before we move to the next one. Hence, it is recommended that you watch the videos in a sequence and not jump from one to another.</p><p><strong style=\"\">Why take this course?</strong><br style=\"\"></p><p>This course is meant for both entrepreneurs who are looking to make their financial statements to secure funding from bank or investors. The course is also useful for current and prospective analysts with consulting, private equity, investment banking, equity research, corporate planning profiles.</p><p><strong style=\"\"></strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "How to make an integrated financial model-template attached", 
    "price": "20.00", 
    "instructors": "Skillfin Learning", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/493014_f39f_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-an-integrated-financial-model/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-04T05:37:07Z"
}