{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><strong>Do you want to work in finance but do not have the time and money to enroll in an MBA? Continue reading…</strong><br></strong></p><p><strong>Instructor Bio:</strong><em> \"Gennaro Cuofano</em><em> matured international experience for over Ten years between Europe and US. After graduating from Law School, he worked for a while in the legal field. His passion for finance and international business brought him to become an International MBA, with concentration in Corporate Finance. </em></p><p><strong>Course Summary:</strong><br></p><p>Did you know that when you read you just retain 10% of the information?</p><p>What is the best way to retain information then?</p><p>Numerous researches showed that when you put in practice what you just learned 75% of the information is retained in the long-term. For such reason this course has been structured around the “case study methodology.\" The same used in Business Schools. </p><p>If you are a newbie willing to learn the inside out of accounting in the most effective way, join “The Udemy Accounting Case Study\". </p><p>You will learn:</p><ul><li><strong>How to record Journal Entries</strong></li> <li><strong>How To build a General Ledger, Balance Sheet, Income Statement</strong></li> <li><strong>How all the main financial statements are intertwined</strong> </li></ul><p><strong>Build the foundation that will lead to a successful career in finance</strong><br></p><p>A deeper understanding of the above topics will make your life much easier as financial analyst.</p><p><strong>Content and Overview</strong></p><p>Suitable for students who want to become financial analysts or undertake a career in finance, <strong><em>you will get the following benefits</em></strong>:</p><ul><li><strong>Become extremely knowledgable about accounting, financial statements and ratio analysis. </strong></li><li><strong>Build a strong theoretical and practical foundation of the discipline. This will give you an invaluable edge over your competition. Many \"know-how\" of things but few know \"why.\" </strong></li><li><strong>Become invaluable for your organization.</strong> </li></ul><p>How? </p><ul><li><strong>Extra Exercises and over Ten Quizzes! </strong></li><li><strong>The E-Book \"The Accounting Guide.\"</strong></li><li><strong>Excel Spreadsheets to practice what you learned!</strong><span></span></li></ul><p>The knowledge acquired in over 10 years of experience in the financial world is distilled in few hours. Indeed, Gennaro Cuofano, your instructor, managed a team within the accounting and finance department of an Investment Firm, based in California. There, he learned how accountants communicate. Now he wants to share his knowledge with you!</p><p>In addition, together with the over ten case studies and quizzes you will learn how to build your financials using excel. Follow the learning process that will give you access to years of practical and theoretical information. Indeed, in addition to the practical material you will have free access to the theoretical course \"How to become a financial analyst from scratch\". </p><p><em>“You have to understand accounting and you have to understand the nuances of accounting. It's the language of business and it's an imperfect language. <em>“Unless you are willing to put in the effort to learn accounting – how to read and interpret financial statements – you really shouldn't select stocks yourself\"</em><em> </em><strong>Warren Buffet</strong></em></p><p>Get ready for this exiting journey!</p>", 
    "end_date": null, 
    "title": "How to Become an Accountant from scratch!", 
    "price": "20.00", 
    "instructors": "The Four-Week MBA", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569436_ee65_3.jpg", 
    "course_url": "https://www.udemy.com/the-udemy-case-study/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T17:26:53Z"
}