{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Trading in the financial markets is like a great game of chess. The amateur looks only at the board in front of them. The professional is already thinking 3 moves ahead. If we are going to trade well, then we have to be prepared for multiple outcomes. In other words, making money in the FX markets takes brains and not biceps.</p>\n\n<p>This course on the \"psychology\" of trading is designed to give you the edge you need. There are things that you don't know that can hurt you. We have learned that trading is really all about limiting losses from the \"bad\" trades. Maximizing rewards from the \"good\" trades. While that is a simple concept it is incredibly difficult to achieve. Why? Because our mental make-up gets in the way. We must first recognize how we feel and are likely to act under certain circumstances, be that a profitable or unprofitable trade. Once we recognize the error in our decision making process, we can start to take corrective actions.</p>\n\n<p>I have studied and traded the financial markets for almost two (2) decades. I traded for a New York based firm and ran their options division. I have seen the best and worst of traders. I am 100% convinced that it all comes down to the \"psychology\" of the trader. I believe the concepts taught in this course are invaluable. They are the most important messages that I can share, enjoy!</p>", 
    "end_date": null, 
    "title": "How to be a Profitable Forex Trader", 
    "price": "20.00", 
    "instructors": "Corey Halliday", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717278_7a08_5.jpg", 
    "course_url": "https://www.udemy.com/making-money-in-forex-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T17:03:57Z"
}