{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course teaches you <strong>how to trade Pump and Dumps</strong>. And Yeah!, it relates directly to the movies such as <em><strong>The Wolf of Wall Street</strong></em> and <em><strong>Boiler Room</strong></em>. They are Pumpers and we gonna trade these Pumps.</p><p>In this course, I show you <strong>five very precise patterns</strong>. I explain them in detail: <strong>we go variable by variable for each of them.</strong> After, for each setup, I show <strong>numerous Real Chart Examples.</strong> Of course, there is one theoretical chapter where I explain the logic behind Pump and Dumps, the different types of news and the markets that we gonna trade. But, the rest of it is practical. Besides the patterns, I teach what you have to watch in <strong>the Level 2 and Time &amp; Sales</strong>, I explain <strong>how to find the Pumps</strong>, I explain <strong>the importance of adapting to the market</strong> and much more!</p><p>I am <strong>Prop Trader in the company United Traders</strong> located in Russia, Moscow. I trade Stocks In Play and Pumps. I took the trading courses in the United Trades and it cost me 1000$. I took the courses from one fo the SMB Capital, prop firm located in NYC, traders to learn how to read the tape (Time &amp; Sales). Also, I watched some DVDs from other gurus like Nathan Michaud (InvestorsLive). <strong>So, I know a lot of things about trading and I want share it with you!</strong></p>", 
    "end_date": null, 
    "title": "How to Trade Pump and Dumps", 
    "price": "20.00", 
    "instructors": "Vladislav Hubar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790034_0919.jpg", 
    "course_url": "https://www.udemy.com/how-to-trade-pump-and-dumps/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-11T19:58:01Z"
}