{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      A review of the key concepts and principles of International Accounting Standard 10 (IAS 10) on Events After Reporting Period.  </p>  <p>  \t      The course includes theoretical principle lectures including a detailed discussion to teach the difference between adjusting and non-adjusting events after the reporting period. These principles are then illustrated practically in class examples that focus the practical application of the theory in an interactive manner.  </p>  <p>  \t      You will need to download the lecture slides and work through the lecture videos and the class examples.  </p>  <p>  \t      The course is structured to assist three categories of delegates who require knowledge of International Financial Reporting Standards (IFRS):  </p>  <ul>  \t<li>Students studying accounting at university;</li>  \t<li>Candidates studying to pass board and professional exams;</li>  \t<li>Professionals looking to keep up to date with continuing professional education.</li>  </ul>  <p>  \t      The Tabaldi approach is practical and our lecturers focus on making the sometimes complex principles of financial reporting simple and practical.  </p>  <p>  \t      You will need to engage with the lecturer with pen in one hand and calculator in the other, mental application and a proactive approach will ensure that you master this topic under financial reporting and accounting.  </p>", 
    "end_date": null, 
    "title": "IAS 10 - Events After Reporting Date", 
    "price": 0, 
    "instructors": "Tabaldi Accounting Education", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/191588_f9eb_3.jpg", 
    "course_url": "https://www.udemy.com/ias-10-events-after-reporting-date/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T09:32:40Z"
}