{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t     A review of the key concepts and principles of International Accounting Standard 12 (IAS12) on Accounting for Income Taxes, with a focus on accounting for Deferred Tax.  </p>  <p>  \t     The course includes theoretical principle lectures include a high level conceptual summary of deferred tax and lectures to get an understanding of the tax base definitions. These principles are then illustrated practically in class examples that focus on journalising the recognition and measurements principles contained in the standard.  </p>  <p>  \t     You will need to download the lecture slides and work through the lecture videos and the class examples.  </p>  <p>  \t     The course is structured to assist three categories of delegates who require knowledge of International Financial Reporting Standards (IFRS):  </p>  <ul style=\"\">  \t<li>Students studying accounting at university;</li>  \t<li>Candidates studying to pass board and professional exams;</li>  \t<li>Professionals looking to keep up to date with continuing professional education.</li>  </ul>  <p>  \t     The Tabaldi approach is practical and our lecturers focus on making the sometimes complex principles of financial reporting simple and practical.  </p>  <p>  \t     You will need to engage with the lecturer with pen in one hand and calculator in the other, mental application and a proactive approach will ensure that you master this topic under financial reporting and accounting.  </p>  <p>  \t     Deferred tax is a topic that appears to require some form of dark  magic to understand, but once you understand the core principles the calculations and disclosures become logical and principle driven!  </p>  <p>  \t  Please note that this course does not cover more advanced topics such as deferred tax on capital gains assets, changes in tax rates nor carryforward of unutilised tax losses. these will be covered in subsequent courses on deferred tax.  </p>", 
    "end_date": null, 
    "title": "IAS 12 - Accounting for Income Taxes (Basics)", 
    "price": 0, 
    "instructors": "Tabaldi Accounting Education", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/199822_a047.jpg", 
    "course_url": "https://www.udemy.com/ias-12-accounting-for-income-taxes-basics/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-16T08:20:47Z"
}