{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tAre you a Non Resident of India?  </p>  <p>  \tAre you staying outside India but earn income from India?  </p>  <p>  \tAre you in India but earn Income from outside India?  </p>  <p>  \tAre you confused or not clear about tax aspects of Income received in and outside India?  </p>  <p>  \tThen this course is for you.  </p>  <p>  \tThis course is going to take you through the fundamental legal aspects related to Income Tax and Residential status.  </p>  <p>  \tYes. Residential status determines your Income Tax in India and for that it is immaterial whether you are Indian Citizen or not.  </p>  <p>  \tEven foreigners are liable for tax in India, if they have income in India.  </p>  <p>  \tSimilarly, Indians will have tax on income earned outside India.  </p>  <p>  \tThere are legal nuances in this course will explain you all that.  </p>  <p>  \tBy taking this course, you will have access to the concepts explaining  </p>  <p>  \ta) Residential Status of a Person  </p>  <p>  \tb) Residential Status of Individuals  </p>  <p>  \tc) Resident but Ordinary Resident  </p>  <p>  \td) Resident but not Ordinary Resident  </p>  <p>  \te) Non Resident  </p>  <p>  \tf) Residential Status of Hindu Undivided Family  </p>  <p>  \tg) Residential Status of Companies  </p>  <p>  \th) Scope of Total Income  </p>  <p>  \ti) Total Income of three categories of Assesses.  </p>  <p>  \tj) Income received or deemed to be received in India.  </p>  <p>  \tk) Income deemed to accrue or arise in India  </p>  <p>  \tThis course is structured in Self paced learning style.  </p>  <p>  \tTake this course to understand the nuances of Income Tax for Non Residents.  </p>", 
    "end_date": null, 
    "title": "Income Tax for Non Residents of India", 
    "price": "20.00", 
    "instructors": "CA Raja Natarajan, B.Com., PGDBA, FCA", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414784_660d.jpg", 
    "course_url": "https://www.udemy.com/income-tax-for-non-residents-of-india/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T05:42:16Z"
}