{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This new course starts from the grounds of financial statements and show how they are obtained in the first place. Then it expands on the three main financial statements: balance sheet, income statement and cash flows, by showing their advantages and disadvantages, what they tell and what they hide from the viewer, how they differ from each other and how they are linked. We will focus a lot on the cash implications of financial statements, and by the end of this course we will be able to use cash flows to evaluate the health of a company and we will be able to understand, prepare and analyze “most wanted” financial ratios. Moreover, we will grasp what you need to know on adjacent subjects like weighted average cost of capital, valuation methods, mergers and acquisitions, currency translation and others. Every topic is presented from an industry best practice perspective and is accompanied by a final quiz to test your progress. Besides using small study cases that illustrate particular areas, we will be accompanied throughout the course by a four year period financial data of a study company, for which we will recreate and interpret together the cash flow statements and ratios for three years. It shall be optional, however advisable, that you will continue our endeavor and derive the cash flows statement and ratios, together with their interpretation, for the last year of the analysis. No worries, I will provide permanent assistance should you need additional help to finalize the homework.</p>    <p>If you’re a finance student, an entrepreneur or a finance professional willing to expand on financial statements knowledge, this course if for you, as you will find a lot of new or untold information, perfectly structured and covering all hot topics.  If you’re rather new to finance matters, this course if perfect to build a solid knowledge, however you should be at least familiarized with the finance jargon. However, even if you did not experienced financial statements before, the course content does not leave you with missing pieces for the financial statements puzzle.  Basic mathematical skills are a prerequisite and you will also need access to a computer with installed Microsoft Excel and basic Excel skills to finalize the analysis.  </p>    <p>This course consists of videos lectures and shall require more than three hours of your time, with estimations for the homework analysis to account for another three hours.   </p>    <p>I am assured that after taking this course, you will be confident in analyzing financial statements and be able anytime to prepare and interpret the cash flow statement and the financial status for any given company. </p>    <p>Let’s get started! </p>", 
    "end_date": null, 
    "title": "Interpreting financial statements with a focus on cash flows", 
    "price": 0, 
    "instructors": "Gabriel Dragne", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627772_fed1_3.jpg", 
    "course_url": "https://www.udemy.com/financial-statements-focused-on-cash-flows/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T08:23:05Z"
}