{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Durante años, las opciones se mantuvieron fuera del alcance de los inversionistas aficionados ya que se consideraban difíciles de entender o riesgosas.  La realidad y la experiencia de los inversionistas profesionales han demostrado que las opciones son instrumentos rentables, eficientes y estratégicos cuando se utilizan de manera adecuada.  Adicionalmente, permiten establecer un nivel de riesgo predeterminado para que el inversionista pueda calcular de antemano la cantidad de dinero que está dispuesto a arriesgar en el mercado.  </p>  <p style=\"\">  \t    El mundo del trading está lleno de &quot;gurús&quot; que pretenden convencer a los inversionistas aficionados sobre sus estrategias milagrosas y trucos para ganar dinero rápido.  En nuestra opinión profesional, invertir dinero en los mercados financieros es un asunto serio y es necesario educarse antes de invertir dinero en estrategias de trading que el inversionista no entiende.  </p>  <p style=\"\">  \t<strong style=\"\">Aprenda y domine los siguientes temas sobre opciones financieras en nuestro curso introductorio</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t    ·Conceptos fundamentales sobre las opciones.  Entienda que son el activo subyacente, la fecha de vencimiento, la prima y el strike price.  \t</p>  \t<p style=\"\">  \t\t    ·Clasificación de las opciones.  Aprenda la diferencia entre opciones call, put, americana, europea, bermuda, plain vanilla, asiática, con barreras, lookback y binarias.  \t</p>  \t<p style=\"\">  \t\t    ·¿Cómo se determina el valor de una opción? Entienda los factores que determinan el precio de una opción.  \t</p>  \t<p style=\"\">  \t\t    ·Combinaciones de opciones o &quot;spreads&quot;.  Aprenda cómo funcionan estas estrategias y utilícelas para inversión o cobertura.  \t</p>  \t<p style=\"\">  \t\t    ·Cuenta de inversiones de práctica.  Siga los pasos para abrir una cuenta de inversiones donde se utiliza dinero ficticio para practicar todos los conceptos y estrategias en un ambiente libre de riesgo.  \t</p>  </ul>  <p style=\"\">  \t    Existen muchos tipos diferentes de opciones financieras y cada una de ellas tiene características particulares.  Un inversionista educado es capaz de analizar cada estrategia de trading y evaluar los costos y beneficios asociados a ella.  De lo contrario, el inversionista está confiando en un sistema desarrollado por otra persona que puede tener objetivos y riesgos diferentes al suyo.  </p>  <p style=\"\">  \t    Este curso te ayudará a obtener los conocimientos necesarios para entender las estrategias de trading de opciones más comunes y te abrirá las puertas a cursos intermedios y avanzados de opciones y otros derivados financieros.  El curso está dirigido a todas las personas que quieren aprender qué son las opciones, para qué sirven, y cómo funcionan los mercados de opciones.  </p>  <p style=\"\">  \t<strong style=\"\">Contenidos y metodología</strong>  </p>  <p style=\"\">  \t    Nuestro curso utiliza animaciones, gráficos y diagramas para ayudarte a entender los conceptos básicos de las opciones así como sus principales clasificaciones de una forma amena.  A continuación, te enseñamos como se determina el precio de una opción y cuáles son los factores que lo componen.  Una vez tengas claro cómo funcionan las opciones financieras, te enseñamos a utilizar combinaciones de opciones o &quot;spreads&quot; para que puedas predeterminar el nivel de riesgo de tus inversiones.  Con nuestra ayuda, puedes implementar todo esto en la plataforma de trading para simular las estrategias mientras te preparas para invertir con dinero real.  </p>", 
    "end_date": null, 
    "title": "Introducción al trading de opciones", 
    "price": 0, 
    "instructors": "Quant- Trading", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/400464_d049_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-opciones-basico/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-21T21:29:01Z"
}