{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Are you interested in studying bookkeeping or accounting but don&#039;t know where to start?  Are you studying for your first year professional Bookkeeping exams or Financial Accounting exams (ACCA, CPA) and need to do some exam prep? Do you want to refresh bookkeeping and accounting skills from the past?</p><p style=\"\"><strong style=\"\">INTRODUCTION BOOKKEEPING AND ACCOUNTING</strong></p><p style=\"\">Bookkeeping and Accounting is not for everyone, but a rounded business person will understand how to keep proper and correct books.  If you are a small business owner, or part of a larger organisation, having bookkeeping and accounting knowledge is a must have business skill.</p><p style=\"\"><strong style=\"\">CONTENTS AND OVERVIEW</strong></p><p style=\"\">We will first look at the role of a bookkeeper and the importance of that role in the business accounting process.  We will then examine different types of business documents and reasons for document retention, filing and security. After we describe different types of transactions, we will then explain the terms Assets, Liabilities, Capital, Income and Expenditure.  In addition to this we will also carry out some calculations using the Accounting Equation.</p><p style=\"\">This course is short but comprehensive, and will take you about 30 min to watch all the tutorials. This course houses a fantastic question bank on the topics covered, ensuring the learner has the opportunity to apply their understanding to examples, making this course ideal for those taking first year professional Bookkeeping exams or Financial Accounting exams (ACCA, CPA) and want some additional help.</p><p style=\"\">In addition to this, this course also contains detailed notes, and a chance to interact with other learners and the instructor, via the course community discussion board, and life time access. </p>", 
    "end_date": null, 
    "title": "Introduction to bookkeeping and Accounting", 
    "price": "20.00", 
    "instructors": "Paula Guilfoyle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576946_d5d0_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-bookkeeping-and-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T23:18:02Z"
}