{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Imagine you get a test back from your professor, the stated grade is a D. You look up at your professor and ask for comments and criticism to help re-evaluate your work. How would you expect to otherwise achieve a different result without identifying the problem and rectifying it?  </p>  <p>  \t  In this analogy financial accounting information is what gives us the opportunity to look back in hindsight and fix any problems.  </p>  <p>  \t<strong style=\"\">Financial accounting is the language of business.</strong> In business, we use financial accounting to report everything we do. Whether it’s paying our employees, issuing a dividend to shareholders or purchasing a capital asset, we report it. By record keeping we ensure that we have a history of every economic transaction. Summarizing all of these transactions into financial statements provides us with a general snapshot of our performance and position in the marketplace. <strong style=\"\">Having this financial information at our fingertips is key to future planning and decision making.</strong>  </p>  <p>  \t  When we start our introduction to financial accounting you’ll familiarize yourself with the principles that can be applied to business scenarios, time and time again.  </p>  <p>  \t  Get ready to crunch some numbers as we explore topics like..  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Basic Financial Elements</strong></li>  \t<li style=\"\"><strong style=\"\">The Conceptual Framework of Financial Accounting</strong></li>  \t<li style=\"\"><strong style=\"\">The Double Entry Accounting System</strong></li>  \t<li style=\"\"><strong style=\"\">Policies to Account for Assets, Liabilities and Equity</strong></li>  \t<li style=\"\"><strong style=\"\">Financial Statement Preparation</strong></li>  </ul>  <p>  \t<br style=\"\">  \t  I look forward to discussing any questions you might have in class! :)  </p>", 
    "end_date": null, 
    "title": "Intro Financial Accounting Crash Course: Earn an A+ Today.", 
    "price": "20.00", 
    "instructors": "Dave Burrell", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403468_78ed_7.jpg", 
    "course_url": "https://www.udemy.com/university-level-introduction-to-financial-accounting/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T10:53:12Z"
}