{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                Do you want to transition your career into the payments industry?   Have you just started a project in the payments space?   Are you looking for a concise overview on payments terminology, methods, key industry players, and emerging trends?<br style=\"\">  \t<br style=\"\">  \t                This is an exciting time in the global payments industry with innovation in online and offline payment technology.    Consumers are starting to understand the advantage of using mobile devices for payments, rather than transacting in cash and credit cards.   Innovative  startups and established Financial Services players are offering fantastic career opportunities in the payments space.<br style=\"\">  \t<br style=\"\">  \t                In addition to rapidly evolving technology, complex regulations make it difficult to enter the payments space.  For example, Dodd Frank establishes a new regulatory framework for cross-border payments.   If you manage projects in the in payments space you must have a fundamental knowledge of the regulatory environment.<br style=\"\">  \t<br style=\"\">  \t                The course will cover the following topics:  </p>  <ul style=\"\">  \t<li style=\"\">  Payments Terminology and Acronyms such as AML, SWIFT and ACH</li>  \t<li style=\"\">  Regulatory agencies including the Fed, OCC and FDIC</li>  \t<li style=\"\">  Legislations e.g., BSA, USA Patriot and Dodd Frank</li>  \t<li style=\"\">  Market Environment including Banks, Credit Card Providers, Gateways and eWallets Providers</li>  \t<li style=\"\">  Payment Types e.g., cheques, ACH, Wires, Cards and Virtual Currencies</li>  \t<li style=\"\">  Payment Processing including statuses of a payment lifecycle</li>  \t<li style=\"\">  Industry Standards such as ISO and SEPA</li>  \t<li style=\"\">  Application programming interfaces (APIs)</li>  \t<li style=\"\">  Trends in mobile payments, virtual payments and emerging markets</li>  </ul>  <p style=\"\">  \t                Payments knowledge is critical in almost any role and industry sector – B2B, B2C and C2C.   If you are starting a new job as an Analyst, Engineer, Manager or Sales Representative in the payments industry this course will introduce you into digital payments in a nutshell.<br style=\"\">  \t<br style=\"\">  \t                Sign up for this course to learn the fundamentals of digital payments today!  </p>", 
    "end_date": null, 
    "title": "Introduction to Digital Payments ", 
    "price": 0, 
    "instructors": "Martin V., PSM, PMP, CSSBB", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/189996_08c4_3.jpg", 
    "course_url": "https://www.udemy.com/payments/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-27T23:48:55Z"
}