{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Many companies and individuals seeking loans from banks or private lenders can’t meet the rigid collateral requirements imposed by these lenders.  They might try asking family and friends for a loan, but that often proves difficult if not impossible.  As a result they are forced to seek funding elsewhere. <br></p>  <p>But where, how and from whom?</p>  <p>The purpose of this course is to introduce you to the world of equity finance.  Companies, big, small, established, start-ups and would-be-entrepreneurs from all over the world raise money via this method 24/7.  It involves the offer and sale of a portion of your businesses to investors through what are known as securities or stock in the case of a corporation.  This is a way in which you can raise enormous amounts of money, often within weeks, even though you are a start up, your business has failed, you lost your job, and you have no credit.  </p>  <p>The course details: </p>  <ul><li>what you have to do in order to comply with the law before, during and after raising money; </li><li>the different choices you have through which to raise money; and,</li><li>how to raise money using one of those choices.</li></ul>        <p>The course can be completed by reading one or more chapters at a time and can then be used as a future reference guide. </p>  <p> No prior experience or formal educational requirements are necessary to understand this course and no training material is required.</p>  <p><strong></strong></p>", 
    "end_date": null, 
    "title": "Introduction To The World Of Equity Finance", 
    "price": "20.00", 
    "instructors": "FINANCIAL ADVISER AMFSG (American Financial Services Group)", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607800_3683_3.jpg", 
    "course_url": "https://www.udemy.com/equity-finance-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T08:48:22Z"
}