{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Why Health Financing?<br></strong>Health financing is a key building block of a health system. In their efforts to reach universal health coverage, governments across the globe are introducing various health financing reforms, shifting from pure tax based or insurance-based mechanism to a more mixed form of financing. In this current scenario, competency in health financing is an important asset for both professionals and policy makers. Unfortunately, one of the major challenges faced by low and middle income countries is the lack of human resource with the required expertise in health financing.  It is to bridge this gap, skills and competence in health financing is needed.</p><p><strong>Objectives of the course</strong><br>Health financing aims to build the competency of participants in describing, implementing and analyzing a health financing system or scheme. At the end of this course, the participants will be able to describe a health financing scheme in a structured manner, implement a scheme in their region and will be able to analyse the performance of a scheme and suggest corrections.  </p><p><strong>About the Instructor<br></strong>This course is organized and taught by <strong>Dr. N. Devadasan, </strong>an expert on health financing with experience from the grass root level to policy level in this subject. He is a visiting faculty in many universities and is also a member of various committees on health financing.</p><p><strong>Recommended Background<br></strong>The course is beneficial for all those interested in health financing, health insurance, etc. </p><p><strong>Course structure and duration<br></strong>This course is divided into three sections with about <strong>3-4 classrooms</strong> in each section. To effectively complete the course, you will need about <strong>5 hours</strong>. </p>", 
    "end_date": null, 
    "title": "Introduction to Health Financing ", 
    "price": "25.00", 
    "instructors": "Dr. Narayanan Devadasan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/740764_45df_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-health-financing/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T08:55:57Z"
}