{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Se puede aprender contabilidad en una hora sin necesidad de tener ningún conocimiento previo anterior.  Es evidente que en una hora no se convertirá en un experto contable, pero sí que aprenderá  de forma clara los conceptos básicos de esta ciencia  que le permitirán avanzar con seguridad en el estudio de esta disciplina, si así lo desea. En este curso trataremos los conceptos básicos de la ciencia contable, los cimientos de esta disciplina:</span>  </p>  <ul>  \t<p>  \t\t·La ecuación fundamental de la contabilidad  \t</p>  \t<p>  \t\t·Que son el activo y el pasivo  \t</p>  \t<p>  \t\t·Sabrá confeccionar e interpretar el Balance de situación  \t</p>  \t<p>  \t\t·Cuáles son las distintas clases de activo y el pasivo y que significan  \t</p>  \t<p>  \t\t·Que son los ingresos y los gastos y cómo se genera el resultado de la empresa  \t</p>  \t<p>  \t\t·Confeccionar e interpretar la cuenta de resultados  \t</p>  \t<p>  \t\t·Aprenderá a hacer asientos contables  \t</p>  \t<p>  \t\t·Aprenderá lo que es el Libro Mayor y el Libro Diario y cómo funcionan  \t</p>  \t<p>  \t\t·Tendrá una visión general de todo el ciclo contable  \t</p>  \t<p>  \t\t·Introduciremos conceptos avanzados de contabilidad como las amortizaciones, las periodificaciones y el Cash Flow  \t</p>  </ul>  <p>  \tEl curso está dirigido a todas aquellas personas que tienen un interés en la contabilidad y necesidad de entenderá en un periodo corto. Entre ellos están los estudiantes de economía, finanzas o Derecho que tienen en su Plan de estudios esta asignatura.  El curso de contabilidad en una hora será  también de provecho para profesionales que, de una forma u otra, se encuentran en con cierta frecuencia con conceptos contables que deben saber interpretar; abogados ( por ejemplo, penalistas que intervienen en delitos económicos,  abogados mercantilistas, fiscalistas), periodistas  económicos etc. Por último, los empresarios o aquellos que aspiran a serlo encontrarán de gran utilidad familiarizarse con la contabilidad, ya que es el lenguaje de las empresas.  </p>  <p>  \tMi nombre es Emilio Álvarez Arjona, soy abogado, asesor fiscal y contable y, al margen de mi experiencia profesional de más de 25 años he sido profesor de diversas instituciones del máximo prestigio (Instituto de Empresa, Universidad Jaime I de Castellón) y de otros centros como el Centro Europeo de Empresas Innovadoras (“CEEI”) de Valencia. Llevo más de 25 años formando a equipos profesionales en las áreas del Derecho tributario y contable.  </p>  <ul>  </ul>", 
    "end_date": null, 
    "title": "Introducción a la contabilidad", 
    "price": "20.00", 
    "instructors": "Emilio Alvarez Arjona", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/307080_6726.jpg", 
    "course_url": "https://www.udemy.com/contabilidad-en-una-hora/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-24T18:53:03Z"
}