{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course is the identical material used in Accounting 200 (introductory accounting) at Brigham Young University, which is often cited as the #1 accounting program in the United States and World (London Financial Times 2013). Taught by the award winning professor and self-made millionaire, Norm Nemrow, this course will teach you the fundamentals of financial accounting better and more effectively than any course available today. We have run nearly 100,000 students through our courses over the last decade and now we making one of our main courses available on Udemy for FREE.  </p>  <p>  \t<strong>    ·5 out of 5 rating on Facebook with 250+ reviews  </strong>  </p>  <p>  \t<strong>    ·Developed and used at the #1 accounting university in the World  </strong>  </p>  <p>  \t<strong>    ·Mentioned in Wired Magazine, Gigaom, &amp; New York Times</strong><br>  \t<br>  \t     Let’s be honest, accounting has a negative stigma attached to it. Why? Because mainstream accounting education teaches students how to be nothing more than bean counters. Boring! We take a different approach; a better approach. In a nutshell, we teach students how to become business decision makers. Our goal is to give entrepreneurs the necessary tools so they can unleash their ideas and be successful in the open business market. Accounting is the language of business and a entrepreneur with a solid understanding of the fundamental principles of accounting can run a business and solve problems better than competitors who fail to learn these crucial concepts.  </p>", 
    "end_date": null, 
    "title": "Introduction to Accounting: The Language of Business", 
    "price": 0, 
    "instructors": "Professor Norm Nemrow", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302562_c781_3.jpg", 
    "course_url": "https://www.udemy.com/learnaccountingforfree/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-18T01:28:31Z"
}