{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course covers the bitcoin lending and investment world while also teaching some best practices learned after paper and financially testing these markets.  While students can enter these markets, they do carry risks, so learning what these risks are, as well as ways to reduce risks will help students prepare for them.  Since bitcoin is not a manipulated market, it can crash or rise to heights that other markets cannot achieve, therefore one must be careful about the level of volatility in bitcoin.</p>\n\n<p>People who are excited about testing a new and non-manipulated market, as well as people comfortable with risk will have the most to gain from testing bitcoin lending and investment, while people who are very risk-averse should avoid this course.  Using presentations, as well as images from actual returns received, I show students techniques for how one can reduce their risk.</p>\n\n\n\n<p>While the course is not long nor intended to consume time with presentations, I highly recommend that students watch the videos, look at the markets to get a feel for how these work, and come back to reviewing the videos again, while asking the instructor questions.  Students should be careful about taking blind risks and some of the content in the videos will be understood more after reviewing the sites.  All videos in this course are lessons learned after a few years of paper and actual trading and investing in these markets.</p>\n\n<p>In addition, this course offers a few write-ups for students who prefer reading assessments, along with video instruction.</p>", 
    "end_date": null, 
    "title": "Introduction To Bitcoin Lending", 
    "price": "50.00", 
    "instructors": "Tim Smith", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582896_11df_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-crypto-lending/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T10:08:36Z"
}