{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you're new to the modelling process, gain inside knowledge of the key factors critical to expert financial modellers.  Each short segment provides an overview of the key principles and best practice for Financial Modelling in Excel on a daily basis.<br></p>\n\n<ul><li>Assumptions Documentation<p>Documentation of assumptions is a critical point of best practice. Garbage in and garbage out!<br></p></li></ul>\n\n<ul><li>Linking Formulas vs \"hard-coded\" Values<p>Every input should have a single source cell in our model, so that any changes that are made flow right throughout the model.<br></p></li></ul>\n\n<ul><li>Bad Modelling Habits<p>It’s pretty easy to pick up Bad Habits. We'll look at a few bad modelling habits that are pretty common among Excel users!<br></p></li></ul>\n\n<ul><li>Formula Consistency<p>Consistent formulas within a block of data will make building your model quicker and easier, not to mention more accurate<br></p></li></ul>\n\n<ul><li>Clear Formatting and Labelling<p>Having your model’s Formatting and Labelling clearly and correctly laid out makes your model easier to find your way around – both for you and someone else trying to interpret your model!<br></p></li></ul>\n\n<ul><li>Tips and Tricks<br>You'll pick up lot of tips, tricks and shortcuts along the way</li></ul>\n\n<p><br>In each lecture, I’ll take you through one of the key principles, give practical examples of how to apply best practice to your financial models.  You’ll learn lots of tips and tricks on using Excel for the purpose of financial modelling.  </p>\n\n<p>As an <strong>added bonus</strong>, you’ll get an extra webinar recording on “Scenario Tools in Excel” which will teach you how to create scenarios in plain Excel without any add-ins or other software. Reduce uncertainty in decision making using built-in standard Excel tools to reduce volatility in outcomes by performing sensitivity and scenario analysis to mitigate risk.</p>", 
    "end_date": null, 
    "title": "Introduction to Financial Modelling Best Practice", 
    "price": 0, 
    "instructors": "Danielle Stein Fairhurst", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830916_3c86_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-financial-modelling-best-practice/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-24T23:42:45Z"
}