{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            Inefficiency strangles business growth.  Plain and simple, there are several obstacles that each and every accounting firm must overcome if they intend to successfully grow.  This is an introductory course to implement the 8 Pillars for Exponential Business Growth in an accounting firm. The 8 Pillars include:  </p>  <p>  \t<ol>  \t\t<li><strong>Operational Efficiency</strong> - Rapid growth in a firm has an interesting way of showing off problems in the underlying business model.  We will explore improving efficiency by digitizing data, implementing a project management mindset, automating workflow, and by determining if an alternative staffing model can assist you.</li>  \t\t<li><strong>Marketing and Networking</strong> - Marketing encompasses all activities that encourage a prospect to contact you in the first place.  Are you getting results for your efforts?  Networking, when done correctly, can be a highly effective way to deliberately build your accounting practice with quality clients.</li>  \t\t<li><strong>Sales </strong>- The sales process focuses on closing deals, signing up new clients, and maintaining relationships with existing clients.  Basically, this is the activity that converts your marketing leads and prospects into paying clients.</li>  \t\t<li><strong>Niche Building </strong>- Niche building is the intersection between marketing and sales and, arguably, the foundation for both.  What is your ideal client?</li>  \t\t<li><strong>Value Pricing </strong>- The traditional model of billing for services is based on a single formula:  hours worked multiplied by an hourly rate is equal to the fee to be billed.  This formula creates an inherent conflict of interest between you and your clients.</li>  \t\t<li><strong>Technology </strong>- Technology offers some very exciting opportunities if leveraged correctly.  Cloud solutions, in particular, offer opportunities for dramatic gains in efficiency and accuracy.  By embracing cloud solutions and giving careful consideration to your actual Information Technology needs, you can see dramatic cost decreases and significant efficiency gains.</li>  \t\t<li>V<strong>alue Added Services</strong> - Providing good services at fair prices will earn you trust and loyalty from your clients.  The great news is you can leverage this relationship to identify client issues and offer more in-depth solutions.</li>  \t\t<li><strong>Practice Management </strong>- The best run firms focus on key performance indicators in order to determine areas that need improvement.  Monitoring business results and seeking improvement are critical aspects of working on your business.</li>  \t</ol>  \t<p>  \t\t<p>  \t\t\t            The intent of this course it is to demonstrate the importance of the 8 Pillars to growing a traditional accounting practice. We will cover details in an intermediate and advanced course later on. We will also discuss action items that you can implement immediately in order to start building your accounting practice.  \t\t</p>", 
    "end_date": null, 
    "title": "Introduction to the 8 Pillars for Accountants", 
    "price": "20.00", 
    "instructors": "Jeff Borschowa", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/282044_f703_4.jpg", 
    "course_url": "https://www.udemy.com/8-pillars-for-accountants-introduction/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-16T15:03:28Z"
}