{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tRevenue is the lifeblood of the equity markets.  It is the basis for all valuation, and as such, the interpretation and the translation of revenue into stock price value (i.e. market capitalization) is an art that many would love to quantify.  Unfortunately, that quantification is not possible for fundamentalists, but nevertheless, studying revenue and its relationship to equity pricing serves as an immensely powerful investment “Edge” that allows a market participant to garner extreme returns once validated criteria is met.  This course takes the student through the basic understanding of trade theory as a foreshadow to a forthcoming multi-hour class based on the book, &quot;The Art of Revenue.&quot;  </p>  <p>  \t  The Art of Revenue is the fundamental analysis book that finishes the author’s life work of quantifying the markets in both fundamental and technical ways.  it is a standalone book that is more palatable for the masses, but it also serves as the true companion to the author’s first book, “The Market is not Random.”  It is these two works of marker-based teachings which complete the author’s definition of the true marketome, which ergo, proves once and for all that all markets are not random.  </p>  <p>  \tThis course teaches the basics of understanding reward to risk in the financial markets, which are critical informational tools that allow the trader to define specific entry and exit criteria.  </p>  <p>  \t  Further, the courses utilizes the instructors two published theories (Klatch&#039;s Price Theory and Klatch&#039;s Marketome Theory) in order to assert a basic ETF trading strategy that, given a long enough holding time, will be guaranteed to make the student money.  </p>", 
    "end_date": null, 
    "title": "Introduction to Trade Theory (Technical Analysis) For Stocks", 
    "price": "20.00", 
    "instructors": "Anthony Klatch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332690_27ea_4.jpg", 
    "course_url": "https://www.udemy.com/intro-price-theory-klatch-tminr/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T14:50:51Z"
}