{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>WARNING: DON’T EVEN THINK OF BUYING REAL ESTATE IN MEXICO UNTIL YOU COMPLETE THIS COURSE!</strong><br><strong></strong></p>\n\n<p><strong><em><strong><em>Updated Monday, May 23, 2016, 10:41 A.M.</em></strong></em></strong></p>\n\n\n\n\n\n\n\n<p>Your investing fate overseas need not be in the hands of <strong>ultra-nationalist machete wielding drunks</strong>, Chavista sex addicts, and French Civil Code imbeciles…</p>\n\n\n\n\n\n\n\n<p>And your problems don’t stop there. Even in “safe Europe” one of the <strong>PIGS [Portugal, Italy, Greece, or Spain]</strong> can expropriate your home or business in postcard perfect seeming locations such as the scenic South of Umbria. And then there are the bleeding <strong>liberals</strong> in the Northern “<em>civilized</em>” countries of Germany, Denmark, Sweden, Finland and Norway that have no problems hammering your returns with <strong>pork belly VAT taxes</strong>. </p>\n\n\n\n\n\n\n\n<p>Let’s face it, international investing is not a <strong>cakewalk</strong> without a guide. </p>\n\n\n\n\n\n\n\n<p><strong>WHAT YOU GET AND HOW IT WORKS!</strong></p>\n\n\n\n\n\n\n\n<p>This course offers you a concise <strong>overseas investing training</strong> based on fact from the halls of such erudite places as Harvard. </p>\n\n\n\n\n\n\n\n<ul><li><strong>Section 1:</strong> The General Themes of International Investing</li><li><strong>Section 2:</strong> International Real Estate</li></ul>\n\n\n\n\n\n\n\n<p><strong>COURSE UPDATE SCHEDULE</strong></p>\n\n\n\n\n\n\n\n<p><strong>February 15 &amp; 29: </strong><br></p>\n\n\n\n\n\n\n\n<ul><li><strong></strong><strong>Section 3:</strong> International Stock Markets [Forthcoming February 15 2016 — Tuition Increases to $49.99]</li><li><strong>Section 4:</strong> International Bond Markets [Forthcoming February 29 2016 — Tuition Increases to $99.99]</li></ul>\n\n\n\n\n\n\n\n<p><strong>March </strong><strong>15 &amp; 31: </strong></p>\n\n\n\n\n\n\n\n<ul><li><strong>Section 5:</strong> Tax Arbitrage [Forthcoming March 15 2016 — Tuition Increases to $199.99]</li><li><strong>Section 6:</strong> International Portfolio Management [Forthcoming March 31 2016 — Tuition Increases to $299.99]</li></ul>\n\n\n\n\n\n\n\n<p>I am not just a <strong>professor of finance</strong> at major state university but I am also a seasoned international investor with decades of experience since childhood. Read my <strong>Udemy profile</strong> for more detail regarding my credentials.</p>\n\n\n\n\n\n\n\n<p>The Benefits of this Course are T<strong>angible!</strong></p>\n\n\n\n\n\n\n\n<ol><li>Identify the markets with the best investor protection of your <strong>hard earned savings</strong> — shown by Ivy League economics research to offer highest expected returns.</li><li>Identify to avoid the markets most likely to give you <strong>bigger headaches and lower returns</strong> — that must be pondered with regard to local lifestyle rewards.</li><li>Find for yourself the <strong>safest markets</strong> and methods of overseas investing that best matches your personality and goals.</li></ol>\n\n\n\n\n\n\n\n<p>Here is just the tip of the iceberg of the buzz about my top rated <strong>teaching approach</strong> on Udemy ...</p>\n\n\n\n\n\n\n\n<ul><li>“<em>I love this! It's most powerful and effective when concepts are woven around a story, and this looks like it does just that. So much of investment advice seems like scattered bits and pieces, like studying history by memorizing a random bunch of dates and events. Without a narrative to tie it all together it has no meaning.</em>” <strong>-Dr. Joel Wade, California 1/19/2016</strong></li></ul>\n\n\n\n\n\n\n\n<p>Enroll now and get an <strong>amazing lifetime membership</strong> to guide your journey over the coming decades in international investing.</p>\n\n\n\n\n\n\n\n<p>Your tuition is protected by an <strong>ironclad 30-day money-back guarantee</strong> fulfilled by Udemy as third party.</p>\n\n\n\n\n\n\n\n<p>Enroll now before the <strong>next tuition hike</strong> on this course. You are missing international investment opportunities with <strong>every day that passes</strong>.</p>\n\n\n\n\n\n\n\n<p><strong>ENROLL NOW!</strong></p>\n\n\n\n\n\n\n\n<p>You can sit where you are right now like a <strong>mushroom in the dark</strong>. Or you can come out into the <strong>light of knowledge and reason</strong> when it comes to international investing overseas. </p>\n\n\n\n\n\n\n\n<p>Enroll now! I am waiting inside to guide your investment education,</p>\n\n\n\n\n\n\n\n<p><strong>-Dr. Scott Brown</strong></p>\n\n\n\n\n\n\n\n<p><em>Associate Professor of Finance of the AACSB Accredited University of Puerto Rico Graduate School of Business</em></p>\n\n\n\n\n\n\n\n<p><strong>P.S.</strong> Enroll now. Remember that as <strong>time passes</strong> you miss opportunity to ask questions of a major state finance professor regarding investing topics. This alone is <strong>worth $1,999</strong> per year at the most conservative world estimates. Enroll now. </p>", 
    "end_date": null, 
    "title": "Investing Internationally into Real Estate, Stocks and Bonds", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663022_c54b_3.jpg", 
    "course_url": "https://www.udemy.com/investing-internationally-into-real-estate-stocks-and-bonds/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T14:15:22Z"
}