{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>With stock prices stalling in 2016, THIS IS the <em>right </em>course at the <em>right </em>time! </strong></p>\n\n<p><em><strong>Good news: This course has just been updated with new lessons on \"My financial advisor isn't executing\" and \"You vs. You.\" Before you go any further ask: How much financial damage will you cause to yourself by not taking this course? Will it be more than the $50 enrollment fee? Stop the bleeding and learn how to eliminate the problem areas within your portfolio before they destroy your net worth. </strong></em></p>\n\n<p>Hidden flaws inside your portfolio are costing you thousands of dollars and possibly even more money than you think. Rising markets often mask these flaws. But falling markets expose and convert flaws in your IRA, 401(k), and other investments into major problems. <br><br>What's the problem with your investments? And why aren't you making as much money as you should be? Do you know? <br><br>Is your problem lousy performance? Excessive fees? A deadbeat financial advisor? Skyrocketing taxes?  Or, is it another hidden but deadly problem that hasn't yet been found? <br><br>Whatever it is that ails your IRA, 401(k) plan, and other investments, I will help you to identify and eliminate these problems <em>immediately*!</em> (*This is 100% dependent upon how well you follow my instructions.) You will no longer have to worry or guess what the root cause(s) of your investment problems are and you will be able to completely avoid  the common pitfalls that hurt the typical investor.  <br><br>Not only will I tell you about the kind of trouble that's probably hindering your investment performance, but I'm going to do even more. <br><br>You will get a sneak peek of actual real-life investor portfolios that I've graded - a few even worth millions of dollars - to teach you the birds and bees of successful investing. With your own eyes you will see the good, the bad, and the ugly.</p>\n\n<p><em>What this course is not:</em><br><br>I won't teach you anything that is theoretical, impractical, or illegal. <br><br>I won't teach you stuff that you can't execute or do inside your investment portfolio. <br><br><em>What you will get from me:</em><br><br>In this course, you will see real-life case studies of investment flaws I've successfully identified and fixed for investors just like you. I put my 20+ years of hands-on experience in the financial services industry to work for you!<br></p>\n\n<p>As the inventor of the Portfolio Report Report Card service and as the Founder of ETFguide, I have personally helped thousands with investors. </p>\n\n<p>If you want my professional insights and personal touch - remember I've already analyzed and executed more than $120 million in personalized Portfolio Report Cards for investors/students just like you - then you need to get this course right away. <br></p>\n\n<p>Together, we're going to completely remove and conquer the obstacles that are hindering your investment progress. <br></p>\n\n<p><strong>Every minute you delay is COSTING you money. </strong><strong>Enroll today!</strong></p>\n\n<p>+++++++++++++++++++</p>\n\n<p>...and you also get the unconditional Udemy backed 30 day money-back guarantee PLUS my personal promise that if you apply yourself, you will succeed. </p>\n\n<p><strong>How will I benefit from this course?</strong><br></p><ul><li>Learn how to seek and destroy the hidden problems inside your own portfolio</li><li>See real-life case studies of investors with six and seven figure portfolios</li><li>Cut your portfolio's tax liabilities by 20% and possibly more</li><li>Say \"good-bye\" to overpaid and under-performing financial advisors</li><li>Take immediate steps to reduce your brokerage commissions and fees in half</li><li>Increase the value of your investment portfolio many times over</li><li>Always be in control of your investments 100% of the time</li><li>Eliminate the anxiety and worry of investment risk</li></ul>", 
    "end_date": null, 
    "title": "Investing: How to Fix Hidden Flaws Inside Your Portfolio", 
    "price": "50.00", 
    "instructors": "Ronald DeLegge", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/572992_0e57_7.jpg", 
    "course_url": "https://www.udemy.com/investing-how-to-fix-hidden-flaws-inside-your-portfolio/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T01:12:53Z"
}