{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Investments and Financial Markets</strong> is a course designed to get you familiar with the various elements that practitioners and investors look at. I aim to take what is perceived as a complicated web of numbers and charts and break it down to its foundational elements. For the investment practitioners, the key takeaway is an overview of the elements of financial markets and how they interact with one another. This objective is reinforced by the practical examples that you are likely to encounter as you trade, analyze and invest. For the academic, I ensure that the relevant theory in all the financial markets are covered to ensure that the foundational elements are not overlooked.  </p>  <p>  \t          This course is biased towards developed markets, specifically, European, American and Asian markets. However, it is important to note that while certain elements are for these markets, the application and intuition behind each section and lecture is applicable to most financial markets. This is because the globalization and cross-country financial linkages has ensured similarities across trading practices and regulation. There is really something for everyone!  </p>  <p>  \t          We will start by looking at the broad categories of investments and drill further down into the elements of financial markets and their respective complexities. At each point I attempt to give you an example that encapsulates the concept at hand. Furthermore, at the end of the course there are quizzes that help you test your overall knowledge of the course.  </p>  <p>  \t          While the 19 lectures will take you approximately an hour and a half to complete, I would recommend setting aside 4-6 hours to really revise the content and look at look at more practical examples. However, I do recommend that you continuously revisit the lectures as your understanding gets more and more in-depth. Learning is best done through repetition!  </p>  <p>  \t          Get started and start learning!  </p>", 
    "end_date": null, 
    "title": "Investments and Financial Markets", 
    "price": "40.00", 
    "instructors": "Neville Mandimika", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255046_4af0_6.jpg", 
    "course_url": "https://www.udemy.com/investments-and-financial-markets/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-03T12:16:47Z"
}