{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Do you want to work alongside the best and brightest financial minds?</p><p style=\"\">Do you want exposure to senior management, gaining insight into how industry-leading executives view strategy and growth?</p><p style=\"\">Do you want to hone your analytical abilities, sharpen your attention to detail, develop financial modeling skills and learn how to compile presentations fit for the boardroom?</p><p style=\"\">Do you want to work in a challenging, fast-paced industry where you will learn transferrable skills and have the opportunity to break into private equity, join a hedge fund, start your own entrepreneurial venture or attend a top business school?</p><p style=\"\"><strong style=\"\">Then it sounds like you want to work at an investment bank!</strong><strong style=\"\"></strong></p><p style=\"\">But how do you break into Wall Street without a previous internship and without industry connections?</p><p style=\"\">How do you get experience, while needing experience?</p><p style=\"\">How do you go from an underdog candidate, to having more momentum than the top applicants from target schools?</p><p style=\"\"><strong style=\"\">This course provides an action plan for undergraduates and professionals looking to break into the competitive world of investment banking.</strong><strong style=\"\"></strong></p><p style=\"\">With 63 lectures and 4 hours of content we will cover the fundamentals of banking, the hiring and interview process and formulate a tailored networking approach that will allow you to land a job on Wall Street.</p><p style=\"\">Skeptical?</p><p style=\"\">I used the same tactics, scripts and techniques provided in this course to break into Wall Street without any family or personal connections, without a degree from an Ivy League institution and without prior internship or banking experience.</p><p style=\"\">But that&#039;s not all!</p><p style=\"\">We will also cover materials that will not only earn you a seat at an investment bank, but also allow you to succeed and excel as a top analyst.</p><p style=\"\">In addition, <strong style=\"\">I will personally respond to any questions</strong> you may have as you go through the material. I encourage you to invest in yourself and in these proven tactics that will help you land your dream job!</p>", 
    "end_date": null, 
    "title": "Investment Banking: How to Land a Job on Wall Street", 
    "price": "45.00", 
    "instructors": "Zachary Beukema", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511952_633a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-land-a-job-on-wall-street/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T16:50:22Z"
}