{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Latest: Course Last Update on Feb 28th, 2016</em></p><p><em></em><strong>Join Over 1900 Delighted Students Already Enrolled In This Course!</strong></p><p><strong><br></strong></p>      <p>  \t                    - If you want to <strong>learn more about the stock market </strong>and <strong>effective ways to start investing</strong> in it,  </p>  <p>  \t                                - If you are looking for <strong>w</strong><strong>ays to consistently beat the stock market</strong>,  </p>  <p>  \t                                - If you are looking for ways to consistently beat the stock market, while putting in a <strong>minimum amount of effort</strong>,  </p>  <p>  \t                                              This course will be perfect for you.  </p>  <p>  \t                                              This course aims to teach you the <strong>investment insights needed to identify extraordinary businesses</strong> and invest in them, not from a speculative point of view, but from a business like one.  </p>  <p>  \t                                              This course aims to show you how you can <strong>outsource most of the effort by relying on all kinds of costless web-based platforms, tools, analysis</strong>, and much more. The same ones that I use myself.  </p>  <p>  \t                                              The goal of this course is to make you a better investor, to provide you with a <strong>thorough &amp; practical understanding of how to search for, analyze and buy great companies</strong>' shares.  </p>  <p>  \t                                              This course is about teaching you how to <strong>protect your initial investment principal</strong> while laying out a good investment strategy for the years to come. This course is for investors with a mid to long term mindset.  </p>  <p>  \t                                            Note that there is a guaranteed 30 days refund, in case the course would not live up to your expectations. However, I have put in a lot of effort into creating the numerous lectures and I truly wish for you to become a better investor. So do not hesitate to give me your feedback if you have identified improvement points.  </p>  <p>  \t                                              Are you ready to become a better investor, realizing<strong> higher gains at lower risk</strong>?  </p>  <p>  \t                                              Are you ready to learn how to <strong>decrease your effort </strong>in doing the necessary due diligence?  </p>  <p>  \t                                              This course will help you – in just a couple of hours!  </p>", 
    "end_date": null, 
    "title": "Investing: How I Consistently Beat The Stock Market", 
    "price": "20.00", 
    "instructors": "Ruben Merre", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319020_21c5_2.jpg", 
    "course_url": "https://www.udemy.com/beat-the-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T18:15:15Z"
}