{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>New as of December 2015!</p><p><strong>Join over 1700 delighted students already enrolled! </strong></p><p>Companies that pay a dividend and that have a long &amp; consistent track record of raising those dividends year in year out (“<strong>aka dividend growth stocks</strong>”), have been <strong>historically proven to be an incredibly successful investment strategy</strong>. This strategy even outperforms, hence beats, the overall stock market, something that the majority of fund managers fails to do.</p>  <p>In this course you will find everything you need to know, <strong>from the basics all the way through to a step by step guide to building your own dividend growth portfolio from scratch</strong>. You can start this course as a beginner, and <strong>finish it as a well prepared and advanced dividend growth investor</strong>, ready to or already right in the middle of build(ing) your own portfolio.</p>    <p>The most difficult thing with investing is knowing where to start:</p>  <ul><li>What should you invest in?</li><li>Why? </li><li>What should you do if the stock price goes down? </li><li>When do you have to sell?</li><li>How can you earn above average returns consistently over time</li></ul><p><br></p><p>\n\nThis course aims to answer all those questions and is\ntherefore b<strong>uilt up into several sections:</strong><strong></strong><br></p><ul><li>Introduction to the course: short summary of everything you will learn in this course</li><li><strong>Proof: don’t just take my word for it</strong>, but let the research, historical performance of dividend growth stocks and my own portfolio results do the convincing</li><li>Introduction to dividends: all the basics you should ever know about dividends</li><li>Why would YOU want to become a dividend growth investor: once again, I thoroughly address why dividend growth investing is the strategy to follow and how it can actually make you insanely rich over time</li><li>Step by step guide to building your own portfolio: theory</li><li>Step by step guide to building your own portfolio: practice</li><li>Monitoring your dividend portfolio &amp; knowing when to sell</li></ul>          <p>This course aims to answer all those questions and is therefore built up into several sections:</p>                <p>In just 5 hours time, <strong>you can master this entire topic</strong> thanks to this condensed course!</p>", 
    "end_date": null, 
    "title": "Investing - Learn How to Build a Dividend Portfolio Step by Step", 
    "price": "20.00", 
    "instructors": "Ruben Merre", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584410_1512_2.jpg", 
    "course_url": "https://www.udemy.com/investing-learn-how-to-build-a-dividend-portfolio-step-by-step/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T10:14:27Z"
}