{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The world of technical analysis is a bewildering and confused mass of strategies, books, definitions, indicators and experts. You have probably noticed there are volumes of information out there about charts, systems, and methods for analyzing financial markets.</p>\n\n<p>So why is everyone still looking for a solution?</p>\n\n<p>Simply put, there is a difference between knowledge and application. In this game, you can understand a bunch of definitions and jargon and never develop the skill set for proper analysis.</p>\n\n<p>This course is a perfect solution for the beginner. It fills the need for a simple, effective method to analyze Price Charts and aims to close the gap between knowledge of technical analysis and real-world skills for making money and controlling risk. Experienced investors and traders will discover an excellent refresher for increasing profitability.</p>\n\n<p><strong>If You Have 1 Hour, You Can Learn How To Master Price Charts!</strong><br></p>\n\n<ul><li>What a Price Chart is and why you should use them</li><li>How to use FREE technical analysis tools on the internet</li><li>How to read price trends</li><li>How to control RISK</li><li>How to find GOOD investments</li><li>How to avoid BAD investments</li></ul>\n\n\n\n<p><strong>A Powerful Skill At Your Fingertip</strong><strong>s</strong></p>\n\n<p>Price Chart Analysis is a proven method for objectively managing risk and determining trends. Proficiency in technical analysis can build a foundation for creating a clear plan to buy and sell <em>ANY</em> investment.<br></p>\n\n<p><strong>Content And Overview</strong></p>\n\n<p>This course has 24 lectures with practice exercises and studies in each section to help you integrate course concepts and master the fundamentals more quickly.</p>\n\n<p>You will learn a simple, effective skill for reading trends, making money and controlling risk. All with the use of free internet tools, even if you know nothing about investing, trading or technical analysis.</p>\n\n<p>You will be guided every step of the way by a professional trader who uses Price Charts and technical analysis every day to profit from the financial markets.</p>\n\n<p>By the end of the course you will have acquired an analysis skill with all the tools required to make better investment and trade decisions</p>", 
    "end_date": null, 
    "title": "Investing And Trading For Beginners: Mastering Price Charts", 
    "price": "20.00", 
    "instructors": "Frank Bunn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739964_0b0f_2.jpg", 
    "course_url": "https://www.udemy.com/investing-and-trading-for-beginners-mastering-price-charts/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T15:06:02Z"
}