{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                            Do you want to start investing but have no idea where to begin?  </p>  <p style=\"\">  \t                            The best way to learn to invest is by actually investing. You don&#039;t need thousands of dollars to start investing on your own.  You can begin investing with less than $100  </p>  <p style=\"\">  \t                             In this course, I share 7 steps you can follow to start investing today. These same steps will allow you to continually increase your investment knowledge as your wealth grows.<br style=\"\">  \t<br style=\"\">  \t                            I&#039;m a former institutional money manager who spent over 15 years investing billions of dollars for institutions and high net worth individuals. I&#039;ve also researched and been mentored by some of the smartest money managers in the business, including top tier hedge funds.<br style=\"\">  \t<br style=\"\">  \t                    Like you, I started out not knowing how to invest. By following the steps I teach in this course, I not only learned how to invest, but I became a professional money manager and Chief Investment Strategist for a $30 billion investment advisory firm.<br style=\"\">  \t<br style=\"\">  \t                            This course follows the same teaching method I use in my popular personal finance show Money For the Rest of Us, the iTunes top-10 ranked podcast with over one hundred 5-star reviews.  </p>  <p style=\"\">  \t                    Similar to my weekly show, this course is filled with real-world examples, stories and personal experiences to help you internalize the investment principles.  </p>  <p style=\"\">  \t                  And I&#039;ll share insights from some of the smartest investors I know.  </p>  <p style=\"\">  \t                    Finally, I use screen recordings to show you actual trades and tools I use to implement the 10 steps.<br style=\"\">  \t<br style=\"\">  \t                            Curious and want to get a sense of my teaching style and whether the course is worth your time? Then listen to the introductory video and the first lesson for free.  </p>", 
    "end_date": null, 
    "title": "Learn To Invest In 7 Steps", 
    "price": "50.00", 
    "instructors": "J. David Stein", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322332_4dfd_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-invest/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-18T23:29:05Z"
}