{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">15 Audio accounting lessons with three e-books included: Accounting Cheat Sheet, Learn Financial Accounting Different, &amp; Learn Debits &amp; Credits.</p><p style=\"\">I took financial accounting three times as a history major and my grades were as follows: W, C, A. W stands for withdrawn, if you don&#039;t know. But after I received an A from an exceptionally clear instructor, everything became easy, so long as I dedicated enough time and studied to learn. I drew pictures, read financial statements of publically traded companies, sang songs, and listened to self-made recordings at bedtime. I could not afford any more mistakes after graduating in history during a financial crisis. Three years later I had worked in public accounting, passed all of my CPA exams on the first try, and nearly completed a masters in accounting with a 3.9 GPA – all paid for with credit cards. Now I work for myself and help students, life is good. With enough time and motivation there is nothing to stop you with this particular profession, class, or topic.</p><p style=\"\">Accounting is not just for businesses, but for any financial entity. And the most important entity of them all is you! Everyone spends money of some tangible kind, or intangible – in the form of trades and favors. Most of us do not need to know how to form a complete set of financials using journal entries; however, everyone should have an idea of what an income statement and balance sheet is. It is also helpful to understand that the value of money is constantly changing, referred to as the time value of money. It is a must to know what the five accounts are: assets, liabilities, equity, revenue, and expense.</p><p style=\"\">Please join me in the journey of learning accounting fast and different. Please contact me with any way that I may assist you along the way. Thanks.</p>", 
    "end_date": null, 
    "title": "Learn Financial Accounting Different", 
    "price": "20.00", 
    "instructors": "John Gillingham", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501502_70e7_5.jpg", 
    "course_url": "https://www.udemy.com/learn-financial-accounting-different/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T00:14:42Z"
}