{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Section 1 is on Call Options</strong>  </p>  <p>  \t Most people learning Options for the first time face too much jargon and complex language. This course use real-world examples (buying a house) to explain how a Call Option (Section 1) works in real life. This example should make it absolutely clear what a Call Option is in step-by-step details. The course first defines what Options are, and in particular, what a Call Option is. It explains the differences between Option buyers and sellers, and the differences in their risk and reward profile. Several basic Options concepts like At-the-money, Out-of-the-money, and In-the-Money Options, and Risk Graphs are also introduced in this course. The profit and loss graphs for all three types of Options are explained in clear terms using AAPL Options.  </p>  <p>  \t <strong style=\"\">Section 2 is on Put Options. </strong>  </p>  <p>  \t The Put Option is the ultimate &quot;protector&quot; of your portfolio, and in this course you can learn how Put Options work. It is the exact opposite of a Call Option. Put Options increase in value when the value of a stock or index drops in price. We define what a Put Option, and just like we did in the Call Option, we consider a real-world example of a Put Option. Fortunately, we have excellent examples of Put Options in real life - when we buy Insurance for our car or home, we are actually buying a Put Option. This example should make it absolutely clear what a Put Option is. The course looks at buyer and seller perspectives in a Put Option transaction, and analyzes the breakeven, and profit and loss profiles, all using the real world example first. Finally, just like the Call Option section, AAPL Options are studied in detail to understand how Put Options work.  </p>  <p>  \t The last lecture is a recap of the four basic Options strategies (Buying a Call, Selling a Call, Buying a Put, and Selling a Put). This part is usually challenging to newcomers, so this is explained in detail with tricks and tips on how to remember this instantly until you&#039;ve become very familiar with all the four Options strategies.  </p>  <p>  \t <strong style=\"\">Section 3 - Using Stock and Options combo strategies for stock investors.</strong>  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t In this section, three creative strategies are outlined for Stock investors to combine Options into their portfolio strategies.  </p>  <ol style=\"\">  \t<li><span class=\"Apple-style-span\">Use Options to buy Stock at prices that are far lower than what the stock is currently trading for</span></li>  \t<li><span class=\"Apple-style-span\">Use Options to sell Stock at prices that are far higher than what it is currently trading for</span></li>  \t<li><span class=\"Apple-style-span\">Use Options to hedge a Stock position that you already own</span></li>  </ol>  <h5>What you will master (Section 1 on Call Options)</h5>  <ul style=\"\">  \t<li>The history of Options in the financial markets</li>  \t<li>The factors that affect Options pricing</li>  \t<li>The formal definition of Options and Call Options in particular</li>  \t<li>The Rights and Obligations of Option buyers and Option sellers</li>  \t<li>The fundamental differences between Stocks and Options</li>  \t<li>An excellent real estate example of a Call Option</li>  \t<li>What are At-the-money (ATM), Out-of-the-money (OTM) and In-the-money (ITM) Options</li>  \t<li>What is Intrinsic Value, Extrinsic Value and Time value in Options</li>  \t<li>The risk profile of buyers and sellers of Options</li>  \t<li>The advantages for the seller of an Option</li>  \t<li>How real Options are represented in the financial markets</li>  \t<li>Translate Options used in the real estate example to real AAPL Call Options on the trading platform</li>  \t<li>Explains the Option chain, the different Expiry series and the selection of the appropriate Call Option for a bullish strategy</li>  \t<li>How Option chains are laid out on a real platform</li>  \t<li>Detailed analysis of an Option seller&#039;s position</li>  \t<li>Demonstrate how the three types of Options work on AAPL Options</li>  \t<li>Profit and Loss graphs for buyers and sellers of AAPL Options</li>  </ul>  <p>  \t <span class=\"Apple-style-span\"><br style=\"\">  \t</span>  </p>  <p>  \t <span class=\"Apple-style-span\"><br style=\"\">  \t</span>  </p>  <h5>What you will master (Section 2 on Put Options)</h5>  <ul style=\"\">  \t<li>Definition of a Put Option and its rights and obligations</li>  \t<li>Learn Put Options using a simple real-world example (Insurance)</li>  \t<li>What is a Put Option and how is it the opposite of a Call Option</li>  \t<li>Why is a Put Option the &quot;ultimate protector&quot; of your portfolio</li>  \t<li>A real world example of a Put Option we are all familiar with</li>  \t<li>How Put Options make money in bear markets</li>  \t<li>Buyer and seller perspectives of Put Options</li>  \t<li>Breakeven analysis and Profit and Loss graphs for buyers and sellers</li>  \t<li>Understand the layout of Put Options on the Thinkorswim platform</li>  \t<li>Compare real world Options to Options in the financial market</li>  \t<li>Study AAPL Put Options in detail</li>  \t<li>Profit &amp; Loss graphs and risk profiles on the platform</li>  \t<li>The Seller&#039;s perspectives in a Put Option</li>  </ul>  <p>  \t In Section 3, you will master the art of combining Options strategies with Stocks. If you&#039;re already a Stock investor, you will learn to create consistent monthly income, as well as learn the ability of Options to protect your Stocks.  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t <strong style=\"\">TOTAL COURSE LENGTH - OVER 3.5 HOURS </strong>  </p>  <p>  \t <strong style=\"\">BONUS VIDEOS - 40 MINUTES</strong>  </p>  <p>  \t <strong style=\"\">TOTAL - OVER 4 HOURS</strong>  </p>  <p>  \t <strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t <strong style=\"\">This Course is the first of a 4-course step-by-step program to achieving Options mastery. </strong>  </p>  <p>  \t <a href=\"http://optiontiger.com/category/473/options-beginner/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a>Course I - Introduction to Options<a href=\"http://optiontiger.com/category/473/options-beginner/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a> - Learn about <a href=\"http://optiontiger.com/course/call-options/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Call Options</a> and <a href=\"http://optiontiger.com/course/put-options/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Put Options</a> is a detailed step-by-step explanation of Options, Call Options and Put Options with theory and practical application with Apple (AAPL) Options  </p>  <p>  \t Course II - Options Foundation - <a href=\"http://optiontiger.com/course/time-decay/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Time Decay</a>, <a href=\"http://optiontiger.com/course/implied-volatility/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Implied Volatility</a> and <a href=\"http://optiontiger.com/course/option-greeks/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Options Greeks</a><strong style=\"\"> </strong>will complete your theoretical understanding of Options.  </p>  <p>  \t Course III is Options strategies for Beginners - <a href=\"http://optiontiger.com/course/buying-call-options/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Buying Call Options</a> and <a href=\"http://optiontiger.com/course/buying-put-options/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Put Options</a> where we actually put live trades and manage them to their exit points.  </p>  <p>  \t Course IV is on <a href=\"http://optiontiger.com/course/option-spreads-philosophy/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Options Spreads</a> - This is the heart of Options Trading.<a href=\"https://www.udemy.com/options-spreads-explained/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\"></a>  Once you master Options spreads, you have acquired a skill that can generate consistent monthly income for the rest of your life.  </p>  <p>  \t <strong style=\"\">Please feel free to browse this page for a <a href=\"http://optiontiger.com/testimonials/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">complete list of Testimonials</a>  from our clients, <a href=\"http://blog.optiontiger.com/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Blog</a>  readers and <a href=\"http://www.linkedin.com/groups/Stock-Options-Trading-Group-4581863?gid=4581863&amp;trk=hb_side_g\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Linkedin group</a>  members.</strong>  </p>", 
    "end_date": null, 
    "title": "Learn Call Options and Put Options - Introduction to Options", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41145_fed9_23.jpg", 
    "course_url": "https://www.udemy.com/learn-options-trading-introduction-call-put-options/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-11T12:36:41Z"
}