{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Understanding Accounting is Understanding Business.</em></strong>  </p>  <p>  \t                     Take a minute and think about the world we live in today. Whether it is social media, sport teams, non-profits, or local mom and pop shops- all of these are individuals, like me and you, creating a business and delivering it to the masses. Regardless of your background, you are immersed in a world of business. A foundation in accounting can help you navigate the complexities and develop a new perspective on the world we live in. Accounting is the language of business and in its simplest form, accounting is a platform that allows businesses to record transactions.  </p>  <p>  \t                     Business and accounting come hand in hand. You cannot have one without the other. This course seeks to teach you basic accounting principles through a business lense. By the end of this course, you will understand key accounting concepts that are universally applicable to all businesses. In turn, you will be able to apply these concepts to:  </p>  <ul style=\"\">  \t<li>Streamline your Small Business</li>  \t<li>Improve Investing/Analytical Skills</li>  \t<li>Manage Personal Finances </li>  \t<li>Develop Bookkeeping Principles</li>  \t<li>Understand Business Operations</li>  </ul>  <p>  \t<strong style=\"\">About the Course</strong>  </p>  <p>  \t                  This beginner course is a 15 chapter series of video lectures and textbook with an emphasis on financial accounting. It is imperative that you utilize both to get the most of the course.  </p>  <p>  \t                   It is designed to make accounting as simple and relevant as possible. Many other courses will have lessons on regulatory agencies or governmental accounting, however, this course purposely leaves those out. Frankly, unless you want to become a CPA, that information is too specialized and you simply will never use it. This course focuses only on concepts that can be applicable to your every day life.  </p>  <p>  \t                  The course starts with an overview of accounting and business concepts and then dives into technical theory. After going over technical concepts, it then takes a step back and shows how the technical theory relates to business operations. Lastly, it concludes with a chapter on utilizing technical theory to analyze companies.  </p>", 
    "end_date": null, 
    "title": "Learn Accounting. Understand Business.", 
    "price": "20.00", 
    "instructors": "Calvin Liu", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153210_16a7_3.jpg", 
    "course_url": "https://www.udemy.com/learn-accounting-understand-business/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T01:01:29Z"
}