{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn how to trade options from a former stock broker! No matter how much experience you have with the financial markets, you can trust us to teach you the fundamentals of option trading, and get you started on the right track!</p><p>Corey began trading the global markets in 2001 and actively trades equities, futures, forex, options, and index options. As the Chief Market Analyst for a publicly-traded company, he provides multiple trade strategies and leadership for his team of professionals consistently achieving returns that outperform the broad markets. In 2011 Corey developed a weekly trading strategy using SPX index options which have returned +390.6% from March of 2011 to current day.<br></p><p>Corey is the content creator for a variety of trading newsletters and author of complete investing courses targeted to professionals and individual traders. His content covers the full spectrum of market knowledge from the basic of investing essentials through advanced options and technical analysis. He has been recognized as a top instructor for two of the most popular online financial education courses and is responsible for teaching over 100,000 clients throughout the US and Canada!</p><p>Corey’s professional career includes successful positions as stock broker, Options Principal, Chief Market Analyst, financial education author and content creator. Corey has been Series 7 Licensed (General Securities Representative) and Series 4 Licensed (Options Principal).</p>", 
    "end_date": null, 
    "title": "Learn About Trading Options from a real wallstreet trader", 
    "price": "20.00", 
    "instructors": "Corey Halliday", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761808_136e_3.jpg", 
    "course_url": "https://www.udemy.com/learn-about-trading-options-from-a-former-stockbroker/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T23:18:12Z"
}