{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Warren Buffet said: “Investing in\nyourself is the best thing you can do.  Anything that\nimproves your own talents; nobody can tax or\ntake it away from you.”</p><p>This course is specially designed to\ntake advantage of that Warren Buffet's wisdom,\nknowledge and trading expertise.  As the Head\nTrainer/Coach at FXALTareeq I believe one that many\nForex Traders miss the boat by focusing on many types of\ntrades at one time.  The key or secret is to\nbecome an expert of one trading system that is a high\nprobability Forex Trading system and capitalize on\nit's success.</p><p>The Naked Price Action Wammie &amp; Moolah Trading\nSystem is just that, a High Probability Forex\nTrading system that designed to give you, the\nForex Trader, the edge that is needed to succeed in\nthe Spot Forex Market.  You will be be able to\ndo so without needing to learn how to use\ncomplicated or lagging Forex Indicators, Oscillators,\nExpert Advisors (EA's) or other thingamajigs. \n</p><p>All professional Athlete's have\ncoaches, why should trading Forex be any different? \nPurchase this course today and you will be well\non your way in a few hours of learning how to\nbecome a successful Forex Trader using the Naked\nPrice Action Wammie &amp; Moolah Trading course that is\ndesigned by a Professional Forex Trader who\nactually uses it in his Daily Forex trading as well\nas Forex Signal Service business.  By purchasing the\nForex Naked Price Action Wammie &amp; Moolah you to will be able to do\nthe same using the materials in the course\nwhich includes the actual Wammie &amp; Moolah Forex trading\nbook and instructional videos. Purchase the\nForex Wammie &amp; Moolah Trading Course today and get your virtual Forex Coach and learn to trade like the Professionals.</p>", 
    "end_date": null, 
    "title": "Learn to Trade Forex Naked Price Action Wammie Trade", 
    "price": "50.00", 
    "instructors": "Abdul Rahman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764010_b6f7_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-trade-forex-naked-price-action-wammie-trade/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T05:16:07Z"
}