{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>\"The most Effective and Efficient Way to Learn is to Practice\"</strong></p>  <p><strong>Enroll Now and GET ACCESS to:</strong><strong></strong></p><ul><li><strong><strong>3+ hours of</strong><strong> Screen Cast Dedicated Videos (screen capture with audio narration)</strong></strong></li><li><strong><strong>Practice Problems (in Excel &amp; Word Formats)</strong></strong></li><li><strong><strong> Useful Financial Templates  (in Excel &amp; Word Formats)</strong></strong></li><li><strong><strong>Examples using business-related financial Information (real life applicable learning)</strong></strong></li></ul>  <p>Acquire very quickly and with lots of fun and <strong>applicable knowledge</strong> of vital financial topics applicable to all businesses, such as:  </p>  <p>  \t                                                 -Income Statement-Balance Sheet-Statement of Cash Flows-Accrual and Cash Accounting-Financial Analysis Methods (Trend Analysis, Vertical Analysis and Variance Analysis)-Financing A Small and Medium Size Business (Bootstrapping, Crowd-Funding, Angel Investors and Venture Capital).</p>  <p>  \t                                                 Right upon completion of the taught material and practice problems you will be able to:  </p>  <p>  \t                                                 a) understand and apply easily finance, b) evaluate financial information, and c) make effective financial decisions.</p>  <p>  \t<strong>Why take this finance course?</strong>  </p>  <p>  \t<strong></strong>It is<strong> </strong>a<strong> practice-based course</strong> since you can 'learn finance only by doing'.  This is achieved through:  </p>  <p>  \t                                                                             -The use of <strong>multiple case examples</strong> in the video lectures illustrating thoroughly finance topics;  </p>  <p>  \t                                                                             -The <strong>numerous exercises and financial templates</strong> that are provided to students as a way for them to practice and internalize more deeply the taught material.  </p>  <p>  \t                                       -The <strong>student support </strong>provided by the instructor on any questions students may have regarding the course.  </p>  <p>  \t                                                 I am looking forward to helping you understand the above financial topics, since you will need to apply them in your own job, business, studies or life.  </p><p><strong>\" Learn Finance Once &amp; For All \"</strong></p><p><strong>Let's Start ... Learning Today!</strong></p>", 
    "end_date": null, 
    "title": "Learn Finance Without Wasting Lots of Time", 
    "price": "20.00", 
    "instructors": "Yiannis Megaloeconomou", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323196_ed22_8.jpg", 
    "course_url": "https://www.udemy.com/basic-finance-for-startups-smes-quick-clear-practical/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-20T14:50:18Z"
}