{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                                    Learn how to manually double your Forex Account in one Forex Trade during this course. This course is meant for Forex traders with some Forex trading experience to learn how to add more lots to existing successful positions to increase gains to the point of doubling their account.  The big point about increasing lots is to do so in a way that the transaction becomes risk free. You should never be stopped out at a loss after you have added to your position.  </p>  <p>  \t                                    The course is video based but contains excel models, simplifying and automating the calculations required to top-up on a risk free basis.  </p>  <p>  \t                                    Although the course is mainly about the way of adding to your position on a risk free basis it does include bonus examples of successful trades using techniques such as Channel, Envelope and momentum trading. It also contains an 30 page eBook showing 7 ways you can find turning points in the Forex Market.  </p>  <p>  \t                                    The course has over 2 hours of content and is structured to include most of the key areas to fully equip the student to understand the entire process which doubles your account in one trade.  </p>  <p>  \t                                  Ways of building &quot;double in a day&quot; strategies, selecting currencies, selecting entry techniques, having the appropriate trading psychology and learning from experience will be covered.  </p>  <p>  \t                                    This is not a get rich quick course at all and it will take time and practice to develop the trading skills described in the course after completion.  </p>  <p>  \t                                    Your view of Forex trading will change forever after completing this course.  </p>", 
    "end_date": null, 
    "title": "Learn how to double your Forex Trading Account in one trade", 
    "price": "20.00", 
    "instructors": "Alex du Plooy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/317030_b07e_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-double-your-forex-trading-account-in-one-trade/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-10T05:51:43Z"
}