{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t           <strong style=\"\">OVER 2600+ DELIGHTED STUDENTS HAVE ALREADY TAKEN THIS COURSE AND HAVE BENEFITED FROM THE HANDS-ON, EASY-TO-FOLLOW LESSONS! </strong></p><p style=\"\"><em style=\"\"><strong style=\"\">\"Amazing course!</strong></em></p><p style=\"\"><strong style=\"\"><em style=\"\"> This is the first course I found on crowdfunding which takes learner from concept to downright execution. The course content is very well structured. The material is well - detailed. Instructor has explained everything in a patient succinct manner. Great course. 5 stars.</em><em style=\"\">\" - K</em></strong><em style=\"\"><strong style=\"\">irobo Tashehi</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\"><em style=\"\">Scroll down to the bottom for more authentic reviews...</em></strong></em></p>  <hr style=\"\">  <p style=\"\"><strong style=\"\">COURSE UPDATED IN MAR 2015!</strong></p><p style=\"\">Get LIVE access to <em style=\"\">NEW</em> and <em style=\"\">UPDATED </em>content at <em style=\"\">zero</em><em style=\"\"> additional charge</em> after you have enrolled in this course. This course will be regularly updated to bring you the latest tips and information!<br style=\"\"></p><p style=\"\"><strong style=\"\">Updated 13 Mar 2015: Bonus interview added! </strong>- How Novelsys Ampere Raised Over $87,000!</p><p style=\"\"><strong style=\"\">Updated 10 Mar 2015</strong>: Bonus book added! - 'The Crowdfunding Checklist\"<br style=\"\"></p><p style=\"\"><strong style=\"\">Updated 20 Nov 2014: </strong>Bonus slides added! - 'Lesson 68: FundedbyMe 2014 Slides- 4 Key Things Learnt In My Crowdfunding Journey\"</p><p style=\"\"><strong style=\"\">Updated 10 Oct 2014: </strong>Bonus book added! - 'The Crowdfunded! Kit Book\"</p><p style=\"\"><em style=\"\">***************************************************<br style=\"\"></em></p><p style=\"\">  \t<em style=\"\">Answer these 5 questions as honestly as you can:</em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Do you have a dream business that you've always wanted to crowdfund?</strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Would you like to raise the highest possible amount of money for your business from crowdfunding, with the minimum amount of risk?</strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Would you like to get things done faster for your crowdfunding project, in less time?</strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Would you like to learn a cost-effective method that is the favorite of hundreds of businesses like yourself?</strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">If you found something that gave you all these benefits, would you like to get started with it right away?</strong></em>  </p>  <p style=\"\">  \t                       If you've said yes to any of these 5 questions, you've come to the right place!  </p>  <p style=\"\">  \t                             If you want to raise big bucks, be warned: the competition for crowd funding dollars is now tougher than ever. That's why you'll need a campaign that gets EVEN GREATER exposure than everyone else. This course is a treasure chest full of crowd funding strategy, tips and tools that will get you to success ahead of your competition.  </p>  <p style=\"\">  \t<strong style=\"\">3 Super Secrets I Wished Somebody Had Told Me Before I Had Crowdfunded My Business Idea:</strong>  </p>  <p style=\"\">  \t                                                       -<strong style=\"\">Kickstart</strong> A Big Flood Of Funds By Launching <em style=\"\">Effectively </em>Within Your Networks  </p>  <p style=\"\">  \t                                                           -<strong style=\"\">Win Over</strong> Influencers And Get High Traffic Blog Coverage Midway Through Your      Campaign  </p>  <p style=\"\">  \t                                                       -<strong style=\"\">Save Precious Time</strong> With A 90 Day Launch Plan, Templates And Scripts.  </p>  <p style=\"\">  \t<strong style=\"\">I learnt these three things the hard way, so that you can profit </strong>  </p>  <p style=\"\">  \t                                                           Having a killer video and a well-crafted sales pitch is crucial for your campaign. But I've found these alone <em style=\"\"><strong style=\"\">aren't enough</strong></em> to bring in the money- you'll need to learn to reach out to people beyond your own network. Crowdfunding is really a race against time to capture as many eyeballs as you can to take notice of your campaign; the more awareness you get, the better.  </p>  <p style=\"\">  \t                                                           You'll get to see over my shoulder exactly how you can use this strategy to profit, and the online marketing hacks I used to raise over six-digits for my business.  </p>  <p style=\"\">  \t                                                           I stress that you need no prior marketing experience. Absolutely <strong style=\"\">none</strong>. This course will <strong style=\"\">TRANSFORM</strong> you from a complete beginner into a crowdfunding <strong style=\"\">BLACK BELT NINJA </strong>in just under three days! (*Provided you diligently complete the course)  </p>  <p style=\"\">  \t<strong style=\"\">What This Course Will Cover:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">First Things First</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>-You'll learn how to validate early on if there's demand for your product,and <strong style=\"\">save    yourself wasted effort</strong> from a failed campaign nobody wants to buy into.  </p>  <p style=\"\">  \t                                                           -Learn exactly how to make a <strong style=\"\">viral video</strong>, write a <strong style=\"\">killer pitch</strong>, and develop <strong style=\"\">attention-  grabbing rewards</strong>. Even if you are on a tight budget!  </p>  <p style=\"\">  \t<strong style=\"\">Prelaunch Marketing</strong>  </p>  <p style=\"\">  \t                                                           -Discover how you can leverage on these <strong style=\"\">three</strong> best Kickstarter/Indiegogo traffic  sources for your business:activating your networks, building a hungry email list and finding influential blogs, to  create a ton of buzz before you launch.  </p>  <p style=\"\">  \t<strong style=\"\">Launch It!</strong>  </p>  <p style=\"\">  \t                                                           -Learn how you can <strong style=\"\">maximise success</strong>, when launching your campaign within your  networks. You'll get access to ready-made, successful email templates.-&gt;&gt;<strong style=\"\">SAVES  YOU LOADS OF PRECIOUS TIME!  </strong>  </p>  <p style=\"\">  \t                                                           -Tap into the battle-tested experience and tips from 6 successful project creators and  experts I interviewed, and learn to <strong style=\"\">avoid campaign pitfalls</strong>.  </p>  <p style=\"\">  \t                                             Maybe you might feel crowd funding is a complicated and mystifying process, especially if it's your first time. But students or business marketers who complete this course will find that the <strong style=\"\">easy, hands-on lessons</strong> will <strong style=\"\">drastically shorten</strong> their learning curve to just <strong style=\"\">a matter of days</strong>, not months!  </p>  <p style=\"\">  \t                                                           So if you want someone who's been there, done that to walk you through this, I'm here to <strong style=\"\">empower you to succeed</strong>.  </p>  <p style=\"\">  \t<strong style=\"\">                          Enroll </strong>by clicking the \"take this course\" button, top right, <strong style=\"\">now</strong> ... <em style=\"\">every hour you delay is costing you $100-$10000! </em>...  </p><p style=\"\">************************************************************************<br style=\"\"></p><p><em style=\"\">HERE'S MY PERSONAL GUARANTEE TO YOU -</em></p><p><em style=\"\">Even after you have purchased this course, I assure you that you have the full empowerment to decide if this course is suitable for you. By enrolling in this course now, you will be entitled to a 30-day full money back guarantee. If you're not 100% satisfied with this course</em><em style=\"\">, I promise to give you back all your money with no questions asked. This is my appreciation to you for your trust.<br style=\"\"><br style=\"\"></em>**********************************************************************</p>", 
    "end_date": null, 
    "title": "Learn to Raise the Funds You Need via Crowdfunding", 
    "price": "20.00", 
    "instructors": "Johnathan Leow", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292462_c479_7.jpg", 
    "course_url": "https://www.udemy.com/thecrowdfundedkit/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T16:04:14Z"
}