{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn everything you need to invest in <strong>Index Funds and ETFs</strong>!</p><p><em>First</em> learn <strong>stock market basics through simple examples</strong> to set the foundation. </p><p>Then follow the step by step guide to  investing in ETFs and index funds to make your first investment and then follow it up with a re-investment scheme. </p><p>Learn how you can invest even if you have <strong>no savings</strong> at the moment.</p><p><strong>No experience</strong> related to stock market or investing needed.</p><p>.......................................................................................................................................................</p><p>The first section will give the novice investor a look into the stock market.</p><p>After laying the foundation, I will take you through the 7 steps of investing in ETFs and index funds. This is a practical guide and will give you the exact path to make your investment. Follow every step and you will be confident about making your investment and re-investing. </p><p>I reveal EVERYTHING I know through 4+ years of experience in investing, coaching and researching on the subject. I will continue to add extra content to the course at NO cost to you at all. You can ask any question and I will be happy to answer.</p><p>See you inside the course! Good Luck!</p>", 
    "end_date": null, 
    "title": "Learn To Invest In Index Funds and ETFs In 7 Easy Steps", 
    "price": "20.00", 
    "instructors": "Kas Education", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530246_6689_7.jpg", 
    "course_url": "https://www.udemy.com/invest-in-index-funds-and-etfs-in-7-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T11:05:15Z"
}