{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Most companies waste at least 5% of their money on inefficient spending on their overhead costs. </p><p>As a business coach, helping your business owner to identify and  focus their efforts when looking to save money on their cost base, will build trust and longevity. Moreover you will demonstrate your wider value as a coach with financial acumen and commercial sense.<br></p><p>This course, has been writtten specifically for Business Coaches and Consultants, who feel their lack of financial knowledge is holding them back. I  show you how to practically pull out the costs that are  most susceptible to overspending. Using some financial tools  and techniques, I show you how to tell if these costs are being well managed and controlled. </p><p>I will also show you some financial metrics and measures commonly used by finance experts in industry which help you to make good decisions around whether to invest in particular areas of spend, especially your decisions around resource spend.</p><p>This course includes plenty of examples of where and how to find savings in your clients  business. These are based on actual savings I have achieved through my work with small business owners.</p><p>This is a concise, 60 minute basic level course for business coaches. Aimed at those coaches working with small business owners with a turnover of less than £1m. </p><p> If you find financial information confusing, this will help you focus on a few vital areas which could release much needed cash back into the business.<br></p><p>This is a must for all small business coaches who want to help  to grow small businesses and ensure their service increases as part of that growth.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Business Finance: Win more work as a Business Coach ", 
    "price": "20.00", 
    "instructors": "Hayley Chiba", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692268_6a0e_4.jpg", 
    "course_url": "https://www.udemy.com/essential-business-finance-for-coaches-and-consultants/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T19:58:41Z"
}