{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> This course will teach you how to maintain your own books of accounts by using quickbooks online accounting software.</p><p>This course includes accounting activities done in quickbooks  like creating chart of account,creating an invoice,bills,expenses, reconciliation of bank statement or understanding various quickbooks reports</p><p>This course is explained with the help of screen cast and all the process or activities are  shown stepwise through examples<br></p><p>This course is meant for small business owner and professional who wants to maintain their own books of accounts through quickbooks Online.<br></p><p>Whether you are a non finance person or finance person , this course will help you understand accounting activities in quickbooks online better by providing you the knowledge on the basics concepts of accounting. </p><p>At the end of this course, you will be able to-</p><p>1) Set up your own books of account in quickbooks</p><p>2) Manage and create customer master ,invoices and receive payment through quickbooks</p><p>3) Manage and create vendor master and book various type of expenses</p><p>4) Perform bank reconciliation independently.</p><p>5) Assign rules for recurring bank transactions and save template for repetitive transactions, which will help to save time.</p><p>6) Understand various reports in quickbooks</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Quickbooks to maintain books properly", 
    "price": "20.00", 
    "instructors": "Payel Podder", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662318_7ea5_3.jpg", 
    "course_url": "https://www.udemy.com/learn-quickbooks-to-maintain-books-properly/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T19:07:37Z"
}