{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tIn this course you will learn the accounting cycle! You will get video lectures of the material, a PowerPoint presentation, a walkthrough of the lecture notes, a 20 question quiz, and you will see videos of me working example homework problems. You will learn everything you NEED TO KNOW to set up an accounting system in your business or an understanding of the accounting system for your university level course or the Certified Public Accountant examination.  </p>  <p style=\"\">  \tThe material presented covers the Accounting Equation, Accounts, the use of T-accounts, recording transactions into the General Journal, posting to the general ledger, posting adjusting journal entries, and building the financial statements. This is the backbone of accounting. IN ADDITION, I will show you video of me recording transaction in Excel and QUICKBOOKS. QuickBooks is a software platform that computerizes the accounting cycle.  </p>  <p style=\"\">  \tYou will also learn the theory and concepts that build the accounting cycle so that you will understand what you are doing! There are plenty of good people that work in accounting that don&#039;t understand the theory behind their jobs, you will!  </p>  <p style=\"\">  \tThis course is designed so that you can refer back to it and pick out the data that is relevant to you! In particular, accounting students will find this class especially useful as an on-demand tutoring session!  </p>", 
    "end_date": null, 
    "title": "Learn Accounting Debits & Credits, Succeed on the CPA exam!", 
    "price": 0, 
    "instructors": "Prof. Kenneth \"Cliff\" Hendren", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380202_b415_3.jpg", 
    "course_url": "https://www.udemy.com/accountingcycle/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-29T18:27:51Z"
}