{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>The Legal Bookkeeping </strong>course is about  how to do solicitors accounts using the England &amp; Wales (UK) Solicitors Accounts Rules (SARs).  </p>  <p>  \t      The learning is structured in a <strong>practical way</strong>.  There is a workbook which we work through together. You can pause the video at any point, have a go at the exercise yourself, and then watch the video, or watch the video, do the exercise, and then check your answers.  </p>  <p>  \tThere are various tasks  to complete. You are given the task to do and have a go at, and then the  video answer is available. It is suggested that you:  </p>  <ol>  \t<li>Read the task</li>  \t<li>Watch the video</li>  \t<li>Have a go at it yourself on your own system</li>  \t<li>Rewatch the video (if necessary) - to reinforce the learning</li>  </ol>  <p>  \t      You’ll learn about double entry bookkeeping, petty cash, partnership accounts, how a solicitors office should run, keeping accounting records, recording transactions, residual balances, client account, office account, vat, methods of dealing with interest, how a solicitors office should run - amongst over things.  </p>  <p>  \t      This is a useful course if:  </p>  <ul>  \t<li>You are thinking of working in solicitors accounts</li>  \t<li>You are going for jobs which have a requirement for you to know about the solicitors accounts rules</li>  \t<li>You want to put this skill on your CV, or </li>  \t<li>You are a bookkeeper or accountant and are thinking of taking on legal clients (solicitors, lawyers) </li>  \t<li>You are a bookkeeper and want to &#039;get into&#039; solicitors accounts</li>  </ul>  <p>  \t      The course isn&#039;t based on any specific software. All exercises are based on excel spreadsheets, so you can apply the knowledge in this course to any (UK) law firm / practice that you work in.  </p>  <p>  \t      The course materials includes a 100+ page workbook.  </p>  <p>  \t      The course will take about 12 hours to complete.  </p>  <p>  \tIt is relevant to the UK market (solicitors and lawyers).  </p>", 
    "end_date": null, 
    "title": "Legal Accounting", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295909_2a58_2.jpg", 
    "course_url": "https://www.udemy.com/solicitors-accounts/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T17:47:39Z"
}