{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Pullback Candlestick Strategy is a technique that uses only 2 indicators, comprises 5 simple rules , great for both short and long term moves in the Market that works in any timeframe, any market and any direction. This is a perfect strategy for brand-new  and experienced traders  who are not yet in the five percent of profitable traders. </p>    <p>This strategy is designed to create consistent profitability for the Retail Traders, Institutional Investor and Hedge Fund Managers using simple methods. It gives you a high probability on the direction majority of traders have taken in the market. This strategy focuses on price movements in the market activity and avoids any outside noise.</p>    <p>The entire course has over 22 lecture compiling over 2.5 hours of video. It contains charting examples of precise rules used in trading the Pullback Candlestick Strategy. The course is structured with each lecture focusing on a particular technique with a combination of all the methods in 5 lectures at the end. The course also includes an introduction to a free Charting platform that provides you with real time price movement in the market and gives you the ability to paper trade.</p>  <p>If you're interested in becoming a professional trader earning consistent profit then you need to purchase this course. </p>", 
    "end_date": null, 
    "title": "Make Consistent Profit Using Pullback Candlestick Strategy", 
    "price": "50.00", 
    "instructors": "Omar Brown", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597716_9f81.jpg", 
    "course_url": "https://www.udemy.com/make-consistent-profit-using-pullback-candlestick-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T22:22:20Z"
}