{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Manual bookkeeping covers the material equivalent to a certificate in manual bookkeeping level 2. You will need to have come across the concept of double entry bookkeeping before. On this course, we look at how to update the ledger accounts. We take these end balances on the ledgers and use them to prepare a Trial Balance. From the figures on the Trial Balance, we prepare a Balance Sheet and a Profit and Loss Account.</p><p style=\"\">We also take the figures on the VAT account, make an adjustment for Bad Debts and use the figures to prepare the figures for a VAT return.</p><p style=\"\">This course is ideal for students learning about manual bookkeeping and wanting more practice and teaching. We show the workings on the screen (using an excel spreadsheet to speed up the calculations). You can do this course just using a pen and paper. We would recommend that you use lined paper, and have a calculator when doing this course.</p><p style=\"\">The course workbook is included as are the suggested answers on paper, so you can print this off and check and mark your own answers as well as follow the tutor on the screen when working through the scenario and questions.</p><p style=\"\">The course will take about 3 hours to complete. The course is structured around various scenarios which place you as a bookkeeper in various organisations / for self employed individuals, and we are doing their bookkeeping, using a manual method.</p><p style=\"\">This course is useful if you want to learn more about manual bookkeeping, and also, if you want to have a better understanding of bookkeeping in general. Even if you are currently using a bookkeeping software... the knowledge gained on this course will really help you to understand what is going on &#039;behind the scenes&#039; of the program. Software is great, because it saves us time, but if they go wrong, having a manual understanding is very helpful because then you&#039;ll know WHY the accounts are incorrect, and how to fix it. </p><p style=\"\">The course tutor is a Fellow Member of the AAT (Association of Accounting Technicians) and first learned manual bookkeeping skills in 1996, and has been using computerised methods since 2003, but has always found the manual knowledge has helped her to be a better bookkeeper.</p>", 
    "end_date": null, 
    "title": "Manual Bookkeeping", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371828_bbe1_3.jpg", 
    "course_url": "https://www.udemy.com/manual-bookkeeping/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T22:27:01Z"
}