{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5><strong style=\"\">TECHNICAL ANALYSIS, VOLUME ANALYSIS AND CHART READING MASTERY BUNDLE (20% OFF) </strong></h5>  <p>  \tThis Bundle combines two courses -  </p>  <p>  \t1) <a href=\"http://optiontiger.com/course/technical-analysis/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">TECHNICAL ANALYSIS COURSE-</a> A practical approach for Trade entry  </p>  <p>  \t2) <a href=\"http://optiontiger.com/course/volume-and-chart-analysis/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">VOLUME ANALYSIS -</a> The key to tracking &quot;Smart Money&quot; activity  </p>  <p>  \tTake your understanding of Technical analysis, Volume analysis, Chart reading skills and Smart Money to nothing short of &quot;Mastery&quot; with this bundle  </p>  <h5><strong style=\"\">MASTER TECHNICAL ANALYSIS</strong></h5>  <p>  \tTechnical analysis has become extensive in recent years. We study the psychology of technical analysis and why they work 60 to 70% of the time. There are several categories of technical analysis - Price indicators, Support and Resistance levels, Momentum indicators, Volume indicators, Oscillators and Statistical price movement indicators. We cut through all the noise and show you why there are 4 or 5 indicators you should study and that&#039;s all you really need to make informed entry and exit decisions. Technical analysis is a self-fulfilling prophecy and gives deep insight into crowd behavior.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>What is Technical Analysis and why is crowd psychology an important factor in markets</li>  \t<li>Why does technical analysis work only 60 to 70% of the time</li>  \t<li>Why are Price indicators called &quot;lagging&quot; indicators</li>  \t<li>What are potential &quot;leading&quot; indicators</li>  \t<li>A study of Moving averages and which ones are helpful</li>  \t<li>What are the best indicators for short, medium and long term trends</li>  \t<li>Why do we need a &quot;confluence&quot; of indicators to make a decision</li>  \t<li>Why the Bollinger Bands are a cool indicator</li>  \t<li>Adjusting technical indicators to match your trading timeframe</li>  \t<li>Why technical analysis &quot;works until it doesn&#039;t&quot;</li>  </ul>  <h5>SECTION 1</h5>  <p>  \t<strong style=\"\">Lecture I -  What is Technical Analysis</strong>  </p>  <p>  \tTechnical analysis is primarily a study of Crowd psychology and crowd behavior. If a certain number of people act in unison at a certain time, and other people can observe this group of people taking a certain action, then they are motivated to join in. And it becomes a self-fulfilling prophecy. Technical analysis is a very powerful force in the markets, but it has limitations. This Introductory lecture explains these details.  </p>  <p>  \t<strong style=\"\">Lecture 2 - Crowd psychology and Crowd behavior</strong>  </p>  <p>  \tWhat is crowd psychology and why does it matter ? In this lecture, we study the S&amp;P 500 Index over the last 20 years, and also observe a certain technical pattern that is currently playing out textbook-style. How could this pattern impact the markets this year ?  </p>  <p>  \t<strong style=\"\">Lecture 3 -  Limitations of Technical Analysis</strong>  </p>  <p>  \tWhat are the limitations of Technical analysis - when does it work, and when does it not work. Knowing when it does not work is as important as knowing when it works.  </p>  <h5>SECTION 2</h5>  <p>  \tSection 2 is a detailed discussion of all the types of Technical analysis indicators. You have various kinds - Price Indicators, Momentum indicators, Statistical and Volatility indicators, Support and Resistance, Volume indicators and Oscillators. Each of these indicator types are broken down in detail as well as insightful tips on their usage and interpretation.  </p>  <h5>SECTION 3</h5>  <p>  \tSection 3 is a complete case study set of 5 stocks -  </p>  <p>  \t1) Apple (AAPL) - 1 Year Chart. And how AAPL gave 3 points of entry for the perfect Bearish trade.  </p>  <p>  \t2) Priceline (PCLN) - No clear long-term signals, but a short term bearish trade could be played out.  </p>  <p>  \t3) Chipotle Mexican Grill (CMG) - an absolutely amazing Statistical indicator gives away the perfect &quot;Long&quot; signal  </p>  <p>  \t4) The Gold ETF GLD - Hidden inside a very bearish chart is the potential for a reversal trade  </p>  <p>  \t5) And on the Google (GOOG) charts, we can study the battle between the Bulls and Bears at a recent breach of Google&#039;s all-time high.  </p>  <p>  \tApplying correct Technical Analysis techniques can set you with a fantastic trade entry. If you get your trade entry correctly, you have just increased your chances of a profitable trade a whole lot.  </p>  <p>  \t<strong style=\"\"> </strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <h5><strong style=\"\">VOLUME ANALYSIS AND TRACKING SMART MONEY</strong></h5>  <p>  \tVolume is perhaps the most under-rated indicator in the markets. Volume shows the activities of the big hedge funds and proprietary desk traders,  players we often refer to as &quot;smart money&quot;. Good volume analysis shows critical points at which markets turn around, when activity levels are low or high or when <strong style=\"\">smart money</strong> is active or inactive. In this technical analysis course, we analyze various stock charts, and combine volume analysis with price action. Volume also provides a storyline to the markets. Constructing this storyline correctly is critical in terms of trade entry and exits.  </p>  <p>  \tSmart Money or Big money has always tried to (legally) manipulate the markets to their advantage. Their goals are to conceal their activities as much as possible. But Volume is one indicator they cannot conceal. In many ways, this technical analysis course levels the playing field for the average retail investor. Once you take this course, you&#039;ll know what to look for, and you&#039;ll be in a position to track smart money as they&#039;re entering a Stock or they&#039;re running for the exits. And your objective is to &quot;follow the smart money&quot;. When you position your trades in harmony with the money flows of smart money, you&#039;re adding a whole layer of high-probability characteristics to your investing activities.  </p>  <p>  \tThis is an exciting course!  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>Why is Volume the most under-rated indicator</li>  \t<li>Identify the activities of smart money precisely</li>  \t<li>&quot;Swim with the tide&quot; - increase your odds of success</li>  \t<li>How to read long term and shorter term charts</li>  \t<li>Identify points of major market reversals (before they happen)</li>  \t<li>What is Distribution and Accumulation</li>  \t<li>Put short term price action in context of longer term charts</li>  \t<li>All of this explained in simple terms</li>  \t<li>Study of various charts on various timeframes</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t<br style=\"\">  \t </strong>  </p>  <h5>SECTION IV</h5>  <p>  \tIn this Section, we explore why Volume is a critical indicator to study, and why this is the only indicator that clearly shows the activities of Smart Money. What can Volume analysis tell us about activity levels in the markets. Volume is sometimes referred to as the &quot;fuel of the markets&quot;, and this is very true. This Section also defines some of the rules of &quot;Smart Money&quot;. These rules form the basis for the games and that Smart Money play, and the tactics they deploy to manipulate the markets to their advantage.  </p>  <h5>SECTION V</h5>  <p>  \tThis section is a deep-dive into the methodology for spotting and tracking &quot;Smart Money&quot; using Volume analysis. A perfect timeframe for analyzing these activities was during the period preceding the financial crisis of 2007/2008 and the period after the bottom in March 2009. And there is no better instrument to study this than the S&amp;P 500 Index itself. This section is a fascinating and shocking analysis of how we could spot Smart Money doing the following -  </p>  <p>  \t- Start selling in March 2007, about 6 months before the top in October 2007  </p>  <p>  \t- They sold (&quot;distributed&quot;) for about 9 months with barely a move in price  </p>  <p>  \t- Ran the bear market down to their liking  </p>  <p>  \t- Start &quot;accumulating&quot; stock by the end of 2008  </p>  <p>  \t- Finished accumulation phase over a period of 9 months  </p>  <p>  \t- Are running the Bull market right now to their liking  </p>  <h5>SECTION VI</h5>  <p>  \tDetailed case studies of major stocks analyzing Smart money activity points -  </p>  <p>  \t1) BIDU - Smart Money is in, and they are not leaving  </p>  <p>  \t2) CAT - Similar to BIDU but more choppiness  </p>  <p>  \t3) FSLR - Gave a clear signal of smart money entry  </p>  <p>  \t4) NFLX, PCLN and FXE - Gave various signals for entry and exit  </p>  <p>  \t5) Silver Case study - Smart Money left Silver and has not come back yet.  </p>  <p>  \tTake this ultimate Technical Analysis Course and become technical analyst.  </p>", 
    "end_date": null, 
    "title": "Master \"Technical Analysis and Chart reading skills\" Bundle", 
    "price": "40.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43441_c1e7_7.jpg", 
    "course_url": "https://www.udemy.com/master-technical-analysis-and-chart-reading-skills-bundle/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-25T11:49:36Z"
}