{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Master the Stock Market with practice is a stock trading interactive course that allows you to practice each concept that you will learn through exercises and real cases.</p><p style=\"\">This course gathers and summarizes the investment strategies of the best investors in history, those who have proven to be successful and have made returns on their capital. We have used the teachings of illustrious traders such as John J. Murphy, Martin Zweig, Peter Lynch and Warren Buffet, as well as figures like William O&#039;Neil and Benjamin Graham, pioneers of the fundamental analysis.</p><p style=\"\">You will never get lost in the vast literature and you will accelerate your learning curve to rapidly to become capable of managing an investment portfolio.</p><p style=\"\">This is an ideal course to begin learning about the stock market, the financial markets as well as technical analysis and chart analysis. After completing this course you will be able to apply the different investment strategies that we will present in detail lesson to lesson.</p><p style=\"\">Upon purchase of this course in Udemy, you will also have free access to the course in different platforms: Android, iOS and browsers on mac and windows. In these platforms, you will also have access to the interactive parts of the chapters that will allow you to practice as you learn the material. This parts correspond to the points in the video where you see EXERCICES.</p><p style=\"\">As you progress in the course, we will also give you exclusive access to packages of additional exercises, to further reinforce everything you learn.</p><p style=\"\">We will provide the necessary tools so that you can prove to yourself that you are capable of managing a profitable portfolio before you start investing with real capital.</p><p style=\"\">One of the main motivations of this course is to be able to manage your own assets, without relying on any financial manager or bank to invest your savings or to build your pension plan.</p><ul style=\"\"><li style=\"\">You will get a lifetime access to this course, without any limits!</li><li style=\"\">The course will keep updating, and all future updates will be free.</li><li style=\"\">You will get email support from our team of experts, who will answer any questions or doubts that you have.</li></ul>", 
    "end_date": null, 
    "title": "Master The Stock Market with practice", 
    "price": "35.00", 
    "instructors": "Professor Chart", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475912_d3d6_4.jpg", 
    "course_url": "https://www.udemy.com/master-the-stock-market-with-practice/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T10:42:30Z"
}