{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Are you financially savvy?</strong></em></p><p><strong><em>Do you understand how money flows in your or your owner's business?</em></strong></p><p><strong><em>Why are financially educated people more and more a valuable asset to any business?</em></strong></p><p><strong>--------------------------------------------------------------------------------------------------------------</strong></p><p><strong>Effective Money Flow</strong> is essential to making a business as successful as it can be. This course shows you step by step how to master the key money flows in a business.<br></p><p>Simply put most people do not properly understand how money flows in business. Making <strong>money mistakes</strong> can turn out to be very<strong> expensive</strong>.</p><p>This course is about <strong>Finance for non Finance Brains</strong> . It shows you all the tools you need to understand all the important parts of the Business Money Flow Equation.</p><p>If you are a finance beginner or more advanced, the <strong>c</strong><strong>ourse teaching is designed to reach to all levels</strong>, so that anyone can master these fundamentals.</p><p>------------------------------------------------------------------------------------------------------------------</p><p><strong><em>Learn and Master Key Money Flows and Build Your Business Success in This Comprehensive Course.</em></strong></p><p>There is a growing demand for people who understand how finance works. More and more businesses are looking for people with sound financial skills. This course will give you an inside financial track. </p><p>In Business , understanding how money flows and what the numbers actually mean is a huge advantage. </p><p>People who run their own business, are looking to improve financial performance.  This course will show you much better how to tune in to your business performance and talk to your finance people.</p><p>I have distilled, need to know topics and information in this highly focused course. But mastering the subject can be difficult and takes time. Along with that getting access to highly qualified finance people is not easy, and <strong>courses can be very expensive</strong>.</p><p>This course has been created from my own 20 years as a highly experienced qualified chartered accountant providing classroom teaching to non finance people.</p><p>At the end of the course :</p><ul><li>Fast Forward your career or business </li><li>See quick wins in how to make a business more money</li><li>Increase your skill base and enhance the return on your investments (time, money, business)</li><li>Become more financially independent, save money on finance experts</li></ul><p>The Course will look at the topic of money flow in business and will cover <br></p><ul><li>An explanation of common financial terms</li><li>Understand how key money flows      in to a business, how it can be increased</li><li>A focus areas where a lot of money is then allocated </li><li>Key ways of how to improve the profits in a business</li><li>3 key financial statements you should get to know</li><li>Essential accounting components- assets ,liabilities and capital</li><li>A simple equation to help you remember the essentials</li><li>Important concepts often misunderstood, that greatly influence the preparation of financial statements</li></ul><p>-----------------------------------------------------------------------------------------------------------------</p><p><strong><em>The Learning Structure and Materials</em></strong></p><ul><li>Tailored easy to follow, step by step lectures </li><li>A test your knowledge quiz and answers at the end of each lecture's content to deepen your understanding</li><li>Practical case study examples. Meet Millionaire Mac, the entrepreneur in the Mac family (used for case study examples)</li><li>Easy to follow examples of financial templates</li><li>Learning at your own pace, in your own time</li></ul><p>------------------------------------------------------------------------------------------------------------------</p><p><strong><em>Why this course ?</em></strong></p><ul><li>A course tailored from 20 years of teaching hundreds of students and business people in live seminars</li><li>Highly qualified chartered accountant instructor,  a finance director at board level and business owner who has been there and been very successful</li><li>Written in a step by step way </li><li>Suitable for people at all levels who want to develop their financial education</li><li>Designed for people at all levels</li></ul><p>------------------------------------------------------------------------------------------------------------------</p><p><strong><em>Pricing</em></strong></p><ul><li>The initial low price will be for a limited time. The normal classroom price is $199</li><li>You have <strong>unlimited access</strong> to all lectures for ever </li><li>If you are not happy with what you are learning there is a full, no questions asked 30 day money back guarantee </li><li>All future <strong>additional bonus</strong> lectures are free</li><li><strong>My help is always available to you </strong>if you get stuck or have a question</li></ul><p>----------------------------------------------------------------------------------------------------------------</p>", 
    "end_date": null, 
    "title": "Master Key Financial Indicators and Build Business Success", 
    "price": "20.00", 
    "instructors": "Kieran McSherry", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607362_d86a_2.jpg", 
    "course_url": "https://www.udemy.com/master-key-financial-indicators-and-build-business-success/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T21:49:47Z"
}