{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5>THE IRON CONDOR STRATEGY - KING OF TIME DECAY STRATEGIES</h5>  <p>&nbsp;</p>  <p><p>The Iron Condor Spread is one of the most  popular trades of all Options trades, and it is the undisputed &quot;King of  Time Decay or Income strategies&quot;. It is special because you get to double  the premium collected, reduce your risk levels as compared to normal credit spreads,  double the amount of time decay, and maintain a delta neutral position, at  least when the trade is first put on. The negative with the strategy is that  it&#039;s a heavily Vega negative position. We dissect the Iron Condor in this  trade, put on a real trade on AAPL, and take it through a couple of weeks. We  analyze the risks, set adjustment points, and discuss suitable adjustment  strategies for different market situations as the trade develops.&nbsp;</p><p><br style=\"\"></p>  <p><strong style=\"\">What  you will master</strong></p>&lt;/p&gt;  <p>&nbsp;</p>  <ul style=\"\">  <li>How do we construct an Iron Condor</li><li>Why choosing the right strike prices are important for the Iron condor</li><li>Should we try to make it a delta neutral trade and why</li>  <li>What are its special characteristics</li>  <li>How is the premium doubled</li>  <li>Why is the Iron Condor a popular trade</li>  <li>Why are margin requirements less on an Iron Condor</li>  <li>What should we watch for in terms of Vega exposure</li>  <li>What are good adjustments for an Iron Condor</li><li>When do we use the simple adjustments and when do we use the complex one</li><li>Is Rolling an Iron condor leg a viable strategy</li><li>What are the options if we don&#039;t want to roll a losing Iron condor leg</li><li>Why is there an automatic profit component in an Iron Condor<br style=\"\"></li><li>How can we optimize the entry of an Iron condor</li>  </ul>  <p>&nbsp;</p>  <p>  </p>  ", 
    "end_date": null, 
    "title": "Master Iron Condors - Double the credit for half the risk", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42643_77df_9.jpg", 
    "course_url": "https://www.udemy.com/iron-condor-options-trading-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T21:51:51Z"
}