{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong>Mindset of a 6 Figure Income  Earner: How to Craft Yours </strong>where you will learn the mental strategies found in many six figure income earners. </p>\n\n<p>Examine the course image more closely. Notice how there are many different emotions?</p>\n\n\n\n<p> How you feel about money is a clue regarding your current mindset. </p>\n\n\n\n<p>Your mindset is effecting your results ... for better or worse.</p>\n\n\n\n<p>This course covers: </p>\n\n\n\n<p>1) how an abundant mindset <strong>looks and feels</strong>. I'm giving you a pictorial representation of mindset (mindset is normally invisible) that's easy to work with, understand and use to create your mental changes.</p>\n\n\n\n<p>2) how to craft your own.</p>\n\n\n\n<p>3) what to do, and how to tell, when you don't know if you're mindset is changing.</p>\n\n\n\n<p><em>PLEASE LOOK OVER THE COURSE OBJECTIVES RIGTH NOW FOR MORE SPECIFICS ABOUT WHAT THIS COURSE COVERS.</em><br></p>\n\n\n\n<p><strong>The information in this course is practical and applicable, immediately. I'm giving you the structure for our <em>family</em> money mindset— which contains the same components, the same structure, that has been researched and proven to be found among wealthy individuals. </strong><em></em></p>\n\n\n\n<p>I explain the \"wealth money mindset\" in a simple way so you can see HOW it takes shape just by living a normal, everyday life. I teach you how an abundant mindset looks and feels.</p>\n\n\n\n<p><em>TAKE A FEW MINUTES AND WATCH THE FREE PREVIEWS RIGHT NOW TO GET AN IDEA REGARDING THE STYLE AND CONTENT OF THIS COURSE.</em></p>\n\n\n\n<p>Everything in this course can be applied immediately to help get on the abundant path you desire. It's specifically tailored for individuals with families—how I speak in the lessons and how I approach this topic—because this is how my husband and I work: <em>partnership from the start</em>. </p>\n\n\n\n<p>This is how I'm inviting you to enter this course ... as a partnership from the start (between you and I). If you're willing to put in the time and effort to create the results you want, I will be here to help you along the way. I am truly dedicated to your success!</p>\n\n\n\n<p>Consider this:</p>\n\n\n\n<p><strong><em>A healthy, structured mindset is to success as teeth brushing is to nice smelling breath: ridiculously necessary. You're going to learn how to craft your strong, healthy and abundant mindset in this course.</em></strong></p>\n\n\n\n<p>I realize money is a sensitive topic for many people. I want you to know upfront that this course is not about spouting doctrine I do not follow myself. It's also not a promise that you'll earn six figures. </p>\n\n<p>It's about coaching you to a strong mental foundation, on a very practical level, so you can <em>progressively</em> move toward earning the income you desire. Earning a six figure income, which my husband and I have achieved for over twelve consecutive years, takes time and dedication. It takes being patient with yourself as you work out the kicks in your thinking, feeling and actions. </p><p>I know you understand when I say I make no promises of what you will ever earn. It's not up to me; it's up to you.<br></p>\n\n\n\n<p>Get excited you've found this course if your looking to create new outcomes this year for yourself and your family. You will love the simplicity of the ideas and exercises as you see the results in your own life unfold.</p>\n\n\n\n<p>I'm very glad to have you in class! Be sure to enroll right now. What do you have to lose? </p>\n\n\n\n<p><em>***This course is unique in that it's not just about earning a certain level of income, it's about learning to be the best version of yourself you can be <strong>in all areas of your life</strong> ... which translates to happy, health and wealthy ... not JUST wealthy. Once you understand mindset in general, you can build a strong mindset around any topic you choose.***</em><br></p>", 
    "end_date": null, 
    "title": "Mindset of a 6 Figure Income Earner: How to Craft Yours", 
    "price": "50.00", 
    "instructors": "Allison Sutter", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691180_9cae_2.jpg", 
    "course_url": "https://www.udemy.com/mindset-of-a-6-figure-income-earner-how-to-craft-yours/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T17:05:57Z"
}