{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Become an MQL4 Programmer!</strong></p><p>If you are a trader looking for ways to make trading simpler and more efficient, you've come to the right place. Leverage technology to your advantage!</p><p>If you are a trader-programmer who would like to bring your programming and algorithmic trading skills to the next level, this course is for you. No need to reinvent the wheel!<br></p><p>If you are somebody just looking for a new hobby, try algorithmic trading through this course. There are only so many hobbies where you are compensated for doing something great!<br></p><p>This course is the <strong>most intensive, yet straightforward, </strong>course for the <strong>MQL4 programming language</strong> - based on years of experience of an MQL4 programmer. </p><p><strong>Probably\n the fastest way to learn how to build complex trading robots and \nscripts using the MQL4 programming language, for beginners, \nnon-programmers, and traders!</strong></p><p>The course  is designed, with the beginner in mind:</p><ul><li>Low information diet - take only what you need to move on to the next lesson</li><li>Learn the rules of trading, which you may use as well to enhance your own manual trading</li><li>Develop MQL4 programming skills, and learn to apply  to solve common problems in both manual and automated trading</li></ul><p>By the end of this course, students would be able to independently develop robust and efficient trading robots and scripts based on their own ideas, and expand on their programming knowledge on their own, as an MQL4 programmer!<br></p>", 
    "end_date": null, 
    "title": "MQL4 Programming for Traders: Build Robust Trading Robots!", 
    "price": "25.00", 
    "instructors": "Enrico Lambino", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703770_f0ce_2.jpg", 
    "course_url": "https://www.udemy.com/algorithmic-trading-bootcamp-metatrader4/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T13:00:16Z"
}