{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  The course is about putting in the right numbers for the business plan and how to put a business plan together. There are template plans for you to download and use.  </p>  <p style=\"\">  \t  The terminology which you can expect to come across are SWOT analysis (Strengths, Weaknesses, Opportunities, Threats), segmentation, fixed costs, variable costs, economies of scale and ratios.  </p>  <p style=\"\">  \t  There&#039;s various booklets and sample business plans to download.  </p>  <p style=\"\">  \t  The course will take approx 1 hour to complete.  </p>  <p style=\"\">  \t  The course is structured in a way so that you watch the video which explains the concepts, and there are templates for you to use and download in your own business.  </p>  <p style=\"\">  \t  We look at some key numbers which are important for the business plan – both in terms of income and expenses. We consider:  </p>  <p style=\"\">  \t  ·Key partnerships  </p>  <p style=\"\">  \t  ·Key activities  </p>  <p style=\"\">  \t  ·Key resources  </p>  <p style=\"\">  \t  ·Customers  </p>  <p style=\"\">  \t  ·Distribution channels  </p>  <p style=\"\">  \t  ·Costs  </p>  <p style=\"\">  \t  ·Income streams  </p>  <p style=\"\">  \t  It&#039;s an ideal course if you are working in the accounts / finance department and/or if you are thinking of starting a business or if you&#039;re helping someone write a business plan.  </p>  <p style=\"\">  \t  Traditionally business plans focus on what the business does and how. But within this course we specifically look at the key numbers within a business plan and how we can evaluate a business plan by looking at its cost structures and revenue streams – instead of just looking at what it does, and its cashflows – we look at and analyse other aspects of the business plan which traditionally doesn’t happen.  </p>  <p style=\"\">  \t  One can even go further by using these plans to improve on the business bottom line PURELY by focusing on its cost structures and revenues and relating it to the key activities which it then has to perform and the key resources it needs to perform them, as well as the key partnerships which have to be in place to make it happen.  </p>", 
    "end_date": null, 
    "title": "Numbers for the  Business Plan", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304424_7976_2.jpg", 
    "course_url": "https://www.udemy.com/numbers-for-the-business-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T20:42:05Z"
}