{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>General Douglas MacArthur </strong>said: \"There is no security on this earth; there is only opportunity.\"</p><p>Please watch <strong>promo-video</strong>, as it goes directly through the course!</p><p>The course is up to date for <em>November 2015!</em><br></p><p>This course will not make you rich in a one single day with security, but <em>will teach a trading method and opportunity to get rich one day</em><strong>! </strong>The method utilized by <strong>hedge funds</strong> and <strong>asset management companies</strong></p><p>As a super-proof, we'll have a<em> 14 days practice run</em> on a<strong> live account</strong> with <strong>real money</strong> which finished with<strong> US $551 profit.</strong> You will see step-by-step how this result was achieved. Bonus lecture shows result in <strong>30 days</strong> after start with<strong> profit of US $970</strong>!</p><p>This course <em>provides complete information</em> about <strong>option selling on the US commodity futures market </strong>(Crude Oil, Gold, Natural Gas, Wheat, Corn, Cotton and many other)! This method utilize <strong>option time decay </strong>as a primary income vehicle.</p><p>It is suitable for beginner or advanced level traders, <strong>with or without previous trading experience</strong>.</p><p>Using <em>easy to understand words, pictures and examples</em> I will show that trading is available for everybody!</p><p>Many people skip the learning<strong> trading options</strong> because this field is considered to be difficult: <strong>all options books</strong> have sophisticated charts and diagrams. Once they touch all those volatility, delta, gamma and other Greeks and terminology they decide to go to<strong> Forex or Stock trading, </strong>with unpredictable result. </p><p>But<em> it is not that difficult at all,</em> this knowledge is easy to understand and accept!</p><p><em>My 8 years of trading experience </em>brought me to the option selling <strong>as the only way to consistently make money,</strong> in 90% of the time. I started with <strong>Forex</strong> and then switched to <strong>commodity futures</strong> and now I have been trading <strong>options </strong>for 4 years.</p><p><strong>No secrets kept from you, </strong>I undercover how it works, and how to avoid beginner's mistakes to save your time and money!</p><p><strong>Option selling utilize the time decay of sold options to gain profits. </strong>Trading creates money for you as the time goes! That's why many option sellers refer to a sentence: <em><strong>we sell the time, or exchange the time for money.</strong></em></p><p><strong>You won't need to catch any highs to sell or lows to buy</strong>. The<em> strategy allows you to have profit in 95%</em> of all your trades and to manage the rest 5%!</p><p>You <em>don't need any specific knowledge or skills!</em> All information, software and links are provided!</p><p>Section 4 features who else utilize <strong>option selling</strong> to gain the profit! Starring famous <strong>James Cordier, Karen the Supertrader</strong> and Capital Management Company with <strong>$335 mln </strong>assets under management!</p><p>Dive into the financial industry of hedge-fund style trading!</p><p>More than just a theory, <strong>I undercover practical questions</strong> – how to open, manage and close position.</p><p>Even if you are not trading, or trading<strong> </strong><strong>Forex</strong><strong> </strong>and wish to become rich one day - t<strong>he option selling </strong>method may bring you closer to your dream.</p><p><em>Every penny paid </em>for this course <strong>worth hundreds of dollars and months</strong><strong> </strong>of my experience; you receive it literally for free.</p><p>And indeed, you don't risk anything as Udemy provides you with <strong>30 days money-back guarantee!</strong></p><p>So roll in and enjoy!</p><p>P.S. Check my other <strong>3 option courses</strong>, related to this one!</p>", 
    "end_date": null, 
    "title": "Option selling trading as income source. Beginners friendly", 
    "price": "20.00", 
    "instructors": "Alex Gorbunov", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443584_97b4_4.jpg", 
    "course_url": "https://www.udemy.com/option-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T10:02:54Z"
}