{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<strong></strong><strong>THREE COURSE BUNDLE - 10+ HOURS</strong><p>  \t The first 3 Options Trading Strategies courses are combined to create this bundle. To master the basics of Options, you really need all three courses. </p>  <p>  \tA brief synopsis of the options trading strategies courses are provided blow, but for complete details please visit the individual course links below.  </p>  LEARN CALL OPTIONS AND PUT OPTIONSOPTIONS FOUNDATION - TIME DECAY, IMPLIED VOLATILITY, OPTION GREEKS  BUYING CALL OPTIONS AND PUT OPTIONS - LIVE TRADES  <p>  \t<strong> SECTION I -  Call Options</strong>  </p>  <p>  \tMost people learning Options for the first time face too much jargon and complex language. This options trading strategies course use real-world examples (buying a house) to explain how a Call Option (Section 1) works in real life. This example should make it absolutely clear what a Call Option is in step-by-step details.  </p>  <p>  \t<strong>SECTION II - Put Options. </strong>  </p>  <p>  \tThe Put Option is the ultimate \"protector\" of your portfolio, and in this course you can learn how Put Options work. It is the exact opposite of a Call Option. Put Options increase in value when the value of a stock or index drops in price. We define what a Put Option, and just like we did in the Call Option, we consider a real-world example of a Put Option.  </p>  <p>  \t<strong>SECTION III - Stock and Options combo strategies</strong>  </p>  <p>  \tIn this section, three creative strategies are outlined for Stock investors to combine Options into their portfolio strategies.  </p>  <p>  \t·  Use Options to buy Stock at prices that are far lower than what the stock is currently trading for  </p>  <p>  \t·  Use Options to sell Stock at prices that are far higher than what it is currently trading for  </p>  <p>  \t·  Use Options to hedge a Stock position that you already own  </p>  <p>  \t<strong> SECTION IV - TIME DECAY</strong>  </p>  <p>  \tTime decay is a pivotal component of Options strategies. In fact, time decay alone is responsible for the majority of advanced option strategies. In this part of the options trading strategies course, we are going to study the concept in detail. Options are \"wasting\" assets, and they lose value every day. The buyer gets hurt from time decay and the seller benefits from it. And time decay becomes more exponential as we approach expiry of an Option. It is also the great equalizer between the profiles of a buyer and seller of Options. Time decay is the great equalizer in the risk / reward profiles of buyers and sellers of Options. Several intermediate and advanced strategies are based on selling premium (option sellers) and these positions make a profit due to time decay in the value of these options over a period of time.  </p>  <p>  \t<strong> SECTION V - IMPLIED VOLATILITY </strong>  </p>  <p>  \tImplied Volatility is the \"wildcard\" in Option prices. Ignore it, and you will pay a price. In fact, it's so important we have at least four different varieties - Volatility, Implied Volatility, Historical Volatility, and Future or Expected Volatility. We use the real-world examples to explain the concept of Volatility in simple terms. Then we study how Volatility is quantified in Stocks and Options. And how Volatility finds a back-door to embed itself into Option prices. Implied Volatility considerations are critical when choosing between a buyer and seller profile. We break this complex topic down into simple terms and show you an example of NFLX and CAT options that should make it absolutely clear what this is all about.  </p>  <p>  \t<strong>SECTION VI - OPTION GREEKS, DELTA, GAMMA, VEGA, THETA</strong>  </p>  <p>  \tIf you're the pilot of an aircraft, the Greeks are your instrument panel. If you don't manage your instrument panel properly, well...you get the picture. Understanding the Greeks are absolutely critical to every Option position. We break this course into easy to understand chapters for all the four Greeks - Delta, the king of all Greeks. Gamma - the silent operator. Theta - every Option seller's dream. And Vega - Watch out for this one.. Most beginners to Options tend to ignore the Greeks. Master the Greeks and you'll shave off months of learning curve. Not to mention, you can then fly your aircraft on \"auto-pilot\" (with help from the Greeks).  </p>  <p>  \t<strong>SECTION VII - OPTIONS MARKET STRUCTURE</strong>  </p>  <p>  \tThe Options market has a number of terms that we need to be aware of. Starting with terminology differences like \"Long\" and \"Short\", we look at all the details that go into the Options market. We explain the important processes like Exercise and Assignment, as well as things like Expiry series, Bid-Ask spreads, Brokerage and transaction costs and various other details. What is Open Interest and why is it important, and what is the role of a Market Maker. We study the different Order types and which ones are important for the average investor, and which ones make sense in different situations. We also discuss Regulation T Margin as it applies to Options as well as Portfolio margin.  </p>  <p>  \t<strong>SECTION VIII - BUY A CALL OPTION (CHIPOTLE MEXICAN GRILL)</strong>  </p>  <p>  \tBuying a Call Option is the most basic of all the Option strategies and is the most efficient strategy to optimize a bullish outlook on a stock. In this options trading strategies course, we take the example of Chipotle Mexican Grill (CMG) and show how the trade played out. We analyze the rationale behind entering the trade, the risk/reward profile, chart analysis and point of entry, choice of expiry and \"moneyness\" of the Option, time decay considerations, margin requirements, profit expectations, exit criteria, Greek analysis, its Profit and Loss profile and various other considerations. We provide a 360-degree analysis before trade entry. This is a real trade and over 15 days, and we navigate the trade to its exit point.  </p>  <p>  \t<strong>SECTION IX - BUYING A PUT OPTION (FXE EURO ETF)</strong>  </p>  <p>  \tBuying a Put Option serves two purposes - exploit a bearish move in the stock or be the ultimate protector of your stock. In this part of the course, we take the example of the Euro ETF (FXE) and show how the trade played out in about 25 days time. We analyze the rationale behind entering the trade, the risk/reward profile, chart analysis and point of entry, choice of expiry and \"moneyness\" of the Option, time decay considerations, margin requirements, profit expectations, exit criteria, Greek analysis, its Profit and Loss profile and various other considerations. We provide a 360-degree analysis before trade entry. We show you how to \"let your winners run\" in a controlled manner.  </p>  <p>  \t<strong>SECTION X - STRATEGY AND OPTIMIZATION </strong>  </p>  <p>  \tThe Option strategy optimization course brings all the 4 Options strategies together. The 4 strategies are comprised of 2 bullish and 2 bearish strategies, but how and when should we choose a particular strategy over the other. We create a helpful \"4 strategies box\" to distinguish and connect one strategy to the other. Most importantly, what are all the considerations before we choose a strategy. Our choice of strategy depends not only on what the stock is currently doing, but also on various market externalities as well as a few key Option metrics like Implied Volatility. This course also provides a sneak peek into advanced Option topics like the VIX (Fear index\"), trade simulation as well as trade adjustment parameters.  </p>  <p>  \t<strong>SECTION XII - SINGLE OPTION ADJUSTMENTS </strong>  </p>  <p>  \tThis options trading strategies course studies the need for Option adjustments, and why adjustments are as critical to the success of your position as good entry or analysis. We consider all the four basic strategies - the Long Call, Short Call, Long Put, and the Short Put and look at various adjustments to these positions if they get into trouble. Every investor has a \"pain point\" - this is the point at which they adjust their position. Applying a rigorous approach to this pain point enables investors to control risk while maximizing the opportunity to profit. The course also discusses various details like early adjustments, over-adjusting and adjusting profitable trades as well as the importance of the investor's outlook for the stock when considering adjustments.  </p>  <p>  \t<strong>This bundle consists of  Courses I through III of a 4-course step-by-step program to achieving Options mastery. </strong>  </p>  <p>  \tCourse I - Introduction to Options - Learn about Call Options and Put Options is a detailed step-by-step explanation of Options, Call Options and Put Options with theory and practical application with Apple (AAPL) Options  </p>  <p>  \tCourse II - Options Foundation - Time Decay, Implied Volatility and Options Greekswill complete your theoretical understanding of Options.  </p>  <p>  \tCourse III is Options strategies for Beginners - Buying Call Options and Put Options where we actually put live trades and manage them to their exit points.  </p>  <p>  \tCourse IV is on Options Spreads - This is the heart of Options Trading. Once you master Options spreads, you have acquired a skill that can generate consistent monthly income for the rest of your life.  </p>  <p>  \t<strong>Please feel free to browse this page for a complete list of Testimonials from our clients, Blog readers and Linkedin group members.</strong>  </p>  <p>  \t<strong></strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \tTake this ultimate Options Trading Strategies course right now and learn options trading.  </p>", 
    "end_date": null, 
    "title": "Options Trading Basics (3-Course Bundle)", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43319_36fd_6.jpg", 
    "course_url": "https://www.udemy.com/learn-options-trading-courses/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-24T14:47:08Z"
}