{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">SECTION I - PHILOSOPHY AND DEFINITION OF SPREADS</strong>  </p>  <p>  \t We introduce all four Options Spreads in this Bundle (Bull Call, Bear Call, Bull Put and Bear Put). This bundle is a very comprehensive coverage of all four Option spreads. Options spreads sit right in between the 4 basic Option positions and the more Advanced level Option strategies. The Spread is the bridge between the basic Option strategies and the advanced strategies. In fact, most advanced strategies are composed of the spreads we cover in this course, so this stuff is key. For the busy professional, Spreads offer the right mix of reward and risk. All 4 vertical spreads introduced in this course are extensions of the 4 basic Options. Spreads add an element of cost control and / or risk control to individual Options positions. Master the four Options Spreads, and you would have acquired a skill that can create consistent monthly income. Additionally, you&#039;ll be well on your way to mastering the advanced Options strategies.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>Advantages and disadvantages of single Option strategies - Long and Short</li>  \t<li>How Spreads tackle the negatives of individual Options</li>  \t<li>With Spreads, you can now be a seller of Options</li>  \t<li>The meaning of &quot;defined risk&quot; Options investing</li>  \t<li>Spreads help you control your costs and risk exposure</li>  \t<li>What are the differences between credit and debit spreads</li>  \t<li>Control risk and costs without compromising on Probability</li>  </ul>  <p>  \t<strong style=\"\">SECTION - II REAL LIVE TRADES ON THE 4 OPTION SPREADS</strong>  </p>  <p>  \t<strong style=\"\">THE BULL CALL SPREAD</strong>  </p>  <p>  \t The Bull Call Spread is an extension of the Long Call Option. When you buy a Call Option, you are bullish. The Bull Call spread maintains the bullish element of the Long Call while controlling your costs and has a limited losses profile. Of course, everything is a compromise. But you would probably be willing to make this compromise. We explain why this spread is called a Bull Call spread, and how to address any confusion from these strange names. The risk-reward profile of a Bull Call spread is very favorable. We define why the Bull Call spread is a Debit spread, and study its Profit and Loss diagrams in detail. We put a real trade on IBM and we navigate the trade for a couple of weeks.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>Differences between Debit spreads and Credit spreads</li>  \t<li>How does the Bull Call reduce your costs</li>  \t<li>What do we give up when we put on a Bull Call spread</li>  \t<li>What are the criteria for a good Bull Call spread</li>  \t<li>Put a real Bull Call spread on IBM and understand the position</li>  \t<li>Analyze, simulate the trade through various stages of the trade</li>  \t<li>Put the trade in context with the overall market condition</li>  \t<li>Analyze exit points carefully and execute the exit</li>  </ul>  <p>  \t<strong style=\"\">THE BEAR CALL SPREAD</strong>  </p>  <p>  \t The Bear Call Spread is a credit spread, and we explain why credit spreads are a viable way to assuming an Option seller&#039;s profile. The Bear Call spread limits your risk. We study the role of Probability in selecting credit spreads as well as Implied volatility considerations and time decay. Time decay is a key component of credit spreads and the Bear Call spread can be an excellent way to generate monthly income. All spreads can be part of the busy professional&#039;s playbook, but credit spreads can be especially attractive. We analyze the right criteria for credit spreads, including the selection of the expiry series as well as the individual Options itself. We put a real trade on Amazon (AMZN) and track, monitor and adjust this trade until its exit.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>Differences between Debit spreads and Credit spreads</li>  \t<li>How does the Bear Call spread control your risks</li>  \t<li>What do we give up when we put on a Bear Call spread</li>  \t<li>What are the criteria for a good Bear Call spread</li>  \t<li>Analyze chart and resistance levels for a good Bear Call</li>  \t<li>How do we put Probability on our side</li>  \t<li>The balance between premium collected and time to expiry</li>  \t<li>Put a real Bear Call spread on AMZN and understand the position</li>  \t<li>Analyze, simulate the trade through various stages of the trade</li>  \t<li>Put the trade in context with the overall market condition</li>  \t<li>Analyze exit points carefully and execute the exit</li>  </ul>  <p>  \t<strong style=\"\">THE BEAR PUT SPREAD</strong>  </p>  <p>  \tThe Bear Put spread can be a powerful strategy for bear markets. The Bear Put is an extension of the Long Put Option. The Bear Put has some specific features, which make it a very attractive spread, and we dig deep into these characteristics. We put a real trade on Netflix (NFLX). The risk reward characteristics of Bear Put spreads are very attractive as its losses are limited. The Bear Put, just like the Long Put is a Vega positive trade, so this trade can optimize a bearish move as well as any upside from Implied volatility changes. The choice of expiry series, time decay effects and the choices of individual Options are also important.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>Why the Bear Put spread is a debit spread</li>  \t<li>How the Bear Put spread optimizes a bearish move in a stock</li>  \t<li>Get benefits from Delta and Vega - double deal</li>  \t<li>Why this is a Limited Losses spread</li>  \t<li>How time decay affects the Bear Put spread</li>  \t<li>Study of Profit and Loss diagrams</li>  \t<li>Plan the trade entry for a Bear Put spread</li>  \t<li>Chart and Stock analysis</li>  \t<li>Plan and execute the exit on the NFLX trade</li>  </ul>  <p>  \t <strong style=\"\">THE BULL PUT SPREAD</strong>  </p>  <p>  \t The Bull Put spread is a flat to bullish that profits primarily from time decay, but can also profit quicker from a move to the upside. Its important to pick the right strike prices for the Bull Put spread, as is a thorough analysis of the stock&#039;s chart and support levels. In this course, this is what we do - we pick Google (GOOG) as our candidate for the Bull Put, and analyze past price action, support levels and put on a successful Bull Put spread.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>The anatomy of a good Bull Put spread</li>  \t<li>Analysis of stock chart and support levels</li>  \t<li>What is special about the Bull Put spread</li>  \t<li>How does the Bull Put spread control your risks</li>  \t<li>How do we put Probability on our side</li>  \t<li>The balance between premium collected and time to expiry</li>  \t<li>Put a real Bull Put spread on GOOG and understand the position</li>  \t<li>Analyze, simulate the trade through various stages of the trade</li>  \t<li>Put the trade in context with the overall market condition</li>  \t<li>Analyze exit points carefully and execute the exit</li>  </ul>  <p>  \t<strong style=\"\">MONTHLY INCOME STRATEGIES PRIMER</strong><br style=\"\">  \t  This is a BUSY PROFESSIONALS SERIES. If you have a regular job, then you need strategies that allow you to focus on your job, but yet create a somewhat stable and reliable income stream from your investments. The Covered Call, which we covered in COURSE I, is an excellent example of such a strategy. In this PRIMER, we dig deep into credit spreads and understand why being an Option seller (risk defined of course - no naked selling) may not be that bad after all.  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">This is Course IV of a 4-course step-by-step program to achieving Options mastery. </strong>  </p>  <p>  \tCourse I - Introduction to Options<a href=\"http://optiontiger.com/category/473/options-beginner/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> - Learn about <a href=\"http://optiontiger.com/course/call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Call Options</a> and <a href=\"http://optiontiger.com/course/put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> is a detailed step-by-step explanation of Options, Call Options and Put Options with theory and practical application with Apple (AAPL) Options  </p>  <p>  \tCourse II - Options Foundation - <a href=\"http://optiontiger.com/course/time-decay/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Time Decay</a>, <a href=\"http://optiontiger.com/course/implied-volatility/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Implied Volatility</a> and <a href=\"http://optiontiger.com/course/option-greeks/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Greeks</a>will complete your theoretical understanding of Options.  </p>  <p>  \tCourse III is Options strategies for Beginners - <a href=\"http://optiontiger.com/course/buying-call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Buying Call Options</a> and <a href=\"http://optiontiger.com/course/buying-put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> where we actually put live trades and manage them to their exit points.  </p>  <p>  \tCourse IV is on <a href=\"http://optiontiger.com/course/option-spreads-philosophy/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Spreads</a> - This is the heart of Options Trading.<a href=\"https://www.udemy.com/options-spreads-explained/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> Once you master Options spreads, you have acquired a skill that can generate consistent monthly income for the rest of your life.  </p>  <p>  \t<strong style=\"\">Please feel free to browse this page for a <a href=\"http://optiontiger.com/testimonials/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">complete list of Testimonials</a> from our clients, <a href=\"http://blog.optiontiger.com/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Blog</a> readers and <a href=\"http://www.linkedin.com/groups/Stock-Options-Trading-Group-4581863?gid=4581863&amp;trk=hb_side_g\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Linkedin group</a> members.</strong>  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Options Spreads Bundle-  the heart of Options Trading", 
    "price": "40.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42197_dbb3_15.jpg", 
    "course_url": "https://www.udemy.com/options-spreads-explained/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-18T10:59:55Z"
}