{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t<strong style=\"\">SECTION I - TIME DECAY</strong>  </p>  <p>  \tTime decay is a pivotal component of Options strategies. In fact, time decay alone is responsible for the majority of advanced option strategies. In this part of the course, we are going to study the concept in detail. Options are &quot;wasting&quot; assets, and they lose value every day. The buyer gets hurt from time decay and the seller benefits from it. And time decay becomes more exponential as we approach expiry of an Option. It is also the great equalizer between the profiles of a buyer and seller of Options. Time decay is the great equalizer in the risk / reward profiles of buyers and sellers of Options. Several intermediate and advanced strategies are based on selling premium (option sellers) and these positions make a profit due to time decay in the value of these options over a period of time.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>What is time decay and how does it benefit Option sellers</li>  \t<li>A complete recap of buyer and seller risk and reward profiles</li>  \t<li>Why does the seller of Options not want movement in the Stock</li>  \t<li>Why is Time decay the great equalizer between buyers and sellers of Options</li>  \t<li>Apply the concept of time decay to our real world examples</li>  \t<li>How can we observe Time deacy in Options in the financial markets</li>  \t<li>Demonstration of time decay using AAPL Options</li>  </ul>  <p>  \t<span class=\"Apple-style-span\"><br style=\"\">  \t </span><strong style=\"\">SECTION II - IMPLIED VOLATILITY AND OPTION PRICES</strong>  </p>  <p>  \t Implied Volatility is the &quot;wildcard&quot; in Option prices. Ignore it, and you will pay a price. In fact, it&#039;s so important we have at least four different varieties - Volatility, Implied Volatility, Historical Volatility, and Future or Expected Volatility. We use the real-world examples to explain the concept of Volatility in simple terms. Then we study how Volatility is quantified in Stocks and Options. And how Volatility finds a back-door to embed itself into Option prices. Implied Volatility considerations are critical when choosing between a buyer and seller profile. We break this complex topic down into simple terms and show you an example of NFLX and CAT options that should make it absolutely clear what this is all about.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>How are Option prices determined and is there an unknown variable</li>  \t<li>Why is it difficult to calculate or determine Implied Volatility of an Option</li>  \t<li>Why is this called &quot;implied&quot; Volatility</li>  \t<li>How does Implied Volatility manifest itself into Option prices</li>  \t<li>Why is it the &quot;wildcard&quot; in Option prices</li>  \t<li>Understand a real world example of Volatility</li>  \t<li>What is the relationship between Option prices and Implied Volatility</li>  \t<li>How should buyers and sellers look at Implied Volatility</li>  \t<li>Are some strategies better for high volatility situations</li>  \t<li>How can we observe Implied Volatility in real Option prices</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p>  \t<strong style=\"\">SECTION III - OPTION GREEKS, DELTA, GAMMA, VEGA, THETA</strong>  </p>  <p>  \t If you&#039;re the pilot of an aircraft, the Greeks are your instrument panel. If you don&#039;t manage your instrument panel properly, well...you get the picture. Understanding the Greeks are absolutely critical to every Option position. We break this course into easy to understand chapters for all the four Greeks - Delta, the king of all Greeks. Gamma - the silent operator. Theta - every Option seller&#039;s dream. And Vega - Watch out for this one.. Most beginners to Options tend to ignore the Greeks. Master the Greeks and you&#039;ll shave off months of learning curve. Not to mention, you can then fly your aircraft on &quot;auto-pilot&quot; (with help from the Greeks).  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>The four Greeks that govern all movements in Option prices</li>  \t<li>How each Greek individually impacts option prices</li>  \t<li>Why Delta is the king of all Greeks</li>  \t<li>What do we mean by directional risk</li>  \t<li>How does each Greek affect a buyer and a seller of Options</li>  \t<li>Why the Greeks are critical to understand your Option position</li>  \t<li>How the Greeks impact choice of &quot;moneyness&quot; and expiry series</li>  </ul>  <p>  \t<strong style=\"\">SECTION IV - OPTIONS MARKET STRUCTURE, TERMINOLOGY, MARKET MAKERS AND MORE</strong>  </p>  <p>  \t The Options market has a number of terms that we need to be aware of. Starting with terminology differences like &quot;Long&quot; and &quot;Short&quot;, we look at all the details that go into the Options market. We explain the important processes like Exercise and Assignment, as well as things like Expiry series, Bid-Ask spreads, Brokerage and transaction costs and various other details. What is Open Interest and why is it important, and what is the role of a Market Maker. We study the different Order types and which ones are important for the average investor, and which ones make sense in different situations. We also discuss Regulation T Margin as it applies to Options as well as Portfolio margin.  </p>  <h5>What you will master</h5>  <ul style=\"\">  \t<li>What does Open Interest tell us about liquidity and what should we watch for</li>  \t<li>What is Exercise and Assignment and how does it work</li>  \t<li>What can Open Interest tell us about general sentiment about the stock</li>  \t<li>What are the different Order types and which ones are the best</li>  \t<li>What is the role of Market Makers on the Options exchange</li>  \t<li>How is Regulation T margin calculated and what is Portfolio margin</li>  </ul>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">This is Course II of a 4-course step-by-step program to achieving Options mastery. </strong>  </p>  <p>  \tCourse I - Introduction to Options<a href=\"http://optiontiger.com/category/473/options-beginner/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> - Learn about <a href=\"http://optiontiger.com/course/call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Call Options</a> and <a href=\"http://optiontiger.com/course/put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> is a detailed step-by-step explanation of Options, Call Options and Put Options with theory and practical application with Apple (AAPL) Options  </p>  <p>  \tCourse II - Options Foundation - <a href=\"http://optiontiger.com/course/time-decay/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Time Decay</a>, <a href=\"http://optiontiger.com/course/implied-volatility/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Implied Volatility</a> and <a href=\"http://optiontiger.com/course/option-greeks/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Greeks</a>will complete your theoretical understanding of Options.  </p>  <p>  \tCourse III is Options strategies for Beginners - <a href=\"http://optiontiger.com/course/buying-call-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Buying Call Options</a> and <a href=\"http://optiontiger.com/course/buying-put-options/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Put Options</a> where we actually put live trades and manage them to their exit points.  </p>  <p>  \tCourse IV is on <a href=\"http://optiontiger.com/course/option-spreads-philosophy/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Options Spreads</a> - This is the heart of Options Trading.<a href=\"https://www.udemy.com/options-spreads-explained/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\"></a> Once you master Options spreads, you have acquired a skill that can generate consistent monthly income for the rest of your life.  </p>  <p>  \t<strong style=\"\">Please feel free to browse this page for a <a href=\"http://optiontiger.com/testimonials/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">complete list of Testimonials</a> from our clients, <a href=\"http://blog.optiontiger.com/\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Blog</a> readers and <a href=\"http://www.linkedin.com/groups/Stock-Options-Trading-Group-4581863?gid=4581863&amp;trk=hb_side_g\" rel=\"nofollow\" target=\"_blank\" class=\"external-link\" style=\"\">Linkedin group</a> members.</strong>  </p>", 
    "end_date": null, 
    "title": "Options Foundation - Time Decay, Implied Volatility, Greeks", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41961_89a6_10.jpg", 
    "course_url": "https://www.udemy.com/learn-options-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-16T13:23:21Z"
}