{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">What is the single biggest problem when you&#039;re learning to trade Stocks or Options ?</strong></p><p style=\"\"><strong style=\"\">Even if you&#039;re not learning but already have some experience, what makes the learning process frustrating ?</strong></p><p style=\"\">It&#039;s the fact that the &quot;learning&quot; process can be expensive. i.e. Learning to trade almost always means you lose money in the markets while you learn. Even if you&#039;re experienced, you&#039;re probably losing money as you acquire the skills, the emotional control, and the decision making abilities that are required to become a skillful trader. By the way, this is very normal, and happens to everyone. And this happens for a very specific reason. </p><p style=\"\">The prospect of losing money while learning is not very pleasant. Most brokers or trading platforms have &quot;paper money&quot; accounts where you trade with virtual money and practice your trading. While paper money accounts are great to see and experience how your trades become winners or losers, they lack a significant component of what makes a good trader. <strong style=\"\"><em style=\"\">AND THAT IS THERE IS NO EMOTIONAL INVOLVEMENT WITH YOUR TRADE. Most people generally don&#039;t care if they win or lose because they know it&#039;s NOT real money. The motivation level to make a lot of money with good trades is ABSENT because it&#039;s not REAL money, and the motivation to turn around losing trades is LOW. Once again, because it&#039;s NOT REAL MONEY. </em></strong>So, at the end of the day most people dump the virtual trading environment and jump into the real things, and end up losing money. What if there&#039;s a solution to this problem ???</p><p style=\"\">But what if you could have a &quot;real&quot; environment where you DO CARE even if you don&#039;t have real money. You want to win, you&#039;re motivated to win. And you want to win BIG because you&#039;re highly motivated to win !! That&#039;s exactly what this is course is all about. Find out all the details inside on how you can master trading stocks and Options skills without taking any risks that you&#039;d normally take, but still keep your motivation levels very high to perform well. <strong style=\"\">THIS IS A VERY EXCITING PROCESS FOR STOCK AND OPTION TRADERS..SO LOOK FORWARD TO SEEING YOU INSIDE !!!</strong></p>", 
    "end_date": null, 
    "title": "Practice Live Trading on Stocks and Options without Risks", 
    "price": 0, 
    "instructors": "Hari Swaminathan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466810_9dee.jpg", 
    "course_url": "https://www.udemy.com/practice-live-trading-on-stocks-and-options-without-risks/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T18:21:43Z"
}