{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">We teach about how to drive in school, but not how to manage finances. </strong><strong style=\"\">~ </strong><strong style=\"\"><em style=\"\">Andy Williams</em></strong></p><p>Finance. The backbone of every company. Finance is a glass door into the inner workings of a company. The flaws and successes of a company are exposed in a company&#039;s financial statements. Despite this, many do not know some of the fundamentals of finance such as how to read a balance sheet.</p><p><strong style=\"\">I wasn&#039;t a financial pro, and I paid the price. <em style=\"\">~ </em></strong><strong style=\"\"><em style=\"\">Ruth Handler</em></strong></p><p>In this course you will learn how to become financially literate in a modern organization. From a high-level perspective, this course will illuminate what is important and what isn&#039;t so much when analyzing financial statements and ultimately researching companies. You will gain the ability to provide valuable insights that will impress even some of the most seasoned entrepreneurs.</p><p><strong style=\"\">Landing a million-dollar investment for your startup is exhilarating. But as big as that number sounds, it doesn&#039;t go far. Many startups just getting off the ground won&#039;t have a CFO to monitor finances. It doesn&#039;t take much for spending to spiral out of control. <em style=\"\">~ </em></strong><strong style=\"\"><em style=\"\">Ryan Holmes</em></strong></p><p>The lectures included in this course are:</p><ul style=\"\"><li>Basic Financial Terms</li><li>Balance Sheets</li><li>Gross Margins</li><li>Income Statements</li><li>Cash Flow Statements</li><li>Researching Companies</li><li>Market Capitalization</li><li>Capitalization Tables</li></ul>By the end of this course, you will be an invaluable resource in an early startup organization and sound like an experienced employee to many entrepreneurs. Knowing is half the battle. If you know where the money is, you just may be able to get to it.<p><strong style=\"\">It is usually people in the money business, finance, and international trade that are really rich. <em style=\"\">~ </em></strong><strong style=\"\"><em style=\"\">Robin Leach</em></strong></p>This course will help you gain a new perspective on any organization and will help you fend for yourself in the money world we live in.<p style=\"\">No prior experience or software is required for this course - just a mindset that is open to learning, and a realization that Finance is important to be a more valuable employee.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Practical Finance", 
    "price": 0, 
    "instructors": "Jobs University LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/489146_0afe_2.jpg", 
    "course_url": "https://www.udemy.com/practical-finance/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-29T04:01:01Z"
}