{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Professional Bookkeeping and Accounting 2 - a comprehensive course for those that need to record and account for Petty Cash and Bank transactions.</p><p><strong>In This Course You Will Learn How To Record And Account For Petty Cash And Banking transactions. You Will Also Learn The Process Behind These Transactions and the Relevant Reconciliations.</strong></p><p>Do you need to understand and record petty cash or banking transactions for your business? Are you considering a career in Bookkeeping or Accounting? Are you studying for Professional Accounting or Bookkeeping exams? <em><strong>THEN REGISTER NOW</strong></em></p><p><strong>Course Overview</strong></p><p>Section 1 of this course is an introduction section. After the course introduction we will begin this course by introducing you to both the prime books of entry and cross totting as you will need a working understanding of these through out this course. You will also be presented with the case study that we will use in the activities in section 2 and 3 of this course.</p><p>In section 2 we will move into Petty Cash. We will walk through each step of the petty cash process from raising petty cash vouchers, entering data to the daybook and reconciling and replenishing the petty cash. Through out this section you will have a number of activities using the case study presented in section 1 and these activities will give you the opportunity to:</p><ul><li>Raise petty cash vouchers</li><li>Enter petty cash transactions to the petty cash daybook</li><li>Close the daybook and calculate the balance carried down</li><li>Reconcile the petty cash</li><li>Replenish the petty cash</li></ul><p>Section 3 of this course is about Banking Transactions. Through out this section you will have a number of activities using the case study presented in section 1 and these activities will give you the opportunity to:</p><ul><li>Check remittance advice</li><li>Enter payments and receipts to the 3 column and analysis cash book</li><li>Close the cash book and calculate the balance carried down</li><li>Reconcile the bank</li></ul><p>This course contains:</p><p>A case study that we will use through out this course</p><p>Workbooks to download <br></p><p>Activities to complete</p><p>Quiz </p><p>Certificate of Completion</p><p>******BONUS****** FREE Join a community of other learners where you can interact with each other and with the instructor.</p><p><strong>********************************************************************************************</strong></p><p><strong>REGISTER NOW and get started with Professional Bookkeeping and Accounting 2 - Petty cash and Banking transactions!</strong></p><p><strong>*******************************************************************************************</strong></p><p>Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you don't learn anything new from this course, simply request a refund within your 30 day period for your money back, no questions asked.<br></p>", 
    "end_date": null, 
    "title": "Professional Bookkeeping & Accounting 2 -Petty Cash & Bank", 
    "price": "25.00", 
    "instructors": "Paula Guilfoyle", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615204_64cd_4.jpg", 
    "course_url": "https://www.udemy.com/professional-bookkeeping-accounting-2-petty-cash-bank/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T20:27:07Z"
}