{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>There are several option and financial courses out there. Most of them promise to teach you a set of strategies that can deliver huge profits with limited risk. The fact is, most retail option traders actually lose money. Sure enough, they might have a couple of successful trades at the beginning. But sooner or later, the odds play out, and poor trading techniques cause a cascade of errors.  </p><p>The goal of this course is <strong style=\"\">teach you the way professionals play</strong>. They don&#039;t lose money, they make a consistent profit. The profits might not be a 700% return on one trade, but rather, a daily 1% return in many. When you add the numbers up, you will see that<strong style=\"\"> the smart, patient trader actually wins the race at the end of the year</strong>.</p><p>The course will not be delving into non-essential information. You do not need to know about complex strategies that have very poor success records, or delve into excessive mathematics or chart reading. We have <strong style=\"\">backtested years of financial data</strong> to show which strategies actually, consistently, work. This is not our opinion, it is what the statistics show. As a result, we will <strong style=\"\">only focus on the top most statistically successful strategies, </strong>and will teach you <strong style=\"\">when to use which, </strong>depending on the<strong style=\"\"> market conditions </strong>and your<strong style=\"\"> personal trading profile</strong>.</p><p>At the end of this course, not only will you have solid knowledge about options trading, but you will have the benefit of knowing what works and what doesn&#039;t. You will know how to take advantage of<strong style=\"\"> volatility, </strong>the implied mathematical<strong style=\"\"> probabilities, </strong>and the <strong style=\"\">time to expiration</strong>. Oh, and you most probably be able to get back the money you invested in this course in one trade.</p><p><strong style=\"\"><em style=\"\"><br style=\"\"></em></strong></p><p><strong style=\"\"><em style=\"\">What makes this course stand out from the rest?</em></strong></p><ul style=\"\"><li>We only focus on the strategies that statistically work. We have backtested years of financial data to come up with this list</li></ul><ul style=\"\"><li>We focus on teaching, not on selling subscriptions or garnering commissions from trades. As a result, we do not promise unrealistic exceptional returns or waste time discussing once-in-a-lifetime lucky guesses</li></ul><ul style=\"\"><li>We go beyond directional strategies, to focus on how to make money even if the market moves against you, by taking advantage of time and volatility</li></ul><ul style=\"\"><li>We explain how you can start making money right away, and give you the techniques you need to be successful from the get-go.</li></ul>", 
    "end_date": null, 
    "title": "Professional Options Trading, Simplified", 
    "price": "30.00", 
    "instructors": "Alex Bastardas", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439362_4cb6_6.jpg", 
    "course_url": "https://www.udemy.com/optionstrading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T09:42:13Z"
}