{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>Course Description</strong></p><p>Professional Bookkeeping and Accounting 4 - a comprehensive course for those that need to prepare Journals, payroll, control accounts and a Trial Balance</p><p><strong>In This Course You Will Learn How To Prepare and Record Journals, Calculate Gross And Net Pay, Understand The Need To Collect Taxes From Payroll, Reconcile Control Account and Prepare a Trial Balance.</strong></p><p>Do you need to create a trial balance from your general ledger? Do you need to make adjustments to the general ledger, do you need to prepare payroll journals? Are you considering a career in Bookkeeping or Accounting? Are you studying for Professional Accounting or Bookkeeping exams? <strong><em>THEN REGISTER NOW</em></strong></p><p><strong>Course Overview</strong></p><p>Section 1 of this course is an introduction section. </p><p>In section 2 we will move into Journals. We will look at the need for journals and we will also produce and prepare the journals day books</p><p>Section 3 of this course is about Payroll. We will look at calculating gross pay and net pay and we will also look at the need for employers to deduct payroll journals.  After this we will then prepare the payroll journals and enter the transactions to the general ledger</p><p>Section 4 of this course is a high level overview of Control accounts</p><p>In section 5 we will prepare an Initial Trial balance and we will look at the steps you can take it if does not balance</p><p><strong>This course contains:</strong></p><p>Workbook to download <br></p><p>Activities to complete</p><p>Quiz </p><p>Certificate of Completion</p><p>******BONUS****** FREE Join a community of other learners where you can interact with each other and with the instructor.</p><p><strong>********************************************************************************************</strong></p><p><strong>REGISTER NOW and get started with Professional Bookkeeping and Accounting 4 - Journals, Payroll and the Trial Balance!</strong></p><p><strong>*******************************************************************************************</strong></p><p>By the end of this course, you'll have the knowledge and confidence make adjustments and entries to the general ledger using journals, calculate gross and net payroll and to prepare a trial balance from the general ledger<br></p><p>********************************************************************************************</p><p>Your purchase is 100% RISK FREE with a 30 day money-back guarantee. If you don't learn anything new from this course, simply request a refund within your 30 day period for your money back, no questions asked.</p>", 
    "end_date": null, 
    "title": "Professional Bookkeeping & Accounting 4:Trial Balance & More", 
    "price": "25.00", 
    "instructors": "Paula Guilfoyle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774570_8702_2.jpg", 
    "course_url": "https://www.udemy.com/professional-bookkeeping-accounting-4trial-balance-more/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-25T23:24:21Z"
}