{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>PROFIT FROM STOCK MARKET CRASHES: THE SHORT SELLING STRATEGY is a course designed to teach you the <strong>right time to sell and take profits before market reverses, using technical analysis, Japanese candlesticks, volatility indices and other essential indicators.</strong><br></p>\n\n<p>The stock market is designed to be moving up.  </p>\n\n\n\n\n\n<p>However, every three to six months price reverses direction and moves down.  Profits that took months to build, can be wiped out in matter of days. </p>\n\n\n\n\n\n<p>This bearish scenario happens regularly: it happened in the past and it will happen again.  When it does, are you ready for it?</p>\n\n\n\n\n\n<p>Whether you are trading stocks, forex, commodities, options, ETFs...<strong> this course will give you the tools you need to take profits before price reverses, as well as learn how to make money during market crashes!</strong></p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>We look at different trading charts and specific stocks to understand how to identify market tops, and the beginning of bearish price movements using the visual illustrations of candlestick charts and other technical indicators.<br></p>\n\n\n\n\n\n<p>This course offers an overview on <strong>the importance of analyzing volatility for time market reversals and market downtrends.</strong></p>\n\n\n\n\n\n<p>You will learn to use three important indicators to analyze market conditions and understand when is the time to stay in the trade, and when it is the time to get of the trade.  </p>\n\n\n\n\n\n<p>You will be giving <strong>specific instruction how to calculate profit target with accuracy</strong>, and <strong>how to set up protective stop losses for preserving your capital.</strong></p>\n\n\n\n\n\n<p>New lectures will be added to the course regularly - at no extra cost to you! This is a course that will continue to grow. </p>\n\n\n\n\n\n<p>Take this course now and learn from our 5+ years of experience. Avoid the most common pitfalls that catch 90% of traders! </p>\n\n\n\n\n\n<p>Too often beginner traders enter the market without the necessary knowledge and practice needed. As a result they take excessive, expensive and unnecessary risks hoping for higher returns. This course will teach you a very effective way to trade in the market successfully and with confidence.<br></p>\n\n\n\n\n\n<p>This course is for all levels: beginners, intermediate and advanced traders! All you need is an open mind and a passion to be successful!</p>\n\n\n\n\n\n<p><strong>Enroll in this course now and start trading the market successfully!</strong></p>\n\n\n\n\n\n<p>Over 15000 students have already joined Sharper Trades courses. Join a large community of successful traders.</p>\n\n\n\n\n\n<p>Click \"<strong>Take This Course</strong>\" and Start Trading Successfully TODAY!</p>\n\n\n\n\n\n<p><em>---------------------------------------------------------------------------------------------------------------------------<br></em></p>\n\n\n\n\n\n<p><em>All our Sharper Trades courses come with:</em></p>\n\n\n\n\n\n<ul><li><strong>30 day money-back-in-full guarantee</strong></li><li>Unlimited lifetime access at <strong>no extra costs</strong></li><li>All future additional lectures, bonuses, etc in this course are <strong>always free</strong></li><li>Our Sharper Trades team is <strong>always available to answer any question</strong> you might have regarding this course. Answers are given in less than 24 hours!</li><li><strong>Your trading success is our goal!</strong></li></ul>", 
    "end_date": null, 
    "title": "Profit from Stock Market Crashes: The Short Selling Strategy", 
    "price": "20.00", 
    "instructors": "Luca Moschini", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692722_c5e4_4.jpg", 
    "course_url": "https://www.udemy.com/profit-from-stock-market-crashes-the-short-selling-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T06:46:31Z"
}