{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tThe purpose of this course is to teach anybody how to acquire a professional trader mindset. This course also will teach you what set of techniques and tools professionals use in the market every day to create wealth. Precise price action strategies, which you can use in any market (Forex, Stocks, Futures, Options) and under any condition.  </p>  <p style=\"\">  \tWe close the gap in the trading education. We put our money where our mouth is, we trade what we teach!  </p>  <p style=\"\">  \tYou will learn key aspects of trading like: how a real pro thinks and acts; how to understand the different crowd psychology behind the price chart; successful business rules and much more!  </p>  <p style=\"\">  \tThe course is divided in 3 stages and is compromised of more than 11 hours of high quality video. You will learn alongside Carlos in the whiteboard for theory and in the charts for practice, he will take you through many chart sessions and you will understand how to create a map of the chart.  </p>  <p style=\"\">  \tThe platform you will use is easy to download and configure, you will have access to Forex and Metals live price charts. (Still you can use any platform or instrument to analyze)  </p>  <p style=\"\">  \tYou can finish this course in one week doing a 2 hours study a day, but a continuous review is imperative to deeply understand everything behind the lessons.  </p>  <p style=\"\">  \tAnybody who devotes time and study to this course will be in a very good position to profit from the markets and to achieve financial freedom.  </p>  <p style=\"\">  \tCarlos will be offering email support and live skype chat during working hours. Also Carlos run a Live Trading Room where you can see him applying the rules you learnt in the course under live market conditions. For more info on how to access this room send an email to <a href=\"mailto:info@zentraders.net\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\" style=\"\">info@zentraders.net</a>  </p>  <p style=\"\">  \t<strong style=\"\">If you are looking for a professional trading course that will give you all the necessary steps to become profitable over the long run, you have come to the right place.</strong>  </p>", 
    "end_date": null, 
    "title": "Professional Trader's Mindset - Complete Forex Course", 
    "price": "50.00", 
    "instructors": "Carlos V.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40670_cb9f_6.jpg", 
    "course_url": "https://www.udemy.com/professional-trader-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-08T10:23:08Z"
}