{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn everything you need to know to <strong>start Trading in the Stock Market today!  </strong></p>\n\n<p>Whether you are trading stocks, forex, commodities, options, ETFs... <strong>this course will give you the competitive edge you need to increase your trading success!</strong><br></p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>Profitable Candlestick Trading Method: 10 Primary Reversals is a course <strong>designed to teach you the visual power of Japanese candlesticks when trading in the stock market. </strong></p>\n\n\n\n\n\n<p>In this course you will learn how to <strong>take advantage of potential price movements before they appear on the chart</strong>. We will talk in detail about price action, volume activity, chart reading, bullish and bearish sentiment, what it means to go long and short, and so much more!<br></p>\n\n\n\n\n\n<p>This course is based on the ancient method of trading known as Japanese candlesticks and offers an in-depth view of the ten primary candlestick reversal patterns as follows: </p>\n\n\n\n\n\n<ol><li>doji</li><li>hammer</li><li>engulfing</li><li>harami</li><li>kicker </li><li>piercing line</li><li>dark cloud</li><li>morning star</li><li>evening star </li><li>shooting star</li></ol>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------<br></p>\n\n\n\n\n\n<p><strong>Reading charts, recognizing pattern formations, understanding price action, and anticipating future price movements is the goal of the trader</strong>. </p>\n\n\n\n\n\n<p>Successful traders identify those potential movements and position themselves accordingly before the general market sees them. </p>\n\n\n\n\n\n<p>Candlestick analysis, combined with the science of technical analysis, makes the observation and recognition of those patterns possible. </p>\n\n\n\n\n\n<p>The combination of these two types of analysis can give you the confidence you need when entering trades, and when it is time to get out of trades and protect your profits.</p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>In this course we reveal all the hidden secrets about Japanese candlesticks.</p>\n\n\n\n\n\n<p><strong>New lectures will be added to the course constantly - </strong><strong>at no extra cost to you!</strong> This is a course that will continue to grow. </p>\n\n\n\n\n\n<p>Take this course now and learn from my 5+ years of experience. Avoid the most common pitfalls that catch 90% of traders! </p>\n\n\n\n\n\n<p>Too often beginner traders enter the market without the necessary knowledge and practice needed. As a result they take excessive, expensive and unnecessary risks hoping for higher returns. This course will teach you a very effective way to trade in the market successfully and with confidence.<br></p>\n\n\n\n\n\n<p>This course is for all levels: beginners, intermediate and advanced traders! All you need is an open mind and a passion to be successful!  </p>\n\n\n\n\n\n<p><strong>Enroll in this course and start trading successfully!</strong></p>\n\n\n\n\n\n<p><em>---------------------------------------------------------------------------------------------------------------------------</em><br></p>\n\n\n\n\n\n<p><em>All our Sharper Trades courses come with:</em></p>\n\n\n\n\n\n<ul><li><strong>30 day money-back-in-full guarantee</strong></li><li>Unlimited lifetime access at <strong>no extra costs</strong></li><li>All future additional lectures, bonuses, etc in this course are <strong>always free</strong></li><li>Our Sharper Trades team is always <strong>available to answer any question</strong> you might have regarding this course.  Answers are given in less than 24 hours!</li><li><strong>Your trading success is our goal!</strong></li></ul>\n\n\n\n\n\n<p><em>---------------------------------------------------------------------------------------------------------------------------</em><br></p>\n\n\n\n\n\n<p>Over 15000 students have already joined Sharper Trades courses. Join a large community of successful traders.</p>\n\n\n\n\n\n<p><em><strong>Click \"Take This Course\" and Start Trading Successfully TODAY!</strong></em><br></p>\n\n\n\n\n\n<p><em><br></em></p>", 
    "end_date": null, 
    "title": "Profitable Candlestick Trading Method: 10 Primary Reversals", 
    "price": "20.00", 
    "instructors": "Luca Moschini", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294292_dc4e_11.jpg", 
    "course_url": "https://www.udemy.com/trading-stocks-successfully-01-ten-primary-reversal-patterns/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T01:28:19Z"
}