{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I am going to show you closely guarded secrets used by successful day traders to make consistent money trading financial markets. </p><p>I am going to reveal <strong>my trading research and experiences with actual Charts and Case Studies.</strong><br></p><p>Candlestick charting patterns have been one of the most popular and effective technical indicators, historically. Whether you are a stock trader, forex trader, commodity trader, futures trader or an investor, you can learn these charting patterns and gain a competitive edge among market participants.</p><p>The BEST feature of the course is, you will learn a real <strong>SKILL</strong>. The SKILL which is independent of your choice of market. You can apply these trading techniques and strategies into any market which can be represented by candlestick charts.</p><p>In this course, I am also going to show how to combine candlestick charts with other technical indicators to create a robust and powerful trading system. </p><p>When you are finished with this course, you will have the ability to create a consistent income from any market in the world. <br></p><p>You also get unlimited email access to ask me any questions along the way, in addition to all future course updates.<span> <br></span></p><p><span>Enroll NOW!!!</span></p><p><span><br></span></p><p><span>This course has been structured into 4 sections:</span></p><p><span>1. Introduction and risk disclaimer</span></p><p><span>2. Basic tools needed for Candlestick Analysis</span></p><p><span>3. Candlestick Charting Patterns</span></p><p><span>4. Bonus section</span></p>", 
    "end_date": null, 
    "title": "Proven Methods In Trading Candlestick Patterns", 
    "price": "25.00", 
    "instructors": "Shalin Rabadia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/713416_e2b2_4.jpg", 
    "course_url": "https://www.udemy.com/candlestick-patterns-winning-the-day-trading-game/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T16:40:27Z"
}