{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This information is available to anyone who wants to understand all aspects of the credit score, from the differences between the various scoring models, to how they&#039;re calculated. Save hundreds, if not thousands of dollars on the cost of credit by implementing these practical solutions to managing your personal finances today!</p><ul style=\"\"><li>Learn why you have a different credit score from each of the credit reporting agencies!</li></ul><ul style=\"\"><li>Find out the one thing that prevents a high score (780) from being an 800!</li></ul><ul style=\"\"><li>Discover what consistently drops your score by 12-20 points each time you do it!</li></ul><ul style=\"\"><li>Figure out how to re-build credit after a bankruptcy, or establish credit if you&#039;ve never had it before!</li></ul><ul style=\"\"><li>Discover little-known information on accessing your report from the 4th credit bureau, as well as the other agency that collects widely reported information about you!</li></ul><ul style=\"\"><li>Learn where to get the money to pay off your credit card bills!</li></ul><p>This class offers complete and concise information on raising your score, and avoiding the things that decrease your score. </p><p>Learn to “think&quot; like the credit scoring models and qualify for the most competitive interest rates on houses, cars, and insurance policies. </p><p>Take this class today and be part of that elite club with 800+ credit scores, enjoying greater financial freedom!</p>", 
    "end_date": null, 
    "title": "Raise Your Credit Score to 800 Or More....", 
    "price": "25.00", 
    "instructors": "Angel Love", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497236_d1c3_4.jpg", 
    "course_url": "https://www.udemy.com/raise-your-credit-score-to-800-or-more/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-09T00:45:24Z"
}