{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em>Welcome to private money prep school where you will learn the secrets of successfully raising private money for you business or real estate deal.</p><p>My name is Professor Richard Odessey, and I'll be leading you through the course. I am an entrepreneur that started my own business and successfully raised capital and I am also an investor in businesses and real estate. So, I've been where you are and I've been where your investors are.</p><p>When it came to funding my deals, I had a very expensive education in the school of hard knocks, before I figured out the secrets of raising capital from private investors.</p><p>Over the course of the last few years I've worked on over 100 private money deals. And now, I help business owners in a wide variety of industries from renewable energy to real estate to raise the capital they need. And I know I can help you too.</p><p>I've designed this course specifically for business owners, real estate entrepreneurs, and those wishing to start a business, and need capital to reach their goals.</p><p>At the end of this course you will understand the little known secrets of how private money works, and you will be able to structure your funding by offering private investors what they want, provide the information that will get their attention, and avoid the pitfalls that will turn them away. </p><p>I will walk you through this process step by step. And through the tools and checklists you will be provided in the course, you will be able to create a blueprint for raising private money that is specific to your particular business or project.</p><p>I look forward to seeing you in class and working with you to get the financing you need.</p>", 
    "end_date": null, 
    "title": "Raising Capital for Your Business", 
    "price": "30.00", 
    "instructors": "Richard Odessey", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532216_cfc0_3.jpg", 
    "course_url": "https://www.udemy.com/raising-capital-for-your-business/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T14:51:48Z"
}