{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Rapidly learn the language of business</strong>  </p>  <p style=\"\">  \t<strong style=\"\"> </strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t    ·Enhance your career if you are in business this is a critical skill for you advancement.  \t</p>  \t<p style=\"\">  \t\t    ·Help your clients with their financial goals  \t</p>  </ul>  <ul style=\"\">  \t<p style=\"\">  \t\t    ·Know how your business is performing and what you need to focus on to make more profit, cash and improved returns  \t</p>  \t<p style=\"\">  \t\t    ·Know how to speak to your banker  \t</p>  \t<p style=\"\">  \t\t    ·Know what to look for when you want to invest in a business  \t</p>  </ul>  <p style=\"\">  \t    This is an innovative course.  It contains practical exercises and has a unique business modeling tool embedded within it.  </p>  <p style=\"\">  \t    It is designed for senior managers and professionals, including venture capital managers and others who rely on the financial statements to evaluate and steer businesses.  </p>  <p style=\"\">  \t    Income statement, balance sheet, cash flow, ratios, variables, debt, and equity—for many people these terms are like a foreign language.  </p>  <p style=\"\">  \t    This course eliminates the mystery behind the numbers so that you will be able to read financial statements as well as Warren Buffett.  </p>  <p style=\"\">  \t    You will learn:  </p>  <p style=\"\">  \t    ·How to read and analyze a set of financial reports  </p>  <p style=\"\">  \t    ·How to evaluate the effectiveness of a company’s strategy  </p>  <p style=\"\">  \t    ·How to identify ways to improve a company’s performance  </p>  <p style=\"\">  \t    ·How to be a more powerful communicator by mastering the language of finance.  </p>  <p style=\"\">  \t    Acquiring these skills can be costly and time consuming.  For example Harvard Business School offer a 5-day course (Finance for Senior Executives.) that costs $11,250 and Stanford University has one similar (Finance and Accounting for the Non-Financial Executive) for $10,500.  </p>  <p style=\"\">  \t     If you have over $10,000 and a week to spare these are great courses!  </p>  <p style=\"\">  \t    However, if you want to study on your own time and are looking for a more cost effective solution—and frankly, one that is more fun and more practical, our course is for you.  </p>", 
    "end_date": null, 
    "title": "Read financial statements like a pro", 
    "price": "50.00", 
    "instructors": "Andre Gien, Mick Holly", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429308_508d_2.jpg", 
    "course_url": "https://www.udemy.com/read-financial-statements-in-5-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T20:36:33Z"
}