{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Comience a hacer dinero sin experiencia requerida e inmediatamente!</p>  <p><strong>No hay necesidad de comprar un robot de Forex</strong> - Voy a darle uno a usted GRATIS en este curso para que usted practique en una cuenta Demo.</p>    <p>Observe cómo hago <strong>6.75% de ganancia en 10 días!</strong> EN VIVO, justo en frente de tus ojos! No es mentira  - Voy a estar demostrando todo en una cuenta Forex Real con dinero real.</p>    <p>Usted puede llegar a ganar 175 +% anual con las técnicas que se aprenden a partir de este curso! Deje que los robots de Forex <strong>TRABAJEN PARA USTED!</strong></p>    <p>Cada técnica que revelaré en este curso es fácil de poner práctica en cuestión de minutos - con cualquier robot de Forex.</p>    <p>Este curso le ahorrará tiempo, dinero y esfuerzo. Le daré una guía paso a paso para <strong>conseguir el MÁXIMO rendimiento de su Sistema de Trading Algorítmico.</strong></p>    <p>Nada se mantiene en secreto - <em>le revelaré todo lo que sé</em> ... inclusive consejos y técnicas que he probado, las que tienen éxito se han añadido al curso - sin costo extra para usted! Este es un curso que seguirá creciendo y creciendo.</p>    <p>Haga clic en el botón \"tomar este curso\", arriba a la derecha, ahora! ... <em>cada minuto que usted está esperando, le cuesta dinero</em> ...</p>", 
    "end_date": null, 
    "title": "Robots de Forex: espere ganar 175%p.a! Incluye Robot de Fx! ", 
    "price": "20.00", 
    "instructors": "Kirill Eremenko, Martín Durán - (Kirill's Team)", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667332_f412.jpg", 
    "course_url": "https://www.udemy.com/forex-robots/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-12T00:11:08Z"
}