{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">If you know how to automate Metatrader4, you can turn your PC into a trading force that can automatically trade - exactly according to your trading strategy!</strong></p><p>My netbook can trade 27 currency pairs, seven days a week, 24 hours around the clock, without the need to sleep, eat or go to work.</p><p>It will not harm the trading plan, it will not become bored or tired and it will not make emotional revenge trades.</p><p>Metatrader4 ist a standard platform and most traders already use it.</p><p>MQL4 is part of Metatrader4 and it can help you to create automated trading systems, reproducable trading results and valuable insights<em style=\"\"> <strong style=\"\">in minutes</strong></em><strong style=\"\">!</strong> </p><ul style=\"\"><li>Do you want to know, how to automate trading strategies like Trend, Bollinger Bands, Martingale?</li><li>Would you like to automatically trade up to 50 positions on a single chart to speed things up?</li><li>Would you like to find the golden key to profitable, automated trading by asking and answering the right questions?</li></ul><p>In 60 minutes from now, you will be glad, that you have invested the time, effort and money to take this course - or you will hate it!</p><p><strong style=\"\">Here is why:</strong></p><ol style=\"\"><li>I know people that give advise on the MQL4 forums for over 8 years, but they do not produce results. This bootcamp series is about results, not beautiful coding style.</li><li>I have taken out all the fluff, because it is a bootcamp. Bootcamps will help you to save time - but they are demanding.</li><li>You will be able to reproduce and proof the results of the examples in this bootcamp. But YOU will need to do it. You need to invest the time, the effort and the money it takes to succeed!</li></ol><p>If this is something for you, you will have your first automated system up an running in 60 minutes from now. You can either learn how to automate your own system, or you will have to settle for the next “trading robot wonder&quot; and hope for the best.</p><em style=\"\"><strong style=\"\">So what are you going to do now?</strong></em>", 
    "end_date": null, 
    "title": "SEASON 2 MQL4 Tutorial Bootcamp - Metatrader4 Trading Robots", 
    "price": "25.00", 
    "instructors": "Raimund Bauer", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551910_2a1c_2.jpg", 
    "course_url": "https://www.udemy.com/mql4-tutorial-bootcamp-metatrader4-trading-robots-expert-advisors-mt4/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-11T17:03:05Z"
}