{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn everything you need to know to start <strong>Trading in the Stock Market today! </strong></p>\n\n<p>Whether you are trading stocks, forex, commodities, options, ETFs... <strong>this course will give you the competitive edge you need to increase your trading success!</strong><br></p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------<br></p>\n\n\n\n\n\n<p>Secrets of Trading Revealed: How to Trade with Smart Money <strong>offers an in-depth view of consolidation and breakout patterns including:</strong></p>\n\n\n\n\n\n<ol><li>Rectangles (or Platforms)</li><li>Flags (Bull and Bear)</li><li>Pennants (Bull and Bear)</li><li>Triangles (Descending, Ascending and Symmetrical)</li><li>Wedges (Falling and Rising)</li></ol>\n\n\n\n\n\n<p>You will learn who is in control of price based on those <strong>consolidation and breakout patterns </strong>appearing on the chart, <strong>how consolidation areas are formed and how to position yourself</strong> before price breaks out of the consolidation and makes a big move.</p>\n\n\n\n\n\n<p>You will also learn <strong>how breakouts occur</strong>, the <strong>difference between true breakouts and false breakouts</strong>, how to <strong>use price action, volume activity and different time frames</strong> to confirm the breakout, and how to trade them correctly.</p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------This course is <strong>designed to teach you the inner mechanisms of smart money and high frequency trading</strong> and how to effectively trade on their side, using accurate and profitable technical analysis.</p>\n\n\n\n\n\n<p>This course will teach you <strong>how smart money and the other major players operate</strong> in the market and the important role smart money, dark pools and high frequency trading play in today's market.</p>\n\n\n\n\n\n<p>You will learn <strong>how to determine the dominating market direction</strong>, what the four market cycles are and how price action is reflected into predictable market waves, how to identify areas of support and resistance and understanding why those areas are there in the first place.</p>\n\n\n\n\n\n<p>---------------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>This course will give you <strong>major insights on how the stock market works and how to deal with today's unique market conditions.</strong></p>\n\n\n\n\n\n<p>New lectures will be added to the course constantly - <strong>at no extra cost to you!</strong> This is a course that will continue to grow. </p>\n\n\n\n\n\n<p>Take this course now and learn from my 5+ years of experience. Avoid the most common pitfalls that catch 90% of traders! </p>\n\n\n\n\n\n<p>Too often beginner traders enter the market without the necessary knowledge and practice needed. As a result they take excessive, expensive and unnecessary risks hoping for higher returns. This course will teach you a very effective way to trade in the market successfully and with confidence.<br></p>\n\n\n\n\n\n<p>This course is for all levels: beginners, intermediate and advanced traders! All you need is an open mind and a passion to be successful!</p>\n\n\n\n\n\n<p><strong>Enroll in this course now and start trading the market successfully!</strong></p>\n\n\n\n\n\n<p><em>---------------------------------------------------------------------------------------------------------------------------</em><br></p>\n\n\n\n\n\n<p><em>All our Sharper Trades courses come with:</em></p>\n\n\n\n\n\n<ul><li><strong>30 day money-back-in-full guarantee</strong></li><li>Unlimited lifetime access at <strong>no extra costs</strong></li><li>All future additional lectures, bonuses, etc in this course are <strong>always free</strong></li><li>Our Sharper Trades team is <strong>a</strong><strong>lways available to answer any question</strong> you might have regarding this course. Answers are given in less than 24 hours!</li><li><strong>Your trading success is our goal!</strong></li></ul>\n\n\n\n\n\n<p><em>---------------------------------------------------------------------------------------------------------------------------</em><br></p>\n\n\n\n\n\n<p>Over 15000 students have already joined Sharper Trades courses. Join a large community of successful traders.</p>\n\n\n\n\n\n<p><strong><em>Click \"Take This Course\" and Start Trading Successfully TODAY!</em></strong></p>\n\n\n\n\n\n<p><strong></strong></p>", 
    "end_date": null, 
    "title": "Secrets of Trading Revealed: Learn to Trade with SmartMoney", 
    "price": "20.00", 
    "instructors": "Luca Moschini", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507486_d4b9_6.jpg", 
    "course_url": "https://www.udemy.com/secrets-of-stock-market-trading-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T20:06:01Z"
}