{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>IN THIS COURSE I WILL SHOW YOU EXACTLY HOW TO:</strong></p><p><strong><br></strong></p><ol><li><em>Create an account and start writing for Seeking Alpha</em></li><li><em>Successfully write about and analyze stocks</em></li><li><em>Guarantee your articles get accepted by the moderators, get published, and sent out as an alert to thousands of readers</em></li><li><em>Make the maximum amount of money for your articles on the website</em></li></ol><p>Over the past several months I have developed a system to <strong>easily make over $1,000</strong> a month on the <strong>Seeking Alpha website</strong> buy testing various strategies and seeing what does and doesn't work on the site. As you can see in the promo video I give you proof of my earnings and throughout the course I will literally <strong>write an article in front of you</strong> and submit it to the website.</p><p>Not only do I show you how I write the article, but I also show you how to choose a company, analyze the stock, <strong>guarantee that your articles get accepted by the site's editors</strong>, and many more tips and tricks to guarantee you succeed.</p><p>This is not a course that promises something that cannot be done by everyone nor has not been done by the teacher. I record the screen and show you step by step <strong>EXACTLY</strong> how I write articles, get them submitted and accepted by the website, and <strong>make money. </strong></p><p><strong>If you follow what I say in the course</strong>, you can be earning up to$100 per hour within days and have your first <strong>online income stream </strong>paying you while you sleep. I hope you make the decision to join the course and learn how to <strong>make over $1,000 a month writing about stocks online.</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Seeking Alpha: How to Write About Stocks Online", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688244_9813_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-make-over-1000-a-month-writing-about-stocks-online/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T20:04:46Z"
}