{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Have You Ever Watched A Market Or Stock Come Tumbling Down For &#039;No Reason&#039; At All?</p><p style=\"\">Have You Ever Wished You Could Sell At The Top...<strong style=\"\"></strong>Before The Market Turns Into A Ski-Slope, Dragging All Of Your Profits Down With It?</p><p style=\"\">Welcome To <strong style=\"\">SHORT SELLING - LEARN TO SELL BEFORE THE FALL.</strong></p><p style=\"\">How To Become A Professional Short-Seller Trading Stocks, Forex Or Commodities.</p><p style=\"\">Here Is What You Get With <strong style=\"\">SHORT SELLING:</strong></p><ul style=\"\"><li style=\"\">15 Lectures + 2 Screencasts Packed With 100% &#039;How-To&#039; Tactics And Strategy</li><li style=\"\">A Definitive Step-By-Step Blueprint For Effective Selling And Short-Selling</li><li style=\"\">A Method For Incorporating Short-Selling Into <em style=\"\">ANY</em> Long Trading Strategy</li><li style=\"\">Knowledge Of Timeless Market Mechanics To Improve Your <strong style=\"\"></strong>SELL<strong style=\"\"></strong> Decisions</li><li style=\"\">Advanced Risk Control And Trade Management Skills To Take Your Trading Game To The Next Level</li></ul><p style=\"\">Plus a <strong style=\"\">PERFORMANCE GUARANTEE:</strong> You will acquire a trading skill which will enable you to locate low-risk, high-probability Short trades in any market that can be charted.</p><p style=\"\"><strong style=\"\">SHORT SELLING</strong> is brought to you by a top UDEMY Instructor and Stock Trading NINJA.</p><p style=\"\">Said instructor promptly responds to ALL email questions and forum posts.</p><p style=\"\">Even if you <em style=\"\">NEVER</em> Sell Short, your trading education is <strong style=\"\"></strong>NOT complete unless you know how to effectively SELL.</p><p style=\"\">You are about to discover the one crucial market truth that every insider knows. You will learn:</p><ul style=\"\"><li style=\"\">How to picks &#039;tops&#039; with alarming accuracy</li><li style=\"\">Why it is better and EASIER to short markets in confirmed up trends</li><li style=\"\">How to put volatility in your favor</li><li style=\"\">The primary catalyst of immediate, sharp sell-offs and how to harness it for profit</li></ul><p style=\"\">Say goodbye to bear markets and corrections once and for all.</p><p style=\"\">Never again live in fear of the next market melt-down.</p><p style=\"\">Once you understand the true nature of market behavior, you can stay ahead of the curve in just a few minutes a week.</p><p style=\"\"><strong style=\"\">SHORT SELLING</strong> will teach you:</p><ul style=\"\"><li style=\"\">How to know when to sell and when to SHORT</li><li style=\"\">Short-selling market mechanics to improve long trading</li><li style=\"\">Why follow-through is everything and how to master it</li></ul><p style=\"\">This course will introduce you to a whole new world of opportunity.</p><p style=\"\">This strategy is effective in <em style=\"\">ANY</em> market - Stocks, Forex, Commodities or any liquid &#039;chartable&#039; security and time interval.</p><p style=\"\">I designed this course for the experienced Stock, Option and Forex trader who understands basic market mechanics and technical fundamentals, and the experienced investor in search of a proven market-timing model to maximize long-term investment models.</p><p style=\"\">The honest truth is that &#039;public&#039; market participants do not understand market mechanics.</p><p style=\"\">The retail investor or trader will never see the sell-off coming and will always wonder why prices rolled over like a ski-slope because they do not understand the true nature of price behavior.</p><p style=\"\">After the selling begins in earnest it is usually too late to get out.</p><p style=\"\">In <strong style=\"\">SHORT SELLING</strong> you will discover:</p><ul style=\"\"><li style=\"\">How to maximize your effort with the LONG-SHORT TREND FLOW</li><li style=\"\">Why the cost of ignorance (not knowing how to sell) is just too high</li><li style=\"\">The trailing stop fallacy and why you must know how to sell</li></ul><p style=\"\">If you know how to sell, why not sell short?</p><p style=\"\"><strong style=\"\">SHORT SELLING</strong> takes you one step further and details how to set up your trading desk with all the tools you need to simplify your strategies and dramatically improve your returns with less effort:</p><ul style=\"\"><li style=\"\">Configuring chart layouts for maximum efficiency</li><li style=\"\">How to quickly and easily incorporate a short quantitative analysis model</li><li style=\"\">How to scan, analyze and manage your trades from one simple, smart layout</li></ul><p style=\"\">When you finish the last lecture, you will be on your way to mastering short-selling as a long-term trading strategy.</p><p style=\"\">And you will know if the market is setting up to continue the rally, or setting up to FALL.</p><p style=\"\"><strong style=\"\">SHORT SELLING</strong> comes with a 30-DAY MONEY BACK GUARANTEE. </p><p style=\"\">If you are a trader struggling to make consistent profits or an investor frustrated by poor returns with no way to manage risk, then <strong style=\"\">SHORT SELLING</strong> is a must-have.</p><p style=\"\">Why try to learn how to trade on your own? </p><p style=\"\">Get a comprehensive system and trade plan you can use IMMEDIATELY to profit.</p><p style=\"\">Let a 20-year veteran of the trading game guide you step-by-step through the process.</p><p style=\"\">Enroll NOW in <strong style=\"\">SHORT SELLING</strong>. <strong style=\"\">And learn to sell BEFORE the fall.</strong></p><p style=\"\">Course includes:</p><ul style=\"\"><li style=\"\">Lifetime Access To Course</li><li style=\"\">Video Module Training Center</li><li style=\"\">30-Day Money Back Guarantee</li></ul>", 
    "end_date": null, 
    "title": "Short Selling - Learn To Sell Before The Fall", 
    "price": "20.00", 
    "instructors": "Frank Bunn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504036_f282_2.jpg", 
    "course_url": "https://www.udemy.com/short-selling-learn-to-sell-before-the-fall/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-16T21:36:52Z"
}