{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t <strong style=\"\">Why we wanted to teach the course</strong>  </p>  <p>  \t     Like many of you looking at this course, we’re also small business owners. We’ve gone through the same challenges of running a business that you’ve been through and that includes maintaining our own financial records. We’ve done the the paper-based and electronic methods of bookkeeping and once we discovered the cloud-based way of doing things, we found that it made our lives much easier. It’s our intent to share this knowledge with you so that you needn’t worry as much about the numbers side of your business and so you can simply focus on what you do best.  </p>  <p>  \t <strong style=\"\">What you’ll get from this course</strong>  </p>  <p>  \t     If you’d like to do a better job of managing the financial side of your business, then you’ve come to the right place. Not only will you learn how to use - and be comfortable with - accounting software you’ll also learn basic accounting terminology and various fundamentals to set up, manage and better understand  the numbers (and results) generated by your business.  </p>  <p>  \t    This course is made up of two parts  </p>  <ul style=\"\">  \t<li>Chapter 1 through 4 will cover the basics of starting up a small business.</li>  \t<li>Chapter 5 through 14 will cover the basics of bookkeeping, accounting, and using accounting software.</li>  </ul>  <p>  \t <strong style=\"\">How to use this course</strong>  </p>  <p>  \t Not every small business is alike and that people are at different learning stages in their business. We know you’re busy enough as it is so we’ve written the course in modules.  </p>  <p>  \t This means that we’ve designed the course so that you can read only sections that are relevant to you. For example, you may already understand small business accounting terminology. That’s great, so feel free to skip that section and go straight to the one that applies to your specific requirement.  </p>  <p>  \t Because the course is modular and we can’t assume you’ve read a certain section where we’ve introduced a concept, we’re going to assume you have a certain level of knowledge. This is especially so with bookkeeping or accounting terms and concepts. In case you need some help (or just a refresher) check out Section 6, which is the Small Business Financial Terminology section.  </p>", 
    "end_date": null, 
    "title": "Small Biz Doers' Guide to Small Biz Accounting + Bookkeeping", 
    "price": "20.00", 
    "instructors": "Greg Lam, George Verdolaga", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83736_739d_11.jpg", 
    "course_url": "https://www.udemy.com/an-entrepreneurs-guide-to-small-biz-bookkeeping/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-25T23:48:09Z"
}