{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                  The Money Map methodology is not about accounting it is about how your business behaves, the way it makes money and creates wealth.  </p>  <p style=\"\">  \t              If you are in business and you know there is a better way, you are at the right place.  </p>  <p style=\"\">  \t          You are most probable very familiar with the addage that at least 20 percent of your time must be spent working on your buiness as apposed to working in it. But exactly what does that mean? The Money Map is a powerful methodology to work on your business.  </p>  <p style=\"\">  \t                  During this course you will gain insight into your business in a way you have never dreamed possible. Your business has a story and the way that you can tell your story empowers what you do and how you make those good decisions that create fundamental improvements in your financial performance.  </p>  <p style=\"\">  \t                  The secret lies in the only business scorecard. Yes it’s your financial statements. These statements record every transaction in your business. These transactions are based on decisions made either consciously or unconsciously. The way you use your financial statements thus becomes a foundation of the effectiveness of your actions and strategies.  </p>  <p style=\"\">  \t                  Using your financial statements to identify those constrains and dysfunctions provides you with a powerful catalyst to know what should be focused on and why, enabling you to release significant profit and cash improvement. Isn’t that what you are in business for in the first place?  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">Who would greatly benefit from this course?</u></strong>  </p>  <ul style=\"\">  \t<li style=\"\">If you are a business owner who wants to get more from your business.</li>  \t<li style=\"\">If you are a manager of a business or a branch of a business and you want to further your career and performance</li>  \t<li style=\"\">If you are thinking about going into business this is a must do</li>  \t<li style=\"\">If you are an adviser or consultant to business. The Money Map methodology is a powerful way to engage your client delivering powerful insight and actionable strategy.</li>  \t<li style=\"\">If you are in business and simply want to be a more productive contributor.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">What will be covered in this course?</u></strong>  </p>  <p style=\"\">  \t                  By way of a working example we will  </p>  <ul style=\"\">  \t<li style=\"\">Convert a standard set of financials into our Money Map</li>  \t<li style=\"\">Deliver the core building blocks of the money map</li>  \t<li style=\"\">Explain the money map oath</li>  \t<li style=\"\">Reflect on the characters that reside in your finals statements and how they need to work together to deliver superior financial performance</li>  \t<li style=\"\">Deliver unique ways of gaining insight that will impress others with your knowledge</li>  \t<li style=\"\">Populate your Money Map step by step</li>  \t<li style=\"\">Deliver the 3 disciplines that create clarity of action and focus</li>  \t<li style=\"\">Provide you with the understanding of where risk and reward reside in your business</li>  \t<li style=\"\">Enable you to tell your business story in a way that you never dreamed possible</li>  \t<li style=\"\">Provide you with a road map to ensure that to make the right decision to make more profit and more cash.</li>  </ul>  <p style=\"\">  \t            How long will this course take you to complete  </p>  <p style=\"\">  \t            The course content will take you about an hour to complete. We have broken it down into short videos with the longets time frame of about 15 minutes. We must emphasie that once the course is completed we ask you to perform you Money Map on you buiness at least each quarter this process will take you a further hour or so to complete. It may be the most productive time that you spend working on you business.  </p>  <p style=\"\">  \t                  At the end of this course and with a bit of practice on your own financials you will become a <strong style=\"\">financial results master</strong>  </p>  <p style=\"\">  \t                  Join us on a journey the Money Map will show you the way to better business performance strong cash flows and sustainable growth.  </p>  <p style=\"\">  \t                  Driving a productive business  </p>  <p style=\"\">  \t                  Regards Mick Holly and Andre Gien  </p>", 
    "end_date": null, 
    "title": "Small Business Owners: Drive a Productive Business and Grow", 
    "price": "20.00", 
    "instructors": "Andre Gien, Mick Holly", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399170_1664_4.jpg", 
    "course_url": "https://www.udemy.com/small-business-owners-drive-a-productive-business-and-grow/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T17:46:19Z"
}