{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>This course will help you understand the core principles that\nneed to be applied for becoming an investor in securities.</strong></p><p>Investing as you know it is one of the ways in which you can\n<em><strong>generate passive income</strong></em> through careful scrutiny, selection and monitoring. In\nfact, if you take this course, you will realize that, <strong><em>whether markets go up or\ndown, there’s money to be made.</em></strong></p><p>The trick is to allocate funds, invest, stay invested, earn\ninterest, dividends and capital appreciation, all for other people’s hard work!</p><p><strong>This is a results oriented course</strong>, where <strong>in under an hour you\ncan go from a person with little understanding of investing to someone who\nknows the fundamentals</strong>, and can use it to his advantage. <strong>These skills can be\napplied to making your investments at the earliest.</strong></p><p>If you're <strong>interested in learning about the different asset\nclasses you can invest in and which one would work well for you, this course\nwill help you get started and running fast.</strong></p><p>The course is <strong>self-paced</strong>, and is <strong>structured in a manner that the\ncore principles are delivered using engaging presentations</strong>, that <strong>use visual\naids</strong> where appropriate to get the information across effectively.</p><p>Also in this course, I explain <strong>tactics for investing, things\nnormally used by pros such as financial advisors and fund managers.</strong> You can aim\nto become your own financial advisor, as I introduce you to the concepts of\nPortfolio management and risk diversification.</p><p>Although the course at the time of initial release is under 1\nhour in length, newer videos will be added on a regular basis.</p><p><strong>The objective of this course is to help the beginner lose the newbie investor status in under an </strong><strong>hour!!</strong> <strong>You will begin to talk in financial terms fast!</strong> </p><p>Also, by applying the principles, you will be in a position to make profits earned passively! Need any more convincing?</p>", 
    "end_date": null, 
    "title": "Smart Investing Series: Investing Principles for Beginners", 
    "price": 0, 
    "instructors": "Divesh Nair", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726360_bd0e_2.jpg", 
    "course_url": "https://www.udemy.com/investing-principles-for-beginners/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T02:29:35Z"
}