{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is about one of the basics of investing, namely analyzing annual reports that are seemingly complex documents to help beginners to have an opinion on the investing potential of a company. It is an attempt to assist people to gain or improve upon their knowledge on investing, as understanding annual reports is one of the fundamental requirements of investing.</p><p>The terminology that you would expect to use to find the course includes investing and financial analysis. However, there are no prerequisites in terms of knowledge of investing terminology to take this course. Everything that is needed is explained within the course to allow an individual to be able to learn at ease.</p><p>The materials included in this course are walkthroughs of annual returns of major global companies, presentations to help explain concepts in a lucid and simple manner. The videos are either screencasts or Keynote decks with voiceovers to help explain and investigate theories. The logical sequence is easy to follow for someone with little experience with finance or investing.</p><p>This course can be completed over 2 hours of learning; this preferably would be through multiple sittings, and not just one non-stop session, as that would be information overload! It is completely self-paced, you don&#039;t need to use pen and paper, just watch the videos, and post your questions and opinions. Student opinion is highly valued, and requests may lead to newer videos that take a deep dive into particularly difficult concepts.</p><p>The course is structured in a manner that will help someone new to investing to methodically go over the concepts, see illustrations, and apply the knowledge gained by taking quizzes, followed by a summary of the understanding.</p><p>The reason to take this course, is to be knowledgeable about the basics of investing, applying the knowledge gained from this course in real life investing and earning profits from investing.</p>", 
    "end_date": null, 
    "title": "Smart Investing Series: How to easily read Annual Reports", 
    "price": "20.00", 
    "instructors": "Divesh Nair", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/441730_e7fe_7.jpg", 
    "course_url": "https://www.udemy.com/investing-basics-annual-reports/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T05:41:09Z"
}