{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>(Curso atualizado em 04/02/2016)</p><p>Nesse curso nós vamos criar juntos uma estrutura de controle financeiro para o seu negócio usando o ZeroPaper da Intuit. Ele foi elaborando pensando em autônomos, profissionais liberais e microempresários, que geralmente exercem várias funções ao mesmo tempo e portanto dispõem de pouco tempo.</p><p><strong>Tenha Imediatamente a Resposta para Perguntas como:</strong></p><ul><li>\"Onde foi parar o dinheiro que eu recebi?\"</li><li>\"Quanto ainda preciso faturar para pagar todas as contas esse mes?\"</li><li>\"Qual foi o meu resultado no mês passado?\"</li><li>\"Quanto estou devendo e quanto tenho para receber de clientes?\"</li></ul><p>Seguindo o passo-a-passo do curso e após a inserção dos dados do seu negócio, vamos aprender como ter a resposta para essas e outras perguntas com apenas alguns clicks. </p><p><strong>Porque Controle Financeiro é Essencial</strong></p><p>Especialmente em tempos de desafios econômicos como o que estamos passando, ter uma visão precisa e realista das finanças pode fazer a diferença entre a sua empresa acabar endividada e ter que fechar as portas ou crescer e prosperar. Crises são tempos de oportunidades para ajustarmos custos e otimizarmos processos, mas se não conhecemos os números envolvidos, não saberemos no que mexer. Nesse curso criaremos um sistema que colocará os números necessários nas suas mãos.</p><p><strong>O Que Aprenderemos Juntos</strong></p><p>Nós começaremos com um tutorial de boas práticas de controle financeiro, daí passaremos para a configuração do ZeroPaper para o seu negócio e alimentação dos dados, e terminaremos mostrando como analisar os resultados que o sistema oferece.</p><p><strong>Porque o ZeroPaper?</strong></p><p>Escolhemos o ZeroPaper porque é hoje o melhor aplicativo financeiro para esse público no mercado brasileiro. É simples e intuitivo, e fornece informações poderosas para a avaliação do seu negócio e para fundamentar a tomada de decisões.</p><p><strong>Porque Começar Imediatamente?</strong></p><p>Você já fez as contas de quanto dinheiro já perdeu com juros, multas e taxas bancárias por pagar contas atrasado? Ou por não receber de clientes na data certa porque esqueceu de ligar lembrando? Ou pior ainda, tomou decisões sem ter o devido embasamento das suas finanças, e se arrependeu depois? Para mudar esse quadro, voce precisa de um <strong>SISTEMA de Controle</strong>. É isso que estamos oferecendo através desse curso.</p><p>Cada dia que você postergar a decisão de começar a controlar as suas finanças é um dia a mais de prejuízos desnecessários. <em>Interrompa esse ciclo tomando uma decisão agora</em>, estamos esperando por você! Todos os alunos matriculados têm 30 DIAS DE GARANTIA. Caso não fique satisfeito com o curso, tem o seu dinheiro de volta imediatamente, sem ter que dar explicações. </p><p>Um grande abraço.</p>", 
    "end_date": null, 
    "title": "Socorro! Preciso Organizar as Minhas Finanças!", 
    "price": "20.00", 
    "instructors": "Marcos Barros", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709816_58ea_2.jpg", 
    "course_url": "https://www.udemy.com/socorro-preciso-organizar-as-minhas-financas/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T16:43:12Z"
}