{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will give you the tools and concepts you need to estimate your startup value and understand all the assumptions that form part of your valuation.</p>\n\n<p>For every startup, the valuation process helps you translate your strategy and vision into realistic financial plans, so that you can choose the most valuable strategic options, understand your funding needs in advance and sell you company's strengths effectively to potential investors. This helps increase investors' trust in your strategy. </p>\n\n<p>For any complicated concept I will be available to answer your questions, so please use this feature after completing ALL lessons, if you feel that any of the concepts are difficult to apply. Please note that an excel template cannot be provided, but if you have basic excel modelling skills and some motivation, it will be possible to build your own valuation.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I will start by explaining why it is important for you to understand your company‘s value and how valuations are established in negotiations. The first section will be an introduction to the startup valuation market, so if you’re already familiar with it you can skip to the more technical sections of this course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I will explain the concept of value, related to what you have built so far, how the value of your startup changes in different situations and how to build your own discounted cash flows in multiple steps. Afterwards I will give you some tools to estimate the value of your company with different methods used by investors, including VCs. At the end we will go through my recommended valuation process, with practical examples of all the theories I talked about.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I will teach you some techniques that are mostly relevant to typical seed and early-stage startup valuations.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>The course is about 1 hour long and divided in seven sections.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This valuation course is meant for founders of startup companies with a simple capital structure, who are looking for funding and would like to estimate their value for negotiation purposes. Some concepts are simple and some are more advanced, to provide a complete overview of all methods available to you, but they can be understood by founders with no financial background as well. This can also be useful for new investors in startups who can use the same methods for negotiations.</p>\n\n\n\n\n\n\n\n\n\n<p>This course is best viewed with Google Chrome.</p>", 
    "end_date": null, 
    "title": "Startup Valuation", 
    "price": "20.00", 
    "instructors": "Valithea Advisory", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724196_991a_3.jpg", 
    "course_url": "https://www.udemy.com/startup-valuation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T15:51:32Z"
}