{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Last updated: <em>November</em><em> 17, 2015.</em></strong><strong><em></em></strong></p><p><strong>THIS COURSE IS WITH...</strong></p><ul><li><strong><em>lifetime access</em></strong></li><li><strong><em>30-day money back guarantee!</em></strong></li><li><strong><em>availability on iOS and Android</em></strong></li><li><strong><em>certificate of Completion </em></strong></li></ul><p>\t<strong><em>&gt; Are you going to start the first course in finance?</em></strong>  </p>  <p>\t<strong><em>&gt; Do you have issues in understanding the concept of time value of money and cash flow valuation?</em></strong>  </p>  <p>\t<strong><em>&gt; Are you a </em></strong><strong><em>(personal/business) </em></strong><strong><em>financial decision maker who need a solid understanding of finance?</em></strong>  </p>  <p>\t<strong><em>&gt; Do you solve finance exercises/problems STEP BY STEP but do not really know why the STEPS are like that?</em></strong>  </p>  <p>\t<strong><em>&gt; Do you want to begin learning finance?</em></strong>  </p>  <p>\t If your answer is 'YES' to any one of the above questions, <strong>THIS COURSE IS THE PERFECT ONE FOR YOU TO START WITH...</strong>  </p>    <p>\t<strong><em>Time value of money:</em></strong>  </p>  <ul>\t<li>Why is the timing of cash flow important?</li>  </ul>  <p>\t<strong><em> Interest rate: </em></strong>  </p>  <ul>\t<li>What is the interest?</li>\t<li>How are the simple interest and compound interest different?</li>  </ul>  <p>\t<strong><em> Future value and present value: </em></strong>  </p>  <ul>\t<li>How to calculate the future value of a single cash flow?</li>\t<li>How to calculate the future value of multiple cash flows?</li>\t<li>How to calculate the present value of a single cash flow?</li>\t<li>How to calculate the present value of multiple cash flows?</li>  </ul>    <p>\t<strong>If you are looking for the answers to these questions, you have chosen the right course. </strong>  </p>  <p>\t Almost everyone has to make financial decisions. Even if one is not a business manager or portfolio manager, s/he must make financial decisions appropriately for his/her personal financial well-being, which necessitates achieving financial literacy. The instructor recognizes the importance of financial literacy for all. <strong>This course is also suitable for absolute beginners who have never attended a finance course before</strong>, wants to start achieving the financial literacy at a basic level, and may continue learning finance at advanced level in future.</p>  <p>\t Most of the personal and business level financial decision making involve the valuation of present and future cash flows. This course covers the essential concepts for understanding such valuation.</p>  <p>\t This course consists of several video lectures that will be updated over time and based on students' requests, quizzes at the end of every section for testing your level of understanding, and additional resources. The lectures contain explanations of necessary concepts along with examples and illustrations. Some of the lectures will be prepared for demonstrating the MS Excel applications of the concepts covered in this course.</p>  <p>\t The instructor welcomes his students for continuous discussion with him. Any sort of input for improving the course is also appreciated. He also expects your positive and genuine review and rating of the course.</p>", 
    "end_date": null, 
    "title": "Start Your Journey In Developing Financial Literacy", 
    "price": 0, 
    "instructors": "Md Mohan Uddin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337320_6ead_6.jpg", 
    "course_url": "https://www.udemy.com/financial-literacy-basics/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T08:20:13Z"
}