{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Hi friends, welcome to this course on guide to do a step by step Discounted Cash Flow valuation for a company. </p><p><strong>What is the course about?</strong><br></p><p>This course will give you a conceptual and practical illustration of a cash flow based approach to valuation of a company. You will learn a detailed step by step process to carry out a valuation exercise of a company for which you have been given forecasted financials for next 5 years in future. </p><p><strong>Who should take this course?</strong><br></p><p>This course is meant for all sorts of business and financial analysts who are required to do a valuation of companies for investment purposes. The course is a good one for early tenured analysts who want to learn about the technique in a practical illustration as well for tenured professionals who want to refresh the understanding of how DCF valuation approach works.</p><p><strong>What do you need to know before signing up?</strong><br></p><p>As you can understand that this is a specialized topic for which there needs to some understanding of the financial statements of a company especially income statement and balance sheet. What will also help if the students are already investing in stock markets or want to know what drives the price of  a company trading in stock market.</p><p><strong>Why take this course from us?</strong><br></p><p>We are sure there are many such courses out there, however we feel that this course is different from others-</p><p>1) It gives us a detailed understanding of what is the discounted cash flow valuation technique from a conceptual point of view.</p><p>2) You get a step by step guide on doing a Discounted cash flow for any company. There is a standardized template that can help you to apply in your real life situations.</p><p>3) We have decades of experience in doing this for our large clients on a daily basis. So you benefit a lot from our valuable experience and it will show in the quality of the content that you will have access to.</p><p>4) We will be with you even after the course. Our expert faculty team is available to you 24x7 to help you solve any queries you may have around DCF valuation.</p>", 
    "end_date": null, 
    "title": "Step-by-step guide to do a Discounted Cash Flow Valuation", 
    "price": "20.00", 
    "instructors": "Skillfin Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777932_09fe_3.jpg", 
    "course_url": "https://www.udemy.com/guide-to-do-a-step-by-step-discounted-cash-flow-valuation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T16:43:29Z"
}