{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Discover how to use the best options trading broker, Interactive Brokers, to decrease your options commissions and make better trades.</p><p>Interactive Brokers Group, Inc. was founded by its Chairman and CEO Thomas Peterffy. Over the last 38 years, it has grown internally to become one of the premier securities firms with <strong>over $5 billion in equity capital.</strong></p><p>Interactive Brokers conducts its broker trading businesses in <strong>over 100 markets</strong> worldwide. In its broker dealer agency business, IB gives online trade execution and clearing services to institutional and professional traders for a large number of electronically traded financial instruments including stocks, options and more worldwide. </p><p>Interactive Brokers Group manage <strong>nearly 1,000,000 trades daily.</strong></p><p>IB trading platforms have been designed with the professional trader in mind:</p><ul><li>Optimize your trading speed and efficiency with our market maker-designed Trader Workstation (TWS).</li><li>Trade your IB account on-the-go from just about any mobile device with mobileTWS.</li><li>Use our HTML-based WebTrader, a clean and simple interface that works from behind a firewall</li></ul><p><strong>Generate Higher Returns</strong></p><p>Lower commissions, no ticket charges; no minimums; and no technology, software, platform, or reporting fees. Low financing rates, and higher loan values on portfolio margin accounts over $100K.</p><p><strong>Best Price Execution</strong></p><p>Most brokers trade against your orders or sell them to others to execute who will trade against them. The resulting poor execution probably costs you more than the commission you pay. IB SmartRoutingSM continuously searches and reroutes to the best available prices for stocks, options and combinations.</p><p><strong>Frequent Trader's Monthly Costs</strong></p><p>Barron's estimated a customer's monthly costs at each of the 18 brokers in this year's \"Best Online Broker\" ranking. Interactive Brokers was the best deal for both the occasional and frequent trader.</p><p><strong>Average (18 brokers): $2,122 </strong><strong>Interactive Brokers: only $839</strong></p><p><strong>Interactive Brokers </strong>has<strong> </strong>been building trading technology that provides competitive pricing, speed, size, diversity of global products and advanced trading tools to their clients for 38 years.</p><strong>Comprehensive Reporting</strong><strong></strong><p>IB statements and reports include real-time trade confirmations, margin details, transaction cost analysis, sophisticated portfolio analysis, tax optimization and a variety of other supplemental reports.</p>", 
    "end_date": null, 
    "title": "Stock Options Trades Using Interactive Brokers", 
    "price": "25.00", 
    "instructors": "Steven Wright, Scott Paton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476256_2872_2.jpg", 
    "course_url": "https://www.udemy.com/stock-options-trades-using-interactive-brokers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T18:10:21Z"
}