{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t           Has this ever happened to you?  You buy a stock option and wait for it to go up <strong style=\"\">only to watch it go down and your investment with it</strong>.  Did you try again only to watch this scene repeat itself.  </p>  <p style=\"\">  \t           Let&#039;s face it, trying to make a profit by selling stock options is a <strong style=\"\">tough business to be in</strong>.  </p>  <p style=\"\">  \t          In fact, 80% of stock options expire worthless.  Did you see that? <strong style=\"\">80%!!!</strong> That virtually means that 80% of any stock option you buy will go down.  </p>  <p style=\"\">  \t          Why would anyone take those odds?  </p>  <p style=\"\">  \t            There must be a better way right?  </p>  <p style=\"\">  \t           Absolutely! In <em style=\"\">How To Make A Steady Monthly Income Selling Stock Options, </em>you&#039;ll discover what the pros know about making money with stock options.  </p>  <p style=\"\">  \t          Here&#039;s just a few of the profit making tips you&#039;ll learn:  </p>  <ul style=\"\">  \t<li style=\"\">Find out about the secret world of stock option selling</li>  \t<li style=\"\">Learn how to immediately deposit money into your account when you sell an option</li>  \t<li style=\"\">Generate profits even when the trade doesn&#039;t go right</li>  </ul>  <p style=\"\">  \t    Instead of buying options, Pros sell them.  And they only do it on iron clad stocks that are stable.  </p>  <p style=\"\">  \t    No one wants their investment getting wiped out because a company all of the sudden filed for bankruptcy.  Or had its stock slashed in half because of terrible earnings.  </p>  <p style=\"\">  \t          This means you&#039;ll see how to qualify stock picks so your options can bring in a steady stream of monthly income.  </p>  <p style=\"\">  \t          Isn&#039;t it time you started making a steady monthly income on the side without all of the ups and downs of riskier ventures?  Do you want to build a foundation for growth?  </p>  <p style=\"\">  \t          How much you grow is up to you.  This course will give you the tools and knowledge you need to do it. How far you you go is totally up to you.  </p>  <p style=\"\">  \t          There&#039;s no better time than the present.  Jump in today and find out what few know about making a <strong style=\"\">Steady Monthly Income Selling Stock Options!</strong>  </p>", 
    "end_date": null, 
    "title": "Stock Option Trading: How To Make A Steady Monthly Income", 
    "price": "50.00", 
    "instructors": "Brett Romero", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412856_3c15_2.jpg", 
    "course_url": "https://www.udemy.com/make-a-steady-monthly-income-selling-stock-options/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T03:07:18Z"
}