{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><u><strong>Looking to </strong><em><strong>become a financially independent professional trader?</strong></em></u><br><span></span></p><p>Whether you are a novice starting out, or you are experienced in the markets, Trading With an Edge provides you with the Fundamental tools and training you need for kick starting your career as a professional trader</p><p>You will discover how to <strong>read, interpret and decode fear and greed in any market</strong> using only Technical Analysis.</p><p>So <strong>Start your trading career</strong> as a professional and Learn how you can<strong> Trade for Income </strong>and <strong>Build Wealth</strong> by Learning from Professional Traders</p><p><strong></strong><em>So what are you waiting for ? <strong>Take the Step towards Financial Freedom.</strong> </em></p><p><em>Give us a few hours and we will give you a <strong>lifetime of success.</strong> </em><strong></strong></p><p><u><strong>You have nothing to lose, and EVERYTHING to gain.</strong> <br></u></p><p>Here are Some of the Review's our Students/Traders Left</p><p><strong><em>By Jim Jackson-</em></strong> <em>''Finally understood how the stock market works. Everything has started to make sense now and it helped me to learn where i should start..Thanks''</em></p><p><em><strong>By Karan Dewan- </strong><strong></strong>''This course helped me understand the basic concepts on trading and realize what i need to focus on to enhance my skills. The presenter seems very knowledgeable and trading the open to make good money in short time is the strategy i would concentrate on.''</em></p><p><em><strong>By John Davis-</strong> ''Love these guys trading in the room everyday, It was amazing to see how they utilize technical analysis. Great course. Definitely worth it for this price''<strong></strong></em><br style=\"\"><span></span></p>", 
    "end_date": null, 
    "title": "Stock Trading: Discover how to Trade Like a Pro", 
    "price": "45.00", 
    "instructors": "Live Traders", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439928_0c67_5.jpg", 
    "course_url": "https://www.udemy.com/trading-with-an-edge/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T21:57:42Z"
}