{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          This course is designed for students at ANY LEVEL. In this training course, I&#039;m going to show you how you can make consistent money trading stocks.  </p>  <p>  \t          Most courses give you the basics and a few tools to get you started trading.  </p>  <p>  \t          The top 5% of professionals who make consistent profits in the market look at the market differently than ordinary traders (aka &quot;retail traders&quot;) .  </p>  <p>  \t          Retail traders tend to personify the market and project that the market has an ego or personality. They get mad at the market when they miss an opportunity, become happy when they have a winning trade, and sad when they lose money.  </p>  <p>  \t          What they do not teach you how to make money. This course gives you actual case study in how one person, Dave made significant profits over the course of weeks. The market is like the weather. They&#039;re both powerful natural forces, yet you would never get mad at yourself or at the sky if the weather turned nasty, would you?  </p>  <p>  \t          The top 5% of traders look at the market like the weather... they depersonalize the market and respect the power that it has. Just like a tornado or a major storm, the market can be volatile at times, but it also has its calm, sunny days too. These are totally natural occurrences in the cycle of any natural environment.  </p>  <p>  \t          In this course you will learn to see the market as a natural powerful force like the weather, you&#039;ll begin to see that large rallies and large declines are well forecast ahead of time just like major weather patterns are forecast ahead of time--if you know what to look for. In this course you will learn what to look for.  </p>  <p>  \t          I discovered, after 20+ years of study that a certain phenomenon occurs in the market, on a regular basis, which determines with near perfect accuracy if the market will start a new downtrend or start a new uptrend. <strong>Reading this phenomenon is just like reading a weather report, and I&#039;ve now been using it for many years with incredible accuracy.</strong>  </p>  <p>  \t          There is over 7 hours of video content and in this training program you&#039;ll be shown exactly how to <strong>generate consistent profits regardless of whether the market is going up, down, or sideways!</strong> You&#039;ll get to watch and listen as I explain my strategy in detail, and I&#039;ll show you the exact pattern to look for that would have tipped you off that the market was going to rally strong.  </p>  <p>  \t          I can&#039;t guarantee that you&#039;ll achieve any specific results, but what I do 100% guarantee is that I&#039;ll be giving you the EXACT SAME system and strategies that I use in my own trading account to make a consistent income.  </p>", 
    "end_date": null, 
    "title": "Stock Market Mastery", 
    "price": "20.00", 
    "instructors": "Digital  Mentors", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202290_8cf2_6.jpg", 
    "course_url": "https://www.udemy.com/stockmarketmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-20T23:37:05Z"
}