{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Throw Darts - Pick Stocks - Make Money</strong>: In 1973 Burton Malkiel theorized that &quot;<em style=\"\">a blindfolded monkey throwing darts at a newspapers financial pages could select a portfolio that would do just as well as one carefully selected by experts&quot;</em>. </p><p style=\"\">In 1988 The Wall Street Journal tested the theory by creating the <strong style=\"\">WSJ Dartboard Contest</strong>. </p><p style=\"\">In <strong style=\"\">2004 Professional Trader, Jimmy Slagle, made a career out of it</strong>.If you are ready to see how a simple quote from a Princeton Professor prompted a professional trader to create a trading career from a D.A.R.T. then we challenge you to enroll in this class and learn from the trader who created the <strong style=\"\">Dart-Throw Trading</strong> industry as he walks you through his proprietary D.A.R.T. stock analysis and strategy selection process.</p><p style=\"\">If you have ever wondered how simple it can be to select stocks, evaluate them, and choose the best strategy to trade... now is your chance to discover some of the most closely guarded trading secrets of our generation.</p><p style=\"\">In our ongoing attempt to provide maximum value and education to our students, <strong style=\"\">we will continue to add live D.A.R.T. evaluations to this course</strong>.  Because of this we will raise the investment in this course by $10 for every 10 new evaluations we add until our course reaches its target tuition price of $99.00.</p><p style=\"\"><strong style=\"\">As a student you will have unlimited access to current and new content that we add. The sooner you join the lower your ultimate investment will be.</strong></p><p style=\"\">You have a <em style=\"\">totally unconditional guarantee</em>. Study the course. Test the waters. If you are in any way unhappy (I can&#039;t imagine, why, but nevertheless!) you will get a full <em style=\"\">100%, absolutely no conditions attached, no questions asked, refund </em>direct from Udemy. Cheerfully.</p><p style=\"\">You have a full 30 days to study and see the results and potential.</p><p style=\"\"><em style=\"\">That&#039;s our personal assurance of your success!</em></p><p style=\"\"><em style=\"\">We will see you at the D.A.R.T. Board,</em></p><p style=\"\">Jimmy Slagle</p>", 
    "end_date": null, 
    "title": "Stock Trading Strategies Using a D.A.R.T.", 
    "price": "20.00", 
    "instructors": "Jimmy Slagle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507600_567e.jpg", 
    "course_url": "https://www.udemy.com/stock-trading-strategies-using-a-dart/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T23:09:57Z"
}