{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Imagine trading stocks with absolute confidence. You have a crystal clear understanding how to identify winning ideas, and a flawless system for managing risk.</p><p>A trading plan gives you this script for winning trades. This course provides you a personalized stock market road map,  that matches the resources and goals that are uniquely yours.</p><p>Most professional stock traders expect to make money. Are you ready to have this conviction?</p><p>To succeed as a trader, you must reduce and then eliminate mistakes. This allows you to gain the experience required to make big money. This is the goal- learn to trade, and then learn how to trade bigger.</p><p>Let's work together.</p><p>Over the next 7 days, let's create a bullet-proof plan that defines what you want to accomplish as a stock trader. The more personalized your trading plan, the more conviction you will have.</p><p>Stock trading success is within your reach, but first, you need to take a critical step that most traders never take.</p><p>You must make a commitment to a strategy. One strategy.</p><p>That sounds limiting, but it makes you a smarter trader.</p><p>The Trading Plan Formula guides you, so you complete your plan in 7 days or less.</p><p>The final two hours of the program, gives you behind the scenes access into our pre-market game plan meetings. </p><p>In this section you will learn how to convert your trading ideas, into a list of winning stocks.</p>", 
    "end_date": null, 
    "title": "Stock Trading Strategies: Profitable Trading in 7 Days.", 
    "price": "50.00", 
    "instructors": "Pete Renzulli", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528104_9843_2.jpg", 
    "course_url": "https://www.udemy.com/stock-trading-strategies-the-trading-plan-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T19:51:01Z"
}