{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>STOCK MARKET INVESTING ENCYCLOPEDIA: HOW TO INVEST IN STOCKS</strong><br></p><p>I created this course to serve you as a guide to teach you about the stock market, learn theories and different ways to invest. This course is great for a newbie who just getting started in the stock market and wants to learn about it. I have combined a lot of knowledge that will take you to the intermediate range and save you a lot of hard work and limit stock market losses by learning common mistakes that newbies often make. <br></p><p>For this course I recommend you to open a paper money account where you trade using pretend money to test out some of the concepts taught in this course. As newbies I highly recommend against investing any real money in the stock market unless you have over 1 year of actual experience and read all the recommended books I suggest in this course.</p><p>This course will teach you...</p><p>Value investing, long term investing, when to invest in IPO, different terms theories and applications and instruments to use to learn more about understanding the value of a stock and if it is a good long term investment.</p><p><strong>REQUIRED LEGAL ADVISORY:</strong></p><p>In this course you will learn about the stock market this course is a guide that should help you learn about the stock market and help you make an educate decision. This course is not quick way to make money nor should it be a recommendation to buy any security. </p><p>I am not a registered financial advisor and therefore cannot make a buy or sale recommendation but only provide you general education. As always consult a financial advisor when it comes to advice to buy or sell any security. </p><p><strong>U.S. Government Required Disclaimer </strong>- Commodity, Stocks and Options trading has large potential rewards, but also large potential risk. You must be aware of the risks and be willing to accept them in order to invest in stocks, futures and options markets. Don't trade with money you can't afford to lose. This is neither a solicitation nor an offer to Buy/Sell futures or options. No representation is being made that any account will or is likely to achieve profits or losses similar to those discussed on this course site. The past performance of any trading system or methodology is not necessarily indicative of future results. All information presented here is for educational purposes only not an investment advice.</p><p><strong>CFTC RULE 4.41</strong> - HYPOTHETICAL OR SIMULATED PERFORMANCE RESULTS HAVE CERTAIN LIMITATIONS. UNLIKE AN ACTUAL PERFORMANCE RECORD, SIMULATED RESULTS DO NOT REPRESENT ACTUAL TRADING. ALSO, SINCE THE TRADES HAVE NOT BEEN EXECUTED, THE RESULTS MAY HAVE UNDER-OR-OVER COMPENSATED FOR THE IMPACT, IF ANY, OF CERTAIN MARKET FACTORS, SUCH AS LACK OF LIQUIDITY. SIMULATED TRADING PROGRAMS IN GENERAL ARE ALSO SUBJECT TO THE FACT THAT THEY ARE DESIGNED WITH THE BENEFIT OF HINDSIGHT. NO REPRESENTATION IS BEING MADE THAT ANY ACCOUNT WILL OR IS LIKELY TO ACHIEVE PROFIT OR LOSSES SIMILAR TO THOSE SHOWN.</p><p>All trades, patterns, charts, systems, etc., discussed in this course and product materials are for illustrative purposes only and not to be construed as specific advisory recommendations. All ideas and material presented are entirely those of the author. No system or methodology has ever been developed that can guarantee profits or ensure freedom from losses. No representation or implication is being made that using this methodology or system will generate profits or ensure freedom from losses. The testimonials and examples used herein are exceptional results, which do not apply to the average member, and are not intended to represent or guarantee that anyone will achieve the same or similar results. Each individual's success depends on his or her background, dedication, desire, and motivation.</p><p><strong>---&gt; </strong>I highly recommend NOT to invest any real money and only play with paper money for as long as year. It is very easy to make or lose a lot of money in the stock market education is your key to your success spend as much time as you can learning about the stock market and the resources provided to ensure you are on the right path.</p>", 
    "end_date": null, 
    "title": "Stock market Investing Encyclopedia: How to invest in stocks", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528784_42e0_16.jpg", 
    "course_url": "https://www.udemy.com/stockmarket/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T18:07:20Z"
}