{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This is our third and most advanced course on Stock Options.</strong> We strongly recommend you take \"Stock Options Trading Level 1 - Make Money &amp; Income From Day Trading\" and \"Trading Stock Options II: Simplified Strategies For Success\" before this one as they cover basics required before the advanced strategies in this course can be properly understood and mastered.</p><p>In Stock Option Trading, protection of capital is of paramount importance. Our goal in this course is to make 5 to 10% profit within 10 minutes 99.9% of the time. This means being very, very picky about the trades you get into.</p><p>Can you imagine what your life would be like 6 months from now, if four days a week, you could make a 10 to 20 minute stock option trade, with 99% assurance of success, that netted you 5%? 10% and sometimes even more?</p><p>That's what this Stock Options course will show you how to do. Your success comes from understanding the processes, systems and concepts, then applying them in a practice environment, before applying them to your live trading.</p><p>Investing and Trading involves significant financial risk and is not suitable for everyone. No communication or chat sessions should be considered as financial or trading advice. All information is intended for Educational Purposes Only.</p>", 
    "end_date": null, 
    "title": "Stock Options Trading 3 : Advanced Profit and Success Method", 
    "price": "25.00", 
    "instructors": "Scott Paton, Steven Wright", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476268_ffd2.jpg", 
    "course_url": "https://www.udemy.com/day-trading-stock-options-3/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T18:15:12Z"
}