{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>My Udemy course has over 600 students in the first week. Start making money in the stock market with your current account or practice with a virtual account and basic trading knowledge, immediately - nothing else is required but your desire to want a become a better trader.</p><p><em>Last Updated 9/27/2015 - new quiz questions and new links in the last section to help with chart patterns and technical indicators.</em><br></p><p> +++++++++++++++++++++++ </p><p> About this course: </p> <ul><li><em>Only your desire and determination is required</em></li><li><em>Full, free lifetime access</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul> <p> WHAT YOU GET: </p> <ul><li>You will recognize and understand the mental traps and mind games we ALL fall into when trading in the stock market.</li><li>You will learn how to train yourself to overcome those traps and fundamentally become a better trader.</li><li>You know how to plan for a successful trade every time.</li><li>The market will never listen to you, but it will speak to you if you listen. learn what to recognize.</li><li>Quizes to test what you've learned.</li></ul> <p> Today, you can start to make good money in the market. </p><br style=\"\"><p> <strong>You </strong><strong>don't even need a trading account to start learning</strong> - I show you how to become a better trader (literally!) showing exactly how you, like me, can use this course for immediate success. </p><p><strong><em> You'll learn </em></strong></p> <ol><li><strong><em>The traps we fall into.</em></strong></li><li><strong><em>Why you enter and unfortunately stay in bad trades.</em></strong></li><li><strong><em>How to break the cycle of trading poorly.</em></strong></li><li><strong><em>How to coexist with the market.</em></strong></li><li><strong><em>how to listen when the market speaks to you.</em></strong></li><li><strong><em>Understand the difference between natural and trained success in the market.</em></strong></li><li><strong><em>remove words and thoughts from our mind that are holding you back from success.</em></strong></li><li><strong><em>How left brain / right brain thanking effects the way we trade and how to control it.</em></strong></li><li><strong><em>how to train yourself for wild success in the markets.</em></strong></li><li><strong><em>Recognize if there are self limiting beliefs holding you back from the finical freedom you deserve.</em></strong></li><li><strong><em>How to get a plan together for successful trading.</em></strong></li><li><strong><em>Understand what makes a good trade.</em></strong></li><li><strong><em>Helpful links to understanding market patterns.</em></strong></li></ol> <p><strong><em>There is NEVER anything to pay! You can start with a virtual trading account.</em></strong></p><p> So, you've read this far! Thank you. </p><p> Click the \"take this course\" button, top right, now ... <em>every hour you delay is costing you money </em>... </p><p>Full details</p>  What are the requirements? <ul><li>basic trading knowledge required, it will be easier for beginners as you won't have to break bad trading habits</li><li>If you want to set up a virtual trading account it's recommend </li></ul> What am I going to get from this course? <ul><li>17 lectures and 1 hour of video content and quizes!</li><li>Fundamentally change the way you see the stock market</li><li>Break bad trading habits</li><li>Establish how to place good trades every time</li><li>Lean how to make a trading plan before you ever place the trade</li><li>Learning market patterns - via helpful web links</li><li>Never \"lose\" another dollar in the stock market again </li></ul> What is the target audience? <ul><li>Anyone who wants to easily make money in the stock market</li><li>Anyone from any country</li><li>Anyone of any age or ability </li></ul>", 
    "end_date": null, 
    "title": "Stock Markets: How I Became Rich By Changing How I Trade", 
    "price": "20.00", 
    "instructors": "Michael Timms", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466632_e8e6_3.jpg", 
    "course_url": "https://www.udemy.com/become-wealthy-trading-in-the-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T13:08:06Z"
}