{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Over 2100 Happy Students! </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Fully Updated for June 2016<br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"What if you could bet $100 that a stock wouldn't be down from where it is one month from now\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>You can and when you take this course I'll walk you through how to do it.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Getting started trading can be daunting 1,000s of books 100's of terms and all of them seem to be dry reads that beat you over the head with financial jargon. <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This Course will walk you down a path to a method that gives a high (normally 66% or more) probability of profit, so you can profit monthly on the Stock Market.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Content</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Start out by picking your broker</li><li>Leveraging what to trade</li><li>Only necessary terms given with explanations</li><li>How the method works with 66% probability of profit or better</li><li>How to calculate your risk to reward</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Overview</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Aimed directly for the beginners to get started making money on the stock market. As much as possible I want to bypass all the minutia I waded through when I began learning so you will be a better prepared to get started making money online in the Stock Market. There is a mountain of information out there that is largely unnecessary, so I have worked this down to what you need to get started right only what is needed to make money the bottom line. Avoiding time wasted on valuations, piles of data on statistics, or advanced theories. I take you directly to a very effective method so you can trade like a professional not like the amateur's or gamblers.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Over several videos I will show you what stocks I like to trade, and all the lesson's I've learned along the way to take you from amateur to professional without the frustration. Obviously I cannot guarantee every trade, but I show you how to put the odds squarely in your favor. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This method can be used as a way to add to a retirement wealth building account, or for monthly income to pay off debt or more toys.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Enroll now to start making $100 and more in the stock market.<br></p>", 
    "end_date": null, 
    "title": "Stock Market Leverage: How to Start Trading Options Wisely", 
    "price": "50.00", 
    "instructors": "Eric Blair", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545918_8bd6_5.jpg", 
    "course_url": "https://www.udemy.com/stock-market-tips-how-to-successfully-trade-options/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T20:06:14Z"
}