{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>My goal is to help teach all levels of self-directed traders how to consistently make smarter, more profitable trades. I'll personally show you how I trade by letting you watch over my shoulder, every step of the way.</p><p>I strongly believe in the \"Teach a man to fish\" analogy. Once you complete our training modules, my hope is that you will be able to make wise trading decisions, all on your own!</p><p>At Tradespoon, you are never alone. I will always be here to help you along the way. If you ever have any questions or concerns, simply ask, and I will answer!</p><p>You may be wondering what qualifies me to provide such an education?</p><p>I was the Executive Vice President and Head of Technology at OptionsXpress from the company's inception through 2007. During this time, the trading platform developed under my leadership served 300,000+ customers, processed more than 60,000 orders daily, and powered company growth to over $1.6B in market capitalization.</p><p>In total, I've been building and refining my core trading algorithm for over 15 years!</p><p>Join us for nine detailed modules, each consisting of multiple short and to-the-point video lessons to help you Trades Smarter! Our short video installments eliminate the hype and fluff, and allow you to learn at your own pace. All of our lessons can be viewed on desktops and mobile devices, so you can learn anywhere and anytime!</p>", 
    "end_date": null, 
    "title": "Stock & Options Trading with Tradespoon", 
    "price": 0, 
    "instructors": "Vlad Karpel", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/561722_cac1_3.jpg", 
    "course_url": "https://www.udemy.com/stock-options-trading-with-tradespoon/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-22T16:04:07Z"
}