{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to learn about the stock market trading and effective ways on how to get started investing and trading but don't know where to start ?</p>\n\n<p>Do you want to consistently beat the stock market and earn good returns but finding hard to make it ?</p>\n\n\n\n<p>Do you want to learn the strategies that could help you spot and find some multibagger stocks that could return 2X,3X,4X or may be even more in just a year ?</p>\n\n\n\n<p>Do you want to buy when the risk is low and sell when the profit is pretty high ?</p>\n\n\n\n<p>If your answer is YES to anyone of the above questions then, This course is just made for you.</p>\n\n\n\n<p>Getting started trading in stock market can be intimidating, you may have to read 1,00s of books, go through 1000's of terms and still all of them may not seem sufficient enough to let you start making money in stock market.</p>\n\n\n\n<p>So, that's why I made this course which is aimed directly for the beginners so that they can get started making money in the stock market. I have eliminated all the irrelevant and useless information which could have acted as information overload and prove to be a challenging obstacle in your way. </p><p>That is why in this course I'm gonna get straight to the point but simultaneously not missing a single important basic term which could be useful for you. I will take you directly to my effective strategy so that you can trade like a professional and never to be like amateur.</p>\n\n\n\n<p>Going through 96 different tutorials starting from the very basics of picking stocks, I will show you where to find some multibagger stocks, what are the essential characterstics that every potential multibagger stock has, different fundamental and technical indicators that i use in order to find these stocks and all the lesson's that I've learned along the way during the last 6 years to take you from amateur to professional without any delay. Obviously I cannot guarantee that you will make money from every trade, but I'll show you how to increase the probability of winning in your favour.</p>\n\n\n\n<p>This course aims to teach you how you can get started with stock market, trade in stocks successfully and make money with the minimum risk and still make good enough profit. This course is designed for anyone who wants to discover proven profitable trading strategies and for those who are interested in making money trading stocks.</p>\n\n\n\n<p>Packed with over 96 different video lessons and over 6+ hours of content, I will explain everything you need to make money trading stocks.</p>\n\n\n\n<p>The goal of this course is to make you a better Trader and to some extent an investor and , to provide you with a thorough, complete while still practical understanding as to how to search for potential multibagger stocks, where to find the next super stocks, analyze them rigorously and how to make a profit by buying and selling those stocks at the right point.</p>\n\n\n\n<p>This Course is not about making quick profits but about laying a complete groundwork and building a strategy starting from the vary basics and going till the end which will help you become a professional trader.</p>\n\n\n\n<p>This is a strategy that's really simple to understand for any investor but simultaneously sophisticated enough to give you good returns as compared to the benchmark and also this strategy can be applied to other global stock markets too.</p>\n\n\n\n<p>Also Note that there is a 30 days money back guarantee, So, Just in case you're not satisfied with the course and it is not upto your expectations or you don't find the strategy working then without a doubt, you can ask for a refund and you'll will get a full refund on your money.</p>\n\n\n\n<p>Not to forget, you get to ask me questions and see me respond to every single one of them thoughtfully!</p>\n\n\n\n<p>So, Are you ready to become a better Trader, and want to learn how to trade stocks ?</p>\n\n\n\n<p>Then, This course will help you – in just a couple of hours!</p>", 
    "end_date": null, 
    "title": "Stock Market: How I Made 138% Profit in 1 Year from Scratch", 
    "price": "20.00", 
    "instructors": "Jatin Taneja", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739916_1251_5.jpg", 
    "course_url": "https://www.udemy.com/make-money-in-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T14:30:52Z"
}