{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Get the inside secrets to zipping past your goal!</strong></p><p style=\"\">With a number of successful and highly funded campaigns and over $250,000.00 raised, Richard Haberkern offers an insider&#039;s perspective on achieving highly successful funding goals. &nbsp;This course also includes the best practices for project creators, and analyzes some of the pitfalls that campaign creators may encounter on the road to success.</p><p style=\"\">In this course you will learn:</p><ul style=\"\">  <li style=\"\">How to properly setup pledge levels.</li>  <li style=\"\">Tricks to entice more pledgers and higher backer rewards.</li>  <li style=\"\">Pricing pledge levels to guarantee that bakers receive their rewards.</li>  <li style=\"\">How your goal amount affects backers&#039; decisions.</li>  <li style=\"\">The psychology behind the goal.</li>  <li style=\"\">Making backers want to be a part of your success.</li>  <li style=\"\">Setting a realistic goal to increase the chance of a project&#039;s success.</li>  <li style=\"\">Technical tips and scripting guidelines to shooting an engaging video.</li>  <li style=\"\">How to analyze the actual costs involved in delivering your rewards.</li>  <li style=\"\">Good practices for laying out your campaign.</li>  <li style=\"\">The importance of sharing your project&#039;s history and story with the community.</li>  <li style=\"\">Using blogs, social media, and other websites that lead to a successfully funded project.</li>  <li style=\"\">Viral Marketing and other methods that lead to successfully funded projects.</li>  <li style=\"\">Using individual website and blog statistics to maximize the traffic driven to your campaign.</li>  <li style=\"\">How to utilize the kickstarter dashboard to track the course of your project&#039;s success.</li>  <li style=\"\">How to utilize metrics to track the course of your project&#039;s success.</li>  <li style=\"\">Simple math that you can do to estimate where your project&#039;s goal is headed.</li>  <li style=\"\">How the first few days after launch will determine your project&#039;s outcome.</li>  <li style=\"\">And much more!</li>  </ul><p style=\"\">          </p><p style=\"\">This course is designed for those serious about crowd funding and raising money on Kickstarter. &nbsp;It is a how-to-guide from a successful Kickstarter project creator. &nbsp;Gain inside knowledge from someone who is raising money via crowd funding and internet marketing every day!</p>", 
    "end_date": null, 
    "title": "Surpassing Your Kickstarter Goals", 
    "price": "30.00", 
    "instructors": "Richard Haberkern", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56058_d0b3_7.jpg", 
    "course_url": "https://www.udemy.com/surpassing-your-kickstarter-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-23T18:26:48Z"
}