{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is my experience of working and creating asset management systems in many companies. It is cross checked and proven by excellent results. It is universal and allow you dynamically manage different classes of assets including: equities, bonds and real estate. It is my system. The product of thinking and sharing my experience with other investment professionals from different parts of the world. It seems that we use very similar approach for managing assets. Moreover it gives you structured knowledge of valuation and managing risk management, sales and trading. Everything is included. Of course it is basic knowledge but it covers the whole basis of the ordinary asset management company. The foundations of the system is value investing. Then we go to the upper level and analyze how the investment company should work.<br>-value investing approach to valuation<br>-clarified principles of working including:<br>a) the flow of information is limited (\"Chinese Walls\")<br>b) strict division of labour<br>Then we cover different departments of the asset management company:<br>1) Research (RE)<br>2) Risk management (RM)<br>3) Trading (TD)<br>4) Sales (SA).<br>Each part is a complex structure itself but let's consider it.<br>RE is an important and vital part of the investment process. The valuation method is defines and definition of the value investing and its formula is given. Therefore, you have all tools for managing assets.<br>RM based on two main pillars: <br>First, limits that are based on investment declaration that is given from the client. Assets divided in three categories: equities, bonds and real estate. Then within these classes we divide instruments in four basic categories based on the risk. There are different approaches in dividing categories some do it based on the liquidity of the assets (equity, real estate) and some on liquidity and credit rating (bonds). I saw this approach in two companies where I worked and one european company.<br>Second, another thing is the limitation of the risks based on these classes and categories. This cover risk of the every assets and fit investment declaration of the client.<br>TD - trader make deals according to the information received from RM and RE. From RM goes information about limits and from RE goes information about upsides of the instruments. According to received data he makes deals on the market. The purpose of TD is to keep assets with maximum return. TD constantly monitor assets in portfolio and online market data to understand upside situation on the market. Market growths in steps principle less risky assets go first and more risky go last. So TD covers the whole growth of the market because upside of less risky assets disappear and more risky assets stay the same. So TD goes deeper.<br>SA - work on the strict client-company principles. The result is evaluated based on individual portfolio index. Therefore, SA gives client right evaluation of the performance based on the index of the portfolio.<br>Finally, we have a synergy of the company that is based on this principle. I want to mention that you have to write manuals for each department and for the company itself. So, this course covers basic principles. If enjoy this course let me know and I will make more defined solution to the problems that will appear because of the  further complication of the system.</p><p><br><br> </p>", 
    "end_date": null, 
    "title": "System of Asset Management for Professionals (SAMP)", 
    "price": "50.00", 
    "instructors": "Mr Andrei Li", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621014_5397_2.jpg", 
    "course_url": "https://www.udemy.com/professional_asset_management_system/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T04:52:47Z"
}