{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>~~~Over 1,370 students enrolled in my courses.~~~ <em>(Updated as of June 2016)</em></strong><br><strong>~~~See why and how my videos helped over 110,000 students---</strong></p>\n\n<p><strong>If for any reason you are not satisfied, get your money back. No Questions Asked.</strong><br></p>\n\n\n\n\n\n<p>This course will prepare you to be <strong>confident</strong> in preparing your own taxes and the taxes of others. This course will visually and logically explain the Tax Law and its <strong>applications through examples and scenarios</strong>. Tax Law is a very interesting topic. It is not a topic that can be easily memorized, but, however, it is a topic that requires constant research and reference to appropriate materials. This course will enable you to do exactly that.</p>\n\n\n\n\n\n<p>You will find videos that explain the rules. These videos are followed by another set of videos with examples and scenarios that will help you understand the application of the Tax Law even better. All the materials that I am talking about in the course are <strong>FREE</strong> and I tell you where to find them and how to use them.</p>\n\n\n\n\n\n<p>You can study the course at your own pace. However, I believe that you can finish it very fast since the videos are very descriptive. <strong>Get equipped with the proper materials, review the course, and start preparing tax returns! </strong></p>\n\n\n\n\n\n<p>The price of this course will gradually increase. I suggest that you take action at the price you currently see.</p>\n\n\n\n\n\n<p><strong>If for any reason you are not satisfied with the course, you will receive full refund. No questions asked.</strong></p>", 
    "end_date": null, 
    "title": "Tax Preparation: Learn Fast! Prepare Taxes with Confidence!", 
    "price": "50.00", 
    "instructors": "Stefan Ignatovski", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724596_2500_2.jpg", 
    "course_url": "https://www.udemy.com/taxpreparation/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T20:50:37Z"
}