{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">We&#039;ve all heard the story before. Mitt Romney, multi-millionaire congressman, paid an effective tax rate of roughly 14%! How is it possible that the someone making that amount of money pays a lower tax rate than most Americans?</p><p><em style=\"\">The answer? <strong style=\"\">Proper tax planning.</strong></em></p><p>Proper tax planning is perhaps the most important step to the promised land of financial freedom. The strategy is simple- the more income that you generate at a tax free or a lower tax rate means the more money you get to keep. If you reinvest this money, your money works for you, generating a stream of passive income ultimately accumulating wealth.</p><p style=\"\">There seems to be this misconception that the wealthy are cheating the system. This is simply not true! The wealthy simply structure their income to take advantage of the favorable provisions outlined by the government.</p><p style=\"\"><strong style=\"\"><em style=\"\">Anyone can apply these strategies- not everyone knows about them.</em></strong></p><p style=\"\">That is where this course comes in. Students will learn how to :<br style=\"\"></p><ul style=\"\"><li style=\"\">Generate passive income</li><li style=\"\">Identify investments with the best return on tax savings and earnings potential</li><li style=\"\">Understand loopholes of the tax system</li><li style=\"\">Reduce their tax bill on their very next return</li><li style=\"\">Properly plan their finances for the future</li><li style=\"\">Build wealth in the long term</li></ul><p style=\"\">With a 30 day money back guarantee, you have nothing to lose!</p>", 
    "end_date": null, 
    "title": "Tax Strategy: Financial Planning for Beginners", 
    "price": "20.00", 
    "instructors": "Calvin Liu", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332848_7853_8.jpg", 
    "course_url": "https://www.udemy.com/taxsavingstrategy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T18:29:25Z"
}