{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">MASTER TECHNICAL ANALYSIS</strong></p>Technical analysis has become extensive in recent years. We study the psychology of technical analysis and why they work 60 to 70% of the time. There are several categories of technical analysis - Price indicators, Support and Resistance levels, Momentum indicators, Volume indicators, Oscillators and Statistical price movement indicators. This is again an area where the KISS rule applies - Keep It Simple S-----. We cut through all the noise and show you why there are 4 or 5 indicators you should study and that&#039;s all you really need to make informed entry and exit decisions. Technical analysis is a self-fulfilling prophecy and gives deep insight into crowd behavior.<p>&nbsp;</p>  <h5>What you will master</h5>  <p>&nbsp;</p>  <ul style=\"\">  <li>What is Technical Analysis and why is crowd psychology an important factor in markets</li><li>Why does technical analysis work only 60 to 70% of the time</li>  <li>Why are Price indicators called &quot;lagging&quot; indicators</li>  <li>What are potential &quot;leading&quot; indicators</li>  <li>A study of Moving averages and which ones are helpful</li>  <li>What are the best indicators for short, medium and long term trends</li><li>Why do we need a &quot;confluence&quot; of indicators to make a decision</li>  <li>Why the Bollinger Bands are a cool indicator</li>  <li>Adjusting technical indicators to match your trading timeframe</li>  <li>Why technical analysis &quot;works until it doesn&#039;t&quot;</li></ul>  <p>&nbsp;</p>  <h5>SECTION 1</h5>  <p><strong style=\"\">Lecture I - &nbsp;What is Technical Analysis</strong></p>  <p>Technical analysis is primarily a study of Crowd psychology and crowd behavior. If a certain number of people act in unison at a certain time, and other people can observe this group of people taking a certain action, then they are motivated to join in. And it becomes a self-fulfilling prophecy. Technical analysis is a very powerful force in the markets, but it has limitations. This Introductory lecture explains these details.</p>  <p>&nbsp;</p>  <p><strong style=\"\">Lecture 2 - Crowd psychology and Crowd behavior</strong></p>  <p>What is crowd psychology and why does it matter ? In this lecture, we study the S&amp;P 500 Index over the last 20 years, and also observe a certain technical pattern that is currently playing out textbook-style. How could this pattern impact the markets this year ?&nbsp;</p>  <p>&nbsp;</p>  <p><strong style=\"\">Lecture 3 - &nbsp;Limitations of Technical Analysis</strong></p>  <p>What are the limitations of Technical analysis - when does it work, and when does it not work. Knowing when it does not work is as important as knowing when it works.</p>  <p>&nbsp;</p>  <h5>SECTION 2</h5>  <p>Section 2 is a detailed discussion of all the types of Technical analysis indicators. You have various kinds - Price Indicators, Momentum indicators, Statistical and Volatility indicators, Support and Resistance, Volume indicators and Oscillators. Each of these indicator types are broken down in detail as well as insightful tips on their usage and interpretation.</p>  <p>&nbsp;</p>  <h5>SECTION 3</h5>  <p>Section 3 is a complete case study set of 5 stocks -&nbsp;</p><p>1) Apple (AAPL) - 1 Year Chart. And how AAPL gave 3 points of entry for the perfect Bearish trade.</p><p>2) Priceline (PCLN) - No clear long-term signals, but a short term bearish trade could be played out.</p><p>3) Chipotle Mexican Grill (CMG) - an absolutely amazing Statistical indicator gives away the perfect &quot;Long&quot; signal</p><p>4) The Gold ETF GLD -&nbsp;Hidden inside a very bearish chart is the potential for a reversal trade</p><p>5) And on the Google (GOOG) charts, we can study the battle between the Bulls and Bears at a recent breach of Google&#039;s all-time high.</p>  <p>&nbsp;</p>  <p>Applying correct Technical Analysis techniques can set you with a fantastic trade entry. If you get your trade entry correctly, you have just increased your chances of a profitable trade a whole lot.&nbsp;</p>  <p>&nbsp;</p>  <p><strong style=\"\">This course will be bundled with &quot;Volume Analysis&quot;. You can pick up both of these courses together for a savings of 15%.</strong></p><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\"><br style=\"\"></strong></p>  <p></p>  ", 
    "end_date": null, 
    "title": "Technical Analysis - A practical approach for trade entry", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42640_45e5_9.jpg", 
    "course_url": "https://www.udemy.com/learn-technical-analysis/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T21:33:06Z"
}