{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Technical analysis has become extensive in recent years. Technical analysis works 60 to 70% of the time, and this is because fundamental events (earnings reports, lawsuits, mergers or acquisitions and many more events) always trump any technical pattern. However, in the absence of fundamental events, which is 60% to 70% of the time, technical analysis works because traders don&#039;t have any other information to go by.<br style=\"\"></p><p style=\"\">There are several categories of technical analysis - Price indicators, Support and Resistance levels, Momentum indicators, Volume indicators, Oscillators and Statistical price movement indicators. This is again an area where the KISS rule applies - Keep It Simple S-----. We cut through all the noise and show you some of the key indicators you should study and that&#039;s all you really need to make informed entry and exit decisions. Technical analysis is a self-fulfilling prophecy and gives deep insight into crowd behavior. The more people follow Technical analysis patterns, the more they are likely to take action in some sort of co-ordinated manner. <br style=\"\"></p><p style=\"\">Hope you enjoy this comprehensive suite of 10 very important Technical analysis tools. You will undoubtedly prefer some over the others, and that&#039;s fine. The key is to use the correct type of indicator for the specific situation you&#039;re trying to analyze. </p><p style=\"\"><strong style=\"\">The analysis and practical application of these Technical analysis tools are demonstrated on a Live trading platform with several examples. In that regard, this is a very practical guide to understanding Technical analysis tools.</strong></p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">List of Technical analysis tools covered for Stocks and Options trading</strong></p><ol style=\"\"><li style=\"\">Support and Resistance</li><li style=\"\">The MACD Indicator</li><li style=\"\">Oscillators</li><li style=\"\">Understanding Standard Deviation</li><li style=\"\">Bollinger Bands</li><li style=\"\">On Balance Volume</li><li style=\"\">Fibonacci Retracements</li><li style=\"\">Market Strength Indicators</li><li style=\"\">Understanding Volume Profiles</li><li style=\"\">Probability Analysis</li></ol><p><br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Technical Analysis tools for Stocks and Options trading", 
    "price": "20.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474150_f730.jpg", 
    "course_url": "https://www.udemy.com/technical-analysis-tools-for-stock-trading-and-options-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T13:13:33Z"
}