{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Now updated with the special trading pattern we used to predict the current rally in Gold prices as early as December of 2015!!!</strong></p>\n\n<p>Technical Analysis for Investors &amp; Traders is meant to introduce you to the world of technical analysis by using latest real life examples and fast track you to apply these techniques for trading or investing in financial markets.</p>\n\n<p>This course would introduce you to various concepts including different types of charts, gap analysis, support &amp; resistance, trend lines &amp; trend channels, technical indicators like Bollinger Bands, Stochastic Oscillators, candlesticks patterns etc.What is more we will also be sharing with you details of our favorite trading pattern for all time frames that can be useful in trading any asset class! </p>\n\n<p>Not only will you be introduced to various concepts in detail, but you would also be shown examples on how these techniques were applied very recently in financial markets in order to make trading / investing decisions. You will be very surprised to see how sometimes very simple techniques can yield very powerful results.</p>\n\n<p>The course is divided in to 8 Modules with a total of 33 videos. In general for each lecture concepts are introduced, guidelines on particular concepts are elaborated and application of concepts is illustrated using recent examples from financial markets. This is done so that you benefit from the instructor's experience in applying these concepts for trading in financial markets. Since most of the examples selected for these course are from the actual trades in the market, you can be reliably sure that these concepts work and can be used for actual trading.</p>\n\n<p>We recommend that once you learn a concept, you take some time out on your own to sit down and apply these concepts to historical charts of some stocks. This way you will be able to internalize the concepts and can use it in real time trading or investing.</p>", 
    "end_date": null, 
    "title": "Technical Analysis Primer for trading Stocks, Bonds & Forex", 
    "price": "30.00", 
    "instructors": "Indian Insight", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576906_d3e1_2.jpg", 
    "course_url": "https://www.udemy.com/technical-analysis-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T21:56:55Z"
}