{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">CEO of TechniTrader® the Gold Standard in Stock Market Education™</em>  </p>  <p style=\"\">  \t<strong style=\"\">Training for Experienced Traders</strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">New to the Market? See our Beginner&#039;s Video at the TechniTrader Website</em></strong>  </p>  <p style=\"\">  \t    Looking to improve your trading process? Learn how important it is to identify the current market condition, which exposes the price patterns that are going to be most successful, the indicators that perform best, and the market participants that are dominating the trading activity. Learn from Martha Stokes, CMT how to set up leading hybrid indicator tool kits that can significantly improve your results.  </p>  <p style=\"\">  \t<strong style=\"\">Watching this video you will learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">  The New Market Structure of High Frequency Trading Firms and Dark Pools.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  The Market Participant Cycle &amp; Market Condition Analysis and how this impacts price action.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  How and why to choose indicators for different Market Conditions.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  Why new Technical patterns are forming.</li>  </ul>  <ul style=\"\">  \t<li style=\"\">  New Candlestick Patterns.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">TechniTrader® t</strong><strong style=\"\">he BEST Education for stock traders and professionals</strong>  </p>  <p style=\"\">  \t    Why do so many professionals and experienced traders say that TechniTrader® is the BEST Education for stock traders and professionals? Because we are the only educational company that teaches from the professional perspective. We are retired professionals and our viewpoint is completely different than a retail trader who sells his personal strategy for extra income to other retail traders.<br style=\"\">  </p>  <p style=\"\">  \t    As professionals with educational backgrounds, our courses are structured in the same way you would learn at a university. We do not teach mere strategies, or just one indicator. What we teach is a complete process for trading. By combining what you have already learned with our comprehensive process, you are quickly able to increase your profitability while minimizing your risk.  <br style=\"\">  \t<br style=\"\">  </p>  <p style=\"\">  \t    Register now at the TechniTrader Website and start learning how to be consistently successful trading Stocks &amp; Options. You are welcome to go through our website at your leisure. You will find more free training videos, PDFs, and a Trader&#039;s Wiki packed with helpful information under the <em style=\"\">Learning Center</em>. Do you have questions that need answering?  </p>  <p style=\"\">  \t    Here is our number: <strong style=\"\">888-846-5577</strong>  </p>", 
    "end_date": null, 
    "title": "TechniTrader Leading Hybrid Indicator Trading", 
    "price": "20.00", 
    "instructors": "Co-Founder & CEO of TechniTrader®", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46010_c8f7_7.jpg", 
    "course_url": "https://www.udemy.com/leading-hybrid-indicator-trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-15T18:46:33Z"
}