{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>“<em><strong>Y<em>ou look out your window, past your gardener, who is busily pruning the lemon, cherry, and fig trees... amidst the splendor of the gardenias, hibiscus, and hollyhocks.</em></strong></em><br></p>  <p><em><em><strong>The sky is clear blue. The seas is deeper blue, sparkling with sunlight.  </strong></em></em></p>  <p><em><em><strong>A gentle breeze comes drifting in from the ocean, clean and refreshing, as your maid brings you breakfast in bed.  </strong></em></em></p>  <p><em><em><strong>For a moment, you think you have died and gone to heaven.  </strong></em></em></p>  <p><em><em><strong>But this paradise is real. And affordable. In fact, it costs only half as much to live this dream lifestyle... as it would to stay in your own home. </strong></em> </em></p>  <p><strong>Want to Wake up Every Day in Paradise?</strong>”</p>  <ul><li><strong>NOTICE:</strong> This is the official <strong>guide to tax arbitrage in Puerto Rico</strong> maintained by the <strong>University of Puerto Rico MBA Students.</strong> The intent of this free public service Udemy course is to assist managers in accessing <strong>unbiased</strong> and <strong>truthful information</strong> regarding relocating to Puerto Rico for <strong>tax benefits</strong>. </li></ul><p>Dear <strong>taxpayer</strong>, </p>  <p>So begins <strong>my friend Bill Bonner's</strong> famous promotion that launched his excellent publication <em>International Living</em>.  </p>  <p>The reality is that <strong>a tropical American dream</strong> at 1st world standards is not widely for sale at a two for one discount.  </p>  <p>I've known <strong>oil-rich-bass-fishin’ Texans</strong> driven from vacation homes in the mountains of Mexico by machine gun toting \"<em>Federali</em>\" <strong>expropriators</strong>.  How would you feel if you had bought a pristine beach vacation home <strong>pre-Chavez in Venezuela</strong>?  </p>  <p><strong>Political risk in strange countries</strong> is not your only dilemma.  </p>  <p><strong>Uruguay's Punta del Este</strong> is one of my favorite places in the world.  Make sure you <strong>pack an extra suitcase of C-notes</strong> if you wish to own there. </p>  <p>The country has <strong>no mortgage market</strong>.  </p>  <p>I love <strong>carnival in Rio</strong>. <strong>How about you</strong>?</p>  <p>Brazil imposes <strong>complicated restrictions on foreign capital</strong> that generally obviates real estate ownership. Most of Europe is <strong>no cake walk</strong> either.  </p>  <p>The list of countries with <strong>bumps in their political or financial landscape</strong> goes on and on.  </p>  <p>Under the searing microscope of independent reason most <strong>post-card-coastlines</strong> are rejected.  In the end analysis these <strong>barbed-wire framed masterpieces of nature</strong> are nowhere you would really want to live.  </p>  <p>A <strong>commonly overlooked</strong> tropical exception is <strong>Puerto Rico</strong>.  </p><p><strong>Discover the 17 Ways to Pay Zero Taxes Living on a Warm Tropical Beach in Puerto Rico!</strong></p><ol><li><strong>Research </strong>and Development</li><li>Advertising and <strong>Public Relations</strong></li><li><strong>Consulting</strong></li><li><strong>Advice </strong>on matters relating to any trade or business</li><li>Commercial arts and <strong>graphic </strong>services</li><li>Production of <strong>construction </strong>drawings architectural and endangering series and project management</li><li>Professional services, such as <strong>legal</strong>, tax and accounting</li><li>Centralized <strong>management </strong>services</li><li>Centers for <strong>electronic data processing</strong></li><li>Development of <strong>computer programs</strong></li><li><strong>Telecommunications </strong>voice and data between persons located outside of Puerto Rico</li><li><strong>Call </strong>centers</li><li>Shared <strong>Services </strong>centers</li><li>Storage and <strong>distribution </strong>centers (“hubs”)</li><li><strong>Educational </strong>and training services</li><li>Hospitals and <strong>laboratories</strong></li><li>Investment <strong>banking </strong>and other financial services</li></ol>  <p>What allows you to <strong>buy the American Dream</strong> in our paradise here at a <strong>50% discount</strong> or more derives over time from money not lost in taxes.  And your <strong>Caribbean lifestyle</strong> is delivered with a <strong>lifetime iron clad anti-expropriation guarantee</strong> of the <strong>United States Common-Law Constitution</strong>.  This covers not just you but also your <strong>inheritors</strong>.  </p>  <p>You'll have a <strong>clear understanding</strong> of the meaning of this by the end of this course.   I just might convince you to wind down your days with us on the <strong>sunny tropical Caribbean island</strong> of Puerto Rico.  </p>  <p>But first let me give you a <strong>background</strong> from which to understand.   </p>  <p><strong>The Untold History of Puerto Rico</strong></p>  <p>At slightly less than three times Rhode Island Puerto Rico is the <strong>third largest isle in the United States</strong>.   That's a hundred and ten by forty miles of prime Caribbean acreage basking in a year round climate <strong>ranging between 70 and 96 degrees</strong> Fahrenheit at 18.45⁰ latitude slightly north of the equator. This Latin paradise of eternal spring is part of Jimmy Buffet's most coveted Caribbean sailing grounds.  </p>  <p>Only <strong>Hawaii's Big Island and Kodiak Island in Alaska</strong> are larger.  </p>  <p>The <strong>lush tropical land</strong> sits on a foundation of <strong>190-million-year old rock</strong>.  The massive <strong>subduction zone</strong> slopes into the largest and deepest trench of the frigid Atlantic to the east.   </p>  <p>The <strong>backbone of the island paradise</strong> is a range that composes two thirds of the land mass.  It climbs to <strong>4,393 feet above sea level</strong>.   </p>  <p>The <strong>central Puerto Rico cordillera</strong> forms the rim of a massive eastern bowl that shelters and warms the <strong>Caribbean Sea to the west</strong>.  Sections are of <strong>an unexpected breathtaking beauty</strong> normally discovered on a major continent in places as majestic as California's Yosemite or Washington's Olympic Peninsula.  </p>  <p>It also creates the canvas for more than a <strong>dozen ecological micro climes</strong>.  </p>  <p>The most arid of these in the south are reminiscent of <strong>deserts </strong>along the southern Arizona border.  The most humid is <strong>El Yunque</strong>, the only tropical rainforest in the <strong>National Park System</strong>.  </p>  <p><strong>The Caribbean Basin Drive for Increased Employment</strong></p>  <p>The <strong>Bahamas</strong> levy neither income, capital gains nor inheritance tax.  But the problem over yonder is that you have to deal with the <strong>political risk</strong> of a <strong>foreign government</strong>.  </p>  <p>The only choices you have for <strong>safely owning</strong> your piece of perpetual paradise with <strong>United States Federal property protection and tax benefits</strong> are St. Thomas, St. Croix, or Puerto Rico.  </p>  <p><strong>The U.S. Virgin Islands</strong> offer a 90% exemption from U.S. income taxes and 100% exemption from all other taxes and duties if you qualify.  You do receive <strong>property protection</strong> from the United States federal government.  </p>  <p>This <strong>mitigates political risk</strong>.  </p>  <p>But over in that neck of our aquatic sports range you end up living on a <strong>tropical dirt speck the size of a postage stamp</strong>.  Ditto for the slightly larger but <strong>relatively desolate island</strong> of St. Croix.  </p>  <p>I am sure that you won't be surprised to learn that <strong>Island fever</strong> is the leading cause of exit from the <strong>United States Virgin Islands</strong> within a few years of relocating.</p>  <p>Most Americans think that Puerto Rico is a <strong>third world country</strong>.  <strong>Think again</strong>.   </p>  <p>I am writing you now to show you secrets from my 23 years of living on the Island of Puerto Rico while <strong>engaged</strong> in extensive business in the region.  I have <strong>run the analysis</strong> many times over these many years.  </p>  <p>Every time I crunch it through I consistently conclude that Puerto Rico is the best place for you to enjoy a <strong>Jimmy Buffet lifestyle</strong> on a Warren Buffet budget of tax savings. </p>  <p>New initiatives from the top of <strong>Puerto Rico's Free Associated State</strong> have just recently created fantastic opportunities for legal tax avoidance <strong>in return for job creation</strong>.   These benefits are bestowed on <strong>financial services firms</strong> willing to relocate to our <strong>Enchanted Isle</strong> — and home of the <strong>uber-cute Coqui frog</strong>.   </p>  <p>Amazingly, <strong>the benefits</strong> are best for retired ultra-high net worth individuals living on portfolio income.  And I think you will enjoy a refreshing change to …</p>  <p><strong>A Blended Culture Devoid of Slavery Anger!  </strong></p><p>This derives from a <strong>history largely unmarred by slavery</strong>.  Slaves at peak population never numbered more than <strong>one or two out of ten</strong> Africans or descendants during the 1700s in Puerto Rico.  </p><p>Perhaps this is from the <strong>lingering local distaste</strong> of the initial enslavement by <strong>Ponce de Leon</strong> of the <strong>Taino Indians</strong> in a tortuous fluvial gold panning system.  This resulted in bloody rebellion and the <strong>wrath of Queen Isabela</strong>. <strong>Taino descendants</strong> populate Puerto Rico as do their ideas and memories. </p><p>This contrasts starkly with the <strong>United States, Cuba and the Dominican Republic</strong> where 9 out of 10 people from Africa were slaves.  </p><p>Puerto Rican culture offers a <strong>refreshing color blindness</strong> bequeathed by a history largely devoid of such oppression.  </p><p>Also unique was the fact that <strong>Europeans outnumbered African </strong>throughout the post Taino Indian history in Puerto Rico.  <strong>Cuba and the Dominican Republic</strong> were over 90% Africans with regard to total population at the time.  </p><p><strong>Nearly all were slaves. </strong></p><p>The <strong>Spanish census</strong> reveals that the 583,181-person population of Puerto Rico was listed as just fourteen percent slaves of total and interestingly sixteen percent of “<em>colored</em>.”  This was in 1860 well before the <strong>1873 abolition of slavery in Puerto Rico</strong>.</p><p>Not surprisingly there are <strong>no racial riots</strong> in Puerto Rico.  </p><p>The <strong>Spanish language</strong> spoken on the island is pleasantly <strong>devoid of sub-dialects</strong> arising from the unjust brutality of slavery. </p><p>For further reading see \"<em>The Puerto Ricans - A Documentary History</em>\" by <strong>Kal and Olga Wagenheim</strong>.</p>  <p><strong>The True Birthplace of the Puerto Rican Independence Movement</strong></p>  <p>The hunger for self-determination began rather inauspiciously with the birth of <strong>Ramón Emeterio Betances</strong> on April 8, 1827.  As Ramón matured into a competent <strong>European trained ophthalmologist</strong> and <strong>Freemason</strong> he grew to loathe the ravaging governance of mother Spain.  </p>  <p>Even more he despised the <strong>Castilian acceptance of slavery</strong>.  He was thrown off the island for <strong>buying child slaves</strong> whom he would <strong>immediately free</strong>.  </p>  <p>His <strong>Freemason connections</strong> followed a freedom network that connects to the <strong>fathers of the American Revolution</strong>.  </p>  <p>Dr. Betances, the <strong>political refugee</strong> eventually landed in New York.    He gained the respect of Congress after convincing the legislature to vote against the <strong>annexation of the</strong> <strong>Dominican Republic</strong>.  </p>  <p>His argument rested on the <strong>inviolable right of a people to self-determine</strong>.  </p>  <p>Betances is widely recognized as the father of the <strong>Puerto Rico Independence Movement</strong>. His <strong>Freemason philosophy</strong> connected his Caribbean cry for revolution with that of our own.  His written pamphlets from 1867 closely resonate the thinking of <strong>Ben Franklin</strong> and <strong>Thomas Jefferson</strong>:</p>  <p><strong>The Right to Reject All Taxes</strong></p>  <ol><li>Freedom of <strong>Religion</strong></li><li>Freedom of <strong>Speech</strong></li><li>Freedom of the <strong>Press</strong></li><li>Freedom of <strong>Commerce</strong></li><li>The Right to <strong>Assemble</strong></li><li>The Right to <strong>Bear Arms</strong></li><li>The Inviolability of the <strong>Citizen</strong></li><li>The Right to <strong>Elect Our Authorities</strong> </li><li>Abolition of <strong>Slavery</strong></li></ol>                  <p>These are the <strong>TEN COMMANDMENTS</strong> of Free Men according to Betances.</p>  <p>His 31year battle for independence ended in decree that Puerto Rico would be shaken loose from a <strong>collapsing Spanish government</strong>.  The strongest evidence of the full faith of Spain's intention was the <strong>commissioning of sovereign coinage</strong> for the island.  </p>  <p>The <strong>Puerto Rico pattern coin</strong> was formed in 1890.  </p>  <p>The <strong>design was finalized</strong> with the issuance of 5, 10, 20, 40 centavo and 1 peso numismatics minted in 1895 and 1896.  The one<strong>-ounce sterling silver Peso</strong> is the crown jewel of the 11 piece series.  </p>  <p>\"<strong><em>Dame un Peso</em></strong>\" does not refer to a <strong>U.S. Dollar</strong>.  </p>  <p>By August of 1898 the <strong>Puerto Rican populace</strong> was eagerly awaiting the arrival of <strong>King Alfonso</strong> from Spain for the formal act of separation followed by planned joyous celebration.  </p>  <p><strong>Just Weeks Away From Sovereign Independence...</strong></p>  <p>The <strong>United States of America</strong> invaded Puerto Rico in July 25th of 1898.  </p>  <p>The idea was to create a force as large and powerful as the <strong>British Royal Navy</strong>. The strategy called for <strong>control of marine routes</strong> related to the <strong>Panama Canal</strong>.  </p>  <p><strong>Puerto Rican coinage</strong> was truncated after its second year of issuance.  However, the Spanish symbolism of Puerto Rico's <strong>ephemeral sovereign nature</strong> resonates through the local government today.    </p>  <p>For the next 19 years Puerto Ricans were exploited as little more than <strong>indentured slaves</strong> by large <strong>American corporations</strong>.  These were extensions of an already thriving <strong>United States banana republic </strong>in Central America. </p>  <p>Locals were <strong>compliant from acclimation</strong> in the Hacienda \"<em>ficha</em>\" system of the Spaniards.  This process came to a grinding halt when the Jones Act conferred <strong>United States citizenship</strong> to Puerto Ricans in 1917.   </p>  <p>Citizenship was received with <strong>mixed feelings</strong>.  Roughly half of Puerto Ricans wanted <strong>statehood</strong>.  </p>  <p>The rest <strong>wanted nothing of the sort.</strong>  </p>  <p>A <strong>Pro-Statehood Party (PNP)</strong> developed within the population.  </p>  <p>Two prominent Puerto Ricans, poet <strong>Luis Muñoz Marín</strong> and <strong>pharmacy chain mogul Teodoro Moscoso</strong> negotiated with Congress to secure the right of Puerto Ricans to self-determine. </p>  <p>They worked in conjunction with Congress appointed <strong>governor Rexford Tugwell</strong>.  The renowned <strong>Columbia economics professor</strong> was highly supportive of both men.  </p>  <p>Over his tenure Governor Tugwell had come to love the people and <strong>Hispanic culture of Puerto Rico</strong>.  He did not want it erased by the <strong>mandatory linguistic imposition</strong> that American-English statehood would unequivocally create.  </p>  <p>The <strong>American melting pot</strong> could not tolerate a second official language.  </p>  <p>Tugwell used his <strong>influence in Congress</strong> that dated as far back as Frankin D. Roosevelt's \"<em>Brain Trust</em>\" that led up to the New Deal.    His input as an <strong>experimental economist</strong> was an important guiding force throughout the process.  </p>  <p>A <strong>Free Associated State</strong> model was developed and approved in Congress.  </p>  <p>This conferred <strong>taxation, insurance, and retirement plan autonomy</strong> to the Puerto Rican government in 1947. Medicare and social security benefits for locals are restricted and residents cannot vote in a <strong>United States presidential ellection</strong>.  </p>  <p>This created the only <strong>foreign tax system</strong> within the borders of the United States.  </p>  <p>The combined brilliance of <strong>Marín, Moscoso, and Tugwell</strong> had birthed the first political economic system that ensured the preservation of the local <strong>Hispanic culture and language</strong>.  </p>  <p>This <strong>Free Associated State model of Puerto Rico</strong> has many parallels with that of both the <strong>American State</strong> and the <strong>European Union (EU) </strong>systems.  The theory that led to the EU was published in the 1960s by Bagwell’s Columbia economics fellow faculty member <strong>Robert Mundell</strong>.  </p>  <p>Professor Mundell won the <strong>Nobel Prize</strong> for his work that formed the European Union.  </p>  <p><strong>Luis Muñoz Marín</strong> became the first Puerto Rican governor elected by a popular majority of the <strong>Puerto Rican people</strong>.  </p>  <p>The Free Associated State was immediately recognized by the <strong>Pro-Statehood (PNP)</strong> populace as antithetic to statehood.  The right to vote put power into the hands of both sides.  </p>  <p>Ironically, the most <strong>fervent separatists</strong> also viewed the new situation as antithetic to independence.  The <strong>local</strong> <strong>Freemason</strong> <strong>movement</strong> started so many years ago by Dr. Betances quickly evolved into a <strong>Pro-Independence Party (PIP)</strong>.  </p>  <p>The new <strong>Popular Party (PPD)</strong> under governor Marín sought to form a <strong>free associated commonwealth</strong> with the United States as had been planned pre-invasion with Spain. </p>  <p>Both parties seek a <strong>degree of autonomy</strong> but in a different way.</p>  <p>For this reason, you may hear the Popular Party (PPD) referred to as a <strong>watermelon</strong>. The <strong>green</strong> color of the Pro-independence camp wraps around the <strong>red</strong> of the Popular party.  </p>  <p>The pro-statehood party color is the same <strong>navy</strong> blue of the American flag.  The <strong>blue of the Puerto Rican flag </strong>that flies on the governor’s mansion oscillates between navy and original powder blue depending on the party of the sitting governor. </p>  <p>The lack of a clear vision for an acceptable path to independence has led to the <strong>near extinction</strong> of the PIP party today.  And there has never been a sitting governor from the <strong>independence party</strong>. </p>  <p>Meanwhile, the <strong>Free Associated State</strong> has flourished into a working synergy between the <strong>Popular Party</strong>, the <strong>Pro-Statehood</strong> party, and the <strong>Congress of the United States</strong>.  </p>  <p><strong>Economic Development in Puerto Rico</strong></p>  <p>Teodoro Moscoso became the first <strong>administrator of economic development</strong>.  He created <strong>Operation Bootstrap</strong> in 1947 to transition Puerto Rico from an agrarian to an industrial society.  </p>  <p>A <strong>shrinking farm job market</strong> forced lesser skilled but now passport holding Puerto Ricans to the United States.  <strong>West Side Story</strong> is a portrayal of conflict between dislocated lower class <strong>Puerto Rican households</strong> and those of other New York immigrants competing for menial jobs.  </p>  <p>Nonetheless Puerto Ricans thrived giving rise to superstars such as <strong>Jennifer Lopez</strong>, <strong>Marc Anthony</strong>, <strong>Raul Julia,</strong> Ricky Martin, <strong>Rita Morena, José Ferrer</strong> and <strong>Benico del Toro</strong>.  And that is just the <strong>entertainment field</strong>.  Most Americans know that the <strong>Honorable Sonia Sotomayor</strong> is the first Hispanic United States Supreme Court Justice.</p>  <p>The <strong>Puerto Rican Diaspora</strong> centers around <strong>New York</strong>, <strong>Chicago</strong>, and <strong>Florida</strong>.  </p>  <p>Attempts at <strong>developing industries around heavy products</strong> were eventually throttled by high freight costs.  The negotiation that formed the <strong>Free Associated State</strong> came with the agreement that all freight on and off island would come and go by vessel flying an American flag under the <strong>Jones Act</strong>. </p>  <p>The next phase of <strong>economic development</strong> under <strong>Section 936 </strong>focused on high value products with low weight.  <strong>Margins on featherweight products</strong> are insulated from high freight costs.  </p>  <p>Section 936 tax exclusions created a <strong>vibrant hub of pharmaceutical firms</strong>.  President <strong>Bill Clinton</strong> squashed the program.</p>  <p>This stripped the island of between <strong>fifty and one hundred thousand</strong> highly skilled pharmaceutical jobs.  </p>  <p><strong>The New American Dream — The Puerto Rico World-Class Export Service Sector Super Hub</strong></p>  <p>In 2008 <strong>Harvard trained governor</strong> <strong>Aníbal Salvador Acevedo Vilá</strong> signed into existence Act <strong>No. 73-2008</strong>.   This new law reestablished a <strong>tax benefit system</strong> designed to incentivize the relocation to Puerto Rico of commercial scale firms.  </p>  <p>It is intended to repair the <strong>economic crater</strong> from the loss of Section 936 through the <strong>creation of new jobs</strong> on the island.  This aligns well with the <strong>Popular Party's utopian \"<em>Jibaro</em>\" philosophy</strong> that only hard Criollo work will guarantee \"<em>bread, land, and liberty</em>.\"  </p>  <p>The Popular Party desired the <strong>strongest possible tax incentives</strong> to repair the damage of extensive job loss from the <strong>Clinton Administration</strong>.  And fortunately, pro-statehood <strong>PNP party</strong> successor <strong>Luis Guillermo Fortuño Burset</strong> gave his full support of the formation of a <strong>vibrant export services hub in Puerto Rico</strong> — in return for tax incentives.  </p>  <p>Act No. 73 was <strong>gradually overhauled</strong>.  In 2012 it was signed into new form as <strong>Act 20 and Act 22 </strong>by new PNP governor Luis Fortuño. </p>  <p>Only a <strong>4% tax remains</strong>.</p>  <p><strong>Enroll</strong> in this course today.  It is the only <strong>official course</strong> on tax-incentives-for-jobs relocation to Puerto Rico.  </p>  <p>This course is your <strong>go-to-source</strong> for knowledge you can use to take intelligent directed action. <strong>Our training</strong> puts you in direct contact with the <strong>attorneys, accountants, human resource specialists, managers, service employees, and realtors</strong> you need.  </p>  <p>And we watch them closely within our <strong>UPR-MBA alumni web</strong>.  This ensures a <strong>focus on your needs</strong>.</p>  <p>This is the <strong>official University of Puerto Rico guide</strong> to relocating to our <strong>Enchanted Isle</strong> under act 20 and 22.  </p>  <p>This program is assembled in an academic team with my <strong>MBA students</strong>.  You can enroll in this Udemy course now for free.</p>  <p>This program offers you the <strong>inside track</strong> to Puerto Rico available nowhere else, such as ….</p>  <p><strong>Cutting taxes</strong> on interest, dividends, and capital gains. </p>  <p>Karate chopping your corporate rate to 4% if you operate a <strong>highly profitable, heavily taxed exportable service</strong>; professional consultants, software firms, cardiologists, hedge fund managers, or any of many other businesses and occupations. </p>  <p>Watching <strong>unfolding developments</strong> in Puerto Rico tax incentive laws.</p>  <p>Applying for <strong>tax incentives</strong>. </p>  <p><strong>Determining for yourself if you can benefit </strong>without paying thousands to an attorney.  </p>  <p>Asking our <strong>erudite experts</strong> on matters regarding day to day living in the <strong>Caribbean paradise of Puerto Rico</strong>.  </p>  <p><em>Enroll today, </em></p>  <p><strong>Dr. Scott Brown, Ph.D. </strong></p>  <p><em>Associate Professor of Finance of the AACSB Accredited Graduate School of Business of the <strong>University of Puerto Rico</strong>.</em><strong>  </strong></p>", 
    "end_date": null, 
    "title": "The Tax Advantaged Investor: A Definitive Guide to PR Taxes!", 
    "price": 0, 
    "instructors": "Dr. Scott Brown, Daniel Hall, Dave Watkins, Gadiel Ramirez, Darwin Morales", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662996_ee8d_4.jpg", 
    "course_url": "https://www.udemy.com/university-of-puerto-rico-mba-student-act-20-act-22-course/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-07T13:42:07Z"
}