{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Swing trading is too time consuming and risky.</p>  <p>Investing is too slow and brings low yields.</p>  <p>The solution for the investor/trader who wants a happy middle-ground? Position Trading!</p>  <p>My name is Damon Verial and I'd like to ask you to come with me on a journey as I take you from a beginner to an experienced position trader in three steps!</p>  <p>Over 3,500 students are already enrolled in my other trading courses and have left mainly five star reviews. </p>  <p>Why?</p>  <p>Because I teach - in a fun way - how to trade stocks successfully.</p>  <p><strong>Are you ready to </strong><strong>become a position trader</strong><strong>?</strong></p>  <p>This course assumes no previous experience, and takes you from the absolute beginner concepts such as showing you the tools you need to pick stocks, determine the future direction of a stock, and decide when to sell your stock.</p>  <p>All the essential stock fundamentals and technicals are explained in three quick-start lectures.</p>  <p>At the end of this course, you will have a system to successfully position trade stocks on the market, guaranteed or your money back!</p>  <p>Don't worry if you’ve never traded stocks before. I always answer individual questions my students have. Just ask me via the discussion forum and I’ll walk you through any concepts you find confusing. </p>  <p>Be sure to check the promo video to ensure this course is right for you.</p>  <p>As your instructor, I have over 12 years of teaching experience and have brought a $3,000 account to over $30,000 in under two years!</p>  <p>In short, I consider myself an expert trader but also have the relatively unique ability to make teaching fun and easy. </p>  <p><strong>Don't worry, I might be a</strong><strong>n</strong><strong> </strong><strong>academic</strong><strong>, but I do make </strong><strong>trading </strong><strong>fun and painless for you to learn!</strong></p>  <p>Not convinced? Just go and take a read of some of the rave reviews given to me on my other courses. </p>  <p>The facts are that students love my courses and style of teaching, because it helps them reach their goals faster.</p>  <p>Enroll now to start your journey as a position trader!</p>", 
    "end_date": null, 
    "title": "The Complete Position Trading Course: Position Trading Stock", 
    "price": "45.00", 
    "instructors": "Damon Verial", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723510_b24d.jpg", 
    "course_url": "https://www.udemy.com/position-trading-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T04:54:22Z"
}