{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>(Course Updated by June 13, 2016)</p>\n\n<p><strong>NOTICE</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>✪ Learn the Proven Trading Strategy to Help You <strong>Generate a 50% Annual Return from the Stock Market By Just Making 1 Trade a Week </strong>- Take this course Now!<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em><em>⋅</em></em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>➲ <em>Join a Community of <strong>2102</strong><strong>+ Successful Students</strong> Who Have Already Started Making Money Online by Trading the Stock Market.</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>⋅</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>☆☆☆☆☆ Welcome to<strong> The Complete Chart Pattern Trading</strong><strong> Course</strong> ☆☆☆☆☆</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Are you tired of living paycheck to paycheck? Have you ever wanted to find a new stream of income that will bring you more freedom and help you build a better financial life?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You know what...investing in stocks is a real legitimate way to do so!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>But...! It's not as easy as it sounds...<strong>You can only make a good living from the stock market if you follow the right investment strategy.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this Powerful Stock Trading Training Course, I will not hide anything...I'll show you exactly <strong>how you can possibly make the 50% annual return by just making 1 trade a week.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>No more than 4 trades a month! - This simply means...you don't have to sit in front of the screen all day.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And a good news is that...this trading strategy requires no initial trading skills and experience. Everyone can learn and apply the strategy to make money from the stock market.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Financial education is truly crucial to not only the investors but to every single person who wants to get closer to their financial freedom. So, if you have a dream of retiring early or you want to stay financially free, you will need financial education. <strong>This Essential Stock Trading Course will be a shortcut for you to cut down your education time and help you build a better financial life.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>⋅</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em></em><em><strong>❝ The greatest investment you can make is to invest in yourself! ❞</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em><em>⋅</em></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>➲ <em>In just 3 hours, you will learn...</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><em>How to <strong></strong><strong>Create an Amazing New Source of Passive Income</strong> by Trading Stocks From Home </em></li><li><em>How to <strong>Generate 50% Annual Returns</strong> by Just Making 1 Trade a Week </em></li><li><em>How to <strong></strong><strong>Take Advantage of My Trading Experience</strong> to Make Smart and Easy Profits </em></li><li><em>How to <strong>Develop a Strict Trading Plan and Stick with It to Make Consistent Profits</strong></em></li><li><em>How to <strong>Avoid being Affected by Your Trading Emotions</strong> - Key to Your Success!</em></li><li><em>How to <strong>Use Support and Resistance</strong> to Make Better Investment Decisions</em></li><li><em>How to <strong>Manage Your Risks and Take Calculated Risks</strong></em></li><li><em>How to <strong>Manage Your Money Effectively</strong> When Trading in the Stock Market<strong></strong></em></li><li><em>How to <strong>Use Chart Patterns to Pick High Earnings Potential Stocks</strong> <strong></strong></em></li><li><em>How to <strong>Set Up a Trading Account to Practice Trading Stocks</strong> </em></li><li><em>How to <strong>Take Full Control of Your Finances</strong> When Trading<strong></strong></em></li><li><em>How to <strong>Effectively Manage Your Portfolio</strong> by Using Portfolio Management Spreadsheet<strong></strong></em></li><li><em>And much more...!</em></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>⋅</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>➲ <em>What is more?</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>You will get a lifetime access to this course, without any limits!</li><li>The course will keep updating frequently, and of course all future updates are absolutely FREE if you enroll today!</li><li>Get dedicated supports from the course Instructors and the learning community anytime you need!</li><li><strong>You ALWAYS get a 30-DAY FULL-MONEY BACK GUARANTEE</strong><em>, so don't hesitate to give yourself a chance to learn new things by just taking this course now!</em></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>⋅</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>➲<em> The smart traders are using the same technique to enrich themselves, and you can learn it too </em>- <strong>ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "The Complete Chart Pattern Trading Course: A Proven Approach", 
    "price": "50.00", 
    "instructors": "Wealthy Education", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564966_aebd_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-trading-stocks-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T08:41:20Z"
}