{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The Advanced Forex Course for Smart Traders is based on the careful study and application of the principles and practices of the famous \"Market Wizards\". </p><p>The Market Wizards are the elite traders and investors interviewed by Jack D. Schwager in his Market Wizards series of books.</p><p>This includes great traders such as Richard Dennis, Van K. Tharp, Tom Basso and Ray Dalio.</p><p>In this Forex course we have isolated what it is these top traders do, and how they think and present it to you in a week-by-week lesson format.</p><p>Here are the twenty lessons:</p><ul><li>The power of beliefs and how they shape your trading</li><li>The 25 beliefs of highly successful traders and how to model them</li><li>The scientific path to financial freedom</li><li>How to develop a compelling model of the forex market</li><li>How to get an edge and trade like the “house”</li><li>How to set objectives that let you risk less and win big</li><li>Why it's through position sizing that you achieve your trading goals</li><li>The key to Forex system development: market types</li><li>Damn good Forex set-ups</li><li>How to stalk a “low risk /high reward” entry point</li><li>How your stops get hunted and what to do about it</li><li>Trading what's in-front of you with a complex exit strategy</li><li>Trading after the trade: advanced trade management techniques</li><li>How to run your trading business like a hedge-fund</li><li>How to avoid system death for good.</li><li>How to develop the master trader mindset</li><li>The one secret the world's top trading psychologist recommends</li><li>How trading is a game and you make the rules</li><li>Constructing advanced position sizing algorithms</li><li>The 12 daily tasks of top Forex traders</li><li>How to get in the trading zone like an elite athlete</li><li>Writing your trading plan and executing your strategy</li></ul>", 
    "end_date": null, 
    "title": "The Advanced Forex Course for Smart Traders", 
    "price": 0, 
    "instructors": "Sam Eder", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614472_9613_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-forex-course/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T05:05:52Z"
}