{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>My name is Andrew, and I am the creator the the Complete Financial Model Builder Course.</p><p>I have over 2 financial degrees and over 20 years&#039; financial experience. I have always enjoyed financial modelling, and I want to share my knowledge with you. </p><p>I have taken a different approach to other courses in financial models; I go through 7 models in order to teach a range of model building skills.</p><p>We go through 7 financial models:<br style=\"\"></p><ol style=\"\"><li>Financial Model Basics - you learn the basics of financial models</li><li>Beyond The Basics - best practice, working capital, balance sheets and cash flows</li><li>Debt Equity Model - equity calculations and debt calculations incorporated into a model</li><li>Investment Scenario Model - a model for investments that includes multiple scenarios</li><li>Corporate Scenario Model - a full corporate model that incorporates multiple scenarios</li><li>Capital Investment Appraisal Model - a model for evaluating a capital investment</li><li>Pricing Model - a model for determining optimum pricing to customers.</li></ol><p>We go through many different company types: Pet Food Wholesaler, Clothing Wholesaler, Chemical Manufacturer, Investment Fund, Platinum Mine,Electricity Provider and an Office Equipment Company.</p><p>If you are a </p><ul style=\"\"><li>business owner</li><li>manager</li><li>finance professional or</li><li> business student </li></ul><p>and want to learn all-round financial model building skills, then this course is for you.</p><p>By the end of the course, you will be able to<br style=\"\"></p><ul style=\"\"><li>build accurate models</li><li>understand all essential Excel formulas and functions for financial models</li><li>create flexible models for multiple scenarios</li><li>adapt your skills to a variety of industries and requirements.</li></ul><div style=\"\"><br style=\"\"></div><div style=\"\">In summary, this is one of the best value-for-money courses on financial models.</div><div style=\"\">Hope to have you as a student soon.</div><div style=\"\">Regards</div><p>Andrew</p>", 
    "end_date": null, 
    "title": "The Complete Financial Model Builder Course-Build 7 Models", 
    "price": "25.00", 
    "instructors": "Andrew de Bruyn", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429952_285c.jpg", 
    "course_url": "https://www.udemy.com/the-complete-financial-model-builder-course-build-7-models/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T14:19:55Z"
}