{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>New York, New York (Time Magazine), Monday, May 25, 1959, 12:00:00 EDT</em><br></p>\n\n\n\n<p><strong>RE: A Financial Documentary of the Astounding Success of Nicolas Darvas</strong></p>\n\n\n\n<p>Dear <strong>stock investor</strong>,</p>\n\n\n\n<p>It was the last early <strong>summer</strong> of the 1950s.</p>\n\n\n\n<p>The Darvas brother and sister <strong>dance team</strong> were as entrenched in the media then as Circe de Soleil is today. Their <strong>graceful</strong> dances delighted television viewers in Europe and America. </p>\n\n\n\n<p>The Darvas name was regarded with <strong>respect</strong> in show business circles in Las Vegas, New York, Toronto and far overseas. Nicolas Darvas had <strong>cemented</strong> his name in the public conscious as one of the best dancers worldwide.   </p>\n\n\n\n<p>Celebrities were shocked when a full page article in <strong>Time Magazine</strong> covered Nicolas not as a dancer but as a rich stock investor \"<em>who ignores tips, financial stories and broker’s letters</em>.\" This was followed with a 1960 <strong>book</strong> entitled, “<em>How I Made $2,000,000 In The Stock Market.</em>”   The book fell out of favor when <strong>business schools</strong> began teaching that the market could not be beaten by reasoned analysis. </p>\n\n\n\n<p><strong>And by The Way, He Made $2.5 Million in 6.5 Years.</strong></p>\n\n\n\n<p>Away from the <strong>public</strong> hidden underneath arcane math exists recent evidence from the very top of investing that Darvas was correct.  See ** Moskowitz, T., Cliff Asness and Lasse Pedersen, “<em>Value and Momentum Everywhere</em>,” Journal of Finance (2012).  </p>\n\n\n\n<p><strong>World class performance</strong> comes from world class brains.  Darvas studied at the <strong>University of Budapest</strong> — the most erudite of Hungary. </p>\n\n\n\n<p>He was <strong>trained</strong> not just in classical dance but also as an economist. </p>\n\n\n\n<p><strong>Economics</strong> paid less than dance.  But he was a brilliant <strong>scholar</strong> with precise organization. </p>\n\n\n\n<p>This <strong>allowed</strong> him to precisely document his agonies and elations on a trade-by-trade basis, “<em>I decided I had been missing a good thing all my life. I made up my mind to go into the stock market.  I have never gone back on this decision.</em>”                 <strong>-Nicolas Darvas </strong></p>\n\n\n\n<p><strong>Learn What Worked from A Major State University Finance Professor!</strong></p>\n\n\n\n<p>You can read his book but will you really <strong>understand</strong> it?  <strong>Not likely</strong>.</p>\n\n\n\n<p>I don’t want to push your <strong>buttons</strong>.  I am just <strong>pointing</strong> out that most of my adult life has been a sole minded dedication to mastering finance.  </p>\n\n\n\n<p>Just read my <strong>Udemy profile</strong>.  I am a <strong>finance professor</strong> at a major state university — The University of Puerto Rico Graduate School of Business.  We are the leading <strong>business school </strong>in the Caribbean. </p>\n\n\n\n<p><strong>Look Over My Shoulder as I Dissect Nicolas Darvas’ Secrets For You …</strong></p>\n\n\n\n<p>Thousands of <strong>MBA students</strong> grasp the deepest principles of finance in my classes.  They work in <strong>diverse</strong> industries from pharmaceuticals to Wall Street.  </p>\n\n\n\n<p>I train these <strong>professional</strong> financial managers. And I can train you to go <strong>toe-to-toe</strong> against the wolves of Wall Street. </p>\n\n\n\n<p><strong>Level the playing field</strong> with the skills you will learn in this course.  And you will <strong>improve</strong> over the years to come.</p>\n\n\n\n<p>I am your <strong>ultimate financial coach</strong>.  I know how to <strong>guide you</strong> through chunks of financial knowledge that are hard for all.</p>\n\n\n\n<p>That’s because I have <strong>trained thousands</strong> of young adults in finance. Let me guide you through the <strong>black forest</strong>.</p>\n\n\n\n<p><strong>Here Are The 25 School of Hard Knocks Worst Challenges for Beginning Stock Investors …</strong></p>\n\n\n\n<p>Nicolas Darvas faced many of the <strong>same challenges</strong> at the start that I have.  That is part of the reason that his <strong>classic book</strong> rings so true for so many stock investors in-the-know today.  Here is a sample of difficulties Darvas had to <strong>overcome</strong>.  </p>\n\n\n\n<p><strong>CHALLENGE #1: BLIND LUCK.</strong> The first profit in stocks Darvas <strong>landed</strong> was not from his own thought process making him naively believe investing was easy.   </p>\n\n\n\n<p><strong>CHALLENGE #2: GOSSIP.</strong> Nicolas Darvas in realizing that he knew nothing about stocks seeks the wisdom of random strangers leading to a <strong>chaotic</strong> portfolio from asking “<em>Do you know a good stock?</em>”</p>\n\n\n\n<p><strong>CHALLENGE #3: MISFEASANCE.</strong> Neither <strong>casual</strong> acquaintances in his travels nor brokers know the secret to making money in stocks.</p>\n\n\n\n<p><strong>CHALLENGE #4: COSTS.</strong> Brokerage <strong>commissions</strong> and transfer taxes decimate the initial stock market returns of Nicolas Darvas — and he realizes he must control them.   </p>\n\n\n\n<p><strong>CHALLENGE #5: OVER-TRADING.</strong> Darvas fidgets for fast profits spreading his stake between upwards of thirty stocks — degrading control and <strong>tracking</strong> while ramping up account depleting fees.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #5: LOSER-LOVE.</strong>  Nicolas became attached to particular stocks giving him the proclivity of holding loss <strong>exploding</strong> falling shares. </p>\n\n\n\n<p><strong>CHALLENGE #6: GAMBLERS-ANNONYMOUS.</strong>  On stage this trained dancer was the pinnacle of disciplined control. Chasing a <strong>fast buck</strong> over-trading stocks was quickly losing him two hundred dollars a day.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #7:  GURUS.</strong>  Nicolas Darvas was <strong>attracted</strong> to advisory service that made speculation sound like a snap and fed his need for urgently making money fast but recommended falling stocks. Have you been spending hundreds or even thousands on investment newsletter financial advisory services?  If so, you have probably asked yourself, “<em>where are all those hundred percent returns promised in the glossy marketing?</em>” </p>\n\n\n\n<p><strong>CHALLENGE #8: DATES. </strong>The <strong>famous</strong> dancer does not know when to enter the market.  This pulls eleven thousand dollars <strong>down</strong> to five thousand eight hundred.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #9:  TIPS. </strong>A broker offers up advice in the form of a <strong>safe</strong> stock based on fundamentals — that drops.  Brokers are <strong>bad</strong> for advice as well.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #10:  PROJECTION. </strong>Darvas is quick to <strong>blame</strong> his broker for mistakes truncating his ability to learn.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #11: IGNORANCE. </strong>Even the greatest dancer in the world is a <strong>dunce</strong> without an understanding of the jargon making it hard for Nicolas to communicate clearly with his broker — remember that this was before online trading and retail stock investors had to have a broker. <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #12:   VISION.  </strong>Nicolas Darvas quickly <strong>realizes</strong> that he cannot see the strongest trees in the forest and sets out to find the most strongly rising stocks.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #13: LIQUIDITY. </strong>Darvas has a hard time reselling his small stocks in the chaotic discontinuously trading over-the-counter (<strong>OTC</strong>) market.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #14: INSIDE-IDIOTS. </strong>The Hungarian trained economist gone world class classical dancer begins tracking inside trades of the largest <strong>executives</strong>.  He quickly finds that insiders don’t know any more about the direction of the stocks of the firms they manage than you do! And we confirmed this “too-late-too-soon” factoid in Brown, S., Cao-Alvira, J. &amp; Powers, E. (2013). Do Investment Newsletters Move Markets? Financial Management, Vol. XXXXII, (2), 315-338.<strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #15: OVER-CONFIDENCE. </strong>Fundamental <strong>filtering</strong> as is done widely with Value-Line leads Nicolas into the limbo land of false-hope.<strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #16: REGRET-AVOIDANCE. </strong>If Darvas were alive today, he would be <strong>glued</strong> to the screen for fear of a loss on his stock.  He wastes <strong>massive</strong> amounts of energy over-monitoring his equity returns.</p>\n\n\n\n<p><strong>CHALLENGE #17: TOPPING-OUT. </strong>Buying into the very top of a run burns <strong>Nicolas</strong> out so he focuses on price consolidations he terms “<em>boxes</em>.”</p>\n\n\n\n<p><strong>CHALLENGE #18: EXHAUSTION. </strong>Chasing stocks just <strong>because</strong> they rise brings his attention too late by the time the broker calls. <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #19: COIN-FLIP. </strong>Making more on profitable trades than is lost on losers becomes his mantra as he realizes that he is <strong>never</strong> better at picking a winner than a simple coin toss — but that is pretty darn good!  </p>\n\n\n\n<p><strong>CHALLENGE #20: DATA. </strong>Darvas realizes that he <strong>must</strong> have access to high quality data on not just price but also volume.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #21: PAPER-TRADE-THIS.  </strong>Nicolas eventually figures out that paper trading gets him nowhere — he has to be <strong>emotionally</strong> involved.  <strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #22: DIONYSUS. </strong>In embracing the central truth that stocks owned and watched make <strong>unexplained</strong> price collapses — and in so realizing understands that he is as knowledgeable as any guru.<strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #23: TAX-PARALYSIS.</strong></p>\n\n\n\n<p>Many people hold on to stocks for more than a year for a lower tax rate on capital rather than <strong>short-term</strong> gains.  He decides that he has to sell even if the <strong>taxes</strong> on his gains will he higher.  </p>\n\n\n\n<p><strong>CHALLENGE #24: BUY-&amp;-CRUMBLE. </strong>Holding stocks for <strong>very long periods of time</strong> doesn’t work for Nicolas Darvas — buy-&amp;-hold strategies he decides are for gamblers,<strong></strong></p>\n\n\n\n<p><strong>CHALLENGE #25: CYCLE. </strong>Nicolas notices that stocks cycle from small to large in and <strong>out of fad</strong> creating even less predictability.  </p>\n\n\n\n<p>Darvas was gifted enough to find his own way up and out into the light from deep within his initial darkness in <strong>Plato’s cave</strong> with secrets he willingly shared to those even unborn who could understand.</p>\n\n\n\n<p><strong>Here’s 15 Cures for The 25 Worst Challenges for Stock Investors …</strong></p>\n\n\n\n<p><strong>CURE #1:  TABLES. </strong>Tracking the <strong>relationship</strong> between volume and price allowed Darvas to identify stocks with sudden explosions of volume.  <strong></strong></p>\n\n\n\n<p><strong>CURE #2:  MOMENTUM. </strong>Simply <strong>buying</strong> stocks that are rising saves Nicolas Darvas.  <strong></strong></p>\n\n\n\n<p><strong>CURE #3:  TRADING-VOLUME. </strong>The highest money makers are stocks with <strong>fast</strong> rising prices on accelerating volume.  <strong></strong></p>\n\n\n\n<p><strong>CURE #4: BUSINESS. </strong>Darvas treats his stock investing as a <strong>business</strong> by giving it the required attention.  <strong></strong></p>\n\n\n\n<p><strong>CURE #5: CHANNELS. </strong>Trend consolidations map entry and exit <strong>points</strong> for Darvas.<strong></strong></p>\n\n\n\n<p><strong>CURE #6: BUY-STOP. </strong>Runaway stocks are captured from above by a simple limit <strong>stop</strong> buy order.  <strong></strong></p>\n\n\n\n<p><strong>CURE #7:  SELL-STOP. </strong>A simple sell limit stop-order saves Nicholas Darvas from being <strong>wrong</strong> half of the time.  <strong></strong></p>\n\n\n\n<p><strong>CURE #8:  TEST-PURCHASE. </strong>Test purchase of 4 or fewer stocks work for Nicholas Darvas like risk cutting little experimental oil wells in <strong>wildcatting</strong>.  <strong></strong></p>\n\n\n\n<p><strong>CURE #9: GODZILLA. </strong>A slumping stock market can stomp out even the strongest stock with the same dynamic as when <strong>Bambi Meets Godzilla</strong> in 1969 — watch the classic movie on YouTube for more.  <strong></strong></p>\n\n\n\n<p><strong>CURE #10: BOTTOM-LINE. </strong>Sharply up trending earnings foretell the strongest of the strong rising stocks on <strong>pumped</strong> <strong>up</strong> volume.<strong></strong></p>\n\n\n\n<p><strong>CURE #11: NEWCOMERS. </strong>Overtime the most important hunting ground for Darvas is new industries — these are more important than <strong>specific products</strong> within those sectors.  <strong></strong></p>\n\n\n\n<p><strong>CURE #12:  MARGIN. </strong>Leverage dramatically increases the portfolio beta and the gain for Nicolas Darvas — today we use <strong>deep in the money call options</strong>.<strong></strong></p>\n\n\n\n<p><strong>CURE #13: SAFETY. </strong>A critical rule becomes the resolute decision to never feed passive losses with <strong>active income</strong>.  <strong></strong></p>\n\n\n\n<p><strong>CURE #14: ENTITY. </strong>Nicolas Darvas could have used a <strong>corporate structure</strong> to reduce taxes — learn more inside. <strong></strong></p>\n\n\n\n<p><strong>CURE #15: ISOLATION. </strong>Independent thought becomes the saving grace for Darvas he can only find through <strong>solitude</strong> as he stops all gossip and chat calls.  <strong></strong></p>\n\n\n\n<p>Once Darvas <strong>understood</strong> what worked he began to reap huge benefits…</p>\n\n\n\n<p><strong>Nab These 5 Advantages of Curing the 25 Worst Stock Investing Challenges</strong></p>\n\n\n\n<p><strong>ADVANTAGE #1:  SCHOOLED. </strong>Develop a broad <strong>financial vocabulary</strong> to condense investment data into your Holy grail to finding the fastest rising momentum stocks. <strong></strong></p>\n\n\n\n<p><strong>ADVANTAGE #2:  CONCENTRATION. </strong>Focusing on no more than <strong>ten [10]</strong> stocks at a time kept Nicolas Darvas attentive to just his most worthwhile finds.  <strong></strong></p>\n\n\n\n<p><strong>ADVANTAGE #3:  PROFICIENCY. </strong>Mastering a compact group of essential skills gives you <strong>massive advantages</strong> as was so for our dancing economist. <strong></strong></p>\n\n\n\n<p><strong>ADVANTAGE #4:  PEACE. </strong>Maturity as a stock investor brings the <strong>wisdom</strong> of simply reversing, and learning from, mistakes.  This gives you an unexpected benefit of having your <strong>safety net</strong> in place. <strong></strong></p>\n\n\n\n<p><strong>ADVANTAGE #5:  WORTH.</strong></p>\n\n\n\n<p>And just as Akhrot becomes the <strong>richest man in Babylon</strong> so did Nicholas Darvas continue to enrich himself with the knowledge herein.  </p>\n\n\n\n<p>Read some of these <strong>rave words</strong> about this course and the way I teach...</p>\n\n\n\n<p>“<em>I started by taking a finance refresher with Robert Schiller’s openYale course on Financial Markets. Then through a book recommendation for How I Made $2,000,000, I came across your Nicholas Darvas course which I thoroughly enjoyed. I think its your teaching style coupled with the simplistic message of volume, earnings, and making decisions as an individual that intrigue me. My finance courses in the past would teach you about equations and fundamentals, but you never encounter any real coaching on how to effectively invest.</em>” -<strong>Gavin Ripley, MBA North Carolina; March 15, 2015</strong></p>\n\n\n\n<p> “<em>Listening to the Darvas Lecture with my 15-year-old now.  He is developing an interest in the markets without me ever even talking about it.  You are the perfect teacher for all ages.</em>” <strong>-Jeff</strong></p>\n\n\n\n<p>“<em>You are a great teacher, mentor and writer. I wish i could articulate my gratitude for you, but I would fail miserably. To put in the present day vernacular- YOU ROCK MAN! So PLEASE keep on rockin. Well, I'm going to go...I'm getting all misty.</em>” <strong>-T-Bone</strong></p>\n\n\n\n<p><strong>Enroll now</strong> while this course tuition is just $19!</p>\n\n\n\n<p>This is a <strong>no brainer</strong> win-win-win for you since Udemy gives you a 30 day full money back guarantee.  They ask <strong>no questions</strong>.  And if you like this course you get to <strong>learn</strong> from me for life! </p>\n\n\n\n<p><strong>Time Waits for Nobody! </strong></p>\n\n\n\n<p>I wish I could just <strong>plug</strong> a cord into your head and download everything to your mind directly and permanently in a few seconds.  <strong>But I can’t</strong>.  </p>\n\n\n\n<p>This material will take you time to <strong>learn</strong>.  The longer you wait to learn this the more opportunities you will have <strong>missed</strong>.  </p>\n\n\n\n<p><strong>Enroll Now to Super-Charge your Investment Education! </strong></p>\n\n\n\n<p><strong>-Scott</strong></p>\n\n\n\n<p><em>Dr. Scott Brown, Associate Professor of Finance of the AACSB Accredited Graduate School of Business of the University of Puerto Rico</em></p>\n\n\n\n<p><strong>P.S.</strong> The tuition of this course will <strong>rise</strong>.  Don’t wait <strong>enroll now</strong>.  </p>\n\n\n\n<p><strong>P.P.S.</strong> As my community grows my time per student naturally <strong>diminishes</strong>.  Get the <strong>most</strong> out of my teaching while you can! </p>", 
    "end_date": null, 
    "title": "The Nicolas Darvas Momentum Method Stock Market Code: Proven", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674354_f405_5.jpg", 
    "course_url": "https://www.udemy.com/mastering-darvas-how-i-made-2000000-in-the-stock-market/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T11:41:21Z"
}