{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Accounting is the \"language of business\" and critical for anyone involved in the world of business to understand, including business and accounting students, small business owners and financial professionals. But accounting can be counter intuitive, difficult to comprehend and discouraging to study.  My name is Tim Burns and to say that I struggled with accounting was an understatement. I had a very difficult time with basic accounting and even though I receive an MBA in accounting and passed the CPA exam, my poor foundation doomed me to fighting through the material by brute force instead of more easily following  its logical progression.  It was only after i began teaching accounting at a college level that the critical accounting fundamentals finally sunk in.</p>\n\n<p>I realized that my own accounting students were struggling, but that effective visuals, instead of crowded slides of confusing columns and texts, significantly enhanced their ability to understand accounting fundamentals.  I eventually developed a completely animated course featuring a unique character, the Accounting Whiz Kid.  The Whiz Kid is that bright student who encourages his classmates to learn with a friendly, encouraging tone as well as effective visuals, which utilize real-world accounting examples and offers concise and useful illustrations. The fundamental accounting equation and introductory material are presented in an entertaining and easy to follow format that deftly uses \"visual learning\" techniques in addition to \"verbal learning.\"  Visual learners remember best what they \"see,\" e.g. pictures and animations and \"verbal learners\" obtain more knowledge from words.  Everyone learns more when the information is presented visually and verbally.</p>\n\n<p>In this course you will learn:</p>\n\n<p>Fundamental accounting equation:  Assets = Liabilities + Owners Equity (so important to maser this concept which is the basis of the business organization)</p>\n\n<p>Accounting debits and credits </p>\n\n<p>Double entry method of bookkeeping</p>\n\n<p>Revenue and expense items</p>\n\n<p>Recording accounting ransactions</p>\n\n<p>Preparing trial balance</p>\n\n<p>Preparing Adjusting entries</p>\n\n<p>Preparing financial statements</p>\n\n<p>Balance sheets</p>\n\n<p>Income statements</p>\n\n<p>Statements of owner's equity</p>\n\n<p>Cash Flow statements </p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Visual Learning Basic Accounting Course", 
    "price": "20.00", 
    "instructors": "MBA, CPA, Attorney at Law Tim Burns", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811534_e775_2.jpg", 
    "course_url": "https://www.udemy.com/the-visual-learning-basic-accounting-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-03T15:14:56Z"
}