{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">VOLUME ANALYSIS AND TRACKING SMART MONEY</strong></p>   Volume is perhaps the most under-rated indicator in the markets. Volume shows the activities of the big hedge funds and proprietary desk traders,  players we often refer to as <strong style=\"\">\"smart money\". </strong>Good volume analysis shows critical points at which markets turn around, when activity levels are low or high or when smart money is active or inactive. In this course, we analyze various stock charts, and combine volume analysis with price action. Volume also provides a storyline to the markets. Constructing this storyline correctly is critical in terms of trade entry and exits.   <p>Smart Money or Big money has always tried to (legally) manipulate  the markets to their advantage. Their goals are to conceal their activities as much as possible. But Volume is one indicator they cannot conceal. In many ways, this course levels the playing field for the average retail investor. Once you take this course, you'll know what to look for, and you'll be in a position to track smart money as they're entering a Stock or they're running for the exits. And your objective is to \"follow the smart money\". When you position your trades in harmony with the money flows of smart money, you're adding a whole layer of high-probability characteristics to your investing activities.</p>    <p>This is an exciting course ! </p>  <h5>What you will master</h5>    <ul style=\"\">  \t<li>Why is Volume the most under-rated indicator</li>  \t<li>Identify the activities of smart money precisely</li>  \t<li>\"Swim with the tide\" - increase your odds of success</li>  \t<li>How to read long term and shorter term charts</li>  \t<li>Identify points of major market reversals (before they happen)</li>  \t<li>What is Distribution and Accumulation</li>  \t<li>Put short term price action in context of longer term charts</li>  \t<li>All of this explained in simple terms</li>  \t<li>Study of various charts on various timeframes</li>  </ul><div style=\"\">  <p><strong style=\"\"><br style=\"\">  </strong></p>  </div>    <h5>SECTION I</h5>  <p>In this Section, we explore why Volume is a critical indicator to study, and why this is the only indicator that clearly shows the activities of Smart Money. What can Volume analysis tell us about activity levels in the markets. Volume is sometimes referred to as the \"fuel of the markets\", and this is very true. This Section also defines some of the rules of \"Smart Money\". These rules form the basis for the games and that Smart Money play, and the tactics they deploy to manipulate the markets to their advantage.</p>  <p> </p>  <h5>SECTION II</h5>  <p>This section is a deep-dive into the methodology for spotting and tracking \"Smart Money\" using Volume analysis. A perfect timeframe for analyzing these activities was during the period preceding the financial crisis of 2007/2008 and the period after the bottom in March 2009. And there is no better instrument to study this than the S&amp;P 500 Index itself. This section is a fascinating and shocking analysis of how we could spot Smart Money doing the following - </p>  <p>- Start selling in March 2007, about 6 months before the top in October 2007</p>  <p>- They sold (\"distributed\") for about 9 months with barely a move in price</p>  <p>- Ran the bear market down to their liking</p>  <p>- Start \"accumulating\" stock by the end of 2008</p>  <p>- Finished accumulation phase over a period of 9 months</p>  <p>- Are running the Bull market right now to their liking</p>  <p> </p>  <h5>SECTION III</h5>  <p>Detailed case studies of major stocks analyzing Smart money activity points - </p>  <p>1) BIDU - Smart Money is in, and they are not leaving</p>  <p>2) CAT - Similar to BIDU but more choppiness</p>  <p>3) FSLR - Gave a clear signal of smart money entry</p>  <p>4) NFLX, PCLN and FXE - Gave various signals for entry and exit</p>  <p>5) Silver Case study - Smart Money left Silver and has not come back yet.</p>", 
    "end_date": null, 
    "title": "The Basics Of Volume Analysis", 
    "price": "30.00", 
    "instructors": "Hari Swaminathan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42642_9ba5_9.jpg", 
    "course_url": "https://www.udemy.com/volume-analysis-basis/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-20T21:49:15Z"
}