{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">“All intelligent investing is value investing – acquiring more than you are paying for.”</em> - <strong class=\"redactor-inline-converted\">Charlie Munger</strong><br></p>\n\n<p>The above quote seems a little too simple doesn't it? After all, we've always been told investing in stocks is too risky... Or the only way you can proper in the stock market is with luck. But what if I told you there is a long line of successful investors who have followed common sense principles and earned well above-average returns for years and years? Well... It's true. <em class=\"redactor-inline-converted\">And the best part is, all of the principles are geared for individual investors who want to break free from the shackles of financial advisors, mutual funds, low-interest saving accounts, and below-average returns.</em></p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">**The Complete Investing Guide is a course designed for you, the </strong><strong class=\"redactor-inline-converted\">individual investor**</strong></p>\n\n\n\n\n\n\n\n<p>This course will teach you the principles great investors such as <em class=\"redactor-inline-converted\">Warren Buffett, Charlie Munger, and Peter Lynch</em> have used for decades to earn great returns and achieve financial freedom.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Great for Beginners and Advanced Students as well!!</strong></p>\n\n\n\n\n\n\n\n<p>You will start out learning the basics of stocks, the stock market, and personal finance. This guide explains what stocks are and why they're the best investment option to achieve financial freedom. <em class=\"redactor-inline-converted\">You'll also learn reasons why you should invest for yourself</em>, including how fund managers tend to average or underperform the market and why financial advisors advise you to trade too often.<br></p>\n\n\n\n\n\n\n\n<p>This guide dives much deeper however, and by the end you will be able to: </p>\n\n\n\n\n\n\n\n<ul><li>Thoroughly analyze financial statements as well as interpret financial ratios </li><li>Calculate the <strong>intrinsic value</strong> of a company with over <em class=\"redactor-inline-converted\">9 different methods</em></li><li>Generate successful investing ideas and find high-return stocks</li><li>Buy and sell stocks as the right time and with the right strategy</li><li>Manage your own portfolio and <em class=\"redactor-inline-converted\">produce above-average returns</em></li><li><em class=\"redactor-inline-converted\">And much more</em></li></ul>\n\n<p><strong>I will always be available for questions, comments, and discussions</strong><br></p>\n\n\n\n\n\n<p>I genuinely pride myself in being an individual investor and my goal is to ensure you become successful and achieve financial independence by yourself. Check out my bio and you will see I have a website and products that are dedicated to helping people like yourself save money, invest, and become financially <em>FREE</em>.</p>\n\n\n\n\n\n<p><strong>So what are you waiting for? Click \"Take this Course\" to begin learning how to achieve FINANCIAL FREEDOM</strong><br></p>", 
    "end_date": null, 
    "title": "The Complete Investing Guide: How to Beat Wall Street", 
    "price": "50.00", 
    "instructors": "Chris Gilbert", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722274_4f9d_9.jpg", 
    "course_url": "https://www.udemy.com/the-complete-investing-guide-how-to-beat-wall-street/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T22:43:51Z"
}