{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Bored with stocks? Expand your trading activity to the new areas.<br></p><p><strong>Learn All the Basics of the Futures and Options on Futures to Level Up Your Trading Knowledge and Skills.</strong><strong></strong><br></p><ul><li>Learn how to trade on financial markets almost around a clock.</li><li>Find out about leverage and low margin to increase your ROI significantly.</li><li>Make trades on bear markets the same way as on bull markets.</li></ul><p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong>Money Never Sleeps. And Your Money Should Not Sleep Either.</strong><br></p><p>You may ask, why trade futures? What are the advantages of futures against the stocks? Stocks are trading on New York Stock Exchange (NYSE) only six and a half hours per day, from 9:30 AM till 4 PM.</p><p>On the other hand, futures are trading on Chicago Mercantile Exchange (CME) almost around the clock, so you can make profits even during Asian or European session, when America sleeps.</p><p>Using the leverage of low margin requirements on futures contracts, you can double your investment in futures at the same time when stocks give you only 5% profit.</p><p>Besides futures, there are options on futures. They can give you much more profit much faster.<br></p><p>-------------------------------------------------------------------------------------------------------------------<br></p><p><strong>Content and Overview</strong></p><p>First part of this course is dedicated to the introduction to futures market. You'll learn what are futures, where are they traded. You'll know about two main categories of futures contracts: commodity futures and financial futures.</p><p>This course will show you the real-world example of using the futures by farmers to hedge their crops from price decline.</p><p><strong><em>Each lecture has closed captions (subtitles) for international students.</em></strong></p><p><strong><em>This course will be updated regularly with new lectures.</em></strong></p><p>-------------------------------------------------------------------------------------------------------------------</p><p><strong>Warning:</strong> Options and futures involve the risk of substantial loss and are not suitable for everyone. An investor should understand these risks before trading. You should only invest with risk capital.</p>", 
    "end_date": null, 
    "title": "The Beginner's Guide to the Futures and Options Trading", 
    "price": 0, 
    "instructors": "Dennis Chirkovsky", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716828_f6d1_6.jpg", 
    "course_url": "https://www.udemy.com/futures-options/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T09:57:33Z"
}