{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Did you miss the meteoric rise of Bitcoins value?</em></strong></p><p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Do you wonder if another cryptocurrency can surpass Bitcoin?</em></strong></p><p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Maybe you’ve heard about the rise of Ethereum and want to get involved?</em></strong></p><p>Whatever your motivation to become an early adopter of the hottest cryptocurrency currently on the scene, Ethereum, you’ve come to the right place to get started.</p><p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">The Complete Ethereum Course: Get 0.1 Ether In Your Wallet</em></strong>, is the most focused Ethereum course on the web focusing solely on getting you started with Ethereum, and gaining maximum value from it.</p><p>It’s the one place with everything you need to get started with Ethereum through the path of least resistance, and become an early adopter who has the chance to experience its rise in value, which you may have missed with Bitcoin.</p><p>This is an <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">effective and practical course that will take you from zero knowledge on Ethereum, to becoming an active early adopter who uses the cryptocurrency for a wide range of purposes.</em></strong></p><p>While there are plenty of theoretical Ethereum PDF guides on the web, it’s hard to find a focused Ethereum video course like this one that is updated regularly, and on top of that is instructed by someone who has a great understanding of the cryptocurrency world.</p><p>Nothing is kept a secret. <strong><em>I revel everything about Ethereum, and all the hidden opportunities within this emerging cryptocurrency. I will also be adding new lectures to this course at no extra cost!</em></strong></p><p>This course is designed for anyone who wants to become an early adopter of the emerging cryptocurrency, Ethereum. So if you’ve just heard of Ethereum, or if it has been on your radar for a while but you haven’t yet got involved, you’re in the right place to jump in.</p>", 
    "end_date": null, 
    "title": "The Complete Ethereum Course: Get 0.1 Ether In Your Wallet", 
    "price": "20.00", 
    "instructors": "Ravinder Deol", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/859742_e075_3.jpg", 
    "course_url": "https://www.udemy.com/ethereum/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-25T15:56:27Z"
}