{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"text-align: center;\">  \t <strong style=\"\">Startup Finance: Valuation</strong>  </p>  <p style=\"text-align: center;\">  \t<strong style=\"\"></strong><strong style=\"\">If you are ever only going to take 1 class then let this be the class you take!</strong>  </p>  <hr style=\"\">  <p style=\"\">  \t <span style=\"text-decoration: underline;\"><strong style=\"\">About:</strong> Learn how to value a startup.</span>  </p>  <hr style=\"\">  <p style=\"\">  \t   More than likely your next big opportunity will come from a Startup. Learn how to value a startup by attending this startup finance class. Startups have a global financial impact. Don’t miss out on the next big opportunity and learn how to value a startup before its too late. More than likely in the near future you will either work for, invest in or consult with a startup. Understanding the nature of startup valuation is key to success within the financial world. Startup Finance fuels global economic activity and lies at the core of all financial success. Take this revolutionary finance class and learn from the best.  </p>  <hr style=\"\">  <p style=\"\">  \t   Finance is a powerful global force and valuation lies at its core. Valuation makes or breaks a company. It is critical to understand valuation as an investor, entrepreneur, consultant and employee.  </p>  <hr style=\"\">  <p style=\"\">  \t   There are many circumstances in which valuation is critical:  </p>  <p class=\"MsoNormal\" style=\"\">  \t <strong style=\"\">A.</strong> You are looking to raise funding for your company.  </p>  <p class=\"MsoNormal\" style=\"\">  \t <strong style=\"\">B.</strong> You are looking to invest in a startup.  </p>  <p class=\"MsoNormal\" style=\"\">  \t <strong style=\"\">C.</strong> You are looking to work for a startup and your success is tied to the startup’s success.  </p>  <p class=\"MsoNormal\" style=\"\">  \t <strong style=\"\">D.</strong> You are about to get paid in equity.  </p>  <p class=\"MsoNormal\" style=\"\">  \t <strong style=\"\">E.</strong> You are interested in selling your business.  </p>  <hr style=\"\">  <p class=\"MsoNormal\" style=\"\">  \t   This class is focused on startup valuation with entrepreneurial and non-public valuation needs in mind. We cover concepts such as pre-money, post money valuation and valuation equations used for private companies. We will be looking at Startup Valuation from the financial perspective. You can expect to walk away with a few equations and ideas on how to make financial projections.  </p>  <hr style=\"\">  <p class=\"MsoNormal\" style=\"\">  \t   This class is ideal for entrepreneurs, investors and anyone interested in working for or with a private company. Attendees to this seminar will walk away with a better understanding of the valuation process.  Attendees can expect to walk through a financial example of valuation.  </p>  <hr style=\"\">  <p style=\"\">  \t <span style=\"text-decoration: underline;\"><strong style=\"\">Testimonials:</strong></span>  </p>  <p style=\"\">  \t <em style=\"\">“This is one of the best finance classes I have ever taken.”</em>  </p>  <p style=\"\">  \t <em style=\"\">- Andrew</em>  </p>  <p style=\"\">  \t <em style=\"\">“I took the “Startup Finance Valuation” class; excellent job. This class is a must for all entrepreneurs. MBA classes do not teach how to value a startup, this class does.”</em>  </p>  <p style=\"\">  \t <em style=\"\">- Danny</em>  </p>  <p style=\"\">  \t <em style=\"\">“After taking this class I have a clear perspective on valuation. I recommend this class to all entrepreneurs. Thank you for a very informative class.”</em>  </p>  <p style=\"\">  \t <em style=\"\">- Bonnie</em>  </p>  <p style=\"\">  \t <em style=\"\">“I have been in banking for over 20 years and this class taught me valuable concepts not covered by all the classes I have taken throughout my career.”</em>  </p>  <p style=\"\">  \t <em style=\"\">- Yaakov</em>  </p>  <hr style=\"\">  <p class=\"MsoNormal\" style=\"\">  </p>", 
    "end_date": null, 
    "title": "The Art Of Financial Valuation With Certificate", 
    "price": "20.00", 
    "instructors": "Startup Saturdays", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86558_c707_6.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-think-like-a-financier-leadership-in-finance/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-01T00:00:24Z"
}