{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>BRAND NEW!</strong></p>\n\n<p><strong>We're going to show you how to understand the numbers that lie at the heart of every organisation.</strong></p>\n\n\n\n<p>With this programme we're going to give you a <strong>simple guide</strong> to the core elements of finance that all organisations use to report and manage their results. If you ever have conversations about finance and feel even slightly out of your depth, then this introduction to the <strong>Fundamentals of Finance</strong> is for you.</p>\n\n\n\n<p>Have you ever been in a position where you’re talking about your <strong>P&amp;L</strong>, and had nagging doubts about what you were talking about? Have you ever used terms like <strong>EBIT</strong> or <strong>NPV</strong> without really understanding what they are or what they mean? Do you see mysterious <strong>financial transactions</strong> happening that affect your results, but you don’t know how (or if) you can affect them? If any of these are true, this course will remove those doubts and raise your understanding. You’ll be smarter, sound smarter, and be able to make <strong>better, faster decisions</strong> as a result.</p>\n\n\n\n<p>This course is Part 1 in a forthcoming series called The Fundamentals of Finance, and will be the foundation stone upon which to build your development as a rounded manager and leader in your organisation.</p>\n\n\n\n<p><strong>Let's get going! </strong></p>", 
    "end_date": null, 
    "title": "The Fundamentals Of Finance For Non-Finance Professionals", 
    "price": "40.00", 
    "instructors": "Lammore Consulting", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/835212_1513.jpg", 
    "course_url": "https://www.udemy.com/finance-for-nonfinance/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-29T10:31:15Z"
}