{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Time Management &amp; Emotional Balance Must For Financial Traders</strong></em>   </p><p><em><strong>Emotional Balance is desirable for financial traders</strong></em></p><p>Emotional balance is within your reach—when you cultivate the intelligence of both your body and mind.</p><p>Emotional balance is the ability of the mind and body to maintain equilibrium and flexibility in the face of challenge and change. Emotional balance promotes physical health, and is a prerequisite for personal well being and growth.</p><p>We might find ourselves “locked\" in any number of negative states; such as anger, fear, worry, dissociation, self-sabotage or depression; agitation, impulsivity, anxiety, panic attacks and sleep trouble; lack of drive and motivation, or poor concentration. These stuck emotions run just below the level of consciousness, intangible yet often overwhelming. These uncomfortable emotions can dominate our thinking process and give rise to inappropriate reactions that impair our ability to be at our best.</p><p><strong><em>If their is depression in stocks ,It sounds like a bad dream. Financial meltdown. Global markets in chaos. Government bails out banks and other financial institutions in worst crisis since the depression.</em></strong></p><p>What a roller coaster it's been emotionally. Certainly there have been a few positive trends but lots of negatives that could mean serious consequences down the road. The questions start racing into a blur. What's going to happen next? Is it time to get out? Have I really hit the bottom? Will I be able to recover if the numbers don't improve quickly?</p><p>No we're not just talking about the economy<em><strong>; we're talking about an alarming visit with your doctor. </strong></em>Hopefully this hasn't happened yet. <strong><em>But it probably has happened to someone you know, maybe even someone you work with.</em></strong></p><p>This course will help you  <strong>manage your time effectively.<br><em></em></strong></p><p><strong><em>achieve an emotional balance,</em></strong></p><p><strong><em>minimize anger and </em></strong></p><p><strong><em>has a glimpse on factors affecting emotional balance </em></strong> <br></p>", 
    "end_date": null, 
    "title": "Time Management & Emotional Balance Must For Forex Traders", 
    "price": 0, 
    "instructors": "Harris Crystal's Smart Academy", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595854_3798_2.jpg", 
    "course_url": "https://www.udemy.com/emotional-balance-very-desirable-must-for-financial-trader/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T11:44:50Z"
}