{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">June 26, 2015 update:  New sections, lectures and resources have been posted including an audio question and answer section based on student questions.  There&#039;s never been a better time start.  ENROLL NOW!</strong></p><p>May 31, 2015 update:  The price of the course is going to be increased in 2 weeks and will go up to $297 on June 14, 2015.  This reflects updated content, additional lectures, and bonus resources.  Sign up now to get the upgrades at a lower price. </p><p><strong style=\"\">________________________________________________________________________</strong></p><p><strong style=\"\">Learn the right approach to profitable trading in only 3 hours!</strong></p><p>By the end of this course, you will be able to backtest any stocks/futures/Forex trading or investing idea with no money!  Avoid claims of overnight riches and holy grail strategies.  Find out what works without exposing your hard earned cash to danger.</p><p><strong style=\"\">TRADING TACTICS</strong>: Get Proof of Trading Profits With No Risk</p><p>Aimlessly buying and selling in the markets with hope and fear is useless and downright dangerous.  Learn to be strategic.  Understand the probabilities.  Test your trading systems...  and only then start trading your valuable money.  This course shows you how.</p><p><strong style=\"\">Hundreds of students have already felt the benefits</strong> of the must-know material in this course. <em style=\"\">Are you going to be next? </em>Don&#039;t get left behind.</p><p>Nothing is held back in this course. I share my <strong style=\"\">wisdom from decades of trading</strong> and the little-known tips of other successful traders. As an added bonus, this course will continue to grow as new sections are added <strong style=\"\">- at no extra cost to you!</strong></p><p>In addition to the Udemy 30-day guarantee, you have my personal assurance that the only regret that you will have is that <strong style=\"\">you&#039;ll wish you had found it earlier</strong>.</p><p>&quot;<em style=\"\">Give a man a fish and feed him for a day. Teach a man to fish and feed him for a lifetime</em>&quot;</p><p>This is the fishing <strong style=\"\">lesson of a lifetime!</strong></p><p>You need to get this course right now. If you already trade, invest or own any stocks, <em style=\"\">you might already be at risk</em>.</p><p><strong style=\"\">Every minute you delay exposes you to unnecessary and unwanted risk...</strong></p><p><strong style=\"\">Sign up now!</strong></p>", 
    "end_date": null, 
    "title": "TRADING TACTICS", 
    "price": "30.00", 
    "instructors": "Triumph At Trading", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419308_0c2f_3.jpg", 
    "course_url": "https://www.udemy.com/trading-tactics/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T14:53:16Z"
}