{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wanted to make money from the market? <br style=\"\"><br style=\"\">How many strategies have you tried ?<br style=\"\"><br style=\"\">How many times did you fail?<br style=\"\"><br style=\"\">Well, i don't know you but the more strategies you have tried, the more you will love this one. Why? Because you will recognise the power of this strategy in comparison to the mojority of strategies out there. Some examples?<br style=\"\"><br style=\"\">Does your strategy give you precise entry,exit and profit point? Even Before entering the trade?<br style=\"\">Does you strategy give you fixed rules you need to follow in order to be consistent in your trading?<br style=\"\">Does your strategy allow you to backtest it to see if it's profitable?<br style=\"\"><br style=\"\"><br style=\"\">If the answer is \"no\" to one of these questions...well i don't know you strategy so i can't say<br style=\"\">it's worse than mine but...about the first 2 questions if you don't have fixed rules that allows you to trade always in the same way you won't succeed because being consistent is the key of being succesful. No matter what strategy you use.<br style=\"\"><br style=\"\">Talking about the last one, if you don't know personally that a strategy is profitable, why are you using that strategy? You basicly don't know where you are putting your money. More over, if you don't test your strategy you won't be confident that it's profitable and you will give up at the first negative streak.<br style=\"\"><br style=\"\">Probably you have never thought about these things...but it's not your fault. They want you to only think about the money. Because if you focus on the money you don't think about the really important things in trading:<br style=\"\"><br style=\"\">Discipline<br style=\"\">Money Mangement<br style=\"\">Costancy in the trading method<br style=\"\"><br style=\"\">So which strategy allows us to be profitable and has specific trading rules to be consistent?<br style=\"\"><br style=\"\">The Harmonic Pattern!<br style=\"\"><br style=\"\">Here they are some features:<br style=\"\"><br style=\"\">They have a high % of success.<br style=\"\">Patterns don't follow the market, they anticipate it.<br style=\"\">They have well defined rules that eliminate confusion and indecision.<br style=\"\">You don't have to know/guess which is the market trend. Nobody knows!<br style=\"\">They help you to be consistent with their rules.<br style=\"\">Entry,stop and targets are precisely calculated. No more guessing.<br style=\"\">They works on every timeframe and market.<br style=\"\"><br style=\"\">Even though the patterns are about 5-6 we will only focus on the last one dicovered that is quite unknown. Why ? Because in my opinion is the best one: <br style=\"\"><br style=\"\">It completes often.<br style=\"\">Has a winning % of about 70%.<br style=\"\">It's probably the easiest to recognize.<br style=\"\"><br style=\"\">You just need one pattern to make profit from the market; you don't need them all, you just need more corruncies (because i'm a forex trader).<br style=\"\"><br style=\"\">Once you have learnt this pattern you will be able to find high propability invertion areas without the need of knowning where the price is going to go because we anticipate the market, we don't chase it as many strategies do.<br style=\"\"><br style=\"\">But of course, as i said, the strategy is not enough and that's why you will learn also everything you need to be profitable in the long run!<br style=\"\"><br style=\"\">If you don't have a profitable strategy or if you are looking for one then the patterns will probably be the last one you learn, as it happenend to me . Trust me!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Trading Strategies: Predicting the Market with Patterns", 
    "price": "50.00", 
    "instructors": "Trading Patterns", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/431910_0577_2.jpg", 
    "course_url": "https://www.udemy.com/forex-trading-just-one-pattern-to-become-profitable-and-indipenent/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-25T11:26:41Z"
}