{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wondered how ordinary people manage to trade at seemingly extraordinary levels?</p><p>Why do some traders succeed whereas others fail given the exact same trading strategy?</p><p>What do the winners KNOW that's different? What do the winners DO that's different? </p><p>It really boils down to some simple rules.</p><p>And they will all be revealed to you in this concise and powerful course!</p><p>If you are looking to improve your trading, if you want to improve your profitability, if you want to take your trading to the next level, <strong style=\"\">this course is absolutely for you</strong>.</p><p>Just listen as you get a map for building a powerful trader mindset which also helps navigate the minefield of common pitfalls.</p><p>No empty promises, no grandiose overnight rags-to-riches tales, no disappointments.</p><p>Just a simple and easy to understand roadmap of to get your trader psychology on the winning side of a profitable plan.</p><p>Give yourself the gift by enrolling right now. Successful traders invest in themselves.</p><p>Every trade that you take without this course puts you at danger of generating losses that just weren't necessary.</p><p><strong style=\"\">Join the thousands of students that have enjoyed massive improvement through Triumph At Trading courses like this one.</strong></p>", 
    "end_date": null, 
    "title": "TRADING PSYCHOLOGY: Trading Mindset Mastery", 
    "price": "25.00", 
    "instructors": "Triumph At Trading", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610890_2a56_3.jpg", 
    "course_url": "https://www.udemy.com/trading-psychology-trading-mindset-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T17:16:15Z"
}