{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are You Gambling Everything on a Doomed Forex Trading System?</strong><br></p>\n\n<p><strong><em><strong><em>Updated Monday, May 23, 2016, 10:41 A.M.</em></strong></em><br></strong></p>\n\n\n\n\n\n\n\n<p>Dear fellow <strong>Advanced Forex Trader</strong>, </p>\n\n\n\n\n\n\n\n<p>Don’t get me <strong>wrong</strong>. I <strong>understand</strong> why you are trying to program your way through the Forex market. </p>\n\n\n\n\n\n\n\n<p>Before we had <strong>automated</strong> systems <strong>Bruce Kovner</strong> made himself and his hedge fund investors rich in Forex. Kovner cued on <strong>trader</strong> <strong>sentiment</strong> combined with key <strong>support</strong> and <strong>resistance</strong> levels as he explains in the <strong>New York Times Bestselling</strong> classic book ”<strong>Market Wizards</strong>” by <strong>Jack Schwager</strong>. </p>\n\n\n\n\n\n\n\n<p>The book reports that Kovner made over <strong>$300 million</strong> for himself and his hedge fund way back in 1987 alone. And that “<em>Two thousand dollars invested with Kovner in early 1987 would have been worth over $1,000,000 ten years later</em>.”</p>\n\n\n\n\n\n\n\n<p>Kovner explains in his interview with Schwager that he tries to <strong>know</strong> everything about the market to get an edge. He employed human personal <strong>assistants</strong> who watched market monitors 24 hours for breakouts into new lows or highs.</p>\n\n\n\n\n\n\n\n<p>Bruce Kovner further explains that parts of <strong>technical analysis</strong> such as chart analysis are where it is at.</p>\n\n\n\n\n\n\n\n<p>“<em>Technical analysis tracks the past; it does not predict the future. You have to use your own intelligence to draw conclusion about what the past activity of some traders may say about the activity of other traders.</em>”</p>\n\n\n\n\n\n\n\n<p><strong>Is This You?</strong></p>\n\n\n\n\n\n\n\n<p>Your <strong>problem</strong> is that you are poorly trained by somebody who has attended enough Forex trading conferences to sound sufficiently credible to lure you in. You have been trading programs written by these other people as <strong>canned</strong> robots. </p>\n\n\n\n\n\n\n\n<p>And when you put their <strong>robots</strong> into play all heck blows up. </p>\n\n\n\n\n\n\n\n<p>This Udemy training teaches you the same Harvard studied <strong>scientific</strong> approach Bruce Kovner learned. </p>\n\n\n\n\n\n\n\n<p>I am <strong>Dr. Scott Brown</strong>. I am a professor at a <strong>major state university</strong>. </p>\n\n\n\n\n\n\n\n<p>I hold a Ph.D. in finance from the <strong>University of South Carolina</strong>. And I have obtained a master’s degree in international management from <strong>Thunderbird</strong> in Forex trading and international financial management. </p>\n\n\n\n\n\n\n\n<p>Thunderbird is routinely #1 ranked by the <strong>U.S. News and World Report</strong>. And I have decades of actual money-on-the-line trading <strong>experience</strong>. </p>\n\n\n\n\n\n\n\n<p>Among the many <strong>benefits</strong> of completing this training you will start from the big picture and work through each scenario. </p>\n\n\n\n\n\n\n\n<p>Once you have your carefully planned <strong>Forex trading system</strong> thought out you will discover how easy it is convert it into an automated self-learning robot.</p>\n\n\n\n\n\n\n\n<p>Your <strong>robot</strong> can trade the Forex market when you are away from your screen. </p>\n\n\n\n\n\n\n\n<p>This <strong>Forex trading robot</strong> will trade for you whilst you sleep. And it will <strong>cover your back</strong> when you are out of your office. </p>\n\n\n\n\n\n\n\n<p>“<em>I contacted Dr. Brown through email and learned he was teaching an online course that would help steer me in the right direction. He talked about using stop losses, money management, timing and fundamentals. I had never before paid any attention to these things. I just want you to know Dr. Brown things have really turned around for me and it’s all about knowing the right people and having the right tools. Thank you so very much</em>.” -<strong> Charlie White    6/1/2015</strong></p>\n\n\n\n\n\n\n\n<p>Enroll now for <strong>lifetime membership</strong> in this organically growing course that evolves and adapts to your learning needs over time!</p>\n\n\n\n\n\n\n\n<p>You enjoy a <strong>30-day money back</strong>, no questions asked guarantee fulfilled by third party Udemy staff. </p>\n\n\n\n\n\n\n\n<p>How much is every ticking second forward in your life <strong>worth</strong>? Every day that passes is a <strong>missed opportunity</strong> to learn from our <strong>crack Ninja squad</strong> of <strong>Forex trading trainers</strong>: Lan, Carlos and me. </p>\n\n\n\n\n\n\n\n<p><strong>Enroll</strong> now! </p>\n\n\n\n\n\n\n\n<p>We are <strong>waiting inside</strong> to train you in proper robotic forex trading procedures. <strong>Truly</strong> yours, <br><strong>-Scott</strong></p>\n\n\n\n\n\n\n\n<p><strong>Dr. Scott Brown</strong></p>\n\n\n\n\n\n\n\n<ul><li><em>Associate Professor of Finance of the AACSB Accredited Graduate School of Business of the University of Puerto Rico</em></li></ul>\n\n\n\n\n\n\n\n<p><strong>P.S. WARNING:</strong> Your education is a <strong>precious</strong> commodity. Don’t <strong>squander</strong> this opportunity. Enroll now! </p>\n\n\n\n\n\n\n\n<p>Close with a Reminder</p>\n\n\n\n\n\n\n\n<p><strong>P.P.S. Tick</strong>, tock. Tick, <strong>tock</strong>. Life is a <strong>wasting</strong>? Enroll <strong>now</strong>! </p>", 
    "end_date": null, 
    "title": "Trading Robot Forex Programs in Your Sleep in Live Examples!", 
    "price": "20.00", 
    "instructors": "Dr. Scott Brown, Carlos Vila, Lan Turner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674352_700d_2.jpg", 
    "course_url": "https://www.udemy.com/trading-robot-forex-programs-in-your-sleep-in-live-examples/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T11:39:11Z"
}