{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">ATTENTION</strong> Stock Traders, Option Traders, Forex Traders, And Anyone Else Who Wants To Trade Like A Pro!  </p>  <p style=\"\">  \t      You are about to learn exactly <strong style=\"\">WHICH</strong> trades to take, <strong style=\"\">WHEN</strong> to take them, and <strong style=\"\">HOW</strong> to Manage them for maximum profit...in <em style=\"\">ANY</em> market and <em style=\"\">ANY</em> time frame.  </p>  <p style=\"\">  \t      Here Is What You Get With <strong style=\"\">CHART PATTERN PROFITS:</strong>  </p>  <ul style=\"\">  \t<li>15 Power-Packed Lectures...No Fluff, No Filler</li>  \t<li>A <strong style=\"\">COMPLETE TRADING SYSTEM</strong> That Will Teach You How To Set Up Low-Risk, High-Probability Trades</li>  \t<li>A Focused, Tactical, Comprehensive Strategy</li>  \t<li>Risk Control For Setting Up One Profitable Trade After Another</li>  \t<li>The Same System Used To Make Over $500,000 In The Financial Markets</li>  \t<li>A Definitive HOW-TO For Trading Any Chart</li>  \t<li><strong style=\"\">Your Instructor Promptly Responds To ALL Questions And Forum Posts</strong></li>  \t<li><strong style=\"\">PERFORMANCE GUARANTEE:</strong> You will acquire a trading skill which will enable you to locate low-risk, high-probability trades and make consistent profits trading any market that can be charted</li>  </ul>  <p style=\"\">  \t<strong style=\"\">CHART PATTERN PROFITS</strong> is brought to you by Stock Trading NINJA - voted one of &quot;Best Of Udemy&quot; 2014  </p>  <p style=\"\">  \t      Many students cover the cost of my courses in a a trade or two. <strong style=\"\">CHART PATTERN PROFITS</strong> is no different!  </p>  <p style=\"\">  \t      This course is designed for students of ALL LEVELS. In this detailed training, I am going to teach you exactly how to recognize, set-up, enter and manage high-probability trades...one after another.  </p>  <ul style=\"\">  \t<li>No guessing</li>  \t<li>No stress</li>  \t<li>No confusing and conflicting indicators</li>  </ul>  <p style=\"\">  \t      I will show you how to trade like a Wall Street insider and make massive profits, no matter if the market goes up, down or sideways. Based on over <strong style=\"\">25,000 </strong>hours of screen trading experience, this is a proven system for making consistently profitable trades.  </p>  <p style=\"\">  \t      You will learn all the tricks, from the role of randomness in the markets (that few traders recognize), to characteristic trend patterns pointing to huge profit potential, to SPECIFIC <strong style=\"\">PRICE ACTION SETUPS</strong> that take the guesswork and stress out of consistent application.  </p>  <p style=\"\">  \t      I will teach you exactly how to effortlessly manage all your trades. You will learn all the best ways to systematically make the biggest gains, with &#039;risk-based&#039; games, price-action, and intuitive trade management.  </p>  <p style=\"\">  \t      My proven strategy works for ANYONE regardless of experience or technical knowledge. Furthermore, it can be used on stocks, commodities, Forex or <em style=\"\">ANY</em> liquid security that can be charted. This simple, highly-profitable trading system can generate amazing profits consistently, safely and reliably.  </p>  <p style=\"\">  \t<strong style=\"\">CHART PATTERN PROFITS</strong> quickly and easily allows anyone to find profitable trades.  </p>  <p style=\"\">  \t      From lecture to lecture, I take you by the hand and show you how to trade like a pro:  </p>  <ul style=\"\">  \t<li>How my structured trading approach protects you from serious loss</li>  \t<li>Why monitoring trend strength helps you maximize profits</li>  \t<li>How to read price action and gauge momentum</li>  \t<li>How to calculate risk BEFORE you enter the market to size your positions and manage your account</li>  \t<li>Why you need a tactical, systematic approach to trading the markets</li>  </ul>  <p style=\"\">  \t      And when I am finished, you will be able to:  </p>  <ul style=\"\">  \t<li>Pre-screen the quality of the setups to avoid bad trades</li>  \t<li>Know the preliminary risk amount on each and every trade</li>  \t<li>Set up trades with limited risk and unlimited profit potential</li>  \t<li>Know when a trade is behaving so you can sit for big gains or get out fast</li>  \t<li>Avoid getting caught in a bear market ever again</li>  </ul>  <p style=\"\">  \t      The accuracy and reliability of <strong style=\"\">CHART PATTERN PROFITS</strong> means you will be:  </p>  <ul style=\"\">  \t<li>Confident in your ability to evaluate the trade setup</li>  \t<li>Relaxed because you know the maximum risk before entering the trade</li>  \t<li>Avoiding bad trades more often!</li>  </ul>  <p style=\"\">  \t      You will also receive a <strong style=\"\">CHART PATTERN PROFITS BONUS</strong> - Detailed logic and script definitions for use in:  </p>  <ul style=\"\">  \t<li>Broker Scanning Platforms</li>  \t<li>Third-Party Software Tools</li>  \t<li>Custom Algorithm Programming</li>  </ul>  <p style=\"\">  \t  This means you will be able to find new trading opportunities FAST. I am able to scan thousands of stocks and dozens of liquid Forex pairs in minutes to find the best trade candidates quickly and easily.  </p>  <p style=\"\">  \t      This is an ONGOING EDUCATIONAL COURSE which will be updated regularly with new lectures - giving traders tools and strategies to launch successful trading businesses.  </p>  <p style=\"\">  \t<strong style=\"\">CHART PATTERN PROFITS</strong> comes with a 30-DAY MONEY BACK GUARANTEE. Test it out, see how well it works for you. And enjoy all the benefits and profits that come with stress-free trading.  </p>  <p style=\"\">  \t      Based on 20 years of experience with real-world &#039;in the trenches&#039; trading, I guarantee by the end of the training you will possess the skill set of a veteran trader with all the information you need to profit from recurring chart patterns.  </p>  <p style=\"\">  \t      Even if you have already tried and failed with other trading systems, I will show you exactly how to make consistent profits with laser-targeted precision.  </p>  <p style=\"\">  \t      Why try to learn how to trade on your own?  </p>  <p style=\"\">  \t      Get a comprehensive system and trade plan you can use IMMEDIATELY to profit.  </p>  <p style=\"\">  \t      Let a 20-year veteran of the trading game guide you step-by-step through the process.  </p>  <p style=\"\">  \t<strong style=\"\">CHART PATTERN PROFITS</strong> is a must-have for anyone who wants to consistently profits from the financial markets.  </p>  <p style=\"\">  \t  Get started on your path to creating a successful trading business by signing up for this course NOW!  </p>  <p style=\"\">  \t<strong style=\"\">Includes:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Lifetime Access To Course</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Video Module Training Center</strong>  </p>  <p style=\"\">  \t<strong style=\"\">30 Day Money Back Guarantee</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Access To 7-Figure Stock Trader</strong>  </p>", 
    "end_date": null, 
    "title": "Trading Chart Patterns For Immediate, Explosive Gains", 
    "price": "20.00", 
    "instructors": "Frank Bunn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403100_638a_10.jpg", 
    "course_url": "https://www.udemy.com/trading-chart-patterns-for-immediate-explosive-gains/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T19:18:32Z"
}