{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">ATTENTION</strong> ! Are you thinking about trading but you are too busy with your Job to be many hours per day in front of your charts to screen the markets and take any move like the pro?</p><p style=\"\">You are about to learn that trading is not necessarely a full time job.</p><p style=\"\"><strong style=\"\">You are about to learn exactly how to be a trader while keeping and not disturbing your Job, and WHICH</strong> trades to take, <strong style=\"\">WHEN</strong> to take them, and <strong style=\"\">HOW</strong> to Manage them for maximum profit...in <em style=\"\">ANY</em> market.</p><p style=\"\">This course is about to: </p><p style=\"\"><strong style=\"\">-Teach you how to trade despite busy days</strong></p><p style=\"\"><strong style=\"\">-help beginners intermediates and experts Traders</strong> identify the best trades available in the market using outstanding strategies based on big timeframes. </p><p style=\"\">Many of the &quot;trading systems&quot; available today make many promise to bring in thousands of pips, points and ticks a day! First this is a ridiculous false claim, and second, our trading style is not one of those scam systems.</p><p style=\"\">We take a more &quot;investment-minded&quot; approach to analyze the markets using large time periods in order to spot the main future direction of the market, and take trades in that sense using outstanding strategies.</p><p style=\"\">Meaning that this trading strategy can be the base of any other trading strategy and style you use to trade the markets. It can help the swing and day trader, but also the active scalper, to decrypt the probable future trend of the market, and take his trades in that sense to dramatically increase the success rate.</p><p style=\"\">This course is designed <strong style=\"\">for students of ALL LEVELS</strong>.</p><p style=\"\"></p><p style=\"\">Here Is What You Get With <strong style=\"\">TRADING FOR BUSY PEOPLE</strong></p><ul style=\"\"><li style=\"\">24 Power-Packed Lectures...No Fluff, No Filler, <strong style=\"\">and more to come</strong> in the examples section</li><li style=\"\">A Focused, Tactical, Comprehensive Strategy</li><li style=\"\">Risk Control For Setting Up One Profitable Trade After Another</li><li style=\"\">A Definitive HOW-TO For Trading Any Chart</li><li style=\"\"><strong style=\"\">Your Instructor Promptly Responds To ALL Questions And Posts</strong></li><li style=\"\">A Definitive &quot;How To&quot; For Anyone Who Wants To Make Money Trading while being busy with a day job.</li><li style=\"\"><strong style=\"\">PERFORMANCE GUARANTEE:</strong> You will acquire a trading skill which will enable you to locate low-risk, high-probability trades and make consistent profits trading any market that can be charted</li></ul>", 
    "end_date": null, 
    "title": "Trading For Busy People", 
    "price": "50.00", 
    "instructors": "josias kere", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498360_c153_3.jpg", 
    "course_url": "https://www.udemy.com/trading-for-busy-people/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T17:36:12Z"
}