{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have You Ever Wished Trading Could Be As Simple As Finding A Setup Today That Makes Money Tomorrow?</strong></p><p>Welcome To <strong>TRADING INSIDE BARS</strong>.</p><p>Learn Exactly <strong><em>HOW</em></strong> To Trade And Manage One Of The Most<strong> <em>POWERFUL</em></strong> And Misunderstood Chart Patterns.</p><p>Here Is What You Get With <strong>TRADING INSIDE BARS:</strong></p><ul><li>12 Value-Packed Lectures + 4 On-Screen Tutorials</li><li>100% HOW-TO Instruction</li><li>A Focused, Tactical, <strong>COMPLETE TRADING SYSTEM</strong></li><li>The Ability To Trade Markets That Are Moving And Profitable</li><li>The Same System Used By A Former Student To Average $600 Per Day</li><li>Your Instructor Promptly Responds To ALL Questions And Forum Posts</li><li><strong>PERFORMANCE GUARANTEE:</strong> You will acquire a trading skill which will enable you to locate low-risk, high-probability trades and make consistent profits trading any market that can be charted.</li></ul><p><strong>TRADING INSIDE BARS</strong> is brought to you by Stock Trading NINJA - voted one of the \"Best Of Udemy\".</p><p>If you are serious about making money trading, you are about to take a journey that will change your life. </p><p>Trading is a skill with life-long benefits including financial independence and self-mastery. </p><p>This is a definitive guide to trading the INSIDE BAR pattern. </p><p>This course will enable you to master timeless market mechanics and pull money from the financial markets over and over again. </p><ul><li>No guesswork</li><li>No stress</li><li>No \"hope and dream\"</li></ul><p>Your instructor has spent two (2) decades, over 25,000 hours of screen analysis and trading experience, to uncover the secret to trading this simple, recurring and completely misunderstood chart pattern - the <strong>INSIDE BAR.</strong><span></span></p><p><strong>The secret to cracking the INSIDE BAR code lies in the fact that different inside bar patterns signify DIFFERENT technical characteristics in terms of price action and fundamental market dynamics. </strong></p><p>I will guide you step-by-step through the learning curve, saving you hundreds of hours of trial-and-error and wasted time. You will learn everything you need to know:</p><ul><li>The four (4) KEY attributes to a winning INSIDE BAR trade</li><li>Proper chart tools and how to use them effectively</li><li>Technical requirements that produce consistency</li><li>How to determine trends like a seasoned professional</li><li>Setup, risk-control and trade management strategies and tactics</li></ul><p>Plus you get four (4) <strong>ON-SCREEN TUTORIALS.</strong> Look over my shoulder as I guide you through the process every step of the way:</p><ul><li>Configuring system chart tools</li><li>Configuring chart layouts for maximum efficiency</li><li>How to properly analyze the INSIDE BAR pattern </li><li>Intensive training on trade setup and management</li><li>How to know when to scalp quick profits and when to sit for big gains</li></ul><p>The ideal student has basic price-chart experience, is an existing stock, FOREX or options trader - OR an entrepreneur with a willingness to learn and a drive to succeed in the trading business.</p><p>You will also receive a <strong>TRADING INSIDE BARS BONUS: </strong>Detailed logic and script definitions for use with the TC2000 software platform. This logic can be easily configured to work for:<br></p><ul><li>Broker Scanning Platforms</li><li>Third-Party Software Tools</li><li>Custom Algorithm Programming</li></ul><p>This means you will be able to find new trading opportunities FAST. I am able to scan thousands of stocks and dozens of liquid Forex pairs in minutes to find the best trade candidates quickly and easily. Now you can, too.</p><p><strong>TRADING INSIDE BARS</strong> comes with a 30-DAY MONEY BACK GUARANTEE. Test it out, see how well it works for you. And enjoy all the benefits and profits that come from mastering the INSIDE BAR chart pattern.</p><p>I designed this course to turn amateurs into PROFESSIONALS and make struggling traders consistently PROFITABLE.</p><p><strong>Stock Trading NINJA students can use this course to improve their systems.</strong></p><p> Mastery of the INSIDE BAR pattern is a skill set that every screen trader should possess.</p><p><strong>TRADING INSIDE BARS</strong> is a must-have for anyone who wants to take their trading game to the next level.<br></p><p>Why try to learn how to trade on your own?</p><p>Get a comprehensive system and trade plan you can use IMMEDIATELY to profit.</p><p>Let a 20-year veteran of the trading game guide you step-by-step through the process.</p><p>Enroll NOW in <strong>TRADING INSIDE BARS.</strong> Find setups today, make money tomorrow!</p><p><strong>Includes:</strong></p><p><strong>Lifetime Access To Course</strong></p><p><strong>Video Module Training Center</strong></p><p><strong>30 Day Money Back Guarantee</strong></p><p><strong>Access To 7-Figure Stock Trader</strong></p>", 
    "end_date": null, 
    "title": "Trading Inside Bars - Master 1 Easy Pattern To Be Successful", 
    "price": "20.00", 
    "instructors": "Frank Bunn", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411168_ce88_2.jpg", 
    "course_url": "https://www.udemy.com/trading-inside-bars-find-setups-today-make-money-tomorrow/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T17:48:54Z"
}