{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The <strong>Independent Investor Course</strong> is for anyone interested in <em>Trading </em>and <em>Investing </em>in financial markets using <em>Technical Analysis</em> as a primary tool for forecasting the markets. </p><p>If you...</p><ul><li>Want to know where the Stock Market is heading ?! (how Apple or Microsoft stocks will perform in the future) </li><li>Want to know what will be the strongest currency next year?! (USD or EUR in FOREX)</li><li>Want to invest in GOLD or other commodities?!</li><li>Want to find out which is the next important level where DOW JONES will react?!</li></ul><p> Than this course will give you the tools to find out your answers!</p><p>See how I make more than <strong>10% profit in a week</strong>! LIVE trading records! Using correctly TrendChannels you may make an average of <strong>50% profit</strong> per year!<br></p><p>In this course students will get familiarized with the basics of trading and by the end of the course they will be able to construct <strong><em>TrendChannels</em> </strong>for any kind of financial instrument, finding in this way where the market is heading, and from where it is better to enter or exit the market for <em>consistent profit.</em></p><p><strong>Trend channels</strong> follow the market trend from both a <em>price </em>and <em>time </em>perspective. At the core of these channels are harmonic <em>Gann </em>angles and <em>Elliott </em>wave structures. But we will keep this course <strong>easy to understand</strong> and we will show you how to draw only those trendlines that have been confirmed by the market.<br></p><p>This course is very <strong>practical </strong>and <strong>visual </strong>oriented, with lots of examples and charts, easy to understand by anyone interested in this field. You can also discover some LIVE trading records.</p><p>Also..</p><ul><li>you have unlimited lifetime access at no extra costs, ever;</li><li>all future additional lectures and bonuses in this course are always free;</li><li>full 30 day money-back guarantee;</li><li>support along the lectures for any question.</li></ul><p><strong>Take this course now</strong> and became an Indepedent Investor!<br></p>", 
    "end_date": null, 
    "title": "Trading for everyone - The Independent Investor Course ", 
    "price": "45.00", 
    "instructors": "Cristian Chilianu", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598266_a48a_7.jpg", 
    "course_url": "https://www.udemy.com/trading-for-everyone-the-independent-investor-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T14:18:34Z"
}