{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>*Course fully updated for June 2016*</p>\n\n<p><u><strong>Over 4,100 happy students so far!!!</strong></u></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Learn exactly how I receive a $1,000 deposit into my brokerage account EVERY Friday trading a very specific options strategy, and how I rarely ever lose a trade due to my proprietary adjustment techniques to fix losing trades. I am going to teach you a strategy that is so consistent and reliable; you can use it to make a dependable “paycheck” every Friday from the comfort of your home. </strong> <strong><u>You can achieve these kind of paydays even with a very small trading account!</u></strong></p>\n\n\n\n\n\n\n\n\n\n<p>I also teach how to make adjustments to your trades that will allow you to turn it from a loser into a winner!  Once you learn this secret technique, you will be amazed at how rare it is to lose a trade, and finally be able to trade with complete confidence. </p>\n\n\n\n\n\n\n\n\n\n<p>No experience is necessary.  I will teach you everything you need to know to start making money tomorrow.  I don’t hold anything back.  You can repeat this month after month after month!</p>\n\n\n\n\n\n\n\n\n\n<p>You don’t need to look at charts or do any technical or fundamental analysis whatsoever.</p>\n\n\n\n\n\n\n\n\n\n<p>You will learn:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>The strategy basics</li><li>The best way to structure the trade</li><li>A simple trick to know your odds of success before you even place the trade</li><li>The most profitable ticker symbols to trade</li><li>How to choose exactly which option contracts to trade</li><li>How to fix a losing trade and turn it from a loser into a winner</li><li>How to use what you learn to create a consistent income from home</li></ul>\n\n\n\n\n\n\n\n\n\n<p>And much, much more…..</p>\n\n\n\n\n\n\n\n\n\n<p>Plus I will give you special access to one of my other highly rated options courses. The course outlines a very consistent strategy that works great with strategy you will learn in this course.</p>\n\n\n\n\n\n\n\n\n\n<p>Click the button at the top right of your screen to begin taking this course now.   Every minute you wait is money you could be putting in your own pocket.</p>\n\n\n\n\n\n\n\n\n\n<p>You will get all future course updates for free, in addition to <u>unlimited email support from me for any questions that may arise</u>.  If for any reason you aren’t convinced this is absolutely the best way to make a fortune trading options, you are entitled to a no-questions-asked 30-day 100% money back guarantee.</p>", 
    "end_date": null, 
    "title": "Trading Options - The Ultimate Credit Spread Strategy", 
    "price": "30.00", 
    "instructors": "Jeff Tompkins", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/627540_bb3c_7.jpg", 
    "course_url": "https://www.udemy.com/work-from-home-setup-your-own-options-trading-business/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T01:16:54Z"
}