{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<div style=\"\">  \tWe designed this course so that it would be benefit all levels of trading and investing experience.  </div>  <div style=\"\">  \tThis course includes the basics of trading and options for the beginners, and also includes clear and to the point modules on the techniques and principles for the advanced student who doesn&#039;t need the basics.  </div>  <div style=\"\">  \tHere a just a few of the key benefits you will get from this course:  </div>  <ul style=\"\">  \t<li><span>Once you complete this course you will have access and knowledge to implement time tested, proven, profitable strategies that have been used by professional traders.</span></li>  \t<li><span>In this course we will focus on keeping things simple and be direct to the point, we will not waste your time, money or energy on the unnecessary.</span></li>  \t<li><span>Learn how to quickly and effectively identify which way the market is going, this will increase your success immediately.</span></li>  </ul>  <p>  \tWe were adamant about creating a course that was grounded in what works, not hype, false claims or promises.  </p>  <p>  \tThe principles, techniques and strategies that you will learn in this course have been used by some of the most successful traders of all time.  </p>  <p>  \tThese are strategies that we and colleagues have used at the professional trading institutions that we have worked for to generate significant returns for ourselves and clients.  </p>  <p>  \tWe did not learn to trade by reading a book, taking a course, or back testing a technique with theoretical situations. We learned on the various trading desks that we have worked on around the world.  </p>", 
    "end_date": null, 
    "title": "Trading: From Wall Street to Your Street", 
    "price": "50.00", 
    "instructors": "Trade Prosper", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331968_80cf_2.jpg", 
    "course_url": "https://www.udemy.com/from-wall-street-to-your-street/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T18:33:25Z"
}