{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Do you plan on<strong style=\"\"> trading biotech stocks</strong>?</p><p style=\"\">Do you want to learn how to <strong style=\"\">identify promising healthcare stocks</strong>?</p><p style=\"\">Do you want to professionally <strong style=\"\">read a company pipeline</strong>?</p><p style=\"\">Do you want to know where to <strong style=\"\">get all the relevant info </strong>for biotech/healthcare company evaluation?</p><p style=\"\">Do you want to <strong style=\"\">tailor your investment strategy</strong> towards a healthcare portfolio?</p><p style=\"\">Those are just some of the question you will learn in this tutorial!</p><p style=\"\">The biotech industry can be highly rewarding if you, as an investor, know how to read the signs. Healthcare is a highly relevant topic to all of us. In various stages of our lives we get costumers of healthcare companies. Ranging from simple over the counter (OTC) pain killers to high tech antibodies, biotech does all the development work to finally provide us with the medical support we need.</p><p style=\"\">The whole drug market will reach 1 TRILLION USD of sales in the next years. It is a gigantic market, which is highly influencing our economy. So far it is mainly the sphere of investment funds, banks and insurances who have highly educated staff to properly read the signs.</p><p style=\"\">It is a risky industry to invest in. Often times we see hit or miss events, with either huge stock price gains or losses. To protect yourself against clueless trading and the superiority of institutional traders, it is important to get proper training first.</p><p style=\"\">Biotech training material and education for the private investor is hard to find. With this <strong style=\"\">unique course</strong> you will learn the principles that lead the whole healthcare sector. If you understand how drug development works, you will be able to read the signs and make sound decisions. </p><p style=\"\">If you want to earn more money with healthcare and biotech stocks, I would highly recommend to take this course. Understand the principles of healthcare first, so that you have the power to make your own decisions and not rely on external sources! </p><p style=\"\">Martin</p>", 
    "end_date": null, 
    "title": "Trading Biotech Stocks - Understanding the Healthcare Sector", 
    "price": "30.00", 
    "instructors": "R-Tutorials Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469526_1b91.jpg", 
    "course_url": "https://www.udemy.com/trading-biotech-stocks/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T02:25:46Z"
}