{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    A group of investment-bank and hedge-fund traders from institutions such as Goldman Sachs, Bank of America Merrill Lynch and Caxton, the leading US Hedge Fund, decided they wanted to give others the same insight into the market they had. So, they started Savi Trading, a company with a vision to turn all citizens into educated, clever market traders capable of growing their own finances. To do this, they have taught classes at prestigious universities and institutions globally, as well as to the public, that cover different world markets and techniques for investing and even give face time to CNBC every week in certain regions to give market reviews.&lt;?xml:namespace prefix = o ns = &quot;urn:schemas-microsoft-com:office:office&quot; /&gt;  </p>  <p>  \t    This course has been created to teach individuals how to trade the various asset classes such as Stocks and Equities, Forex, Commodities and Fixed Income products like a professional.  </p>  <p>  \t    This extensive course covers trading from the ground up, starting with the basic concepts of stock trading and advancing your trading through the live webinars to the point that you will feel yourself a competent trader, and have a number of strategies under your belt.<span class=\"apple-converted-space\"> </span>  </p>  <p>  \t<span class=\"apple-converted-space\"></span>  </p>  <p>  \t<span class=\"apple-converted-space\"></span>·Introduction to Financial Markets  </p>  <p>  \t       ·Different Asset Classes  </p>  <p>  \t       ·Economic Data Releases  </p>  <p>  \t       ·Trading around Economic Data  </p>  <p>  \t       ·Understanding Technical Analysis  </p>  <p>  \t       ·Moving Averages  </p>  <p>  \t       ·Trading Strategy 1  </p>  <p>  \t       ·Trading Strategy 2  </p>  <p>  \t       ·Risk Management  </p>  <p>  \t       ·Psychology  </p>  <p>  \t    During the course there will also be questions which will help to monitor your learning’s and ensure you understand the material as you go along. You will also have access to various E-Workbooks and resources which will complement the video course. As well as the materials, you will have access to a Professional Risk Management Spreadsheet which will help to calculate your risk profile, very important when becoming a professional.  </p>  <p>  \t    You will get started with various trading strategies which are used by professionals. These can be applied on either a demo or a live account. These strategies married with Risk Management and Psychology can become very powerful tools to create profitability.  </p>", 
    "end_date": null, 
    "title": "Trade Stocks, Forex & Financial Markets like a Professional", 
    "price": "20.00", 
    "instructors": "Savi Trading", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/288256_1e7b_2.jpg", 
    "course_url": "https://www.udemy.com/stock-and-forex-trading-strategy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T15:57:07Z"
}