{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Join me, Bruce Banks, if you want to get a <strong>clear understanding</strong> of your trading. It doesn't matter if you are new to trading or a seasoned professional.</p><p>I break down how to<strong> identify trends</strong> and how that will improve your trading. The important points of resistance and support in the market <strong>outlined and labeled</strong>. </p><p>This is <strong>years of information</strong> condensed down into this course. The best way for you to fast track your trading is to use time tested methods. You don't need any indicators for this. Just a drawing tool to outline trends in any market.</p><p>We won't be spending any time on power points. You are going to be looking over my shoulder as I analyze markets. Describing exactly what goes through a professional trader's mind as I look for strength, weakness, and opportunities in the market. This is what every trader, no matter how you trade, should have in their arsenal of mental tools for the market.</p><p>You will learn how to <strong>break down the patterns</strong>, look for <strong>opportunities</strong>, and<strong> lower your risk</strong>. </p><p>On top of all of that, I will be here to answer <strong>ANY TRADING QUESTION</strong> you may have. This is a course where you can ask questions, <strong>share ideas</strong>, and get <strong>detailed answers</strong> from me. I am devoted to your <strong>understanding</strong> of the market.</p>", 
    "end_date": null, 
    "title": "Trading Trends in ANY Market", 
    "price": "20.00", 
    "instructors": "Bruce Banks", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/629060_0499.jpg", 
    "course_url": "https://www.udemy.com/trading-trends-in-the-market-stocks-futures-forex/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-02T18:52:51Z"
}