{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">WHAT IT TAKES TO BE A GREAT TRADER:</strong></p><p>Virtually all studies estimate that only 5% of traders succeed to a level where they can make a living out of it.  Only a small fraction of of that 5% will make the amount that would be notable in comparison to other average jobs.</p><p>Many reasons can account for this.  The unifying and underlying theme that binds all of those reasons have to do with some form of not knowing.  This course was specifically designed to address the biggest knowledge gaps to give traders the highest chance of success.  That includes people interested in trading, aspiring traders, struggling traders as well as traders who may already feel like they have everything covered.  The best traders are always seeking a higher level of knowledge.</p><p><strong style=\"\">In TRADING TRUTHS, you will learn:</strong></p><ul style=\"\"><li>How we are all traders (like it or not, it&#039;s true)</li><li>The nature of traders making disproportionately higher amounts of money</li><li>How to make disproportionate money work for you</li><li>Who the &quot;big boys&quot; are </li><li>Why the line between them and the smaller independent trader is blurring</li><li>Why treating trading as a business is an absolute must</li><li>To determine your personal trading edge</li></ul><p><strong style=\"\">Contents and Overview</strong></p><p><em style=\"\">This course will cover the absolutely vital conceptual frameworks that will benefit any trader or investor before they spend any (or any more) hard earned money on trading and investing courses.</em>  Understanding the concepts in this course will easily save an aspiring trader or investor more than ten times what it costs.</p><p>If it wasn&#039;t worth every bit the full price, we encourage you to use the student protection guarantee policy to your advantage.  We can&#039;t give you back your time, but we can give you back your money.</p><p>The wisdom contained in this course has helped many so many students and we are incredibly confident that it will help you as well.</p><p><strong style=\"\">ENROLL NOW!</strong></p>", 
    "end_date": null, 
    "title": "TRADING TRUTHS", 
    "price": "20.00", 
    "instructors": "Triumph At Trading", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512004_798b_7.jpg", 
    "course_url": "https://www.udemy.com/trading-truths/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T17:31:39Z"
}