{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Trading full-time can be extremely rewarding.  There is incredible potential for profit without many of the day-to-day hassles that accompany other businesses.</p>    <p>Some of those benefits can include:</p>  <ul><li>The ability to work from home or a private office</li><li>A less stressful environment</li><li>Quieter atmosphere</li><li>Increased productivity</li><li>The freedom to set you own hours</li><li>Eliminating your commute</li><li>More free time</li><li>Being your own boss</li><li>Reducing workplace distractions like meetings and coworkers</li><li>Trading from wherever you want</li></ul>                      <p>This course is about the steps that are necessary to get there and the discipline and planning required to make it a lasting and ever-expanding success.</p>    <p>Trading full-time takes a special set of skills and preparation than trading on the side or for supplemental income or account growth.</p>    <p>It’s easy to marvel at the benefits.</p>    <p>There are few who would say no to the perks.</p>    <p>It’s also all too easy to forget about the hard work, diligence, and preparation that it takes to maximize the chances of success.</p>    <p>Full-time trading can be a very rewarding and exciting journey.  </p>    <p>Are you ready to learn more?</p>    <p>Are you ready to put in some effort?</p>    <p>Are you ready to optimize and improve your operations (if you happen to already be trading full-time)?</p>    <p>This course will help you take trading to the next level and ensure that you are prepared.</p>", 
    "end_date": null, 
    "title": "TRADING FOR A LIVING: Trading Full-Time Transition Guide", 
    "price": "35.00", 
    "instructors": "Triumph At Trading", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624016_bbaf_4.jpg", 
    "course_url": "https://www.udemy.com/trading-for-a-living-full-time-trader/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T20:15:18Z"
}