{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\tThis course shows you how to make money actively trading stocks in any market situation. You’ll discover a simple way to evaluate the profit potential of a stock… and then… turn it into cash quickly and safely within a few hours to a few days.\r\n</p>\r\n<p>\r\n\tThe <strong><em>Trade For A Living</em></strong> course is designed for both new and experienced traders who want a proven system for making money in the stock market. This course is not based on theory or guesswork. Instead, you will discover the secrets of profitable trading from Master Trader, Bob Joiner, himself.\r\n</p>\r\n<p>\r\n\tThe course takes you step-by-step through Bob’s system for spotting the predictable price pattern that lets you know a stock is a potential winner. Bob then shows you how to trade these profit-rich picks to maximize earnings while minimizing risk.\r\n</p>\r\n<p>\r\n\tThe great thing about Bob’s system is that the stock does not matter. You could trade both established companies like McDonald’s and start-ups with no track record whatsoever. The magic is in knowing the predictable pattern in the price movement of winning stocks.\r\n</p>\r\n<p>\r\n\tThe course progresses from the basics of trading stocks to more advanced strategies such as: how to use technical indicators, how to read stock charts and finally how to develop your own surefire trading strategies.\r\n</p>\r\n<p>\r\n\tBob designed this course as a user-friendly shortcut to mastering technical day trading. You get lifetime access to 59 online video lectures that take you by the hand through each part of the system. In addition to more than 7 hours of video instruction, you will be given a variety of worksheets, homework assignments and self-evaluation assessments to apply what you’ve learned. These activities are in the form of PDF documents that you should download and complete.\r\n</p>\r\n<p>\r\n\tIn short, the <strong><em>Trade For A Living</em></strong> course offers you a unique chance to discover a real world stock trading system that works in any market. If you want to put the odds of stock trading success on your shoulders then this course is for you.\r\n</p>", 
    "end_date": null, 
    "title": "Trade for a Living", 
    "price": "20.00", 
    "instructors": "Bob Joiner", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/176136_077b_5.jpg", 
    "course_url": "https://www.udemy.com/trade-for-a-living/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T16:52:14Z"
}