{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t     William O'Neil, publisher of The Investor's Business Daily and a legendary stock trader, did an exhaustive study back in the 1960's on the winning traits of the stock market's biggest winning stocks and he found that there were common characteristics among runaway stock moves.  One of the biggest discoveries were that high-performing stocks formed key price patterns before breaking out and making their investors rich.  </p>  <p style=\"\">  \t <em>O'Neil used that knowledge to achieve staggering returns which helped him gain a seat on the New York Stock Exchange while in his 20's and also funded the start-up of the Investor's Business Daily which grew into a billion-dollar publishing empire.</em>  </p>  <p style=\"\">  \t  Expanding on O'Neil's lessons,in the late 1990's, a pool contractor named Dan Zanger broadened the <strong>use of key chart patterns just like you'll learn in this course and  took a trading account  from $11,000  to over $43 million dollars in just 18 months!</strong>  </p>  <p style=\"\">  \t     It was an incredible feat that set records and was documented publicly by both his accountants as well as Forbes magazine.  </p>  <p style=\"\">  \t     Now, for normal people, those results are not typical but his story stands as a testament as to what is possible once you understand the key principle of Dan's story which is - through dedicated study of the right information, <em>Dan went from a losing trader to a massively successful winner by using price patterns!</em>  </p>  <p style=\"\">  \t     Price patterns are commonly talked about among traders but not commonly understood, and this causes alot of traders to miss out some truly epic trades.  </p>  <p style=\"\">  \t     In this course, its my goal to make sure that this doesn't happen to you.  </p>  <p style=\"\">  \t     Here, you'll learn:  </p>  <ul>  \t<li>How to train your mind to spot high-performing price patterns and hone in with laser-like, almost psychic accuracy when spotting price patterns!<br style=\"\">  \t </li>  \t<li>Use \"dynamic\" entry signals where momentum screams that the dominant trend is about to drive price into a new profitable trend.<br style=\"\">  \t </li>  \t<li>Bullish patterns will have higher winning percentages than bearish patterns because bottoms are easier to call than tops.  Why?  Because of certain emotions at play (know this and you'll understand something so primal that you'll never trade the markets the same way again).<br style=\"\">  \t </li>  \t<li>If you can draw simple lines and connect the dots then you have the tools to find winning trades in today's stock market (and avoid losing trades as well).<br style=\"\">  \t </li>  \t<li>The truth about quiet, low-volatility stocks and how they can emerge as the next Apple Computer or Baidu, the kind of runaway moves that grow your trading account.<br style=\"\">  \t </li>  \t<li>Like a coiled spring, price may pull back slightly in order to explode forward and give you a small window of opportunity for a low-risk entry!  But, you need to learn how to spot a First Stage Base (90 percent of traders get this wrong but, now, you'll be able to spot it in a glance and put yourself in a winning position as the trend resumes upward).<br style=\"\">  \t </li>  \t<li>How to use one trick to time your entries with incredible precision just as a runaway move is about to occur!<br style=\"\">  \t </li>  \t<li><strong>How combining two simple indicators can show you explosive price points to put yourself in front of fast-moving stocks for 50 percent, 100 percent, 200 percent, or greater.</strong><br style=\"\">  \t </li>  \t<li>The one sneaky trick that underhanded floor traders use against traders like you and how to avoid it and how to profit by turning the tables against them.<br style=\"\">  \t </li>  \t<li>Better than Trend-Trading:  Trading trends is one of the most reliable methods for solid returns but, sadly, has a success rate of less than 1/3rd of the trades implemented (maybe less).  However, using key price patterns along with sound technical criteria, you can have extremely high success rates that are potentially as great as 98 percent with some chart patterns.<br style=\"\">  \t </li>  \t<li>The simple reason why the \"King of Momentum\" patterns will fail.  (and what you can do to avoid it while making effective trades which have more potential to profit instead)<br style=\"\">  \t </li>  \t<li>What you should look for when price emerges into expansion.<br style=\"\">  \t </li>  \t<li>What you should know about \"Static Defense\" versus \"Dynamic Offense\" when confronted on making an entry decision.<br style=\"\">  \t </li>  \t<li>The one thing you must never do when a stock breaks out of a period of contraction.<br style=\"\">  \t </li>  \t<li>The one type of trend you must never trade or you will never make money in the market!<br style=\"\">  \t </li>  \t<li>The simple fact is that \"The Herd\" is wrong more often than not and how to use this fact to spot trend reversals and avoid losses when the amateurs are piling on new positions at the WRONG TIME!  (knowing this can help you profit when The Herd is too scared to act!  Real fortunes are made this way in the stock market and how Warren Buffett, Paul Tudor Jones, Jesse Livermore, and George Soros became legends!)<br style=\"\">  \t </li>  \t<li>Do you feel frustrated or, worse, paralyzed with fear by not knowing which direction you should be trading a stock?  Learn these 4 methods of filtering out price movement and you'll never experience those destructive negative feelings again.<br style=\"\">  \t </li>  \t<li>The reason why you should trade stocks at their all-time highs (and it has nothing to do with overhead resistance).<br style=\"\">  \t </li>  \t<li>Why the Yin/Yang concept of Chinese culture holds the true secret of unlocking the potential of price movement and how to use it to make high returns.<br style=\"\">  \t </li>  \t<li>The secret relationship between price and volume. <br style=\"\">  \t </li>  \t<li>Learn how Isaac Newton's First Law of Physics relates to price movement...and when it doesn't.<br style=\"\">  \t </li>  \t<li>The single most important indicator to help you detect tomorrow's monster moves (imagine catching Apple Computer 5 or 6 years before anyone else).<br style=\"\">  \t </li>  \t<li>23 of the most profitable price patterns with detailed instructions on how to spot them, confirm their entry points, trade volume requirements, and success rate.<br style=\"\">  \t </li>  \t<li>You will understand price action and movement at its most fundamental level and be able to know when to trade, spot chart patterns, read the correct trend in play, avoid losing trade setups, and have the potential to increase your overall returns and take your trading to a new level of success with greater ease.<br style=\"\">  \t </li>  \t<li>Why the simple fact is that a strong technical trader will outperform a good fundamental trader and why.<br style=\"\">  \t </li>  \t<li>The secret of \"Surfing Momentum\" and how to use it to put yourself in front of a fast-moving trend (this makes price \"prove\" itself worthy of you making an entry or revealing that it isn't worth it and keeps you from ever getting into a losing position to begin with).<br style=\"\">  \t </li>  \t<li>And much, much more.</li>  </ul>  <p style=\"\">  \t     In the Triple P Trading course, you'll get a fully detailed strategy guide that breaks down each chart pattern for you so that you fully understand how the pattern forms, its success rate, what to look for,  and when to enter at the right moment.  It is a blueprint to the best price patterns that have the highest success rate and lead to the biggest winning moves.  </p>  <p style=\"\">  \t     You'll also get videos with case studies of the strongest chart patterns and how they apply to the stock market.  </p>  <p style=\"\">  \t     In addition, you'll also get the audio lessons to each video so that you can listen to the lectures on your MP3 player whenever you want.  </p>  <p style=\"\">  \t     The best part is that you'll have this material to view over and over again to really drive home the lessons they contain so that you can get better and better at using them.  </p>  <p style=\"\">  \t     Go now, and get started by clicking the \"Take This Course\" button at the top of the screen right now!  </p>", 
    "end_date": null, 
    "title": "Triple P Trading Course", 
    "price": "20.00", 
    "instructors": "Billy Williams", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/136244_fa29_9.jpg", 
    "course_url": "https://www.udemy.com/triple-p-trading-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-21T01:20:21Z"
}