{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>UK Self Assessment Tax Return Filing Online</strong> course is for accounting students and those self employed individuals who need to submit a British self assessment tax return and want a demonstration of how it is done. On this course we are not looking at how to calculation tax or the bookkeeping for what are allowable and disallowable expenses - we are simply focusing on the process one goes through in order to submit a UK tax return.</p><p>We take an example person with very simple figures to file. In real life, when filing a tax return one has to determine how much income one has made as well as the expenses one has incurred in the course of doing business. We don't go into the bookkeeping side of things on this course, we simply take the end figures and look at how they're reported back to the HMRC. The purpose of this course is to demystify the process so that students who need to do this act for themselves will build the knowledge and courage to file their own returns. Many people have extremely simple figures to report and this course is especially for them. </p><p>There are no materials that are included. The course will take less than an hour to complete. It talks you through what is expected in a self assessment filing. We look at how to log in, how to access and activate the 'self assessment' service. Inputting the figures, viewing the calculation and submitting the return. </p><p>It's a fairy short course and will give you a good demonstrative overview of the process of filing out an online UK self assessment tax return.<br></p><p>We don't get bogged down in complex calculations or the nature of taxation etc., This course will give you a good idea of what the inside of a tax return looks like. Basically, in a nutshell, it is simply an online questionnaire. In order to fill out this questionnaire for yourself, you do need to have your figures prepared. We don't look at how to arrive at the final figures in this course - we simply take those figures and look at how to slot them into the return, in order for it to give us our calculation of how much tax is due.</p><p>Note, you don't 'calculate' corporation tax - you simply input the correct figures in the right place and it (the system) will do the calculation for you - and this is what we show you on this course.</p><p>The main thing is that this course will give you an insight into the process of completing a UK tax return. If you are currently paying your accountant a small fortune, and you suspect that you could probably do it yourself... you'd probably be correct.</p><p>No previous knowledge of accountancy or taxation is needed or presumed. </p>", 
    "end_date": null, 
    "title": "UK Self Assessment Tax Return Filing Online", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690546_4ccc_2.jpg", 
    "course_url": "https://www.udemy.com/uk-tax-return/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T20:30:30Z"
}