{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>COULD IT REALLY BE POSSIBLE…<br></p>\n\n<ul><li>To create an income at retirement beyond what you currently envision?</li><li>To retire many years sooner than you're currently planning?</li><li>To live without stress knowing that your retirement is planned for and secure?</li><li>To create—<em>and revise—</em>more proven, personalized ones—for free—on your own?</li></ul>\n\n<p>It's possible—It's up to you if you want to achieve it.</p>\n\n<p><strong>JOIN US IN <em>The Retirement Master Course</em>, AND WE WILL BE YOUR GUIDES ON THE JOURNEY TOWARD RETIREMENT FREEDOM!</strong></p>\n\n<p>Five reasons to take this course IMMEDIATELY:</p>\n\n<ol><li>Correctly answer the “How Much Do I Need to Retire\" question. That's the most common question we get from our clients. <strong><em>You will learn exactly</em></strong> how to answer that question for yourself. By the end of this course, you will be able to immediately create your own retirement plan, adjust it to <strong><em>your</em></strong> scenario, and know exactly the steps and process you will need in order to secure your ideal retirement. Adjust this as often as you like to your changing situations, at no cost, with no advisor or money manager biases, and with a more accurate and realistic “Retirement Number\" than you've seen before.</li> <li>You get to <strong><em>ask us questions</em></strong> and see our answers to all students through the exclusive class discussion boards. Ask us any question specifically related to the lectures in this course, and receive a prompt answer—straight from the experts—to you as our student! We will do our best to give you complete answers that will be helpful and useful to you.</li> <li>You receive <em><strong>instant access</strong></em> to the full course materials, along with constantly updated lectures. This is material directly from the two instructors' over <strong><em>40,000+</em></strong> hours of experience and backgrounds in the financial and retirement fields. Including over 30 years of professional coaching with clients, advanced degrees and certifications, as well as extensive and ongoing studies relating to preparing for and optimizing both ours and our clients' retirements. What this means is you can save years of time and avoid the many pitfalls that countless others fell into before. This aspect alone is worth thousands!</li> <li>This course is original, honest, and from the heart. It's our passion to help others achieve the kind of success we know they're capable of, and we are frustrated seeing so many being led in the wrong direction. Our course is personal and professional—created through our skills and involvement with experts—based on how <em>we</em> achieve success, and how we <em>get our clients</em> to their <strong><em>dream retirement</em></strong>.</li> <li>Every day you wait is costing you money. Each day you delay makes it that much harder to hit your retirement goals. Every dollar you pay in fees is sucking thousands of future dollars out of your retirement. These numbers compound and add up exponentially when you need it most. <strong><em>If you don't start today, the money won't be there when it matters</em></strong>. The time is no better than right now. Put in the small effort it takes today in order to prepare for and secure your retirement down the road. The sooner you take action—the far better off you will be!</li></ol>\n\n<p><strong>SAY GOODBYE TO FINANCIAL STRESS…AND HELLO TO PEACE OF MIND, RETIREMENT SECURITY, AND FINANCIAL INDEPENDENCE</strong></p>\n\n<p>Conventional retirement planning is backwards!</p>\n\n<p>Your retirement <strong><em>must</em></strong> revolve completely around the income you can create each and every year after you are finished working full-time. It does not revolve around the mysterious “retirement number\" you so often hear. The real goal in retirement is sustainable spending—<strong><em>not portfolio value</em></strong>. This one change in how most approach their financial picture—is what makes all the difference!</p>\n\n<p>Approaching it this way gives you a retirement picture based on real, hard, concrete facts and projections precisely catered to <strong><em>your</em></strong> needs. It does not give you pie-in-the-sky numbers, generic rules of thumb, and anyone's best guess as to what it truly means for your retirement years. It <strong><em>does not</em></strong> give you biased recommendations, questions of your financial security, or numbers so high you think you will never get there.</p>\n\n<p>Instead, it gives you the exact plans, confidence, and peace of mind that <strong><em>when you do achieve it</em></strong>—you can have the lifestyle you dream of. Learn how to do this!</p>\n\n<ul><li><strong>YOU <em>CAN'T</em> DEPEND ON TRADITIONAL ROUTES TO RETIREMENT—THOSE SIMPLY <em>ARE NOT</em> WORKING</strong></li></ul>\n\n<p>Begin to enhance your retirement right now, no matter what experience or knowledge you might already have. This course is for everyone who wants to create their ideal life beginning now, and through retirement. No matter your age, income, or where you are in the world—this course is designed for <strong><em>you</em></strong>.</p>\n\n<p>That's because your retirement plan revolves around <strong><em>you</em></strong>. In today's world, you can be in control of where your money is going, how it's being invested, and more importantly—in the driver's seat of retirement.</p>\n\n<p><strong><em>If you are willing to do the kinds of things that others won't—you can achieve the kind of results that others can't.</em></strong></p>\n\n<p>Do you want to sit on the sidelines—waiting, hoping, and relying on others for success? Or do you want to be in the game with your finances—in control of your success?<strong> </strong>It's a game you can't afford to lose<strong>. </strong>Remember—nobody cares more about your financial outcome, than you and your family. You owe this to yourself.</p>\n\n<p><strong>We know the challenges you face in the financial world. We've seen it all. Who do I trust? Where do I put my money? How do I plan for the future? I've been burned before, how can I avoid it again?</strong></p>\n\n<p>In our course, we will discuss the path that many are heading toward in their retirement…stressed out, worried, and working so hard they sacrifice their health at retirement. You will also see the path that far too few retirees are heading down…fully prepared, knowing what their life will look like at retirement, and making the necessary adjustments along the way in order to account for life's changing circumstances. <strong>This is where we want you to be</strong>.</p>\n\n<p>You'll then move on to learning about the retirement fundamentals—essential concepts you need to know. We'll discuss the variables that will have the biggest impact on your retirement planning, the variables that most financial professionals do not even address or account for!</p>\n\n<ul><li><strong>EVERY DAY, EVERY MONTH, EVERY YEAR YOU WAIT TO GET STARTED—THE HARDER IT BECOMES TO ATTAIN THE RETIREMENT LIFE YOU WANT</strong></li></ul>\n\n<p>We'll go on to show the exact steps it takes for you to budget, plan, and project what your retirement years will look like. This is the fun part—it allows you to dream and correct for any shortfalls you might currently have—no matter your age. After that, we will present the course retirement calculators—combining everything you now understand in order to prepare your personalized retirement plan. This will show you what you are on track for, where to adjust in order to get what you want, and give you specific and actionable plans in order to properly move ahead.</p>\n\n<p>We will present ways for you to make up the differences, accounting for areas where you might be lacking in right now. The course will show why the fees you are paying in your accounts are costing you <strong><em>MUCH</em></strong> more than you probably think, what the alternatives are, and why the path that 90% of future retirees are headed is not the way to go (think high fees). The financial system today is a fragile one that looks great when things are going well, but will leave you high and dry when the first sign of trouble comes. <strong>We've seen it before—we don't want that to happen to you</strong>.</p>\n\n<ul><li><strong>THIS COURSE IS THE FINANCIAL ANSWER YOU HAVE BEEN WAITING FOR<strong>—DO NOT WAIT ANOTHER DAY!</strong></strong></li></ul>\n\n<p>We will continue the course with the importance of your retirement. It starts with your thoughts—how much money do you want every year at retirement? Focus on that, set your mind to attaining it—then take the proper actions necessary to get there. It isn't all about just “thinking\" about what you want—but <strong><em>your</em></strong> thoughts coupled with the proper action will put you over the top. The key is learning to combine these two components in the right ways—most people only have one or the other.</p>\n\n<p>You will also learn how to find the proper financial advisor or professional, and how to best utilize their resources to your advantage. <strong>Your financial professional <em>absolutely must</em> have your best interest in mind before their paycheck. </strong>That is vital. There are plenty of trustworthy ones out there if you take the time to find them. Learn how in this course.</p>\n\n<p>Finally, we will give you the step-by-step game plan, including immediate action steps you can take right now in order to save a ton of money, start preparing, and be well on your way to the retirement life you want!</p>\n\n<p>As a bonus—we will thoroughly discuss ways to speed up your retirement plans, or make up for lost time in our creative retirement planning section. This includes the three main inputs to your retirement calculation—save more, earn more, and increase returns. This section will provide tips and ideas for you to put to work immediately in either achieving your goals sooner, or altering your plans to line up with what you truly want out of your pre- and post-retirement life.</p>\n\n<p>In addition, this course is constantly updated with the most up-to-date material.</p>\n\n<p>You can access all of the course materials—including the lectures and class discussions—on your computer, through your iPhone or iPad, and on any Android phone or tablet.</p>\n\n<p>On top of all of this…the course comes with a 30 day, no questions asked, 100% money-back guarantee. If at any time within 30 days you are not satisfied with the quality of the course, simply issue a refund and we will be happy to deliver.</p>\n\n<p>All of this for the one time price of this course! <strong>Don't spend tens of thousands of dollars on financial seminars that continue to sell and take your money. Don't continue to pay financial professionals fees or commissions to prepare personalized retirement plans. You can do this all on your own at zero cost to you—as often as you like!</strong></p>\n\n<p><strong></strong><strong>Respect your money…It's never too late to start. Click on “Take This Course\" to enroll today!</strong></p>", 
    "end_date": null, 
    "title": "Ultimate Retirement: Build Your Own Dynamic Retirement Plan", 
    "price": "20.00", 
    "instructors": "Tudor Coaching Group", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482534_c3fa_3.jpg", 
    "course_url": "https://www.udemy.com/retirement-master-course-create-a-retirement-income-to-last/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T20:49:58Z"
}