{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn about different types of bonds, the benefits and risks of bond investing. Understand the relationship between bond prices, interest rates and yields.</p><ul><li>Bond Basics - learn about what a bond is</li><li>Types of Bonds - learn about the different types of bonds. For example, Government Bonds, Singapore Government Securities, Singapore Savings Bonds, Corporate Bonds, Unsecured Bonds, Callable Bonds, Puttable Bonds, Convertible Bonds, Perpetual Securities.</li><li>Benefits &amp; Risks - learn about the benefits and risks of bond investing. Bond Benefits includes Security, Capital Preservation, Capital Gain, Generating Passive Income, Diversification. Bond Risks include Interest Rate Risk and Capital Loss, Default (Credit) Risk, Reinvestment Risk, Currency Risk, Issue Specific Risk, Inflation Risk, Liquidity Risk</li><li>Credit Ratings - learn about bond credit ratings. Credit ratings provide an avenue for the assessment of the credit worthiness of a bond issuer with respect to its bond obligations. A good credit rating can help to fetch a lower rate of interest for the issuer.  </li><li>Price, Yield Spread - learn about bond prices and yield spreads. Bond prices and interest rates move inversely. Factors that affect interest rates will affect the price of bonds. Interest rates are in turn determined by macroeconomic factors, such as the state of the economy, inflation, unemployment, international trade, and government fiscal and monetary policies. Yield spread is the difference between yields of two investments.  </li><li>Bond Funds - learn about the various bond funds available. Government Bonds, Investment Grade bonds and High Yield bonds represent increasing exposure to credit risk. The fund can also be a mix of various types of bonds. If so, the fund’s fact sheet will state clearly what these types are and what the fund’s investment objective is. Country-specific bond funds may not only invest in local currency bonds, but also in foreign currency bonds.  This is also true of global bond funds.  Do note that such funds may be denominated in USD or currencies unrelated to those of the bonds they are invested in. Emerging Market Bonds usually involves high risk, high yield debt.</li></ul><p>Some of the concepts and examples in this module are applicable only in Singapore.</p>", 
    "end_date": null, 
    "title": "Understanding Bonds", 
    "price": 0, 
    "instructors": "Institute for Financial Literacy, Peggy Chan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664444_c381_2.jpg", 
    "course_url": "https://www.udemy.com/understanding-bonds/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T06:59:41Z"
}