{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          This course is about the stock market and how to understand what it is, how it began, how it&#039;s structured, what the component parts are, how the whole thing works basically and how it applies to everyday life, people and making money. The course is developed and taught by a 23 year veteran investment banker, the course teaches the history of the markets, classifications of stocks, how to read the ticker tape, how to buy and sell stocks and everything in between.  This is the beginners course, however very complex concepts are discussed in detail to give students advanced level knowledge. This is the first course in a series. Upon completion you will be given a coupon code for discounts to the other courses in the series when they become available.  </p>  <p>  \t      I have taught this course and many others over my 23 year career and I always hear they same things and see the same progress. People become extremely empowered when they gain knowledge about money, finance and economics. I have literally seen my students go from unemployed to business owners to investors and beyond. I know that by taking this course you will be enriched.  </p>  <p>  \t      The course is structured in four (4) parts. Each part has a set of videos for you to watch and observe. There are little assignments throughout the videos but strickly voluntary however very effective learning tools. The course has over 7 hours of content that will give the average person a wall street education in about 30 days. By watching a video a day, you will gain powerful insight and information that will help you understand how to make money in the stock market.  </p>", 
    "end_date": null, 
    "title": "Understanding The Stock Market: For Beginners", 
    "price": "25.00", 
    "instructors": "Harvell Floyd Jr", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343818_7002_4.jpg", 
    "course_url": "https://www.udemy.com/understanding-the-stock-market-a-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T01:52:12Z"
}