{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><strong></strong></p><p>Starting in the '80s, banks have become huge financial supermarkets offering a wide range of different services and products. Employees in these large banks have developed specialized expertise in the area in which they decide to make a career. Along with rapid developments in information technology this has resulted in large IT departments staffed by people without any particular financial and banking education. </p>  <p>For example: How was it possible that the 1929 financial crisis was repeated by the 2008 credit crisis? The outrage and confusion illustrates the knowledge gap of understanding what banks do, what happens on financial markets and what is needed to prevent a derailment of the financial sector. </p>  <p>Since 2005, I train people in the financial sector. To bridge the basic knowledge gap with an easy accessible tool, I have created a 3 hour video E-training at Udemy. </p><p>The topics covered by this training are for example: </p>  <ul><li>Learn about money types and the role of Central Banks;</li><li>Understand the different bank types and their activities;</li><li>Get an overview of the 3 financial product categories to trade      capital, foreign currencies and risk</li><li>Understand financial market products trading: how, why and by whom;</li><li>What happens on a dealing room;</li><li>You will be introduced to types of derivative products and why they      are used;</li><li>Learn about the root of the 2008 financial crisis and how it can be      prevented;</li><li>Understand      exchange trading by a 20 minute entertaining video of the history of the      Amsterdam Stock Exchange.</li></ul><p><br></p><p><em><strong>BONUS: Students can download a FREE copy of my 40 page book Understand Banks and Financial Markets (Normal price $6) at Smashwords.</strong></em><em></em></p><strong></strong><p><strong><em></em></strong><br><strong><em></em></strong></p>", 
    "end_date": null, 
    "title": "Understand Banks & Financial Markets ", 
    "price": "30.00", 
    "instructors": "Michiel van den Broek (MSc)", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109988_0b7b_12.jpg", 
    "course_url": "https://www.udemy.com/the-banking-fundamentals-course/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-24T09:11:30Z"
}