{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn Professional Forex techniques that you need to know to start Trading on the Forex Market today&#039;s World!!</p><p>In this course I will show you how you can take benefits of how currencies fluctuate to make smart profits. I will share everything I know regarding basic professional knowledge of FOREX....</p><p>I will thoroughly explain Forex Brokers and their types and working and managing clients  so that you are able to easily work with best Brokers from the unreliable ones when you are ready to open a Real Trading account. </p><p>In this course you will also learn how to read the Economic Calendar for Economic,Political and geographic events, which is imperative for Fundamental trading on Forex as well as other Financial marketplaces such as NYSE, London Stock Exchange, Futures Exchanges, and more.</p><p>Everything of Forex knowledge will be open in front of you and nothing is kept secret. I explain in details that I know... new lectures and materials  will be added to the course constantly - and no extra cost will be paid by you! This is a course that will continue to grow and grow and even grow.....</p><p>Take this course now and learn from my 10+ years of experience.</p><p>This course is for complete for beginners to Advance levels! All you need is to do only Business not game then you will be successful traders!!!</p>", 
    "end_date": null, 
    "title": "Urdu Professional Forex Training videos", 
    "price": "20.00", 
    "instructors": "Muhammad Shahid", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524036_cbdb_4.jpg", 
    "course_url": "https://www.udemy.com/urdu-professional-forex-training-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-09T10:24:13Z"
}