{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  The <strong>Magic Multiple Moving average Techniques</strong> are the most deceiving powerful and yet simple to use Forex trading technique which I have developed over my 12 year trading career.  </p>  <p>  \t  It creates the ability to evaluate the phases and trading opportunities in the entire Forex market literally within seconds. This is achieve by the clear visual images and signals created by these truly magical Multiple Moving Averages.  </p>  <p>  \t  This course takes a green field approach and creates the screen setups, chart setups and indicator before your eyes so that you can easily do those activities yourself.  </p>  <p>  \t<strong>Once setup you can use the Magical Multiple Moving Averages to:-</strong>  </p>  <ol>  \t<li>Tell the market phases of up to 24 currencies in less than a minute</li>  \t<li>Tell which of those currencies provide the best trading opportunities</li>  \t<li>Drill down to selected currencies and refine your entries using a multi timeframe approach</li>  \t<li>You will also develop the skills to incorporate this technique into your own trading approach</li>  \t<li>And much more………….</li>  </ol>  <p>  \t  I would strongly suggest that you view the free lectures in the curriculum below to get a good feel of the course content.  </p>  <p>  \t  The course contains mainly videos and once you have completed the course it is very likely that you will incorporate the Magic Multiple Moving Average charts in all your future Forex trading  </p>  <p>  \t  The course is aimed at intermediate and advanced Forex trader and should not take more than 1 hour to complete.  </p>  <p>  \t  This trading approach can be used using any trading platform  </p>", 
    "end_date": null, 
    "title": "Use the Magic Multiple Moving Average Forex Trading system", 
    "price": "50.00", 
    "instructors": "Alex du Plooy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/323950_8b1c_2.jpg", 
    "course_url": "https://www.udemy.com/the-magic-multiple-moving-average-forex-trading-system/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-21T08:40:17Z"
}