{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to make money in the stock market but don&#039;t know how? Are you tired of &quot;learning&quot; from self-proclaimed experts whose high returns somehow only happen in theory?</p><p>&quot;Investing with the Stars&quot; is your first-ever opportunity to learn directly from six real-life superstars of investing, including billionaire Howard Marks, whose Oaktree Capital is among the most highly respected firms in the world, value investor and philanthropist Mohnish Pabrai, whose flagship fund has beaten the market indices by a wide margin over the long term, Holocaust survivor Arnold Van Den Berg, whose firm has earned the respect of investors for decades, and other fund managers who are giants in their field.</p><p>This course has been more than three years in the making. Course facilitator John Mihaljevic and his brother Oliver have traveled the globe to interview hundreds of successful fund managers. John has also written a top-rated book, The Manual of Ideas, and is author of an acclaimed monthly publication bearing the same name. This is the first time John has brought together the most incisive wisdom of six superstars of investing in an online course created for investors like you.</p><p>John, a summa cum laude graduate of Yale and former research assistant to Nobel Laureate James Tobin, takes you on a stock market journey that will leave you not only entertained and enlightened but also ready to act with confidence. You will finally have the tools to achieve the investment success you have always desired. Still, no course can make you into a great investor overnight. Investing is a lifelong journey of learning and finding things out.</p><p>It&#039;s time to start investing with the stars!</p>", 
    "end_date": null, 
    "title": "Value Investing, Taught by Six Superinvestors", 
    "price": 0, 
    "instructors": "John Mihaljevic, Howard Marks, Mohnish Pabrai, Arnold Van Den Berg, Guy Spier, Rupal Bhansali, Tom Russo", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502240_c9e5_3.jpg", 
    "course_url": "https://www.udemy.com/investing-stars/", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T19:02:16Z"
}