{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn the 10 rules I use to find cheap stocks.</strong><br></p><p>Whether you're an experienced stock market investor or you're looking to buy stocks for the very first time, this course will show you a hassle-free way to find deep value investments.</p><p>The Marwood Value model is an original quantitative investing strategy that I developed and personally use to select cheap stocks. </p><p>If you don't take this course today, you might never realise the potential to be gained from compounding your wealth in the stock market.</p><p><strong>Recent performance</strong></p><p>Just recently, the Marwood Value system has produced some outstanding trades on stocks trading on US exchanges. </p><p>For example, the model recently picked out Shanda Games Limited (GAME). GAME is a Chinese technology company that traded on the Nasdaq. I wrote about the company in a Seeking Alpha article and said how the company had been selected by the model for outperformance. </p><p>Then, on the 3rd April, it was announced the company would be taken over in a $1.9 billion deal. Shares immediately jumped to $6.80, giving a 19% gain in less than a month.</p>There have been many other examples too. This is a model that finds cheap stocks trading below their intrinsic value. Stocks that often experience a rapid turnaround of fortune or get taken over by larger companies.<p><strong><br>Introduction To Quantitative Value Investing</strong><br></p><p>This Marwood Value Model is based around 10 key rules for buying and just one rule for selling. </p><p>Of course, the rules are not simply plucked out of thin air. They are grounded in the principles of successful value investing and historical performance. They take their cues from academic research and align with the viewpoints of successful value investors such as Warren Buffett, Benjamin Graham, Peter Lynch and others.</p><p>The nature of this strategy makes it both highly flexible and easy to use. Entries and exits are made every two weeks, which means this is another stock market strategy that requires very little maintenance.</p><p>It is the perfect strategy to combine with another system, such as a trend following system, a short-term trading system, or a growth investing system.</p><p>By using more than one system together, it is possible to reduce drawdown and risk – so long as those systems are significantly different from one another.</p><p><strong>Impressive Historical Performance</strong></p><p>Using the latest analytical software, I take the 10 value investing rules and I apply them to historical stock market data. The results are recorded live and show an impressive 19 percentage point outperformance against the benchmark S&amp;P 500.</p><p>Over the last 15 years, this strategy was shown to produce annual returns of 21.50% with a maximum drawdown of just 30% and a Sharpe ratio of 0.90. Meanwhile, the S&amp;P 500 has only been able to return 2.28% annually in that time. </p><p><strong>How the strategy came about</strong></p><p>The actual story about how the Marwood Value Model came about is not a random one. In fact, rules for the strategy came about after I realised that many of my best performing stock picks all shared the same inherent characteristics.</p><p>Characteristics such as strong cash generation, low price-to-book values and consistent earnings growth. To my delight, when I put these simple rules into the Portfolio simulator to test, they worked amazingly well. First time!</p><p>I then spent some time tweaking and fine-tuning the rules, particularly the exit, and I found that the most success came from keeping everything simple and straightforward.</p><p><strong>What you will need</strong></p><p>The course details the full rules to the strategy; when to buy, when to sell, and how much to buy and sell. But it also explains each rule in detail, so you know why it's being used and what makes the rule important.</p><p>In terms of software, the strategy is run on the simulator from Portfolio123. This is an institutional quality simulator that's used by the likes of Merrill Lynch, Bank of America and the University of Columbia. It's a high powered and expensive tool that costs around $200 a month to use.</p><p>However, the Marwood Value Model has been especially designed to be used without need for any expensive tools. As I show on the course, the model can be set up and run using free stock screeners that are found online.</p><p>As a result, this is a strategy that anyone can learn from, use, and enjoy.</p><p>If you are interested in building a portfolio of winning investments and you're tired of getting burned in the stock market, I strongly recommend you take a look at this course. </p><p>And remember, I will update this course with new information and content when needed. And if you are not completely satisfied for any reason, you have a 30-day money back guarantee from Udemy. </p><p>I'm sure you will great value in this course and I truly hope to see you do well with your investments. See you on the other side. </p>", 
    "end_date": null, 
    "title": "Value Investing Rules : How To Pick Cheap Stocks", 
    "price": "20.00", 
    "instructors": "Joe Marwood", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/480752_7155_2.jpg", 
    "course_url": "https://www.udemy.com/value-investing-rules/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T02:27:45Z"
}