{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the reality of professional trading: Focus on income trading as compare to PIPS per trade.</p><p>Trade with confidence and certainty. Get all the tools you need to succeed as a trader.  Get personalized support to keep you on track and reach your goal.<br></p>  <p>  \t     Give students all the tools to become either a professional trader or a savvy informed investor. The goal is to reach confidence and certainty in trading not only FOREX but any other financial instrument.  </p>  <p>  \t     At the completion of the course the students will have a deep understanding of the tradings fundamentals as well as a clear path to success. The goal is to create highly skills traders who can either trade for themselves or trade professionally.  </p>  <p>  \t     Whether the students is interested to become a professional trader or just want to manage his or her portfolio more effectively this course will give them the tools necessary to be successful as a trader or investor.  </p>  <p>  \t     At the end of the course the students will be able to make intelligent trading decision based on market dynamics and market knowledge. This is a comprehensive course which will include real life examples.</p>  <p>  \t     Additionally, after completion, students will have FREE access to our proprietary trading software : Trendragon. Trendragon is a foundation trading software which effectively help the traders with entries, profit taking as well position management.  </p>  <p>  \t     This course is specifically designed for :  </p>  <p>  \t     * The novice trader who wants to learn about trading  </p>  <p>  \t     * Help the professional/Experience trader trades with more confidence and certainty  </p>  <p>  \t     * The investor who wants easy to understand tools to make informed investment decision  </p>  <p>  \t     * Individual interested in trading within a group of traders with individual mentor-ship coaching</p>", 
    "end_date": null, 
    "title": "WE WILL PAY YOU TO TRADE WITH US", 
    "price": "50.00", 
    "instructors": "Frederic Douay", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/255280_2132_2.jpg", 
    "course_url": "https://www.udemy.com/trade-forex-the-professional-way-by-trading-live-with-us/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-03T20:15:27Z"
}