{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">&quot;An investment in knowledge pays the best interest.&quot; - Benjamin Franklin</strong>  </p>  <p>  \tDo you want to secure your financial future? Do you want to become wealthy? Do you want to learn about investing, asset management and risk?  </p>  <p>  \tThis course is all about wealth and personal finance. Wether you&#039;re a recent graduate, young professional, mid career with a family or if you&#039;re about to retire. If you want to become financially sound without any stresses then you should undertake this course.  </p>  <p>  \tWe will teach you the basics of wealth management, investing and finance so that you can achieve your goals instead of just thinking about them.  </p>  <p>  \tThis course is activity-based with emphasis on your life. In addition, you will learn how to apply the principles you learn to enhance your life. We will learn about cash, credit, wealth, and risk management as well as the environmental effects on personal and family financial management. We will provide supplementary materials that go along with out videos such as worksheets and excel sheets to enhance your learning progress.  </p>  <p>  \tOur course has a structure with seven modules. These are Goals, Risk, Cash flow, Assets, Investment Methods, Scams and Insurance.  </p>  <p>  \tEach of these modules have three videos each which provide in-depth coaching in a simple, easy-to-understand method.  </p>  <p>  \tEach video is approximately 7-15 minutes long. The entire course provides approximately 3-4 hours of rich material.  </p>  <p>  \tIf you wish to become your own wealth guru, or you want to financially secure you or your family&#039;s future, then this course is for you!  </p>", 
    "end_date": null, 
    "title": "Wealth Management", 
    "price": "30.00", 
    "instructors": "Austal Group", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361286_13ee_3.jpg", 
    "course_url": "https://www.udemy.com/austalgroupwealth-management/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T17:24:50Z"
}