{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t ### BUY 1 Get 1 FREE DEAL.  </p>  <p>  \t Buy our Winning Options Trading System and Get  for FREE Access to &quot;Elite Forex Trading System&quot;  *<br>  \t https://www.udemy.com/elite-forex-trading-system-beginners-to-intermediate-traders/<br>  \t <br>  \t We do go into a great deal of detail about options and             trading not available anywhere else and instead we provide             you with top level knowledge about how markets operate that             is the privy of the top 5%%%% of all traders... not something             you can get for free or even buy anywhere else that we are             aware of.<br>  \t<br>  \t               Instead of guessing, using out-dated and overused technical             analysis that everyone else is using or listening to a             talking head on TV why not learn the very foundation of             large market moves that pros use to make massive profits?  </p>  <p>  \t  What                 this knowledge could mean to you and your family  </p>  <p>  \t<br>  \t               Imagine going short just a few weeks after October 2007...             in this training you&#039;ll learn what you could have looked for             in that period that would have alerted you to the phenomenon             happening at the time and the pattern to watch as this new             phase of the market took over. The profits, had you gotten             in when the signal came, would have been astounding.<br>  \t<br>  \t               Imagine again going long just a few weeks after March 9th,             2009 when the market had been beaten to a pulp with the DOW             at around 6,700... in this training program you&#039;ll be shown             exactly what was done and what you could have instructed             your friends and family to do based on this phenomenon. <strong>Watch and listen as this play               is explained in detail and the exact pattern to look</strong>             for that would have tipped you off that the market was going             to rally strong - what to look for, why the decline was over             (this alone is worth the price of this training!) and the             best way to profit from the inevitable rise in prices...<br>  \t<br>  \t               In this simple but powerful screen capture video training             program you&#039;ll learn:  </p>  <ul>  \t<li><strong>How to identify the                   phenomenon</strong> - what it is and <strong>how to harness the power it                   holds</strong> in ANY KIND OF MARKET...</li>  </ul>  <ul>  \t<li>When you see the phenomenon I&#039;ll teach you what                 pattern to look for gives you a clear signal to go long                 or short and why it dangerous to act before you get                 confirmation of the pattern...</li>  </ul>  <ul>  \t<li><strong>Why 99%%%% of all retail                   traders lose money</strong> or only make a small amount                 of money using options, stocks and futures and how to                 trade like the professional 1%%%% of traders that make a                 killing in the market... </li>  </ul>  <ul>  \t<li>What options are, why they are the best trading                 vehicle for most traders...</li>  </ul>  <ul>  \t<li><strong>What the &quot;greeks&quot; are                   and how each one works</strong> and which ones you need                 to pay attention to and WHEN...</li>  </ul>  <ul>  \t<li>Why, of all the greeks, one (and it&#039;s not <em>Delta</em> as most                 option traders think!) is the most powerful greek of all                 and how paying attention to it can make you HUGE                 profits... (I actually show you in real-time how this                 one greek can make you a killing)...</li>  </ul>  <ul>  \t<li>Proven, <strong>practical                   techniques to use in any kind of market</strong> to make                 real and substantial profits with real case studies...</li>  </ul>  <ul>  \t<li>How to KNOW ahead of time that the market is likely to                 have a big drop - what to buy and when to get out...</li>  </ul>  <ul>  \t<li>How to KNOW when a market has stopped declining and is                 ready to advance strongly - what to buy and when to get                 out...</li>  </ul>  <ul>  \t<li>Why <strong>buying CALLS at                   the bottom of a large decline in prices is the WORST                   thing you can do </strong>and why and what options to                 buy instead for massive profits as the market starts to                 rally...</li>  </ul>  <ul>  \t<li><strong>How to leverage                   options so you can profit as much as shorting or going                   long the actual stock</strong> at 1/10th the investment                 - exactly what to buy and when...</li>  </ul>  <ul>  \t<li>The best way to profit when you know prices are going                 up (and it&#039;s not buying CALLS)...</li>  </ul>  <ul>  \t<li>The best way to profit when prices are about to enter                 a new bear market (and it&#039;s not complicated)...</li>  </ul>  <ul>  \t<li>Why the simplest trades are sometimes the best                 trades...</li>  </ul>  <ul>  \t<li><strong>The only thing you                   need to know to make money in the market</strong> (and                 it has nothing to do with technical analysis, indicators                 or whether the market is moving up or down)...</li>  </ul>  <ul>  \t<li>Which option to choose - how and why - when going long                 or short the market...</li>  </ul>  <ul>  \t<li><strong>A new way to trade                   long/short ETF&#039;s </strong>that recurs with such                 frequency that you could trade this one phenomenon alone                 and make a killing with it...</li>  </ul>  <ul>  \t<li>And much more...</li>  </ul>  <p>  \t * Please message  us once you sign up so that we can send you access to the 2nd course  </p>  <ul>  </ul>", 
    "end_date": null, 
    "title": "Winning Options Trading System", 
    "price": "25.00", 
    "instructors": "Earners Classroom", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100526_14b2_7.jpg", 
    "course_url": "https://www.udemy.com/winning-options-trading-system/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-02T16:25:52Z"
}