{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">Your Business by the Numbers </em></strong>will provide students with hands on experience in tracking sales, monitoring costs, and making a profit.  First, you will play an online interactive game called The Lemonade Stand Game.  You’ll learn how to create an excel spreadsheet to track costs and revenues.  You will learn basic business management calculations, and then apply them to a project to estimate a business budget for a company in the book publishing industry.   <strong style=\"\"><em style=\"\">Your Business by the Numbers</em></strong> will teach you how to set your price in such a way that you will know whether or not you will make money, and to test your price level by surveying your customers to be sure you are charging a reasonable price.  Within this course, there are nine modules:  </p>  <p style=\"\">  \t<strong style=\"\">Module 1</strong> The first session, Introduction, is designed to explain who can benefit by taking this course.  </p>  <p style=\"\">  \t<strong style=\"\">  Module 2</strong> Organizing Your Business Data focuses on the importance of organizing your cost and revenue data in order to track your business.  </p>  <p style=\"\">  \t<strong style=\"\">Module 3</strong>  Will You Make A Profit asks you to analyze the Lemonade Stand Game to discover what variables most impact profitability.  </p>  <p style=\"\">  \t<strong style=\"\">Module 4</strong>  Be Precise In Your Calculations  asks you to make calculations to maximize profits.  </p>  <p style=\"\">  \t<strong style=\"\">    Module 5</strong> In the fifth session, Budgeting to Break Even, we introduce the concept of a cost driver.  This allows us to construct a cost function, and determine our break even analysis.  </p>  <p style=\"\">  \t<strong style=\"\">Module 6</strong>   In the sixth session, Sales by the Numbers, we look at how the sales we make are connected to the profitability of the company.  </p>  <p style=\"\">  \t<strong style=\"\">Module 7</strong>  In the seventh session, Budgeting by the Numbers, we will look at how inventory is tracked in the business to see how to reduce costs and increase profits.  In this module, we’ll apply what we have been learning in this course to run our business by the numbers.  </p>  <p style=\"\">  \t<strong style=\"\">  Module 8</strong> In the eighth session, Setting Your Price, we will look at how to incorporate a survey of your customers with calculations of your costs in order to set a price that lets you make a profit.  We’ll examine how people make decisions to see how they decide to buy things.  </p>  <p style=\"\">  \t<strong style=\"\">Module 9</strong> The ninth session, Next Steps, we summarize what has been learned in this course, and preview additional courses in the series available from Generation Self Employed.  </p>", 
    "end_date": null, 
    "title": "Your Business by the Numbers", 
    "price": "25.00", 
    "instructors": "David Lantz", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/79364_d546_5.jpg", 
    "course_url": "https://www.udemy.com/your-business-by-the-numbers/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-16T02:03:32Z"
}