{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Этот курс об опционной торговле. </p><p>С помощью этого курса вы сможете понять, каким образом можно зарабатывать на опционах<span>, <strong>оставаясь нейтральным к рынку.</strong> Вы поймете как трейдеры-профессионалы зарабатывают на изменении <strong>волатильности </strong>и с помощью распада <strong>временной стоимости</strong> опциона.</span></p><p><span>В этом курсу я также покажу, как оценивать <strong>риск</strong> и <strong>потенциальный профит</strong> перед тем, как открывать опционную конструкцию. После окончания курса вы сможете делать это самостоятельно. И, конечно, у вас будет представление о том, какими параметрами описываются опционы и опционные спреды.</span></p><p><span>Я уверен, что знание этих к<strong>онструкций по волатильности</strong> поможет вам лучше ориентироваться при торговле опционами, и, если вы все будете делать правильно и вовремя, <strong>принесет вам профит</strong>.</span></p><p><span>Этот курс как для новичков, так и для опытных трейдеров. </span></p><p><span><strong>Если по каким-то причинам этот курс вам не подошел (не понравился или вы уже это все знаете и успешно применяете на практике), в течение 30 дней вы можете сделать манибэк!</strong></span></p><p><span>Буду рад ответить на любые ваши вопросы по трейдингу или просто по финансовым рынкам.</span></p><p><span>Виктор</span></p>", 
    "end_date": null, 
    "title": "Торговля опционами: Как заработать на волатильности", 
    "price": "50.00", 
    "instructors": "Viktor Neustroev", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/769340_60cd.jpg", 
    "course_url": "https://www.udemy.com/optiontrading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-21T07:32:50Z"
}