{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t       Работещи финанси на фирмата\r\n</p>\r\n<p>\r\n\t       Курсът <strong>“Работещи финанси“</strong> разглежда в детайли:\r\n</p>\r\n<p>\r\n\t   - четенето,\r\n</p>\r\n<p>\r\n\t   - разбирането и\r\n</p>\r\n<p>\r\n\t   - анализирането на <strong>Отчета за приходи и разходи (ОПР, P&amp;L, IS)</strong>.\r\n</p>\r\n<p>\r\n\t       Показва в детайли как се анализира <strong>приходната част на ОПР</strong>.\r\n</p>\r\n<p>\r\n\t       Показва стъпка по стъпка как да анализирате <strong>разходната част на ОПР</strong>, по какъв начин да разделите разходите, за да придобиете ясна представа за информацията, която те носят.\r\n</p>\r\n<p>\r\n\t       Дава 3 методи за изчисляване на Себестойност на продадените стоки - COGS, себестойност на единица продукция и себестойност на единица складова наличност.\r\n</p>\r\n<p>\r\n\t       Демонстрира <strong>построяването на алтернативни отчети на приходите и разходите</strong> (P&amp;L) с цел по-ясно анализиране на дейността на фирмата.\r\n</p>\r\n<p>\r\n\t       Провокира мислене по време на анализа и дава ясни насоки за действие по време на анализа.\r\n</p>\r\n<p>\r\n\t       В курса е разгледан целият този аналитичен процес чрез <strong>реален пример от практиката</strong>. Към курса е приложен excel файл с този практически пример, който можете да разгледате в детайли и да използвате при анализа.\r\n</p>\r\n<p>\r\n\t     Времетраене на <strong>първата секция</strong> <strong>Основни понятия</strong> е 32,21 минути. Тя е разгледана в две лекции - два клипа.\r\n</p>\r\n<p>\r\n\t     Времетраене на <strong>втората секция - Практически анализи</strong> е 54,11 минути. Разделена е в пет лекции и по-голямата част от времето е отделена на работа с практическия пример, който можете да разгледате в приложен към курса excel файл.\r\n</p>\r\n<p>\r\n\t    Общото времетраене на всички части от курса е 86,32 минути.\r\n</p>\r\n<p>\r\n\t  За час и половина ще видите целия процес на анализиране на отчета за приходи и разходи в детайли с разглеждането на практически пример и даването на ясни насоки за реализиране на анализа и вземане на управленско бизнес решение.\r\n</p>\r\n<p>\r\n\t       Курсът е структуриран в две секции с по няколко видео клипа във всяка от тези секции:\r\n</p>\r\n<p>\r\n\t <strong>Секция 1: Отчет за приходите и разходите - уводна част</strong>\r\n</p>\r\n<ul>\r\n\t<li>Основни понятия</li>\r\n\t<li>части и елементи на ОПР</li>\r\n\t<li>смисълът, който носи всеки от елементите на ОПР</li>\r\n\t<li>какво ни казва ОПР</li>\r\n\t<li>какво не ни казва ОПР</li>\r\n\t<li>обяснителни примери от финансово-счетоводната управленска практика</li>\r\n</ul>\r\n<p>\r\n\t <strong>Секция 2: Анализ на Отчета за приходите и разходите - практическа част</strong>\r\n</p>\r\n<p>\r\n\t      &lt;/span&gt;\r\n</p>\r\n<ul>\r\n\t<li>демонстрация върху реален Отчет за приходите и разходите</li>\r\n\t<li>анализ на приходната част</li>\r\n\t<li>основни променливи величини на прихода от продажби</li>\r\n\t<li>анализ на прихода от продажби</li>\r\n\t<li>сравняване на два отчетни периода</li>\r\n\t<li>Анализ на разходната част</li>\r\n\t<li>как да направим разходите в отчета четими и разбираеми</li>\r\n\t<li>себестойност на произведените стоки/продукция</li>\r\n\t<li>себестойност на единица продукция</li>\r\n\t<li>движение на складовите наличности</li>\r\n\t<li>себестойност на единица складова наличност</li>\r\n\t<li>себестойност на продадените стоки/продукция COGS</li>\r\n\t<li>методи за изчисляване на COGS - себестойност на продадените стоки</li>\r\n\t<li>сравнение на Себестойност на произведените и продадените стоки</li>\r\n\t<li>определяне и използване на увеличенията и намаленията на продукция за даден период</li>\r\n\t<li>построяване на два типа алтернативни отчети за приходите</li>\r\n\t<li>анализиране на алтернативните отчети за приходите</li>\r\n\t<li>Подробни насоки, препоръки и напътствия при анализирането</li>\r\n</ul>\r\n<p>\r\n\t       Всички етапи и стъпки на анализа са представени чрез разглеждане на реален пример от практиката, което прави курса разбираем и приложим.\r\n</p>\r\n<p>\r\n\t  Вмъкнати са препоръки от моята 20 годишна практика във финансовата сфера, което прави курса <strong>“Работещи финанси“</strong> уникален по своята същност и начин на представяне със строго практическа насоченост.\r\n</p>\r\n<p>\r\n\t  Много от нещата в този курс няма да намерите в учебниците по финанси и счетоводство.\r\n</p>", 
    "end_date": null, 
    "title": "Финанси на фирмата", 
    "price": "50.00", 
    "instructors": "Nako Nakov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188648_fb75_3.jpg", 
    "course_url": "https://www.udemy.com/wfcoursenn/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T18:58:53Z"
}