{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>トレードを取り巻く環境の変化がますます早くなる今、相場に振り回されず結果を出し続けるためには、チャートから相場の心理状態を早く正確につかみ、正しいトレードの意思決定をする王道の分析能力がますます必要とされています。</p>\n\n<p><strong>どのような相場でも、他のプレイヤーよりも有利な意思決定をするために習得すべき最も必要な技術がローソク足分析なのです。</strong> </p>\n\n\n\n<p>なぜなら、あなたがトレードをするのがどのようなマーケットであろうと、値段の動きを時系列で表示する手段は「ローソク足」が現代の主流だからです。</p>\n\n\n\n<p>バーチャートやポイント＆フィギュアが独壇場だった欧米も、1990年ころからローソク足へ表示の主流が切り替わりました。</p>\n\n\n\n<p>理由は、意思決定を行うのに最も分かりやすく明快なメッセージを発するのがローソク足であり、それを世界中のトレーダーが好み選んだ結果、業界の標準設定がローソク足チャートに切り替わったのです。</p>\n\n\n\n<p><strong>覚えるパターンは３つのみ！</strong></p>\n\n\n\n<p>当コースは、ローソク足から相場心理をスピーディーに正しく理解し、トレードの正しい意思決定を行うまでの方法を、米国CMT検定1級・現役トレーダーが4時間以上の動画講義でレクチャーします。</p>\n\n\n\n<ul><li>覚えるパターンは３つのみ・・・あとは全て組み合わせ</li><li>ダマシに勝つ｜コンビネーションこそが鍵</li><li>ロケットのように相場を強く打ち出す発射台の見つけ方</li><li>日本式ローソクチャートが最古にして最優秀</li><li>時間足で変わるローソク形状・・・フラクタルを理解する</li></ul>\n\n\n\n<p>このような優れたローソク足分析ですが、残念なことにその発祥である日本で実戦にもとづいた使い方を説明した資料を目にすることがありません。</p>\n\n\n\n<p>つまり、あなたは当コースで実戦的なローソク足の使い方を学ぶことで、ローソク足を使う相場で、他の参加者よりも早く優位性のある決定ができるようになるのです。</p>\n\n\n\n<p><strong>以下のような方に受講をして成功していただきたい</strong></p>\n\n\n\n<ul><li>サインツールから脱却し、自分で決めるトレード方法を目指す方</li><li>短期でも長期でも使える方法を探している方</li><li>今までよりも一歩早い意思決定を可能にしたい方</li><li>ローソク形状の理由を知り応用につなげたい方</li><li>理論よりもリアルチャートから学びたい方</li></ul>\n\n\n\n<p><strong>成功し収益を上げるトレーダーが使う方法を、あなたのものにしてください。</strong></p>\n\n\n\n<p>トレードで買ったり売ったりするとき、私達は気が付かないうちに「もっと儲けたい」「損をするのは嫌だ」というような感情に従って決めています。そうした参加者たちの集団心理は、チャートを一定の形状に収めていきます。</p>\n\n\n\n<p>トレードで成功を収めている人は、感情の外側に立つだけでなく、チャートの形状を分析することで相場の法則を知り、うまく活用をしています。</p>\n\n\n\n<p>当コースでは、あなたがその法則を知り活用する側に回るために、基本となる３つのパターンが形成される過程での相場心理を豊富な実例をもとに詳しく説明しています。</p>\n\n\n\n<p>ローソク足があなたに伝えようとしているメッセージを理解することで、相場に振り回されることなく、今までより一歩早く決めることができる具体的な方法を提供するのは、当コースのみです。</p>\n\n\n\n<p><strong>CMT１級の現役トレーダーが講師</strong></p>\n\n\n\n<p>講師は米テクニカルアナリスト協会公認資格CMT検定1級を持つ現役トレーダーの佐々木徹。受講生総数は1,180名を超え、2014年7月には日本人で初めてUdemyトップ15講師入りした公認講師です。</p>\n\n\n\n<p><strong>30日間の返金保証付き</strong></p>\n\n\n\n<p>Udemy社公認の当コースには30日間の返金保証が付与されています。購入したけれど効果が無かった、思った内容と違った、払っただけの価値が無かったと思われた場合には、遠慮なくUdemy宛に返金の依頼を申し出てください。</p>\n\n\n\n<p><strong>コース更新について</strong></p>\n\n\n\n<p>当コースは無期限に内容を追加、更新していくもので、直近では8月5日に以下のセクションを追加し公開しました。</p>\n\n\n\n<p><em>追加セクション（2015年8月5日）：包み足パターンを応用する</em></p>\n\n\n\n<ul><li>包み足+＠｜ローソクの色がパターン成立に関係ない理由</li><li>売りと買いの戦いがパターンを形成｜株式を例に説明</li><li>自動検知したローソク足パターンの功罪</li><li>ダマされないローソク足パターンの必須条件（振り返り）</li><li>相場のスピードを視覚化するとローソク足になる</li><li>包み足のパワーを計測・・・ドル円256倍の事例</li><li>異なる時間足チャートでローソクパターンがよく利く場所を見つける</li></ul>\n\n\n\n<p>今後も内容を追加し、都度で価格に転嫁をさせていただきますが、本日受講の手続きをされた方は、今後の追加講義も、全て追加費用無しで受講が可能です。</p>\n\n\n\n<p>最後までお読み頂き、ありがとうございました。それでは、あなたと講義でお会いできることを、心より楽しみにしております。</p>", 
    "end_date": null, 
    "title": "ローソク足で高収益トレード｜3つのパターンでGO！", 
    "price": "50.00", 
    "instructors": "佐々木徹 (Toru Sasaki)", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342062_7aff_5.jpg", 
    "course_url": "https://www.udemy.com/high_profit_candle_trading/", 
    "currency": "USD", 
    "subject_name": [
        "Finance"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T04:45:27Z"
}