{"selfpaced": false, "topic_name": ["Literature"], "description": "\n\n                    \n                    \n                    Students will question for themselves the meaning of human freedom, responsibility and identity by reading and responding to Dante Alighieri's Divine Comedy. The Comedy, which is richly steeped in the medieval culture of the 14th century, still speaks vividly to modern readers struggling with the question, “who am I?” Dante, as a Florentine, a poet, a lover, and religious believer, struggled with the same question in each facet of his life before coming to a moment of vision that wholly transformed him as a person.\n\nAs a 21st century reader, you will encounter the poem in a novel online environment that integrates knowledge from the disciplines of literature, history, psychology, philosophy, and theology with modern technology. You will be guided through the poem by means of the \"MyDante\" Project, an online environment developed by Professor Ambrosio in collaboration with the Georgetown University Center for New Designs in Learning and Scholarship (CNDLS), which will aid your own contemplative engagement with the poem. Alone and with the edX community, you will reflect on both Dante's interpretation of freedom and how it functions in the formation of personal identity, and the problem of finding appropriate metaphors to discuss these issues in our modern life.\n\nYou, the modern reader, will only understand the full implications of Dante's poetry if you participate with it in a way that is personal and is genuinely contemplative. You will discover that contemplative reading goes beyond the literal meaning, and even beyond the traditional allegorical and interpreted meaning, to apply every possible meaning contained in the text to your own life and identity. Through the MyDante platform, you will learn to know yourself in your own historical, personal, and spiritual contexts as you journey towards your understanding of your personal freedom and identity.\n\n                                    ", "end_date": "2016-05-10T00:00:00Z", "title": "HUMX421-­02x: The Divine Comedy: Dante's Journey to Freedom, Part 1", "price": 0, "instructors": "Frank Ambrosio", "institution_name": ["Georgetown University"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/divine-comedy-dantes-journey-freedom-georgetownx-humx421-02x", "duration": "8 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-03-15T00:00:00Z"}