{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Either you have recently signed up for Infusionsoft and are still trying to get away from your old Aweber account or you are currently using Aweber and looking to switch to a different service and are considering Infusionsoft. </p>\n\n<p>Either way, this is the course for you. </p>\n\n\n\n<p>Most people are so focused on starting to use their new, cool, bright &amp; shiny Infusionsoft system that they jump right in and then suddenly they have to also figure out how to move their people. </p>\n\n\n\n<p>Your Kickstart help person will help you export your lists and import them into Infusionsoft. However their goal is usually to help you get some people in your new Infusionsoft application and sending a broadcast or other communication. </p>\n\n\n\n<p>But <strong class=\"redactor-inline-converted\">what you actually need is to completely switch over</strong> so you can cancel your Aweber. And there is more involved than just exporting a list. </p>\n\n\n\n<p>This course will take you <strong class=\"redactor-inline-converted\">step by step, one process at a time</strong> through <em class=\"redactor-inline-converted\">getting completely, 100% switched over</em> so you can move forward, cancel your Aweber account and never look back. </p><p>This program is not going to talk about <em>how you might</em> do that...<br></p>\n\n<p>It is going to <strong class=\"redactor-inline-converted\">show you EXACTLY how to make it happen</strong>. Including you watching me as I actually do it. </p>\n\n<p>It also includes checklists you can use to make sure you don't miss anything. </p>\n\n<p>I can't count how many Infusionsoft users I meet who switched to Infusionsoft because it allowed them to have all of their processes and systems in one single application, but they are still paying for their old system because they have people there too. </p>\n\n<p>So now they are managing both systems, never knowing if they should email or not since they have some of the same people in both places and they don't want to email them the same thing twice. </p>\n\n<p>It <strong>quickly becomes a big mess....</strong></p>\n\n<p>Unless you have a plan and a specific set of steps to follow to completely move out of Aweber. </p><p>~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~</p>\n\n<p><strong class=\"redactor-inline-converted\">Frequently Asked Questions:</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Why do I need your course, can't I just ask support?</strong><br></p>\n\n\n\n<p>Definitely, you can call up support and ask them. However they will have limited knowledge of Aweber and their advise will be to export your list and import it into Infusionsoft. </p>\n\n<p>Don't get me wrong....Infusionsoft Support it great. However they serve best if you know what questions to ask. Rather than wanting general information. </p>\n\n<p><strong class=\"redactor-inline-converted\">It seems pretty simply, why can't I just figure it out myself...for free? </strong></p>\n\n<p>Again, you are right. I am sure you are capable of figuring it out, eventually, yourself. However do you have time? Don't you have other things it would be better for you to spend your time doing? </p>\n\n<p>I am sure with enough time you can learn to do almost anything on your own. Trial and error, a few mistakes along the way, etc. will eventually get you to the result you want. </p>\n\n<p>But...do you want to trial and error and hope with your list? </p>\n\n<p>Do you want to spend hours and hours and days and days \"figuring it out\"? </p>\n\n<p>Or do you simply want someone to show you have to do it so you can get it done and more on to something else? </p>\n\n<p><strong class=\"redactor-inline-converted\">Do I need to have Infusionsoft to use this course?</strong><br></p>\n\n\n\n<p>Yes :) Or...you will need it in order to actually do the steps. Of course that is the point so...</p>\n\n<p>If you are planning a move soon and do not have Infusionsoft quite yet, that is okay. It does not hurt to go through the course so you are familiar with the steps and screens etc once you do purchase Infusionsoft. </p>\n\n<p>If you are still deciding on purchasing please reach out to me and I will be happy to connect you with someone who can help you decide, answer any and all questions you might still have and even get your registered and ready to go. .</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Do I need to be a techy person?</strong></p>\n\n\n\n<p>Nope. I will show you exactly step by step each button to push, each screen to look at and where to do what. You WILL need to be able to make decisions about how you want things to run in your business, be able to write a couple of emails and follow directions. But no techy-ness is required for this part of getting started with Infusionsoft. </p>", 
    "end_date": null, 
    "title": "Converting Your Business From Aweber To Infusionsoft", 
    "price": "40.00", 
    "instructors": "Cindy Clemens", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822608_754a_2.jpg", 
    "course_url": "https://www.udemy.com/aweber-to-infusionsoft/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T07:59:09Z"
}