{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Do you TRUST the data you see in your clients Google Analytics account? Having trouble figuring out the CONFIGURATION that works best for your clients? Need a PROCESS that gives you a super solid setup of Google Analytics? This course if for you.</p>  <p style=\"\">  \t      After working with many different companies on their Google Analytics accounts I often noticed wide data gaps due to a faulty setup of Google Analytics. The big problem of Google Analytics is: It&#039;s not Retroactive - You can&#039;t go back and make changes to the existing Data in your Account.  </p>  <p style=\"\">  \t      You need to track it <strong style=\"\">RIGHT</strong> from the start.  </p>  <p style=\"\">  \t      This video training will give you all the tools to provide your clients with a SUPER solid setup of Google Analytics.  </p>  <p style=\"\">  \t      A Google Analytics account with….  </p>  <ul style=\"\">  \t<li style=\"\">accurate data that you can trust</li>  \t<li style=\"\">best practice configurations</li>  \t<li style=\"\">customized to your client</li>  </ul>  <p style=\"\">  \t      This course was specifically designed for <strong style=\"\">Web Designers, Agencies, Developers</strong> and all those who often setup Google Analytics accounts for their clients. I know that speed, accuracy and scalability are important in this industry, so I&#039;ve build this as a PROCESS driven course, which you can pass on to whoever sets it up.  </p>  <p style=\"\">  \t      You&#039;ll get:  </p>  <ul style=\"\">  \t<li style=\"\">a step by step Video Guide  (explained in over 20 videos) on how to setup GA</li>  \t<li style=\"\">a Process that you can follow (over and over again) or even outsource</li>  \t<li style=\"\">a Checklist that you can use to give to your clients upon completion</li>  \t<li style=\"\">extra Resources to customize your Clients Google Analytics installation</li>  </ul>  <p style=\"\">  \t  \t<strong style=\"\"> Need more information?</strong> Please feel free to reach out via my instructor profile.  </p>", 
    "end_date": null, 
    "title": "Correct Google Analytics Setup - Start trusting your data", 
    "price": "50.00", 
    "instructors": "Julian Juenemann", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413650_44a5_2.jpg", 
    "course_url": "https://www.udemy.com/google-analytics-setup-for-agencies-and-web-designers/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T23:58:26Z"
}