{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Marketing is getting faster paced by the minute and it can be really hard to keep up as well as analyse whats right and whats wrong with your marketing. That's where my course comes in. My course is designed to give everyone that is interested in marketing the tools to analyse campaigns and use metrics to make correct decisions improving your campaign success.</p><p>It is designed with a great fun foundation building up on previous lectures and information all the way till you are ready to launch your own campaign and lastly analyse it. My course will prepare you with realistic concepts so that you can use it right away whether you own your own business, work in marketing or even manage a team and want more from your campaign data.</p><p>Data doesn't have to be boring, my course will paint a picture rich in information and detail which you will use to better your campaign and think objectively on how to improve your results. </p><p>This course is for you if:</p>\n\n<p>You are a student and want to be work ready in marketing/sales/media</p>\n\n\n\n<p>You are a manager and want tools to improve results on current campaigns.</p>\n\n\n\n<p>If you are an owner/CEO and want to know in depth what the data and report means for your business.</p><p>So take the course I always wish I had when I started in Marketing and get the competitive edge in this ever changing industry!</p>", 
    "end_date": null, 
    "title": "Data Driven Marketing A-Z: Improve Your Campaign Performance", 
    "price": "40.00", 
    "instructors": "David Tanaskovic, Kirill Eremenko", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858848_98de.jpg", 
    "course_url": "https://www.udemy.com/data-driven-marketing-a-ztm-beginners-guide-to-analytics/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T17:51:55Z"
}