{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>NOTE: The price of this course will be rising to $97 soon! Get the Infusionsoft course with the best reviews at this one-time low rate, now!</strong><br></p><p>This UDEMY Exclusive was created to get you up and running with Infusionsoft with ease. Time is our greatest asset, so I refuse to waste yours by making a 'dragged out course' that's full of awkward pauses, \"ums\" and \"ahs\". You're a busy entrepreneur, I get it! So let's get cracking!</p><p>You'll find this course is quick, bulletproof, and full of actionable insight. I walk you through how to set up a marketing funnel, how to navigate the campaign builder, broadcasting to your list, as well as tips and tricks of the software. Oh, and it's all broken into bite-sized pieces! </p><p>When I started using Infusionsoft in Oct. 2014 it came with four 60 minute calls to get me started. These calls were SUPER helpful, however I was quick to realize that the scope of what I was trying to do was beyond just FOUR calls. In my digging,<strong><em> I learned that a single coaching call with an Infusionsoft coach started at </em></strong><strong><em>$199USD</em></strong> (at the time - Late 2014)! So after spending hours scouring the net, looking at tutorials and so forth, I decided to create this course to sum it all up! </p><p>My goal with this course is to get you up to speed, and when you buy now you'll learn how it all works so you can impress your coach - AND get them to help you with the advanced marketing functions! Why waste it learning to navigate the basics when you can make those coaches WORK FOR YOUR NEEDS? You ARE paying them, after all. :-)</p><p>You will learn the in's and out's of Infusionsoft, so you can avoid technical overwhelm as a new user. It shows you an overview of the technical elements of creating a marketing campaign as well as help you unlock the insight to create your own automated marketing campaign for your own business. If you're looking to create elegant squeeze pages so you can start collecting contact info and building your list, you'll get a lot out of this course as well!</p><p><strong>1) What's Included:</strong> You get over 60 minutes of <em><strong>concise</strong></em> content, broken into 6 videos that show you:</p><p>-An overview of 3 marketing pipelines that I have created and used in my business that <em><strong>have made money</strong></em>.</p><p>-How to <em><strong>navigate Infusionsoft's campaign builder</strong></em>, so you can make your first marketing campaign with ease.</p><p>-How to <strong><em>capture contact info</em></strong> using squeeze pages, so you can gather new opt-ins and grow your mailing list.</p><p>-How to <strong><em>harness the power of \"sequences\"</em></strong>, so you can create an automated series of e-mails that allow your new leads to build familiarity and trust with you.</p><p>-How to <em><strong>save time</strong></em> by creating e-mail templates, so you can do the work once and have it ready to use again and again.</p><p>And best of all, <em><strong>act now and you get the entire course for  half the price of ONE Infusionsoft coaching call</strong></em> ($199 USD). </p><p><strong>2) Price:</strong></p><p>The course is now listed at $49, however I will be raising the price to $97 by the end of this year.</p><p><strong>3) REFUND POLICY:</strong></p><p>Udemy offers an amazing 30 day money back guarantee! You LITERALLY have no risk. By the course, put it to work, and if you still don't love it, ask to get your money back! It's the main reason I LOVE Udemy - they put student's first. :-)</p><p><strong>4) Why take this course?</strong></p><p>Infusionsoft has a steep learning curve, and it can cost you a LOT of time learning how to make it work on your own. Thankfully, when you become an Infusionsoft member, you get 4 coaching calls with their in-house Infusionsoft experts. </p><p>Use this quick start guide to create your first marketing funnel, so you can make the most of your free calls. Don't waste these calls going over the \"basics\", when you can be up to speed in about an hour.</p><p><strong>5) Requirements:</strong></p><p>1) Do I need to have Infusionsoft to get this course? </p><p>No. If you do not have Infusionsoft yet, get the course. I have a direct relationship with the team, and I can connect you directly (and get you an amazing deal not available to most).</p><p>2) Do I need to be a marketing expert?</p><p>No, you can be completely new to online marketing and take it serious. I made my first $3000 online shortly after taking the leap of faith. <em>(results not typical or guaranteed) </em></p><p>3) Do I need any additional software to make the most of Infusionsoft?</p><p>I recommend you use an easy-to-use lead page creator. I use Leadpages in the tutorial, as well as show you another one called Megaphone.</p><p>4) Which version of Infusionsoft do I need to get in order to make the most of this course?</p><p>Autopilot marketing was designed to work with <em><strong>ANY</strong></em> of their 4 membership options. I personally use the \"e-commerce\" package as I run an online business.</p><p><strong>6) How Long Will The Course Take To Complete?</strong></p><p>Autopilot Marketing was designed to work at your own speed. You should be able to get everything up and running in 4-6 hours, depending on your learning speed, and how quickly you can \"fill in the blanks\" within your own campaign. </p><p>Now that I have learned these same essentials that I share with you when you act now, I can bang out a complete campaign in a couple of hours, including the e-mail copy, photos, opt-in pages, etc.</p><p>-----</p><p>So what are you waiting for? With Udemy's 30 day refund policy, I take all the risk and put MY money where my mouth is! YOU HAVE NOTHING TO LOSE! Let's do this! I'll see you on the inside. :-)</p>", 
    "end_date": null, 
    "title": "Get More From This Than Your '4' Coach Calls (INFUSIONSOFT)", 
    "price": "50.00", 
    "instructors": "Marcus Rideout", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452646_26b3_10.jpg", 
    "course_url": "https://www.udemy.com/autopilot-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-20T22:43:08Z"
}