{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>*This course is not sponsored by or affiliated with Udemy, Inc.</p><p><strong class=\"redactor-inline-converted\">Who should take this course?</strong><br></p>\n\n<p>If you have your own Udemy course and want to make more sales (I think all of us want that) then this is the course for you.  </p>\n\n<p>This course is beneficial to anyone who has a Udemy course because it allows you to understand how to use Google Analytics with your Udemy course to make more sales.</p>\n\n<p>   Google Analytics is free software that helps you better understand:</p>\n\n<ul><li>Real-Time data to understand how people are interacting with your course at any time.</li><li>The students of your course and demographics associated with them</li><li>How you are acquiring new students in your Udemy course</li><li>What students are doing in your course and the most popular lectures</li><li>How students are purchasing your course, where those students are located, and how many missed sales you have</li><li>Even more metrics around your audience and student acquisition</li></ul>\n\n<p><em><strong class=\"redactor-inline-converted\">Please note that you DO NOT need to have prior knowledge of Google Analytics to take this course, everything is clearly defined in the lectures.</strong></em><br></p>\n\n<p>Please note that the course defines all of the terms you need to know to use Google Analytics and the lectures only examine areas that are beneficial for Udemy instructors. </p>\n\n<p><strong class=\"redactor-inline-converted\">What went into producing this course?</strong></p>\n\n<p>In total, this course is about 2 hours of total content. This course took a tremendous amount of work and has a very high production value. There was a team of three people who worked a total of 80+ hours on this Udemy course.</p>\n\n<p><strong class=\"redactor-inline-converted\">What is this course about?</strong></p>\n\n<p>Although Udemy offers a way to integrate Google Analytics within your course, there isn't much information available that helps you understand how powerful Google Analytics is for Udemy Instructors.  </p>\n\n<p>This course is the resource that will help you understand the power of Google Analytics.</p>\n\n<p>By using Google Analytics, you'll be able to better understand your audience more than ever before and with this knowledge, you will be able to connect with your students more easily through advertising and promotional efforts.  </p>\n\n<p><strong class=\"redactor-inline-converted\">What kind of materials are included in this course?</strong></p>\n\n<p>This course has two different types of videos in the lectures.</p>\n\n<p>The first type of videos explain general concepts and uses animations and call-outs to illustrate key concepts.<br></p>\n\n<p>The second type of videos are screen recordings with call-outs that show you exactly what you need to know to use Google Analytics with your course.</p>\n\n<p>Every lecture also has a PDF download so that students can print out those materials and take notes if needed.</p>\n\n<p><strong class=\"redactor-inline-converted\">Why take this course?</strong></p>\n\n<p>If your course isn't selling well on Udemy, this course is going to be extremely helpful.  It gives you a very detailed understanding of how your students interact with your course so you can make better content and where your students are coming from so you can advertise more effectively, </p>", 
    "end_date": null, 
    "title": "Google Analytics For Udemy - Unofficial", 
    "price": "20.00", 
    "instructors": "Ron Stefanski", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403198_c8d4.jpg", 
    "course_url": "https://www.udemy.com/use-google-analytics-to-increase-udemy-course-sales/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-24T22:06:19Z"
}