{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>LATEST:  <em>Course Update #6 -- July 1st, 2015 --</em></strong><em> Another lecture added covering a feature in Google Analytics.</em></p><p>  \t<strong>  ******Join the 1200+ students who are using these techniques to improve their websites, get more traffic and earn more  money</strong><strong>*****</strong></p>  <p>  \t         Google Analytics.  Every website owner knows they need to use it and many more that do set it up don't do anything more then check their traffic stats.  <strong>You can be different.  You can use Google Analytics to improve your website, get more traffic and make more money!  </strong>But how?  </p>  <p>  \t         You've seen <strong>other courses</strong> out their on Google Analytics before.  What are those courses like?  <em>They cover every little thing about Google Analytics, every report, every setting and so on, <strong>without providing any</strong></em><strong> ACTIONABLE INFORMATION.</strong>  </p>  <p>  \t<strong>Just go and look at those other courses.  </strong><em>What do you see? </em> Generally, it is a list that looks like:  </p>  <ul>  \t<li>Some report name</li>  \t<li>Some other report name</li>  \t<li>Hey look, yet another report</li>  \t<li>Look, we are going to list every single report in Google Analytics</li>  \t<li>And so on</li>  </ul>  <p>  \t         Well, it could be worse.  It could be a list of the most technical sounding language that you could find.  You know what I'm talking about.  Those phrases that make your eyes glaze over.  Stuff like <em>\"Enhanced Link Attribution for In Page Analytics\".</em>  I won't lie.  My eyes glazed over a little just writing that out.  </p>  <p>  \t<strong>So what makes this course different?</strong>  To start off with, take a look at the titles of the lectures in this course.  We don't spend 99% of the course explaining what a report is, we use the minimum time necessary to get you setup and familiar with Analytics so that you can actually use it.  But again, take let's take a look at a few typical lecture titles:  </p>  <ul>  \t<li>Improve your content</li>  \t<li>Ideas for new content</li>  \t<li>Find the best days to post</li>  \t<li>Building relationships and backlinks</li>  </ul>  <p>  \t         Wow, wait a second.  That sounds a lot like <strong>ACTIONABLE INFORMATION.  </strong>We won't spend the entire course explaining every little detail of every report, because, in all honesty, very few people have or are willing to give the time to get every single thing that you can out of Google Analytics.  <strong>Instead, we'll cover specific steps you can take with your website that will help you to ultimately get more traffic and earn more money.</strong>  </p>  <p>  \t<strong>Do you want an ADDED BONUS?</strong>  Well, how about this:  Every lecture that covers an actionable method comes with a downloadable PDF guide.  So you don't have to worry about taking a massive amount of notes to remember every little thing we've went over.  That's right.  Every single lecture in <em>Section 4:  Practical Applications of Google Analytics</em> has a downloadable PDF guide.  As <strong>another bonus</strong>, we provide PDF guides at the end of the Sections 2 and 3 also, so that you have the key take-a-ways ready for you.  </p>  <p>  \t         So what do we cover?  In this course, we'll cover:  </p>  <ul>  \t<li>What Google Analytics is</li>  \t<li>What does it cost and how do you get it</li>  \t<li>Why you should use it</li>  \t<li>The privacy and sharing settings</li>  \t<li>Setting up a Google account</li>  \t<li>Setting up an Analytics account</li>  \t<li>Installing the tracking code</li>  \t<li>An overview of the interface</li>  \t<li>A brief explanation of the main reports we'll cover</li>  \t<li>15 lectures that each cover one specific thing you can take from Google Analytics and apply to your site to improve it, which will ultimately get you more traffic and more earnings.</li>  </ul>  <p>  \t<strong>You know that you need to use Google Analytics.</strong>  But you've been avoiding it because it looks really technical and boring.  I can't make Google Analytics the most exciting thing ever, but I can skip over all the unnecessary stuff that clogs up most Analytics courses and go straight to actionable information that you can apply to get the most that you can out of your website.  </p>  <p>  \t<strong>So click the <em>\"take this course\"</em> button</strong>, up at the top right, now ....<em> so that you can finally use Google Analytics to get your website to where you want it to be.</em>  </p>", 
    "end_date": null, 
    "title": "Google Analytics - Beginner Strategies for Google Analytics", 
    "price": "45.00", 
    "instructors": "Curtis Daniel", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336526_b1f7_2.jpg", 
    "course_url": "https://www.udemy.com/googleanalyticsmadeeasy/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T14:13:18Z"
}