{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is not sponsored by or affiliated with Udemy, Inc.\n</p>\n\n<p>Google Analytics course is up-to-date as of JUNE 2016! </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<strong>2,300 STUDENTS plus THIRTY FIVE-STAR REVIEWS!!! THANK YOU!!!</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              Kimberly S says, \"<em>This course walks you through the basics, step-by-step from A to Z.</em>\"  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              Sicco R says, \"<em>I now see this is a must for Udemy teachers who wish to understand and improve conversions!</em>\"  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                              Kimberly F says, \"<em>This is a great course that does a great job of explaining how to implement Google Analytics for your Udemy course.</em>\"  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Micki B says, \"<em>Scott did a great job of explaining all of this simply, and to the point and saved me hours of wasted time . Thanks Scott.</em>\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Jessica B says, \"<em>Just what I needed!</em>\"</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                           This course is for <strong>Udemy instructors like you</strong> who want to learn <strong>how to set up Google Analytics</strong> to track visits, page views, and conversions for your Udemy course.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                           Don't worry if you haven't used Google Analytics before. In this course, you'll see everything you need to set up Google Analytics to get accurate data.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                        This course is very focused on <strong>Google Analytics for Udemy courses</strong> - a step-by-step guide to setting it up, and what each of the key reports means from an instructors point of view.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                           In this course, you will learn:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>How to register for a new Google account</li>  \t<li>How to use your existing Google account to create a Google Analytics account</li>  \t<li><strong>Where to get the Google Analytics tracking code</strong></li>  \t<li>How to add that tracking code to your course in Udemy settings</li>  \t<li>The basic traffic reports - sessions, users and bounce rate</li>  \t<li><strong>Tracking the source of traffic - including referrals</strong></li>  \t<li>Seeing which lectures of your course are viewed most often</li>  \t<li>Filtering out your own IP address from reports</li>  \t<li>Segmenting your traffic into all visitors, only mobile visitors, new visitors, etc</li>  \t<li><strong>Setting up goals and the Udemy-specific funnel</strong></li>  \t<li>And how to understand the goal reports</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Keep in mind that Udemy offers an unconditional 30-day money back guarantee, no questions asked. More than that, I personally want to ensure your satisfaction and will be available to help you set up and understand your analytics. As the instructor, I am always here to answer questions, and help you get setup on Analytics. If you are having a specific problem, or want to know \"can I do this?\", I am a private message away.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Every day your course is on Udemy and not collecting your Analytics data, is a day missed. You can't go back in time and collect it later. So get this course today, and in less than an hour, you'll be set up in Google Analytics and seeing in real-time as viewers come to your course page, and what percentage of them buy.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Google Analytics for Udemy – Unofficial", 
    "price": 0, 
    "instructors": "Scott Duffy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341668_d342_6.jpg", 
    "course_url": "https://www.udemy.com/google-analytics-for-udemy/", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T19:46:53Z"
}