{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Avez-vous déjà vu ou entendu parler d'un capitaine de bateau qui naviguerait sans carte ou outil technologique pour s'orienter? L'analogie s'applique autant aux entreprises qui ont une présence numérique, mais qui ne mesurent pas l'efficacité de leur site web.</p><p>Dans cette formation de plus de 6h, Frédéric Gonzalo (consultant, conférencier et blogueur expert en marketing numérique touristique) et Bernard Prince (stratège web <strong>Google certified</strong>) décortique pas à pas l'outil Google Analytics. Ce cours vous permettra de mieux comprendre l'outil, d'analyser la performance de votre site web, particulièrement <strong>dans une perspective touristique</strong>, et d'optimiser votre présence en ligne.</p><p>La formation comporte deux volets. Le premier se veut une formation 101 pour comprendre Google Analytics dans son ensemble et décortiquer chacun des menus, en personnalisant l'interface (tableaux de bord, rapports, raccourcis, alertes, etc). Le deuxième volet, la formation 201, a pour but de vous mener à performer sur Google Analytics, notamment par la création de campagnes AdWords et de remarketing. Par conséquent, cette formation s'adresse autant aux débutants qu'aux utilisateurs de niveau intermédiaire de Google Analytics.</p><p>Une version PDF des présentations, facile à imprimer, est également disponible pour ceux qui désirent suivre les formations avec une version papier.</p><p><strong> Les objectifs</strong></p><ul><li>Se familiariser avec le vocabulaire de Google Analytics.</li><li>Comprendre ce qui est mesurable pour configurer adéquatement Google Analytics sur votre site web.</li><li>Démystifier l'interface de Google Analytics par une présentation pas-à-pas de chacun des onglets.</li><li>Savoir quels objectifs prioriser et comment transformer ceux-ci en intelligence d'affaires.</li><li>Créer des rapports qui vous parlent et les partager au sein de votre organisation.</li><li>Élaborer une campagne Google AdWords et l'analyser.</li></ul><p><strong>À qui s'adresse cette formation ?</strong></p><ul><li>Aux gestionnaires en communications et marketing</li><li>Aux propriétaires de petite ou moyenne entreprises</li><li>Aux étudiants en marketing et/ou programme en tourisme</li><li>Aux professionnels du tourisme (agents de voyages, conseillers loisirs, hôteliers, restaurateurs)</li><li>Toute personne intéressée par l'évolution du marketing numérique</li></ul>Si vous souhaitez plus d'information sur la formation, n'hésitez pas à nous envoyer vos questions.", 
    "end_date": null, 
    "title": "Google Analytics dans une perspective touristique", 
    "price": "20.00", 
    "instructors": "Frédéric Gonzalo", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532210_6a0f_2.jpg", 
    "course_url": "https://www.udemy.com/google-analytics-dans-une-perspective-touristique/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T14:47:54Z"
}