{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<ul><li>Struggling with your marketing efforts? </li><li>Confused as to how to measure your progress?</li><li>So are millions of other marketers. </li></ul>\n\n<p>That's why Google created Analytics - to increase confidence in their marketing platform called AdWords, where they generate 99% of their billion dollar revenue.</p>\n\n\n\n<p><strong>Welcome To Google Analytics For Marketing - Boost Sales &amp; Lower Costs! </strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>⇉ Watch the promo video</strong> to see How You Can Master Google Analytics Today! </p>\n\n\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ You receive 20+ </strong>streamlined lectures and <strong>3+ hours of HD video content</strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Student Success Testimonials: </strong></p>\n\n\n\n<ul><li>Jessica</li></ul>\n\n\n\n<p>8 days ago</p>\n\n\n\n<p>Insightful, quick, and relatable</p>\n\n\n\n<p>A good course for those who want to get a quick rundown of how Google analytics work. I liked how the instructors seemed to give personal advice from their own experiences and are very helpful on an individual basis. The lectures were also pretty short and snappy.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p> So many marketers don't know how to use analytics. They don't know how to boost sales or lower costs. They don't know what metrics to pay attention to and why. They don't know, for example, that a 20% decrease in bounce rate can mean up to a 50% or more increase in revenue.<br><br>But you're not like them. You sought out this course to get help and improve your marketing strategy and results. You're willing to spend a few dollars to massively improve your comprehension and mastery of Google's Analytics tool. You're going to learn how to increase your sales, and decrease your marketing costs. Along the way, you'll learn tips and tricks about paid advertising campaigns and how they fit into the Analytics picture. You'll also get a thoughtful response for every question you ask along the way, so there's no concern about getting stuck.</p>\n\n\n\n<p><strong>Here Is What You Will Learn Throughout Our Course: </strong></p>\n\n\n\n<ul><li>The Fundamentals of Google Analytics </li><li>How To Increase Your Sales</li><li>How To Decrease Your Spending</li><li>Advanced Tracking</li><li>Common Mistakes </li><li>Case Studies </li><li>And So Much More! </li></ul>\n\n\n\n<p>__________________________________________________________________________<br></p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards understanding how to master Google Analytics! </p>\n\n\n\n<p>When I learn something new, I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p>This course will not remain this price forever! It's time to take action!</p>\n\n\n\n<p><strong>Click the \"take this course\" button at the top right now!</strong></p>\n\n\n\n<p>...<em>every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p>Joe Parys &amp; Nikaoli Warner </p>", 
    "end_date": null, 
    "title": "Google Analytics for Marketing - Boost Sales & Lower Costs", 
    "price": "20.00", 
    "instructors": "Joe Parys, Nikolai Warner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597768_2f04_2.jpg", 
    "course_url": "https://www.udemy.com/googleanalytics/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T23:50:50Z"
}