{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>CURSO DE GOOGLE TAG MANAGER - VÍDEO AULA</strong></p><p>O curso consiste em familiarizar e mostrar a importância do Google Tag Manager, ferramenta que chegou para facilitar, organizar e padronizar tudo referente a tagueamento.<br></p><p>Nos tempos que estamos vivendo na mídia digital, com um alto índice de tecnologia, sempre precisamos implementar novas tags ou funcionalidades, fazendo com que tenhamos que acionar com uma enorme frequência os times de tecnologia, mesmo que seja para alguma implementação simples, porém, o Google Tag Manager faz com que consigamos tirar alguns trabalhos do time de TI, e para casos mais complexos, facilitar o trabalho desse time.</p><p>A ferramenta foi desenhada de forma que facilita muito a implementação de algumas tags mais conhecidas, dentre elas, todos os produtos Google, trazendo diversos templates pré-programados, onde só adicionamos algumas informações, e além disso, espaços em branco para inserirmos quaisquer tipos de tags ou códigos que precisemos ter nas páginas.</p><p>Além de todas as facilidades, muitas plataformas de e-commerce estão prestando um serviço já com essa ferramenta implementada, e em alguns casos, só trabalham com implementações via Google Tag Manager, fazendo com que tenhamos que ter pelo menos o mínimo de conhecimento na ferramenta.</p><p><strong><br></strong></p><p><strong>Objetivo:</strong></p><ul><li>Apresentar as funcionalidades, possibilidades e noções de como utilizar o Google Tag Manager</li><li>Entender como funciona a estrutura para implementa-lo.</li></ul><ul><strong><ul><strong><br></strong></ul></strong></ul><p><strong>Duração:</strong></p><p>O Curso Online de Métricas ROI tem carga horária total de 2 horas.</p><p><strong><br></strong></p><p><strong>Público Alvo:</strong><br></p><p>O curso de Métricas ROI destina-se a profissionais do marketing digital, negócios, estudantes, empresários, empreendedores e demais profissionais que desejam conhecer ferramentas e metodologias para a mensuração de performance de projetos digitais.</p><p><br></p><p><strong>Conteúdo Programático:</strong><br></p><ul><li>O conceito do Google Tag Manager</li><li>Estrutura e código</li><li>dataLayer</li><li>Tags</li><li>Macros</li><li>Regras de disparo</li><li>Parte prática</li></ul><ul><p><strong>Por que escolher a ComSchool?</strong></p></ul><li>Única escola no Brasil com cinco livros publicados na área digital</li><li>Líder nacional no ensino de negócios digitais – a ComSchool é a mais tradicional escola de comércio eletrônico, redes sociais e marketing digital do Brasil</li><li>Programa inovador, fundamentado no conhecimento prático dos professores</li><li>Corpo Docente com mais de 100 professores, incluindo mestres, doutores, autores de livros, diretores e CEOs de grandes empresas</li><li>Estude com alguns dos nomes mais influentes da Internet brasileira</li><li>A única escola de negócios digitais no Brasil com programas internacionais de estudo com delegações para o Shop .org, Internet Retailer e programa internacional com certificado da Universidade do Texas</li>", 
    "end_date": null, 
    "title": "Google Tag Manager", 
    "price": "20.00", 
    "instructors": "ComSchool Cursos", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735452_5092_2.jpg", 
    "course_url": "https://www.udemy.com/google-tag-manager-comschool/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T13:41:47Z"
}