{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Do you know where your most profitable customers come from and how they are finding you? What about how to identify untapped opportunities for new customers? </p><p style=\"\">No? </p><p>Then this course is for you. After taking this course you&#039;ll quickly gain all the skills you need to be a Google Analytics power user.  </p>  <p>  \tGoogle Analytics for Beginners takes you through all the reports found in your Google Analytics account. We&#039;ll dive in deep, as I explain each of the reports in detail and show you exactly how to use the information they contain to grow your business online.  </p>  <p>  \tThis course follows a step-by-step process – using screencasts of an actual live Google Analytics account, so you can follow along in your own account. There are no long-winded lectures or boring PowerPoint presentations. Each lesson is simple and to the point.  </p>  <p>  \t              What you will learn:  </p>    <ul style=\"\">  \t<strong style=\"\">  \t<li style=\"\"><strong style=\"\">Who</strong> - your customers are including their demographics, interests and what type of devices they use.</li>  \t<li style=\"\"><strong style=\"\">What</strong> - they&#039;ve looked at on your site and what they purchased (or didn&#039;t).</li>  \t<li style=\"\"><strong style=\"\">When</strong> - their first visit was and when they came back.</li>  \t<li style=\"\"><strong style=\"\">Where  </strong>- they are from and what languages they speak.</li>  \t<li style=\"\"><strong style=\"\">How </strong>- they got to your website (social media, referred from another website, or Google search)</li>  \t</strong>  </ul>  <p>  \t              If you have any questions about the course feel free to email me anytime.</p>", 
    "end_date": null, 
    "title": "Google Analytics for Beginners", 
    "price": "30.00", 
    "instructors": "Corey Rabazinski", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/203440_10bf_11.jpg", 
    "course_url": "https://www.udemy.com/google-analytics-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-22T20:09:27Z"
}