{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Google Analytics Certification Exam - Everything You Need to Ace the 2016 exam: Best Study Guides, Cheat Sheets and Answers to 90+ Sample Questions inside the course.<strong></strong></p>\n\n<p><em>Student Feedback ★★★★★</em> \"<em>Just to let you know that I passed the Google Analytics IQ exam last night and with 95%. Unbelievable!</em>\" - Christiane Campos</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>About the Google Analytics Certification Exam</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Taking the Google Analytics exam gives you an industry recognised Certification proving your skills in Digital Analytics and Google Analytics. The exam is free to take, 90 mins long and contains multiple choice questions (a detailed overview of the exam is provided in the course)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Is the Google Analytics Certification Worth It?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The value is “not” only a bullet point on your resume. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Once you’ve achieved certification, you will have gained a really great understanding of how to use Google Analytics professionally, inquisitively and intellectually. And not only for content websites but also for ecommerce websites and mobile apps as well.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Now that's a valuable bargaining chip to attach to your personal package!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why Now is the Perfect Time to Earn This Qualification</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>✔</strong> The Exam is <em>now</em> FREE. Unbelievable value for an Industry Recognized Qualification.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>✔ You can Add this Certification to your Resume with 2 days of dedicated study-not months! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>✔ \"Data Culture\", \"Data Driven Decision Making\" &amp; \"Marketing Analytics\" are the Top of Mind now - take advantage of this to secure your next interview, promotion or client.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>You Don't Need to Be Technical to Take The Google Analytics Certification Exam</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>All of the study materials and sample questions are designed to bring absolute beginners from zero knowledge about analytics to certified individuals. Of course, you will need to study to get there but there's no prerequisites or work experience required to earn the Qualification.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Course Content &amp; Overview</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Inside the course, I share the update to date, step-by-step approach that I used to pass the test in the shortest time possible including: </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Engaging HD Video lessons</li><li>Detailed Exam Overview so Know How to Ace it First Time</li><li>Answers to 90+ Sample Questions</li><li>The Best Study Resources &amp; Cheat Sheets to Ensure Exam Success</li><li>3 Strategies Guaranteed to Reduce Your Study Time by 50% or More</li><li>Access to Active Discussion Forums and a Helpful Instructor</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So go ahead and hit that take this course button and say yes to your risk-free opportunity to get Google Analytics Certified today!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Note: this courses come with a 30 day money back guarantee - no questions asked!</em></p>", 
    "end_date": null, 
    "title": "Google Analytics Certification Course: Certified in 2 Days!", 
    "price": "30.00", 
    "instructors": "Daragh Walsh", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328386_6809_3.jpg", 
    "course_url": "https://www.udemy.com/google-analytics-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T18:42:20Z"
}