{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Have you poured resources into traffic-driving marketing campaigns only to realize that your new visitors leave without converting and never return? You could be losing website visitors (and potential customers) because your website isn’t properly servicing their needs.</p>  <p>If you want to better identify who your users are and tailor your website experience to their needs, you should be using the Google Analytics Audience reports to group visitors based on acquisition date, demographics, interests, online behavior, technology usage, etc. This information can help you tailor your messaging and website experience to each audience group and determine if you need to adjust your website design to accommodate certain groups, such as those accessing your website via mobile or unoptimized browsers. </p>  <p>In this on-demand course, Marketing Mojo President &amp; CEO Janet Driscoll Miller, a Google Analytics certified expert, will walk you through the Audience reports and provide insight from her 20-plus  years of marketing experience. Along with unlimited access, you can also ask her specific questions in the discussion panel. </p><p>Enroll in this course now to gain deeper insight into who is actually visiting your website and discover user trends and online behavior to help improve your website design and messaging.</p><p>Thank you and enjoy!</p>", 
    "end_date": null, 
    "title": "Intro to Google Analytics Reports: Audience Reports", 
    "price": "50.00", 
    "instructors": "Janet Driscoll Miller", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648136_5626.jpg", 
    "course_url": "https://www.udemy.com/intro-to-google-analytics-reports-audience-reports/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T19:02:27Z"
}