{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>**UPDATED AS OF NOVEMBER 2015 - JOIN 9,000+ SUCCESSFUL STUDENTS!**</strong><strong></strong></p><p><strong></strong><strong>Become a technical marketer with this course on using SQL for data analysis. You'll learn:</strong></p><ul><li>Initial Setup and SQL Basics</li><li>The 6 Components that Make Up Every SQL Query</li><li>How to Use SQL to Query Any Database</li><li>Pre-built Queries You Can Run Today to Get Info About Your Customers</li></ul><p>  \t                            Technical marketers are in high demand and low supply. Being able to dive into data <em>on your own</em>, with no help from engineering, makes you a <strong>much </strong>better marketer.  </p>  <p>  \t                                            This is why SQL is so powerful - it allows you to see any data you want about anything your customers do. Knowing how to use SQL is literally a marketing superpower.  </p>  <p>  \t                                            As someone who can understand and use SQL, you'll be a (highly paid) marketing unicorn - able to dig into data and also execute high-level marketing campaigns. Many companies - including Udemy! - are now <strong>requiring that their marketing leaders have an understanding of SQL.</strong>  </p>  <p>  \t                                            Many marketers have tried to become \"technical\" - including me - but have failed over and over again after coming across resources meant only for engineers. I know I've had this issue - every SQL tutorial out there was created <strong>for developers</strong>, not marketers. Other tutorials include topics like creating a database, inserting data, managing tables, and other specifics that database administrators need to know.  </p>  <p>  \t                                            What if I told you that marketers <em>only need to know a small amount of SQL</em> to use it for analytics... and to run more profitable campaigns?  </p>  <p>  \t<strong>Good news - This is the truth!</strong>  </p>  <p>  \t                                            This course is the best resource for marketers, growth hackers and product managers who want to get more technical and learn SQL. It's what I wish existed when I was going through tutorial after tutorial, sifting through lots of information that didn't apply to me and trying to learn on my own.  </p>  <p>  \t                                            And - best of all - <strong>you don't need to know programming or be technical</strong> to take this course. In fact, you don't have to be technical to know how to use SQL!  </p>  <p>  \t                                            SQL is simple enough that - just by learning a few concepts I'll cover in this course - you'll be able to use it for any kind of data analysis, cohort analysis or campaign breakdown.  </p>  <p>  \t                                            Everything I've put into this course are the product of years of teaching myself to program, understanding software technology and writing thousands of SQL queries for my own marketing and growth campaigns. The concepts and queries in this course are used every day by the marketing teams at companies like eBay, Moz, Udemy, HubSpot... you name it.  </p>  <p>  \t                                            I've used my knowledge of SQL to cut churn by more than 60% while running growth at developer-tools startup Airbrake (acquired by Rackspace), and to analyze and improve multiple profitable marketing campaigns. Knowing SQL has given me incredible insight into our customer base, and allowed our marketing team to move <em>much </em>faster than we did when we had to wait for engineering to give us the data we requested.  </p>  <p>  \t                                            But don't just listen to me. Here's what a few other people have said:  </p>  <p>  \t                                            \"About four weeks back, I learned SQL, and it's been one of the greatest skills I could have ever acquired as a marketing / business guy at a startup.\"  </p>  <p>  \t                                            - Dinesh Thiru, Head of Marketing at Udemy  </p>  <p>  \t                                            \"I loved this course. I was able to power through it within 3 hours and have a solid base of understanding for SQL.  </p>  <p>  \t                                       As a digital marketer, it's important that I have access to my database and customer information BUT that I do not waste valuable developer resources. This course aims to bridge that gap by teaching you the tools you need to query your SQL database and running your own reports.  </p>  <p>  \t                                       I can't recommend this course enough for SQL newbies. I now have a base of understanding of SQL and excited to use it at work this week!\"  </p>  <p>  \t                                            - Benjamin Hoffman, course student  </p>  <p>  \t<strong>Some things you'll learn in this course:</strong>  </p>  <ol>  \t<li>The 6 components that make up <em><strong>every</strong></em> SQL query a marketer will ever use</li>  \t<li>How to find your most profitable users, and how to make sure you run campaigns that attract more like them</li>  \t<li>5 key metrics you can measure right away after learning SQL</li>  \t<li>How to run a cohort analysis</li>  \t<li>How to discover the \"aha\" moment in your product that indicates whether a new user will stay an active customer or close their account</li>  \t<li>Access to pre-built queries you can start using immediately to learn about your customer base</li>  </ol>  <p>  \t                                            Trust me, this is just a small sample of what you'll learn. By the end of this course you'll be more technical than 90% of marketers out there, and 100% better at your job.  </p>  <p>  \t                                            I'll also personally respond to any questions you may have as you go through the material, so there's no worry if you think this might be too technical or too confusing. I've included only the essentials marketers need to know, and created the course I wish I had years ago when I was learning this stuff.  </p>  <p>  \t                   As a last bonus, I'll personally guarantee your satisfaction. If for any reason you don't think the course was valuable, <strong>I'll personally refund your entire purchase amount, no questions asked</strong>.  </p>  <p>  \t                                            See you inside,  </p>  <p>  \t                                            Justin Mares  </p>  <p>  \t<strong>P.S.</strong> If you have (or are looking) to become a better marketer, investing a few dollars in yourself will be the best investment you ever make. And, if you don't like the course, I'll give you a 100% refund - my guarantee.  </p>", 
    "end_date": null, 
    "title": "SQL for Marketers", 
    "price": "20.00", 
    "instructors": "Justin Mares", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198568_b937_8.jpg", 
    "course_url": "https://www.udemy.com/sql-for-marketers/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T05:20:23Z"
}