{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The best Infusionsoft training for beginners to create their very first automated marketing funnel.  This course is designed, not to teach you the technical aspects of Infusionsoft, but to show you how you can utilize the campaign builder within Infusionsoft to:</p><ul style=\"\"><li style=\"\">Set up forms to capture all kinds of leads.</li><li style=\"\">Automatically sell to leads based on whether they are cold, warm, or hot.</li><li style=\"\">Assign tasks to your staff based on the needs of your customers.</li><li style=\"\">Gauge the activity of leads and sell to them based on what they do</li><li style=\"\">And much mire...</li></ul><p><strong style=\"\">This is not a course to show you all of the technical aspects of Infusionsof</strong>t<strong style=\"\">, it&#039;s about making a winning campaign <em style=\"\">to make your first sale. </em> </strong></p><p>This course is heavily <em style=\"\">sales </em>focused.  It&#039;s the best Infusionsoft training if you want to learn how to use the Infusionsoft campaign builder to create automate sales systems that work, respond to, and sell to your customers while you sleep.</p><p>While we go through some of the user interface, we push through to how to make money (which is the fun and most important part of using Infusionsoft).</p><p><strong style=\"\">What&#039;s in the course?</strong><span style=\"\"></span></p><ul style=\"\"><li style=\"\">Over 15+ engaging videos </li><li style=\"\">Overview of the Infusionsoft appplication</li><li style=\"\">Example automated sales campaigns that are based on real cases</li><li style=\"\">Real-life campaign examples from my business that made over half a million dollars in sales in 2014.</li><li style=\"\">I consistently ad new course material based on student needs.</li><li style=\"\">and more...</li></ul><p style=\"\"><strong style=\"\">Why take this course?</strong></p><p style=\"\">It&#039;s the best Infusionsoft training for those that want to start making sales.  I made this training specifically because I&#039;ve seen so many new companies hop onto the automation marketing wagon but have no idea what to do.</p><p style=\"\">This software is is powerful and has the potential to not only make more sales for you, but to also give you your life back.  Using this software requires a mindset shift.  It requires that you see it as your opportunity to build &quot;sales assets&quot; that work for you like little robots that take care of your customers.</p><p style=\"\">However, <strong style=\"\">it all starts with sales</strong> and if you haven&#039;t used this software to make money yet - then you need this course.<br style=\"\"></p><p style=\"\"><strong style=\"\">If you are new to Infusionsoft, considering Infusionsoft, or looking for the best Infusionsoft training to learn how to actually use it to make sales - you need this training.</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "The Best Infusionsoft Training: Basics for Fun and Profit", 
    "price": "50.00", 
    "instructors": "Dean Soto", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437116_8cad_2.jpg", 
    "course_url": "https://www.udemy.com/infusionsoft-basics-for-fun-and-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T00:49:13Z"
}