{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><p><strong style=\"\">Do you want to get more traffic,  increase conversion rates and make more money with your website?</strong></p>    <p><ul style=\"\"><li><span>Do you </span><strong style=\"\">wish</strong><span> someone would tell you which  statistics in your analytics actually matter… and which don’t?</span><br style=\"\"></li><li><span>Are your visitors a </span><strong style=\"\">mystery</strong><span> to you?</span><br style=\"\"></li><li><span>Are you struggling to </span><strong style=\"\">understand</strong><span> how to effectively use  Google Analytics to help your business increase sales?</span><br style=\"\"></li><li><span>Are you confused by  Google’s Analytics tutorials?</span><br style=\"\"></li><li><span>Do all the options in  your analytics account make your eyes glaze over?</span><br style=\"\"></li></ul></p>                    <p><strong style=\"\">If you need help, you are in the  right place</strong></p>    <p>Web Analytics tools like  Google Analytics help you better understand where your visitors come from, what  they do while they are on your website and whether they stick around on your  site and take action.</p>    <p>Google Analytics helps  you see how engaged your visitors are on your website, how many of them left  your website without doing anything or without having any result from them and  much more.</p>    <p>However, it takes time  to learn how to use tools like Google Analytics effectively. Especially when no-one  seems to offer simple and practical advice.</p>    <p>That is why I decided to create this “Web  Analytics Training with Google Analytics Tutorial” course that provides you easy to follow video tutorials that will  save you time and money without cutting corners.</p>    <p>In 10 minutes, you’ll get more value from this “Web  Analytics training with Google Analytics tutorial” course than you would get in hours of reading tutorials online. You can watch the videos at  your own pace, rewind, pause and follow the instructions along.</p>    <p>Plus in just a couple of  weeks you will have totally transformed how you think about your website  traffic.</p>    <p>The knowledge you’ll  have will enable you to make more strategic decisions about everything you do  on your website which will increase your site’s revenue dramatically.</p>    <p><strong style=\"\">Here&#039;s what you will learn</strong></p>    <p>The Web Analytics  Blueprint is a quick and easy to understand course that will help you not only  master the basics of Web Analytics, but it will help you become a true Web  Analytics ninja and get so many insights from your data.</p>    <p>By taking this “Web Analytics Training with  Google Analytics Tutorial” course you will  learn:</p>    <p><ul style=\"\"><li><span>Which metrics matter…  and which ones don’t</span><br style=\"\"></li><li><span>How to properly track  conversion rates</span><br style=\"\"></li><li><span>How to measure visitors’  loyalty and engagement</span><br style=\"\"></li><li><span>What results you can  measure (even if you’re not yet selling anything)</span><br style=\"\"></li><li><span>Advanced techniques for  using Web Analytics tools</span><br style=\"\"></li><li><span>How to improve  Conversion Rates and make more sales</span><br style=\"\"></li><li><span>What A/B testing is, why  it rocks, and how to start doing it</span><br style=\"\"></li></ul></p>                            <p>You will learn how to find  out why people are leaving your website without buying, what your customers are  really looking for on your website and how to make your website convert  effectively using the secret functions hidden in Google Analytics and other Web  Analytics tools.</p>  <p><strong style=\"\">Here&#039;s what you will get</strong></p>    <p>First, you’ll have <strong style=\"\">full  membership for life</strong>. That means you will get future updates to the course at no  extra charge.</p>  <p>Once you register, you  will have access to <strong style=\"\">high resolution  video tutorials</strong> with <strong style=\"\">real-life data</strong>  from Google Analytics accounts.</p>  <p>Each lesson contains one  video tutorial, additional notes and a downloadable audio version.</p>  <p><strong style=\"\">When you join, you will get  access to over 100 minutes of video, where I show you exactly what to do to get  a higher conversion rate and more sales.</strong></p>  <p>I explain things <strong style=\"\">step by step</strong>, and I show you the <strong style=\"\">exact techniques</strong> that I’ve used time  and time again for myself and my clients.</p>    <p>The “Web Analytics Training with Google Analytics  tutorial” course will continue to be updated with new video  tutorials about <strong style=\"\">best practices,  interviews, Q&amp;A calls and webinars</strong>.</p>    <p>Plus, over time you will  get a whole set of <strong style=\"\">extra videos</strong> that  are automatically added to your membership.</p>    <p>I will show you <strong style=\"\">how to work</strong> with the <strong style=\"\">brand new features of Google Analytics</strong>  and other tools, as soon as they are available.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Web Analytics Blueprint", 
    "price": "50.00", 
    "instructors": "Eugen Oprea", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16630_de99_6.jpg", 
    "course_url": "https://www.udemy.com/web-analytics-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Analytics & Automation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-20T05:52:02Z"
}