{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    At the center of a good story are the characters in it. In this course aspiring writers will discover how to build and bring to life complex, vivid and unforgettable characters. We will study the choices a writer makes to bring all characters to life on the page, and we will perform written exercises in order to develop a variety of writing and pre-writing techniques, in order to create a variety of characters. We will learn how to use our own life experiences, and the people we know (and how not to!). We will develop inner (thoughts and feelings) and outer (appearance, habits, behavior) lives for our characters and see how that can lead us to richer and more interesting stories. We will breathe life into our characters and let them surprise us.\n\n                                            Syllabus\n                        Discovering Characters from Your Life and ElsewhereWhat happens in the writer's mind before any words are written on the paper? Characters then reveal themselves through conflict and drama. Without conflict there is no purpose to the story. We then discuss desire. Human beings want things, even when we don't really know what it is we wish for. Finally, we conclude the module like Michelangelo, chipping away everything that is not the masterpiece statue of David. Learn to find what is germane to the story you are telling by looking closely at the character.Creating Characters on the PageHere, we delve deeper into the characters. What is their physical description, and how can we describe them through action? How do they speak? What makes me want to read about them? When your characters need help or understanding, or even rescuing, this draws the reader in, far more than likability. Finally, we discuss how the plot reveals the inner life of characters through what they do as well as say.Dialogue and MonologueHow do we lead a reader to a world that feels real? Narrators have an attitude, towards subjects and audience, about the world and its events. We discuss in this module considerations involved in planning for these realities, including the differences between first and third person and the construction of dialogue with verisimilitude - the feel of real life - while stripping away the tedium. We ask what idiosyncrasies your characters possess and how to control them to advance the narrative.Set Your Characters Free.. and Give Them Somewhere to GoIn this module, we reflect on how our readers learn about our characters - and how we as writers do, as well. We ask questions about who is telling the story, why, and with what goal. We conclude the course with a conversation about the narrator and, distinctly, the narrative, to see how they shape the reader's perception of character and story.\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Creative Writing: The Craft of Character", "price": 0, "instructors": "Brando Skyhorse", "institution_name": ["Wesleyan University"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/learn/craft-of-character", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}