{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    NEW COURSE START DATE April 13, 2015\r\nHow Writers Write Poetry 2015 offers an interactive progression through the principles and practice of writing poetry. The course presents a curated collection of short, intimate talks on craft by two dozen acclaimed poets writing in English. Craft topics include persona, notebooking, the line, the turn, form, and the lyric. The talks are designed for beginning poets just starting to put words on a page as well as for advanced poets looking for new entry points, engagement with process, or teaching tips. The course will be taught by Professor Christopher Merrill, International Writing Program Director, poet, and translator; and Camille Rankine, poet, Assistant Director of the MFA Program in Creative Writing at Manhattanville College, and editorial director of The Manhattanville Review.\r\nContributing poets' video talks will be contextualized through online discussion and writing assignments. The course moderators (all Iowa Writers' Workshop graduates with university level experience teaching creative writing) will join Camille Rankine in offering online facilitation to participants through course discussion forums. Poets who have contributed video craft talks for the course include former U.S. Poet Laureate Robert Hass, Kwame Dawes, Marvin Bell, Lia Purpura, Kazim Ali, Kate Greenstreet, Natasha Tiniacos, and many others. How Writers Write Poetry will offer a diversity of answers to the question of how a writer develops and refines the lifelong practice of his or her craft.\r\nEnrollment in How Writers Write Poetry is free and unlimited; there is no cost to participants.\r\nCourse Expectations:\r\nEach week, Christopher Merrill and Camille Rankine will present a video class session followed by a pair of writing assignments: one exercise for writers who would like to create new work and/or who are exploring poetry for the first time, one exercise for poets who would like to use this course to examine and refine their work and their approach to poetry writing. Our moderators will lead discussions of the video classes and the writing assignments and will host master classes in which the craft topic of the week may be explored in depth. Participants are encouraged to post their exercises to the course discussion forum for peer feedback and to submit critical feedback on the poems of their fellow writers. The success of the community critique process will depend entirely on the investment made by you and your fellow writers; we encourage you to engage deeply with one another’s work and with the craft principles presented by the course.\r\nCertificate of Completion:\r\nThe University of Iowa offers an optional certificate of completion for this course.\r\n \r\nFor Our How Writers Write Poetry 2014 Alumni:\r\nWelcome back! Wondering how this MOOC might compare to last year's? We're pairing new video lectures with those 2014 videos that we think are worth revisiting from a new angle. We're offering two tracks of writing assignments: each week, we'll have one assignment designed for beginning poets and one assignment intended to push experienced poets to engage more deeply with their processes; to reconceptualize, revise, and expand. And we've restructured our workshop process as a master class-workshop hybrid, supported by a collection of resource readings. We're looking forward to working with you again.\r\n \n\n                                            Syllabus\n                        Saturday, June 28\r\nSketching TechniquesVideo Session #1: Robert HassAssignment: Exercise #1\r\nTuesday, July 1\r\nCollecting and Repurposing LinesVideo Session #2: Kate Greenstreet and Lucy IvesDue: Exercise #1Assigned: Exercise #2\r\nSaturday, July 5\r\nBuilding a Poem (Poem As Building)Video Session #3: Daniel Khalastchi​Due: Exercise #2Assigned: Exercise #3\r\nTuesday, July 8\r\nMindful WritingVideo Session #4: Sridala Swami and Alexandria PearyDue: Exercise #3Assigned: Exercise #4\r\nSaturday, July 12\r\nProsody (Meter)Video Session #5: Richard Kenney and William Trowbridge​Due: Exercise #4Assigned: Exercise #5\r\nTuesday, July 15\r\nInconstancy, Syntax, and Multiple SelvesVideo Session #6: Dora Malech and Tarfia FaizullahDue: Exercise #5Assigned: Exercise #6\r\nSaturday, July 19\r\nOther People's WordsVideo Session #7: Nick Twemlow and Kiki PetrosinoDue: Exercise #6Assigned: Exercise #7\r\nTuesday, July 22\r\nPoetry As PleasureVideo Session #8: James Galvin and Kwame DawesDue: Exercise #7Assigned: Exercise #8\r\nSaturday, July 26\r\nConstraint Based PoetryVideo Session #9: Shane McCrae and Teemu ManninenDue: Exercise #8Assigned: Exercise #9\r\nTuesday, July 29\r\nSonic AssociationVideo Session #10: Carol Light and Larissa Szporluk​Due: Exercise #9Assigned: Exercise #10\r\nSaturday, August 2\r\nGeneral Advice and Looking OutwardVideo Session #11: Michael Dennis Browne and Caryl PagelDue: Exercise #10Assigned: Exercise #11\r\nTuesday, August 5\r\nFree Verse and the Prose PoemVideo Session #12: Marvin Bell and Mary HickmanDue: Exercise #11Assigned: Exercise #12\r\nSaturday, August 9\r\nCourse Closes\n                                    ", "end_date": "2015-05-04T00:00:00Z", "title": "How Writers Write Poetry", "price": 0, "instructors": "Christopher Merrill", "institution_name": ["University of Iowa"], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.canvas.net/browse/uofiowa/courses/how-writers-write-poetry", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-03-23T00:00:00Z"}