{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    This course has been designed and developed by experts from The Careers Service here at The University of Sheffield to help you to write successful applications, whether you are applying for jobs or planning to study at university or college.\n\nOver the three weeks, we’ll look at different parts of the application process. We’ll help you to understand the skills you have gained through work experience and your studies and show you how you can match them to job advertisements or course requirements.\n\nWe’ll share top tips with you to help you write exceptional applications, CVs (or résumés), covering letters and personal statements and provide insight from employers and admissions tutors on what they look for in candidates. We’ll go on to help you examine your digital footprint and develop a professional profile online.\n\nThe course is highly participative and includes articles for you to read, videos to watch and interactive material to help you master the art of application and CV writing. There will also be discussions where you can learn from and support each other, self-reflective exercises and quizzes. Throughout the course you’ll be encouraged to collect a portfolio of your work which will help you with future applications.\n\nBy the end of the three weeks we hope you will have the confidence to apply for your dream job or course.\nAnd once you’ve written that perfect application, why not check out our next course: How to Succeed at: Interviews.\n\nYou can find out more in Pamela Hafekost’s post for the FutureLearn blog: “How to get that dream job or course.”\n\n\n                                    ", "end_date": "2016-07-04T00:00:00Z", "title": "How to Succeed at: Writing Applications", "price": 0, "instructors": "Hilary Jones and Pamela Hafekost", "institution_name": ["The University of Sheffield"], "commitment": "3 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/writing-applications?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-13T00:00:00Z"}