{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    This free online course is aimed at those curious about journalism and looking to gain a better understanding of what the subject entails. Run by a team of internationally-renowned scholars and journalism practitioners at the University of Strathclyde, it gives you a behind-the-scenes look at the professional world of reporters and editors.\n\nThe course contains six topics - what makes a good news story; writing news; writing features; opinion writing; politics and journalism; and investigative journalism - and explores these in relation to a case study running throughout the six weeks. Although the scenario is entirely fictitious, participants will engage in tasks and discussions that reflect real-life situations in journalism.\n\nEach week contains a variety of learning activities that will introduce concepts, challenge assumptions, facilitate understanding and hone new skills. You’ll be encouraged to discuss your thoughts with peers and tutors, generate and edit small pieces of writing, and comment on others’ work.\n\nSeveral esteemed journalists from around the world will feature each week, as they discuss key topics in relation to their own work. By enacting the role of a journalist in the context of an escalating story, the course adheres to Strathclyde’s ethos of “a place of useful learning.”\n\nTwo feature articles written by learners as part of this course have been republished on our blog: “Muddy Waters” by Sharon Walker documents flooding in Genoa; and “David” by Shawn Basheer is a pen portrait of a Sri Lankan refugee.\n\n\n                                    ", "end_date": "2016-05-09T00:00:00Z", "title": "Introduction to Journalism", "price": 0, "instructors": "Michael Higgins", "institution_name": ["University of Strathclyde"], "commitment": "", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/introduction-to-journalism?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-03-28T00:00:00Z"}