{"selfpaced": true, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                    \n                    In a vibrant democracy, journalism and media have the power and responsibility to both inform and inspire the public to political action. Achieving this requires a deep understanding of current social problems and how policy is formulated, alongside the ability to tell that story in a manner that drives an otherwise apathetic public into action.\n\nThe goal of this online course is two-fold: 1) to teach people from all walks of life how to use journalism and media as an implement of social change; and 2) have those students become effective change agents themselves. This class is not theoretical – students should be prepared to dig in deep and make meaningful contributions to policy change on a global level.\n\nThis course equips students with the knowledge and skills they need to produce solution-based journalism – stories that give equal weight to problems and solutions. Throughout the course, students will view examples of outstanding solution-based journalism. The majority of these stories focus on vulnerable children. The umbrella of children allows us to explore the broad, but deeply interwoven policy areas concerning: communities, poverty, child protection, child maltreatment prevention, foster care, and the courts.\n\nAt the same time, this course provides students with a platform to research, report on, and write about the policy and justice issues that fuel their own interests and passions, whether that involves immigration crises or poverty. Early on, students will share their interest areas with their classmates and start to share information and ideas. Students will then produce Final Stories on their topics of interest.\n\nStudent work will be published throughout the semester and have a direct, immediate impact. Through precise, rigorous reporting and policy analysis, students will substantively contribute to public discourse, and by virtue of that contribution drive political will toward positive policy solutions to the myriad social issues that vulnerable peoples across this globe face.\n\nWith that experience, students will be better prepared to use journalism and media for social change in whatever field they explore beyond the class.\n\n                                    ", "end_date": "2015-09-02T00:00:00Z", "title": "J4SC101x: Journalism for Social Change", "price": 0, "instructors": "Daniel Heimpel", "institution_name": ["University of California, Berkeley"], "commitment": "2-4 hours", "subject_name": ["Humanities"], "course_url": "https://www.edx.org/course/journalism-social-change-uc-berkeleyx-j4sc101x-0", "duration": "26 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-03-04T00:00:00Z"}