{"selfpaced": false, "topic_name": ["Grammar & Writing"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    sjtujc331-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    \n\t\t\t\n\t\t\t\t\n\t\t\t\t\t“媒介批评”是现代大众传播学的重要分支,简单而言,就是批评媒介,是\n对大众传播媒介本身进行批评,属于应用传播学的研究领域。随着技术的进步和\n传媒产业的不断发展,“媒介化社会”的到来,媒介在现代社会中产生越来越重\n要的影响。为了保证媒介自身的良性发展,需要对媒介本身进行制约,以明确媒介的边界。因此,如何对媒介及其传播的信息进行反思性评判,是媒介批评要解决的主要问题。\n\n\t\t\t\t\t媒介批评就是指立足于批判的价值立场、传播观念和理论背景,对大众传播\n活动的政治经济机制、媒介机构和从业者、媒介的基本形态、媒介产品、媒介文\n本及内容,以及媒介受众等所进行的理论观察、分析、评价等批判性反思活动。\n媒介批评研究基于人文学科和社会科学的基本研究方法,以大众传播活动及其媒介产品为主要研究对象。简言之,媒介批评就是立足于批判的价值立场对媒介活\n动及其产品和传播观念进行研究。因此,明确的价值立场和反思性批判是媒介批评的本质。\n\n\t\t\t\t\t“Media criticism” is an important branch of modern mass\ncommunication. In a word, it, which belongs to the field of application\ncommunication studies, is to criticize media. With the technology\nadvancing, the media industry developing and “social media” arriving,\nthe media is playing a more and more important role in the modern society.\nTo guarantee the positive development of the media itself, the media\nitself need to be restricted so as to make clear its boundary. Therefore,\nhow to carry out the reflective judgment on the media and information is\nthe main problem of media criticism which still remains to be solved.\n\n\t\t\t\t\tMedia criticism refers to reflective judgment, which bases on the\ncriticism of the value standpoint, the dissemination of the concept and\nthe theory background. Media criticism is the observation, analysis,\n\n\t\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\t\n\t\t\t\t\tevaluation, which is concluded from the humanities and social science\nfundamental research method, to the political and economy mechanism of\nmedia, mass communication media agencies and media practitioners, the\nbasic form, media products, media text and the content, the audience. In\nshort, media criticism is a research which base on the critical value\nstandpoint in the media activities, media products and the concept of\ncommunication. A clear value standpoint and critical reflective is the\nessence of media criticism. \n\t\t\t\t\n\t\t\t\n\t\t\n\n                                            Syllabus\n                        \n \n  \n  第一单元-媒介批评的基本问题1.1媒介批评的内涵和视角1.2媒介批评的对象和范围1.3媒介批评的基本理论1.4媒介批评的目的和功能1.5媒介批评的特征与类型 第二单元-媒介批评的研究问题与方法2.1媒介批评的研究问题2.2媒介批评的研究方法 第三单元-媒介、文化与社会3.1作为人类社会文化活动的传播3.2媒介与文化3.3媒介与社会3.4媒介与话语 第四单元-作为大众文化的媒介4.1文化、大众文化、媒介文化4.2文化工业4.3编码/解码 第五单元-媒介符号学5.1符号、意义、媒介5.2索绪尔5.3皮尔士、罗兰·巴特、雅各布逊 第六单元-媒介的意识形态分析6.1何谓意识形态6.2葛兰西、阿尔都塞、布尔迪厄6.3媒介与政治、权力、利益、文化 第七单元-媒介叙事理论7.1何谓叙事学7.2叙事构成要素7.3媒介叙事分析第八单元-解构主义、读者反应理论与媒介8.1解构主义8.2读者反应理论8.3媒介建构主义 \n\n第九单元-女性主义媒介批评 9.1何谓女性主义 \n9.2女性主义理论 \n9.3媒介与女性主义\n  \n \n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "媒介批评:理论与方法 Media Criticism: Theory and Method", "price": 0, "instructors": "姚 君喜", "institution_name": ["Shanghai Jiao Tong University"], "commitment": "3-5 hours", "subject_name": ["Humanities"], "course_url": "https://www.coursera.org/course/sjtujc331", "duration": null, "language_name": ["Chinese"], "provider_name": ["Coursera"], "start_date": "2014-02-24T00:00:00Z"}