{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    \nThousands of English language teachers take up posts around the globe every year, Teaching English as a Foreign Language (TEFL) to different nationalities and speakers.\n\nIf you’re thinking about joining them, this free online course will help you find out more about the world of English Language Teaching (ELT).\n\nWe’ll be answering some key questions -\n\n\n  What is ELT and what does it involve?\n  Where can you teach English?\n  Who are your learners?\n  And what do you need to know about the English language?\n\n\nGet practical advice from English language teachers and experts around the world\n\nThe course will run over six weeks and feature learners from different countries and teachers who’ve taught all over the world, giving you ideas and information on key areas of English language teaching.\n\nThroughout the course, experts from Cambridge English Language Assessment – one of the leading providers of exams and qualifications, such as CELTA and TKT, for learners and teachers of English – will be asking you for your ideas and input. We’ll have articles, videos, quizzes and live events where you can ask the experts your own questions.\n\nExplore the opportunities for teaching English as a foreign language\n\nYou’ll also learn more about where your new adventure can take you, and find out the best way to get started.\n\nFrom teaching children in Vietnam, to teaching business people in Switzerland, we’ll give you a taste of what you’ll need to know. We’ll provide  ideas on practical activities you can use in class and show you how you can look at English from a whole new viewpoint.\n\nThanks to Bell Cambridge International School and EF International Language Centre Cambridge.\n\n\n\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Exploring the World of English Language Teaching", "price": 0, "instructors": "Monica Poulter and Marie Therese Swabey", "institution_name": ["University of Cambridge"], "commitment": "2 hours", "subject_name": ["Education & Teaching"], "course_url": "http://www.futurelearn.com/courses/explore-elt?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}