{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    How we teach has its foundation in how we were taught and how we learned. This course provides an opportunity for you to reflect on your personal and professional development as a teacher. Through reflection and portfolio development you will enhance your knowledge and understanding of how to promote learning.\n\nAnnouncement for US based teachers:\n\nCoursera and its partners are proud to offer eligible teachers in the US free Course Certificates for this course and other high-quality teacher professional development courses, through the Connected effort announced by President Obama.\n\nTo participate in this opportunity, US district leaders simply need to approve Coursera teacher professional development by completing a brief form at: www.coursera.org/tpd.\n\nUS Teachers interested in this opportunity are also encouraged to follow the link to learn more and www.coursera.org/tpd.\n\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.\n\nCoursera and the Commonwealth Education Trust thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.\n\n                                            Syllabus\n                        What is a teacher?The first week of this course looks at what it means to be a teacher. We look at the many roles that a teacher plays and why each of these is important. We consider what it means to be an effective teacher. We look at ways in which we can improve what we do as teachers using a model of continuous professional development. Finally, we consider what a philosophy of education is and how we can develop a philosophy that guides our teaching.Myself and My LearningThe second week of this course looks at teachers’ sense of identity, and the differing reasons and motivations people have for becoming a teacher. We ask you to consider the influences on you and particularly the people who may have played a part in your decision to join the profession. You will reflect on the nature of transactions in the classroom and the differing ways in which students respond to how teachers address them. The fourth lecture draws on educational theorist Jacob Kounin’s key strategies that expert teachers to manage classrooms effectively.Influences on my learningThe third week of this course continues the theme of how your teaching and learning has been influenced by other key people or events. You will learn about the primary motivations that persuade people to take up teaching as a career. How do you communicate with children, or adult learners, in ways that helps them to grasp key concepts and ways of thinking? Reflecting on your teaching and on your students’ learning may help you to have a greater impact as a teacher. The fourth lecture, entitled Asking or Telling address fundamental issues of pedagogy, reminding us that ‘telling’ is rarely an effective strategy for teaching either as a teacher or a parent, whereas questioning requires activity and involvement on the part of the learner.Impacts on my learningThis week we look at the impact our social identities have on our learning. The four lectures in week four are all related to the theme of difference. It will be important for you to think about your own socialization and how you learned about difference. Is difference something you learned to value or is it something you have learned to ridicule? Think about how you deal with difference in your personal context and in your classroom. We encourage you to write a narrative in which you bring together a reflection on your own socialization and how this impacts on your teaching.How do I learn?How do I learn best? During this week we will focus on how you learn best and how you can make the connections with your own classroom and learners. We encourage you to think more about how we learn as teachers, and how we can create the best conditions for ourselves and our students to learn.My learning environmentCongratulations, you have stayed throughout the course 'Being a teacher'. I hope you have been making the connection between how you have learned and how you teach. During this week we will focus on 'My learning environment'. We will explore the principles of pedagogy, specifically Alexander’s nine aspects of pedagogy. In the fourth and final lecture, we also revisit some of the key ideas explored on the course. \n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Foundations of Teaching for Learning 2: Being a Teacher", "price": 0, "instructors": "Dennis Francis", "institution_name": ["Commonwealth Education Trust"], "commitment": "3-4 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/being-a-teacher", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}