{"selfpaced": false, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    One focus of the course is to help you develop strong relationships with families to enable them to support children’s learning. Positive relationships with your students enable you not only to teach them but also to get to know them as individuals. Positive relationships with colleagues and school leaders are necessary to help the school improve.\n\nThis course is part of the Foundations of Teaching for Learning program which is designed to assist people who are currently teaching but have had no formal teacher education improve their understanding of their role and work as a teacher. This set of courses will enhance your knowledge and understanding about learning and teaching and what makes a teacher a professional.  \nPractical activities are provided to assist you in using what you have learned to improve your teaching practice. While these are optional, it is strongly recommended that you undertake them if at all possible.\n\nOf particular importance is a guide to the development of a portfolio to help you organize and document your thinking about what you have learned. In addition, you may be able to use the portfolio to access other opportunities in the future. \n\nAnnouncement for all learners:\n\nCourse instructor Tony Townsend will be actively participating on the course discussion forums for six weeks from Monday 14 September.\n\nAnnouncement for US based teachers:\n\nCoursera and its partners are proud to offer eligible teachers in the US free Course Certificates for this course and other high-quality teacher professional development courses, through the Connected effort announced by President Obama.\n\nTo participate in this opportunity, US district leaders simply need to approve Coursera teacher professional development by completing a brief form at: www.coursera.org/tpd.\n\nUS Teachers interested in this opportunity are also encouraged to follow the link to learn more and www.coursera.org/tpd.\n\nOnce a district’s form has been verified, the district leader will be notified and teachers in the district will receive access to free verified certificates for Coursera professional development.\n\nCoursera and the Commonwealth Education Trust thank educators for the hard work they do every day and hope this opportunity will assist US teachers to continue developing their craft in a meaningful and flexible way.\n\n                                            Syllabus\n                        The importance of relationships for educational settingsRelationships are critical to everything we do. They impact on our learning and how we see the curriculum and its assessment. They make a difference to our learning by ourselves and with others. They will enable us to work well, or not so well, with other people in the school. This week we will look in detail at what relationships are and how they are formed. We look back briefly at something that was discussed in course five, that is, how to support the development of a growth mindset. We hope that right from the start you will be discussing the course content with another educator. Since our relationships for so much of the time involve other people, it is important to think about these things with others to enable us to practice some of the things that are talked about in the course. Developing positive teacher-student relationshipsThis week we are going to focus on establishing relationships with students. We will start by considering the connections between how and what we think and how we behave. Sometimes we behave habitually, but sometimes, if we want to change our habits, we have to consciously make decisions about what to think or how to act. We will discuss how these two types of behaviour play out in the classroom and look at why one type is more productive. To take this a little bit further, we will explore the role that questions play in learning. We will also look at some of the strategies that you can use to develop positive relationships in the classroom, remembering that students are forming a range of relationships: relationship with themselves, with learning, with the curriculum content, with the teacher, with other students and with the wider community. Finally, we are going to talk about the need to behave ethically in the classroom, treating students with respect and ensuring that no harm comes to them. At the end of the week, you will write a short essay where you will consider the factors involved in establishing relationships and think about activities that you can use to improve student learning.Working with your colleagues and school leadersThis week we will focus on the concept of school improvement and effectiveness. There are several important factors that contribute to the success of a school. We will identify what these factors are, and look at each of them in detail. We start by looking at relationships, especially your relationships with your colleagues and school leaders. This will include a study of teacher unions and teacher associations, which both have a role in building professional relationships. Teacher unions offer a platform for development that will bring about educational reform. Next we will look at trust. We will explore what the concept of trust encompasses, and consider how certain behaviours can help to build trust. Finally, we look at working with leaders, teachers, and support staff. Here we will be looking at establishing Professional Learning Communities. At the end of this week we hope that you will be prepared to establish Professional Learning Communities and enhance you professional development.The importance of parent involvement for student successThis week we will consider the importance of establishing good relationships with the parents of your students. We will focus on why we need to involve parents in the education of their children and how we can go about it. The first two lectures are themed on the statement ‘The parent is the child’s first teacher’. These lectures focus on the important role that parents play in their child’s learning. We know that having children well prepared for the first day of school is an important first step for their learning. Teachers can play a role in reaching out to parents and giving them the information they need to give students the best chance of being successful. Weeks three and four look at the work of Joyce Epstein and her colleagues and their six different ways in which parents can be productively involved in their child’s education. These include the important roles of parenting, having good communication with the school, volunteering to do things in the school, helping their child learn at home, helping the school to make decisions about what it will do, and actively being involved in the community. At the end of this week you will be asked to write a short essay where you will consider the factors involved in establishing relationships with either other teachers and school administrators or parents.It takes a whole village to educate a child: Working with your communityThis week we consider the importance of looking beyond the school and establishing relationship with the outside community. Students are much more likely to do well if the community values education and provides good policies, appropriate levels of funding, and appropriate training for teachers. We will consider the difference between a regular school and a community school that involves its local community and considers it be a part of the school. We will look at some of the things that a community needs in order to support student learning and explore some ways in which schools can establish partnerships with their community. We will also consider 40 developmental assets that are related to student learning and success, as identified by the Search Institute in the United States. We also reflect on the importance of dialogue as a means of helping each other learn. This is one reason why we have been encouraging you to work in partnership with a colleague – either in your own setting or online – as you work through the ideas in this course. We hope you will either use professional conversations in your school setting or work with others online to enable dialogue that will help you learn.Recognising diversity: Social, Cultural and Values differences in the schoolThis week you are going to have the opportunity to think about the issue of diversity in the classroom. Some of you might think that your classroom is not really a diverse place because all of the students come from your home country. However, diversity goes way beyond issues of nationality and culture. Diversity can include gender, socio-economic background, motivation to learn, and many other factors. We need to consider diversity very carefully if we are to have a classroom that is responsive to the various needs of our students.\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Foundations of Teaching for Learning 8: Developing Relationships", "price": 0, "instructors": "", "institution_name": ["Commonwealth Education Trust"], "commitment": "4-6 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/teacher-relationships", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}