{"selfpaced": true, "topic_name": ["Teacher Development"], "description": "\n\n                    \n                    \n                    This course is designed for classroom teachers who juggle time-sensitive tasks and often-exhausting teaching schedules. With an eye toward long-term sustainability, The Together Teacher examines the purpose for planning ahead, provides tools for tracking time commitments, deadlines and tasks, and helps teachers develop a personal organization system that interacts with their day-by-day practices. \n\nAll teachers, from the pen &amp; paper list maker to the tech-savvy digital maven, will benefit from the no-nonsense approach to \"togetherness\" that's presented in this course. We don't care what format you use; we care that you know when you have free time during the day, and that you have a plan for using it.\n\n                                            Syllabus\n                        Welcome &amp; OrientationIn this introductory session, you’ll explore the difference between ‘organization’ and ’togetherness,’ survey your own strengths and weaknesses and draft a goal for completing the course.Weekly WorksheetThe Weekly Worksheet helps teachers plan their lives for the next 5-7 days. This session introduces the worksheet, shows examples from real teachers, and asks learners to build their own.Comprehensive CalendarCalendars become comprehensive when they hold every important event and deadline in a teacher’s life. This session will show you how to build one.Upcoming To-Do ListHere’s a secret: I hate post-it notes. This session will introduce the Upcoming To-Do List and provide a path toward ditching random lists and building one that you can always count on.Weekly Round-UpNow that you’ve created a weekly worksheet, comprehensive calendar and upcoming to-do list, this session shows you how they all work together. Get ready for the Weekly Round-Up.Templates &amp; Teacher InterviewsThis session is full of optional resources you might want to explore. Download templates and watch great interviews from our teachers.\n                                    ", "end_date": "2014-12-10T00:00:00Z", "title": "Get Organized: How to be a Together Teacher", "price": 0, "instructors": "Maia Heyck-Merlin", "institution_name": ["Relay Graduate School of Education"], "commitment": "1-3 hours", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/togetherteacher", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-10-29T00:00:00Z"}