{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    In times of austerity and shrinking public services, the task of identifying and caring for vulnerable children has never been more challenging. In this free online course, we’ll help you explore some of the issues involved in undertaking this task.\n\nUnderstand risk and vulnerability, in theory and practice\n\nWe’ll consider what we mean by risk and vulnerability, as well as how we define good enough parenting. We’ll think about how children grow and develop, and how we can provide them with containment and security via meaningful relationships and attachments. And we’ll look at the particular skills involved in communicating with children and young people.\n\nWe’ll go on to learn about the characteristics that define different methods of practice and how some approaches can help us to resist risk-averse thinking. We’ll consider different possible interventions and how, in Scotland, this is managed within the Children’s Hearing System.\n\nWe’ll conclude by reflecting on the current politics of caring for vulnerable children in a context of budget cuts and increasing child poverty.\n\nDevelop your career in child care or social work\n\nThe knowledge you gain from this course may prompt you to explore or extend a career in child care or social work services. You’ll also consider the role you play in responding to and caring for the children and young people who you encounter in different aspects of your life. We hope to inspire and challenge you to think differently about how we, as a society, care for vulnerable children and the future lives we help them to create.\n\n\n                                    ", "end_date": "2016-06-20T00:00:00Z", "title": "Caring for Vulnerable Children", "price": 0, "instructors": "Graham McPheat", "institution_name": ["University of Strathclyde"], "commitment": "4 hours", "subject_name": ["Social Sciences"], "course_url": "http://www.futurelearn.com/courses/vulnerable-children?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-05-09T00:00:00Z"}