{"selfpaced": false, "topic_name": ["Sociology"], "description": "\n\n                    \n                    \n                    Dépasser l’égalité de droit pour concrétiser une égalité de fait\r\nLes textes de loi en matière d’égalité et de Lutte Contre les Discriminations existent. Leur application reste cependant très partielle et ce, malgré un arsenal juridique qui ne cesse, au cours des dernières décennies de se renforcer par des directives européennes, des lois nationales. Quels que soient les domaines observés (professionnel, politique, associatif…) la quasi-totalité des études met en relief d’une part, la persistance d’inégalités et démontre d’autre part, que les avancées en matière d’égalité et de promotion de la diversité procèdent toujours d’une démarche volontaire.\r\nPlacer cette thématique au sein des organisations\r\nLe monde de l’entreprise s’engage contre les discriminations, pour la diversité et l’égalité des chances. Une diversité qui agit comme un levier de performance, de créativité et de richesse pour les organisations. Une volonté qui, dépassant les déclarations d’intention, se traduit en actes et s’exprime dans des politiques de recrutement ambitieuses.\n\n                                    ", "end_date": "2016-03-01T00:00:00Z", "title": "Lutte Contre les Discriminations \"être acteur de la diversité\"", "price": 0, "instructors": "Chantal Mathieu, Béatrice Lapérou-Scheneider and Caroline Decoster", "institution_name": ["Université de Franche-Comté"], "commitment": "1 hours", "subject_name": ["Social Sciences"], "course_url": "https://www.france-universite-numerique-mooc.fr/courses/univ-fcomte/89001/session01/about", "duration": "3 weeks", "language_name": ["Others"], "provider_name": ["France Université Numerique"], "start_date": "2016-02-09T00:00:00Z"}