{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is a course which includes baby step by baby step videos in which you will learn exactly how to  generate multiple streams of passive income.</p><p>I will teach you every single secret that I know to making money online without spending any of your own money.</p><p><strong style=\"\">Please notice that you will always be able to invest money if you want your success to come faster, and I will also include extra lessons which will require money investment.</strong></p><p>Every method that I teach in the course is super easy to implement, and if you implement my methods you will be able to earn money while you sleep or on vacation.</p><p>I will keep updating this course all the time, and once you join the course you will get lifetime updates for 100% free.</p><p>Now, because I am fully aware that one of the biggest problems that beginners encounter when they try to make money online is \"Information Overload\" I have kept each lesson extremely short, so you will not be overwhelmed with information.</p><p>After you finish the course, I would love you to post screenshots of any of the following:</p><ol style=\"\"><li>A checklist of how you are going to implement one of the mehthods.</li><li>A timetable that you are going to follow.</li><li>Your earnings after implementing one of the course methods..</li></ol><p><strong style=\"\">Examples</strong></p><p><strong style=\"\">1) I have decided to build an html website and to create a product, so here are the steps I am going to take:</strong></p><p><strong style=\"\">Checklist</strong></p><p>1. Locate a hot niche2. Research your niche.3. Register a domain4. Obtain a hosting package.5. Insert Nameservers6. Acquire Graphics7. Create an eBook8. Create a video course9. Create a audio10. Outsource tasks11. Create Folders12. Download and Use an HTML Editor13. Create Web Pages14. Build A Mailing List15. Upload Files16. Open And Manage A Vendor Account17. Create Upsells18. Drive Traffic</p><p><strong style=\"\">2) Timetable</strong></p><p><strong style=\"\">Monday:</strong></p><p>6:00 - 7:00 - Get prefered.</p><p><strong style=\"\">7:00 - 8:00 - Write 250 words for the first lesson of my new course.</strong></p><p>8:00 - 9:00 - Drive to work.</p><p>9:00 - 17:00 - At Work.</p><p>etc...</p><p><strong style=\"\">Thursday:</strong></p><p>6:00 - 7:00 - Get prefered.</p><p><strong style=\"\">7:00 - 8:00 - Finish first lesson of my new course.</strong></p><p>8:00 - 9:00 - Drive to work.</p><p>9:00 - 17:00 - At Work.</p><p>etc...</p><p>3) After you get some earnings, make a screenshot of them, and post them. Remember that running a business Is a marathon, Not a Sprint</p>", 
    "end_date": null, 
    "title": "7 Ways to Develop a Business on the Internet from Home", 
    "price": "50.00", 
    "instructors": "Amir Rimer", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484070_e976_3.jpg", 
    "course_url": "https://www.udemy.com/7-ways-to-develop-a-business-on-the-internet-from-home/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T07:54:10Z"
}