{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You are looking to self-publish your first book or E-Book or you actually have just written your first manuscript and you are wondering how to get it published and how to promote it and make money from it once the publication process has been completed. That is exactly why this book was written. Self-publishing the first time can be a daunting task, but this book will give you step by step instructions on how to get the job done and it will outline to you both different publishing options that you have and also various marketing strategies that you can employ to effectively get people looking at and thinking about your book. <br><br>For the couple of dollars this book will cost you, you will get literally hundreds of dollars of value. So if getting a book published and promoted is something you desire to do, buying this book to assist you is pretty much a no-brainer. </p>\n\n<p>This is a course that will take you approximately two hours to complete.  it is built primarily as a Microsoft PowerPoint lecture series with an audio overlay and published as videos.  </p>\n\n<p>This is a course you should take if you are even thinking about writing a book and self-publishing it as just by taking it, you will become much more comfortable about undertaking the work ahead of you.  The course will give you a road map to follow to get the job done and it will remove most fears and anxieties about starting in the first place if you have some.  If you are going ahead with this project, this road map will guide you to a successful conclusion so be sure to check it out.</p><p>See you on the inside.  </p><p>Best wishes,<br>Dan Grijzenhout - Course Creator</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "A Guide to Book Self-Publishing and Promotion", 
    "price": "40.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730506_cf9c.jpg", 
    "course_url": "https://www.udemy.com/a-guide-to-book-self-publishing-and-promotion/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-17T00:05:11Z"
}