{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to improve the overall quality of your vocal recordings for online courses, YouTube videos, voiceovers, narration, or other projects? Audacity FREE audio software and the techniques taught in this course and our other course “Audacity Professional Vocals for Courses Video &amp; More Part 2” will get you the professional results you’ve been looking for.</p>\n\n\n\n<p>Hi my name is Eric. I am a course creator and have learned many lessons throughout my recording experiences.  I created this course for anyone who wants to improve the quality of their audio vocal recordings for video or audio projects by learning the basics of audio recording and the Audacity audio recording and editing software.</p>\n\n\n\n\n\n\n\n<p>In this course, “Part 1”, we will review and install Audacity FREE audio recording and editing software, to give you a thorough overview and to prepare you for “Part 2” where we use the software to clean up noise, mistakes, problems, and fix level issues and overall volume and clarity for a professional result…</p>\n\n\n\n\n\n\n\n<p>We will cover:</p>\n\n\n\n\n\n<p>·      An Audio Recording and Editing Overview</p>\n\n\n\n\n\n<p>·      Introduction to Audacity</p>\n\n\n\n\n\n<p>·      Audacity website and robust documentation and support sites</p>\n\n\n\n\n\n<p>·      Installation instructions and demonstration for Audacity</p>\n\n\n\n\n\n<p>·      Installation of third-party plug-ins</p>\n\n\n\n\n\n<p>·      A detailed review of Audacity functions and tools</p>\n\n\n\n\n\n<p>·      Recording audio with Audacity</p>\n\n\n\n\n\n<p>·      A recording overview using screencast software</p>\n\n\n\n\n\n<p>·      Initial audio editing outside of Audacity for preparation (applying to screencast or video software)</p>\n\n\n\n\n\n<p>·      Exporting a udio from other projects for use in Audacity</p>\n\n\n\n\n\n<p>·      Importing audio in to Audacity</p>\n\n\n\n\n\n<p>·      Initial audio analysis and editing with Audacity</p>\n\n\n\n\n\n<p>·      Practice challenges/homework assignments to give you hands-on experience</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Take our course “Part 2” to learn more, using real life audio examples to meticulously clean up noise, mistakes, problems, and fix level issues and overall volume, clarity, and quality for a professional result, followed by exporting the final audio and importing into our screencast or video projects, and lastly a quick review of multi-track audio recording and mixing to take your audio to the next level. Part 2 also includes downloadable Audacity projects and audio files so you can follow along and practice with the actual projects used in the course.</p>\n\n\n\n\n\n\n\n<p>Enroll in this course today to get started using Audacity audio software to get professional audio results for all of your audio and video projects.</p>", 
    "end_date": null, 
    "title": "Audacity Professional Vocals for Courses Video & More Part 1", 
    "price": 0, 
    "instructors": "Eric Larson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/801394_fe6f.jpg", 
    "course_url": "https://www.udemy.com/audacity-professional-vocals-for-courses-video-more-part-1/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-22T22:34:31Z"
}