{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you want to improve the overall quality of your vocal recordings for online course, YouTube videos, voiceovers, narration, or other projects? Audacity FREE audio software and the techniques taught in this course and our “Audacity Professional Vocals for Courses Video &amp; More Part 1” course will get you the professional results you’ve been looking for. Take “Part 1” for an overview and introduction to Audacity and more.</p>\n\n\n\n<p>Hi my name is Eric. I am a course creator and have learned many lessons throughout my recording experiences.  I created this course, Part 2, for anyone who wants to improve the quality of their vocal recordings by focusing on editing already recording audio to get professional final results for many different types of audio and video projects. This course is also for those who use different audio recording and editing software, other than Audacity, as the concepts for editing should apply to most audio editing software titles with similar tools and functions.</p>\n\n\n\n\n\n\n\n\n\n<p>In this course, “Part 2” we will thoroughly go over real life audio examples and meticulously clean up noise, mistakes, problems, and fix level issues and overall volume, clarity, and quality for a professional result, followed by exporting and importing in to screencast or video projects, video synching, and lastly a quick review of multi-track audio recording and mixing to take your audio to the next level.</p>\n\n\n\n<p>This course also includes downloadable Audacity projects and audio files so you can follow along and practice with the actual projects used in the course. Other courses may gloss over processes and issues, but this course takes the time to show very detailed examples, processes, and solutions to get the best results possible…</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>We will cover:</p>\n\n\n\n\n\n<p>·      Audio Recording and Editing Overview</p>\n\n\n\n\n\n<p>·      Introduction to Audacity</p>\n\n\n\n\n\n<p>·      Audacity website and robust documentation and support sites</p>\n\n\n\n\n\n\n\n<p>·      Detailed review of Audacity functions, tools, and processes</p>\n\n\n\n\n\n\n\n<p>·      Initial audio analysis and editing with Audacity</p>\n\n\n\n\n\n\n\n<p>·      Deleting, moving, copying, and re-recording audio segments</p>\n\n\n\n\n\n\n\n<p>·      Removing audio caused by bad vocal habits</p>\n\n\n\n\n\n\n\n<p>·      Removing noise from vocal recordings including white noise, vocal breath and mouth noises, other noises, mistakes, pops and clicks, and more</p>\n\n\n\n\n\n\n\n<p>·      Manual noise removal, noise reduction effect, noise gate plug-in</p>\n\n\n\n\n\n\n\n<p>·      Compression to keep levels in line and to boost overall volume</p>\n\n\n\n\n\n\n\n<p>·      Normalization to bring audio levels to the maximum output level</p>\n\n\n\n\n\n\n\n<p>·      Equalization to improve bass, mid-range, and treble frequencies, and overall sound</p>\n\n\n\n\n\n\n\n<p>·      Practice audio file samples and projects are included in this course</p>\n\n\n\n\n\n\n\n<p>·      Practice challenges/homework assignments to give you hands-on experience</p>\n\n\n\n\n\n\n\n<p>·      Final challenge for you to fix a real-life audio example using all techniques taught in this course</p>\n\n\n\n\n\n\n\n<p>·      Multi-track audio to expand your possibilities and spice up audio projects</p>\n\n\n\n\n\n\n\n\n\n<p>Enroll in this course today to get to the next level of using Audacity audio software for editing already recorded audio to get professional audio results for all of your audio and video projects.</p>\n\n\n\n\n\n\n\n\n\n<p>Requirements:</p>\n\n\n\n\n\n\n\n<p>This software works on Mac, Windows, and Linux but I will be using Mac OSX throughout this course.</p>", 
    "end_date": null, 
    "title": "Audacity Professional Vocals for Courses Video & More Part 2", 
    "price": "20.00", 
    "instructors": "Eric Larson", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802142_0091.jpg", 
    "course_url": "https://www.udemy.com/audacity-professional-vocals-for-courses-video-more-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T18:38:53Z"
}