{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este es un curso de introducción al <strong style=\"\">podcasting</strong> para todas aquellas personas que tienen la necesidad de expresarse y difundir sus inquietudes en formato <strong style=\"\">audio</strong>.</p><p>El podcast es una buena herramienta para llevar a más personas tus aficiones, trabajos  o conocimientos. Cualquier tema es susceptible de generar contenido para un <strong style=\"\">podcast</strong>. Precisamente su fuerza reside en localizar un nicho y crear tu comunidad alrededor del mismo.</p><p>Este curso te enseñará desde cero, las principales herramientas para <strong style=\"\">grabar, editar y publicar</strong> tu podcast.  Se mencionaran recursos gratuitos y de pago, pero se dará énfasis a los primeros. Es posible crear un podcast con muy pocos recursos. Con un micrófono y un ordenador es suficiente para elaborar un programa de calidad.</p><p>El curso no es cerrado en cuanto a su contenido. El podcasting avanza con la aparición de nuevas tecnologías que facilitan día a día una creación más sencilla de los programas. Esto se reflejará con la actualización y adición de nuevas clases.</p><p>Las clases constan de <strong style=\"\">screencasts</strong> mostrando el uso exacto de los programas y páginas empleadas, de tal forma que no te pierdas ninguno de los pasos necesarios.</p><p>Así que si tienes una afición, te gustaría divulgarla en formato audio, y empleando recursos gratuitos, este es tu curso.</p>", 
    "end_date": null, 
    "title": "Audio podcast. Conviértete en un master del podcasting.", 
    "price": "30.00", 
    "instructors": "Carles Fernández", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/612046_1b25_5.jpg", 
    "course_url": "https://www.udemy.com/podcastdesdecero/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T19:35:08Z"
}