{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   In this class you will learn the easiest way of getting started with online passive income; publishing Kindle eBooks on Amazon.The best part is you don&#039;t even need to be able to write at all. Interested? Great, read on.<img src=\"https://d2skqxifvz50tr.cloudfront.net/assets/images/pixel.png\" alt=\"\" style=\" max-width:100%;\">  </p>  <p>  \t   There are so many different ways of making online income now but as I found out myself, the majority of them require a lot of work before you see any return on investment.  </p>  <p>  \t   The delayed gratification makes a lot of people give up before they start making any money online - myself included. Kindle eBook publishing is by far the method that requires the least amount of effort, time and money. In fact you can get started right away without spending a dime.In this class I will give you a step-by-step plan to building a portfolio of eBooks that will provide you scalable passive income.  </p>  <p>  \t   The methods I teach in this class currently make me +$1500 a month in passive income.  </p>  <p>  \t   You don&#039;t need to be good at writing or know anything about publishing at all. I will teach you how to pick out topics that will sell books, and how to hire writers to write these books. Many of these principles are also extremely useful if you choose to do the writing yourself.  </p>", 
    "end_date": null, 
    "title": "Become an Amazon Kindle eBook Publisher", 
    "price": "20.00", 
    "instructors": "Nicklas Rasmussen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184812_1d23.jpg", 
    "course_url": "https://www.udemy.com/ebookpublisher/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-18T19:33:10Z"
}