{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\tKindle from “<strong>Zero to Hero</strong>” course,\r\n</p>\r\n<p>\r\n\tthe only one of its kind out there!\r\n</p>\r\n<p>\r\n\tInterested?\r\n</p>\r\n<p>\r\n\tAre you looking for a quick, <em><strong>down to Earth, nothing held back, no B...S... course</strong></em> that will arm you for success in the world of online Kindle publishing?\r\n</p>\r\n<p>\r\n\tThe course that will provide you the secrets “from the  trenches” other authors keep for themselves? The seminar that is not conventional, but a little “out of the box”?\r\n</p>\r\n<p>\r\n\t<strong>If you answered yes to any of the above questions you came to the right place:</strong>\r\n</p>\r\n<p>\r\n\t“Kindle Secrets from the Trenches” is the shortest and the quickest way for successfully starting your online publishing empire.\r\n</p>\r\n<p>\r\n\tThe author and instructor is (as you probably very quickly noticed) a non native english speaker and nevertheless is successfully competing with best selling authors on the Amazon (you can do the same)!\r\n</p>\r\n<p>\r\n\tSince “the wizard behind it” comes from one of the smallest countries in the world, he knows what is meant when he says it is for the people without the time and thousands of dollars to invest in their new business!\r\n</p>\r\n<p>\r\n\tIt is for all who need results fast (you read the title right – <em><strong>create a bestseller in 72 hours</strong></em>).\r\n</p>\r\n<p>\r\n\twith the help of this course you will be able to go from zero to hero in just 3 days.\r\n</p>\r\n<p>\r\n\tif you are already “in the Kindle trenches”, there are many tricks in there for you too.\r\n</p>\r\n<p>\r\n\tMany courses have hours and hours of materials. Nothing wrong with that. But if I can, I can get my results faster. Straight to the point! Just the meat! All the tips you need to start<strong>!  </strong>\r\n</p>\r\n<p>\r\n\t<strong>EVERYTHING needed for success is included!</strong>\r\n</p>\r\n<p>\r\n\tWant more knowledge? Good, but I suggest you go for it after the “auto-pilot money pipeline” from your new books is already established.\r\n</p>\r\n<p>\r\n\tKnowing that, how exactly did this venture start?\r\n</p>\r\n<p>\r\n\tMany “gurus” use lots of fancy words (often to many) to teach you amazing methods. Techniques, they are often not using themselves.\r\n</p>\r\n<p>\r\n\t<em><strong>I read many of the guides like that and “took the bullets” so you don&#039;t have to!  </strong></em>\r\n</p>\r\n<p>\r\n\t I know, money is the issue for some of you, who are thinking about starting this new “publishing adventure.”\r\n</p>\r\n<p>\r\n\tTherefore I decided to make this course as affordable as possible. You will pay exactly 27$* for it (the price of two meals in a half decent restaurant).\r\n</p>\r\n<p>\r\n\tI think this is a small investment in a product that can change your life <em><strong>virtually overnight</strong></em>.\r\n</p>\r\n<p>\r\n\tEspecially since you are covered with the full, no question asked 30 days unconditional money back guarantee if this course doesn&#039;t deliver!\r\n</p>\r\n<p>\r\n\tAre you ready to take the plunge? Do it!\r\n</p>\r\n<p>\r\n\tWhen not now, when?!\r\n</p>\r\n<p>\r\n\tSee you inside!\r\n</p>\r\n<p>\r\n\tBostjan Belcic, <em>the Kindle Wizard</em>\r\n</p>\r\n<p>\r\n\tP.S.\r\n</p>\r\n<p>\r\n\tCongratulations and write this date down. Today you made the first step towards the brighter future and re-curing income that can buy your financial freedom!\r\n</p>\r\n<p>\r\n\tP.P.S.\r\n</p>\r\n<p>\r\n\tIs it only about Kindle? Yes. Because if you ask me, this is the best way to make your fortune in the world of the e-book publishing.\r\n</p>\r\n<p>\r\n\tP.P.P.S.\r\n</p>\r\n<p>\r\n\tNobody or nothing is perfect. The same is true for this course! Therefore it is a <strong>living </strong>creation, meaning I will be adding bonus stuff along the way (based mainly around your questions and needs).\r\n</p>\r\n<p>\r\n\tP.P.P.P.S.\r\n</p>\r\n<p>\r\n\tThere is some additional &quot;Ninja classified stuff inside also&quot;, about which I cannot speak here.\r\n</p>\r\n<p>\r\n\tP.P.P.P.P..S.\r\n</p>\r\n<p>\r\n\tBut be quick, since the coupons are very limited. Remember - first guy gets the bride!\r\n</p>", 
    "end_date": null, 
    "title": "Become a Winner in the World of Kindle Publishing", 
    "price": "20.00", 
    "instructors": "Bostjan Belcic", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47378_f873_7.jpg", 
    "course_url": "https://www.udemy.com/kindlesecrets/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-25T22:09:07Z"
}