{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>JOIN 8,200+ STUDENTS LEARNING HOW TO GENERATE LEADS FROM BLOGGING! SEE HOW TO BLOG YOUR WAY TO MORE LEADS AND MORE BUSINESS.  \t</strong></p>\n\n<p><em>LATEST: Course Fully Updated For June 2016</em><strong></strong>  </p>\n\n\n\n\n\n<p>  \t    In this course, I'll be teaching you the exact methods that I  used to  create my blog, Create My Independence from nothing to over 1,100   subscribers and a half a million page views, enabling me to  build  relationships with hundreds of people and create an independent online business of my own.  </p>\n\n\n\n\n\n<p>  \t<strong>What is my experience on the topic?</strong>  \t                          I've been blogging for over three years. I'm almost completely  self taught  (hundreds of hours of trial and error). I've exchanged  hundreds of  emails with my readers. I've written over 200 posts to date  and have  built relationships with hundreds of bloggers and influencers  in my niche. From my blog, I've built my own independent online business from scratch (from $0 to over $40,000 in revenue).  </p>\n\n\n\n\n\n<p>  \t<strong>Who is this course for?</strong>  </p>\n\n\n\n\n\n<p>  \t                  This course is for business owners and entrepreneurs who are tired of trying the old tactics and not seeing results.  </p>\n\n\n\n\n\n<p>  \t<strong>What problems does this course for solve for businesses?</strong>  \t                          It saves businesses hundreds of hours of trial and error in creating their own blog. It gives them the exact blueprint for  choosing a topic and name, choosing a blog platform, setting  up your  site, customizing it and generating leads from it.  </p>\n\n\n\n\n\n<p>  \t<strong>Who is this course NOT for?</strong>  </p>\n\n\n\n\n\n<p>  \t                  This course ISN'T for businesses who aren't willing to invest long term in their growth.  </p>", 
    "end_date": null, 
    "title": "Blogging to Generate Leads: Business Blogging Essentials", 
    "price": "45.00", 
    "instructors": "Kraig Mathias", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407154_2d8e.jpg", 
    "course_url": "https://www.udemy.com/business-blogging-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T21:17:41Z"
}