{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>“[VR is] the next major computing platform that will come after mobile.\" </em>-- <strong>Mark Zuckerberg</strong>, <em>Facebook</em></p><p>---</p><p><strong>Are you a filmmaker who wants to learn the <em>secrets</em> of producing <em>immersive video content</em> for <em>virtual reality</em> headsets? Then read on..</strong></p><p>People interested in cinematic VR drown in the waterfall of tech news, become demotivated by the utter lack of clear information, and get lost in the jungle of obscure internet fora in search of much needed tips and tricks. This is why many simply <strong>give up</strong>..</p><p>Do you ever feel overwhelmed by the amount of <strong>problems</strong> you need to solve before you can finally start shooting some content? Do you ever feel lost in the technological jargon? <em>Then this course is for you!</em></p><p>The <em>Cinematic VR Crash Course</em> teaches you everything you need to know to start shooting your own mind-bending cinematic VR experiences. From selecting a <strong>360° camera rig</strong> and scripting, to the actual shoot and distribution of your content, this course covers it all in 10 high-quality, to-the-point video lectures.</p><p>Besides video lectures, this course includes example footage to get a feel for the material, a glossary to explain key terminology, quizzes to test your knowledge, an extensive <strong>workflow checklist</strong> to make sure your recording goes smoothly, and a <strong>list of resources</strong> to help you acquire all the gear you need to get started.</p><p>Concepts are introduced gradually, so that even a beginner will be able to follow along and <strong>become a virtual reality expert in no-time! </strong></p><p>Upon successful completion of this course you will be able to:</p><p>✔ Understand all aspects of cinematic VR</p><p>✔ Film and produce your own cinematic VR experiences</p><p>✔ Take on paid assignments with confidence, because you'll know how to deliver</p><p>✔ Record and mix ambisonic audio</p><p>✔ Select the 360° camera rig that fits you best</p><p>✔ Discover the limitations and possibilities of this exciting new medium</p><p>✔ Get our 360 file management software for free<br></p><p>✔ Gain knowledge that few possess</p><p>✔ Become one of the Virtual Reality pioneers</p><p>✔ Plus much more!</p><p>Over the past six months, we have been working on our own 360° 3D camera rig to produce cinematic VR content and have gained valuable, first-hand knowledge in this area. Knowledge which only few possess, and which we want to share with the world in one complete package!</p><p><strong>So do <em>you </em>want to discover how to produce VR video content like the pros? Then click \"Take This Course\" to start your Virtual Reality journey today!</strong></p>", 
    "end_date": null, 
    "title": "Cinematic VR Crash Course - Produce Virtual Reality Films", 
    "price": 0, 
    "instructors": "Nick Kraakman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582056_3490.jpg", 
    "course_url": "https://www.udemy.com/cinematic-vr-crash-course-produce-virtual-reality-films/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T10:47:23Z"
}