{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"> If you're a article writer who wants to know the secrets of making money online, selling articles online, and kindle short reads, then you're about to discover how to start your own profitable business selling articles right now! <br style=\"\">  \t<br style=\"\">  \t  In fact, if you want to know learn how to make money online selling short and simple articles, then this new video course - \"How To Make Money Online Selling Articles On Amazon and More\" - gives you the answers to 10 important questions and challenges every article writer faces, including: <br style=\"\">  \t</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">how can you make money selling articles as ebooks? </strong></li>  \t<li style=\"\"><strong style=\"\">Where can I sell my articles for money online? </strong></li>  \t<li style=\"\"><strong style=\"\">How do I get my articles published?</strong></li>  \t<li style=\"\"><strong style=\"\">How do I determine an in-demand topic? </strong></li>  \t<li style=\"\"><strong style=\"\">What is the best way to promote my articles once they are available for purchase? </strong></li>  </ul>  <p style=\"\">  \t<strong style=\"\"> ... and more! <br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">     So, if you're serious about wanting to start your own profitable business selling information products and you want to know learn how to make money online selling short and simple articles, then you need to grab a copy of \"How To Make Money Online Selling Articles On Amazon and More\" right now, because article writing Expert, Rick Grubb, will reveal to you how every article writer, regardless of experience level, can succeed - Today!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">   In this course we will be going over every detail you can think of and answer all your questions in detail through video lectures, PDF's and quizzes.  Don't worry either, I will be here every step of the way to answer any questions you may have while going through the course.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">   Helping others succeed is what I am good at and helping you succeed in your ebook and article business is my top priority.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">     These are highly guarded secrets that top online kindle authors don't want you to know.  Stop waiting and get going on this amazing adventure.  See you on the inside.</strong>  </p>", 
    "end_date": null, 
    "title": "Complete Guide to Selling Articles on Amazon", 
    "price": "20.00", 
    "instructors": "Rick Grubb", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/108864_2c83_12.jpg", 
    "course_url": "https://www.udemy.com/complete-guide-to-selling-articles-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-21T21:59:08Z"
}