{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Now You Can Have A Title That Makes Your Book Stand Out From The Competition And Rise To The Top Of The Bestseller Charts</strong></p><p style=\"\"><em style=\"\">Are you worried your non-fiction book will get lost in the sea of overwhelming competition?</em></p><p style=\"\"><em style=\"\">Do you want to know what bestselling authors do to FORCE people to notice their books?</em></p><p style=\"\">In my time coaching authors, I&#039;ve seen so many of them struggle to get book sales even though they have a great book and well done promotions... all because their <strong style=\"\">title</strong> didn&#039;t intrigue a potential reader enough for them to learn more about the book.</p><p style=\"\">I believe all of those with valuable content should be able to get it in the hands of people who need it the most.  Since I don&#039;t want other authors to make the same mistakes I did, this led me to become obsessed with the art and science of creating compelling book titles because I knew it was the most valuable thing I could share with my students.  </p><p style=\"\">This is all part of my commitment to create the training courses I wish I had when I first started my journey of book publishing.</p><p style=\"\"><em style=\"\">So I spent countless hours...</em></p><ul style=\"\"><li style=\"\">Scanning the book shelves in a retail book store and online and wrote down over 500 book titles that made me want to buy...</li><li style=\"\">Looking for what all the best titles had in common psychologically...</li><li style=\"\">Finding &quot;copy n&#039; paste&quot; templates that could be used to effortlessly create great titles...</li><li style=\"\">Identifying &quot;power words&quot; that instantly grab your attention...</li><li style=\"\">Noticing what each niche does differently than other niches...</li><li style=\"\">Creating the ultimate guide to crafting book titles THAT SELL...</li></ul><p style=\"\"><strong style=\"\">Now You Will Discover All The Secrets I Found Studying Over 500 Of The Most Tantalizing Book Titles Ever!</strong></p><p style=\"\">And the best part is, YOU don&#039;t have to spend countless hours doing the research! Isn&#039;t it nice to have someone ELSE do all the boring research so you don&#039;t have to?</p><p style=\"\"><strong style=\"\">When you enroll in this course you&#039;ll discover...</strong></p><ul style=\"\"><li style=\"\">5 psychological tricks that will FORCE people to notice your book. If you don&#039;t have at least one of these things, you WILL get buried by competitors&#039; books!</li><li style=\"\">Over 500 of the most intriguing titles I&#039;ve ever seen - and WHY they work!</li><li style=\"\">3 key questions readers have your title should answer. Although answering #3 is optional, it&#039;s my secret weapon for going from good sales to astronomical sales!</li><li style=\"\">How I&#039;m able to go into the most competitive niches and dominate by following my simple formula for innovation!</li><li style=\"\">Hidden titling mistakes no one else will ever tell you about based on human needs psychology!</li><li style=\"\">Copy N&#039; Paste templates to quickly and easy jumpstart your title ideas!</li><li style=\"\">The only proven way to ensure you have a winning title!</li></ul><p style=\"\"><strong style=\"\">How The Course Is Delivered</strong></p><p style=\"\">You&#039;ll get video training on the psychological principles behind what intrigues readers with a book title.</p><p style=\"\">However, what can be most valuable is found in the PDF resource guides which provide over 500 examples of great book titles divided in multiple ways to help you brainstorm your own ideas.</p><p style=\"\">You can...</p><p style=\"\">- See examples of great titles in your same genre or niche.</p><p style=\"\">- See examples of titles by positioning - such as controversial or curiosity inducing titles.</p><p style=\"\">- See which words are commonly used in a variety of niches.</p><p style=\"\"><strong style=\"\">A Simple Switch In Your Title Means You&#039;ll Effortlessly Attract More Sales On Autopilot Every Single Day!</strong></p><p style=\"\">Now you may be wondering...</p><p style=\"\"><strong style=\"\">Why Learn From Me?</strong></p><p style=\"\">I&#039;m extremely passionate about helping authors like you achieve success because I know what it&#039;s like to be a struggling broke valet parker who could barely sell a couple books to my own family members...</p><p style=\"\">To having the freedom to do what I love, share my message with the world, and leave a legacy I&#039;m proud of all through the power of self-publishing.</p><p style=\"\">It frustrates me when I see other authors struggling because they haven&#039;t discovered the same insights I have.</p><p style=\"\">And since I&#039;ve already done the hard working of uncovering these insights, I&#039;m going to hand them to you with this training to save you the time and headache.</p><p style=\"\">I walk the talk as I&#039;m currently active in self-publishing and only teach what I&#039;ve learned AFTER achieving #1 bestseller status in multiple categories - and that includes almost 3,000 sales of my books in a single day on my best sales day ever. </p><p style=\"\">I&#039;m here for my students and I&#039;m happy to answer any questions you have related to the training. </p><p style=\"\"><strong style=\"\">Here&#039;s What Other Experts And Authors Have To Say About The Training...</strong></p><p style=\"\">“Having the right title can make or break the success of your book. The trouble is most authors don&#039;t know how to craft a title that compels potential readers to select the &#039;buy&#039; button. What Derek provides with his product is a step-by-step strategy for identifying a winning title. Not only does he tell you how to do it, he provides hundreds of examples and why they work for specific markets. So if you&#039;re struggling with what to name your next book, then I recommend picking up a copy of this actionable product.&quot; - <strong style=\"\">Steve Scott - Bestselling Kindle Author of 61 Ways To Sell More Non-Fiction Kindle Books </strong></p><p style=\"\">“[This training*] was truly an eye opener for me. It really made me realize a differnet way to blow my competiter out of the water by creating books that grab reader&#039;s attention right away. Derek&#039;s training is really worth your time and effort. You are missing a big piece of the puzzle and leaving a lot of money on the table if you pass up this training.&quot; - <strong style=\"\">Emran Saiyed - Founder of Six Figure Kindle Club</strong></p><p style=\"\">“Before I watched [this training*], I thought all you had to focus on with your titles was keywords and the people would buy. Derek taught me that I was leaving money on the table by not creating captivating titles and subtitles that actually make browsers want to click. It makes no sense to spend your hard earned money on a bunch of promotional strategies only to send readers to a great cover with a less than stellar title. Thanks to Derek&#039;s advice I can finally balance out my keyword needs with the titling needs of the reader while still ranking high for relevancy. I found this to be one of the easiest methods of understanding how to write headlines not only for my Kindle books but also headlines for my book description and my chapter titles.&quot; - <strong style=\"\">Darrin Wiggins - Kindle Author </strong></p><p style=\"\"><em style=\"\">*product name has changed for Udemy</em></p><p style=\"\"><strong style=\"\">Enroll Now Completely Risk Free!</strong></p><p style=\"\">I&#039;m looking forward to working with you on your journey to becoming a highly successful self-published non-fiction author. </p><p style=\"\">Derek Doepker - Your friend in self-publishing</p><p style=\"\">P.S. Just scroll up and click &quot;Take This Course&quot; now to start on your journey on creating book titles that will sell your books! </p>", 
    "end_date": null, 
    "title": "Create Captivating Non-Fiction Book Titles That Sell", 
    "price": "45.00", 
    "instructors": "Derek Doepker", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567780_bc01_3.jpg", 
    "course_url": "https://www.udemy.com/create-captivating-non-fiction-book-titles-that-sell/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T23:02:00Z"
}