{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Watch the First Five Lectures for Free<br></strong></p>\n\n<p><strong>More than 2,200 students so far.<br></strong></p>\n\n<p><strong>Hi. My name is Ian Stables, author of more than fifty Kindle books. I am going to teach you how to create professional book covers that sell more - and do it for free.</strong><br></p>\n\n<p><strong></strong></p>\n\n\n\n<p><strong>Here is how I am going to do it...</strong></p>\n\n\n\n<p>  - I am going to show how to include certain cover elements that generate more sales.</p>\n\n\n\n<p>  - I will introduce you to a free online resource that will allow you to create your book covers for free. (Not Gimp or Photoshop.)</p>\n\n\n\n<p> - I will explain how to use the design tools to get professional results.</p>\n\n\n\n<p> - I am going to teach you how to create special design effects that make your book stand out. (It took me a while to discover all these tricks. You'll quickly learn them all in this course.)</p>\n\n\n\n<p> - I will walk you through complete book cover creations and reveal special design tricks. (This will give you even more techniques and ideas. It will also help you understand how to use the tools in practice.)</p>\n\n\n\n<p>This is not just another book cover design course. This teaches how to create book covers that sell. Covers that stand out from other books. Ones that grab attention.<strong></strong></p>\n\n\n\n<p><strong>There is something that will result in a lot more interest and sales. I call it DIFFERENCE. I discovered this when I saw a certain cocktail drink. </strong>I'm going to teach you how to design your own book covers. They will look professional, eye-catching, and have the DIFFERENCE element.</p>\n\n\n\n<p><strong></strong>Don't have book covers similar to others. Have a different one that grabs attention.</p>\n\n<p><strong>Watch the First Five Lectures for Free</strong><br><strong></strong></p>\n\n\n\n<p><strong>Enroll now and learn how to create professional book covers that have the DIFFERENCE.</strong></p>", 
    "end_date": null, 
    "title": "Create Professional Book Covers That Sell - For Free", 
    "price": "20.00", 
    "instructors": "Ian Stables", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703992_3f7e_2.jpg", 
    "course_url": "https://www.udemy.com/different-book-cover-design-that-sells-more-how-to-create/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T17:48:43Z"
}