{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  If you are a Mac Owner and you want to:  </p>  <p style=\"\">  \t  1.  Add video to your website  </p>  <p style=\"\">  \t  2.  Add video to your wordpress site  </p>  <p style=\"\">  \t  3.  Add your teachings or tutorials to your blog  </p>  <p style=\"\">  \t  4.  Upload tutorials to your YouTube channel  </p>  <p style=\"\">  \t  5.  Or create a web show like I did at YourConnectedLife.com  </p>  <p style=\"\">  \t   . . . then ScreenFlow is the most awesome tool to do the above tasks.  Screenflow is about 99 bucks, its for Mac only.  (If you are a PC user you would probably want to look into Camtasia.)  </p>  <p style=\"\">  \t  For me, by building my video presence online with tech tutorials for my audience, interviews, episodes and shows, I have been able to build my credibility, make more money and because of my online presence I have been hired for even more paying gigs (visibility increases the know-like-trust factor exponentially which leads to profitability).  Super awesome!  Everything that I have done online has been with the use of ScreenFlow - seriously, the best 99 bucks I have ever spent.  </p>  <p style=\"\">  \t  This course is for you if you are also trying to increase your presence online with video clips, interviews, tutorials etc and would like someone to point out the basic tools of ScreenFlow all in one place.  </p>  <p style=\"\">  \t I have broken down ScreenFlow into byte-sized chunks of information so you have a resource on learning the basic tools so you can move forward quickly.  Please note - I do not cover every detail of the more advanced concepts of ScreenFlow.  This course is for those beginners and intermediate folks who are looking to produce awesome videos quickly.  </p>", 
    "end_date": null, 
    "title": "Create Great Tutorials, Videos & Web Shows with ScreenFlow", 
    "price": "50.00", 
    "instructors": "Becca Niederkrom", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/79796_eb5a_8.jpg", 
    "course_url": "https://www.udemy.com/basicvideos/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-16T22:55:47Z"
}