{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Video Creation </strong>- Video is fast becoming the predominant medium for communicating facts and ideas quickly. Facebook is now following Youtube's lead and making user interaction revolve around <strong>video creation</strong> and promotion.</p><p><strong>With so much video being created</strong>, how can we be sure that our video stands out above the crowd? Of course, any video we create must have the best quality content, whatever our goal or intention. The key is to engage people and keep them watching YOUR video. One way to do this is to add overlays to your video.</p><p><strong>What Is an Overlay?</strong></p><p><strong></strong><strong></strong>Simply put, a video overlay is an image file that can be added to any video clip so that any image you like can be displayed at the same time as the video is viewed. This course teaches the following aspects of video creation:</p><ul><li>explaining the different images files available and which can be used as a video overlay image</li><li>how to create an overlay image file in PNG format</li><li>adding an overlay file when creating your video</li></ul><ul><li>using FREE resources to create video with overlay image files</li></ul><p><br></p><p>Students should be familiar with Windows Movie Maker, Wondershare Video Editor, or any other video editing software that allows image files to be added to the timeline as an additional channel. (The courses demonstrations use Wondershare, but the procedure is the same for all editors.)</p><p>You will be familiar with basic image editors, and in the course we will be using PhotoPos Pro, a free editor. This should be downloaded before starting the course.</p><p>Ideally, you will be growing your Youtube Channel or Facebook pages using video and looking for ways to improve your presentations.<br></p><p><strong>Special Bonus:</strong></p><p><strong></strong>Adding the 'Secret Sauce' to your Youtube videos. Giving your video the edge when it comes to Youtube and Google organic search. You will learn:</p><ul><li>how to edit video and thumbnail image properties before uploading to Youtube</li></ul><p>The complete course will take around 1.5 hours to complete, and will give students the tools need to create attractive and original videos.<br></p><p><br></p><p><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Create Videos That 'Sizzle' - Video Overlays", 
    "price": "20.00", 
    "instructors": "Jim Bruce", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/687410_b7ab_2.jpg", 
    "course_url": "https://www.udemy.com/create-video-image-overlays/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-02T21:10:12Z"
}