{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><span>The old line, </span><em>What I Really Want to do is Direct,</em> <span>about sums it up for most people who have a desire to be in film or television or simply create an awesome Youtube video</span>. But what does a director actually do? And how can you learn the craft with a head start on your competition? These and other questions will all be answered in this Master Class</p><ul><li><span><span></span>In this course you will learn industry \"Best Practices\" that will allow you to adopt professional best practices and operate efficiently and with confidence.</span></li><li><span>A Director is a leader and a motivator - within this course you will pick up <em>tricks of the trade</em> to get people to work tirelessly for you and your production</span></li><li>A Director is said to have \"an eye\" for shot composition - within this course you will learn all the major camera angles and be able to develop your own <em>eye.</em></li><li><span>You will learn basic 3- point lighting techniques that will make any production shine.</span></li><li><span>You will learn the three-phases of any production and what specific roles and responsibilities a director must fulfill in each.</span></li></ul><span>This goal of this 2 and 1/2 hour course is to lay the ground work and establish the basic skills and best practices you need to direct your own Youtube videos with skill and perhaps become a working director in the film or television industry. </span>", 
    "end_date": null, 
    "title": "Create Better Youtube Videos Learn the Art of Directing", 
    "price": "40.00", 
    "instructors": "Robert Child", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23902_3ccc_7.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-directing-in-the-real-world/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-30T18:03:23Z"
}