{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will teach you how to seize hidden opportunities around you and generate at least $10,000 per month without needing to learn new skill or develop new work schedule!</p><p>You can do so by selling valuable services for $500 to $800 that you purchase for just $99 from third party! You will create wealth while being being just a middleman and putting 2 and 2 together!</p><p><strong>Get ready to sell your services to heaps of hungry brick-and-mortar business owners WITHOUT needing to worry about fulfillment as you would be simply outsourcing the fulfillment part to third party person for approx 1/5th of the amount you would get paid!</strong></p><p>I will dissect every step of this amazing business model and will show you how you can utilize amazing technology and platforms that are available at your disposal to set up a system once and then let it start magnating never-ending stream of clients even while you sleep!</p><p>If you have 20-30 minutes from day then <strong>YOU too</strong> can set up this system and it will start attracting clients that will pay you $500 - $800 hand over fist! </p><p>You will NEVER run out of clients to sell your services to because I will show you an untapped source that has unlimited supply of your ideal clients! </p><p><br></p><p><strong>What you DON'T need</strong></p><ul><li>You DON'T need a website</li><li>You DON'T need to talk to business owners and try to hard-sell them your services</li><li>You DON'T need to learn any complex selling skills like consumer psychology!</li><li>You DON'T need any technical knowledge</li><li>You DON'T need to be in the same locality where you sell your services (It's all done virtually, online)</li><li>You DON'T need to invest weeks before you see result, you can potentially get your first sale within 24 hours </li><li>You DON'T have to conduct presentations or meetings in order to sell your services.</li></ul><p>In short..<br></p><p><strong>This course will show you the shortest, simplest and laziest way to set up a system and start earning quick $400 per sale within 24 hours!</strong></p><p><br><strong></strong></p><p><strong>What You Are going to get from this course?</strong></p><ul><li>Quickest and laziest way to potentially generate $10,000 per month while being a middleman without any technical skill or deep pocket.</li></ul><ul><li>Entire business model with every step of the process dissected</li></ul><ul><li>Learn what is the Secret platform that we use to find endless supply of hungry business owners that will immediately pay money to help them out.</li></ul><ul><li>Learn which in-demand services you should sell for which business owners will pay you premium prices</li></ul><ul><li>Learn how to position yourself and sell your service the right way </li></ul><ul><li>Learn how to exactly find guys that will fulfill the service you would sell so you don't have to learn new skill and get your hands dirty</li></ul><ul><li>Learn how to create perfect advertisement that will automatically start attracting ideal clients for you who will pay premium prices</li></ul><ul><li>Learn how to create the system that will work on autopilot</li></ul><ul><li>Learn how to scale this business past 6 and 7 figures per year so you can get reliable, long-lasting and predictable income month after month</li></ul><ul><li>Get the exact breakdown of generating your $10,000 per month with this business model</li></ul><p><strong>And much much more...</strong></p><br><strong></strong>", 
    "end_date": null, 
    "title": "Create Your Very Own 5 Figure Per Month Business From Home", 
    "price": "20.00", 
    "instructors": "Joe Gibson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605822_d18c_2.jpg", 
    "course_url": "https://www.udemy.com/generate-at-least-10000-per-month-being-just-a-middleman/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T12:08:05Z"
}