{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tIntroducing The Brand New, 10 Part, Step By Step Video Course That Shows You...  </p>  <p style=\"\">  \tFinally, Learn How To Create High-Quality Profitable Books While Lowering Your Overhead Costs And Without Writing a Single Word... Starting Today  </p>  <p style=\"\">  \t      This specific training course was designed to help you watch over my shoulder, step-by-step, click by click, to ensure that you are able to successfully and effectively create a profitable book.  </p>  <p style=\"\">  \t      Dear Future Book Creator,  </p>  <p style=\"\">  \t      It&#039;s a fact. Amazon noted that their Kindle electronic books sold many times more than their hardcover books. So, while formats do change, books are still highly profitable. Now traditional books alone are a dying breed in certain markets, but still sell in others. Therefore, you need to know your market.  </p>  <p style=\"\">  \t      In fact, recently one of the biggest traditional brick and mortar booksellers in the market has been closing many of their local stores. And if you observe closely, you&#039;ll notice that while many of these stores have people, they are doing things other to buying books.  </p>  <p style=\"\">  \t      Now while many people are buying books online, this feeds the trend of people producing books online.  </p>  <p style=\"\">  \t<strong style=\"\">Problem #1 - Not everyone can create a book.</strong>  </p>  <p style=\"\">  \t      If you don&#039;t have the artistic or creative ability to write fictional books, then it doesn&#039;t matter anymore.  </p>  <p style=\"\">  \t      Now you can own your very own fictional book created by somebody else with your very own name on it.  </p>  <p style=\"\">  \t<strong style=\"\">Problem #2 - Spelling and grammatical mistakes</strong>  </p>  <p style=\"\">  \t      Did you know that incorrect grammar and spelling is one of the main complaints from readers?  </p>  <p style=\"\">  \t      The problem arises because many people create books, but then can&#039;t find a good proofreader.  </p>  <p style=\"\">  \t      I have encountered many proofreaders or editors, only to find that I have many more mistakes still inside of the book. So while I have lost a lot of money and time, I have figured out a way to pinpoint good proofreaders. You&#039;ll learn from me certain characteristics and traits that these people have.  </p>  <p style=\"\">  \t  Grab this video course and learn how to create high-quality profitable books while lowering your overhead costs and without writing a single word.  </p>  <p style=\"\">  \t  P.S - Not everyone can create a book, but now you can by watching this video series.  </p>  <p style=\"\">  \t  P.P.S – This specific training course was designed to help you watch over my shoulder, step-by-step, click by click, to ensure that you are able to successfully and effectively create a profitable book.  </p>", 
    "end_date": null, 
    "title": "Create High-Quality Profitable Books Without Writing a word", 
    "price": "20.00", 
    "instructors": "Peter Gardner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367074_2944_3.jpg", 
    "course_url": "https://www.udemy.com/book-outsource-blueprint-learn-how-to-outsource-your-book/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T03:36:03Z"
}