{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">Sociable Video</strong></em> is a training course dedicated to <strong style=\"\">making you awesome</strong> at leveraging the conversion power of marketing with video. Focusing on the creation of highly shareable creative content that empowers interaction and action.  </p>  <p>  \tI will show you step by step how to get started and <strong style=\"\">succeed in the world of video marketing</strong>. From overcoming your fear of being on camera, to what types of content people share, how to trigger them to share it, the technical aspects of production, equipment for any budget, video search engine optimization, setting up your YouTube channel, leveraging influencers, seeding your videos, interacting with your viewers and so much more!  </p>  <p>  \tVideo connects with your followers and customers in a more powerful way than any other marketing method. Most businesses and brands are still doing it wrong. I will show you how to do it right so your followers will deeply connect with you and your business. Paving the way for <strong style=\"\"><em style=\"\">more sales and life long customers.</em></strong>  </p>  <p>  \t<br style=\"\">  \t<em style=\"\">&quot;I&#039;m impressed! This is the must have course for anyone interested in learning the ins &amp; outs of content marketing and social media. Wayne has created an actionable training series based on his real world experience and has successfully connected the dots on the key elements any business needs to succeed in digital marketing.&quot; </em><br style=\"\">  \t <strong style=\"\"> - <a href=\"http://www.linkedin.com/in/craigscottbland\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Craig Bland</a>  / Digital Strategist</strong><br style=\"\">  </p>  <p>  \t<strong style=\"\"><em style=\"\">Some of what you will learn...</em></strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">What people are triggered to share. </strong><strong style=\"\"></strong>Learn what types of video content your business can create that are more likely be shared by your viewers.</li>  \t<li><strong style=\"\">The right way to use YouTube. </strong>The best practices to get your video to stand out from the masses and grow your subscribers quickly. As well how to get viewers back over to your own website.</li>  \t<li><strong style=\"\">Find video topics your customers are searching for. </strong>Easily find hundreds of video content ideas for any market that people are already looking to know more about.</li>  \t<li><strong style=\"\">Turn viewers into action takers. </strong>You want people to do something that will benefit your business after watching your video! I will show you many ways to make this happen.</li>  \t<li><strong style=\"\">Video Search Engine Optimization. </strong>The proper use of meta-tags and brainstorming creative keywords to target is vital to the success of a video. I&#039;ll show you how to do right from the get go!</li>  \t<li><strong style=\"\">Get social influencers to post your videos. </strong>Learn how to effectively encourage high trafficked blogs and social account holders to post your content.</li>  \t<li><strong style=\"\">Export settings for all devices. </strong>Your videos need to be high quality and play quickly on all desktops, tablets and other mobile devices. Use the settings in this course for a happy viewing experience every time.<br style=\"\">  \t </li>  \t<li><strong style=\"\">The right equipment for any budget.</strong> From zero dollars to thousands of dollars, I will show how to squeeze the most out of your production budget with exact equipment recommendations. <br style=\"\">  \t </li>  \t<li><strong style=\"\">Create eye-catching thumbnails. </strong>Learn what elements to include and how to make custom thumbnail images with my Photoshop screencast tutorial.<br style=\"\">  \t </li>  \t<li><strong style=\"\">Juice your videos with paid views.</strong> I&#039;ll show you how to jumpstart your video campaign and get more organic (free) views by using Google Adwords for Video.<br style=\"\">  \t </li>  \t<li><strong style=\"\">27+ engaging video format ideas.</strong> Present your information in a way that people want to watch! Steal from the four episodes of concept and show ideas.<br style=\"\">  \t </li>  \t<li><strong style=\"\">My color correction secrets. </strong>My special technique for improving the brightness, tone and <span>overall look of pretty much any video, even if you didn&#039;t light very well.</span></li>  \t<li><strong style=\"\">Leverage different types of talent. </strong>Having different types of knowledgeable experts and personalities (even celebrities!) in your videos can add value to your content. I&#039;ll show you how to do it!</li>  \t<li><strong style=\"\">Read &amp; exploit your video statistics. </strong>Analytics can be confusing at first glance but I will show you how to turn them into a back story of your video and then use that knowledge to do more with what is working.</li>  \t<li><strong style=\"\">Build relationships with your followers. </strong>Their are several strategies you can implement for continual and effective connection with your viewers. Involving your followers will turn them into fans for life!</li>  \t<li><strong style=\"\">Collaborations &amp; Joint Ventures. </strong>Find ways to work with and swap resources with someone else for a mutually beneficial outcome. These are some powerful strategies especially when you are just starting out.<br style=\"\">  \t </li>  </ul>", 
    "end_date": null, 
    "title": "Create Awesome Videos That Thrive on Social Media & YouTube", 
    "price": "45.00", 
    "instructors": "Sociable Video Training", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43617_09cf_11.jpg", 
    "course_url": "https://www.udemy.com/sociablevideo/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-26T09:09:08Z"
}