{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t Un <strong style=\"\">comunicado</strong> o <strong style=\"\">nota de prensa</strong> es un escrito (normalmente un mail) dirigido a los miembros de los &quot;Medios de comunicación&quot; (periódicos, revistas, emisoras de radio, TV, medios online, bloggers...) con el objetivo principal de <strong style=\"\">llegar a su audiencia</strong>.  </p>  <p>  \t Una nota de prensa <strong style=\"\">puede anunciar</strong> una serie de noticias, eventos, promociones, premios, nuevos productos y servicios, ventas y otros datos financieros, logros, comienzo de una nueva actividad, etc...  </p>  <p>  \t Es, sin duda, la herramienta más utilizada por agencias de relaciones públicas y por las propias empresas para <strong style=\"\">promocionarse y ganar notoriedad</strong>, en la mayoría de los casos, de manera gratuita.  </p>  <p>  \t Sin embargo, para conseguir este objetivo, debemos antes <strong style=\"\">atraer la atención del periodista</strong> o medio en cuestión para conseguir que publique nuestro comunicado. <strong style=\"\">Nuestra nota compite</strong> con el resto de notas en la bandeja de entrada del periodista y, por lo tanto, la nuestra debe destacar sobre el resto y generar el suficiente interés para no terminar en la papelera.  </p>  <p>  \t Nuestra misión no termina ahí, ya que aunque logremos que lean nuestra nota de prensa,<strong style=\"\"> debemos conseguir que la publique.</strong> Para ello, nuestro contenido deber ser &quot;<strong style=\"\">noticiable</strong>&quot; y de relevante interés periodístico.  </p>  <p>  \t <strong style=\"\">¿QUÉ APRENDERÁS EN ESTE CURSO?</strong>  </p>  <p>  \t En este curso aprenderás a redactar y enviar una nota de prensa de manera correcta y eficaz, siguiendo una <strong style=\"\">estructura</strong> comunicativa adecuada a los medios periodísticos para lograr tus objetivos. Aprenderás, entre otras cosas:  </p>  <ul style=\"\">  \t<li>Establecer tu <strong style=\"\">objetivo</strong></li>  \t<li>Seleccionar los <strong style=\"\">medios</strong> de comunicación adecuados </li>  \t<li>Redactar la <strong style=\"\">historia</strong></li>  \t<li>Elegir el <strong style=\"\">titular</strong></li>  \t<li>Adaptar el <strong style=\"\">estilo</strong></li>  \t<li>Adecuar el <strong style=\"\">formato</strong></li>  </ul>  <p>  \t Además, estudiaremos<strong style=\"\"> 4 ejemplos reales</strong> de notas de prensa que te pueden servir como ejemplo.  </p>  <p>  \t El curso incluye <strong style=\"\">documentación extra descargable e imprimible</strong> en PDF con el <strong style=\"\">resumen del curso</strong> y un <strong style=\"\">guión básico</strong> para lograr una estructura exitosa.  </p>  <p>  \t No pierdas la oportunidad de <strong style=\"\">DAR A CONOCER TU PROYECTO</strong> y empieza ya a redactar <strong style=\"\">notas de prensa eficaces</strong>.  </p>  <p>  \t ¡Te espero!  </p>", 
    "end_date": null, 
    "title": "Cómo redactar una nota de prensa", 
    "price": "20.00", 
    "instructors": "Mónica Vicente Tamames", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/132370_89e9_5.jpg", 
    "course_url": "https://www.udemy.com/como-redactar-una-nota-de-prensa/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-11T16:21:38Z"
}