{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Video = Awesome</strong>  </p>  <p>  \t          Interested in how video can increase your sales? With video we can show people exactly why they should do business with us what the benefits are and what action they need to take to get started. Research shows that video is a really valuable and important tool in persuading customers to take action.  </p>  <p>  \t          Don&#039;t let your business miss out on the video revolution!  </p>  <p>  \t<strong>You will learn everything you need:</strong>  </p>  <p>  \t         This course is short, concise and too the point. No time wasted on padding and fluff.  </p>  <p>  \t         We will look at:  </p>  <p>  \t          The benefits of video.  </p>  <p>  \t          What separates a good script that gets people taking action from a bad script that people ignore.  </p>  <p>  \t          What elements make up a good video.  </p>  <p>  \t          How to produce a great quality video no matter what your budget or expertise level.  </p>  <p>  \t          How to get your video online and how to share it with the world.  </p>  <p>  \t<strong>HOWEVER...</strong>  </p>  <p>  \t      The first part of the course is just a quick talk covering general principles.  </p>  <p>  \t      The last two vids you will see those principles in action in a walkthrough step by step example.  </p>  <p>  \t      I&#039;m not teaching &#039;the one and only way to create a video&#039;. There is no one approach or one software you can learn, I&#039;m just discussing ideas about how you can go out and make your own videos with your own approach.  </p>  <p>  \tWhile I cover the basics, if you feel you need to learn a certain software in depth like, screenflow, aftereffects, photoshop, there are plenty of courses covering those on udemy already.  </p>  <p>  \t    Miguel Hernandez&#039;s course &quot;How to Create an Awesome Demo Video for Your Business&quot; good as it is, only works if you then spend months learning how to illustrate with adobe illustrator and animate with adobe aftereffects, which are a very expensive and very complex, professional, industry-standard programmes. It can take expert animators weeks to produce a 1-2min video using AE so it&#039;s unrealistic that the average person is going to go that route.  </p>  <p>  \t      The guy who left the 1 star review was missing the point.  </p>  <p>  \t<strong>About your instructor:</strong>  </p>  <p>  \t          In the last two years I&#039;ve written and produced nearly 200 demo/sales/explainer videos for business clients, so I know about what separates a video that will bring in a big ROI vs a video that people will just ignore. Save yourself time and effort learning things the hard way and grab a shortcut to success.  </p>  <p>  \t<strong>Completely risk free guarantee:</strong>  </p>  <p>  \t          If you feel this course was of no value to you udemy will refund you within 30 days. Simple.  </p>  <p>  \t<strong>So what are you waiting for?</strong>  </p>  <p>  \t          Sign up and start creating your own sales increasing videos right now!  </p>", 
    "end_date": null, 
    "title": "Demo Video: Tips On How To Make & Produce Your Own!", 
    "price": 0, 
    "instructors": "Robert Brown", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256638_38ec_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-produce-your-own-demo-kickstarter-video/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-06T20:21:10Z"
}