{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t              Imagine having your eBook on Amazon Kindle, Nook, Google Books as well as other top online publishing platforms. The dreams of thousands of independent, small and first time authors, just like you, are now being realized. eBook publishing is the first step to a successful writing career and just 5 years ago (2010), ebooks surpassed print book sales. No longer can &#039;<em>corporate fat cats</em>&#039;, sitting an a smoke-filled backroom and making dirty publishing deals, keeping people just like you out of the market, control your future - YOU DO!  </p>  <p>  \t<strong>This course teaches new and first-time authors</strong>:  </p>  <p>  \t                        1. Formatting eBooks for immediate, online distribution with no experience  </p>  <p>  \t    2. How to create stunning e-covers with no fancy and expensive software required  </p>  <p>  \t    3. The top 4 online publishing and distribution websites  </p>  <p>  \t                         4. Locating eager buyers for your titles  </p>  <p>  \t                         5. Setting-up an author website sales funnel  </p>  <p>  \t                         6. How to strategically place your titles next to best-sellers to increase profits  </p>  <p>  \t                       These are only the beginning of many more tools, techniques and best practices you&#039;ll learn in this course. Additionally and to ensure your success, we take authors beyond simple publishing and distribution and provide the following marketing strategies;  </p>  <p>  \t                         1. Maximizing page flip software for beginners  </p>  <p>  \t                          2. Receiving social website shares to increase sales  </p>  <p>  \t     3. Marketing titles on eBook directories where millions of customers are  </p>  <p>  \t                          4. Using business presentations to increase sales and profits  </p>  <p>  \t  The time to live your dream of becoming a successful and published author is now so join us <strong>TODAY</strong>!<br>  </p>  <p>  \t<strong>Free Video Viewers - to view in best quality which is 720HD, once video is launched, go to bottom right area of video player and switch from &#039;360&#039; to 720HD.</strong>  </p>", 
    "end_date": null, 
    "title": "Ebook Publishing", 
    "price": "20.00", 
    "instructors": "Brian Dale", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42426_31fa_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-self-publish/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-19T18:42:54Z"
}