{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                Thousands of indie authors self-publish their books on Amazon, Barnes &amp; Noble, iBooks and many other platforms, and there are many courses out there that teach you how to self-publish an eBook. But eBooks differ from traditional books in many regards; many indie authors struggle with putting their novel into a format that is suitable for eBook conversion, and very few of the self-publishing courses give detailed instructions on how to go about formatting a manuscript so that it will produce an eBook that looks great. This course aims to remedy that by showing you, step-by-step, what you need to do to your Word manuscript to create a professional-looking eBook instead of an unreadable wreck.</p>  <p style=\"\">  \t<strong style=\"\">Learn the little-known techniques that allow you to create a truly professional looking eBook from your Word document.</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>eBooks vs. print books - things you must know</li>  \t<li style=\"\">Quick removal of markup that ruins any eBook</li>  \t<li style=\"\">Styles - your secret weapon for professional formatting</li>  </ul>  <p style=\"\">  \t            In this course you&#039;ll learn, in a series of hands-on exercises, how to fix the issues that get documents rejected by Amazon and other online bookshops. You&#039;ll get to try every step of the process with exercise documents designed to show you the most common mistakes that indie authors make when creating their work. By the end of the course you will have a well-stocked toolbox that allows you to find and fix those mistakes.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t            Suitable for anybody with a basic knowledge of Word, this course will guide you, step by step, through the process of formatting a document to make it suitable for eBook creation.  </p>  <p style=\"\">  \t            First you will learn about the challenges involved in converting a Word document, which has a fixed layout, to an eBook, which does not.<br style=\"\">  </p>  <p style=\"\">  \t      Following that you&#039;ll find out how to use Word&#039;s tools to identify, find and fix anything that will cause issues with your eBook conversion - in a matter of minutes. You&#039;ll be able to follow each lesson with the practice documents provided at the beginning of the section to give you proper, hands-on experience on how to use the tools and techniques described in the lessons.  </p>  <p style=\"\">  \t      After you have mastered these tools, the course will introduce you to one of the most powerful and under-used feature of Word - styles. You&#039;ll learn how to use styles to change almost the entire look and feel of any Word document instantly, and how to use styles to create the eBook layout you want for your novel. Again, you&#039;ll have the opportunity to put each lesson into practice with the training materials for the section.  </p>  <p style=\"\">  \t        After finishing the course you&#039;ll be able to take your existing novel and format it to create a great-looking eBook.  </p>", 
    "end_date": null, 
    "title": "eBook creation for indie authors: get that professional look", 
    "price": "20.00", 
    "instructors": "Frauke Nonnenmacher", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342794_5c3c_2.jpg", 
    "course_url": "https://www.udemy.com/ebook-creation-for-indie-authors-get-that-professional-look/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T21:59:17Z"
}