{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul style=\"\">  <li>Learn How To Design, Build and Publish an eBook Quickly</li>  <li>Self Publishing Means You Keep All The Profits And Maintain Full Rights.</li>  <li>Learn How To Quickly Write, Distribute and Profit From Your Creativity</li>  </ul>  <p>In this eBook creation training course you will learn how to create and publish professional eBooks using Adobe InDesign. An expert training and accomplished author gives you access to everything you need to know to become highly successful and profitable by creating and distributing eBooks.<br style=\"\">   eBooks (or ePubs) are a powerful way to publish your document, be it a book, instruction manual or just a personal journal for your own personal perusal to any platform from the Apple Store to the Kindle. </p>    <p>You will start by setting up an InDesign template for your ePub. You will import the text and work with character and paragraph styles for your publication. You will learn how to do basic formatting, add page breaks and a table of contents. Andy shows you how to add and optimize images in your eBook, and how to export and proof your ePub. This video tutorial covers methods of publishing your eBook to Kindle, iTunes, working with alternate ePub formats, generating externals links, and much much more.</p>    <p>Once you have completed this computer based training course, you will understand the tools and techniques that you need in order to start publishing your own eBooks. Working files are included, allowing you to follow along with the author throughout the lessons.</p>", 
    "end_date": null, 
    "title": "eBook Creation Tutorial The Art Of Successful Publishing", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36305_0f6d_9.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-successful-ebook-creation-and-publishing/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-15T17:45:54Z"
}