{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul>  \t<p>Seit mehr als 15 Jahren  schreibe ich Bücher. Mit dem Angebot des Verkaufs eigener Bücher auf Amazon stellte sich mir die Frage, wie kann ich ohne großartige Kenntnisse von HTML und CSS ein eBook erstellen, das dem Leser Freude bereitet. </p><p>Nach langem Probieren von diversen Programmen, unter anderem Sigil, aber auch Scrivener (was ich heute noch zur Planung und Ordnung meiner Ideen nutze), bin ich auf Jutoh gestoßen. Dieses Programm hat es mächtig in sich, ohne jedoch den Nutzer zu überfordern.</p><p>Ich habe für Sie den Kurs über Jutoh erstellt, damit Ihnen der Einstieg in das Programm erleichtert wird, damit Sie sehen, was alles möglich ist.</p><p>Lernen Sie in dem vorliegenden Kurs das Programm Jutoh näher kennen. Das Erstellen von eBooks wird damit wesentlich einfacher und das Ergebnis ist ein professionell erscheinendes Buch, welches auf den Lesegeräten Ihrer Leser einfach klasse aussieht.</p>  \t<p>  \t\tSie benötigen keine Vorkenntnisse und können sofort starten.  \t</p>  \t<p>  \t\tTeil 1: Warum Jutoh</p><p>Teil 2: Jutoh installieren</p><p>Teil 3: Vorbereitungen</p><p>Teil 4: Unser Projekt</p><p>Teil 5: Fortgeschrittene Tipps</p><p>Teil 6: Profi-Tipps</p><p>  \t\tLegen Sie Zettel und Stift bereit und notieren Sie sich wesentliche Schritte, schauen Sie mir über die Schulter, wie ein neues eBook entsteht. </p><p>Gemeinsam erstellen wir im Kurs ein neues eBook mit Jutoh. Sie werden sehen, dass keine Vorkenntnisse an HTML oder CSS notwendig sind.</p>  \t<p>  \t\tViel Spaß beim Ansehen.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Einfache Formatierung für ein perfektes eBook", 
    "price": "50.00", 
    "instructors": "Dozentin Kathrin Hamann, Matthias Matting", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287462_b7cd_6.jpg", 
    "course_url": "https://www.udemy.com/jutoh-der-einfache-weg-zu-einem-perfekten-ebook/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T15:27:03Z"
}