{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Der Kurs beschreibt, wie Sie Ihre <strong style=\"\">Einnahmen als eBook-Autor bei Amazon</strong> und auf anderen Lernplattformen technisch und sachlich korrekt versteuern. </p><p style=\"\">Sie lernen auf absolut verständliche und nachvollziehbare Weise:</p><ul style=\"\"><li style=\"\">Welche <strong style=\"\">Pflichten </strong>Sie vor und während Ihrer Autoren-Tätigkeit erfüllen müssen.</li><li style=\"\">Was Sie dem Finanzamt wann mitteilen müssen und was dabei zu beachten ist.</li><li style=\"\">Was es mit der <strong style=\"\">Zusammenfassenden Meldung</strong> beim BZSt auf sich hat.</li><li style=\"\">In welchen Zeilen der Umsatzsteuer-Erklärung Ihre Einnahmen von Amazon, Apple und anderen landen.</li><li style=\"\">Wie Sie korrekt <strong style=\"\">Rechnungen schreiben</strong>, damit das Finanzamt sie akzeptiert.</li><li style=\"\">Woher Sie eine Umsatzsteuer-ID erhalten.</li><li style=\"\">Was das Reverse-Charge-Verfahren bedeutet.</li></ul><p style=\"\">Alle Aspekte werden zum einen ausführlich erklärt (inklusive PDF-Folien zum Download). Zum anderen führe ich Ihnen praktisch vor, wie Sie die nötigen Schritte absolvieren.  <strong style=\"\">Musterrechnungen </strong>stehen ebenfalls zum Download bereit. </p><p style=\"\">Sue sollten den Kurs absolvieren, weil er <strong style=\"\">wichtiges Basis-Wissen</strong> für alle Selfpublisher und unabhängigen Autorinnen und Autoren mit Wohnsitz in Deutschland vermittelt. Für die komplette Bearbeitung (inklusive praktischer Übungen) benötigen Sie etwa einen halben Tag.</p><p style=\"\">Achtung: Im Kurs findet <strong style=\"\">keine individuelle Steuerberatung</strong> statt.</p>", 
    "end_date": null, 
    "title": "Einnahmen aus eBooks als Autor korrekt versteuern", 
    "price": "30.00", 
    "instructors": "Matthias Matting", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513576_83df.jpg", 
    "course_url": "https://www.udemy.com/einnahmen-aus-ebooks-als-autor-korrekt-versteuern/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T12:02:08Z"
}