{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                  MAS DE 500 ESTUDIANTES SE HAN MATRICULADO EN ESTE CURSO  </p>  <p style=\"\">  \t                  ********************************************************************************  </p>  <p style=\"\">  \t<strong style=\"\">AVISO ESPECIAL</strong>  </p>  <p style=\"\">  \t<span style=\"\">Una vez dentro del curso, tendrás acceso a todas las actualizaciones sin costo adicional.</span>  </p>  <p style=\"\">  \t                  *********************************************************************************  </p>  <p style=\"\">  \t<strong style=\"\">¡Tienes que emprender un libro!</strong>  </p>  <p style=\"\">  \t                    ¿Estás listo para impactar, trascender y prosperar con tu libro? Inscríbete en este curso y habrás tomado el paso más importante para comenzar tu proceso.  </p>  <p style=\"\">  \t                                     Si eres conferenciante, consultor, coach, educador, ofreces tu servicio profesional <strong style=\"\">o tienes algún mensaje que quieres compartir</strong> y desear convertirte en un emprendedor líder con ese mensaje, te recomiendo que comiences por escribir un libro con propósito. ¿Con qué propósito? Con el propósito de avalar tu posición en el mercado, diferenciarte, impactar al mundo con tu contenido y emprender un modelo de negocio viable con tu libro.  </p>  <p style=\"\">  \t<strong style=\"\">¿Cómo te puede ayudar el curso Emprende con tu libro?</strong>  </p>  <p style=\"\">  \t            He diseñado este curso con información muy valiosa que abrirá tu mente y tu carrera a una serie de posibilidades que obtendrás al escribir tu libro. Compartiré contigo de manera muy práctica, genuina y hasta jocosa, mi experiencia y la metodología que me ha permitido producir maravillosos resultados como autora. Entre estos alcanzar en Amazon, la posición #1 en la lista de los libros más vendidos en español dentro de la categoría de “entrepreneurship”, maximizar mi posicionamiento como experta, obtener la atención los medios de comunicación y sobre todo el acceso a una calidad de clientes que a pesar de mi experiencia, conocimiento y títulos académicos, jamás hubiera podido alcanzar de otro modo.  </p>  <p style=\"\">  \t<strong style=\"\">Una oportunidad real</strong>  </p>  <p style=\"\">  \t                                     Cada día son más los profesionales y empresarios que han logrado potenciar significativamente su credibilidad, posicionándose como expertos y líderes en sus respectivas industrias.   Han alcanzado la diferenciación ante su competencia y han multiplicado sus posibilidades de expansión y visibilidad al publicar un libro.  </p>  <p style=\"\">  \t                                     Según el New York Times el 81% de las personas dice que cuentan con un libro dentro de ellos. La otra cara de la moneda es, que <strong style=\"\">la mayoría de las personas nunca escriben ese libro y los que logran escribirlo, muy pocas veces consiguen publicarlo</strong>.  Lo más interesante de esta historia es que la razón principal para este resultado en nada tiene que ver con lo bueno que ese libro pueda ser, sino en<strong style=\"\"> las estrategias correctas para presentarlo a posibles lectores o casas publicadoras.</strong> De hecho, casi todos los autores que muestran sus libros a un agente literario o casa publicadora por primera vez, son rechazados inmediatamente.  </p>  <p style=\"\">  \t                      Mi propósito no es desalentarte, sino todo lo contrario.  </p>  <p style=\"\">  \t<strong style=\"\">Tengo las herramientas para que logres emprender con tu libro.</strong>  </p>  <p style=\"\">  \t                                    Mi intención es decirte que ésta realidad no tiene que ser la tuya.  Tú puedes evitar intencionalmente caer dentro de éstas estadísticas.  ¿Porqué estoy segura de esto? Porque personalmente lo estoy viviendo.  </p>  <p style=\"\">  \t                                     La buena noticia es que <strong style=\"\">deseo enseñarte cómo tú también puedes aplicar una metodología para que superes tus metas y emprendas con tu libro</strong>.  </p>  <p style=\"\">  \t<strong style=\"\">¿Qué obtendrás en el curso Emprende con tu libro?</strong>  </p>  <p style=\"\">  \t                                   Compartiré contigo un curso en video <strong style=\"\">grabado en vivo,</strong> diseñado para ti en 4 fases con más de 20 videos de contenido estratégico y 4 videos de talleres de aplicación práctica.  Al final de cada fase podrás descargar los ejercicios de aplicación y reflexión en formato pdf.  Han sido creados para  ayudarte a tomar acción inmediata en los conceptos, estrategias y secretos aprendidos.  </p>  <p style=\"\">  \t<strong style=\"\">BONO</strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Qué te parece aprender cómo emprender un modelo de negocio viable con tu libro? Podrás conocer todos los detalles en la sección de bono de este taller.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">¿Cuál es la metodología de este curso?</strong>  </p>  <p style=\"\">  \t                                   La metología  EmprendeSer®, es un concepto, compuesto por las palabras Emprender y Ser y significa una nueva conciencia de reconocer y despertar al emprendedor que está en todos  como la germinación de una nueva semilla, para entonces desarrollar de manera proactiva nuestro máximo potencial, en esta ocasión como autores.  </p>  <p style=\"\">  \t                               Se consolida en un proceso de cuatro fases para lograr eficientemente la realización de cualquier proyecto, incluyendo el emprender un libro.  </p>  <p style=\"\">  \t                                   Conoce lo que aprenderás en cada fase:  </p>  <p style=\"\">  \t<strong style=\"\">Fase 1: Prepara el Terreno:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Estrategias para desarrollar una nueva conciencia que determinará tu éxito como autor.</li>  \t<li style=\"\">Oportunidades y reglas para maximizar tu alcance en la nueva industria de la publicación.</li>  \t<li style=\"\">Estrategias para romper con los mitos y aumentar la productividad, enfoque,compromiso y claridad para escribir y publicar.</li>  \t<li style=\"\">Método para descubrir el propósito que te llevará a escribir y conceptuar el libro idóneo, con poca competencia y superar tus metas.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Fase 2: Cultiva a tu ser Emprendedor:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Consejos para identificar el mejor método para publicar.</li>  \t<li style=\"\">Secretos para dominar la Auto Publicación.</li>  \t<li style=\"\">Estrategias para preparar el contenido que tu lector desea.</li>  \t<li style=\"\">Sistema para completar tu manuscrito en 3 meses.</li>  \t<li style=\"\">Bases para redactar ‘La propuesta del libro’.</li>  \t<li style=\"\">Como formar un equipo de recursos de publicación.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Fase 3: Permite que tus ideas germinen</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Estrategias para diseñar libros irresistibles para el lector.</li>  \t<li style=\"\">Consejos para evitar escribir un libro que ya está escrito.</li>  \t<li style=\"\">Estrategias para diseñar portadas que venden (La psicología del libro)</li>  \t<li style=\"\">Bases para llevar el contenido de tu libro a formatos digitales.</li>  \t<li style=\"\">Guias para preparar el libro para la producción.</li>  \t<li style=\"\">Guias para reproducir y distribuir eficientemente el libro.</li>  \t<li style=\"\">Tendencias en impresión</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Fase 4: Planifica para la buena cosecha</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Guías para estimar la inversión para publicar un libro</li>  \t<li style=\"\">Alternativas para obtener fondos para el libro como, crowdfunding y otras estrategias </li>  \t<li style=\"\">Estrategias para recuperar la inversión rápidamente y capturar la mayor cantidad de  regalías.</li>  \t<li style=\"\">Mapa de la plataforma de mercadeo del autor.</li>  \t<li style=\"\">Secretos para atraer, retener y expandir los clientes </li>  \t<li style=\"\">Estrategias para el lanzamiento perpetuo del libro y obtener ventas recurrentes</li>  \t<li style=\"\">Tácticas para obtener la atención constante de los medios </li>  \t<li style=\"\">Estrategias para conseguir endosos para el libro.</li>  \t<li style=\"\">Sistema para convertir tu libro en un emprendimiento lucrativo y generar ingresos recurrentes y derivados. (BONO)</li>  </ul>  <p style=\"\">  \t<strong style=\"\">¿Cómo debes completar el curso?</strong>  </p>  <p style=\"\">  \t                                  El curso puede ser completado en un solo día o varios. El compromiso con tu sueño y tu deseo para emprender con tu libro determinarán tus resultados.  Me comprometo a compartir contigo las herramientas que te apoyarán en tu proceso, pero solo tú puedes auto disciplinarte y poner las mismas en acción.  </p>  <p style=\"\">  \t                                 ¿Estás listo para impactar, trascender y prosperar con tu libro? Inscríbete en este curso y habrás tomado el paso más importante para comenzar tu proceso.  </p>  <p style=\"\">  \t                                  ¡Exito!  </p>  <p style=\"\">  \t                                 Anita Paniagua  </p>", 
    "end_date": null, 
    "title": "Emprende con tu Libro", 
    "price": "35.00", 
    "instructors": "Anita Paniagua", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96182_dc82_11.jpg", 
    "course_url": "https://www.udemy.com/taller-intensivo-emprende-con-tu-libro/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-23T17:01:10Z"
}