{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Watch the First Five Lectures for Free<br></strong></p><p><strong class=\"redactor-inline-converted\"></strong>More than 3,200 students enrolled.<strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">Discover some real eye-opening and profitable ideas for your future non-fiction books.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Get access to places on the internet that have ever growing lists of countless ideas... proven to be profitable.</strong></p><p>==================================================================================<br></p>\n\n<p><strong class=\"redactor-inline-converted\">Recent reviews</strong><br></p>\n\n<p>Diane Bell</p>\n\n<p><em>\"This course has a wealth of useful information. If you are in need of some inspiration, this is the course for you.\"</em><br><br>VIRGINIA</p>\n\n<p><em>\"I have not written any reviews at this time, although I have over 100 courses that I'm studying. The content is extremely comprehensive and informative. The instructor's delivery is very interesting and engaging. I feel that this is an Excellent course for getting you interested and started writing. I know that I'm ready! I am also taking this Instructor's other course \"Write In Steps: The easier way to write a non-fiction book\" . so, my review will be seen there as well. I'm that impressed!\"</em></p>\n\n<p>Wendy Aston</p>\n\n<p><em>\"I especially liked the information on writing a book that cannot be copied. Lots of other sound advice as well. Thank you!\"</em><br></p>\n\n<p>=======================================================================================<br></p>\n\n<p>I assume you write non-fiction Kindle books, like I do. I know that it can be difficult to come up with new subjects to write about. I know how it can be a real struggle to find a profitable idea for an upcoming book. I always had this problem every time I wanted to write my next one. Not any more.</p>\n\n<p><strong class=\"redactor-inline-converted\">With a bit of outside the box thinking and searching, I've found so many ideas. There are so many that you will never be able to use all of them.</strong></p>\n\n<p>I discovered some real light bulb moments. There are ones that you could continue to write about and never run out. These are book subjects that you would have no trouble selling.</p>\n\n<p><strong class=\"redactor-inline-converted\">I've also discovered</strong> several places where there are lists of countless book ideas on just about any subject you could imagine. What's more, these ideas have already proven to be profitable.</p>\n\n<p>There is a very well known website in particular. A lot of authors don't realize that this place is an idea goldmine. All you need to do is search using two certain key words. You are instantly presented with a massive amount of brilliant book ideas. I think of this place as the font of all knowledge.</p>\n\n<p>There is a headache that millions of people have. This only gives you unlimited ideas that people will always want.</p>\n\n<p>I also thought of an idea that is really enjoyable to write about. You \nactually get to enjoy yourself and write your book at the same time. \nWhat's more, nobody else can copy your book. Plus, these type of books \nare lapped up by the public.<br></p>\n\n<p><strong class=\"redactor-inline-converted\">It's much better to offer something better than other books.</strong> This makes readers see your book as the best choice. There is a three step way to do this. A lot of writers usually just do the first step. If you only do the first one, your book will be similar to others. The second and especially last step is what makes your book stand out.</p>\n\n<p><strong class=\"redactor-inline-converted\">Why am I sharing my secrets?</strong> I want to let you in on the great ideas I've discovered. I want to help my fellow authors. You aren't my competitor. You are someone who shares my passion.</p>\n\n<p><strong class=\"redactor-inline-converted\">There are more than enough ideas for everyone.</strong> They will never run out. In fact, many can only be created by you. Nobody can copy you.</p>\n\n<p>Also, by following my three step process, any idea can be made better than what's out there already.</p>\n\n<p>I've produced a series of videos where I give you all my ideas and tell you where to find countless more. You'll never struggle for an idea again.</p>\n\n<p><strong class=\"redactor-inline-converted\">30 Day Money Back Guarantee: </strong>I\n am confident you will benefit from this course and improve the way you \nwrite your non-fiction books from now on. But if for any reason you are \nnot happy, for your peace of mind, Udemy offer a 30 day full money back \nguarantee. Udemy handle the refund process themselves. However, I'm sure\n you will love the system I present here and as a result will not want \nyour money back.</p><p><strong>Watch the First Five Lectures for Free</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Get access to endless book ideas. Let's get started. <strong class=\"redactor-inline-converted\">Join more than one thousand one hundred students who have already signed up for this course. </strong>Enroll now.</strong></p>", 
    "end_date": null, 
    "title": "Endless Nonfiction Book Ideas - You'll Never Run Out Again", 
    "price": "20.00", 
    "instructors": "Ian Stables", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633330_7b6b_2.jpg", 
    "course_url": "https://www.udemy.com/endless-nonfiction-book-ideas/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T08:52:56Z"
}