{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Explainer videos are becoming a very popular form of marketing that many freelancers would love to offer. Unfortunately, many people believe creating them is a difficult job that requires a skilled animator. This course aims to show you otherwise. It aims to show you, somebody with little-to-no experience, how to create great looking professional quality explainer videos that you can sell to your clients.</p><p style=\"\"><strong style=\"\">Learn and Master the Art of Making Explainer Videos Quickly In This Comprehensive Course For Beginners </strong></p><ul style=\"\"><li style=\"\">Recognize the concepts of what makes a great explainer video</li><li style=\"\">Learn how to create a custom-made explainer video, step-by-step, from beginning to end.</li><li style=\"\">Learn where I find valuable resources for adding to my explainer videos</li><li style=\"\">Learn how to charge your clients for explainer video projects</li></ul><p style=\"\"><strong style=\"\">A Powerful and Valuable Skillset For Any Freelancer</strong></p><p style=\"\">Learning how to create explainer videos with Explaindio puts a powerful and very useful tool at your fingertips. There are many benefits to knowing how to properly make an explainer video and sell it. You can become a more valuable freelancer to potential clients seeking this service, especially since many businesses around the world are now seeking explainer videos to describe what they do.</p><p style=\"\">This course is really geared towards someone who doesn&#039;t have any experience with programs such as Photoshop, Flash, After Effects and all of those other complicated pieces of software that have steep learning curves. Explaindio, on the other hand, is not geared towards professional artists and makes it easy for just about anyone to create great looking explainer videos. Using my method you&#039;ll be making beautiful videos in no time. That said, you&#039;re also going to learn how to sell these videos to your clients.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Students will first understand core concepts of explainer videos learning how to structure a script. Then we&#039;ll venture on to see some great resources you can use for obtaining stock photos, videos, and more, free of charge.</p><p style=\"\">Once we&#039;ve covered that we&#039;ll go through an example of creating an explainer video from beginning to end. You&#039;ll be able to watch the instructor as he takes you from conception to completion of the project. During this process you will go through all of the steps needed to create a video. Finally, We&#039;ll move onto the business end learning how to quote a project for a client, where you can sell your videos, and more.</p><p style=\"\">In order to do what I do you don&#039;t have to be an artist. You just need to get those creative juices flowing. And if you don&#039;t feel that you are creative, don&#039;t underestimate yourself. I&#039;m going to show you how to be creative using my method and it&#039;s not as difficult as you may think.</p><p style=\"\">By the end of this course, you&#039;ll have valuable skills that you can start using to seek jobs creating explainer videos for clients in order to expand your freelance or work-from-home business.</p>", 
    "end_date": null, 
    "title": "Explaindio For Freelancers", 
    "price": "40.00", 
    "instructors": "Charles Fisher", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479950_5dca_2.jpg", 
    "course_url": "https://www.udemy.com/explaindio-for-freelancers/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T21:10:14Z"
}