{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Fashion Blogging - A Practical Guide from A-Z</strong></p><p>I am a professional fashion blogger, and in this course I will guide you through everything you need to know to create and build you own successful blog. We'll cover blogging topics relevant to fashion, lifestyle, beauty and travel blogs, and take a realistic look at how to build a blog on a budget with absolutely no technical knowledge.</p><p>If you're considering fashion blogging as a hobby or a career this course is for you. It's going to be a comprehensive A-Z cover the end goal of monetisation techniques, but also all the 101 Basics about building a site and registering a domain name. </p><p>Fashion blogging is huge amounts of fun and can be as big or small commitment as you choose. I'm so excited to teach you all about blogging and share my passion with you!</p><p><span></span><em>After taking this course you will:</em></p><ul><li>Have your own fully fledged functional fashion blog</li><li>Known which cameras, lenses, lighting, and equipment can help you on your blogging journey</li><li>Master writing an engaging and creative blog post</li><li>Take beautiful photographs that keep readers coming back</li><li>Be connected to a worldwide community of brands, bloggers and readers</li><li>Understand SEO and DA scores and know how to rapidly improve your blog stats</li><li>Successfully design, build and even self host your own fashion blog from scratch</li><li>Choose a great name and niche that'll last you for a lifetime</li></ul>Take this course today, and begin your journey to having a full fledged fashion blogging career!", 
    "end_date": null, 
    "title": "Fashion Blogging: Starting a Fashion Blog", 
    "price": "25.00", 
    "instructors": "Louise Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442714_0bd4_4.jpg", 
    "course_url": "https://www.udemy.com/fashion-blogging/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T12:45:12Z"
}