{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Join over 1500 fiction writers and complete your novel. Over 100 hundred new writers joined in the last month!</p>  <p>  \t                    Now updated with full transcripts!  </p>  <p>  \t<strong>Check out these recent reviews.</strong>  </p>    <p>  \t<strong><em>Thank you.</em></strong>  </p>  <p>  \t<em>\"A detailed course, that is easy to follow. The outline detailed is comprehensive and adaptable.\"</em><strong></strong>  </p>  <p>  \t<strong><em>Good Outline Help</em></strong><strong></strong>  </p>  <p>  \t<em>\"I like the way all the information was kept generic. He called characters by their functions (like Protagonist, Emotion, Reason). This allowed me to think in terms of my characters without any biasing or coloring of characters he may have used. </em><em>With a few tweaks, I actually think this plot will help me with an adventure novel I'm writing. </em><em>If Michael comes up with another outline for another genre, I will sign up. Thanks Michael.\"</em><strong></strong>  </p>  <p>  \t<strong><em>Excellent!</em></strong><strong></strong>  </p>  <p>  \t<em>\"As a fan of Agatha Christie's work and an avid watcher of crime and mystery TV shows I have always wanted to write my own little \"Whodunit\" story. But it seemed impossible.. until now! I am SO glad I found this course, it really makes everything easy. I had no idea you can actually learn step by step how to write such a novel. Great job! Thank you very much.\"</em><strong></strong>  </p>    <p>  \t<strong>Here's What's Standing Between You and Writing Your Novel.</strong><strong></strong>  </p>  <p>  \t<strong>If you want to write a novel, then you need to read every word of this exciting introduction, because it could change your life.</strong><strong></strong>  </p>    <p>  \t                    Dear Friend,  </p>  <p>  \t                    There comes a time in every fiction writer's life when he has to stand up and say, “enough is enough.\" And that's the day when you decide to change your life for the better by committing to write the novel that's been burning a hole in your head.  </p>  <p>  \t                    I know what it's like. Before I finished my first manuscript, I spent a lot of time just thinking about it. I purchased a lot of books on writing, outlining, characters, fiction, and nonfiction techniques. I even started blogging to try and quell the writer inside trying to bust out.  </p>  <p>  \t                  The problem was, I really wasn't serious about starting a novel. Oh sure, all the writer manuals and guides stacking up on my bookshelf and hard drive made it look like I was serious. All the charges on my Visa bill made me look pretty serious. But I never took any serious action.  </p>  <p>  \t                    I dabbled. I did things like jot down notes on story ideas, read more books in the mystery genre, and laid out a timeline as to when I would finish the novel. And I even got my home office all set up to write the next bestseller. Yet I never got serious enough about it to actual sit down and start writing.  </p>  <p>  \t                    But then something happened that rocked me to my very core. And maybe you can relate to this…  </p>  <p>  \t                    One day it seemed like everything was fine. I was working with a great job and healthy family. Then suddenly, without any warning whatsoever, my father in law passed away from a heart attack.  </p>  <p>  \t                    I can't even begin to tell you how his death shocked me. It really was the proverbial wake up call. Because suddenly I realized I had to start living, or I was going to find myself twenty years later having not accomplished my goal of writing a novel. My father in law had the same goal, and at 51 years old, he ran out of time.  </p>  <p>  \t                    You can bet I got serious really quick. I stopped messing around. I stopped dabbling, and started working out a detailed plan to get the knowledge required to write the book.  </p>  <p>  \t                    It wasn't always easy. I quickly found out the learning curve is steep when you're trying to write a novel through trial and error. I made a lot of mistakes and wasted a lot of time.  </p>  <p>  \t                    But I did it. In just six years I went from knowing absolutely nothing about writing to having a completed my bachelor's degree in English, having a blog that ranks at the top of its niche, and several manuscripts worthy of self-publication.  </p>  <p>  \t                    So believe me when I say I know what it's like to want to write that novel. It wasn't very long ago that I was struggling with how to structure a novel. But once I discovered the secret of the outline, nothing could stop me. And now you too can learn these same secrets, without all the trial and error.  </p>  <p>  \t<strong>Announcing Outlining Your Novel: The Hollywood Secret Exposed!</strong>  </p>  <p>  \t                    Forget about how to structure the plot. Don't worry about characters and subplot. Because once you know the outline secrets inside this exciting course, you'll never again have to deal with how to structure your book.  </p>  <p>  \t                  Why? Because this course is a detailed, step-by-step, chapter by chapter, no-fluff story arch that will show you exactly how to put that novel idea swirling around your head, to use. Just imagine:  </p>  <p>  \t<strong>· No more studying about plot!</strong>  </p>  <p>  \t<strong>· No more studying about how to structure the novel!</strong>  </p>  <p>  \t<strong>· And never again will you have to deal with coming up with enough information to fill an entire full length book! </strong>  </p>  <p>  \t                  Go ahead, imagine how you'll feel when you finally get that idea down into a comprehensive novel outline. Just imagine your completed story, ready for the rough draft. And just think of what your friends, family, and colleagues will say once they see you accomplishing your dream!  </p>  <p>  \t                    You can bet you'll feel the same way as Ashley Erickson, who now has the ambition and drive to get her story on paper. Here her story in her own words:  </p>  <p>  \t<strong><em>“I've wanted to write a novel for years and with this course, I'm excited to give it a try!\"</em></strong>  </p>  <p>  \t                    Or maybe you'll feel like Chris Schwab, who is a beginner with a dream of writing. Take a look:  </p>  <p>  \t<strong><em>“For me being a beginner that is writing on the side with no writing degrees, Michael does a fantastic job guiding you through the outline process. The program course is easy to follow and well structured. Michael is a true professional and I would recommend his course to any writer of all levels.\"</em></strong>  </p>  <p>  \t                    Look, you could be the next success story. You could be just like Ashley Erickson and Chris Schwab. Because…  </p>  <p>  \t<strong>In as little as 2 weeks, you too could have a comprehensive novel outline ready for your first draft!</strong><strong></strong>  </p>  <p>  \t                    Best of all, you don't need much to start the course. All you have to do is click the “Take this Course\" button to the right, and in just moments you'll discover:  </p>  <p>  \t                    · At last, you'll finally discover outlining a novel isn't difficult at all! Need to get a snap shot of the course? Then see page lecture 3, \"The Purpose Of This Course\" for the simple course instructions that will blow your mind!  </p>  <p>  \t                    · Short on time? Then you'll love that this course is work at your own pace!  </p>  <p>  \t                    · How to create tension tips in nearly every lecture – you won't find these secrets anywhere else!  </p>  <p>  \t                    · What some literary agents WANT you to understand about outlining a novel!  </p>  <p>  \t                    · A surprising trick for slowing down time in a book – no extra study required!  </p>  <p>  \t                    · Outlining mistakes and how to avoid them!  </p>  <p>  \t                    · A simple little way to create the characters you need required for each novel – you won't believe how well this archetypal character trait guide works!  </p>  <p>  \t                    · The little-known strategy for changing point of view to increase tension – this one works so well you'll think it's magic! And so much more!  </p>  <p>  \t                    By the time you watch the final lecture of this exciting outline course, you'll have a comprehensive novel outline – and at last, you'll finally have everything you need to finally complete your first draft with little effort!  </p>  <p>  \t                    Listen, if you're looking for some rehashed theory or a pile of fairy dust, this isn't it. But if you're ready to roll up your sleeves and find a surefire way to complete your mystery novel outline, then this is the last course you'll ever need to get it done!  </p>  <p>  \t                    But wait, it gets even better. Because…  </p>  <p>  \t<strong>Order Now and You'll Also Get My One on One Help!</strong><strong></strong>  </p>  <p>  \t                    Tired of purchasing a course only to have it not meet your expectations?  </p>  <p>  \t                    Looking for another perspective from a writer who's been there?  </p>  <p>  \t                    Then my one on one help is exactly what you need to nail down your mystery idea so that you can start working on your outline! In fact, it's the easiest way I know to get started on the right track – and that says a lot, because I've tried almost every method out there!  </p>  <p>  \t<strong>Here's a sneak peek at what you get:</strong>  </p>  <p>  \t                    · You'll get my one on one feedback to your current story idea before you start the course!  </p>  <p>  \t                    · Get hung up in a particular area as you're working through the course, that's what I'm here for! Ask for my help. It's free and I've helped literally hundreds of people with their story outlines. So let me ask you…  </p>  <p>  \t<strong>What is having a Comprehensive Novel Outline Worth to You?</strong><strong></strong>  </p>  <p>  \t                    If you're like a lot of people, you've already spent hundreds of dollars on writing books and novel software. But none of those gave you the results you wanted. And that's because they were all missing one crucial ingredient…  </p>  <p>  \t                    Hundreds of hours of study time!  </p>  <p>  \t                    That's what makes this course different. For the first time ever, you'll finally be able to get your comprehensive novel outline completed without all the study time required to get it done right, and that's a promise.  </p>  <p>  \t                  That's right – your own mystery novel idea, solved.  </p>  <p>  \t                    You know this is an absolute steal, so click “Take This Course\" and start now.  </p>  <p>  \t                    And just to ease your mind…  </p>  <p>  \t<strong>You Get A 100% Guarantee You'll Finish With A Comprehensive Novel Outline – Or You'll Get Your Money Back!</strong><strong></strong>  </p>  <p>  \t                    Look, you don't even have to say “yes\" today. All you have to say is “maybe.\" Because when you order now, Udemy automatically extends to you their 30 day iron-clad, no-questions-asked, money-back guarantee.  </p>  <p>  \t                    If this course doesn't deliver a comprehensive whodunit novel outline, or if you're unsatisfied for ANY reason, simply cancel your purchase within 30 days and Udemy will refund every penny.  </p>  <p>  \t                    Fair enough?  </p>  <p>  \t                    Then there's just one thing left for you to do.  </p>  <p>  \t<strong>Take advantage of this Hollywood Secret and Outline Your Novel!</strong><strong></strong>  </p>  <p>  \t                    Your next step is easy – take out your credit card and click the order link above. And do it now, because this price can change at any time!  </p>  <p>  \t<strong>        P.S.</strong> All you have to do is come with a basic story idea and some creativity, and this course will take care of everything else. So make that decision right now, and then click “Take This Course\" to change your life!  </p>        <strong></strong>", 
    "end_date": null, 
    "title": "Fiction Writing: A Complete Novel Outline Chapter by Chapter", 
    "price": "20.00", 
    "instructors": "Mike Dickson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/73776_7dc0_5.jpg", 
    "course_url": "https://www.udemy.com/outline-your-whodunit-mystery-novel/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-05T00:17:58Z"
}