{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Know the feeling where you think to yourself that your ideas are much more creative and interesting than the once we see today on TV or Movie Theaters? But how come our genius ideas aren&#039;t exposed to the world like those boring once do? How come we type our ideas in a screenplay format and still don&#039;t make it through!? What is it they know that we don&#039;t?... Find out in this magical course that will make your dream into a reality by achieving your goals and surprising the world with your appearance and your ideas!  </p>  <p style=\"\">  \t<strong style=\"\">The benefits you get from this course are:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Writing high quality, valuable, creative and million dollar movie scripts.</li>  \t<li style=\"\">Understanding the film industry better and know what their needs are.</li>  \t<li style=\"\">Get contact information of the best Talent Agency Companies in Hollywood.</li>  \t<li style=\"\">Get access to all contact information of famous celebrities and successful film directors.</li>  \t<li style=\"\">Know what your exact position is in a film project.</li>  \t<li style=\"\">Know how to build your own cast and crew.</li>  \t<li style=\"\">Know where to send your script after completing it.</li>  \t<li style=\"\">Discover the best way to save your script on storage.</li>  \t<li style=\"\">Prevent your script from being stolen. </li>  \t<li style=\"\">Learn Copyrighting.</li>  \t<li style=\"\">Get my best secret advices for success.</li>  </ul>  <p style=\"\">  \t<strong style=\"\"><span id=\"439e96c1-f92f-48b7-bd2d-98f1b2c5c046\" class=\"GINGER_SOFTWARE_mark\" style=\"\">Joze</span> Mont:</strong> Media Director at Joze Mont Entertainment and International Education Project &quot;Sattva&quot;. Film Director who has written, produced and directed over 8 movies and released 2 music albums. <span id=\"5eb177e3-8ad3-43bd-b95a-fccf98f63da8\" class=\"GINGER_SOFTWARE_mark\" style=\"\">Joze</span> Mont is also the creator of &quot;Cinemont&quot; - The new generation of legendary films that will be remembered for centuries on by leaving a remarkable sign of creative existence.  </p>  <p style=\"\">  \t   .........................................................................................................  </p>  <p style=\"\">  \t    The course I’m about to present today is very useful and important to those who truly want to succeed in the film industry.  </p>  <p style=\"\">  \t       It isn’t something I’ve made up out of boredom, it is all the secrets of proven success facts and methods from personal experience of the greatest Artists in the film industry, including my own experience. It is very valuable information that isn’t being told anywhere because of the competition and jealousy of those who are succeeding or are willing to succeed.  </p>  <p style=\"\">  \t       From this program you’ll get a special opportunity of learning the exact steps on how to write a successful and top rated movie script, how to break into the field, whom to send your script to, and how to shock the audience with your surprising film ideas!  </p>  <p style=\"\">  \t       This course will help you interest the producers in investing and working on your movie project just by reading the first 5 pages of your script. This program will help you be the magician in the cinema world from your <span id=\"7475ebd1-95d4-4ade-b2e4-fa54060c656f\" class=\"GINGER_SOFTWARE_mark\" style=\"\">wild imaginative</span> ideas and great skills of writing. And the most fun thing about it is that it will only take you <em style=\"\">7 days</em> to become a professional! You&#039;ll get the point immediately your way of thinking will change completely, you will get to a higher level and will make the impossible become possible.  </p>  <p style=\"\">  \t       But before taking the course I am giving you the opportunity to watch my recorded online webinar for <strong style=\"\">FREE! </strong>  </p>", 
    "end_date": null, 
    "title": "Film Story Pro", 
    "price": "50.00", 
    "instructors": "Joze Mont", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/99992_57f2_10.jpg", 
    "course_url": "https://www.udemy.com/screenplay-expert/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-01T14:28:17Z"
}