{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Final Draft is the premier software for drafting scripts and screenplays in the entertainment industry. This course will demonstrate and teach the elements of the software. Students will become familiar with tips and tools that will ease the script creation process.&nbsp;<br style=\"\">  </p>  <p style=\"\"><strong style=\"\">Industry Expert</strong></p>   <p style=\"\"><strong style=\"\">Alejandro Seri</strong> is an award-winning, bilingual screenwriter and director.&nbsp;&nbsp; While a nineteen year old UCLA college student and screenplay writer he approached studio executive David Garcia with the idea of starting an alternative film school.&nbsp; With the help of ten additional students, they formed Cyberpix Film School in downtown Los Angeles. </p>    <p style=\"\">Alejandro later shot his first feature film starring the late Francesco Quinn (The Shield, 24, Platoon). The film was very well received winning awards at the NY Independent Film Festival, the Romanian-American Film Festival and the Lake Tahoe International Film Festival. </p>    <p style=\"\">After apprenticing as a trailer/poster copywriter at the renowned Intralink Film, Alejandro went on to work as a television promo and film trailer copywriter at New Films International.&nbsp; He then served as a story analyst with Script P.I.M.P. (Pipeline Into Motion Pictures) development services before returning to writing and directing his own feature screenplays.&nbsp; Alejandro wrote the award-winning screenplay, GRAIN and is represented by Mike De Trana of Anvil Entertainment.&nbsp;&nbsp; Prospect Park, producers of WILFRED and CRAZY HEART, recently wrapped production on Alejandro&#039;s script, FiNAL GIRL. </p>    <p style=\"\">Alejandro joined Final Draft, Inc., maker of the world&#039;s number one professional scriptwriting software, in 2007 as the Marketing &amp; Communications Director for both Final Draft, Inc. and Script magazine.&nbsp; He has served as Final Draft, Inc.&#039;s Director of Educational Relations &amp; Marketing since 2011.&nbsp; Alejandro teaches screenwriting and Final Draft tech classes online, in universities and at conferences and festivals. </p>  &lt;/h1&gt;", 
    "end_date": null, 
    "title": "Final Draft Course: The #1 Screenwriting Software in World", 
    "price": "40.00", 
    "instructors": "Faith in Dreams Edutainment", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/72504_bdbf_9.jpg", 
    "course_url": "https://www.udemy.com/final-draft-course-the-1-screenwriting-software-in-world/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-01T05:26:35Z"
}