{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wanted to write a book but <strong style=\"\">never had time</strong>? Maybe it never felt like the right moment in your life that you were ready to \"put pen to paper\" or maybe you never had the <strong style=\"\">proper motivation</strong>. </p><p>Whatever the reason is, <strong style=\"\">THE TIME IS NOW!</strong></p><p>You are <strong style=\"\">STILL</strong> reading this course summary (<em style=\"\">this very line of text</em>) because you are intrigued at the thought of <strong style=\"\">finishing</strong> and <strong style=\"\">publishing </strong>your own book. <strong style=\"\">KEEP READING!</strong></p><p><strong style=\"\"> With this course you only need ONE thing; an idea</strong>. That's it. I don't care if that sounds corny or cliche, it's the truth. Take you idea with you to every lecture and get ready. Once you have an idea for your book, I guarantee you will have the strategies to finish before you ever lose motivation again. We are going to capitalize on the momentum we create and I am going to push you until you finish your book! </p><p>*As a <strong style=\"\">bonus </strong>I am going to show you exactly how to take your book <strong style=\"\">straight to the Kindle marketplace</strong> and get you situated for publication. </p><p>This course is about one thing. <strong style=\"\">Finishing your book</strong>. Is it possible to finish in less than 48 hours? You bet. I did and it was wonderful. But do you HAVE to spend the next 48 hours straight writing away at your desk? NO! </p><p><strong style=\"\">My strategy to writing quickly is just like the course, we dive right in and we get to work! If you can't handle that then this is the wrong course for you.</strong></p><p>I <strong style=\"\">published my own book in 2014 </strong>called<em style=\"\"> \"Picky eating into adulthood\" </em>and I loved every second of it. But I can't stress enough that my entire reasoning for finishing the book was because of my secrets that I unlocked. <strong style=\"\">YES, I sat down for 48 hours (less) and wrote my book</strong>. I finished with the extra time and I figured out how to handle everything else that goes into publishing on the Kindle market. </p><p>I waste no time in telling you <strong style=\"\">what these secrets are</strong> and I sure as heck don't want to waste your TIME with any fluff or hand holding. I want you to take this course for what it is. <strong style=\"\">If you follow along and actually trust the process and what I am telling you, you will have a finished book in faster than you know it. Guaranteed.</strong></p><p>I am very excited to read what you write! So what are you waiting for? The time is now.</p><p>See you in the lectures!</p><p>Happy writing,</p><p><strong style=\"\">Jeremy Alexander</strong></p>", 
    "end_date": null, 
    "title": "Finish and publish any KINDLE book YOU want to write!", 
    "price": "20.00", 
    "instructors": "Jeremy Alexander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564800_0a38_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-write-your-kindle-book-in-less-than-48-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T02:08:07Z"
}