{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tLATEST UPDATES:  </p>  <p>  \tJanuary 7th, 2015 - new download link for Sigil  </p>  <p>  \tNovember 26th, 2014 - bonus marketing lecture  </p>  <hr>  <p>  \t       Join over 600 successful students on this easy-to-understand course that will get you up and running on Kindle quickly and painlessly. Michelle is available for help and support every step of the way. Why struggle on your own?  </p>  <hr>  <p>  \t              If you have read any eBooks yourself you have probably come across a few that don&#039;t have a table of contents or - worse - have one that doesn&#039;t work.  </p>  <p>  \t              As a reader it is irritating.  </p>  <p>  \t              As an author, it&#039;s the mark of an amateur. Take a look on Amazon and you&#039;ll come across reviews complaining about poorly formatted Kindle eBooks, with reviewers often noting the lack of a working table of contents.  </p>  <p>  \t              Yet it is so easy to do.  </p>  <p>  \t              One way is to buy expensive Kindle creation software - often very expensive, often tricky to use.  </p>  <p>  \t              Another is to pay for your formatting to be done by someone else. Great if you have the money but not if you don&#039;t!  </p>  <p>  \t              Doing it yourself means that you&#039;ll be able to update your book when you need to, without having to pay a formatter again.  </p>  <p>  \t              In this course I walk you through Sigil, an open-source (i.e. free) program that is available for both Mac and Windows.  </p>  <hr>  <strong>FAQ</strong>  <p>  \t           WHAT IS THE COURSE ABOUT?  </p>  <p>  \t<strong></strong>Learning how to format eBooks using Sigil&#039;s free software. Sigil is available for both Windows and Mac computers.  </p>  <p>  \t           HOW IS THE COURSE TAUGHT?  </p>  <p>  \t<strong></strong>Video lessons with some downloadable documents and the ability to ask specific questions and receive help from the instructor.  </p>  <p>  \t           HOW WILL I LEARN?  </p>  <p>  \t<strong></strong>By watching, trying it out for yourself, and asking questions. At the end of the course you will be able to format your own eBook using Sigil and know how to upload it to Amazon&#039;s Kindle Direct Publishing.  </p>  <p>  \t           WHAT ARE THE COURSE MATERIALS?  </p>  <ol>  \t<li>Video lectures which can be watched online or saved for offline viewing via the Udemy app.</li>  \t<li>Downloadable stylesheets.</li>  </ol>  <p>  \t           HOW LONG WILL IT TAKE ME TO COMPLETE THE COURSE?  </p>  <p>  \t             Around an hour. Many authors complain that they spend a long time working out how to format their eBook then get it published and go write another one. A few months later, they try to remember how to format it and have generally forgotten! Not an issue with this course - you have lifetime access and can return to it every time you&#039;re ready to publish.  </p>  <p>  \t           HOW WILL I BENEFIT FROM TAKING THIS COURSE?  </p>  <p>  \t<strong></strong>You&#039;ll be able to produce a very professional, beautifully formatted eBook and upload it to Amazon, the world&#039;s best seller of books. You will be paid royalties monthly. The more professional your eBook is, the more likely you are to get good reviews and better royalties.  </p>  <p>  \t             If you have forgotten how to format it next time you have a book ready to publish, you can come back to this course to go through it again.  </p>  <p>  \t           HOW AVAILABLE IS THE INSTRUCTOR?<strong><br>  \t</strong>  </p>  <p>  \t<strong></strong>I&#039;m here to give you support on your publishing journey. Once you have joined the course you will be able to ask questions and I&#039;ll answer those as quickly as possible - generally as soon as I get the notification from Udemy. I also assemble the most frequently-asked questions into extra lectures and/or downloadable resources.  </p>  <p>  \t    WHY IS THE COURSE SO INEXPENSIVE?  </p>  <p>  \t    Honestly? I&#039;m guessing that if you&#039;re a new author you probably don&#039;t have a huge pot of money to chuck at your publishing venture. You&#039;re probably wise enough to not want to take a big financial risk. It&#039;s a great idea to try self-publishing out before investing too much in it. You want to see if you&#039;ve chosen a good niche, if there&#039;s a strong market for your books, before splashing your hard-earned cash at it.  </p>  <p>  \t    You can buy expensive Adobe and other software for formatting eBooks. I don&#039;t know why you would but maybe I&#039;m just cheap! If you&#039;re using - or want to use - open-source software such as Sigil, I congratulate you. It&#039;s a great choice. I&#039;ve matched the price of this course to appeal to people like you - and me - who don&#039;t like being ripped off.  </p>  <p>  \t    My other courses are more expensive because they took longer to create and contain more lectures and downloads. This is a short course. It will only take you an hour or so to complete.  I&#039;m not going to charge you hundreds of dollars for something you can  complete in an hour.  </p>  <p>  \t    I&#039;m hoping that you will enjoy my teaching style and join some of my other courses or even read some of my books (free using Kindle Unlimited). I offer coupons to existing students who want to join my other courses, just contact me to request one.  </p>  <p>  \t    Enjoy your publishing journey. It has changed my life - I have a good income from my books. I hope it improves yours and brings you wealth and happiniess.  </p>  <p>  \t    Michelle :)  </p>", 
    "end_date": null, 
    "title": "Format for Kindle the RIGHT way!", 
    "price": "20.00", 
    "instructors": "Michelle Campbell-Scott", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/125654_703f_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-an-ebook-using-open-source-software/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-26T15:33:26Z"
}