{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    You wrote a book, now you can format it for Kindle to read well and function properly. Save time while making updates whenever you want.</p>  <p>  \t                        Microsoft Word documents (.doc and .docx) can <strong>easily be formatted</strong> for Amazon Kindle or saved as HTML Web Page Filtered. Amazon designed its self-publishing system to receive MS Word because it's the world's most popular writing program.  </p>  <p>  \t<strong>                          Most authors pay for this,</strong> but it's wise to do it yourself. When you format your own documents:  </p>  <ul>  \t<li>you save time &amp; money</li>  \t<li>you can make changes whenever you want</li>  \t<li>you can be creative with your books</li>  \t<li>you make the reader's experience better</li>  </ul>  <p>  \t                        This course walks you through each section from the Title page to the Table of Contents to the About the Author page, saving as HTML and more. Inserting images, hyperlinks, everything a reader expects. Get detailed instruction with an actual MS Word document and uploading it to Amazon's Preview Mode, something you'll be doing soon.  </p>  <p>  \t                          The course is 17 easy-to-follow videos from 2 to 5 minutes in length. It's taught by Jason Matthews, bestselling author and self-publishing instructor for thousands of writers.</p>  <p>  \t                        In just over an hour, you'll be able to <strong>give readers something they really enjoy</strong>.  </p>  <p>  \t          <em>Get started today and sell more books soon.</em></p>", 
    "end_date": null, 
    "title": "Format MS Word for Amazon Kindle, Get Beautiful Ebooks", 
    "price": "25.00", 
    "instructors": "Jason Matthews", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277388_73e4_5.jpg", 
    "course_url": "https://www.udemy.com/formatting-ms-word-for-amazon-kindle/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-08T18:44:39Z"
}