{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Want to create great teaching, presentation, and product demo videos but don&#039;t want to pay for expensive software?&nbsp; This course will show you <strong style=\"\">how to use freely available tools to create dynamic High-definition videos</strong> that can be easily published to your favorite online video sharing website or any online learning environment (like Udemy for instance!).</p><p style=\"\">Whether you are an online instructor, software developer, IT professional or just want to create great HD presentation videos, this course will walk you through all the basics of setup, design, screen and application recording, advanced effects options, and publishing.</p><p style=\"\">You&#039;ll learn how to use a <strong style=\"\">powerful, free screen recording application</strong> along with PowerPoint (optional) to create HD videos of you teaching, presenting, or walking clients through product demos.&nbsp; You&#039;ll also learn <strong style=\"\">advanced techniques</strong> that allow you to use PowerPoint as a platform for <strong style=\"\">adding dynamic effects, animations, and title slides</strong> to your HD screencapture videos.</p><p style=\"\"><strong style=\"\">EVERY VIDEO</strong> in this course was created using the tools and techniques that you will learn how to use in this course.&nbsp; Test drive a few of the free video tutorials below to see these tools in action.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "FREE Tools for Creating Dynamic HD Video Presentations", 
    "price": "20.00", 
    "instructors": "Brannon Carter", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/41959_67ae_3.jpg", 
    "course_url": "https://www.udemy.com/free-tools-for-creating-dynamic-hd-video-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-16T12:45:44Z"
}