{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  For all those amateur and aspiring writers, journos and bloggers who belong to the brotherhood without banners of journalism<strong style=\"\">, here’s a workshop tailored specifically for freelance writing in India</strong>.  </p>  <p style=\"\">  \t  Take this course to learn the nuances of freelance journalism.  </p>  <p style=\"\">  \t  This workshop will cover how to be a freelance writer and pitch to magazines/newspapers/websites. You will learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to craft a pitch letter/email,</li>  \t<li style=\"\">The do’s and don’ts of freelance writing</li>  \t<li style=\"\">The best way to get an editor’s attention and get published.</li>  </ul>  <p style=\"\">  \t  About the Faculty:  </p>  <p style=\"\">  \t  Besides being incredibly passionate about what they do, all of our three teachers have first hand witnessed the low quality of writing available in India&#039;s freelance circuit, they see this as an opportunity to better the resource pool and contribute to the development of quality Indian new media writers.  </p>  <ul style=\"\">  \t<li style=\"\">Nayantara Kilachand: Nayantara is the founder of <a href=\"http://www.mumbaiboss.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">www.mumbaiboss.com</a>. She has worked and studied in New York, Chicago and Hong Kong, and written for Mint, Time magazine, The Wall Street Journal, The Guardian and Wallpaper, among several other publications and websites. <br style=\"\">  \t</li>  \t<li style=\"\">Amit Gurbaxani: Amit is a senior editor with <a href=\"http://www.mumbaiboss.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">www.mumbaiboss.com</a>. He has been writing extensively about music for over a decade, for publications such as Time Out Mumbai, where he edited the music section in addition to being the deputy editor. His after-office life is an endless series of gigs across the city.<br style=\"\">  \t</li>  \t<li style=\"\">Deepanjana Pal: Deepanjana is Books Editor at DNA and a regular columnist for Mumbai Boss, Sunday Guardian and ForbesLife. She is the author of The Painter: A Life of Ravi Varma, and has freelanced extensively for a variety of publications including Wallpaper*, Caravan, Business Standard, Mint Lounge and Tehelka. In the past, she has worked with Time Out Mumbai and ELLE.</li>  </ul>", 
    "end_date": null, 
    "title": "Freelance Journalism in 90 minutes", 
    "price": "20.00", 
    "instructors": "Noesis369 Learning", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/56596_4c2e_7.jpg", 
    "course_url": "https://www.udemy.com/freelance-journalism/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-27T07:41:11Z"
}