{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>85 Prozent aller Bücher finden heute in gedruckter Form zum Leser – und selbst 2020 werden es noch drei Viertel sein. Es gibt also trotz des Siegeszugs des eBooks <strong>Millionen Gründe, ein Buch auf richtigem Papier zu veröffentlichen</strong>. Dieser Kurs erklärt Ihnen alles, was Sie dazu wissen müssen – mit Hilfe von Programmen, die Sie schon kennen und auf dem Computer haben.</p><p>Selfpublishing von Taschenbüchern scheint auf den ersten Blick komplizierter als der Verkauf von eBooks. Sie brauchen eine <strong>professionell formatierte Datei</strong>, den passenden Druck-Anbieter, aber auch ganz andere Vermarktungs-Strategien. Unser Kurs lässt Sie bei all dem nicht allein. Sie erfahren:</p><ul><li>Warum Sie Ihr Buch auch in gedruckter Form veröffentlichen sollten</li><li>Welche Strukturen den Buchhandel bestimmen</li><li>Wie Sie die gravierendsten Fehler vermeiden</li></ul><p><br></p><p>Danach geht es an die Arbeit: Gemeinsam formatieren wir ein Manuskript in Word bzw. LibreOffice Writer so, dass daraus ein <strong>perfektes Buch entsteht</strong>, das vom Leser nicht von einem Verlagstitel zu unterscheiden ist. Die gratis mitgelieferte Mustervorlage können Sie in Zukunft bei all Ihren Projekten einsetzen.</p><p>Mit dem druckfertigen PDF geht es dann zum Drucker. <strong>Welcher Anbieter ist für Sie optimal</strong> – CreateSpace, BoD, ePubli, Tredition, oder doch eher Auflagendruck? Wie funktioniert der Upload ganz konkret? Jeden Schritt führen wir Ihnen am Bildschirm vor, sodass Sie parallel mitarbeiten können.</p><p>Schließlich ist Ihr Buch gedruckt – aber noch lange nicht beim Leser. Wie überzeugen Sie den Buchhandel? Welche Vermarktungs-Strategien lohnen sich? Welche Fallstricke sind zu überwinden? </p><p>Wenn Sie alle Lektionen des Kurses hintereinander durcharbeiten, werden Sie etwa ein Wochenende brauchen. Praktisch begleitet Sie der Kurs durch den <strong>kompletten Veröffentlichungs-Prozess</strong>. Unter einer Voraussetzung: Dass Sie jetzt auf \"Diesen Kurs buchen\" klicken. </p>", 
    "end_date": null, 
    "title": "Gedruckte Bücher verkaufen: Vom Manuskript in den Buchhandel", 
    "price": "50.00", 
    "instructors": "Matthias Matting, Johann-Christian Hanke", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620050_ab64.jpg", 
    "course_url": "https://www.udemy.com/gedruckte-buecher-verkaufen/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T06:17:51Z"
}