{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                This course is completely updated for 2016, and is guaranteed to give you results once implemented</p>  <p>  \t<strong><strong>I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.</strong></strong>  </p>  <p>  \t<strong><strong></strong></strong>----------------------------------------------------------------------------------------------------------------</p><p>  \t                Would you like to know how to create high quality promotional or explainer videos in just minutes ?  </p>  <p>  \t<strong>    Did you know that sales page containing a compelling video have been proven to increase conversions up to 125% ?  </strong>  </p>  <p>  \t              Check my promo video for an example of what I'm talking about !  </p>  <p>  \t                If you or your business are missing videos as a marketing medium, then you are leaving money on the table -guaranteed.  </p>  <p>  \t                In this course, I will teach and demonstrate everything you need to know about promo video creation, starting from scratch, and<strong> </strong><strong><strong>at absolutely no cost.</strong></strong>  </p><p>In this course, you will learn (by applying) to:</p><p>1) Quickly create engaging and visually pleasing sales videos, using free resources</p><p>2) Apply best pratcices that will ensure your video converts visitors into buyers.</p><p>3) What to do with these videos: where to place them, how to get them ranked in Youtube.</p><p>4) &amp; much more...</p><p>Flawlessly rated an average of five starts, this course is giving thousands of students incredible information that translates to real-life results for them and their businesses.</p>  <p>  \t<strong><strong></strong></strong><strong>As a bonus, I will also show you how you can make good money selling your videos to business owners.</strong>  </p>  <p>  \t<strong></strong>Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed. I want you to succeed, or your money back!</p>  <p>  \t                Yes, my course comes with a 30 days « no questions asked » money back guarantee. You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  </p>  <p>  \t                You can get started right after you have taken my course -That meansTODAY!  </p>  <p>  \t                Click the \"Take This Course\" button now. That's your first step to skyrocketing your conversions through the magic of videoproducing. Every minute that goes by without action is one minute you'll never get back.  </p>  <p>  \t                Cheers!  </p>  <p>  \t                Howard  </p>", 
    "end_date": null, 
    "title": "Get A Sales Video That CONVERTS In One Hour Or Less!", 
    "price": "50.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/402120_d037_5.jpg", 
    "course_url": "https://www.udemy.com/make-promo-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-23T12:11:33Z"
}