{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Do you have a book in you and don’t know how to put your thoughts on paper?  </p>  <p>  \t    Do you have a book in you dying to come out but you have been procrastinating?  </p>  <p>  \t    Do you have a book in you and did like the servant in Matthew 25 who took the one talent and hid it under the earth? Perhaps you hid it under the mattress, drawer, and the like.  </p>  <p>  \t    Do you lead a busy lifestyle and can’t seem to find the time to sit down and write?<br style=\"\">  \t<br style=\"\">  \t    If you answered yes to any of the above questions, then you've come to the WRITE course!  </p>  <p>  \t<span>Get Your Write on Kingdom Style will:</span>  </p>  <ul style=\"\">  \t<li><span>supply aspiring writers with the essential tools to write and publish their book</span></li>  \t<li><span>catapult them into a realm of obedience to their writing assignment. </span><span> </span></li>  \t<li><span>motivate you to be about your Father's business and get that manuscript in book form and published.</span></li>  </ul>  <p>  \t    Each section of the course is broken down into eight chapter titles from 'Kingdom Style of Writing: Mastering the Art of Writing from a God Perspective' written by me, Author Kimberly Jackson.  </p>  <p>  \t    I have incorporated over 17 years of writing and publishing experience into my book and online course. People are always asking me how to write a book and get it published. While others find it very difficult to commit to their God-given assignment and come up all kinds of excuses for not getting that book written. Well, here it is! I am here to help you. And help jump start your writing career!  </p>  <p>  \t<span>God says,</span>  </p>  <p>  \t    \"The struggle of writing is over. Get excited. Get writing!<br style=\"\">  \t    No more putting your book on the back burner.\" <br style=\"\">  \t    People are waiting for what God has placed in you to impact lives!<br style=\"\">  \t<br style=\"\">  \t    Now is the time to get that book out of you!  </p>", 
    "end_date": null, 
    "title": "Get Your 'Write' On Kingdom Style", 
    "price": "50.00", 
    "instructors": "Kimberly Jackson", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308706_48cc_2.jpg", 
    "course_url": "https://www.udemy.com/get-your-write-on-kingdom-style/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T23:14:44Z"
}