{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>LATEST NEWS</strong>:<strong> </strong></p>\n\n<p>UPDATES:</p>\n\n<ul><li>Lecture 2.2 updated April 2016</li><li>Course update lecture added March 2016</li></ul>\n\n<p>Polls have now been removed from Goodreads (apart from within groups). It also looks like authors can't add their own books to Lists (Listopia) but we are waiting for confirmation from Goodreads about this. </p>\n\n\n\n\n\n\n\n\n\n<p>Please note that the Goodreads dashboard now looks a little different to that shown in the lectures but the content is the same. See the update lecture for details.</p>\n\n\n\n\n\n<p>We would be very grateful if you could let us know of any big differences on Goodreads. They are changing/improving it all the time and you may come across things we haven't seen if we haven't published a book ourselves for a few months!<br></p>\n\n\n\n\n\n\n\n\n\n<p>================================== </p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Do you want to discover a free, effective way to market your book right now?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Do you want to learn and implement the tactic that CNN attributed as the secret to the success of EL James' <em>Fifty Shades of Grey</em>?</li><li>Do you want <strong></strong>your book to be seen (and reviewed) by influencers? </li><li>Do you want to be found on the very same site that Amazon is suggesting its customers connect to share ideas and opinions on books?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p>Because, if you're not using Goodreads to market your books and connect with readers, then you are missing out on what we think is the most valuable place an author can spend time online. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why is Goodreads so special?</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Goodreads users are the most active book buyers you can find – totally up to one half of the frequent book buyers in the UK – which might be why Amazon bought out the site in 2013!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Publishers use Goodreads to launch books and now you – the indie author – can do it to. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>So, what's the deal on Goodreads?</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Goodreads has an incredible <strong>25 million</strong> users as of Autumn 2015. And those 25 million users are <strong>influencers</strong>. People who have the ability to spread the word about your book through their own blogs and networks. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Goodreads is not just about readers, it's about influencers. Goodreads users aren't interested in collecting free books they never read – they are real readers, book buyers, serious reviewers, <strong>bloggers </strong><strong>(over one-fifth of users are book bloggers!)</strong>, and journalists. Readers who want to buy -- and to talk about and review -- your book.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Reviews on Goodreads have so much more credibility than reviews on Amazon – and they can be tougher – which is why you don't want to dive in unschooled in how to use the site. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>We want to show you exactly how to use Goodreads to build your credibility as an author. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>CNN News credited Goodreads as being one of the main reasons that the <em>Fifty Shades of Grey series </em>got to the level of popularity that it did. The author was there and she was (and still is) active. The first book didn't take off until she joined Goodreads. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>And we show you -- step by step -- how you can lever the power of Goodreads to help you promote your books right now. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>We don't want this to take more time out of your day. We are all busy. As\nauthors, we want to write, or do the other things in our business or personal\nlife. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So we have designed this course to give you a schedule that can be done in <strong>ten\nminutes a day</strong>. And it's ten minutes that you can take away from other\nsocial networking or marketing activities. We want you to get better results\nwithout doing more - and without wasting time. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Why do you need us?</strong> </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Well, if you've tried to navigate around Goodreads you'll know that it's not\nthe easiest place to find your way around. Lots of the features are hidden and\nsome of them are even a little confusing (and some are <strong><em>more </em></strong>than\na little confusing!). </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>But we have researched and experimented with the platform for you. We know\nour way around and we will show you all of the tips and trick as well as the\nacceptable (and unacceptable) behaviour that could take you months to learn.\nFor the cost of a good book, let Goodreads expert Michelle Campbell-Scott and author strategist Cathy Presland walk you through everything you need to know\nabout how to promote your book on Goodreads. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>If you do nothing else to promote your book, we want you to learn how to use our favourite strategy to get reviews and attention for your book. </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Marketing a book is a long game. Sure, you can use Amazon to get a 'bestseller' ranking. But for sustained success you need sustained book sales.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>And that's what Goodreads can help you with.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>This could well be the best investment you will ever make in your book\nmarketing! </em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus, you will be part of a community of authors who support and encourage\neach other and share the latest tips and advice about things that are working\nfor them.</p>", 
    "end_date": null, 
    "title": "Goodreads For Authors", 
    "price": "30.00", 
    "instructors": "Cathy Presland, Michelle Campbell-Scott", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47851_cba9_18.jpg", 
    "course_url": "https://www.udemy.com/goodreads-for-authors-book-promotion-and-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-29T16:29:26Z"
}