{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Kindle authors can make a LOT more sales when they learn how to use Goodreads - a social networking site of over 12 million readers.<br style=\"\"><br style=\"\">The problem is, when you go onto Goodreads on your own, it can be <em style=\"\">very</em> overwhelming. Many people have created accounts and then left for good -- overcome by tons of options, with no idea what to do next.</p><p style=\"\">This course is designed to help you hone in on exactly what you need - the top 7 ways to use Goodreads to <strong style=\"\">make more book sales</strong>.</p><p style=\"\">As a book author, you&#039;ll want to know as many ways as possible to get more book sales. And Goodreads has a LOT of eager readers who would love to read your book. You just need to know how to find them.<br style=\"\"></p><p style=\"\">This course gives you each of the top 7 methods, along with instructional videos, and then a daily/weekly/monthly checklist to ensure you have a STRUCTURE with which to do everything.</p><p style=\"\">To be clear... this is NOT designed to give you a comprehensive overview of Goodreads. It is not a Goodreads &quot;Bible&quot;. <br style=\"\"><br style=\"\"><strong style=\"\">It&#039;s specifically designed for <em style=\"\">new</em> Goodreads users to cut out all the &quot;noise&quot; and give you the most impactful methods to make more book sales.</strong><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Goodreads secrets: How Kindle authors can sell more books", 
    "price": "20.00", 
    "instructors": "Rachel Rofe", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53642_5fea_5.jpg", 
    "course_url": "https://www.udemy.com/goodreads/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-13T00:53:01Z"
}