{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><em><strong>*** LATEST: March <em>2016</em> - Course Updated ***</strong></em><strong></strong></em></p><p><em><strong>\"This tutor is clearly very experienced in teaching. He is interesting, engaging and breaks down each step in bite size pieces. He is also exceptional in responding to questions fully and swiftly on the discussion board. This is always a plus.</strong><strong>\" - </strong>by Jennifer Poyser-Blaize</em></p><p><strong>***** ***** ***** ***** ***** ***** ***** ***** </strong><br></p><p>Green Screen video production - you'd like to try it, but it you don't want buy a studio full of video equipment.<br></p><p>What if I showed how you can save time and money so you can make videos that are more engaging and help your message to reach a wider audience?</p><p>By learning green screen video production in this unique training course you'll learn to make videos with Camtasia Studio quickly and on a budget!<br></p><p>The production techniques in this course save me hours in preparation and $100's in equipment I don't need. I've developed shortcuts in pre-production, production and post-production... and I will teach you my secrets in this easy-to-follow course.</p><p><em><em><em><em><strong><strong>***** ***** ***** ***** ***** ***** ***** ***** </strong></strong></em></em></em></em></p><p><em><em><em><em><strong>\"Your course made me aware of aspects of video </strong></em></em></em></em><em><em><em><em><strong>production I had no idea existed. I found the quality of each lecture outstanding\" </strong></em></em></em></em><em>- by Marilyn Martyn</em><br></p><p><strong>***** ***** ***** ***** ***** ***** ***** ***** </strong><br></p><p>In this course:</p><ol><li>you'll learn why a green screen needs to be a single color <strong>using a unique teaching technique I developed myself </strong>to illustrate why some colors become transparent while others don't</li><li>I'll show you <strong>advanced editing techniques </strong>you can use to save you hours and $100's instead of reshooting!</li><li>I'll reveal my favorite <strong>mobile application that saves me $100's</strong> in equipment I don't need and hours of guesswork in the studio</li><li>discover how to use animation software you already own to<strong> give your videos that professional look</strong></li><li>my outdoors video shows you that <strong>you don't even need a green screen </strong>or studio lighting to make a great marketing video</li><li>you'll learn that <strong>you don't have to waste hours</strong> trying to get perfect lighting</li><li>you'll also learn <strong>how to fix the 3 most common lighting issues</strong> when shooting in a green screen studio</li></ol><p>Working as a systems analyst, I've taken complex systems and then simplified them so that both technical AND non-technical people can understand them ... and that's what I've done with Green Screen Video Production using Camtasia Studio in this course.</p><p><em><em><strong>---------------------------------------------------------------------------</strong></em></em><br></p><strong></strong><p>In these training videos, I'll show you <strong>simple green screen video editing <span></span>techniques</strong> you can use to enhance your teaching and promo videos using Camtasia Studio's green screen software functionality.<br></p><p><strong>***** ***** ***** ***** ***** ***** ***** *****</strong></p><p><em><em><em><strong>\"Practical and to the point\" </strong></em></em></em><em><em><em>- by </em><em>Gehad Wadi</em></em></em></p><p><em><em><em><em><em></em></em><strong>***** ***** ***** ***** ***** ***** ***** *****</strong></em></em></em></p><p>Whether you want:<br></p><ul><li><strong>better backgrounds</strong> for your promo videos, or;</li><li>you want to <strong>enhance your students’ learning experience</strong> in your teaching videos, or;</li><li>you simply want to <strong>improve your professional image</strong> with an expensive-looking backdrop </li></ul><p>this green screen video training course is for you!</p><p>By the end of this training you’ll be in control of your\nvideo making!  <br></p><p>I love making videos. I get amazing results and I want to show you how to take your business to the next level using green screen videos with Camtasia Studio!<br></p><p><strong>***** ***** ***** ***** ***** ***** ***** *****</strong><br></p><p><em><strong>\"I have thoroughly enjoyed and learnt the useful technique. Thanks\" </strong></em><em>- by Khurshid Md Anwar</em></p><p><strong>***** ***** ***** ***** ***** ***** ***** *****</strong><br></p><p><em></em><strong>Important information before you enroll:</strong><em></em></p><ul><li>In case you find the course doesn't give you any value, don't forget you're covered by Udemy's<strong> 30 day money back guarantee, full refund, no questions asked!</strong></li><li>Once enrolled, you'll always have <strong>unlimited, lifetime access to the course!</strong></li><li>You also get <strong>free access to all updates </strong>as I add them to the course.</li><li>I'll give you <strong>my full support</strong> if you need further assistance.</li><li>Before taking any course on Udemy you should watch the lectures that have the <strong>Preview </strong>button switched on to get a feel for how good the production quality of the lectures are and if that course is right for you. This is <strong>especially important in courses that teach Video Production.</strong></li></ul><p><em><em><strong>---------------------------------------------------------------------------</strong></em></em><strong></strong></p><p>Take control now - press the \"Take This Course\" button now and start making your awesome green screen video today.<br></p><p>PS - you don't need to buy any new equipment to get started :)<br></p>", 
    "end_date": null, 
    "title": "Green Screen Video For Complete Beginners", 
    "price": "30.00", 
    "instructors": "Natch Soker", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653250_3a3f_7.jpg", 
    "course_url": "https://www.udemy.com/green-screen/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T09:45:39Z"
}