{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What are the Benefits for You?</strong><br></p><ul><li>Make your Youtube Channel more Professional</li><li>Get more Views, Subscribers and Engagement</li><li>Leave the bottom 95% (Very few people actually brand their Youtube Channel)</li></ul><p><strong>Why take this Course?</strong><br></p><p>Learn the best ways to Brand your Youtube Channel to increase your Subscriber Rate, Views and Engagement. I will teach you how to Brand both your Channel and your Videos professionally. I truly believe that \"Branding is Essential\", and that you should spend time to create your unique brand on Youtube.</p><p>Branding is not rocket science. It is actually quite easy. Branding is about creating a consistent look, feel and experience for your viewers. Even so, most people don't take the time to develop their brand strategy on Youtube. If you do, you will stand out!</p><p>I have tried to condense my 5 years of experience as a Youtube Publisher, into this course, so that you can get results without reading hundreds of books and articles, or producing several 100s of Youtube videos like I have.</p><p><strong>Course Overview</strong></p><p>You will learn the fundamental branding strategies you can use on Youtube and in your Videos. We will look at things like your Youtube Channel Page, your logotype, your avatar, thumbnails, in video graphics, personal branding, catch phrases etc.</p><p>Your Youtube Channel deserves a bigger reach and audience, and if you take this course, and implement your own Branding using the strategies I teach you, your chances to grow your channel increases by a mile. </p><p>Is it time to take your Youtube Channel to the next level? Well, then enroll today, I am waiting for you my Friend! =)</p><strong>What is in this Course?</strong><ul><li>About 1 Hour of condensed learning experience</li><li>Step by step instructions on all the stages needed for Branding your Youtube Channel</li><li>A dynamic and personal style of teaching</li><li>Mixed formats to create more interest for you</li></ul>", 
    "end_date": null, 
    "title": "Grow your Youtube Channel with Branding", 
    "price": "20.00", 
    "instructors": "Mikael Baggström", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614930_358f.jpg", 
    "course_url": "https://www.udemy.com/branding-for-youtube/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T15:50:45Z"
}