{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course will tackle different problems and provide solutions for those with the desire to edit projects professionally. If you are hesitant about jumping into the video editing world or feel you lack the necessary skills to delivery a great project, well this course is for you. This course centers around you completing one project that you can finish in <strong style=\"\">two to three hours</strong>. You can use any video editor, because the concepts presented are not editor specific. The  techniques are used across all editors. I will show you all the steps using <strong style=\"\">one</strong> project that will have different parts to hone your skills. I will provide you with the same clips so you can follow along. This course is divided into four sections. The first section is the basic video techniques, the second is editing the rough cut, the third is the fine edit and the last section is putting on the finishing touches. What is really cool about this course is my help and feedback as you navigate the project. If you have a question about the concepts presented please ask. I have found through my many years of teaching that when you can ask questions along the way the learning process deepens and is more effective. Once you have completed your edit you can send it to me so I can review it and provide feedback. Take this course for the following reasons:  </p>  <ol style=\"\">  \t<li>Learn industry standards editing techniques</li>  \t<li>Learn by editing a professional project (all files provided)</li>  \t<li>Complete the course in as little as two to three hours</li>  \t<li>Use any video editor</li>  \t<li>Ask questions through the helpful forum</li>  \t<li>Learn through videos</li>  \t<li>Submit your project for review and critique once finished</li>  </ol>", 
    "end_date": null, 
    "title": "Guide to Edit Professional Video Projects", 
    "price": "25.00", 
    "instructors": "Brian Southers", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/390714_1dff_2.jpg", 
    "course_url": "https://www.udemy.com/edit-video-professionally/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T21:42:57Z"
}