{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Have you always wanted to become a bestselling published author but never believed you could actually make this dream a reality? </strong></p><p>In <em>How to Become  a Bestselling Author on Amazon</em>, I'll show you how to do it! With this course you'll learn how to:</p><ul><li>Identify and cultivate an income-generating fiction or non-fiction book idea </li><li>Write higher quality content (or better stories) at a faster rate</li><li>Strategically self-publish your book on Amazon for maximum exposure</li><li>Execute the critical strategies necessary to successfully launch and market your book</li><li>Propel your book to the top 100 of multiple free bestseller lists</li><li>Boost your overall Amazon ranking for maximum marketing traction</li><li>Amplify your self-publishing residual income stream and credibility as a professional</li><li>And SO much more</li></ul><p><strong>Don't wait any longer - now is the time!</strong></p>Clients tell me all the time -<em> \"I'm just not sure I'm ready to jump into self-publishing yet! Maybe I'll do it next year when I have more experience, more time, more knowledge, etc.\"</em> I tell them - that is the completely <strong>wrong </strong>way to think! The time to self-publish your book and become an Amazon bestselling author is now! But why? Here are two MAIN reasons (Statistics from Publisher's Weekly).<ul><li><strong>Indie authors are earning nearly 40% of the eBook dollars going to authors!</strong></li><li><strong>Only 16% of the e-books on Amazon's bestseller lists are from top 5 pub houses!</strong></li></ul><p>Other rookie authors are raking in money - why aren't you taking your piece of the pie?<strong></strong></p><strong>So what's the catch?</strong><p>The catch is that you can publish books every minute of the day, but unless you're Nora Roberts or Stephen King or another famous author, your books are going to drown in the millions of other books on Amazon.</p><strong>So how does a new author gain traction, garner a following, foster a reputation as an author, and sell books? By learning how to become a bestselling author on Amazon! </strong>As a bestselling author, your ranking is automatically amplified and your sales surpass tens of thousands of the other books on Amazon! It's time for you to become the bestselling published author you've always wanted to be.<p><strong>Are you ready to make your publishing dreams a reality? It's time to say <em>YES</em></strong><em><strong>!</strong></em></p>", 
    "end_date": null, 
    "title": "How to Become a Bestselling Author on Amazon", 
    "price": "20.00", 
    "instructors": "Kaylee V. Wickline", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/507688_76b2_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-an-amazon-bestselling-author/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T01:55:23Z"
}