{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t             LATEST: Guarantee - if you struggle to format your book, I will do it for you and show you how I did it. For less than the price of paying a professional formatter to do one book for you, you can join this course and learn how to format all your books.</p>  <hr>  <p>  \t             Join over 600 authors on this course. Learn quickly, get your books in print, and your royalties could be double NEXT MONTH.  </p>  <p>  \t        I am available for advice and support every step of the way. If you get stuck, holler!  </p>  <hr>  <p>  \t<strong>Double your royalties - really?  </strong>  </p>  <p>  \t                                 I did. Well, actually, I more than doubled them. My print sales have overtaken my digital sales on some books. I was shocked - until I published this course and students reported that they were making more money - either by the presence of their print book stimulating sales of their Kindle book (because the print book looks inexpensive in comparison), or by great print sales.  </p>  <p>  \t                                 You too can make more money from your Kindle books by getting them into print via CreateSpace. A print book can increase your royalties both by making sales itself <em><strong>and</strong></em> by increasing your Kindle sales due to the cost comparison.  </p>  <p>  \t                                   Sales of eBooks have overtaken sales of paperback and hardback books combined. However, that doesn't mean that physical books don't sell anymore - they do. Amazon sell 118 eBooks for every 100 physical books. That's still a <strong>lot</strong> of physical books being sold! It depends on your genre, but many authors report that their print sales actually overtake their digital sales in December and August - holiday periods. We all seem to prefer real books on the beach and for use as gifts!  </p>  <p>  \t                                   There's a lot less competition in the physical book arena as most of the Internet Marketers stick to Kindle books. Kindle eBooks are quick and easy to publish - formatting for paperback takes a bit more time. It's <strong>well </strong>worth it, though.  </p>  <p>  \t                                   Having a paperback version of your eBook can help increase your royalties for a number of reasons.  </p>  <ul>  \t<li>More Kindle sales - Your eBook sales can increase because the cost of the      paperback is generally more, making the eBook look much better value</li>  </ul>  <ul>  \t<li>A new source of royalties - You may find that you make a good number of paperback      sales. People still like physical books. They are much better for reading      in the bath! I recently had an illness that prevented me from looking at a      screen (it hurt). It made me put away my Kindle for the first time in      months and dig out a load of paperbacks. There are lots of people who      prefer physical books, for various reasons.</li>  \t<li>Increased credibility - Fewer Indie authors take the plunge into print so you will be part of a more select group. That raises your credibility and could lead to more opportunities, such as guest blogging, interviews on podcasts, etc.</li>  </ul>  <ul>  \t<li>You need a physical book to schedule a Goodreads      Giveaway. If you haven't heard of Goodreads, you might want to check it      out, it's where passionate readers hang out. Giveaways are mini competitions that members enter to try to win free      books. Even if you can only afford to buy one paperback version of your      book, you can schedule a Giveaway and offer that. The beauty of them is      that they attract an average of 825 entries each. That's 825 people seeing      your book who may not otherwise have come across it - and all their      Goodreads friends (and possibly their Facebook) will see it in their update      feeds. That's how viral popularity starts. It worked for E.L. James with      '50 Shades of Grey'; it worked for Ally Condie with 'Matched'; it could      work for you too.</li>  </ul>  <p>  \t                                   However, many authors confess to finding the formatting of their manuscript to CreateSpace's standards to be difficult. Who has the time to spend hours learning, fiddling, tweaking, proofing, and submitting?  </p>  <p>  \t                                   This course can save you days and days of fumbling around trying to discover the best ways of formatting your manuscript yourself. It will enable you – once you have completed the course – to get a book into CreateSpace-ready format in around an hour. If you struggle at any point, I will do it for you and show you exactly what I did to get it right.</p>  <p>  \t                                   The course is packed with information, practical steps and activities, as well as tons of bonuses, such as PDF downloads and checklists to guide you along the way. It won't take you more than an hour or two to complete and the benefits will be with you forever. You can pick and mix to just study the bits you need, if you already know how to do the formatting but want to learn how to produce books that are professional enough to stand side-by-side with traditionally-published books.  </p>  <p>  \t                               The course has a full guarantee and will be accessible whenever you need to check back, in case you forget something. I will also keep it up-to-date and add new resources as time goes on.  </p>  <p>  \t                                   You are welcome to ask questions, I'll support you all I can. You can find me on Facebook, LinkedIn, and Twitter if I don't respond quickly enough on Udemy! (They don't always send out announcements about new questions.)  </p>  <p>  \t                                   NOTE: This course is currently <em><strong>mostly </strong></em>suitable for Windows users (due to the demise of my Mac!).  </p>", 
    "end_date": null, 
    "title": "How to double your royalties - get your eBook into print", 
    "price": "20.00", 
    "instructors": "Michelle Campbell-Scott", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38271_1ec5_10.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-your-book-on-createspace/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-25T21:07:14Z"
}