{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This course is for students who are keen to learn editing using Apple&#039;s Final Cut Pro X.</p><p style=\"\">The course is made up of 54 videos with a duration 5 hours and 28 minutes.</p><p style=\"\">Section 1 introduces the course.</p><p style=\"\">Section 2 contains 15 videos taking you through FCPX interface and how to make it suit your working style.  </p><p style=\"\">Section 3 takes you through creating a library, event and project. You will be shown how to sort files in preparation for importing into FCPX and shown how to use Audacity to convert MP3 files into AIF or WAV files. You will see how files are copied from an SD card to the hard drive and finally imported into FCPX.</p><p style=\"\">Section 4 takes you through the whole editing process n FCPX, using a short course promo video as an example. You will see how clips are added to the timelines, how music is added and how B-roll shots are used to illustrate what is being said in the piece-to-camera. You will see how the material is built in layers and the issues surrounding using FCPX compared to using Adobe Premiere. </p><p style=\"\">Section 5 takes you through using FCPX&#039;s animated title templates and how to add basic titles for end credits. You will be shown how to do colour correction and work with sound effects.</p><p style=\"\">Section 6 shows you how to share you finished video via YouTube and how to send projects to Compressor so you are more in control of the types of CODECs you might choose to use.</p><p style=\"\">Section 7 provides a course conclusion.</p><p style=\"\">This is an ideal course for someone wishing to learn the basics of editing using Final Cut Pro X, as uses a course promo video as an example. Students are encouraged to shoot their own material and edit in FCPX using the demonstrations as a guide.</p>", 
    "end_date": null, 
    "title": "How to edit a promo video in Apple's FCPX", 
    "price": "20.00", 
    "instructors": "George Kingsnorth", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487648_61b6.jpg", 
    "course_url": "https://www.udemy.com/how-to-edit-a-course-promo-video-in-apples-fcpx/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T16:13:32Z"
}