{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em><em><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></em></strong></p>\n\n<p>  \t  About this course:  </p>\n\n\n\n<p><strong><em>1,000+ Students Within 2 days of Hitting the Udemy Market Place</em></strong>  </p>\n\n\n\n<p>  \t<strong>33 Lectures packed full of Money Making Tips</strong>  </p>\n\n\n\n<p><strong><em>20 5-Star </em></strong><strong>Reviews from very happy students in my course</strong>  </p>\n\n\n\n<p>  \t<strong>All future extra lectures and upgrades are always included for free</strong>  </p>\n\n\n\n<p>  \t<strong>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</strong>  </p>\n\n\n\n<p>  \t<strong>Regular free surprise bonuses to increase your income even more!</strong>  </p>\n\n\n\n<p>  \t<strong>30 Day 100% Risk Free Offer! </strong>  </p>\n\n\n\n<p>  \t<strong></strong>  </p>\n\n\n\n<p>  \t<strong>------------------------------------------------------------------------------</strong>  </p>\n\n\n\n<p>  \t<strong></strong>  </p>\n\n\n\n<p>  \t<strong>Hi Banana Head,</strong>  </p>\n\n\n\n<p>  \t  Do you?  </p>\n\n\n\n<ul>  \t<li>Want to Learn how to Choice a Writing Niche that will provide Financial Freedom?</li>  \t<li>Want to Land more Freelance Writing Jobs and Earn More Money with Your Writing Gigs?</li>  \t<li>Want to Learn Where to Locate Highly Writing Gigs Online and How to Close <strong>LONGTERM</strong> Clients?</li>  \t<li><strong>Want to Ditch Your Energy Sucking 9 to 5?</strong></li>  </ul>\n\n\n\n<p>  \t<strong>I am going to show you exactly how to that in a few short minutes</strong>  </p>\n\n\n\n<p>  \t<strong></strong><strong>I bet that you are letting Money and Opportunity Slip Through your Fingers...</strong>  </p>\n\n\n\n<p>  \t   If you say yes to any of these writing style and you want to start anew without a boss and an alarm clock, you might want to consider becoming a freelance writer.  </p>\n\n\n\n<p>  \t  I will teach you how to skip the low-paying writing gigs and build a freelance writing career you can be proud of This course will teach you everything you could ever want to know about becoming a successful freelance writer.  </p>\n\n\n\n<ol>  \t<li><strong><em>Build a Solid Foundation as an Online Writer<br>  \t</em></strong></li>  \t<li><strong><em>Go Freelance Without Going Broke<br>  \t</em></strong></li>  \t<li><strong><em>Effectively Market Yourself as a Freelance Writer<br>  \t</em></strong></li>  \t<li><strong><em>Expertly Write for the Top Online Freelance Sites<br>  \t</em></strong></li>  \t<li><strong><em>Earn a Full-Time Living and Give Yourself a Pay Rise</em></strong></li>  </ol>\n\n\n\n<p>  \t  So, you've read this far! Thank you.  </p>\n\n\n\n<p>  \t  This course provides you with the tools and information necessary to have a full-time or part-time career as a freelance writer and allow you to share your talent for words with the rest of the world.  </p>\n\n\n\n<p>  \t  Learn how to charge more money and build a stellar reputation by choosing the right niches for you.  </p>\n\n\n\n<p>  \t<u><strong>Learning Objectives of This Course</strong></u>  </p>\n\n\n\n<ul>  \t<li>How to choose a style and genre of writing that is best suited to your talents and all the various types and genres of freelance writing and how to find them</li>  \t<li>The pros and cons (benefits and negatives) of a freelance writing career</li>  \t<li>How to establish your name as a freelancer and build your reputation to start your career</li>  \t<li>How to setup and maintain profiles on all the best freelance job finding websites</li>  \t<li>How to set up and stick to a budget</li>  \t<li>How to competitively priced with skill set and make sure you are getting paid what you are worth</li>  \t<li>How to establish long-term working relationships and contracts</li>  \t<li>How to fight writer's block and set realistic career goals</li>  \t<li>And Much Much Mores..........</li>  </ul>\n\n\n\n<p>  \t  Discover the secret method that all the high earning freelance writers apply to their business. Then learn how to use this method to earn more money on a regular basis, while adding incredible value to your clients. Find out exactly how much to charge clients  </p>\n\n\n\n<p>  \t<strong><em>\"I'll Show you Many Different Ways to Work As a Writer and Get Paid for Doing What You Love..\"</em></strong>  </p>\n\n\n\n<p>  \t  Of course, this includes getting paid to do it from anywhere in the world at any time of day or night on a wide variety of subjects. This could mean everything - from technical writing, poetry, short stories, search engine optimization articles, blog articles, product descriptions and everything in between.  </p>\n\n\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already have a Udemy course</strong> and have been missing out on fabulous potential earnings.  </p>\n\n\n\n<p>  \t<strong><u>SEE WHAT STUDENTS ARE SAYING...</u></strong>  </p>\n\n\n\n<p>  \t<em>Good overview on freelancing</em>  </p>\n\n\n\n<p>  \t<em>\"I have been doing freelance jobs for some years now, as a way to earn some extra cash. I took this course because I am seriously considering working full time as a freelancer. I got a lot of good ideas from the lectures and I look forward to putting them into practice. There are many good tips in this course on how to build up a successful freelancer career. I work a lot on oDesk, so the particular advice referring this site was very useful for me. I think this course is useful for anyone who is considering working as a freelancer, it gives an accurate overview on what to expect and the steps you need to do in order to achieve success.\"</em> <strong>Lisa Court</strong>  </p>\n\n\n\n<p>  \t<em><strong>\"</strong>Explains this line of work : the pros, the cons and the grey area\"</em>  </p>\n\n\n\n<p>  \t<em>\"I found this course essential to my daily work. The fact that as a college student, at times a wrench is tossed in our path, necessary life adjustments take in effect. Writing is a powerful skill to have, as long as it is good writing. This course introduces the student to an alternative non self-deprecating form of y income that can work around student schedules and can serve as that extra change needed when living from paycheck to paycheck. The curriculum commences by diving into the world of freelancing. It explains the pros and cons of this type of job or gig. Most places just will tell you “how great it is” and leave you to experience the cons which can be a migraine at times. Knowing the odds and ends always helps with making a well informed decision. This prepares you with the business aspect, the foundation. Many people have ideas and need that setoff wings to fly. This serves as the fine tuning and the extra push to start. I was very glad to see that the author took it a couple steps further. Instead of script form, [he] included personal experience, which humanizes the course, thus creating a passive mood where, students can say “Ok, I have been there!” or “I can relate to what he is saying.” I find, personally, that with examples that apply to real time or can be related to, tend to enhance the learning. Rather than listen and take notes to look over at a later time, it calls upon every single student to ponder on how it applies and forces an internal self-analysis. This leads to strategizing and implementing changes and goals in motion. There is so much information conveyed in this course and presented in a manner that anyone can comprehend. I enjoyed it and hope others do, because it is a true gem. Other explanations are one sided, while this one tells it how it is.\" </em><strong>Mrs C Mills</strong>  </p>\n\n\n\n<p>  \t<strong><u><br>  \t</u></strong>  </p>\n\n\n\n<p>  \t  Everything you need to know to be your own boss and succeed in freelance writing, including:  </p>\n\n\n\n<p> </p>\n\n<li>What you will need to succeed in the business</li> <li>How to start earning income immediately</li> <li>Best ways to take advantage of broker websites</li> <li>How to work directly with clients, including finding jobs and greatly increasing your earnings</li> <li>The principles of earning the highest-paying work </li> <li>Answers to some of the most frequently asked questions</li> <li>The author’s favorite resources</li> \n\n<p>  \t<br>  </p>\n\n\n\n<p>  \t<strong>Remember:</strong>  </p>\n\n\n\n<p>  \t<strong> If You're Not Earning What You Want To As A Freelancer? Learn How To Make A Lot More Money With A Lot Less Work... Invest in My Course Today!!!!</strong>  </p>\n\n\n\n<p>  \t<strong><em>30 Day 100% Risk Free Offer! </em></strong>  </p>\n\n\n\n<p>  \t  PSS: <strong>Do you really want to be a writer? </strong>Do you really want to enjoy a lifestyle that you only dream about now?  </p>\n\n\n\n<p>  \t  PSSS:It will take hard work. It will take perseverance. But if you can honestly answer “Yes” then <strong>there is no reason why you can’t start building your writing business today</strong>.  </p>\n\n\n\n<p>  \t  If I made this writing business work, then so can you! It’s been truly satisfying for me and also for many of my writer friends whom I have been able to help along the way.  </p>\n\n\n\n<p>  \t  I wish you every success with your writing and I hope that this guide will be an invaluable resource for you… I explain about a bunch of different ways that you can be paid to write.  </p>\n\n\n\n<p>  \t<em>30 Day 100% Risk Free Offer! </em><strong>It is a 100% no risk deal for you.</strong>  </p>\n\n\n\n<p>  \t<strong> As with all my courses:</strong>  </p>\n\n\n\n<ul>  \t<li><u>The initial low price will increase shortly - the course is currently <strong>$45</strong>, but will next increase to <strong>$499</strong></u></li>  \t<li>you have unlimited lifetime access at no extra costs, ever</li>  \t<li>all future additional lectures, bonuses, etc in this course are always free</li>  \t<li>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li>  \t<li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy</li>  </ul>\n\n\n\n<p>  \t<strong>What are you waiting for? Click on the \"Take this course\" now so we can start in a few minutes! :-)</strong>  </p>\n\n\n\n<p>  \t<em>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now! </em>  </p>", 
    "end_date": null, 
    "title": "How to Begin and Sustain a Career as a Freelance Writer", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/267144_99e5_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-begin-and-sustain-a-career-as-a-freelance-writer/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-23T05:58:47Z"
}