{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Deb Reeves and Scott Higby, veteran audio producer/engineers, created this course at the request of voice over actors, podcasters, and internet radio producers in our California recording studio.</p><p>We discovered that many voice talents are being held back by not being able to send a professional recording to their clients. And while they are great at their craft, they just are wired differently than the gear-head engineers. So we're including just enough techy info to get you good at what you need to do. No more, we promise. But you WILL come out of this class being very comfortable with recording and editing, using the awesome GarageBand software that is already on your Mac, iPad, or other Apple product.</p><p>GarageBand is pre-installed software that will give you professional results, if you know how to use it. That's what we'll be showing you, in a friendly, fun, easy paced way. And we are going to skip over ALL the music production tools that will just get in the way. Though we DO show you how to use the powerful music and sound effects library to create a truly great sounding project.</p><p>This course covers GarageBand in a very easy, step by step manner. We take you through all the confusing \"preferences\" parts of the setup. We take a tour of the entire GarageBand screen, and show you what EVERY button does. And you'll see how easy it is.</p><p>You will be able to get better results than most of the people out there. And when you can create professional audio, you will get noticed!</p><p>By the way, we've priced this class so that it's a no-brainer. We really want the world to sound good! We look forward to working with you.</p><p>Cheers,</p><p>Deb and Scott</p>", 
    "end_date": null, 
    "title": "How I set up and use GarageBand the super easy way!", 
    "price": "40.00", 
    "instructors": "Scott Higby, Deborah Reeves", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741706_180e.jpg", 
    "course_url": "https://www.udemy.com/how-i-set-up-and-use-garageband-the-super-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-26T01:51:20Z"
}