{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Know the hidden secrets of how to easily create and run a hugely successful Newsletter.</strong></p><p>Come with me on a journey as you learn exactly how to get more repeat business, more referrals, have endless amount of new prospects, customers, clients or patients seeking you out!<br></p><p><strong><em>Create A Newsletter Your Prospects Cannot Wait To Open Their Email As Soon As It Comes!</em></strong><strong><em></em></strong><br></p><p>Charge more for your products, services and events than your competition! <strong><strong></strong></strong></p><p><strong><em>Exactly how to get more repeat business, more referrals, have endless amount of new prospects, customers, clients or patients seeking you out - On Autopilot!</em></strong></p><p>You will have a proven time tested and PROVEN blueprint formula you can use immediately.</p><p><strong><em>Put you in front of your prospects, customers, clients, and patients.  Hardly ANYONE does this…which  will put you at a tremendous advantage over your competitors who don’t have a clue about newsletters.</em></strong></p><p>Learn at your own pace using a personal computer, laptop, or mobile phone and internet to access the materials.<br></p><p><strong>I leave nothing out - I reveal all my secrets</strong> ... and as I test even more things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow. </p><p><strong><em>Create A Newsletter Your Prospects Cannot Wait To Open Their Email As Soon As It Comes!</em></strong><strong><em></em></strong><br></p><p>This course is forever yours with life time access any time you wish.</p><p>Materials included are step by step video and text summary for every lecture.</p>", 
    "end_date": null, 
    "title": "How I Generate Sales Weekly On Auto Pilot Using Newsletters", 
    "price": "20.00", 
    "instructors": "Instructor Biography Rick Ostler Ostler", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477260_39d1_2.jpg", 
    "course_url": "https://www.udemy.com/how-i-generate-sales-wkly-on-auto-pilot-no-paid-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T16:43:35Z"
}