{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<h5 style=\"\"><strong style=\"\">Learn How To Become a #1 Amazon Bestselling Author By Publishing Your Book On Kindle</strong></h5>  <p style=\"\">  \t<em style=\"\">    Who else wants to know... How To Become a #1 Amazon Bestselling Author By Publishing Your Book On Kindle?  </em>  </p>  <ul style=\"\">  \t<li style=\"\">Do you have a #1 Best Seller in you?</li>  \t<li style=\"\">Would you love to get your book out into the world and make passive income? </li>  </ul>  <p style=\"\">  \t  There are countless benefits to being a #1 Best Selling Author - from receiving regular cash flow to your bank account, to getting paid for speaking gigs and consulting, the opportunities are endless for bestselling authors…  </p>  <p style=\"\">  \t          This course is designed to help you write, publish and market your books on Kindle and become a bestselling author on Amazon in as little as one month.  </p>  <h5 style=\"\"><strong style=\"\">This Course Will Teach You Everything You Need To Know To Become a Bestselling Author:</strong></h5>  <ul style=\"\">  \t<li style=\"\">The Four-Step System for How To Write Your Book In 28 Days and Overcome Writer&#039;s Block For Good!</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How I Got Over 22,372 Free Downloads of My Ebook Using Amazon&#039;s KDP Select Free Promotion</li>  </ul>  <ul style=\"\">  \t<li style=\"\">The Marketing Strategies I Used To Earn Over $12,174 In Kindle Royalties In a Single Month</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Save Thousands of Dollars on Cover Designs, Professional Editing, Formatting and Publishing Your Kindle Books</li>  </ul>  <ul style=\"\">  \t<li style=\"\">...and much more!</li>  </ul>  <h5 style=\"\"><strong style=\"\">Who Else Wants To Become a Bestselling Author?</strong></h5>  <p style=\"\">  \t          Here&#039;s a picture of me next to Robert Kiyosaki on the Top #100 Business &amp; Investing Authors on Amazon Kindle. I had no idea when I first read <em style=\"\">Rich Dad Poor Dad</em> at age 19 that I would soon be on the bestsellers list next to my mentor!  </p>  <h5 style=\"\">Do You Want To Be The Next #1 Bestselling Author on Amazon?</h5>  <p style=\"\">  \t          Your Complete Kindle Publishing Course includes 8+ hours of easy-to-follow video instructions, including detailed tutorials on the following topics:  </p>  <p style=\"\">  \t          This easy-to-use course, highly effective training...  </p>  <ul style=\"\">  \t<li style=\"\">Completely Destroys writers block forever</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Unleashes your full potential as an author</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Removes all the confusion about publishing on kindle and makes it easy, fast and FUN to implement</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Turns you from an amateur author into a pro overnight</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Gets your sales in 30 days or less</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Takes your book from as little as 10 sales to 10,000 sales</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Getting Started (Module 1)</strong></h5>  <ul style=\"\">  \t<li style=\"\">Why Readers Are Buying 130+ Ebooks for Every 100 Physical Books - and How You Can Profit From This Massive Ebook Growth Trend</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Do Market Research Before You Write Your Book So That You&#039;re Virtually Guaranteed To Make You a Profit From Your Ebooks!</li>  </ul>  <ul style=\"\">  \t<li style=\"\">The Rules To Abide By To Make Sure Amazon Will Always Sell Your Ebooks In Their Store Without Having Your Book Removed For Violating a Simple Rule You Didn&#039;t Know About</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in The Ultimate Writing Guide (Module 2)</strong></h5>  <ul style=\"\">  \t<li style=\"\">The Four-Step System for How To Write Your Book In 28 Days</li>  </ul>  <ul style=\"\">  \t<li style=\"\">3 Easy Solutions for Overcoming Writer&#039;s Block Once and For All</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Write a Book That Readers Want to Buy (so you get paid every day, even in your sleep)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Find a Professional Editor To Perfect Your Manuscript For Less Than $250</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Cover Design Mastery (Module 3)</strong></h5>  <ul style=\"\">  \t<li style=\"\">How To Get Your <em style=\"\">Book Cover Designed By a Professional</em> for less than $50 (so your cover looks amazing and gets more sales)</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Formatting for Kindle (Module 4)</strong></h5>  <ul style=\"\">  \t<li style=\"\">The 15-Minute System for Formatting Your Books for Kindle - for FREE - (and avoid paying someone hundreds of dollars unnecessarily)</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Publishing on Kindle (Module 5)</strong></h5>  <ul style=\"\">  \t<li style=\"\">The Super Simple 10-Minute System For Publishing Your Ebooks on Amazon Kindle</li>  </ul>  <ul style=\"\">  \t<li style=\"\">The Kindle Pricing Strategy That Will Help You Become a Bestselling Author Twice as Fast</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Everything You Need To Know About Marketing Books (Module 6)</strong></h5>  <ul style=\"\">  \t<li style=\"\">How To Get Reviews From Top 1000 Amazon Reviewers So That You Get Detailed, Helpful Book Reviews From the Influencers In Your Genre or Niche</li>  </ul>  <ul style=\"\">  \t<li style=\"\">Learn Kindle Marketing Best Practices From Several #1 Bestselling Authors Who Know How To Sell Thousands of Books Every Single Month</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Price Your Kindle Ebook to Maximize Your Royalties and Income (This System for Price Testing Ebooks Has Helped Me More Than Double My Kindle Royalties)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Make Money From Your Book Beyond Just Book Sales - Including Affiliate Marketing, Sponsorships, Lead Generation, Paid Speaking Gigs, and Much More!</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How I Got Over 22,372 Free Downloads of My Ebook Using Amazon&#039;s KDP Select Free Promotion</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Turn Your KDP Select Free Promotion Into <em style=\"\">Hundreds or Thousands of Sales In One Week </em>Following Your Book Launch</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Become a Bestselling Author on The Amazon Kindle Bestsellers Lists So That You&#039;ll Always Be Known as a Bestselling Author</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Choose The Right Book Categories To Maximize Sales and Attract Thousands of Avid Readers Every Month To Your Book Page</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Choose The Right Keywords for Your Ebook to Maximize Sales (So That Readers Find Your Book Instead of the Competition)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Choose a Bestselling Title That Will Increase Your Sales Dramatically</li>  </ul>  <ul style=\"\">  \t<li style=\"\">A Proven System for Building a Full-Time Income as a Kindle Ebook Author (That&#039;s Worked for Me and Dozens of My Publishing Clients and Students)</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Market Your Book For The Long Term To Maximize Your Lifetime Income (So That You Can Retire Early On Your Ebook Royalties and Be Completely Financially Secure)</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Financial Management for Authors (Module 7)</strong></h5>  <ul style=\"\">  \t<li style=\"\">How To Reduce Your Expenses By 80%%%% or More as a Self-Published Author So That You Can Keep More of Your Cash</li>  </ul>  <ul style=\"\">  \t<li style=\"\">How To Protect Yourself From Financial Disasters That Can Strike Authors Who Don&#039;t Understand These Fundamentals of Financial Protection for Authors</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Bonus Videos and Interviews (Module 8)</strong></h5>  <ul style=\"\">  \t<li style=\"\">The Strategies, Ideas and Habits These #1 Bestselling Authors Who Have Collectively Sold Millions of Books Use to Earn a Full-Time Income as Authors</li>  </ul>  <h5 style=\"\"><strong style=\"\">Here&#039;s What You&#039;ll Learn in Affiliate Marketing Mastery (Module 9)</strong></h5>  <ul style=\"\">  \t<li style=\"\">How To Earn an Extra few Hundred or Even a Thousand Dollars a Month With Affiliate Marketing</li>  </ul>  <h5 style=\"\"><strong style=\"\">Are You Ready To Become a Bestselling Author Right Now?</strong></h5>  <p style=\"\">  \t          Sign Up For The Complete Kindle Publishing Course Today To Get Started!  </p>  <p style=\"\">  \t          Most students find it takes about 30 days to complete the course and become a bestseller on Amazon. It might take a little longer if you&#039;re a brand new author and still working on completing your first book than it would if you&#039;ve already published books on Kindle and are just looking for help in the marketing and sales department.  </p>  <h5 style=\"\"><strong style=\"\">Get Hands On Training From a #1 Bestselling Author Who Walks The Talk and Earns a Full-Time Income from Ebook Royalties Alone</strong></h5>  <p style=\"\">  \t<em style=\"\">&quot;I will personally be available to answer all your questions that come up while you progress through the course and on your journey to becoming a bestselling author!&quot;</em> - Tom Corson-Knowles  </p>  <h5 style=\"\"><strong style=\"\">It&#039;s Time To Make a Choice About Your Career as an Author...</strong></h5>  <p style=\"\">  \t          Of the two roads before you, the one on the left is the road you’ve been traveling already… it’s rough, uphill, rocky, and full of pain, struggle and rejection as an author.  </p>  <p style=\"\">  \t          On the right, there is the road less traveled. It’s been smoothed by the skilled hands of numerous bestselling authors who have come before you, and it&#039;s proven to be the easiest way to becoming a bestselling author!  </p>  <p style=\"\">  \t          Choose the right road.  </p>  <p style=\"\">  \t      Let’s walk that road together.  </p>  <p style=\"\">  \t          To your success,  </p>  <p style=\"\">  \t          Tom Corson-Knowles  </p>  <p style=\"\">  \t<strong style=\"\">P.S. Just scroll up and click &quot;Take This Course&quot; now to start on your journey to becoming a bestselling author.</strong>  </p>", 
    "end_date": null, 
    "title": "How To Become a Bestselling Author on Amazon Kindle", 
    "price": "30.00", 
    "instructors": "Tom Corson-Knowles", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46912_ef9e_4.jpg", 
    "course_url": "https://www.udemy.com/kindle-publishing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-22T03:44:34Z"
}