{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In this “Green  Screen Tutorial: How  to Make a Killer Green Screen Videos” course you&#039;ll learn everything  about green screening. For a budget of around &lt;$500 you can produce an  unlimited amount of high quality green screen videos. </p><p>This is a 20 part course on how to shoot, edit, and produce  professional looking green screen videos. This course covers all the basics of  green screening and it even goes in depth to cover a range of topics to help  beginners perfect their videos. </p><p>In this green  screen tutorial course, you will learn the exact steps to take in order  to set up your green screen, lighting, camera and tripod, including the  positioning of everything. You will learn how to turn your laptop into a  teleprompter and how to have a great presence on camera. </p><p>Once you have setup everything, we&#039;ll go over the basics of  shooting our first video, and then we will actually shoot a video on the green  screen. </p><p>Shooting green screen video isn&#039;t all that hard once you get  the hang of it, so that is why this course doesn&#039;t just stop there. A large  portion of this course focuses on taking the actual video that we shot and  editing it in iMovie. We&#039;ll go over removing the green screen background,  making your own custom backgrounds, adding in pictures and b-roll, editing audio  and much more. </p><p>To wrap the course up, we&#039;ll go over tips/tricks and  do&#039;s/don&#039;ts that I have personally picked up or learned from trial and error  from doing over 700 green screen videos.</p><p>                        </p><p>Take this course now and discover how to make a green screen for your  business.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "How to Make Killer Green Screen Videos", 
    "price": "30.00", 
    "instructors": "Giancarlo Massaro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/11777_10f8_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-green-screen-videos-on-a-budget/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-12T06:26:23Z"
}