{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><p style=\"\"><strong style=\"\">Create professional  looking book covers in minutes WITHOUT hiring a graphic designer! Detailed  instructions and templates included with this course! Perfect for any level of  Photoshop user!</strong></p>    <p style=\"\">Hiring a graphic designer to create your Kindle ebook covers  can be expensive! And doing it on your own may be more difficult than it  appears! This course will walk you step-by-step through the process of <strong style=\"\">designing your own</strong> professional looking  Kindle book covers.</p>    <p style=\"\">What makes this Ebook covers design tutorial course different is that it will <strong style=\"\">NOT</strong> teach you how to make a cover from  scratch! That&#039;s the boring stuff! Instead, the initial set-up is <strong style=\"\">already done for you</strong> leaving you to the  fun stuff like adding images, editing text and changing colors!</p>    <p style=\"\"><strong style=\"\">Included Templates</strong></p>    <p style=\"\">This Ebook  covers design tutorial course <strong style=\"\">includes  six Photoshop cover templates</strong> based on actual covers from Amazon and  designed to be easy to customize. These templates are built with Photoshop  Actions which are stored right inside the Photoshop interface. You’ll never  have to search your hard drive to find a blank cover template because they&#039;ll  always be available right inside Photoshop. <strong style=\"\">Complete instructions are included</strong> for installing the Actions.  Don’t worry if you’ve never heard of Photoshop Actions before. They are really  easy to use!</p>    <p style=\"\">Templates are <strong style=\"\">built  at 1674 x 2500 pixels</strong> (6x9 cover size) and are ideal for higher resolution  Kindle devices.</p>    <p style=\"\"><strong style=\"\">Detailed Video  Tutorials</strong></p>    <p style=\"\">Each template includes its own video tutorial. These  tutorials explain in detail how to get the most out of each template. With over  2 hours of content, there are many helpful suggestions and instructions on how  to achieve different looks. You&#039;ll also learn a lot of Photoshop skills after  taking this Ebook covers  design tutorial course!</p>    <p style=\"\"><strong style=\"\">Template Features</strong></p>    <p style=\"\"><ul style=\"\"><li style=\"\"><span style=\"\">Professional Looking</span><br style=\"\"></li><li style=\"\"><span style=\"\">Time Saving</span><br style=\"\"></li><li style=\"\"><span style=\"\">Built-in Backgrounds</span><br style=\"\"></li><li style=\"\"><span style=\"\">Built-in Banners</span><br style=\"\"></li><li style=\"\"><span style=\"\">Text Built in Place</span><br style=\"\"></li><li style=\"\"><span style=\"\">Completely Customizable</span><br style=\"\"></li><li style=\"\"><span style=\"\">Easy to Make Changes</span><br style=\"\"></li><li style=\"\"><span style=\"\">Special Effects</span><br style=\"\"></li></ul></p>                                <p style=\"\"><strong style=\"\">Bonus Utility  Included</strong></p>    <p style=\"\">Students of this course will also receive a bonus Cover Sizer  image utility that will easily re-size completed covers to optimal resolutions  for embedding on webpages and social networks. This image utility will also  work with pictures from a digital camera reducing them in size for emailing.</p>    <p style=\"\"><strong style=\"\">About The Instructor</strong></p>    <p style=\"\">This Ebook  covers design tutorial course is taught by Harlan Yee, an independent  publisher, internet business developer and motion graphic designer. Harlan has  over 20 years experience in television broadcast and video production. You can  follow his latest projects including website development, digital product  creation and online marketing at FreelanceDoodle.com .</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "How to Create Bestselling Kindle Ebook Covers - Series 1", 
    "price": "20.00", 
    "instructors": "Walkabout Media", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43031_e547_4.jpg", 
    "course_url": "https://www.udemy.com/kindlecoverfactorycreator1/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-22T22:25:34Z"
}