{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            Cooking videos are extremely popular on YouTube. If you search, you&#039;ll find hundreds of thousands. Unfortunately, most don&#039;t look very good. Some are even painful to watch...  </p>  <p>  \t            Don&#039;t think that you have to have thousands of dollars in professional equipment to produce decent quality cooking videos or a crew of people to help you. It&#039;s possible to produce quality cooking videos all by yourself as long as you understand what really matters when it comes to making them. Believe me. I&#039;ve been producing 1 video a week for over 2 years now and have over 16,000 subscribers. My audience thinks I have a film background, but I don&#039;t!  </p>  <p>  \t     Let me let you in on a little secret: it&#039;s not all about your equipment! You can have have the best equipment, but if you don&#039;t understand the fundamentals to making great cooking videos, you still won&#039;t produce great work.  </p>  <p>  \t            Although lots of people will watch cooking videos with less than stellar quality, they actually do appreciate it when you take the time to learn what it takes (and implement it of course) to improve your production quality. Well, unless your personality is so amazing that they just want to hear you tell stories and jokes!  </p>  <p>  \t     Production quality doesn&#039;t just mean that your video is pretty. It also means that your video is a superb teaching tool. There are many small details that matter when someone is preparing a dish. Make sure they can see them!  </p>  <p>  \t<strong>What&#039;s Included</strong>  </p>  <p>  \t            The course is divided into 5 main sections and is composed primarily of video. Each video explains key concepts and shows you what they look like. There are also a few cheat sheets, templates and several lists of resources for reference.  </p>  <ol>  \t<li>Ingredients for an amazing cooking video</li>  \t<li>Tools of the Trade</li>  \t<li>Making Time</li>  \t<li>Pre-Production</li>  \t<li>Recording Audio Separately</li>  </ol>  <p>  \t<strong>Who is This Course for?</strong>  </p>  <p>  \t           This course is for anyone who currently makes cooking videos on YouTube and for anyone who has been thinking about it for some time.  </p>  <p>  \t           If you currently have a YouTube channel and want to take your cooking videos to the next level, this course is for you. You&#039;ll learn key concepts that will help you see your production process differently and what you need to focus on to improve your videos.  </p>  <p>  \t           If you are thinking about making cooking videos and haven&#039;t yet gotten started, this is the perfect course for you. You&#039;ll get an idea of what&#039;s involved and find out what not only what equipment you&#039;ll need, but also key concepts that will make your first video look like it&#039;s not.  </p>  <p>  \t<strong>What&#039;s Not Included</strong>  </p>  <p>  \t           This course does not teach you how to edit your cooking videos. That information is in a separate course, &quot;How to Edit Professional Looking Cooking Videos in an Hour or Less.&quot;  </p>  <p>  \t       I do briefly discuss how my pre-production process makes editing a breeze!  </p>", 
    "end_date": null, 
    "title": "How to Make Professional Looking Cooking Videos", 
    "price": "30.00", 
    "instructors": "Michelle Johnson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83596_e442_9.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-cooking-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-25T16:45:23Z"
}