{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   With over 3,000,000 books published in the U.S every year it&#039;s easy for your book to get lost in the crowd.  </p>  <p style=\"\">  \t   Today, a book trailer is necessary for marketing your book.  </p>  <p style=\"\">  \t   This course will teach you how to make a professional book trailer .  </p>  <p style=\"\">  \t   Getting a book trailer produced professionally can costs hundreds of dollars.  </p>  <p style=\"\">  \t   I will walk you through everything you will need to produce your own professional looking book trailer. And best of all you can save hundreds of dollars by doing it yourself.  </p>  <p style=\"\">  \t   We will go over the entire process.  </p>  <p style=\"\">  \t   We will use Windows Live Movie Maker to make our trailer.  </p>  <p style=\"\">  \t   Follow along as we use live video capture to instruct you on how to use Audacity and WLMM.  </p>  <p style=\"\">  \t   By the end of the course you will have the tools to make a professional book trailer and other video productions.  </p>  <p style=\"\">  \t   You will leave the course with a new skill that you can use to make videos.  </p>  <p style=\"\">  \t   If you are ready to learn a new skill,save money and have some fun let&#039;s get started. Sign up for the course now.  </p>  <p style=\"\">  \t   Included in the supplemental materials section of the lesson you will find:  </p>  <ul style=\"\">  \t<li style=\"\">A zipped file of <strong style=\"\">70 royalty free music clips</strong> you can use for whatever you want.</li>  \t<li style=\"\">PDFs of sources of royalty free photos and images.</li>  \t<li style=\"\">PDFs of sources of royalty free music.</li>  \t<li style=\"\">PDFs of sources of royalty free video clips.</li>  \t<li style=\"\">An Audacity manual as a downloadable PDF</li>  \t<li style=\"\">PDF of video submission sites.</li>  \t<li style=\"\">PDF of authors&#039; sites.</li>  \t<li style=\"\">PDF of video software tools.</li>  </ul>", 
    "end_date": null, 
    "title": "How To Make a Book Trailer", 
    "price": "20.00", 
    "instructors": "Linda Tremer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/152834_0740_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-book-trailer/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-25T23:26:13Z"
}