{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>You can now join 200+ digital publishers in this course showing you step by step how to publish a magazine on the Apple iOS Newsstand.</strong>  </p>  <p>  \t Great changes are happening in the digital publishing world. People are changing their reading habits; they are consuming information in different ways and when it comes to magazines, readers want the latest issues delivered instantly to their digital devices. They also want a wider choice and realize they can access magazines from around the globe, instantly.  </p>  <p>  \t       These changes are just the beginning of a new world in publishing, content creation and distribution, and this course will ensure you are in the right place to be at the forefront with publishing to mobile devices and tablets.  </p>  <h5>Digital Publishing Made Easy</h5>  <p>  \t       This digital magazine publishing course is a one of a kind complete step by step solution for companies or individuals who want to publish their own magazines on the Apple Newsstand.  </p>  <p>  \t       This course makes it a simple process to take an existing magazine and produce a complete digital magazine that can be downloaded from the Apple iTunes Newsstand.  </p>  <p>  \t       All you need to get started is a PDF of your magazine. You can then follow the course videos to turn your PDF&#039;s into digital magazines. If you can create MS Word, MS Powerpoint, Pages or Keynote files.... you can save those as PDF files and get started right away.  </p>  <p>  \t       The creation process has been broken down into simple steps so that anyone can follow the video tutorials, download the template app and produce a magazine within in less than a day.  </p>  <p>  \t       Once you have a place to store your digital files online (Website, Amazon S3 account etc..) there is ZERO cost going forward. Everything you need is free! A stark contrast to services like PageSuite, Magcast, Mag+ and Adobe Digital Publishing Suite.  </p>  <h5>Let&#039;s answer a few Digital Magazine questions ...</h5>  <p>  \t <strong>I am not a Magazine Publisher. Can I benefit from this course?</strong>  </p>  <ul>  \t<li>The playing fields have been levelled. No longer do you need to have an existing magazine and a mountain of cash to develop a magazine and get it published. If you have a website, Blog or produce a newsletter... in fact, if you publish just about any content at all you can build your own magazine and get it published on iPhones and iPads.</li>  \t<li>Take a look on the newsstand right now and you will see there are new magazines focused on the tiniest of niches that are gaining huge readership numbers. You can do the same.</li>  </ul>  <p>  \t <strong>Does This Mean I Have To Create Lots Of Content?</strong>  </p>  <ul>  \t<li>No! A great feature of making a digital magazine is that there are no limitations on what you can publish. <strong><em>Forget duplicate content penalties!</em></strong> You can repurpose all of your own existing material in you magazine(s).</li>  \t<li>Think about it... Your magazine sits behing Apple&#039;s iTune store... You are not producing a website here, you are producing a magazine. You can publish what ever you like.</li>  </ul>  <p>  \t <strong>Why would I want to publish a magazine on the iPad or iPhone?</strong>  </p>  <ul>  \t<li>You no doubt know that being able to write and publish a digital book (<em>think Kindle</em>) is a fantastic way to help boost your own credibility and establish yourself as a leader in your field. Well what do you think owning a magazine will do?</li>  \t<li>You build yourself a platform from which you can not only reach your audience on a regular basis (Daily, Weekly or Monthly) but also have the opportunity to bring in other experts to produce content for you.</li>  </ul>  <p>  \t <strong>Who controls the magazine?</strong>  </p>  <ul>  \t<li>One of the beauties of publishing a magazine using the processes highlight in this course will mean you own the complete end to end solution.</li>  \t<li>There are many digital magazine solutions out there for you to choose from, but what they don&#039;t tell you is that once you start using their platform, you are stuck with them going forward and they often take a cut of you magazine profits. Not to mention the ongoing high fees they charge.</li>  \t<li>This course leave you in full control of your own digital magazine solution. You own it and you get to keep 100%% of the income.</li>  </ul>  <p>  \t <strong>Do I need to purchase any software to create the Digital Magazine?</strong>  </p>  <ul>  \t<li>Absolutely not. There are some costs involved but these are for things like joining the Apple Developer Program ($99 per year - everyone has to do this to be able to sell app&#039;s and magazines on iTunes) and hosting you magazine files online (from as little as $3 per month).</li>  \t<li>This course will show you step by step how to use existing software tools that nearly everyone already own to create the Newsstand files.</li>  \t<li>One of the key goals when creating this course was to make sure you don&#039;t have to spend any money on software tools to get started.</li>  </ul>  <p>  \t <strong>Do I have to have any programming experience?</strong>  </p>  <ul>  \t<li>Absolutely not. All you need is to produce a PDF. From there just follow along with the video instructions.</li>  </ul>  <p>  \t <strong>Can I ask for Support?</strong>  </p>  <ul>  \t<li>Most definitely. You can ask as many questions as you wish and Pete will answer.</li>  </ul>  <p>  \t <strong>Do I need a Mac to do the course?</strong>  </p>  <ul>  \t<li>Ideally yes, but it is not absolutely necessarily. The course also includes a section on how you can rent a virtual Mac online for just a few dollars.</li>  </ul>  <p>  \t <strong>Can I add interactivity to the magazine?</strong>  </p>  <ul>  \t<li>Yes you can. If you know anything about HTML or are able to create HTML5 web pages, you will love this course. Anything you can do on a web page you can add into your magazines.... Videos, Audio, Interactive elements, javascript, transitions, social integration.... this list just goes on and on.</li>  </ul>  <p>  \t <strong>**********************************************</strong><br>  \t<strong>You&#039;ll Learn</strong>  </p>  <ul>  \t<li>How to design your magazine so it fit perfectly on the iPad.</li>  \t<li>How to structure your magazine pages to take advantage of the Barker Framework magazine Index navigation functionality.</li>  \t<li>How to make simple tweak to your pages for dramatic effects.</li>  \t<li>How to store your magazine issues online for easy downline by your magazine app.</li>  \t<li>How easy it is for you to add as many back issues of your magazine as you wish.</li>  \t<li>Fast magazine creation techniques and what pitfalls to look out for.</li>  \t<li>The easy way to create you apps on iTunesConnect.</li>  \t<li>How to setup free magazine subscriptions.</li>  \t<li>Important testing techniques to makes sure you magazine looks awesome on the iPad before releasing it live.</li>  \t<li>How to track down bugs and test out changes super super fast.</li>  \t<li>The various Baker Framework configurations options to make you magazines work in lanscape and portrait modes.</li>  \t<li>Learn how to turn on page zooming</li>  </ul>  <p>  \t <strong>SPECIAL BONUSES</strong>  </p>  <ul>  \t<li class=\"PIN_1372966273538_hazClick\"><span class=\"PIN_1372966273538_hazClick\">As a special bonus, you will get access to Pete&#039;s very own magazine issue creation software that lets you create your magazine issues in under 2 minute! Saving hours and hours of time. This app is currently in development  and will be release as soon as the final bugs are ironed out. If you want a pre-release, just ask once you have signed up!</span></li>  \t<li>Once enough people are on-board, you will get access to a special Publishers online community where you can share ideas, tricks and techniques to make the most out of you magazines.</li>  </ul>  <p>  \t <strong>So what are you waiting for?</strong>  </p>  <p>  \t       If you have any questions you need answered before signing-up, send Pete a message here on Udemy or on facebook - I want you to feel 100%% confident in this course so you are assured that you will get the best results you can get.  </p>  <p>  \t <strong>I look forward to seeing you inside the course. Get Started Today!</strong>  </p>", 
    "end_date": null, 
    "title": "How To Make A Magazine - Create an Apple Newsstand Magazine", 
    "price": "20.00", 
    "instructors": "Peter Moxon", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/55561_376e_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-magazine-for-the-apple-newsstand/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-21T16:36:43Z"
}