{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\">&nbsp;Want to learn how to self publish your book on Kindle but don&#039;t know where to start? Do you want a step-by-step, proven system to follow?</em></p><p style=\"\">The &quot;How to Self Publish a Book on Kindle&quot; course is your step-by-step <em style=\"\">strategy</em> for researching, creating and self publishing best-selling books on Amazon. This course takes you through my same exact steps that I&#039;ve personally used to become a 3 times #1 International Best-Selling Author that receives passive income from my books.</p><p style=\"\">Learn:</p><ul style=\"\"><li style=\"\">The benefits of publishing on Kindle</li><li style=\"\">How to research and find profitable topics?</li><li style=\"\">Whether you should publish fiction or non-fiction?</li><li style=\"\">What are the costs for self publishing a book?</li><li style=\"\">How to find an affordable graphic designer for $5?</li><li style=\"\">How you can complete your book in 14 days or less</li><li style=\"\">How to self publish your book in 24 hours or less</li><li style=\"\">and much more!<br style=\"\"></li></ul><p style=\"\">This course is intended for motivated and determined entrepreneurs or business owners who want to become an instant authority in your niche market, build your list, make more profits, get more customers, and generate a passive income. All you need is a positive attitude and the determination to get it done!</p><p style=\"\">As a member of the &quot;How to Self Publish a Book on Kindle&quot; course, you&#039;ll also have instant access to self publishing secrets that Kate only shares in her private coaching programs.</p><p style=\"\">Take your time and go at your own pace. Be sure to check out our <a href=\"http://positivething.net/privacy-policy/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">privacy policy</a>  and <a href=\"http://positivething.net/terms-of-use/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">terms of use</a> .</p><p style=\"\"><em style=\"\">Earnings Disclaimer:</em></p><p style=\"\"><em style=\"\">While we have made every effort to show you how to create a profitable book as well as a best-seller, we cannot guarantee that you will make a certain amount of income. Your profits are solely based on your efforts to take action with what you&#039;ve learned.</em><br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How To Self Publish a Book on Kindle", 
    "price": "25.00", 
    "instructors": "\"Kate\" Redwine", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75404_6710_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-self-publish-a-book-on-kindle/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-07T22:09:45Z"
}