{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tThis guide provides you—the small business owner, enterprising blogger or bootstrapped entrepreneur—with a springboard for finding and making use of public domain and Creative Commons photos, clip art, fonts, maps, music, sound effects and more (if you don’t know what public domain or Creative Commons means, don’t worry, I explain it all in the course).  </p>  <p style=\"\">  \tOpting to use free digital assets can save a fledgling startup hundreds if not thousands of dollars (to say nothing of the hours saved as well); that money that could be well spent growing other facets of your business.  </p>  <p style=\"\">  \tCourse materials include a multi-part video series that walks you through the basics of using free online assets legally in your commercial projects. I&#039;ll also tell you how to avoid expensive legal hassles resulting from improper use of copyrighted material.  </p>  <p style=\"\">  \tIn addition to the screencasts, the course includes a comprehensive E-book reference guide that lists over 300 quality resources for free and inexpensive digital media.  </p>  <p>  \t  By the time you complete the course you will understand:  </p>  <ul style=\"\">  \t<li style=\"\">The ins and outs of public domain and Creative Commons licenses</li>  \t<li style=\"\">How to avoid potentially disastrous copyright infringement</li>  \t<li style=\"\">How to locate high-quality free and inexpensive digital media online</li>  \t<li style=\"\">Help you save time and money in the process!</li>  </ul>  <p style=\"\">  \tMost importantly, you&#039;ll be equipped to be able to quickly find any imaginable media asset that you might need in the future. The veritable treasure trove on free online media will be at your fingertips.  </p>", 
    "end_date": null, 
    "title": "How to Find & Use Free Stock Media for Your Business", 
    "price": "20.00", 
    "instructors": "David Papandrew", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434770_7160_3.jpg", 
    "course_url": "https://www.udemy.com/find-free-and-affordable-photos-music-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T06:57:22Z"
}