{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Ihr Buch im größten Buchladen der Welt: kein Anbieter macht es Autorinnen und Autoren so einfach wie Amazon, das <strong>eigene Werk als eBook in alle Welt zu verkaufen</strong>. Ob zur Schärfung Ihres Experten-Profils, aus Spaß am Schreiben oder zum Aufbessern des Lebensunterhalts – Sie brauchen keinen Verlag mehr, um in drei simplen Schritten zum Autor zu werden.</p>\n\n<p><strong class=\"redactor-inline-converted\">Ihr eBook bei Amazon – einfach, schnell und erfolgreich</strong></p>\n\n<ul><li>Bereiten Sie Ihr Manuskript optimal vor</li><li>Erzeugen Sie ein technisch einwandfreies eBook</li><li>Alles, was Sie für ein professionelles Werk brauchen</li><li>Stellen Sie Ihr eBook bei Amazon ein – ohne sich von Hürden aufhalten zu lassen</li><li>Optimieren Sie Titel, Beschreibung und Keywords</li><li>Verstehen Sie die Amazon-Ranking-Algorithmen</li><li>Wählen Sie die passenden Werbe-Maßnahmen</li><li>Lernen Sie Select, Kindle Unlimited, Kindle-Deals und Kindle AllStars kennen</li><li>Vermeiden Sie Stolpersteine – etwa rechtliche oder Steuer-Probleme</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">An einem Wochenende zum Kindle-eBook-Profi</strong></p>\n\n<p>Ihr Begleiter auf diesem Weg ist Matthias Matting, vom Blog Lousypennies halb scherzhaft, halb ernsthaft als \"Selfpublishing-Papst\" tituliert. Die Bezeichnung kommt nicht von ungefähr: mit über 70 Veröffentlichungen hat Ihr Dozent umfangreiche praktische Erfahrungen, die er schon seit Jahren auf der Selfpublisherbibel und in Online- und Offline-Seminaren weitergibt. Das Wissen, das Sie in diesem Kurs erwerben, ist garantiert praxisgerecht und auf dem neuesten Stand. Als langjähriger Journalist ist Ihr Kursleiter gewohnt, auch komplexe Sachverhalte verständlich zu vermitteln.</p><p>Der Kurs befasst sich <strong class=\"redactor-inline-converted\">speziell mit Amazon als weltgrößter eBook-Plattform</strong>. Das ist der ideale Einstieg – aber auch für Profis ist Amazon höchst spannend, weil es so viele Einflussmöglichkeiten bietet wie kaum ein anderer Shop. Unbestechliche Algorithmen bestimmen hier Verkäufe und Rankings, die Sie mit dem richtigen Detailwissen für sich nutzen können. </p><p><strong class=\"redactor-inline-converted\">Kurs-Überblick</strong></p><p>Der Kurs besteht aus drei großen Abschnitten und einem kleinen. Die Gliederung erfolgt dabei anhand des Veröffentlichungsweges: Vom Manuskript zum eBook, vom eBook in den Shop, vom Shop zum Leser. Der letzte Abschnitt bewahrt Sie vor den Fallstricken, die unweigerlich etwa von Finanzamt oder anderen Institutionen gespannt sind.</p><p>Vorgänge am Bildschirm können Sie stets sofort nachvollziehen. Fakten hören und lesen Sie in klaren, sauber strukturierten Präsentationen, bei denen Ihnen der Dozent persönlich Rede und Antwort steht. Sie erhalten eine Muster-Rechnung, die Sie sofort einsetzen können, zudem sind alle erwähnten Websites und Ressourcen auch direkt und bequem verlinkt.</p><p>Der Kurs besteht aus <strong class=\"redactor-inline-converted\">25 Lektionen mit insgesamt 4,5 Stunden Laufzeit</strong> – ein echter Wissens-Schatz. Dank des 30-tägigen Rückgaberechts gehen Sie kein Risiko ein, wenn Sie jetzt auf \"Diesen Kurs belegen\" klicken.</p>", 
    "end_date": null, 
    "title": "Ihr Kindle-eBook bei Amazon", 
    "price": "50.00", 
    "instructors": "Matthias Matting", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814814_8a9a.jpg", 
    "course_url": "https://www.udemy.com/ihr-kindle-ebook-bei-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T19:42:38Z"
}