{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Read the ★★★★★ reviews! UPDATED June 2015. Taught by a top Udemy instructor and world expert on smartphone video! <strong style=\"\">25 lessons, 1.5 hours of content</strong></p><p>  \t<strong style=\"\">      This is a step-by-step course that will teach you how to record and edit high quality quality video interviews with your iPhone.</strong></p>  <p>For journalists, writers, interns, NGOs, communications officers, freelancers, media students, journalism faculty, content marketers, PR pros, and media trainers</p><p><span></span>It is taught by a video journalism instructor with more than<strong style=\"\"> 75 five-star reviews</strong> and<strong style=\"\"> 5,000 students </strong>in the Smart Film School.</p>    <p>  \t<strong style=\"\">      The lessons in this course were developed from the experiences of training thousands of broadcast journalists how to tell stories with their mobile phones.  </strong>  </p>  <p>You will learn how to get great results with a mobile device and simple gear.</p><p>This course  introduces the equipment, the apps and step-by-step techniques for getting great results every time.  </p>  <p>  \t<strong style=\"\">  At the end of this course you will be able to make professional video interviews with your smartphone.  </strong>  </p><p> This lessons in this course are also included in the the Master 8-hours course \"Be a video and film pro with your iPhone.\"</p><p> I offer this in-depth topic separately so that people can choose the course that makes sense for their needs at the moment, and their budget.</p>  <p>  \tThe steps to producing video interviews are presented in a step-by step approach with case studies and exercises designed to guide you through the process.  </p>  <p>  \t<strong style=\"\">      You will learn proven techniques from a professional journalist who has taught video journalism to thousands of reporters in more than 30 countries.  </strong>  </p>  <p>  \t      Robb Montgomery combines this approach with advanced social media, data visualization and writing techniques that help stories connect with Web &amp; Mobile audiences.  </p>", 
    "end_date": null, 
    "title": "Interviewing for video: Pro method for recording interviews", 
    "price": "20.00", 
    "instructors": "Robb Montgomery", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436506_863c_3.jpg", 
    "course_url": "https://www.udemy.com/make-video-interviews-like-a-pro-smart-film-school/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T13:48:39Z"
}