{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<em><strong class=\"redactor-inline-converted\">LEARN THE ART OF NEWS WRITING FROM ONE OF UDEMY'S TOP INSTRUCTORS</strong></em><em><em>.</em></em></p>\n\n<p><em><em>\"Very likely the best teacher on Udemy...\" <strong>-- SCOTT SEGAR, UDEMY STUDENT</strong><br></em></em></p>\n\n\n\n\n\n<p><em><em>\"Simple and precious...\" <strong class=\"redactor-inline-converted\">-- MAX KOVALEV, UDEMY STUDENT</strong></em></em><br></p>\n\n\n\n\n\n\n\n<p><em><em>\"Learned things that would've taken years to gather. I feel I've catapulted ahead...\" <strong class=\"redactor-inline-converted\">-- PETER SKODA, UDEMY STUDENT</strong></em></em></p>\n\n\n\n\n\n\n\n<p><em><em><em><em>\"Real world knowledge that will change the way you write immediately...\" <strong class=\"redactor-inline-converted\">-- DARLENE B. MATTHEWS, UDEMY STUDENT</strong> </em></em></em></em></p>\n\n\n\n\n\n\n\n<p><em><em><em><em>\"It is just a treat to listen to someone who knows so well what he is talking about; the course was p</em><em>erfect...\" <strong class=\"redactor-inline-converted\">-- CHRIS HEMMES, UDEMY STUDENT</strong></em></em></em></em></p>\n\n\n\n\n\n<p><em><em><em><em>\"Excellent introduction to the core writing principles that separate mediocre writing from elite writing...\"<strong class=\"redactor-inline-converted\"> -- GH, UDEMY STUDENT</strong></em></em></em></em><br></p>\n\n\n\n\n\n\n\n<p><em><em>\"Simply awesome...\" <strong class=\"redactor-inline-converted\">-- </strong><em><strong class=\"redactor-inline-converted\">SK CHARLES TOMELDAN, UDEMY STUDENT</strong></em></em></em></p>\n\n\n\n\n\n\n\n<p><em><em>\"Foundational principles for understanding the art of telling a story...\" <strong class=\"redactor-inline-converted\">-- SANDY, UDEMY STUDENT</strong></em></em></p>\n\n\n\n\n\n\n\n<p><em>\"The news writing course you wish you had in school...\" <strong class=\"redactor-inline-converted\">-- MATE HORVATH, UDEMY STUDENT</strong></em></p>\n\n\n\n\n\n\n\n<p><em>\"Gives you the tools to write news stories that will captivate readers and gain followers...\" <strong class=\"redactor-inline-converted\">-- ANNA TIERNEY, UDEMY STUDENT</strong></em></p>\n\n\n\n\n\n\n\n<p>Ever dreamed of becoming a news journalist for a top national or international newspaper?</p>\n\n\n\n\n\n\n\n<p>Or maybe you're looking to sharpen your news-writing skills to the level of the world's best reporters and editors?</p>\n\n\n\n\n\n\n\n<p>  \t                                                 Perhaps you're a blogger who wants to learn how to present news articles in a more professional way?  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">If so, how would you like to know the writing secrets of the world's best newspaper editors?  \t</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                                                    Here's your chance to learn from someone who has taught some of the most high-profile journalists in the world how to improve their storytelling -- and who has worked for some of the world's biggest news organizations, including The Economist, Financial Times and Bloomberg News.</p>\n\n\n\n\n\n\n\n<p>  \t                                                    <em>\"Most great teachers can't write, and most great writers can't teach. Shani Raja is one of the few who excels at both. I managed dozens of reporters and editors during my 12-year career at Bloomberg News. Now he's the person I go to when I want help with my writing...\" <strong class=\"redactor-inline-converted\">--</strong> </em><strong class=\"redactor-inline-converted\">NICOLAS JOHNSON, FORMER BLOOMBERG AND GLOBE AND MAIL EDITOR, AND POLITICAL CANDIDATE FOR PARLIAMENT OF ONTARIO, CANADA.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                                                     <em>\"As a young reporter my prose might have been robotic and jargon-laden if not for Shani's watchful eye and attention to the elusive human interest behind ostensibly technical stories. Beyond the standard (yet crucial) reporting skills--like accuracy, clarity and integrity--I also learned refinement, how to withstand impulses toward glibness and cynicism that can naturally set in when oft revisiting the same beat. Shani will teach you how to write well, and with grace...\"</em> <strong class=\"redactor-inline-converted\">-- </strong><strong class=\"redactor-inline-converted\">HAWA ALLAN, WRITER AND LAWYER</strong>.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                     This course provides working and aspiring journalists with the core news writing skills needed to write news for the world's leading newspapers.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                     The lectures guide students through the core pillars of an effective news story--from the lead paragraph through to the proper illustration and contextualisation of news.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                     The lectures run for an hour, after which students and practitioners of journalism will be able to structure a news article with ease and precision for any of the world's top publications.  </p>\n\n\n\n\n\n\n\n<p>  \t                                                 This course gives you the foundation for excellent news writing. If you're keen to learn writing for business and other purposes, please check out my <strong class=\"redactor-inline-converted\">SECRET SAUCE OF GREAT WRITING</strong> and <strong class=\"redactor-inline-converted\">WRITING WITH FLAIR: HOW TO BECOME AN EXCEPTIONAL WRITER</strong> courses. </p>", 
    "end_date": null, 
    "title": "Journalism Masterclass: The Ultimate Guide To News Writing", 
    "price": "25.00", 
    "instructors": "Shani Raja", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101784_2bb3_8.jpg", 
    "course_url": "https://www.udemy.com/journalism-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-05T08:27:47Z"
}