{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>All you need to report and write a feature story and get it published</strong></p><p>Do you want to interview the Dalai Lama, report on a local issue in your community, write up a good story for your blog or website, or break into journalism as a possible career? </p>    <p>Journalism for Beginners is a “fast track” course infused with practical advice on how to report and write a feature story with the aim to get it published. </p>    <p>Journalism for Beginners – in a total of over 80 lectures and 3 hours of videos - includes an overview of the whole reporting and writing process, and then is split into three main sections – Reporting, Writing, and Getting Published.</p>    <p>The emphasis of this course is on reporting, writing and selling your story – making an income from the sale of your story. That is the goal medium to long term, deriving income from the sale of your stories. But it also includes some of the tactics needed to build up a portfolio of stories – some of which may be published for free – in order to demonstrate to prospective editors that you can report and write, and know your subject.</p>    <p>KEEP YOUR EDITOR HAPPY: In addition, the course includes “secret tips” on how to deal with editors. These tips are entitled: Keep Your Editor Happy. And with good reason!  If you are going to get your story published, you need to keep your editor happy – in other words, communicate with them in the right way and provide them with a story they are happy to publish. </p>    <p>If you are looking for a good introduction to how to report and write stories and get them published, this is it. </p>    <p>The aim is to produce a real story and send it to a newspaper, magazine or news service for publication. In other words – and this is important – the focus is on getting published, not just going through the motions. What matters is getting published and seeing your name online or in print.</p>", 
    "end_date": null, 
    "title": "Journalism Skills for Beginners", 
    "price": "25.00", 
    "instructors": "Instructor Julian Gearing", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/504240_524c_2.jpg", 
    "course_url": "https://www.udemy.com/journalism-skills-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-17T06:28:17Z"
}