{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Are you desperate to get more Kindle reviews for your books? Seeking more five star reviews? Craving that vital social proof needed to catapult your book sales skyward?</em></strong></p><p>You're not alone.</p><p>Many authors struggle to get readers to leave honest reviews for their books, even when they've got a great book and solid sales. The hard truth is that only 1-2% of readers, on average, ever bother to take the time to leave a review. Waiting for those organic reviews to slowly filter in and praying they result in a positive rating can be an agonizing, slugging process.</p><p>But it doesn't have to be.</p><p><strong>Imagine launching your new book with more than a dozen reviews on day-1?</strong></p><p>Getting a large number of positive, honest launch-day reviews is crucial for generating valuable momentum to drive sales of your Kindle book. It's also a lot easier than you might expect, and you can accomplish this while only using white hat methods and best practices. (That's right, no shady business here).</p><p>All you need is a quality Kindle book and the simple-to-follow formula I'm going to teach you when you<em> enroll today.</em><br></p><p><strong></strong></p><p><strong><u>In this course, you'll learn how to:</u></strong></p><ul><li>Get more positive 4 and 5 star reviews for your Kindle books</li><li>Build a launch team to get tons of honest day-1 reviews right from the get-go</li><li>Create the positive social proof you need to drive launch sales</li><li>Increase your overall customer reviews over time using strategic best practices</li><li>Overcome the challenges of getting negative reviews</li><li>Learn how to turn constructive criticism into a valuable tool for improving your books and getting more positive reviews</li><li>And more!</li></ul><p><br></p><p>Are you ready to turn the tide and get more positive and reviews and social proof to drive your Kindle book sales? Scroll on up and click \"Take This Course\" today! Let's get started!</p><p><br></p><p><br></p><p><br></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "Kindle Book Review Formula: How to Get More Kindle Reviews", 
    "price": "20.00", 
    "instructors": "Nathan Meunier", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674750_ecd5.jpg", 
    "course_url": "https://www.udemy.com/kindlebookreviewformula/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T18:01:57Z"
}