{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>In the Formatting eBook For Kindle course, you will learn how to format professional looking eBooks in both Kindle and ePub formats that will provide your readers with an enjoyable reading experience.</strong></p><p>Nothing cries out amateur more for a self-published author than a badly formatted book. </p><p>At its worst, bad formatting can stop the reader from finishing your ebook and may even result in bad reviews. </p><p>Even ebooks with minor formatting mistakes can result in the reader being distracted from the world that you have lovingly created and jolt them back into reality, thus spoiling their reading experience.<br></p><p>In this course, you will learn how to give your readers the best reading experience possible by compiling professional looking eBooks within the writing tool, Scrivener. </p><p>You will also learn how to correctly format the all-important front and back matter of your books in Scrivener, how to create children’s illustrated books in the Kindle Kids Book Creator and how to format elegantly styled eBooks within Vellum.</p><p>Finally, you will learn how to validate both ePub and Kindle formatted books and check that they render correctly on a number of different devices.</p><p><strong>Save time, money and countless hassle formatting your ePub and Kindle eBooks</strong></p><p>Tired of spending all that time and effort manually formatting your eBooks?</p><p>Would you like to know how I easily and effortlessly format my books into different formats for publishing on the various online eBook distributors?</p><p>You will get an over-the-shoulder, step-by-step guide to Scrivener’s powerful Compile feature, where you will learn how to correctly use the different compilation options available and create correctly formatted books in both the ePub and Mobi formats.</p><p><strong>By the end of the course, you will be able to confidently format your ebooks so that they render correctly on different devices and ensure that your readers enjoy the perfect reading experience.</strong></p>", 
    "end_date": null, 
    "title": "Kindle Formatting", 
    "price": "20.00", 
    "instructors": "David James Ault", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573436_c5df_8.jpg", 
    "course_url": "https://www.udemy.com/formatting-ebooks/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T12:34:40Z"
}