{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong></strong><strong>In this Kindle Publishing course for self-published authors, I will show you the steps you need to take in order to successfully publish your book on Amazon, through Kindle Direct Publishing. </strong></p>\n\n<p>You will learn how to <em>Research</em> the elements that make up a bestselling book in your niche or genre and then how to <em>Write</em> effective copy that will hook readers and entice them to buy your book.</p>\n\n<p>You will learn step-by-step how to actually publish your ebook through KDP and also whether or not you should place your book exclusively within KDP Select.</p>\n\n<p><strong><br>Research the Bestselling Authors and Books in Your Particular Niche or Genre </strong><strong></strong><br></p>\n\n<p>Are there certain authors in your niche or genre that seem to be amongst the bestsellers, time and time again?</p>\n\n<p>Perhaps they have a huge following or just write incredible books, but the chances are that there are a number of things that you can learn from both them and their books.</p>\n\n<p> In the section on <strong>Researching</strong>, you will discover:</p>\n\n<ul><li>How to dissect the elements that make up a bestselling book in your niche or genre</li><li>How to mirror what the bestselling authors do to create a description that sells</li><li>How to choose the best two sub-categories for your book</li><li>How to research keyword phrases for your book, WITHOUT having to pay for expensive software</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Write Compelling Copy that Will Sell Your Book on its Amazon's Sales Page </strong></p>\n\n<p>You may well have written your book, but that doesn't mean you still don't have some more writing to do. This particular type of writing is totally different to the creative writing you have been doing up until this point. And requires a totally different skill set.</p>\n\n<p> In the section on <strong>Copywriting</strong>, you will learn:</p>\n\n<ul><li>How to write a good title for your book</li><li>What your sub-title should incorporate</li><li>What your book’s tagline should try to achieve</li><li>How to write a description for your book that will pique the reader’s interest</li></ul>\n\n<p><br></p>\n\n<p><strong>An Over-the-shoulder Look At How To Publish a Book on the Amazon Kindle Store </strong></p>\n\n<p>Once you have researched the ideal categories and keywords for your book and have also written the perfect copy, the next stage is of course to actually go onto KDP and publish your book.</p>\n\n<p>And I thought the best way to show you how to do this was to take you step-by-step through the Kindle Publishing process.</p>\n\n<p>In the section on <strong>Publishing To KDP</strong>, you will learn</p>\n\n<ul><li>How to enter your book details</li><li>How to expand on the book description you have written and create a description for your Amazon Sales Page</li><li>How to set up your book’s pricing</li><li>How to incorporate your keyword phrases</li><li>How to use HTML so that your book stands out from the crowd</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Is Exclusivity the Correct Choice For You?</strong></p>\n\n<p>Before you click on that Publish button, you still have a very important decision to make, namely whether to place your book exclusively with KDP Select. </p>\n\n<p>And in the section on <strong>Selecting</strong>, you will find out:</p>\n\n<ul><li>The advantages of KDP Select</li><li>The disadvantages of KDP Select</li><li>And when an author should or should not go exclusive</li></ul>\n\n<p><br></p>\n\n<p>At the end of each section of the course, I have included:<br></p>\n\n<ul><li>a Quiz - to test your knowledge of what you have just learned</li><li>a PDF - with links to the resources and tools mentioned in the section, as well as some further reading on the topic.</li><li>a Task Sheet - which sets out a number of tasks for you to complete in order to practice what you have learned.</li></ul>\n\n<p>And by completing the quizzes, the extra reading material and the tasks I have set, I believe you will take even more from the course than if you just sit and watch it, so I highly recommend that you do so.</p>\n\n<p><strong>By the end of this <strong>Kindle Publishing</strong> course, you will have all the elements correctly in place to successfully publish your ebook on Amazon. </strong></p>", 
    "end_date": null, 
    "title": "Kindle Publishing", 
    "price": "20.00", 
    "instructors": "David James Ault", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425114_d536_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-publish-an-ebook-on-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T17:40:37Z"
}