{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is a BUSINESS course for Business, Government and Not for Profits: Wordpress can be used for a variety of purposes including hobby blogging and opinion sites. But in THIS course you'll learn how to turn the free Wordpress hosted software into a social media press room for Public Relations, Marketing and general Business students interested in Facebook and Twitter and blogs. If you want to integrate Facebook and Twitter and Instagram and all that good stuff into your website instead of having it sit aside from your channels, this is the course for you. If you are a corporate writer, public relations press release manager, or a small business wanting to create a free website that catches the eye of journalists, and customers on social media, this course will teach you how to create the site, add your own domain name, write articles and publish blog posts, turn your blog articles into an enewsletter and fully integrate social sharing, Facebook and Twitter into your hub/website. If you already have a website or even a Wordpress blog, this course will help you see if it's been set up right to get the most readers, and customers interest. </p><p><strong>*** On April 1st This course will be closed to NEW students. I will of course continue to support current and past students. No new students will be accepted after April 1st****</strong><br></p><ol><li>Learn what makes a social media press release \"social\".</li><li>See examples of a social media press room by some of the world's biggest companies and organisations</li><li>Practice writing for social media distribution by customers and journalists</li><li>Build social media into your everyday website so that the website and Facebook/Twitter work <strong>together</strong>, not separately</li><li>Gain experience blogging for business and learn what makes a successful (and read!) business blog</li><li>Brush up on your Public Relations, Marketing, Content and Business skills by creating a website from scratch (no techie bits!) and presenting it to the world</li><li>If you complete this course you <strong>will</strong> have a <strong>live</strong>, business website with relevant information for both customers to make purchasing decisions and journalists to review and contact you. </li></ol><p>What are the Main Features of a Social Media Press Release?</p><ul><li>A controllable hub (Facebook, Twitter etc are under the control of those companies).</li><li>Written in the most suitable brand voice (educational, serious, fun, corporate or entertainment)</li><li>Strong visual branding (colours and logos, and header images)</li><li>About statements on corporate social responsibility, company history, stories.</li><li>Contacts such as address of press launch, and maps, email addresses, phone numbers</li><li>Lots of rich content “social objects\" ripe for dissemination on Facebook and Twitter</li><li>Usable and easy admin and structure – ability to email in a press release and have it go live!</li><li>Call to action widgets (sign up for email newsletters, download industry PDF, fill in survey)</li><li>Posts containing: Coupons, offers, competitions, company statements, message from CEO, industry vision.</li><li>Social sharing also increases SEO and SMO (search and social media optimisation).</li></ul><p>Your own personal blogging mentor! 3 hours of videos, a workbook, quizzes, and a question and answer forum where you can ask me any question about Wordpress. I'll even make a video to respond to your question and walk you through it! Provided it hasn't been covered already etc. </p><p>My name is Laurel Papworth, I've been blogging for over 10 years (and before then, a \"citizen journalist\") and have won accolades such as Forbes Magazine \"Top 50 Social Media Influencer\" and AdAge magazine \"Power 150 Media and Marketing Blogger\". I have taught this course at University of Sydney and to Corporate and Government in Australia and Asia for 10 years. And I reach 6.8 million people a month through social media. </p><p>July 20 2015</p>", 
    "end_date": null, 
    "title": "Learn Business Blogging & Social Media PressRoom (Wordpress)", 
    "price": "40.00", 
    "instructors": "Laurel Papworth", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444444_a8ac.jpg", 
    "course_url": "https://www.udemy.com/wordpress-social-media-press-release-blog/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-11T04:38:48Z"
}