{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Learn the basic concepts, tools and techniques to light interviews on location for business videos.</p><p style=\"\">Build a strong foundation to understand the basic qualities of light, and how you can manipulate light for professional looking videos.</p><ul style=\"\"><li style=\"\">Learn about color temperature.</li><li style=\"\">Practice setting your camera to the correct color temperature of light.</li><li style=\"\">Recognize and utilize the difference between hard and soft light.</li><li style=\"\">View examples of our super expensive industry standard tools of the trade.</li><li style=\"\">Witness how we use shoestring budget lights for professional results.</li></ul>Working knowledge can save you a lot of money when you start lighting business videos.This course is suitable for those just starting with video production, to seasoned pros looking for shoestring alternatives to work with the budgets of the exploding New Media production markets.  We&#039;ll start by going over the basic principles and quality of light as it affects us with video production. Next we&#039;ll sample some of your industry standard tools of the trade, to springboard ideas for alternative, super low budget options.  Next we&#039;ll look at and test a few of these super affordable lights, and even look at new lights sourced from home centers.  After a little practice you&#039;ll have the confidence to approach a variety of location shoots without heavily investing in lighting equipment.", 
    "end_date": null, 
    "title": "Lighting For Video On A Shoestring", 
    "price": "20.00", 
    "instructors": "Karl Kim", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543644_454c_3.jpg", 
    "course_url": "https://www.udemy.com/lighting-for-video-on-a-shoestring/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T00:26:46Z"
}