{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">In this video training, you will learn <strong style=\"\">everything you need to know</strong> to present yourself professionally on a video webinar.  We will cover the minimum hardware and software requirements, setup and configuration, professional lighting, and video production basics. </p><p style=\"\"><strong style=\"\">You can look professional on your webinars without spending thousands of dollars on equipment and dedicating a room for a studio!</strong></p><p style=\"\"> <strong style=\"\">What are the most common mistakes in video webinars, and how to avoid them?</strong> After taking this course and implementing the principles, you will be able to create one of the best looking webinars on the internet -<strong style=\"\"> Guaranteed!</strong> </p><p style=\"\"><strong style=\"\">What equipment should you buy?  </strong>I have researched and tested countless products to determine which camera, microphone, lights, and stands are best for an in-home or in-office webinar studio.  My goal was inexpensive, easy to use, portable, but with professional results.</p><p style=\"\"><strong style=\"\">How long will it take to learn this?</strong>  Time is money! I designed this course with <strong style=\"\">SHORT, CONCENTRATED</strong> videos so you can get in, learn the content, and get back to work! <em style=\"\"><strong style=\"\">My goal was to deliver the most value in the least time.</strong></em></p><p style=\"\"> I designed this course for the savvy professional webinar producer who is ready to <strong style=\"\">increase their expert image</strong>, but doesn&#039;t want to spend the time or financial investment to set up a dedicated permanent video studio.</p><p style=\"\"> Thanks for checking out my course; be sure to watch the free previews below. <strong style=\"\"><em style=\"\">Enroll in the class today to activate this powerful training and take your web presence from average to a Studio-Pro!</em></strong> </p>", 
    "end_date": null, 
    "title": "Make your webinars look better than 95% of your competition", 
    "price": "50.00", 
    "instructors": "Roger Zanders", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531554_1d6d_6.jpg", 
    "course_url": "https://www.udemy.com/complete-guide-to-webinar-video-production/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T19:20:20Z"
}