{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<br style=\"\">  <strong style=\"\"></strong>  <p>  \t<strong style=\"\">Curso Completo de Marketing en Kindle para Autores, Escritores y Editoriales.</strong>  </p>  <p>  \t<strong style=\"\">(Partiendo de Cero y SIn necesidad de utilizar Blogs, Facebook, Twitter ni Redes Sociales)</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">      La guía definitiva para VENDER tus eBooks en Amazon.</strong>  </p>  <p>  \t                  Tanto si eres un<strong style=\"\"> autor independiente</strong>  como si eres el <strong style=\"\">responsable de un catálogo editorial</strong>, necesitas una <strong style=\"\">estrategia de ventas</strong> y utilizar unas <strong style=\"\">herramientas específicas</strong> y acordes con tu <strong style=\"\">objetivo</strong> de <strong style=\"\">convertir tus eBooks en Best Sellers</strong>.  </p>  <p>  \t                  En este curso aprenderás a fijar una Estrategia y a utilizar<strong style=\"\"> </strong>los <strong style=\"\">Elementos del Marketing </strong>específicos de Kindle para <strong style=\"\">vender más eBooks</strong> y para hacerlo de una forma más sólida y sostenida en el tiempo.  </p>  <p>  \t<strong style=\"\">Este curso va a enseñarte a:</strong>  </p>  <ul style=\"\">  \t<li><strong style=\"\">Hacer un</strong> <strong style=\"\">Plan de Marketing</strong> <strong style=\"\">Eficaz</strong> para <strong style=\"\">Posicionar tu Libro</strong> correctamente en Kindle<br style=\"\">  \t<strong style=\"\"></strong></li>  </ul>  <ul style=\"\">  \t<li><strong style=\"\">Multiplicar (x3, x4...x 5, incluso más) tus ventas</strong> de eBooks Kindle en unos pocos días/semanas</li>  \t<li><strong style=\"\">Convertir tus eBooks en Best Sellers</strong> en las diferentes categorías de Kindle aplicando un sistema de trabajo probado (KAMS)</li>  \t<li><strong style=\"\">Dar visibilidad a tus eBooks</strong> en la tienda de Amazon</li>  \t<li>Manejar de forma profesional los <strong style=\"\">Elementos del Marketing de Kindle</strong></li>  \t<li><strong style=\"\">Gestionar tu catálogo editorial</strong> de forma exitosa</li>  \t<li><strong style=\"\">Vivir como autor independiente</strong> generando <strong style=\"\">ingresos con tus eBooks</strong></li>  \t<li>Todo ello<strong style=\"\"> sin necesidad de utilizar Blogs ni redes sociales como Facebook, Twitter, G+, etc...</strong></li>  </ul>  <p>  \t                 Comenzaremos por explicar qué es Kindle y su entorno de ventas. Cuáles son los motivos de éxito y de fracaso en Kindle, <strong style=\"\">por qué algunos libros se venden con gran éxito</strong> y otros, la mayoría, quedan relegados.  </p>  <p>  \t                 Aprenderás cuáles son los Elementos del Marketing de Kindle y <strong style=\"\">Cómo integrarlos Paso a Paso</strong>, en un sistema de trabajo eficaz y probado: el <strong style=\"\">Kindle Author Marketing System (KAMSY).</strong>  </p>  <p>  \t                 Aprenderás también a mantener tus eBooks en los listados de libros más vendidos y rentables a lo largo del tiempo.  </p>  <p>  \t                 Para dar a conocer y vender un eBook en Amazon debes conocer los conceptos en los que se basa el universo Kindle y debes realizar una serie de acciones muy concretas. En este curso se explican estos conceptos <strong style=\"\">de forma fácil</strong> y amena y <strong style=\"\">se detallan las acciones a realizar de forma ordenada, paso a paso.</strong><br style=\"\">  \t                 En unas pocas horas, siguiendo el <strong style=\"\">método KAMSY</strong> (KIndle Author Marketing System) explicado en este curso conseguirás optimizar el posicionamiento de tus eBooks, venderlos de forma efectiva e <strong style=\"\">incrementar tus ventas de forma espectacular</strong>.  </p>  <p>  \t <strong style=\"\">Así pues, ¿tienes un libro que vale la pena leer?</strong><br style=\"\">  \t                 No esperes más y ponte a trabajar con las bases y técnicas que aprenderás en este curso. <strong style=\"\">Tu libro</strong> puede y <strong style=\"\">debe llegar a tu público</strong> y, quién sabe, quizás convertirse en un <strong style=\"\">auténtico bestseller mundial</strong>.  </p>", 
    "end_date": null, 
    "title": "Marketing Eficaz para Vender tu Libro en Amazon Kindle", 
    "price": "50.00", 
    "instructors": "Iberdynamics Creative", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/137174_a81b_19.jpg", 
    "course_url": "https://www.udemy.com/vende-mi-libro-como-best-seller-con-amazon-kindle/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-23T18:23:18Z"
}