{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Germany is the <strong>largest non-english book market</strong> - and the third largest book market world wide. But the German e-book market gets more and more interesting too. While in the US and the UK it has become increasingly difficult to reach a top position, the e-book-market in Germany is not yet as mature. Being a successful author abroad, there is no better time than now to try it for yourself. This course will introduce you to the market and all its players. </p><p>It is tought by a <strong>renown expert on all things self-publishing</strong>. Matthias Matting, the president of the German self-publishers association and founder of Selfpublisherbibel, is a proven instructor – and he knows what he's talking about. Everything you need to know is shown either in slides or in screen-casts that you can directly follow on your own computer. </p><p>The only things you need are: a book that you want to translate, an interest in the German market and this course. Fiction or non-fiction, both are covered. The language barrier will be gone because you can see and follow all the necessary steps on your own screen. You will learn the trade, and the course makes sure you don't forget the rules: Matting will also introduce you to <strong>book specific laws and regulations</strong> in Germany like \"Preisbindung\" or \"Titelschutz\". Where and how do you get ratings? What can you do to market your book?</p><p>To work through the course, you will need about one weekend. To follow all the steps though takes <strong>four to six weeks</strong>, and that does not include the translation itself.</p>", 
    "end_date": null, 
    "title": "Master Publishing your eBooks and Books on the German Market", 
    "price": "20.00", 
    "instructors": "Matthias Matting", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571018_0b49.jpg", 
    "course_url": "https://www.udemy.com/master-publishing-your-ebooks-and-books-on-the-german-market/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-01T17:03:43Z"
}