{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t               This course will give you the confidence to go in front of the cameras and microphones and share your message.  There is a massive opportunity for anyone who has the skills to do media interviews on television, radio and with print publications.  The problem is, most are worried about what they look like, what they&#039;ll say and what to do if things go wrong. I&#039;ll tell you exactly what you need to do, whether you are promoting your organisation or defending yourself in a crisis situation.  </p>  <p>  \t               As a former BBC journalist, and media trainer, I will take you step-by-step through all the tips and skills you need to look like a pro during media appearances. There are more than 60 easy-to-follow videos covering everything from messaging and what to do with your hands, right through to how to get more coverage in the media.  </p>  <p>  \t               There are 5 modules:  </p>  <p>  \t               - Looking Like a Pro on Camera  </p>  <p>  \t               - Crafting Your Message  </p>  <p>  \t               - Making a success of interviews  </p>  <p>  \t               - Radio, Print and SKYPE interviews  </p>  <p>  \t               - Getting the media to contact YOU  </p>  <p>  \t               When you know how the media works you can massively increase the exposure for you and your company.  You can also deal with a crisis situation with confidence. You have seen the same faces who appear repeatedly as guest in the media.  You too can master the skills needed to become one of them.  </p>  <p>  \t               So sign up now and learn how to look like a pro on camera and in the media.  </p>", 
    "end_date": null, 
    "title": "Media Training: Look like a Pro on camera and in the media", 
    "price": "20.00", 
    "instructors": "Mark Egan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/306342_6419_4.jpg", 
    "course_url": "https://www.udemy.com/media-training-look-like-a-pro-on-camera-and-in-the-media/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T19:35:20Z"
}