{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t  Imagine becoming a regular fixture on the talk show circuit and in the national media as a well-known author. Writing a good book isn&#039;t easy, but getting in front of enough people to generate buzz and demand for your books can be even harder. This Media Training for Authors course will teach you step-by-step how to prepare for media interviews. Specifically, you will learn how to look good on TV, how to frame a media message, how to answer reporters&#039; questions and how to speak in sound bites.  </p>  <p style=\"\">  \t  If you want to sell a lot of books, you will need to be able to sell your ideas and your expertise to the public through regular media appearances. You can begin learning how to master the media right now in this comprehensive, interactive course.  </p>  <p style=\"\">  \t  TJ Walker is a media trainer with 30 years of experience as a media coach to best-selling authors, experts, CEOs, Presidents of countries, Prime Ministers, and Nobel Peace Prize winners. Walker is also the author of the USA Today #1 Bestseller &quot;Secret to Foolproof Presentations&quot; (also a Business Week and Wall Street Journal Bestseller). Walker once set the Guinness book of World Records for most talk show appearances ever in a 24 our period (104) while promoting one of his public speaking books.  </p>  <p style=\"\">  \t  The course also features three bonus interviews with book publishing legend Dan Poynter.  </p><p style=\"\">Enroll in this course today.</p><p style=\"\">Course updated on August 3, 2015</p><p style=\"\">There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p style=\"\">TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p style=\"\">What others say:</p><p style=\"\">“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p style=\"\">“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p style=\"\">(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Media Training for Authors: Promote Your Book in the News", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366776_a14c_3.jpg", 
    "course_url": "https://www.udemy.com/media-training-for-authors/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T17:56:25Z"
}