{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong> \t *** Last update: May 2016 ***</strong></p>\n\n<p><strong>This course has BRAND NEW, UPDATED material as recent as May 2016!</strong></p>\n\n\n\n<p><strong><strong></strong></strong></p>\n\n\n\n<hr>\n\n\n\n<p>\t Anyone can make a movie with modern technology, but most people get stuck in the process because it can be very complicated and overwhelming. There is a lot of work to creating a high-quality short movie and lack of knowledge about the process can make that work insurmountable. This course aims to overcome that challenge by providing mentorship and a clear 10-Step process to get you from beginning (desire) to end (finished movie).</p>\n\n\n\n<p>\t<strong>Produce Your First Movie With Ease Using </strong><strong>Fun Yet Methodical Step-by-Step Process</strong>  </p>\n\n\n\n<ul>\t<li>Before Pre-Production-Getting Mentally Ready and Finding Your Script</li>\t<li>Pulling in All Elements During Your Pre-Production Process (Including things that lots of first-time producers overlook)</li>\t<li>Being On-Set, Making the Movie, Post-Production Video Editing, and Marketing</li>  </ul>\n\n\n\n<p>\t<strong>Self-Empowerment in the Entertainment Industry Starts with Making Your Own Movies</strong>  </p>\n\n\n\n<p>\t This course puts YOU in control of what type of productions you give your time and energy. This course is geared toward anyone who has ever wanted to make a movie and is especially important to those that want to work in the entertainment industry and need a reel to do so (ESPECIALLY ACTORS).</p>\n\n\n\n<p>\t Writers, Director, Cinematographers and Actors all need to show their abilities through a reel in order to get jobs, but often they need to get jobs before they can create a reel.</p>\n\n\n\n<p>\t IT'S A CATCH 22!</p>\n\n\n\n<p>\t This course will not only teach you to produce movies, it will give you the opportunity to pick the material that will be perfect for your reel, open you to the world of film festivals (fun, supportive and great for networking), give you a prestigious PRODUCER title, get IMDB credit and make you better at your current craft by understanding a producer's point of view, typically the person that does the hiring on productions.</p>\n\n\n\n<hr>\n\n\n\n<p>\t How long have you been waiting for your movie career to happen? Now is time to make it happen!</p>\n\n\n\n<p>\t All future updates to this course are free - you are \"locked-in\" at the current low price of $149 - you will never pay more if you <strong>enroll today at the introductory low price.</strong>  </p>\n\n\n\n<p>\t<strong>And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!</strong>  </p>", 
    "end_date": null, 
    "title": "Movie Producing Made Simple: Make a Short Film in 30 Days ", 
    "price": "25.00", 
    "instructors": "Leslie Lello", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295557_07f5_3.jpg", 
    "course_url": "https://www.udemy.com/hey-actors-get-the-starring-roll-produce-your-own-movie/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T01:07:36Z"
}