{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">            Playwrights Practice: Playwriting Made Easy</strong>  </p>  <p style=\"\">  \t                                         &quot;<em style=\"\">The act of playwriting feeds the soul unlike anything else in the theatre arts.</em>&quot; ~Unknown  </p>  <p style=\"\">  \t                                                                This is a comprehensive course designed to teach aspiring playwrights the methods and skills necessary to create their own short stage plays from idea inception through polished final draft execution. Seasoned writers will benefit from the online table reading component as well as the lectures, allowing a chance to review technique as well as hear and garner constructive criticism of short works.  We will reference and study theatrical masterpieces as examples.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Playwriting is about the journey of the play.  That journey offers you the chance to change your life through examination. </strong> It enables you to take a problem and look at it in ways you may never have considered before.  This can, in turn, present previously unseen options to you.  </p>  <p style=\"\">  \t                                                                      Herein, I offer to you the shortcuts, methodologies and creative insights taught to me during the first semester of MFA-level playwriting in Carnegie Mellon University&#039;s Dramatic Writing program. These fuzzy memories have been married to a myriad of professional tips, tricks and secrets I&#039;ve learned through the experiments, successes and failures of both myself and fellow alum during our journey into the businesses of theater, film and television.  </p>  <p style=\"\">  \t                                                                      If you follow this course through from beginning to end and execute all of the readings and exercises, you will be armed with the tools necessary to transform yourself into a short-form playwright of note while becoming a better writer and a more thoughtful human being.  </p>  <p style=\"\">  \t                                                 You will learn about short play structure, writing formulas, various types and levels of dialogue creation, managing character expectations, managing audience expectations, rising tension, avoiding cliche, and proper stage play format ... and in the process of practicing you will develop your own personal writing style and flare.  </p>  <p style=\"\">  \t                                                                  If you complete the instruction provided along with the assignments and optional online table reading, you will complete this course with a minimum of:  </p>  <p style=\"\">  \t                                                                      1) one ten-minute play with feedback via workshop, and<br style=\"\">  \t                                                                      2) the foundation necessary to prepare you to write your first full length stage play for the purpose of winning notoriety, influencing people, mastering advanced structure, applying for a possible residency, or submission to short-form playwriting competitions.  </p>  <p style=\"\">  \t         This course is dedicated to the memory of my playwriting mentor, Milan Stitt, February 9, 1941 to March 12, 2009 (<em style=\"\">The Runner Stumbles</em>).  </p>", 
    "end_date": null, 
    "title": "Playwrights Practice:  Playwriting Made Easy", 
    "price": "50.00", 
    "instructors": "Jack Sullivan", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284692_fabd_6.jpg", 
    "course_url": "https://www.udemy.com/playwriting-primer-write-original-short-stage-ready-plays/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T17:45:34Z"
}