{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><p>This podcasting  tutorial is designed for anyone who wants to learn the essentials of how  to make a podcast. &nbsp;The lectures are created without the assumption of any  advanced computer knowledge or skills. &nbsp;While this podcasting  tutorial focuses primarily on&nbsp;Garage Band, the information is  applicable to Audacity and other recording software.</p>    <p>The lectures are almost  exclusively live screen recordings of the entire creative process from A to Z.  &nbsp;Supporting documents include mindmaps, checklists, transcriptions and  narratives to elaborate on the information contained in the video lectures.</p>    <p>This course is geared for  the beginning podcaster, but the extra&#039;s section will contain some cool free  tools and techniques to enhance any podcast and reach out to new audiences and  markets.</p>    <p>The course will focus  heavily on free tools widely available to create cover art, syndicate content  and generate additional content from podcast episodes. &nbsp;The purpose of  syndication and creating additional resources will serve to reach a larger  audience and promote your podcast to new heights of popularity.</p>    <p>I have been teaching this  live for some time and am excited to share this “how to make a  podcast” course with a broader audience. &nbsp;My contact information will be  available to enrolled students to help first time podcast creators get their  show up on iTunes.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Podcasting - From Zero To Hero", 
    "price": "20.00", 
    "instructors": "Mitchel Schwindt", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/45285_f86f_8.jpg", 
    "course_url": "https://www.udemy.com/podcasting-how-to/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-09T15:58:34Z"
}