{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Got a great idea? A great story? An exciting event? A big issue?</strong></p>  <p><strong>How do you get it OUT THERE?</strong></p>  <p><em>In spite of the shift to immediacy via new media and today’s 24/7 news cycle, Media Releases (or Press Releases) are still the main tool for creating awareness of messages or events in the journalistic world. The reality though is that many go straight to the recycle bin, which is a waste of time, money and effort.</em></p>  <p><strong><em>So how do you create professional, cut-through Media Releases that entice, and even guarantee, media coverage for your story?</em></strong></p>  <p><strong></strong>It’s easy if you know how.</p><p><strong>Maximize Interest in Your Story by Mastering the Art and Craft of Creating Free Media Coverage Through Compelling Media Releases</strong><br><strong></strong></p>  <p>\n\n<strong><em>Learn the concepts, tools and techniques for writing\nsuccessful Media (Press) Releases. Whether you’re new to media relations or a\nwell-practiced media release user, you’ll learn tips and tricks that will make\nyour Media Releases stand out from the masses and guarantee coverage of your story.</em></strong><strong><em></em></strong></p><p>In this course we’ll explore the essentials of using Media Releases to tell your good news story and get <strong><em>your name</em></strong> quoted alongside it.</p>  <p><em>Media coverage is better, cheaper and faster than any paid advertising, \nand it builds stronger connection with your target market – your \naudience.</em><em></em></p><p>I’ll give you a clear understanding of what journalists are actually looking for and why, in order to create a compelling news story and ultimate media coverage. I’ll teach you the step-by-step process for creating and pushing out a media release and making it a <strong><em>compelling</em></strong> story that the media <strong>HAS</strong> to follow up.</p>  <p><strong>You’ll get truly practical skills, tools and techniques for creating powerful Media Releases. </strong></p><p>  <strong><em>Powerful skills for building your organization's profile and keeping your news story ideas out of the trash bin!</em></strong><br></p><ul><li>Learn what journalists are looking for</li><li>Identify newsworthy topics</li><li>Learn the 7 categories of news that give ‘weight’ to your story</li><li>Learn the two main Media Release structures</li><li>Learn the 10 rules of writing</li><li>Build your own Media Releases with practical exercises</li><li>Develop your skills with practical checklists and examples</li><li>Learn what to do with your Release when it’s ready and how to leverage your story and its coverage</li></ul>  <p>Whether you’re a first-time learner or you have communications experience, this course will teach you <em>what you didn’t know</em> about Media Releases, how to use them, and why many just end up in the trash. </p>  <p><em>Learning these techniques gives you the same media opportunities as well-known companies who use these techniques to guarantee coverage of their stories.</em></p>    <p>Using these skills and tools, you can take your story to the media, in the way you want it told. Using them well will build your reputation and your relationship with your chosen media outlets so they come back to you for expert commentary on other topics on the future.</p><p><strong>Content and Overview</strong></p>  <p><em></em>This course\n reveals the truth about why some Media Releases generate coverage while\n others don’t.<em></em></p>  <p>Starting with what journalists are looking for \nand what the media considers ‘newsworthy’, you’ll have a head start in \nmaking sure your story is strong from the outset.</p>  <p>With these \nfoundations understood, you will then learn the building blocks of good \nMedia Releases and how to structure them using two different templates \nthat news editors respond to.</p>  <p>You’ll work through the \nprocess of building your own Media Releases using practical examples, in\n a step-by-step guided workshop. </p>  <p>You’ll then have the \nopportunity to evaluate your own work using completed examples and a \ndetailed checklist to compare your work against and identify areas of \nimprovement.</p>  <p>After completing the course, you will have a clear \nand practical understanding of how to write a solid Media Release on a \nnewsworthy topic, and guarantee media coverage. You’ll also take away a \npack of course notes and materials that you can come back to again and \nagain for practical advice and continuous polishing of your skills.</p>  <p><em>The end result is that you’ll have the skills\n to successfully build the profile and reputation of your organization \nand your spokesperson (maybe that’s you!). </em><br><strong></strong></p><p><strong>In this course, you will learn: </strong></p>  <ul><li>What makes News and why</li><li>How to identify and create solid media opportunities from within your business</li><li>How to structure a Media Release so that it covers all the bases that will make the media outlets interested in your story</li><li>How to strengthen your story’s pitch or angle</li><li>How to write your Release to make it a compelling story</li><li>The power and purpose of using quotes</li><li>How to write quotes that add credibility and interest to your story and get published!</li><li>The Do’s and Don’ts of writing Media Releases</li><li>What to do with your Media Release once it’s written – to make sure your story <em>gets up</em> rather than getting trashed!</li></ul>                  <p>And much more!</p><strong></strong><p><strong>My commitment to you</strong><br><em></em></p><p><em>I will continue to update this course on a regular basis, adding more content and exercises for your success. </em></p><em>  </em><p><em>I'm always available in the discussions and via private message to answer any questions you have.</em></p><em>  </em><p><em>I've been a journalist, communications coach and media mentor for many years and I know what works. So this course comes with a 30 day money back guarantee. Some people prefer different teaching styles, but I guarantee that what you’ll get from my program will be more than just theory or information. You’ll get practical skills and tools that will enhance your media and communications skills. I've trained thousands of executives and leaders in numerous industries, all over the world and I’m confident that you will build your skills, knowledge and tools for greater success too.  </em></p>", 
    "end_date": null, 
    "title": "Powerful Press Releases: Get your name & story in the media", 
    "price": "40.00", 
    "instructors": "Warren Clarke", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634202_fa8a_4.jpg", 
    "course_url": "https://www.udemy.com/get-quoted-how-to-get-your-name-and-your-story-in-the-media/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T23:41:52Z"
}