{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t <strong>New!!! Everyone who takes the “Professional Self-Publishing: How to Self Publish a Book” course will receive a complimentary 30-minute book consultation approximately 30 days after it has been completed. This call will be recorded over the phone or Skype and made available to you for future reference. You&#039;ll be able to pick his brain about different topics.</strong>\r\n</p>\r\n<hr>\r\n<p>\r\n\t Something like 60 percent of all adult Americans &quot;have a book in them.&quot; And very few things feel better than holding your own book in your hand. Yet, traditional publishers are increasingly choosy about the authors with whom they work. At the same time, a dramatic increase in the number and quality of tools available to would-be authors has caused even many established authors to eschew traditional publishers and do things by themselves--often for much higher royalties. But you don&#039;t want your book to look, well, amateurish.\r\n</p>\r\n<hr>\r\n<p>\r\n\t What to do?\r\n</p>\r\n<p>\r\n\t In this ten-part “How to Professionally Self-Publish a Book&quot; course, six-time author, speaker, and publisher Phil Simon lets you in on secrets on how to professionally publish your own book. He addresses each step in the publishing process, offering his first-hand input and insider advice. He comments on subsidy presses that claim to have authors&#039; interests at heart and explains the different options available to you.\r\n</p>\r\n<p>\r\n\t Phil has been down this road more than a few times. After doing two books with traditional publishers, he started Motion Publishing to produce his next two books--and publish another for a client. (He then returned to traditional publishing for his fifth and sixth books.)\r\n</p>\r\n<p>\r\n\t In short, he knows where the bodies are buried. Learn valuable tips and avoid critical mistakes that can cost you a great deal of time, money, and peace of mind.\r\n</p>\r\n<hr>\r\n<h4>About the Instructor</h4>\r\n\r\n<a class=\"external-link\" href=\"http://www.philsimon.com/\" target=\"_blank\" rel=\"nofollow\">Phil Simon</a> is a frequent keynote speaker and recognized technology authority. He is the award-winning author of six management books, most recently <em>The Visual Organization: Data Visualization, Big Data, and the Quest for Better Decisions</em>. He consults organizations on matters related to strategy, data, and technology. His contributions have been featured on <em>The Harvard Business Review</em>, CNN, <em>Wired</em>, NBC, CNBC, Inc. Magazine, BusinessWeek, The Huffington Post, Fast Company, The <em>New York Times</em>, ReadWriteWeb, and many other sites.", 
    "end_date": null, 
    "title": "Professional Self-Publishing", 
    "price": "40.00", 
    "instructors": "Phil Simon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/14390_0179_15.jpg", 
    "course_url": "https://www.udemy.com/professional-self-publishing/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-02-23T15:21:48Z"
}