{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">No false hopes here. </span><strong style=\"\">Taught by an intellectual property attorney</strong><span style=\"\">, this course will </span><strong style=\"\">walk you through each step of the copyright registration process! </strong><span style=\"\">From setting up a new user account with the US Copyright Office, to </span><strong style=\"\">completing the application</strong><span style=\"\">, to submitting your work - it’s all in here. Other resources dance around the subject without giving you the real </span><strong style=\"\">nuts and bolts</strong><span style=\"\">, but this course covers each step in detail, including tips and tricks along the way.</span>  </p>  <p style=\"\">  \tYou’ve written a <strong style=\"\">book</strong> or <strong style=\"\">article</strong>, recorded a <strong style=\"\">song</strong>, taken some <strong style=\"\">photos</strong>…maybe even written some <strong style=\"\">software</strong>, <strong style=\"\">designed</strong> a <strong style=\"\">website</strong>, or <strong style=\"\">sculpted</strong> a masterpiece. Copyright protection extends to many types of creative works, including books, music, photos, movies, sculptures, videos, graphics, software, screenplays, articles, and compilations of those things. Here’s the thing: What’s the point of <strong style=\"\">creating</strong> content if you’re not going to <strong style=\"\">protect it</strong>? “Yeah,” you’re thinking, “but doesn’t copyright law already protect my work as soon as I reduce it to a tangible form?”  </p>  <p style=\"\">  \t<strong style=\"\">Not the way you think! </strong>  </p>  <p style=\"\">  \t“But shouldn’t I wait until I have something worth selling?” I’m here to tell you that one person’s garbage is another person’s treasure. Remember, even if you believe you’re material is not worth protecting, it doesn’t mean someone else won’t find it valuable (and use it without your permission). Without a copyright registration, you lack some of the most fundamental protections that would otherwise enable you to do something about your stolen work! You can’t sue, you can’t recover statutory damages…you can’t, you can’t, you can’t.  </p>  <p style=\"\">  \t<strong style=\"\">Bottom line:</strong> If you don’t mind having a car with no gas, create a copyright without registering it with the copyright office. However, if you want some juice in the tank to get you where you need to be, submit an application and do it right.  </p>  <p style=\"\">  \tWe’ll start with an overview. Not the type of overview that leaves you more confused than when you started, but the kind that jumps right into the most critical and meaningful information: <strong style=\"\">What</strong> copyright law protects and what it does not. From there we’ll proceed to <strong style=\"\">why</strong> you need to register your copyright with the US Copyright Office. The <strong style=\"\">benefits</strong> you receive when you register your work.  </p>  <p style=\"\">  \tThen we will jump straight into the US Copyright Office website and the electronic filing procedure. We’ll set up a new user account, start an application, and walk through each step of the process.  </p>  <p style=\"\">  \tYou have <strong style=\"\">everything to lose</strong> by NOT taking this course. If you create anything that copyright law is capable of protecting, you <strong style=\"\">NEED</strong> to learn how to <strong style=\"\">secure that protection now!</strong>  </p>", 
    "end_date": null, 
    "title": "Protect Your Creative Works with US Copyright Registration", 
    "price": "50.00", 
    "instructors": "Brock Shinen, Esq.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404148_1bd1_2.jpg", 
    "course_url": "https://www.udemy.com/protect-your-creative-works-with-us-copyright-registration/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T06:23:18Z"
}