{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\"><em style=\"\"><strong style=\"\">One of my biggest fears is not having income if I stopped working... </strong></em><strong style=\"\">If you resonate with this, have limited time, and no experience with writing or self-publishing, this is for you!</strong></span>  </p>  <p style=\"\">  \t<strong style=\"\"> <span style=\"\">   Watch me break down niche Kindle eBook self-publishing step by step. You will be using ghostwriters to create valuable, informative eBooks that sell! Then, you will learn how to scale your business to grow a healthy cash-flowing eBook portfolio.</span></strong>  </p>  <p style=\"\">  \t <span style=\"\"> <strong style=\"\"><em style=\"\">  &quot;Excellent Overview on establishing a Kindle Publishing business:</em></strong></span>  </p>  <p style=\"\">  \t <em style=\"\"> Dan did a great job covering a comprehensive overview on Kindle Publishing as a business model, and how to outsource and scaling it. I am an established publisher, and learned a few things in this course I didn&#039;t know before.</em>  </p>  <p style=\"\">  \t<em style=\"\"> <em style=\"\">  It is geared more toward new publishers, yet I think both experienced and inexperienced writers/publishers can benefit from this course and the ideas it generates.</em> <em style=\"\">  I also appreciate that Dan covers a lot of ground in short and concise videos (some are 2-4 minutes). My time is valuable, and I love the fact that he keeps all the videos on point&quot;</em>- Kate Saunders</em>  </p>  <p style=\"\">  \t<strong style=\"\">Module 1: Introduction to Kindle Publishing Prodigy</strong><strong style=\"\">:</strong> <em style=\"\">Get a 10,000 foot view of the Kindle Publishing Prodigy program + see the backend of my Amazon Kindle eBook portfolio.</em>  </p>  <p style=\"\">  \t <strong style=\"\">Module 2: Niche Selection Strategies:</strong> <span style=\"\"><em style=\"\">In order to sell books, you need to choice a topic that sells. In this section, we will walk you through several of the strategies you can use to determine the niche or topic for each book you publish. Get this right, and the rest comes easy!</em></span>  </p>  <p style=\"\">  \t <span style=\"\"> <strong style=\"\">Module 3: Outsourcing Your Kindle E-Book: </strong><em style=\"\">In this Module, we discuss how to create your first Elance.com job post and how to select your e-book ghostwriter the RIGHT way. members will learn how to design awesome book covers for only $5, learn the 3 pillars of kindle publishing success, discover spy techniques on outsourcing websites, what type of content to put into your e-books and how to organize it, and how to manage your ghostwriter.</em></span>  </p>  <p style=\"\">  \t <span style=\"\"> <strong style=\"\">Module 4: </strong><strong style=\"\">Uploading Your Book to Kindle:</strong> </span><em style=\"\">In this module, you&#039;ll learn step by step how to upload your book to the Kindle Direct Publishing platform and get your book on the Amazon store in under 24 hours.</em>  </p>  <p style=\"\">  \t <span style=\"\"> <strong style=\"\">Module 5: Marketing Tips and Tricks:</strong><em style=\"\"> In this lesson, you&#039;ll learn about how to manage Amazon&#039;s free promo days you are given, how to correctly set up your author page, and some other sneaky tricks to boost your sales!</em></span>  </p>  <p style=\"\">  \t <span style=\"\"> <strong style=\"\"> Module 6: Scaling Your Business:</strong> </span><em style=\"\">In this lesson, we will tie it all together by learning how to diversify and outsource even more so that you can be the owner of your business and focus on scaling your income to your desired goals.</em>  </p>  <p style=\"\">  \t        It will take you a little over an hour and a half to consume the 6 modules and resources within this program. With just 1-2 hours per week, you can practice and implement the strategies and will have your first book published within 2 weeks generating sales. It costs less than $300 to publish each book, but y<em style=\"\">our book CAN pay for itsel</em>f within 1-3 months using these techniques. I look forward to hearing your success stories!  </p>", 
    "end_date": null, 
    "title": "Publishing Prodigy: Outsource and Self Publish Kindle eBooks", 
    "price": "45.00", 
    "instructors": "Dan Schwartz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71378_2b16_9.jpg", 
    "course_url": "https://www.udemy.com/publishingprodigy/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-29T23:11:08Z"
}