{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This isn&#039;t a course about how to write a good book; it&#039;s about everything after that - what you need to know to get your book on its best possible course to readers. The good news is, you have more options than at any other time in history. Bad news? You have so many options that it can get really confusing. This course will help you make a well informed choice about how best to proceed.</p>  <p><strong style=\"\">Plot Your Own Best Path to Publishing Your Book</strong></p><ul style=\"\"><li>Learn about the many publishing options available to you today.</li><li>Learn about all the work that goes into publishing a book.</li><li>Learn about modern revolutions currently underway in publishing and what they mean for you.</li><li>Evaluate the benefits and demands of each publishing option.</li><li>Clarify for yourself what kind of success you&#039;re seeking in publishing.</li><li>Decide what kind of publishing process is the best fit for you.</li></ul>  <p><strong style=\"\">Empower Yourself With the Knowledge You Need to Succeed as an Author</strong></p><p>There was a time when authors could succeed without knowing very much about publishing. That time has passed. We&#039;re in the midst of a great disruption of the publishing industry, and where once there was one path to publishing, now there are many, with new paths being cut through the wilderness all the time.</p>  <p>It&#039;s an exciting time, with many new ways to share what you have to say. But authors can no longer type away in blissful ignorance of the publishing process. You need to come to publishing empowered with knowledge about the process… about the <em style=\"\">many</em> processes that can successfully bring your book to readers.</p>  <p><strong style=\"\">Contents and Overview</strong></p><p>How do publishers decide which books to publish? How can you best pitch your book to publishers? How can you succeed at self-publishing your book? How do editors work with authors, and what do they add to the book? How are books designed? How are they printed, if they are printed? How are e-books created? Where are books warehoused? How are they sold to retailers? How are they distributed? How do books make it onto the shelves of your local bookstore? How do they show up on Amazon and other online retailers? How do book critics find out about books and choose which ones to review? How do bloggers and other influential people end up recommending books to their followers?</p>  <p>In this course, we&#039;ll answer these questions and many more. And we&#039;ll help you clarify for yourself what kind of success you&#039;re seeking and what type of publishing process will be a good fit for you. When you complete the course, you won&#039;t walk away with a one-size-fits-all, step-by-step instruction sheet for publishing. Rather, with a deep understanding of the many possibilities, you&#039;ll have the power to make your own best choices to get your book to your readers.</p>  <p><strong style=\"\">What You Will Not Get Out of This Course</strong></p><p>This is not a course about how to write. The success that this course can help you achieve depends on you writing well, and writing well is not something we teach in this course.</p>  <p>It&#039;s also not a course about how to come up with a good idea for a book, whether “good” means to you “critically acclaimed,” “instant classic,” or “I can now buy my own island and Scarlett Johansson or George Clooney will play me in the movie.” None of what you learn in this course will make a success of a bad book idea. This course may, however, help you assess whether your book idea is likely to be successful.</p>  <p><strong style=\"\">What You Will Get Out of This Course</strong></p><p>What this course offers you is knowledge, and the power to succeed that comes with it: the power to succeed on your own terms, by making a well informed decision about what path to publishing is best suited to you and to your book.</p>  <p>The modern landscape of the publishing industry is vast, complex, and rapidly changing. This course will give you the map and the compass you need to navigate your way through it to the particular kind of success you&#039;re seeking for you and your book. It&#039;s an exhilarating age in which to be a writer. We think you&#039;re going to enjoy the journey.</p>", 
    "end_date": null, 
    "title": "Publishing for Writers I", 
    "price": "20.00", 
    "instructors": "Thomas Bell, Jamie Allen", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455990_46e6.jpg", 
    "course_url": "https://www.udemy.com/publishing-for-writers-i/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T18:29:53Z"
}