{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If a tree falls in the forest and there&#039;s no one around to hear it, does it make a sound? It&#039;s an age-old question.  Now, think of your favorite poet or writer as a tree, and think of your favorite story or poem as a sound.  Aren&#039;t you glad you were around to &quot;hear it fall?&quot;</p><p>If you&#039;re a poet who&#039;s ready to share his or her work with the world, do you know how to make sure there&#039;s someone around to read it?<br style=\"\"></p><p>I&#039;ve learned a lot about the process of creating poetry chapbooks by trial and error over the past twelve years.  I&#039;ve created this course to share what works and what doesn&#039;t work, hopefully helping other poets avoid my most costly mistakes.  </p>  <p>  \t   In this workshop course, I  introduce and demonstrate the steps to creating a poetry chapbook in a three part timeline: preproduction, production, and postproduction.  I break each of those three major parts of the chapbook project timeline into  discussions and demonstrations of both administrative and creative tasks.  I use videos, slides, and supplemental examples to guide students through the workshop.  Students work a their own pace and set their own schedule for completion.  </p>  <p>  \t I work from the standpoint that chapbooks can&#039;t be defined by any one physical characteristic, and electronic chapbooks have just as big a place in my lessons as physical chapbooks.  The secret is in the purpose and in the <em style=\"\">artistic currency</em>.  Want to know more?  Sign up today!  </p>", 
    "end_date": null, 
    "title": "Publish Your Own Poetry Chapbook", 
    "price": "30.00", 
    "instructors": "Amy Lynn Hess", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58584_f2d4_6.jpg", 
    "course_url": "https://www.udemy.com/publish-your-own-poetry-chapbook/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T13:33:05Z"
}