{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">NEW AMAZON PROGRAM LETS YOU</strong> <strong><em class=\"redactor-inline-converted\">GET PAID FOR UPLOADING VIDEOS TO AMAZON</em></strong></p>\n\n<p>Imagine turning your existing YouTube videos, your short tutorials, your online courses, documentaries, indie films, short video clips, music videos (and any other type of video you create) into an ongoing, passive income, and doing it quickly and easily?\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Imagine getting paid by Amazon to upload videos?</em></strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How is this possible?\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Simple, through an exciting and NEW platform called <strong><em class=\"redactor-inline-converted\">Amazon Video Direct</em></strong>, you can now publish your videos on Amazon, one of the largest and most trusted websites in the world.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thanks to Amazon Video Direct, you can now turn your existing or new videos into an ongoing, passive income stream AND drive traffic to your website in the process.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this new course, we’re going to show you how to upload your videos ONCE to Amazon and then enjoy an ongoing, residual income from that point on!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>MASSIVE DISTRIBUTION = PASSIVE INCOME</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Not only could you reach up to 56 million Amazon Prime users on their TV screens, but your reach could even extend to up to 250 million Amazon users, right on the Amazon website itself!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>That’s right, your videos can be listed, right alongside all kinds of other product listings, right on Amazon!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>AMAZON’S MILLION DOLLAR BOUNTY PROGRAM</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>In this course, you’ll discover the <em>4 ways that Amazon pays you</em> for publishing your videos AND, you’ll also learn about the million dollar bonus that Amazon is offering you, just for creating videos!</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In this million dollar bonus program, Amazon is offering 1 million dollars PER MONTH which will be split among the top 100 video producers!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You can rest assured that, if Amazon is putting up 1 million dollars, they want this program to succeed and now you can be part of that success!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>WHAT YOU’LL FIND INSIDE THIS COURSE</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Here’s what you’re going to discover inside this detailed, step-by-step course…\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>The benefits of uploading your videos to Amazon Video Direct</li><li>How to upload your videos, in easy, step-by-step tutorials</li><li>How to easily create thumbnail graphics for your Amazon videos</li><li>How to easily create closed caption files for your Amazon videos</li><li>The correct formats for your videos</li><li>How to easily convert existing videos into the correct formats</li><li>How to make money by using a variety of marketing strategies</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>YOU’RE IN THE RIGHT PLACE, AT THE RIGHT TIME</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You should be very excited that you landed on this page, because you’re at the right place at the right time. \n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You are one of the very first people to even hear about this amazing Amazon program!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you witnessed how many people made (and are continuing to make) big incomes with the Kindle eBook phenomenon, then you just might have a hint at what can happen here – and Amazon is putting up a million dollars to ensure this is more successful than Kindle.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>GET STARTED, TODAY!</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So, don’t let this exciting new business pass you by - this new Amazon Video Direct program will create lots of success stories and we are very excited to bring you the very first (and authoritative) course about Amazon Video Direct, right here!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You’re welcome to preview some of the lectures for free, below and then you’ll be able to enroll with confidence!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Remember, <em>your enrollment is backed by Udemy’s 30-day, 100% money back guarantee, so you have nothing to lose!</em>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Enroll today!</p>", 
    "end_date": null, 
    "title": "Publish Your Video Content with Amazon Video Direct", 
    "price": "20.00", 
    "instructors": "Phil Ebiner, Dave Espino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848412_732c.jpg", 
    "course_url": "https://www.udemy.com/amazon-video-direct-course/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T18:56:56Z"
}