{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Get better at recording speech, dialog and voice overs at home. Without spending a fortune!</strong></p><p><em>This really is a complete guide. Five hours of content!</em></p><p><strong>[Last updated January 2016]</strong><br></p><p>It's easy for anyone to start recording at home with modern affordable equipment. </p><p>But there is a huge problem. Information is spread all over the internet and it's hard to find good advice. There is a lack of awareness of the importance of high quality audio. </p><p>The internet is full of podcasts, videos and courses with awful sound quality. The speech is hard to understand and irritating to the ear. In some cases it's simply unintelligible!</p><p><strong>Improve your technique for recording voice. It's the easiest step to increasing the quality of your product. Yet it is so often neglected!</strong></p><p>Voice overs are often understandable but sound distant, thin or odd. This has a proven negative effect on the perception of your work. <em><strong>To give that premium feel, you need high quality voice recordings.</strong></em></p><p>Follow the simple steps outlined in this course. You will quickly and easily improve your podcast, audiobook, voice overs or videos. In fact, anything that includes spoken word or dialog can be improved without difficulty.</p><p><em></em><em>This will impress your current fans. Attract new customers. Increase sales, downloads or streams.</em></p><p><strong>All you need is a microphone and a stand which can </strong><strong>cost you as little as $40!</strong></p><p><strong><em>What's Inside</em></strong></p><p>You might be asking: what exactly are we going to cover in these lectures? And the answer is pretty much everything you need to know from square one:</p><ul><li>Microphone Basics</li><li>The Human Voice</li><li>Mic Choice</li><li>Mic Placement</li><li>Recording Techniques</li><li>Room Acoustics</li><li>Acoustic Treatment</li><li>Sound Isolation</li><li>The Recording Process</li><li>DAWs and Software</li><li>Editing</li><li>Mixing </li><li>Compression</li><li>EQ</li><li>Noise Removal</li><li>and more!</li></ul><span></span><p>The course is split in to 6 easy to follow sections. It would only take you a few hours to speed through the lectures, but I advise you go through no more than two sections per sitting. There are tasks set out for you that you need to complete between sections so you'll need a bit of time before moving on.</p><p>I highly recommend that you take notes during the course. This will help you to remember the key points. </p><p>However, to make sure you don't forget anything that you learn I have created an awesome <strong>cheat sheet</strong> for you to print off and put on the wall or keep near your recording station! This sheet covers the most valuable content from this course and condenses it in to a simple two page summary.</p><p><strong>CERTIFICATION:</strong> Throughout the course you will be assessed. When you pass you will be awarded with a certificate accredit by Home Studio Centre Ltd.</p><p><strong><em>PLUS: Get personal feedback from me within seconds and get access to a private members Facebook group!</em></strong></p><p>If you have any questions while taking the course, just leave a comment on the lecture. Or contact me at rob@homestudiocenter.com as quickly as possible. As soon as I get a notification I will reply.</p><p>There is also a private VIP facebook group where you can talk to myself and your peers and post videos or audio to get feedback.</p><p>If you have any suggestions for the course I will do my best to accommodate them.</p><p><strong>We have a lot to cover so let's get started, you can't waste another second!</strong></p><p><strong><em>FAQs:</em></strong></p><ul><li><em>When does the course start and finish?</em></li></ul><p>The course starts now and never ends! It is a completely self-paced online course - you decide when you start and when you finish.</p><ul><li><em>How long do I have access to the course?</em></li></ul><p>How does lifetime access sound? After enrolling, you have unlimited access to this course for as long as you like - across any and all devices you own.</p><ul><li><em>What if I am unhappy with the course?</em></li></ul><p>I would never want you to be unhappy! If you are unsatisfied with your purchase, contact me in the first 30 days and I will give you a full refund.</p><ul><li><em>I've never recorded to my computer before. Can I still take this course?</em></li></ul>Yes, definitely! You will learn the basics of sound recording before moving on to advanced recording and processing techniques.<ul><li><em>Is audio for video covered?</em></li></ul><p>If your video is recorded in a controlled environment (not outdoors or in a noisy environment) and includes speech or dialog then this course is perfect for you! I use the techniques in this course to record the audio for all of my talking head videos.</p>", 
    "end_date": null, 
    "title": "Record Voice Over Like A Pro - The Complete Guide", 
    "price": "25.00", 
    "instructors": "Rob Mayzes", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540090_c68f_2.jpg", 
    "course_url": "https://www.udemy.com/record-voice-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T10:29:23Z"
}