{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Attract Agents, Editors, and Readers</strong><br style=\"\">  </p>  <p style=\"\">  \tAre you a writer struggling to get a literary agent or editor excited about your novel? Are you a self-publishing author who can&#039;t afford the high costs of hiring a freelance novel editor? This course is for you!  </p>  <p style=\"\">  \t   Editing is the key to becoming a successful novelist. Anyone can churn out the first draft of a novel, but not everyone understands how to polish and shine that first draft into something literary agents, editors, and readers will get excited about!  </p>  <p style=\"\">  \t<strong style=\"\">Tailored Lectures and Advice</strong>  </p>  <p style=\"\">  \t  As the instructor, I will be available to answer questions daily, usually within a few hours. So you never have to worry about getting stuck.  </p>  <p style=\"\">  \tPlus, this course will be constantly in development. New lectures will be added as students pose questions and need extra help. The more students who sign up, the more time I will have to spend on creating new content.  </p>  <p style=\"\">  \t<strong style=\"\">Save Money</strong><br style=\"\">  </p>  <p style=\"\">  \t   Hiring a professional freelance novel editor costs between $800 and $3,000 for a full length book, and if you don&#039;t learn how to edit your own novel, you will pay this fee for each and every novel you have professionally edited. With this course, you will have lifetime access, so you can use it over and over again with each of your novels for no extra charge.  </p>  <p style=\"\">  \t Students will also get a 10% discount for life on all of my professional novel editing services.  </p>  <p style=\"\">  \t<strong style=\"\">Achieve Your Publishing Dreams</strong>  </p>  <p style=\"\">  \t   Blow your competitors out of the water, gain new readers, or finally impress that agent you&#039;ve had your eye on! Join the course and improve your writing and editing skills today!  </p>", 
    "end_date": null, 
    "title": "Revise and Edit Your Own Novel", 
    "price": "20.00", 
    "instructors": "Ellen Brock", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75172_b23e_5.jpg", 
    "course_url": "https://www.udemy.com/revise-and-edit-your-own-novel/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-07T13:37:35Z"
}