{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tMy name is David Titcher. After attending UCLA Film School, where I was part of the most successful screenwriting class in the history of the film business, I've been a professional screenwriter for thirty years. </p><p>I've written film screenplays for “Around the World in 80 Days,” with Jackie Chan and Arnold Schwarzenegger, and for “Morgan Stewart's Coming Home,” with Jon Cryer and Lynn Redgrave. I created the Librarian franchise with Noah Wyle and Bob Newhart that's led to three TV movies and which got me nominated for a Writers Guild of America Award and a Saturn Award and has since been turned into a TV Series, \"The Librarians,” which was the highest rated TV Series premiere for all cable in 2014. I am a Writer, Executive Producer, and Co-Creator of FOX's new TV Series, \"Houdini &amp; Doyle.\" I wrote the miniseries “The Curse of King Tut's Tomb” featuring Malcolm McDowell and Hallmark's last Valentine Day's movie, “Be My Valentine” which starred Billy Baldwin. I wrote for sitcoms like “Who’s The Boss,” “Punky Brewster,” and “The Love Boat,” as well as for various Disney animated series. I’ve sold scripts and pitches in every possible genre and medium, including high-budget feature films, low budget films, TV sitcoms, TV dramas, TV movies, TV miniseries, and animation. I’ve worked for practically every studio and network.  </p>  <p>  \t          I'm going to take you on a journey in writing to hopefully expand your process and your career. This course will take you through screenwriting from premise to outline to script and finally to the business and selling that script. It is perfect for any screenwriter, from those trying to breakout to those with a career trying to improve their work.</p>  <p>  \t        The course is broken down into the sections above and is primarily video lectures and PDFs. You will take it at your own pace and should be able to complete the roughly 2 hours of material within a week or two. The best way to take this course would be to work on a screenplay during it and completing each section as you advance.  </p>", 
    "end_date": null, 
    "title": "Screenwriting 101: Writing for Film & Television", 
    "price": "40.00", 
    "instructors": "David Titcher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138800_05ca_3.jpg", 
    "course_url": "https://www.udemy.com/screenwriting101/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-28T07:27:06Z"
}