{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Scripting In Scrivener</em></strong> shows you how to use the outstandingly good and powerful writing software Scrivener to outline, plan, structure and write film and video scripts effectively and easily.</p>\n\n<p>The course starts by taking you through the essential components of Scrivener, with a focus on how to use the ones most targeted at structured writing.</p>\n\n\n\n\n\n<p>Everything in the course is based on personal experience and usage of Scrivener over several years as a documentary film director. </p><p>The challenge in documentary film is bringing many disparate elements together into a coherent and powerful narrative story. </p><p>Scrivener excels at helping the process of organising each stage of the writing process, while getting out of the way when required.</p>\n\n\n\n\n\n<p>In the course, I show you exactly how I do it with my films, using real examples, and exercises to make sure you've understood each key stage and concept. </p><p>Along the way, I teach insights I've gained in film scripting and writing and show you exactly how Scrivener works best for me through screencast videos of the Scrivener interface.</p>\n\n\n\n\n\n<p>Though principally aimed at those writing film and video scripts, anyone writing pieces involving different plot lines and character elements or complex pieces can benefit from taking this course.</p>", 
    "end_date": null, 
    "title": "Scripting In Scrivener", 
    "price": "25.00", 
    "instructors": "Paul Jenkins", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850576_32ed_10.jpg", 
    "course_url": "https://www.udemy.com/scripting-in-scrivener/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T11:21:11Z"
}