{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>(This course covers both Windows and Mac versions of Scrivener.)</p><p>Do you want to know how to use Scrivener to fulfill your writing dreams? Well Scrivener is not nearly as hard to learn as you have been lead to believe. I highly recommend binge watching the first four hours so that you have a good understanding of what Scrivener is capable of.</p><p>The first section will take you on a complete walkthrough of how Scrivener works with plenty of real examples, a thorough explanation of the regions of the user interface and arrows pointing directly at the buttons mentioned in the transcript making it easy to find them.</p><p>Once you know the basics you can go back, dig in to the Scrivener features that suit your writing style best and start creating your awesome content. If you forget how to use a Scrivener feature you can pop back and watch its clearly labeled lecture again.</p><p>Once your project is underway you can go on to investigate some really cool Scrivener features that you don't necessarily need — but are fun to use — like customizing your work spaces, importing from mind map software or backing up and storing your projects to Dropbox in the cloud.</p><p>Here's what an early reviewer had to say:</p><p>Melinda Kraft — <em>\"I learned several new things that are already helping me to make my project better organized and efficient and has given me some ideas on how I can be more creative in the process. I've watched a lot of online training videos, and Karen's is among the best. She clearly illustrates the differences between Windows and Mac versions. And where she elects to save information for later in the course, or leave it out altogether, she tells you why. Highly recommended!\"</em></p><p><em></em></p>", 
    "end_date": null, 
    "title": "Scrivener | Full Course on How to Write a Book in Scrivener", 
    "price": "40.00", 
    "instructors": "Karen Prince", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/575308_96fb_5.jpg", 
    "course_url": "https://www.udemy.com/scrivener-everything-you-need-to-know-from-idea-to-launch/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-06T04:23:43Z"
}