{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>(Covering both the Windows and the Mac versions of Scrivener)</p>\n\n<p>In this course for self-published authors I am going to show you how to format your own eBook in Scrivener ready to upload it to each of the major online stores.</p>\n\n\n\n\n\n\n\n\n\n<p>If you know the very basics of Scrivener you will be able to follow these simple, step-by-step instructions to help you produce a professional quality ebook that meets the requirements of major ebook retailers.</p>\n\n\n\n\n\n\n\n\n\n<p>Even if you plan to hire out the formatting of your books, it is important for every author to at least know how to do it, incase you ever want to make a simple change or update to your book after publishing — like adding links to your new books or website.</p>\n\n\n\n\n\n\n\n\n\n<p>You don't want to wait days for someone else to schedule you in and charge you for each minor update.</p>\n\n\n\n\n\n\n\n\n\n<p>First we're going to go over the specifications for the book cover images that you have to provide for display on the catalogue page on your retailer's website as well as for your internal ebook cover.</p>\n\n\n\n\n\n\n\n\n\n<p>Then I'm going to take you step by step through the process of formatting specifically for ebooks — which is somewhat different from formatting for output as a physical document. </p>\n\n\n\n\n\n\n\n\n\n<p>You'll learn how to generate a clickable table of contents and how to insert external links to your important places online like your other books and your website. </p>\n\n\n\n\n\n\n\n\n\n<p>I'll also cover best practices for inserting images so that your file size does not exceed the limit imposed by some of the retailers.</p>\n\n\n\n\n\n\n\n\n\n<p>Once your Scrivener document is nicely formatted I'll show you how to convert it to an ebook using Scrivener’s Compile menu.</p>\n\n\n\n\n\n\n\n\n\n<p>Then I'll show you how to download Amazon Kindle Previewer and preview your .mobi file and Adobe Digital Editions to preview your .epub file before you upload them to any of the online stores.</p>\n\n\n\n\n\n\n\n\n\n<p>If you're ready to format and convert your own manuscript into an eBook right inside your Scrivener software, go ahead and sign up and I will walk you through the entire process step by step so that you end up with a great eBook — but if you want to check out my teaching style before you decide, feel free to watch a couple of the free previews in the curriculum outline below.</p>", 
    "end_date": null, 
    "title": "Scrivener | Compiling Your eBook for Export in Scrivener", 
    "price": "20.00", 
    "instructors": "Karen Prince", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/829924_567b.jpg", 
    "course_url": "https://www.udemy.com/scrivener-compiling-your-ebook-for-export-in-scrivener/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T10:51:28Z"
}