{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn How To Self-Publish Your Book Using Createspace</strong> </p><p> <em> Do you dream of being able to actually hold your own book in your hands? Are you concerned about the costs involved or just don't know how to go about it?</em></p><p><em></em>Self-publishing is becoming increasingly popular not just for digital books but also hard copies too. However, if you look at the self-published books on Amazon, you'll notice that the majority are not available as a paperback copy. </p><p>Why is that?<br><em></em> </p> <ul><li>Formatting a book for print is just too difficult and time consuming.</li><li>If you have images it is impossible to optimize them without expensive software.</li></ul> <p>Those were my concerns too but I wasn't going to let that stop me! </p><p>I've developed my own quick way of converting kindle books to a format acceptable by Createspace (a free print on demand platform). Images can be optimized if you know how using free software.</p><p>This course is designed to help you quickly convert any digital book to a format that can be uploaded to Createspace. <strong>I Will Show You Everything You Need To Know To Finally Hold Your Own Book In Your Hands:</strong> </p><ul><li>Quickly convert your digital book to the correct format using my template</li><li>How to optimize your book size and layout for maximum royalties</li><li>How to deal with images and obtain the 300 dpi resolution required</li><li>How to remove any potential issues <em>before</em> uploading to Createspace</li><li>The best format to upload to Createspace</li><li>How to use the Createspace platform to publish your book</li><li>How to create your cover and save it as a PDF using free tools</li><li>How to price your book</li><li>How to link your kindle book to the paperback copy</li><li>...and much more!</li></ul><strong>Watch Over My Shoulder As I Convert One of My Kindle Books To Createspace. </strong><strong></strong><p>See in real time how to deal with any issues that arise. </p><p>If I make a mistake or things go wrong you'll get to see it and what I do to quickly sort it out! It's all on video to make this a realistic learning experience for you.</p><p><strong>P.S. Click on \"Take This Course\" now to start publishing your own paperback book.</strong><br></p>", 
    "end_date": null, 
    "title": "Self-Publish Paperback Books With Images Using Createspace", 
    "price": "20.00", 
    "instructors": "Kay Franklin", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620142_5652.jpg", 
    "course_url": "https://www.udemy.com/self-publish-paperback-books-with-images-using-createspace/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T09:12:21Z"
}