{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><p style=\"\">Although  Kindle ebook publishing is all the rage these days (and for good reason),  paperback books will absolutely never go out of style.&nbsp; In fact, many paperback books listed at  Amazon.com outsell their ebook counterparts by a margin of 2 to 1.&nbsp; </p>    <p style=\"\">And thanks  to print-on-demand publishing via CreateSpace, it has never been easier than  right now to get published!&nbsp; In fact, it  can take as little as 60 minutes to publish an existing manuscript for free as  a paperback book to Amazon...even if you&#039;ve never done it before.&nbsp; You simply need to know how to format and  submit your manuscript correctly, and you can be making sales at Amazon in as  little as 24 hours.</p>    <p style=\"\">In this “Self Publishing on Amazon: Learn  How to Self Publish “course I will show you how to potentially double your  Kindle ebook royalties by publishing the very same manuscript to CreateSpace as  a print-on-demand paperback via CreateSpace.com.&nbsp; You&#039;ll enjoy dozens of studio-quality videos,  audios, pdf guides, and even a cut and paste formatting template inside this self  publishing on Amazon course at a very low introductory price. Invest today and you&#039;ll receive a  6-video bonus course on how to get your book listed Page 1 of Google!</p>    <p style=\"\">Take this Self Publishing on Amazon course  now and learn how to self publish on Amazon the most easy way!</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Self Publishing Secrets", 
    "price": "45.00", 
    "instructors": "Jay Boyer", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28124_8d95_8.jpg", 
    "course_url": "https://www.udemy.com/self-publishing-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-29T19:36:33Z"
}