{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Take a few moments to think about what life would be like when you escape the rat race. What will you be doing? How will you be spending your time? What have you always dreamt of doing if only you had the time and financial freedom to do it?  </p>  <p>  \t  This course teaches you how to write and publish books and ebooks. You will learn about Lulu Publishing's 'Print On Demand' service, Amazon's CreateSpace 'Print On Demand' service, and Amazon's 'Kindle Direct Publishing' service, so that you can generate an income that continues to get paid into your bank account or PayPal account long after you finished working on the books and ebooks that are continuing to work for you. You will get paid whether you are on a holiday, sleeping, enjoying your free time, or whatever else you choose to be doing.  </p>  <p>  \t    You will learn:  </p>  <ul>  \t<li>How to create your own professional looking book covers</li>  \t<li>How to create book titles that get more sales</li>  \t<li>How to find niche topics to write about to increase sales</li>  \t<li>How to price your books and ebooks</li>  \t<li>How to market your book to boost sales and exposure</li>  \t<li>How to make money off of the back of your books</li>  </ul>  <p>  \t    This course is made up of a series of video lectures which guide you through various stages of publishing. The course can be watched through in about 6 hours, but to do the course properly should take longer. To get the most from this course it is recommended that you write a book as you go through the various lectures, even if it is a short ebook. You can then use this book to follow along to the various stages you are guided through, so you can use the 'deciding what the write' stage to develop an idea for a book, and then the writing stages to write the book, and then follow the publishing stages to publish the book, and then at the end of the course you will have published a book or ebook and will hopefully be on track to begin to earn income straight from the end of the course.  </p>  <p>  \t    The course is structured into a logical sequence, taking you from developing the initial ideas for what to write about, through content creation, to developing your print book and ebook and then marketing the book and making money off of the back of your book.  </p>  <p>  \t<strong>Why Take This Course?</strong>  </p>  <p>  \t    So why should you take this course, compared to other courses available? With this course I share with you my process of coming up with ideas for books, through to publishing the books and making money from the books. I teach you exactly what you need to know, and teach you each stage. I don't say things like 'then create a cover' and expect you to figure out how you would create a cover, I tell you how you can create a cover. I take you through all of the stages showing you exactly what to do.  </p>  <p>  \t    I share everything all in one place, I don't try to make money out of you by telling you to take my writing course about writing your manuscript, or take my cover creation course to create your cover. I teach it all here. You get everything you need and can apply it all straight away and be on the road to making money from self-publishing by the end of the course. You will only need to take this one course to know how to generate a passive income, to know how to give yourself more time to do what you would rather be spending your life doing, and to be making money whether you are working hard in front of a computer, lying back on a warm tropical beach, or trekking up a mountain. The money you make will be coming in whatever you are doing, and wherever you are in the World.  </p>  <p>  \t    Imagine being able to live anywhere. With a residual, or passive income if you want to move, you don't have to worry about finding a new job, or taking time off work to move, you have income coming in the whole time. If you decide to spend six months living on a beach relaxing, you don't have to worry about needing to be earning money, with passive income work you have already done will be still paying you each month into your bank account or PayPal account, and that money will be waiting for you when you need it.  </p>  <p>  \t    When you complete this course and publish your book or ebook I look forward to seeing the book or ebook you have created mentioned in your review of this course so that others can see what can be created, and I also enjoy checking out what people are writing and what books and ebooks I can recommend to others.  </p>", 
    "end_date": null, 
    "title": "Self Publishing Made Easy", 
    "price": "30.00", 
    "instructors": "Daniel Jones", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64082_d056_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-passive-online-income-writing-books-ebooks/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-06T07:07:34Z"
}