{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em></em><strong></strong></p><p><strong>مقدمة</strong>:<br></p><p>تعتبر هذه الدورة الاولى من نوعها عربياً آلية العمل على اعداد ادارة الاعلام الاجتماعى الجديد وفريق العمل القائم بعملية ادارة المحتوى الرقمى لصفحات التواصل الاجتماعى على اختلاف انواعها ومنها (الفيسبوك Facebook- تويتر Twitter- لينكدان LinkedIn- جوجل بلس Google+ - يوتيوب Youtube- بنترست Pinterest- انستجرام Instagram - فليكر  Flicker- الواتسآب Whatsapp    –السنابشات Snapchat- ...الخ )<br>وتغطى الدورة الكثير من الأفكار والإرشادات والنصائح التي قد تفتح أبواب جديدة لكل من يتعامل مع شبكات التواصل الإجتماعي في كيفية التعامل معها وزيادة عدد المعجبين والمتابعين، وتطوير الخطط والإستراتيجيات الخاصة بمواقع التواصل الإجتماعي على المستوى المؤسسى داخل بيئة العمل أو على المستوى الشخصى، وذلك من خلال أسلوب الشرح المبسط والسهل، ويمكن مشاهدة مقاطع هذه الدورة باستخدام الكمبيوتر المحمول، أو الكمبيوتر المكتبي، أو التابلت أو الهاتف الخلوي (الجوال). وتتكون هذه الدورة من 21 مقطع فيديو، بحيث لا يزيد المقطع الواحد على 15 دقيقة مما سيسهل حضور هذه المقاطع بحسب توفر الوقت لديك.</p>اهداف الدورة:<br>1- التعرف على 28 طريقة يمكن خلالها إدارة صفحات التواصل الإجتماعي بشكل أفضل وبالتالي الحصول على عدد أكبر من المتابعين والمعجبين.<br>2- التعرف على 21 طريقة لزيادة أعداد المتابعين والمعجبين والاصدفاء بصفحات الشركات والمؤسسات.<br>3- التعرف على 9 طرق للتسويق لصفحات التواصل الإجتماعي من خارج صفحات شبكات التواصل الإجتماعي .<br>مزايا الدورة:<p>1- الحصول على شهادة اتمام حضور البرنامج، حيث امكانية طباعة الشهادة بصيغة pdf  أو  jpg .<br></p>2- ارفاق تلك الشهادة فى ملفك الشخصى مع السيرة الذاتية.<br>3- توافر شرائح عرض  Presentationدعامة للمحاضرات.<br>3- اتاحة الفرصة للتدريب الالكترونى غير التزامنى والبداية للحصول على دورات فى مجال اهتمامك.<br>3- طريقة للدخول فى دورة متقدمة والمتخصصة فى ادارة الحملات التسويقية عبر شبكات التواصل الاجتماعى، حيث يكون شرط <p>أساسى للحصول عليها هو اجتيازك الدورة الاساسية.</p><p>4- الحصول على عروض تقديمية وتحميلها بالقسم 5 محاضرة 10 والقسم 6 محاضرة 15 والقسم 7 محاضرة 17</p>تعليمات حضور الدورة:<br>1- استكمال البرنامج بشكل كامل.<br>2- اجتياز الاسئلة والاختبارات القصيرة التى تقيس فهمك للبرنامج.<br>4-  يفضل التسجيل لاسمك باللغة الانجليزية لاصدار الشهادة بهذا الاسم فقط.<br>5-  يفضل اضافة التقييم على المحاضر او المدرب.<br>6- فى نهاية البرنامج يفضل اعطاء تقييم شامل على البرنامج ككل باستخدام النجوم.<br>7 اضافة تعليق وابداء رأيك أو الدخول فى مناقشة بخصوص الدورة ومحاورة والاقترحات والملاحظات والرؤية المسقبلية فى برامج اخرى للمدرب.<p>8- يفضل الاستماع الى المحاضرات اكثر من مرة.</p><p>9- بعد الانتهاء من سماع المحاضرة او قراءة الشرائح ضرورة وضع علامة  الصح كدليل على الانتهاء من المحاضرة او القسم.</p><p>10- يفضل تحضير ورقة وقلم اثناء الاستماع الى المحاضرات لتسجيل ملاحظاتك اولا باول</p><p><br></p><p>فى نهاية الدورة وعند اصدار الشهادة يمكنك عمل مشاركة بالشهادة على الفيس بوك او توتير لاعلام الاخرين بالدورة  </p><p>خالص تحياتى</p><p><span></span></p>", 
    "end_date": null, 
    "title": "Social Media Marketing & Management", 
    "price": "25.00", 
    "instructors": "Mesk Academy, Dr. Essam M. Obaid", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606110_0bb5.jpg", 
    "course_url": "https://www.udemy.com/socialmedia_dressamobaid/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T17:20:56Z"
}