{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    Hey guys! My name is Ben Cooper, and I&rsquo;m a full-time songwriter here in Nashville, Tennessee. Whenever I tell people what I do for a living, I often get a response like, &ldquo;Wow, writing songs is such a mystery to me.&rdquo; Maybe you&rsquo;ve thought about writing a song or have come up with an idea that would make a good song. Who knows, you might have already written tons of songs and are just looking to come back to some of the basics.  </p>  <p style=\"\">  \t    Whatever the case, this course is specifically designed to equip you with a working knowledge and understanding of the craft of songwriting.  </p>  <p style=\"\">  \t    In this first course, we&rsquo;ll focus on de-mystifying the process of constructing a song. We&rsquo;ll begin with questions like &ldquo;What is the purpose or goal of a song?&rdquo; and &ldquo;How do a lyric, hook and melody work together?&rdquo; Don&rsquo;t worry if you don&rsquo;t yet play an instrument&hellip; I&rsquo;ll be giving a quick piano and guitar lesson to get you started. We&#039;ll also be looking at the importance of the opening line and what to do if you get stuck starting the second verse.  </p>  <p style=\"\">  \t    In the end, my hope is that you&rsquo;ll feel confident of your ability to take an idea and develop it into a complete song. I&rsquo;m excited about this course, and I hope you&rsquo;ll join me!  </p>  <p style=\"\">  \t   This course, primarily taught through informal video discussions, will encourage the participation of its viewers by finding specific examples in popular music of each segment topic. This course contains about two hours of viewing time, with the option to participate in composing an original song based on the information discussed. As the instructor, I will be monitoring the discussion weekly and improving upon the course as necessary.  </p>", 
    "end_date": null, 
    "title": "Songwriting - From Idea to Finished Song", 
    "price": "20.00", 
    "instructors": "Ben Cooper", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/115622_7781_6.jpg", 
    "course_url": "https://www.udemy.com/songwriting/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-05T17:20:51Z"
}