{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Have you ever wanted to learn how to make money online? Or did you want to have an internet based business? Perhaps you just want another income stream?  Well whatever it is, this is your opportunity.  if you want to tap into the lucrative world of making money online, then look no further than Webinars.</p><p>Webinars are among the top 12 strategies used by all Internet Marketers and among the top 5 most successful.</p><p>The opportunity in this industry is huge, there are so many untapped markets, this making it simple to break into almost any niche market, what more anybody can do it.</p><p>This course covers the basics how webinars can be used to promote knowledge, products and services, all while making money.</p><p>Once you have your webinar setup and marketed all you need to do is sit back and let the cash roll in.  Some internet Marketers are making hundreds if not tens of thousands of dollars per webinar and the best part about it, it's all passive income,</p><p>This introductory course is less than 1 hour and is structured in 4 parts, plus a Bonuses.<br style=\"\"></p><p>If you are interested in spending more time with your family, making money online, generating a passive income, perhaps you just want another source of income to help ay bills or buy a new car, whatever the case this course is for you.</p><p>We've helped hundreds of people find their success online by setting their webinars up for them with our Done for You Webinars course, we've made the mistakes so now we can streamline it for others.  You to will have an opportunity, if you want it that is.</p><p>The course is bought to you FREE by webinarcoach Michael Thandi, all you need to invest is some time, what have you got to lose?  You can only gain.  So what are you waiting for?  The course is FREE and you have nothing to lose. Sign up today!</p>", 
    "end_date": null, 
    "title": "Start a Fulfilling Online Career by Setting Up Webinars", 
    "price": 0, 
    "instructors": "Michael Thandi", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438250_0665_2.jpg", 
    "course_url": "https://www.udemy.com/make-money-online-with-webinars/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T03:27:41Z"
}