{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>FOR NONFICTION AUTHORS</strong></p>\n\n<p><strong>Watch the First Five Lectures for Free</strong><br><strong></strong></p><p>More than 3,000 students enrolled.<strong></strong></p>\n\n<p><strong>Kathryn Kistner said, <em>\"Engaging Non-fiction Writing Technique -- This course has some really \ngood ideas to make a potentially dry (non-fiction) topic into something \nas memorable as fun fiction.  \n\n&gt;&gt;He goes into depth to suggest how to recall or create the ideas \nthat will make your book, tutorial, or course memorable and engaging.  \n\n&gt;&gt;The production quality was good. The instructor was easy to \nunderstand. Great ideas.\"</em><br></strong></p>\n\n<p><strong> - Create a book readers rave about to others.</strong></p>\n\n<p><strong> - Get lots of reviews without having to ask.</strong></p>\n\n<p><strong> - 'Word of mouth' is the best form of advertising there is.</strong><br><strong></strong></p>\n\n<p>What is it the top echelon best-sellers have?</p>\n\n<p>Dale Carnegie provided the answer in his book, The Quick And Easy Way To Effective Speaking. He said that all the key points of How to Win Friends and Influence People could be written down on two sheets of paper. The other more than two hundred pages were filled with stories and anecdotes.</p>\n\n<p>Look at any of the top best-sellers. I don't mean the ones that sell well for a short time. I mean the ones that have withstood the test of time. You will find they are all filled with stories.</p>\n\n<p>Are these stories just added to increase the page count? Absolutely not.</p>\n\n<p><strong>Stories are one of the most persuasive forms of communication known to mankind.</strong></p>\n\n<p>If you produce a book just containing facts, you will end up with a sort of textbook. Facts are dry and most readers don't like textbooks. I hated textbooks at school.</p>\n\n<p><strong>Stories bring facts to life and allow them to effortlessly enter the mind.</strong></p>\n\n<p>The lessons I remembered most at school were the ones where we were told stories. I always remember the story about the Vikings. I learned more about them in this lesson than in all the textbooks I had read.</p>\n\n<p>I have had my share of best-sellers on Amazon. However, I used to look in awe at the best-selling books at the top of the tree. Titles like Mindset, The Gifts of Imperfection, Influence, and How to Win Friends and Influence People. These books continue to outsell most others, year after year. They have thousands of reviews and people recommend others to buy them. What if I could do that?<br></p><p>I concluded that these books sell well because of 'word of mouth'. What made all these books great is that they teach and persuade readers by way of stories.</p>\n\n<p>Although I haven't produced a book that ranks alongside How to Win Friends and Influence People, the books I have used stories in have generated a lot of sales. Not only that, reviews poured in where readers have said how much they enjoyed reading.<br></p>\n\n<p><strong>If done correctly, stories allow you to...</strong></p>\n\n<p> - Teach in a way where readers will understand and remember better.</p>\n\n<p> - Demonstrate any idea, method, step, or anything you want.</p>\n\n<p> - Warn readers so they take notice.</p>\n\n<p> - Persuade people to do what you want them to.</p>\n\n<p> - Get readers to believe, like, and trust you.</p>\n\n<p><strong>In this course, you will discover...</strong></p>\n\n<p><strong></strong> - Why stories are the best thing to use in your nonfiction books.</p>\n\n<p> - How to use stories to teach.</p>\n\n<p> - How to use stories to demonstrate.</p>\n\n<p> - How to use stories to warn.</p>\n\n<p> - How to use stories to persuade.</p>\n\n<p> - How to use stories to get readers to believe what you say and trust you.</p>\n\n<p> - The easiest way to come up with a huge list of stories you can use in your books.</p>\n\n<p> - The easiest way to write them.</p>\n\n<p> - A technique for giving your readers that 'Ah Ha' moment.</p><p><strong>Watch the First Five Lectures for Free</strong><br></p>\n\n<p><strong>Enroll now and write nonfiction books readers rave about to others.</strong><br></p>", 
    "end_date": null, 
    "title": "Story - The Key to Writing a Best-Selling Nonfiction Book", 
    "price": "20.00", 
    "instructors": "Ian Stables", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681824_b610_6.jpg", 
    "course_url": "https://www.udemy.com/authors-nugget-creates-best-sellers/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T19:07:27Z"
}