{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Watch the First Three Lectures for Free</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">More than 1,700 students enrolled.<br></strong></p><p><strong class=\"redactor-inline-converted\"></strong><em>Jean Lurssen said, \"Very good, comprehensive and sound advice. The course is well paced. I \nstayed glued to each lecture, because each one is filled with lots of \ngreat tips that make great sense. I've been wanting to create a kindle \nbook for some time, but didn't know exactly what was required, or what \nwould make one sell. I feel I know a lot more now.\"</em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">If you have, or plan to have, a non-fiction book on Amazon, you need this information.</strong></p>\n\n<p>My\n name is Ian Stables, author of more than fifty Kindle books. I have had\n several best-sellers. One book remained a best-seller for over two \nyears, without any further marketing  or promotion.</p>\n\n<p><strong class=\"redactor-inline-converted\">I have \ndiscovered what makes certain books outsell others. It's what makes a \nnon-fiction book a best-seller and keeps it selling without any further \npromotion. In this course, I an going to reveal how you can do the same.</strong><br></p>\n\n<p>When\n you optimize your book a certain way, it will get the most possible \nsales. This will ensure your book remains in the best-sellers without \nany further marketing.</p>\n\n<p><strong class=\"redactor-inline-converted\">I am not teaching that you shouldn't use promotion. I am going to show you how to make your book continue to sell after your marketing campaign ends.</strong><br></p>\n\n<p>After you run a promotion, you usually get a spike\n in sales. This is because it is high up in the best-seller category. \nVery quickly, the sales drop and the book disappears.</p>\n\n<p>Other books remain in the best-sellers, despite no marketing or promotion. Why does their book stay there and yours doesn't?</p>\n\n<p>The\n answer is that their book has three parts optimized for sales. This \nmeans their book continues to sell well, pushing your book down and out \nof the best-sellers.</p>\n\n<p><strong class=\"redactor-inline-converted\">After three years, I discovered how to \noptimize these three areas. The result is that your book continues to \nsell and stays in the best-sellers. No further promotion needed.</strong></p>\n\n<p>I\n had a book that had no further promotion. It continued to outsell every\n other book I published for more than two years. I studied it to find out \nwhy. I also looked closely at other best-sellers to see what they did.</p>\n\n<p><strong class=\"redactor-inline-converted\">I discovered that \nthere were three areas which were set up a certain way. This was why \nthese books remained in the best-sellers.</strong></p>\n\n<p>In this course, I am \ngoing to teach you how to optimize your book for sales. When done this \nway, you well get the best possible sales results. No further promotion \nrequired. Just a simple campaign to get initial sales and then you don't\n need to do any more. Eventually, sales will naturally slump. In that case, just run a new promotion to bump it up again.</p><p><strong>Watch the First Three Lectures for Free</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Enroll now and optimize your non-fiction book so it CONTINUES TO SELL.</strong><br></p>", 
    "end_date": null, 
    "title": "The Top Three Things That Sell Most Kindle Nonfiction Books", 
    "price": "20.00", 
    "instructors": "Ian Stables", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/669060_3a12_3.jpg", 
    "course_url": "https://www.udemy.com/what-i-found-sells-kindle-nonfiction-books-no-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-13T20:10:21Z"
}