{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Too many courses focus on the technical side of video and photography. It is important, but just one aspect of running a video and photography company. I&#039;ve learned the hard way that taking a great video or a great photo doesn’t mean automatic success. You have to develop skills that often aren’t taught in video and photography classes things like:  </p>  <p>  \t  Getting assembling gear kits – Camera, lenses, and accessories – Introduce some camera’s and gear that you can use to assemble your first kit  </p>  <p>  \t  Getting a logo – A logo is important for your brand and is one of the pillars for your marketing on-line and offline  </p>  <p>  \t  Getting a website - If you&#039;re serious about showcasing your work and services you are going to need a website to showcase your presence on-line. This lecture will introduce you to the technology I use, where I host, and how I manage the website.  </p>  <p>  \t  Developing a portfolio - When you are starting out you are going to invest time producing great videos and photo&#039;s to showcase to future clients. How do you get started and how do you go about it  </p>  <p>  \t  Investing in yourself – video and photo skills - Resources and tip to develop your video skills and education to a professional level  </p>  <p>  \t  Social media – Facebook, Pininterest, Youtube  </p>  <p>  \t  Getting your first sales  </p>  <p>  \t  Networking  </p>  <p>  \t  Pricing  </p>  <p>  \t  Negotiation  </p>  <p>  \t  Game day – preparation &amp; shotlist  </p>  <p>  \t  Course Summary  </p>  <p>  \t  This course is designed to fill the gap and arm you with the information and skills you need to start running your video and photography company. I&#039;ve structured the course so it is logical beginning with the basics and progressing to skills you&#039;ll need to learn as you get customers and deliver your products to them. I also introduce a different business model for earning an income with your videos for those that are not comfortable with networking and meeting new people.  </p>  <p>  \t  I’ve created this course because I’ve been through the struggles to figure out how to run a video business and want to pass on what I learned. My hope is by taking this course you can save a lot of the time, money, and effort it took me to figure out what I’ve learned so far.  </p>", 
    "end_date": null, 
    "title": "The Business of Video and Photography", 
    "price": "30.00", 
    "instructors": "Greg Hung", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328100_1c8b_3.jpg", 
    "course_url": "https://www.udemy.com/videophotobiz/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T12:39:50Z"
}