{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>I’ve been studying how successful broadcasters have been delivering their\nscopes since the early days of Periscope. These people aren’t winging it.\nThey are following a very specific formula that allows them to connect with\ntheir viewers, deliver their message, and get their audience to take action.\n</p><p>Want to know how it’s done?\n</p><p>I created this course to share everything that I’ve learned and implemented\nfor successfully delivering scopes that make an impact on your audience.\nMany of the formulas and scripts that I teach in the course are the result of\nresearching and analyzing hundreds of hours of the most popular\nbroadcasts on Periscope. </p><p>Here’s what you’ll learn in this course:</p><p>●  How to prepare for your scopes before you turn the camera on,</p><p><span></span>●  How to write compelling scope descriptions that make viewers eager to\n\n\t\t\t\t\t\t\t\twatch,</p><p><span></span>●  How to create the perfect 4­-part introduction </p><p><span></span>●  The transition script that will boost your number of live viewers and followers </p><p><span></span>●  5 effective templates for structuring the main content of your scope,\n\n\t\t\t\t\t\t\t\tand</p><p><span></span>●  The essential 3-Part \"power wrap-up\" that will help you establish rapport with your viewers and drive traffic to your website, email list, or other social media channels. </p><p><span></span>●  Plus all of my best tips and strategies for delivering Periscope broadcasts like a pro. </p>", 
    "end_date": null, 
    "title": "The Periscope Business Marketing Formula", 
    "price": "20.00", 
    "instructors": "Krystal Wascher", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695850_82ea.jpg", 
    "course_url": "https://www.udemy.com/the-periscope-business-marketing-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T19:14:23Z"
}