{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tiPads are everywhere, touching off a revolution of innovative books being published as apps—book apps that take advantage of the iPad&#039;s multi-touch interface and multimedia capabilities.  </p>  <p style=\"\">  \tIn this course, you&#039;ll become familiar with specific book apps in  different categories, and learn how these apps are pushing the boundaries of  the medium.  </p>  <p style=\"\">  \tWe will NOT be discussing plain text titles available on the Kindle,  Nook, &amp; other platforms. Instead we&#039;ll focus on multimedia, interactive  books that are released as individual apps, such as London: A City Through Time  (available in the iTunes store for iPads).  </p>  <p style=\"\">  \tIn each section of the course you&#039;ll watch video demos of particular  interactive book apps, read several interesting articles and discuss everything  in the class forums. There is a total of about 8-10 hours of work, which you  can do at your own pace, with perpetual access.  </p>  <p style=\"\">  \tWe&#039;ll have discussions about the future of the book as a medium.  </p>  <p style=\"\">  \t●  What do these  changes mean for readers, libraries, authors, and publishers?  </p>  <p style=\"\">  \t●  What are the  qualities of a delightful reading experience?  </p>  <p style=\"\">  \t●  How are these apps  enabling learning and which features and qualities enable a the best experience  for readers?  </p>  <p style=\"\">  \tA resource guide is included, with links to recommended book apps,  additional readings, publishers to watch and blogs to follow.  </p>", 
    "end_date": null, 
    "title": "The Book as iPad App", 
    "price": "50.00", 
    "instructors": "Nicole Hennig", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27896_6310_3.jpg", 
    "course_url": "https://www.udemy.com/bookapps/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-26T19:38:24Z"
}