{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>You are able to make a living creating content online. Anybody who tells you you can't is wrong.</strong> Many people believe they aren't able to do this because:</p><ol><li>They don't think they can create a good story</li><li>They don't think they can keep people coming back</li><li>They don't think they can keep their content relevant</li><li>They don't think they can make enough money to keep going.</li></ol><span></span><p>Most people don't know how to does these things, and don't do the research to increase the likelihood of their success. They go straight into it and start wondering why their content isn't sticking. There are many aspects to succeeding with animation on the web, <strong>but it is not impossible.</strong></p><p>This course provides you with a blueprint to this success, from conception to distribution, so that you can become a name in the online animation world.</p><p>I have complied a variety of tips that have been proven to work in the digital space, from large companies to small teams. While <strong>many aspects of the course may seem common</strong>, there are <strong>thousands of people who fail to use them</strong>. <em>And this is why they are effective.</em> You can see these tactics being used all over social media and across the internet by your favourite creators, producers and companies.</p><p><strong>Want proof? </strong>My friend Braydon, more commonly known as <strong>BMS</strong>, has already built a semi-successful YouTube channel, with more animated content in the works. He currently boasts <strong>44,000+ subscribers</strong> and <strong>7 million video views</strong>, using only a small amount of techniques I've included in the course. Imagine they success if you use all the information I've provided?</p><p>This course will cover four key aspects to success:</p><ol><li>How to construct an effective animation or animated series</li><li>How to build your brand across social media</li><li>How to make the most of the YouTube platform</li><li>How to make money with multiple streams of income</li></ol><span></span><span></span><p>Whether you're a newbie thinking about working your way into online animation, or you're an experienced producer looking to fill the gaps in your knowledge, I guarantee that you will come out of this course having learnt at least one thing.</p><p><strong>I will respond to any questions you may have</strong> personally as you go through the course, so don't worry if you don't think you will be able to apply this information in your own situation. </p><p>Sign up now!</p>", 
    "end_date": null, 
    "title": "The Keys To Building An Online Animation Business", 
    "price": "20.00", 
    "instructors": "Matthew Winter", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555868_869b_3.jpg", 
    "course_url": "https://www.udemy.com/onlineanimation/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-16T01:46:06Z"
}