{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><p style=\"\">My lawyers cringed when I told them I was making this training available!</p>  <p style=\"\">&quot;Why are you doing this to us?&quot; they said.</p>  <p style=\"\">  </p><p style=\"\"><strong style=\"\">Insider Secrets Revealed! What do the big Hollywood producers know that you don’t? How to option and purchase scripts!</strong></p>  <p style=\"\">  </p><p style=\"\">Years of working knowledge is now at your fingertips!</p>  <p style=\"\">  </p><p style=\"\">Dear Friend,</p>  <p style=\"\">  </p><p style=\"\">My name is David Basulto. I am a filmmaker in Los Angeles, and the creator of <strong style=\"\">FilmSchoolOnDemand.</strong>&nbsp;I live and breathe filmmaking. One of the first things I learned in this town was the golden rule: <strong style=\"\">he who owns the gold makes the rules!</strong></p>  <p style=\"\">  </p><p style=\"\">The most important thing for a producer to have is a great script. The script is everything. Its the foundation to which you will build your entire career on. With a powerful script in your pocket the floodgates of attaching talent and finding money are at your finger tips!</p>  <p style=\"\">  </p><p style=\"\">But you better own the rights to that screenplay. I don&#039;t know how many times I’ve heard producer friends saying &quot;well he was a friend of mine&quot; and &quot;we had a handshake deal&quot; but when money was on the table that handshake deal meant nothing!</p>  <p style=\"\">  </p><p style=\"\">After receiving many e-mails from listeners of my podcast Filmmaking Central.com telling me how they been no the proper way to acquire the rights of a screenplay or they just didn’t have enough money.</p>  <p style=\"\">  </p><p style=\"\">And let’s face it legal fees in this business can be astronomical. Believe me I know I’ve paid for them.&nbsp; When I first started out I relied on my lawyers negotiate everything for me at $500-$600 an hour it really started to add up.</p>  <p style=\"\">  </p><p style=\"\">That’s when I really started to look into the contracts they were doing and seeing a lot of them were just boilerplate and they’re filling in the blanks. From that point on I started negotiating my own screenplay options and purchases Using an option agreement that cost me well over $4000.</p>  <p style=\"\">  </p><p style=\"\">As a filmmaker who is made movies as low as $10,000 I know there is no room in the budget to afford an attorney to negotiate and secure the rights for you. But guess what you don’t need them! Why? Because it’s all here for you now in video format ready for you to soak it all in</p>  <p style=\"\">  </p><p style=\"\"><strong style=\"\"><em style=\"\">&nbsp;Introducing my &nbsp;training:</em></strong></p>  <p style=\"\">  </p><p style=\"\"><strong style=\"\">The Producers Guide to screenplay options and purchases</strong></p>  <p style=\"\">  </p><p style=\"\"><em style=\"\">&nbsp;what’s inside?</em></p>  <p style=\"\">Seven videos consisting of:</p>  <p style=\"\">Video 1 - Intro and List Building 5:35</p>  <p style=\"\">Video 2 - Genres 11:05</p>  <p style=\"\">Video 3 - Formats 6:06</p>  <p style=\"\">Video 4 - The Option Deal 16:54</p>  <p style=\"\">Video 5 - The Purchase Deal 6:18</p>  <p style=\"\">Video 6 - The Option Overview 23:08</p>  <p style=\"\">Video 7 - Place to Find Screenplays Cheap 11:59</p>  <p style=\"\">  </p><p style=\"\"><em style=\"\">Class PDF</em></p>  <p style=\"\">A PDF copy of the Keynote I used to make the videos. Lines added for notes.</p>  <p style=\"\">  </p><p style=\"\"><em style=\"\">Option Docs</em></p>  <p style=\"\">1 Copy of the Option Agreement in Word format</p>  <p style=\"\">1 Copy of the Option Agreement in Pages format</p>  <p style=\"\">  </p><p style=\"\">Armed with all this knowledge you’ll be able to negotiate and secure the rights for the screenplay of your choice. With all the rights secure you can march into any agency or financiers office feeling secure that you&nbsp; are in control of the project.</p>  <p style=\"\">  </p><p style=\"\">I know, all this information would cost thousands for a lawyer to explain BUT....</p>  <p style=\"\">  </p><p style=\"\">I am not a lawyer! I am a seasoned film producer! So....</p>  <p style=\"\">  </p><p style=\"\">I want you to have this for a price of just $47!</p>  <p style=\"\">  </p><p style=\"\">Yes just $47 Not $4700 or even $470!</p>  <p style=\"\">  </p><p style=\"\">This training will literally save you thousands of dollars!</p>  <p style=\"\">  </p><p style=\"\">So Grab it today before the price goes up!</p>  <p style=\"\">  </p><p style=\"\">  </p><p style=\"\">  </p><p style=\"\">PS Buy this now and start looking for the perfect script for your next production!</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "The Producers Guide to Screenplay Options and Purchases", 
    "price": "20.00", 
    "instructors": "Dave Basulto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29451_8751_3.jpg", 
    "course_url": "https://www.udemy.com/the-producers-guide-to-screenplay-options-and-purchases/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-13T01:10:12Z"
}