{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is not sponsored by of affiliated with Udemy, Inc.</p><p>Learn the Top 10 Udemy Course Creation Tips that Paul Jenkins and Steve Rosenbaum credit for taking them each from Udemy Newbies to #1 Instructors in their categories, in this fast-paced, content-rich, <em><strong>totally free must have course</strong></em>.</p>\n\n<p>6 months ago, neither Paul not Steve were instructors on Udemy. Today, they have combined to reach several thousand students in over 100 countries.</p>\n\n<p>\"Udemy is the perfect platform to help you build Fame, Fortune and Fun by doing and teaching others the things you're passionate about,\" says Steve Rosenbaum.</p>\n\n<p>\"It's ideal for anybody that wants to create extra income, help others, and meet and connect with like-minded people all around the world,\" add Paul Jenkins.</p>\n\n<p>Despite being more than 5000 miles apart, and coming from 2 completely different industry, Udemy has brought Paul and Steve together to demonstrate to you exactly how you can quickly expand your influence.</p>\n\n<p><strong><em>Who is Udemy Course Creation for?</em></strong></p>\n\n<p><em><strong>If you have never produced a Udemy Course:</strong></em> You will love how this course cuts through clutter and highlights exactly what you need to know to turn out the highest quality courses with ease. There are scores of courses on Udemy about how to create courses, but none that so cleverly cuts through the minutia and so quickly and effectively teaches you the important production and marketing skills that will help you launch your success on Udemy.</p>\n\n<p><strong><em>If you have created Udemy Courses:</em></strong> You will love how this course focuses on the high level production and marketing tips that will help you get the most reward for your effort. Paul and Steve produced this course together in less than 24 hours. Their goal is to show you exactly how you can do it to.</p>\n\n<p><strong><em>Others that will benefit from this course:</em></strong></p>\n\n<ul><li>Business People</li><li>Entrepreneurs</li><li>Second Act Seekers</li><li>Udemy Speakers</li><li>Authors</li><li>Bloggers</li><li>Website Owners</li><li><em>Many, Many, Many, More...</em></li></ul>\n\n<p>Enroll in Udemy Course Creation now <em><strong>(did we mention that it's absolutely free?)</strong></em>. Invest just 1 hour now to watch the lectures and review all the tips so that you can immediately start and improve your Udemy Course Creation.</p>", 
    "end_date": null, 
    "title": "Udemy Course Creation: Fast Track Course Creation - Unofficial", 
    "price": 0, 
    "instructors": "Paul Jenkins, Steve Rosenbaum", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592074_b849_2.jpg", 
    "course_url": "https://www.udemy.com/udemy-course-creation-fast-track/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T18:18:25Z"
}