{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p> “This course is not sponsored or affiliated with Udemy, Inc.” .<br></p><p>This course is about saving time, frustration and heartache when producing a Udemy course. Foe anyone who has already created a course on Udemy, you know what I'm talking about. </p>\n\n<p>The key is to be organised, to understand all the different facets of producing a course, the planning the course structure, what to include and almost more importantly what to exclude. Then you need to decide on the presentation formats - is it all talking head, maybe screen capture, white board animation or a mixture of all of these. Once the decision is made, what hardware and software is needed.</p>\n\n\n\n<p>Then there are the files. Every course generates many many files and many are pretty bloated.</p>\n\n\n\n<p>So how can a mind map help? Well when it comes to a visual representation of lots and lots of information - with a single access point - then mind mapping is king.</p>\n\n<p>What is also very cool is that students will not only learn how to mind map but will also get a crash course in an awesome piece of free software. The crash course could be a Udemy course on it's own but here it's bundled into the complete dashboard course.</p>\n\n<p>Whilst the course is geared around creating a dashboard for the creation of a Udemy course (because it fits so well) but actually the dashboard can be used for any video production or a production of any kind where you need all the information at your fingertips.</p>\n\n<p>Students will be amazed by how amazing mind mapping can be for organisation and productivity... no more searching for the elusive file you created last week - or that great web link that you forgot to bookmark.</p>\n\n<p>The course is short and sharp ... back to back it could be completed in a few hours. I would suggest you take it a little slower and try out on your own copy of Xmind each of the stages of the course.</p>\n\n<p>You will need no prerequisite skills, just a computer or device to do the course, a bit of imagination and a yearning for learning.</p>\n\n<p>Enjoy... </p>", 
    "end_date": null, 
    "title": "Udemy course production at speed with dashboards -Unofficial", 
    "price": "20.00", 
    "instructors": "Colin Holding", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733902_44ee_2.jpg", 
    "course_url": "https://www.udemy.com/half-udemy-course-production-time-with-an-mind-map-dashboard/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T09:58:45Z"
}