{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>From start-up to successful, this video course will provide you with the knowledge and professional practices you need to become successful, make more money and take your career to the next level in video production. This course is designed to help you generate new leads, land clients and pitch ideas that will keep them hiring you again and again. You’ll learn what you need in your professional kit, how to present yourself effectively as a video professional, how to quote clients and more.<br></p>\n\n<p>This course is designed for people who are interested in building a career in video production as a freelancer or as a business owner.<br></p>\n\n<p><strong>This course is for:</strong></p>\n\n<ul><li>Entrepreneurial-minded people</li><li>People who dont want to limit their income with a salary job</li><li>People who like freedom, fast growth and a challenging and rewarding lifestyle</li><li> Freelance videographers who want to have a successful career in video production</li><li>Videographers looking to work with their ideal clients and learn how to land them</li><li>Videographers looking to make more money and quote properly</li><li>People who want to sell themselves</li><li>Film graduates looking to start their own video production company or become a   successful freelancer</li><li>Anyone who feels stuck in video and wants another production companies advice</li><li>Anyone looking to save hours of time and money by learning from our experience in video</li><li>Anyone who’s unsure of what industry to focus on and what types of clients they should be attracting</li><li>Anyone who’s ready to brand themselves effectively</li><li>Anyone who’s unsure of where to spend their money</li></ul>\n\n<p><strong>This course is NOT for:</strong></p>\n\n<ul><li>Companies that are already established</li><li>Actors, make up artists, or other similar fields</li><li>People looking to get paid salary from a production company</li><li>People looking to join the union</li></ul>\n\n<p><strong>About the Instructor:</strong></p>\n\n<p>Alli Saunders started her video career as freelance videographer and now runs an established video production company in Toronto, Canada where she produces corporate and commercial projects. She has an education from Humber College’s Film and TV Production program, several years experience working in the radio broadcasting industry and a diploma in marketing. With the talents gained from her professional background she understands the value in connecting with people and how to build strong, lasting client relationships.</p>\n\n<p><strong>What are the requirements?</strong></p>\n\n<ul><li>Basic knowledge of video production</li><li>The ability to want to learn</li><li>Willingness to succeed</li><li>Not afraid of risk for reward</li></ul>", 
    "end_date": null, 
    "title": "Video Production Business Tips: Freelance or Company", 
    "price": "20.00", 
    "instructors": "OVC Masters", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703972_f00b_5.jpg", 
    "course_url": "https://www.udemy.com/video-production-success-101-the-business-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T17:24:42Z"
}