{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t      Mes a mes trabajamos duro por conseguir el dinero que necesitamos, sin embargo en muy poco tiempo nos quedamos con nada o muy poco dinero. Los bancos se han convertido en grandes expendedores de dinero, y actualmente conseguir una tarjeta de cr&eacute;dito, comprar con financiamiento o adquirir una deuda es muy f&aacute;cil. Algunas personas han logrado buenas cosas con la ayuda de los bancos pero la mayor&iacute;a tienen dificultades para pagar esas deudas que jam&aacute;s se imaginaron se convertir&iacute;an en un serio problema.  </p>  <p style=\"\">  \t      Este curso recopila la experiencia de alguien que adquiri&oacute; deuda para avanzar en la vida y poner su propia empresa enfrentando los problemas que las deudas dan y la experiencia de un ex trabajador de una agencia de cobro que conoci&oacute; el otro lado de la moneda y los trucos que bancos y agencias de cobro usan para cobrar.  </p>  <p style=\"\">  \t      Este curso no es una receta m&aacute;gica para hacer que la deuda desaparezca, es una serie de consejos que te permitir&aacute;n negociar una deuda y lograr un trato justo.  </p>  <p style=\"\">  \t      Este curso est&aacute; basado en el libro &quot;Viva libre y tome el control de su dinero&quot; el cual como bono de regalo est&aacute; en versi&oacute;n PDF descargable.  </p>  <p style=\"\">  \t     &iquest;Quieres m&aacute;s? &iexcl;Vis&iacute;tanos en <a href=\"javascript:void(0)\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">facebook.com/industriaimagina</a> y danos like!  </p>", 
    "end_date": null, 
    "title": "Viva libre y tome el control de su dinero", 
    "price": "20.00", 
    "instructors": "Profesor [24]7", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/133960_3072_6.jpg", 
    "course_url": "https://www.udemy.com/viva-libre-y-tome-el-control-de-su-dinero/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-15T15:12:42Z"
}