{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    Have you ever wondered how it can be that your best friend, your colleague, or your competition all receive RAVES after their radio interview with great back-end results - but an interview doesn&#039;t seem to do a darn thing for you when you get on air?  </p>  <p>  \t    Well, the short answer to that question is...  </p>  <p>  \t    Proper media training.  </p>  <p>  \t    Here&#039;s the scoop. It&#039;s not <em>who</em> you are that is wrong. The truth is that you have a unique point-of-view and background that influences everything from your business, your clients, how listeners respond, and how an audience responds to the way you deliver your message.  </p>  <p>  \t    But let me make one thing clear.  </p>  <p>  \t    This does NOT mean that because when you do not know how to get on the big/right radio shows it will always be your destiny. What it means is that you can learn how to correctly and easily approach radio stations, appear professional, while having the correct training ready for the moment they say &quot;<em><u>yes</u></em>&quot; and invite you to the radio show, as well as specific details to be who you authentically and create a SYNERGY WITH your message that the audience will HEAR and RESPOND TO.  </p>  <p>  \t    Suddenly life is much easier and you&#039;re no longer swimming upstream! Now you&#039;re getting booked on a lot of shows while your service, practice, book, modality and personality is out in the world <em>faster than you ever thought possible</em>.  When you take the time to be properly shown what is needed and expected in the industry - now you are the best match to be scheduled over and over again on radio anytime – now you&#039;re a natural.  </p>  <p>  \t    If this excites you, then I invite you to join me in this 3-part audio course. Yes it&#039;s true in three short sessions you will have what&#039;s needed to launch yourself to the world in a big way.  </p>  <ul>  \t<li><strong>Radio Bootcamp:  &quot;<u>3 Proven Secrets to      Discover How to Get on Radio and Be Exquisite on Air&quot; <em>Teleseminar</em></u></strong></li>  </ul>  <table>  <tbody>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  </tbody>  </table>  <ul>  \t<li>Are you an entrepreneur, business owner, speaker,      coach, author or consultant who is serious and ready to take your business      to the next level?</li>  \t<li>Adding radio guest interviews is the best low or      no-cost ways to gain massive visibility to ideal markets.</li>  \t<li>Are you a spiritually aware professional who wants to      make more of a difference in the world?</li>  \t<li>Have you been following your passions because you know      you have gifts that can change people&#039;s lives... and yet you&#039;re not      reaching enough of your market?</li>  \t<li>Do you wonder how you can effectively bring your voice      to the right people who want and need what you have to share?</li>  \t<li>This program shares the effective use of radio      broadcasting and how exactly to do it.  This is a must for you to      attend NOW!</li>  </ul>  <table>  <tbody>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  <tr>  \t<td>  \t\t<br>  \t</td>  </tr>  </tbody>  </table>  <p>  \t    As a broadcaster and popular interview guest, I&#039;m often asked how interviews can be leveraged as a great marketing tool for your business. In fact, that is one of the points we will discuss in my 3-week mentorship class:<strong> &quot;<u>3 Proven Secrets to Discover How to Get on Radio and Be Exquisite on Air&quot;</u></strong> For many people it is a great dilemma and wonderful professionals have no idea how to get on and handle an interview (you can&#039;t know what you don&#039;t know!).  The truth is that today, interviews are one of the best low to no cost ways to position yourself as an expert, sell your products and programs, and introduce yourself to new markets all over the world!  </p>", 
    "end_date": null, 
    "title": "Want to be Interviewed on Radio? BeTerrificOn-Air. BROADCAST", 
    "price": "50.00", 
    "instructors": "Debbi Dachinger", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311042_4781_5.jpg", 
    "course_url": "https://www.udemy.com/be-interviewed-on-radio-broadcast-media-be-radio-savvy/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T19:35:11Z"
}