{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Today videos are the most important asset if you want to make business online. Videos are an amazing viral tool in social networks and the most powerful tool when it comes to market products and services.</p><p>Moreover video products and video tutorials are the most sold items on the Internet.</p><p> If you were in the old days you needed a huge budget to setup a video recording studio or to hire a media company to do the job for you.</p><p>In this course you will learn how to design and produce your videos, how to market them and how to setup your marketing process with videos.</p><p>You will be able to produce videos for your marketing, videos as products to sell on CDs and DVDs, videos as part of eLearning products or online video tutorials, streamning videos and much more.<br></p><p>In details, in this course you will learn:</p><ul><li>How to structure a <strong>marketing videos</strong> to promote products or services on the Internet</li><li>How to create <strong>video products</strong> as video courses, physical products and streaming videos</li><li>How to create online courses</li><li>How to register or capture a video</li><li>How to use <strong>Techsmith Camtasia</strong> to capture, edit and produce your videos</li><li>How to use <strong>Microsoft PowerPoint</strong> to generate animated presentations and generate videos</li><li>How to use <strong>Flowplayer </strong>and other services to generate video player for your websites</li><li>How to create web pages with videos</li><li>How to show videos on webpages on overlay or as background</li></ul><p>Moreover you will have an overview of all the hardware, software and equipment that you need to have to start producing your videos and become a web video producer<br></p>", 
    "end_date": null, 
    "title": "Web Video Editing and Production (Camtasia, PPT, Audacity)", 
    "price": "20.00", 
    "instructors": "Daniele Protti", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533104_2db7.jpg", 
    "course_url": "https://www.udemy.com/become-a-web-video-producer-and-publisher-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T20:12:00Z"
}