{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   How would you like to share your story, skills and knowledge across the globe, get credibility and create passive income for the rest of your life?  </p>  <p style=\"\">  \t   This is possible for YOU; you just need to package your story, skills and knowledge into a book!  </p>  <p style=\"\">  \t    There are countless benefits to being an Author - from receiving regular cash flow to your bank account, to getting paid for speaking gigs and consulting, TV and radio appearances, the opportunities are endless&hellip;  </p>  <p style=\"\">  \t   This course is designed to help you write, create, edit, design, publish and promote your book by bestselling author Katrina Starzhynskaya as well as get it endorsed by celebrities just the way Katrina has done it!  </p>  <p style=\"\">  \t <strong style=\"\">This Course Will Teach You Everything You Need To Know To </strong>write, create, edit, design, publish, promote and market your book.  </p>  <p style=\"\">  \t   You will learn:  </p>  <li style=\"\">A powerful way to overcome any initial discomfort you might feel about putting yourself out there as an author, speaker, book promoter or talk show guest. </li>  <li style=\"\">Creating catchy title and subtitle.</li>  <li style=\"\">How to structure your book so it&rsquo;s the best possible book it can be and people tell their friends about it. </li>  <li style=\"\">Some of the pros and cons between traditional publishing and self-publishing. </li>  <li style=\"\">5 ways writing a book will change your life. </li>  <li style=\"\">Key insights into how the publishing and book marketing game really works. </li>  <li style=\"\">The Marketing Strategies I Used To Earn Over $11, 564 In Amazon Royalties In a Single Month.</li>  <li style=\"\">How To Save Thousands of Dollars on Cover Designs, Interior designs, Professional Editing, Formatting and Publishing Your  Books.</li>  <li style=\"\">Two keys to turning radio and TV interviews into sales.</li>  <li style=\"\">Why becoming a bestseller is no longer about luck - it&rsquo;s all about having a plan. </li>  <li style=\"\">How to get celebrities to endorse your book for FREE!</li>   ...and much more!", 
    "end_date": null, 
    "title": "Write, Design, Publish and Promote Your Book ", 
    "price": "20.00", 
    "instructors": "Katrina STARZHYNSKAYA", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/105978_99b3_12.jpg", 
    "course_url": "https://www.udemy.com/write-design-publish-and-promote-your-book/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-15T03:05:18Z"
}