{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t     I have spent thousands of dollars learning how to write books, publish and use publicity to market my books. Now it is time for me to transfer what I have learned to others. Too many people have a passion to write a book, but never get it done because they don&#039;t have the plan of action and concrete skills they need. That is why I developed this course. My passion is to help aspiring authors to finally get their book done and get it into the hands readers who need the wisdom they have to offer.  </p>  <p>  \t     This course is designed for individuals who desire to write a book and get it published. In this comprehensive 3.5 hour course we will cover:  </p>  <ul style=\"\">  \t<li>How to get an agent</li>  \t<li>How to write a query letter</li>  \t<li>How to write a book proposal</li>  \t<li>Choosing which publishing approach is right for you</li>  \t<li>How to use a focus group to help you write your book quickly</li>  \t<li>Developing a platform and marketing plan to sell books</li>  \t<li>Creative ways to market your book</li>  \t<li>How to use media publicity to market your book</li>  \t<li>How to pitch the media for interviews</li>  \t<li>Creative ways to sell your book</li>  </ul>  <p>  \t       This course includes 13 videos and keynote slides.  </p>  <p>  \t       If you have a passion to write a book but need someone to guide you through the process and give a clear plan of action how to finally get your book done, this course is for you.  </p>", 
    "end_date": null, 
    "title": "Write, Publish and Sell Your Book With Lightning Speed", 
    "price": "20.00", 
    "instructors": "Lisa Gibson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249050_b866_3.jpg", 
    "course_url": "https://www.udemy.com/write-publish-and-sell-your-book-with-lightning-speed/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T00:19:38Z"
}