{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \tExisten multitud de <strong style=\"\">programas</strong> informáticos de <strong style=\"\">código abierto</strong> y <strong style=\"\">gratuitos</strong>, que al no contar detrás con una gran empresa que se lucre con su difusión, simplemente se mantienen como desconocidos para la gran mayoría de la gente.  </p>  <p>  \tVista esta situación, así como las circunstancias de la actual crisis, que hace que cualquier euro ahorrado sea bienvenido, he querido ayudar a difundir estas estupendas herramientas cuyo mayor problema supone, en muchos casos y sobre todo para el mundo de habla hispana, la dificultad para formarse en su manejo, ya que el material existente para ello es pobre o está en inglés.  </p>  <p>  \tEn este curso aprenderás a utilizar las herramientas básicas del procesador de textos <strong style=\"\">Writer</strong>, de la suite de ofimática gratuita de código abierto <strong style=\"\">Apache OpenOffice</strong>, rival más que respetable de la mucho más conocida y cara <strong style=\"\">Microsoft Office</strong>. Cuando termines el curso <strong style=\"\">podrás escribir en tu curriculum “Word – nivel usuario” </strong>sin mentir en absoluto, ya que <strong style=\"\">cuando sabes utilizar el programa Writer, automáticamente sabes usar también su equivalente de Office, Word, ya que son tremendamente similares, tanto en funciones como en manejo. </strong>  </p>  <p>  \tTambién hay que reseñar que el Software Libre es cada vez más utilizado, especialmente en administraciones públicas, con lo que su conocimiento específico puede ser un valor añadido en muchas ocasiones.  </p>  <p>  \t<strong style=\"\">Atrévete con el Software Libre!!</strong>  </p>", 
    "end_date": null, 
    "title": "Writer - Nivel Básico", 
    "price": "20.00", 
    "instructors": "Esther Mora Oliver", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/193750_4391_3.jpg", 
    "course_url": "https://www.udemy.com/writer-nivel-basico/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-04T11:11:40Z"
}