{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Watch the First Five Lectures for Free<br></strong></em></p><p><strong class=\"redactor-inline-converted\"></strong><em>More than two thousand one hundred students have enrolled in this course.</em><br></p>\n\n<p><strong class=\"redactor-inline-converted\">How would you feel if you could write your nonfiction books following simple quick steps?</strong> Not only that, but end up with a quality book?<em class=\"redactor-inline-converted\"><br></em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This is something you've probably never seen before.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>No long outlining process.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>No long agonizing writing marathons.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>No long editing sessions at the end.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Each step includes everything a quality nonfiction book should have.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This is a game changer for many authors.</strong> You'll see this for yourself when you use this process.</p>\n\n<p>==================================================================================\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Some of the reviews</strong>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>William Burnett</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Ian provides a simple and effective method to reduce the \nmountain of information you want to convey into mole hills that are \neasily and swiftly surmounted.\"</em>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Ellie Hud\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>“<em class=\"redactor-inline-converted\">I loved the Kindle\n\"Write In Steps\" book and read it from start to finish. And\nthen I discovered the \"Write In Steps\" Udemy course and\njumped on it. We all know that being taught through visuals is a step\nabove the written word and this held true for this course. I highly\nrecommend it to anyone just starting out as a writer but also to\nseasoned writers as well. The content and the delivery of it was done\nin a folksy, engaging manner. The instructor is encouraging every\nstep of the way. By time you finish this course you will be psyched\nto start a new book without delay!!!!”</em>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Roger Burgina</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">\"I've just completed the course and I realized how simple \nthe process of writing a book can be, when it's divided into small baby \nsteps. Every video is a well-structured information that is easy to \ncomprehend. \n\nWhat I like most in this video presentation is that the author did a \ngood job providing examples for each step in the process. \n\nI highly recommend this great tutorial to anyone who is interested in \nthe subject!\"</em></p>\n\n<p>James R. Steele</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"Precise and without any frills or jargon. I am extremely satisfied with the training and recommend this course to any aspirant writer of non-fiction. I will refer back to this course regularly to keep me on-track until my writing habit has formed.\"</em></p>\n\n\n\n<p>Caroline Muchendu</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"This course is just what I needed to get my thoughts together, to help me expound on them and to help me get past a writers block. I was skeptical but now I'm glad I signed on. I feel much more confident and energized to carry on with my writing. Thank You Ian.\"</em></p>\n\n\n\n<p>Morgan Norma Roche</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"A very clear, straightforward presentation. The instructor has some great ideas that make a seemingly daunting task - writing a book - feel doable. What I really love about it is, the way the course is created means I'm writing my book as I'm doing the course, which stops me procrastinating!\"</em></p>\n\n\n\n<p>Prim Groover</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"The course is very informative. The way the instructor has broken down the material into subgroups makes it very easy to follow as he speaks.\"</em></p>\n\n\n\n<p>Robin Slee</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"If you have a great book idea in the back of your mind, or need to produce structured documentation in a fast and efficient way then this course will help you realize your goals. Exploiting the non-linear workflow by using a mind-map Ian has compiled an easy to follow process, which addresses every step that you need to follow in order to write your first or next book in minimal time. There are some 'golden-moments' in this course, that will make you want to start writing immediately! Excellent job Ian, I thoroughly enjoyed it. Kind Regards, Robin.\"</em></p>\n\n\n\n<p>Vic Daly</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">\"I found Ian’s “Write IN Steps” very informative. I also have his Kindle version of this course. The money I consider well spent.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>==================================================================================</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Ian Stables, author of more than fifty Kindle books. I am going to reveal to you the 'Write In Steps' method. It's the easiest way to write non-fiction books. It's a system I developed over the years. It makes it so simple, ANYBODY can do it. Just follow the simple steps.</p>\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">NEW BONUS VIDEO ADDED OCTOBER 12TH 2015:</strong></em> The Little Books Method - Make Big Books Easy To Write<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">THREE NEW BONUS VIDEOS ADDED SEPTEMBER 30TH 2015:</strong></em> How to Write Your Entire Book in a Mind-map.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You know how it feels to write a book. You are anxious to complete the outline so you can start to write your book. I was the same. I constantly worried in case I had forgotten something.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>After the outline, comes the many hours of writing. You struggle trying to decide what to say next and how to say it. When you've done all that, you're still far from finished.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You have to edit everything you've written. How I always hated this long process. I'm sure you are familiar with the feeling in the pit of your stomach as you are faced with this task..</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I am an innovator and always look for better ways. After two years of learning, testing, and tweaking, I finally created a simple and repeatable step-by-step process, that easily turns out  quality books. Writing is a lot simpler and faster now.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">ANYONE can write a quality non-fiction book with this simple step-by-step process.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You can write a book on any subject. Just follow the simple steps.<br></p>\n\n<p>Other writing methods follow the long laborious method of creating an outline, writing the book, and finally spending a long time editing it.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n</p>\n\n<p><strong class=\"redactor-inline-converted\">The 'Write In Steps' method is different.</strong> It is much easier, faster, and produces a far better quality result. In simple steps, everything is included that makes a quality non-fiction book.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The normal way is to spend a lot of time creating the outline. After that, there is the long writing process. Finally, you have to edit everything you've written. I am going to teach you my very effective process that writes top quality non-fiction books. \nIt's far simpler than the normal process and produces excellent results.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This method combines all three steps.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You start writing your book from the very first word. The editing is done during the process, which is far easier.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My books have improved since I started using this process. It  is so simple. Anybody, who can type, can write a quality non-fiction book.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here is an overview of the entire process...</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Create simple lists in just minutes. These are the most important parts of your book.</li><li>One at a time, easily expand each item using my unique Conversation Method. I will reveal it to you. It is super simple and you'll always know what to say.</li><li>In easy steps, add examples, analogies, and learning aids.</li><li>Edit the short section before you repeat with the next. I am going to teach you the most effective way to catch every single error and poor wording. It's a highly effective editing process I developed through trial and error. It doesn't miss a thing.</li><li>Craft an introduction that practically forces people to buy and read your book. This is a very effective three step process.</li><li>Write a simple book conclusion that reviewers of my books have they love.</li><li>When you're done, your book just needs formatting. That's it. Simple.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">PLUS... GET THESE EYE-OPENING BONUS LECTURES</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonus Video Added October 12TH 2015:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">The Little Books Method - Make Big Books Easy To Write</em></strong> This makes writing big books a whole lot simpler. I recommend you check this out.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Bonus Videos Added September 30TH 2015:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">How to Write Your Entire Book in a Mind-map</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Main benefits are...</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Write the structure and entire text within one document</li><li>Easily see everything on one screen</li><li>See your entire plan while you write</li><li>Easy to move around sections and/or delete unwanted items</li><li>One document to work with</li><li>Easy to back up, as it is one file</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">30 Day Money Back Guarantee: </strong>I am confident you will benefit from this course and improve the way you write your non-fiction books from now on. But if for any reason you are not happy, for your peace of mind, Udemy offer a 30 day full money back guarantee. Udemy handle the refund process themselves. However, I'm sure you will love the system I present here and as a result will not want your money back.</p><p><strong>Watch the First Five Lectures for Free</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Stop writing your books the old hard way.<br></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Enroll now</strong> to <strong class=\"redactor-inline-converted\">write quality nonfiction books the easier and faster way.</strong></strong><br></p>", 
    "end_date": null, 
    "title": "Write In Steps: The Amazing Nonfiction Book Writing Formula", 
    "price": "20.00", 
    "instructors": "Ian Stables", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604626_7eec_5.jpg", 
    "course_url": "https://www.udemy.com/write-in-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T08:13:39Z"
}