{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Experienced author and ghostwriter Jenna Glatzer teaches you how to sell a nonfiction book to a major publisher.</p><p><strong class=\"redactor-inline-converted\">Learn How to Sell Your Big Book Idea</strong></p><p>Did you know that you don't have to write a book before you sell it to a publisher? In fact, publishers and agents don't even <em class=\"redactor-inline-converted\">want</em> you to write the whole thing. They want to be involved in the process, so what they want from you first is a document called a book proposal. We'll go over all the ins and outs of vetting your idea and then writing an amazing book proposal, including...</p><ul><li>How to analyze your idea to make sure it's good enough and big enough to land with a major publisher</li><li>How to determine if you need a coauthor, ghostwriter, or other collaborator</li><li>Checking out your competition to make sure there's a market for it and see how you can differentiate your book</li><li>How to write an overview that grabs attention</li><li>The \"author platform\" and how you can build and improve yours before the book deal</li><li>How to write an effective book outline</li><li>Showing publishers you're ready to promote</li><li>Tips for your sample chapters</li></ul><p><strong>Why Take This Course?</strong></p><p>This is a rare opportunity to take a course with an author who's really \"done it all\"-- I've had 27 books published, with three more on the way. They range from biographies and memoirs to true crime, reference, business and leadership, self-help, health, psychology, inspirational, and children's educational. </p><p>Along the way, I've worked with multiple top agents and publishers, so I have a wide-ranging knowledge base about what sells and what doesn't, and what works in a book proposal. Plus, I'm one of those weirdos who actually <em>likes</em> writing book proposals. With any luck, I'm going to teach you how to like the process, too. It's pretty exciting to watch an idea take shape!</p><p><strong>Course Details</strong></p><p>You don't need anything to start this course except the desire to write a nonfiction book. If you have a strong idea for one, great. If not, you may find the inspiration for it here. </p><p>This course is taught by video lecture and handouts.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Your BIG Book Deal: Sell Your Book to a Major Publisher", 
    "price": "40.00", 
    "instructors": "Jenna Glatzer", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793344_9a8a_2.jpg", 
    "course_url": "https://www.udemy.com/your-big-book-deal/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T07:42:58Z"
}