{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Today, you can make the decision... do you want to start earning extra money from YouTube easily?</p>\n\n<p>  Do you want to make this your full time job that YOU decide the hours of? </p>\n\n<p> Do you want to know <strong>exactly </strong>how I earn over 4 <strong>million views each month </strong>just from YouTube search results?</p>\n\n<p><strong><em>You don't need to have any experience.  You just have to want to succeed!</em></strong></p>\n\n<p><strong>Learn how I get:</strong><br></p>\n\n<ul><li>4,000,000+ views every month<ul><li>60% or more <strong>just </strong>from search results!</li></ul></li></ul>\n\n<ul><li>$5,000+ every month from YouTube</li><li>Thousands of new subscribers every single month</li><li>Over 550,000 subscribers on my channel</li><li>Dozens of videos with 1 million+ views</li></ul>\n\n<p><strong>More about the course:</strong></p>\n\n<ul><li>No major requirements at all</li><li>Full, free lifetime access</li><li>All future extra lectures and upgrades are always included for free!!</li><li>Udemy 30 day money-back guarantee - because I know we will succeed together! </li><li>Tons of secrets and tips I'm ONLY offering inside this course!</li></ul>\n\n<p><strong>What you will get from this course</strong>:</p>\n\n<ul><li>How to build an bigger audience and get more views</li><li>How to grow your channel through search results on YouTube</li><li>How to maximize and even DOUBLE YOUR EARNINGS from YouTube</li><li>How to make money on YouTube starting today</li><li>SEO tools, tricks &amp; secrets! (how to get your videos to top of the search results)</li><li>ALL of my secret tips and tricks of YouTube from over 6 years of experience/expertise</li><li>Hours of detailed video tutorials and lectures</li></ul>\n\n<p>More about the course:</p>\n\n<p>Hello! My name is\nMatt Cobuzio and I’ve been creating content on YouTube for over 6 years.\n In that time, I garnered just over 550,000 subscribers and 100+ million\ntotal views.  Those are simply numbers to us but those equate to a monthly\nsalary over 5000 dollars and a lot of skills that can be applied to any online\nbusiness.  With over 60% of my 4 million monthly views coming from search\nresults, I would love to share my tips, tricks, secrets and strategies with you\nto help you grow on YouTube by getting your videos in the top of the search\nresults. </p>\n\n<p>Upon completion of\nthis course, students will be have an extensive set of skills such as:</p>\n\n<ul>\n <li>How to get top search results\n     </li>\n <li>How to grow a YouTube channel\n     </li>\n <li>How to build an\n     audience in the millions</li>\n <li>How to monetize YouTube\n     videos and make a monthly salary<ul>\n  <li>How to maximize earnings on\n      YouTube</li>\n </ul></li>\n \n <li>Students will have lifetime\n     access to priceless creator tools </li>\n <li>Students will learn how to\n     maximize views on YouTube through SEO work and the importance of titles\n     and tags</li>\n <li>Lastly, I will be giving out\n     most of my top secrets on how I grew my subscribers and views on\n     YouTube </li>\n</ul>\n\n<p>The course is\nlargely hands on.  That means that I will be teaching techniques, skills\nand strategies primarily through detailed video lectures showing you first hand\nhow I run my channel and the best ways to run yours. Because I am so dedicated\nto making your investment in this course worthwhile, I will also be open to\nanswering any specific questions students may have and providing help outside\nof the course as requested!  </p>\n\n<p>Some of the major\ntopics we will cover include: the power of search on youtube, youtube's search\nalgorithm, building an audience, monetizing your content, maximizing your\nincome, search engine optimization, getting top search results easily, upload\ntiming and the importance of titles and tags, analytics motoring, and social\nmedia exposure!</p>\n\n<p>The type of student\nwho should enroll in this course is anyone!  Any country, any age, any\nskill level.  this course has only one requirement: you!  I can\npersonally assure you that if you are invested in learning the skills i can\nteach you in this course then you will be successful on your youtube channel</p>", 
    "end_date": null, 
    "title": "YouTube SEO Secrets - How to get Views & Subscribers!", 
    "price": "50.00", 
    "instructors": "Matthew Cobuzio", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593360_aa33_4.jpg", 
    "course_url": "https://www.udemy.com/tubetorque/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T21:01:55Z"
}