{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em>Do you want to start a YouTube Channel?</em></strong></p><p><strong><em>Do you need help getting more views and subscribers?</em></strong></p><p><strong><em>Do you desire to make money with your YouTube Channel?</em></strong></p><p>This mini-course will get you started on a successful YouTube journey. In this course, you'll learn some of YouTube's best practices for growing your own channel. These lessons come from the complete YouTube Masterclass, an amazing course right here on Udemy that will walk you through the entire process of YouTube success.</p><p>Start with this free course, and if you want to be serious about becoming a YouTuber, enroll in the YouTube Masterclass by Phil Ebiner and Mike &amp; Lauren Moyer. </p><p><strong>In this class you'll learn:</strong></p><ul><li>How finding a specific target audience can help you grow faster</li><li>How being consistent is the key to YouTube success</li><li>How to create videos that are sustainable and easy to find with YouTube search</li><li>How to create videos that are organically more likely to be shared</li><li>How to collaborate with other YouTubers, and why this can lead to rapid growth</li><li>How interacting with viewers creates raving fans (and why this is important)</li><li>How being authentic will help your channel grow.</li></ul><p>I look forward to seeing you in this course!c</p><p>Cheers,<br>Phil</p>", 
    "end_date": null, 
    "title": "YouTube Best Practices - Tips for Starting a YouTube Channel", 
    "price": 0, 
    "instructors": "Phil Ebiner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715988_23b9.jpg", 
    "course_url": "https://www.udemy.com/youtube-best-practices/", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T19:40:17Z"
}