{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you're looking for a course that doesn't just tell you to sign up for Adsense, then you've come to the right place.</p>\n\n<p><strong>Hey there</strong> - I'm Clif, and I'm what people call an old school YouTuber.  In other words, I've been around since the early days (since before the site was ever monetized with Adsense).  This has given me a different perspective on YouTube than most of the marketers out there trying to sell you cheap tricks and tactics.</p>\n\n<p>Inside this course, you'll get to see my <em>honest, realistic</em> Adsense earnings for a small channel on an average month compared to an outstanding month - no hyped up results! <br></p>\n\n<p>Adsense is only a small part of this course though.  It might be the most common way to monetize your channel, but it certainly isn't the only way.</p>\n\n<p>That's why I made this course - to show you all the insider methods people are using these days to monetize their channels to the moon and back.</p>\n\n<p><strong>Inside, you'll learn:</strong></p>\n\n<ul><li>The TRUTH About Adsense</li><li>How to Increase Your Adsense Revenue Without Ads</li><li>The \"Blockbuster Video\" Method</li><li>How to Earn Money With Free Trial Memberships</li><li>How to Get People to Pay You to Make Videos</li><li>The Secrets to Monetizing What You Eat</li><li>Different Niche Ideas You Can Earn Money In</li><li>And More!</li></ul>\n\n<p><br></p>\n\n<p>Now that I've given you a taste of what's inside, I want to be clear about what's not inside so there's no confusion.<br></p>\n\n<p>This course is <strong>NOT</strong> about:</p>\n\n<ul><li>Ranking Your Videos</li><li>Getting Rich Overnight</li><li>How to Make Videos</li><li>How to Get Traffic</li><li>Branding Your Channel</li></ul>\n\n<p>There's nothing wrong with those topics, but this course focuses on one thing - <strong>MONETIZATION!</strong></p>\n\n<p>++++++++++++++++++++++++</p>\n\n<p>Other Buyer Perks Include:</p>\n\n<ul><li>Lifetime Access to All Future Updates - At No Extra Cost</li><li>A Full 30 Day Money-Back Guarantee By Udemy</li><li>The Ability to Ask One-On-One Questions Inside</li></ul>\n\n<p><br>The only thing left for you to do now is to click the \"Buy\" button in the top-right corner to get started.<br></p>", 
    "end_date": null, 
    "title": "YouTube And Adsense Mastery: Using The Blockbuster Video Method", 
    "price": "20.00", 
    "instructors": "Clif Burrell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/761544_8a1c_3.jpg", 
    "course_url": "https://www.udemy.com/youtube-and-adsense-mastery-using-the-blockbuster-video-method/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-13T15:53:35Z"
}