{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Want to <em>increase</em> your YouTube channel size? Make more <em>money</em> on YouTube? Get <em>sound</em> assets and help with <em>collaborations</em>? Then YouTube networks can help with all your needs. However, how do you <strong>pick</strong> the right YouTube network without getting scammed into a 2-year long contract and terrible revenue split? This course will show you how to leverage a YouTube channel to increase your views, subscribers, and earnings on YouTube. You are leaving a lot of money on the table if you don't take this course.</p><p><strong>I'm Ben Bowden and I have over <em>90 MILLION</em> views across all of my YouTube channels. I've been with Machinima, Maker Studios, and am currently with Union for Gamers. I've negotiated multiple contracts and have made 10s of thousands of dollars on YouTube.</strong></p><p>This course will help all channel sizes decide which YouTub multi-channel network to join.</p><p>Course layout:</p><ol><li>First the course starts out with the basics of YouTube networks and terminology.</li><li>Then we'll move onto more topics such as the history of YouTube networks are</li><li>Finally we'll talk about more advanced topics such as what's the best channel size to join a network, sign on bonuses and basic <strong>scam contracts </strong>to look out for.</li></ol><p><br></p><p><strong>As with all my courses:</strong></p><ul><li>you have u<strong>nlimited lifetime access</strong> at no extra costs</li><li>updates to courses are <strong>free</strong></li><li>30 day money-back-in-full guarantee</li><li>support from me personally</li></ul>", 
    "end_date": null, 
    "title": "YouTube Multi Channel Networks", 
    "price": "20.00", 
    "instructors": "Ben Bowden", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559084_3784_2.jpg", 
    "course_url": "https://www.udemy.com/youtube-multi-channel-networks/", 
    "currency": "USD", 
    "subject_name": [
        "Media"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T02:02:28Z"
}