{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    VERSIÓN EN ESPAÑOL\n\nEn este curso abordamos los aspectos artísticos de la creación del videojuego. Para ello, proporcionaremos conocimientos y pautas sobre cómo diseñar la parte artística de un videojuego. Esto incluye diferentes aspectos. Desde la creación de entornos, al diseño de personajes, movimientos e incluso música. Todo el proceso buscará una coherencia que permita transmitir al jugador la experiencia que espera. Para definir y comprender mejor los conceptos se usan, como en el resto de cursos del Programa Especializado, ejemplos y referentes de videojuegos.\n\nIMPORTANTE\nEn breve el curso dispondrá de subtítulos en inglés.\n\n__________\n\nENGLISH VERSION\n\nIn this course we will talk on the video game's creation artistic aspects. In aim to do so, we will provide knowledge and guidelines on how to design a video game's artistic part. This includes different aspects. From the environments creation, to the characters' design, movement and even music. All this process will look for a cohesion which will allow us to give the desired experience to the player. To properly define and understand the concepts we will use -as in the other courses inside the Specialized Program- examples and video game referents.\n\nIMPORTANT\nEnglish subtitles will be soon available.\n\n                                            Syllabus\n                        Introducción al arte en videojuegosEn este primer módulo se dará una introducción al papel del arte en los videojuegos. Hablaremos sobre su importancia, sobre la dirección de arte, y sobre el perfil del artista. También comentaremos aspectos relacionados con la creatividad, además de situar la creación de arte dentro del proceso de desarrollo de un videojuego.\n\nPosteriormente entraremos a analizar diferentes tipos específicos de arte (conceptual y arte 2D), para finalmente empezar ya a centrarnos en el arte 3D con una primera toma de contacto con el 3ds Max y el modelado 3D.\nModelado y texturizado En este módulo seguiremos de lleno en los elementos del arte 3D. Modelaremos elementos más complejos, e introduciremos los diferentes tipos de materiales. Presentaremos las texturas, explicando qué son, como se generan y como mapearlas de manera adecuada. Finalmente, comentaremos las técnicas de normal map y specular map, para conseguir más detalle sin gastar recursos.Exportación al motor y animaciónEn este módulo introduciremos la herramienta de Unity, que nos permitirá ver como se exportan los elementos de arte a un motor de un videojuego, y como deben configurarse para que luzcan adecuadamente. Posteriormente nos ocuparemos de la creación de personajes, incluyendo la creación del sistema de huesos y de sus animaciones. Finalmente, volveremos a Unity para exportar el personaje y las animaciones.\nIluminación, interfaz y efectosEn este módulo trataremos en detalle la iluminación, primero con una introducción básica, y después viendo los diferentes métodos para representarla: Tiempo real y mapas de luz. Veremos también como sacar los mapas de luz, tanto en Unity como en 3ds Max. \n\nPosteriormente, hablaremos del uso de las partículas para simular elementos de gran complejidad orgánica como fuego, explosiones o humo. También comentaremos aspectos artísticos de la interfaz de usuario, y veremos los efectos de posprocesado más relevantes. Finalmente, analizaremos el papel artístico de la música y el sonido dentro de la creación de videojuegos.\n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Arte 3D y animación en videojuegos", 
    "price": 0, 
    "instructors": "Pere Nolla Rodríguez and Enric Martí Gòdia", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/videojuegos-animation", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}