{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    In this course students learn the basic concepts of acoustics and electronics and how they can applied to understand musical sound and make music with electronic instruments.  Topics include: sound waves, musical sound, basic electronics, and applications of these basic principles in amplifiers and speaker design.\n\n                                            Syllabus\n                        Week 1 - Introduction RC &amp; Introduction to Electrical Circuits MBIntroduction to oscillations and sound waves, simple oscillating systems, sound pressure, sound waves, the speed of sound, wavelength, frequency and pitch, sound pressure level, loudness, making sound, properties of musical sound versus “noise”. Electronics fundamentals - charge, current, voltage, power, resistance, Ohm’s law, DC circuits, finding currents and voltages in simple circuits. Week 2 - Acoustic Resonance RC &amp; Electrical Circuits MBReflection and absorption of sound, resonances in air columns, resonances in enclosures and rooms, diffraction and diffusion of sound, reverberation, principles of designing a good music studio. AC signals, phase and complex numbers, capacitors, inductors, transformers, impedance, AC circuits and AC circuit analysis, simple filters (high-pass, low-pass, band-pass)Week 3 - Some Necessary Mathematics MB &amp; AC Circuit AnalysisTransistors, vacuum tubes, opamps, amplification, power gain, single-stage amplifiers. \nConverting sound to electrical signals –microphones and guitar pickups, converting electrical signals to sound – loudspeakers  Week 4 - AC Signals &amp; Loudspeakers and Radiation RCElectric guitar electronics, pickup design, pickup placement and tone, volume control circuits, tone control circuits.  Overview of a simple guitar amplifier, power supply, volume control, preamp, tone control, power amp section.Week 5 - Closed Box Loudspeaker Design RC &amp; Ported Loudspeaker DesignDesigning speaker enclosures, basic principles, interaction of speaker driver with the cabinet, why a cabinet at all? Speaker designs for home stereo, crossover networks, guitar amplifier (open) speaker enclosures, bass amplifier (closed and vented) speaker enclosures. Week 6 - Guitar Pickup and Effects Analysis MB &amp; Design and Construction of a Guitar Amplifier MBBuilding the guitar amplifier, how to solder, getting the amp to work - systematic testing and troubleshooting. Visualizing sound waves, frequency content and tone, signal modification in electro-acoustic systems, tube amplifiers and distortion, wah pedal, talk box.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Fundamentals of Audio and Music Engineering: Part 1 Musical Sound & Electronics", 
    "price": 0, 
    "instructors": "Robert  Clark and Mark  Bocko", 
    "institution_name": [
        "University of Rochester"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/audio-engineering", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}