{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    VERSIÓN EN ESPAÑOL\n\n¿Cómo se estructura y funciona un programa de videojuego? Es lo que comúnmente se conoce como 'gameplay', y que constituirá nuestro núcleo de estudio en este curso. Su análisis detallado nos permitirá comprender su importancia, y qué funcionalidades debe tener. Analizaremos también la interface gráfica del usuario (GUI), que finalmente condiciona el hecho de que el jugador pueda interaccionar correctamente con el videojuego. Para definir y comprender mejor los conceptos se usan ejemplos y referentes de videojuegos de la industria.\n\nEn breve el curso dispondrá de subtítulos en inglés.\n_________________\n\nENGLISH VERSION\n\nHow does a video game program work and structure? We call this gameplay, and it will be the main point on this course. Its detailed analysis will allow us to understand its importance and what functions it has to have. We will also analyze the Graphics User Interface -GUI- that finally conditions the player's correct interaction with the game. To properly define and understand the concepts we will use examples and referents on the video game's industry.\n\nEnglish subtitles will be soon available.\n\n                                            Syllabus\n                        INTRODUCCIÓN A UNITY. TERRENO, CÁMARA Y CONTROL ¿Te has preguntado qué funcionalidades básicas presenta el motor de videojuegos Unity 3D? En este módulo verás cuáles son estas funcionalidades. Para ello crearemos un terreno mediante el editor de terrenos. Asimismo, completaremos el módulo implementando un pequeño control de personaje y cámara con el que movernos por el escenario.ANIMATOR CONTROLLER EN UNITY. ITEMS Y BALAS¿Qué es un Animator Controller? ¿Cómo lo implementamos? En este módulo verás cómo implementar un Animator Controller para nuestro personaje con estados básicos como Idle y Run. Además, descubrirás cómo se pueden introducir ítems coleccionables en nuestro videojuego. Finalizaremos implementando un contenedor de balas con el que poder disparar.FÍSICA, ENEMIGOS Y GUI¿Cómo puedo introducir física en un videojuego? En este módulo adquirirás los conocimientos básicos para introducir física en tu videojuego, con la finalidad de que los elementos actúen como en la realidad. Además,  podrás ver dos tipos de enemigos, como son unos enemigos de tipo torretas (o fijos) y unos enemigos que se mueven hacia el player. Por último introduciremos una pequeña GUI ingame.MENÚ PRINCIPAL, SONIDO Y BOSSÚltimos detalles... ¿Quieres introducir un menú en el videojuego? ¿Quieres que tenga sonido? Con los conocimientos que verás en este último módulo podrás introducir un menú principal en el videojuego, aprenderás a introducir sonido en el juego y verás cómo implementar un enemigo de tipo Boss con el que interactuar.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Gameplay en videojuegos", 
    "price": 0, 
    "instructors": "Enric Martí Gòdia and Jordi Arnal Montoya", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/videojuegos-play", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}