{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    An introduction to time based media and the use of time as an element of design. Emphasis will be placed on communication through animation, transformation and timing. Course will include a significant introduction to using industry standard software Adobe After Effects, as well as Adobe Photoshop and Premiere, to create time based media.\n\n                                            Syllabus\n                        Session 1: Animated Gifs Intro to course and basic Photoshop. Intro to basic composition, design elements and principles.\r\nSession 2: Animated Gifs - Photography Basics Intro to pre-visualization and storyboarding, basic animation principles, creating and animating imagery, and design principles.\r\nSession 3: Animated Gifs - Premiere Basic Premiere editing. Design principles; rhythm, pattern, repetition.\r\nSession 4: Title Transformation - Intro To After Effects Pt. 1 Basic After Effects. Design principles; proximity, alignment and grids.\r\nSession 5: Title Transformation - Intro To After Effects Pt. 2 Working with typography. Design principles; scale, figure and ground.\r\nSession 6: Title Transformation - Intro To After Effects Pt. 3 Intro to concept development. Design principles; emphasis and focal point.\r\nSession 7: Title Transformation - Pre Visualization For Titles Understanding an creating style frames and presentation storyboards. Basic color theory. Building simple color palettes; dominant, subordinate and accent colors. Design principles; harmony, unity and variety.\r\nSession 8: Title Transformation - Animation For Titles Creating more complex After Effects animation.\r\nSession 9: Title Transformation - Complete Titles/ Begin Video Principles Project Reinforce Photoshop to create composites for style frames and storyboards.\r\nSession 10: Video Principles Pulling keys from green screen footage in After Effects.\r\nSession 11: Video Principles - Animation And Compositing More advanced After Effects compositing and animation techniques.\r\nSession 12: Video Principles - Production And Post Production Reinforcing Premiere editing in creation of reel.\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Introduction to Motion Design: Time and Transformation", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Ringling College of Art + Design"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.kadenze.com/courses/introduction-to-motion-design-time-and-transformation/info", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-12-27T00:00:00Z"
}