{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Digital Media &amp; Video Games\n                                                            \n                            \n                                                \n                    \n                    \n                    If you love games and want to learn how to make them, then this course will start you down that path. Making games is a creative and technical art form. In this course you will familiarize yourself with the tools and practices of game development. You will get started developing your own videogames using the industry standard game development tools, including the Unity3D game engine and C#. At the end of the course you will have completed three hands-on projects and will be able to leverage an array of game development techniques to create your own basic games. This course is for individuals interested in becoming a game designer, game artist, or game programmer.\n\n                                            Syllabus\n                        From Game Player to Game DeveloperThe only thing more fun than playing games is making them. You can make games. All it takes is some time, a willingness to learn and a passion to create. You don't need to be a \"coder\" to make games. Part of the beauty of games is that they take a variety of skills to make. Art, creativity, and systems thinking are just as important as code. Join us in this journey into game making!Intro to Unity3D DevelopmentOne of the reasons we use Unity3D is its visual editor which makes creating interactive games accessible to both creative and technical individuals. In this module, you will create your first Unity3D project from start to finish. Using a variety of graphical and audio assets and a library of scripts, you will create a simple model of our solar system.  By the end of the module, you should have a good understanding of the Unity3D editor and the workflow for creating games.Creating Games in Unity3DUnity3D is a powerful tool for creating games. In this module, you will create your first actual game from start to finish, called Roller Madness.  This ball rolling game will introduce you to the concepts of physics, health and damage, pickups, enemies, spawners, a user interface, and a variety of visual and audio effects. This is your right of passage into game development!Designing and Coding Gameplay SystemsNow, don't get scared, but games need code. Code is the canvas upon which game systems are painted. However, that doesn't mean you need to be a C# ninja. In this module, you will start to learn the ins-and-outs of programming C# in Unity. You will apply this knowledge to build a first person shooter game, called Box Shooter.  By the end of the module, you will have the tools to begin to develop your own custom games!\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Introduction to Game Development", 
    "price": 0, 
    "instructors": "Brian Winn and Casey O'Donnell", 
    "institution_name": [
        "Michigan State University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/game-development", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}