{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    VERSIÓN EN ESPAÑOL\n\nPara todas aquellas personas que han querido saber cómo se creaba un videojuego, en este curso vamos a explicar cómo crear un pequeño motor, uno de los elementos nucleares de cualquier videojuego. El curso persigue comprender su concepto, entender qué es ese núcleo que en terminología inglesa se conoce como 'game engine', Analizaremos no solo su papel, sino qué utilidades debe proporcionar para ser utilizado en un videojuego. Y todo ello, explicando cómo crear un pequeño motor desde cero, que nos permitirá crear un videojuego en DirectX11.\n\nUn curso donde cualquier persona podrá entender los conocimientos básicos sobre el funcionamiento de un motor, y donde las personas con formación en programación aprenderán a crear su propio motor.\n\nEl curso está estructurado de tal forma que desde el primer día tengamos resultados en pantalla y cualquier persona pueda seguir el propio curso.\n\nEl resultado será un pequeño motor de videojuegos 3D sobre DirectX11, donde crearemos un pequeño videojuego de tipo FPS.\n\n\nIMPORTANTE\nSubtítulos en inglés disponibles.\n\n_________________\n\nENGLISH VERSION\n\nFor those who ever wanted to know how to create a video game, in this course we will explain how to create a small engine, one of the main elements in any video game. This course wants to understand their concept, understand what is this nucleus called 'game engine'. We will analyze their role and which utility it has to provide in aim to be used in a video game. We will do all this by explaining how to create a small engine which will allow us to create a DirectX11 video game.\n\nA course in which anyone will be able to understand the basic knowledges on an engine's functioning, and where people who have studied programming will be able to create their own engine.\n\nThis course is structured so that from the first day we have results on screen and anyone can follow them.\n\nIMPORTANT\nEnglish subtitles are available for this course.\n\n                                            Syllabus\n                        Introducción a un motor 3DEn este módulo aprenderemos los conocimientos necesarios para crear una aplicación DirectX 11 con Microsoft Visual Studio.\nUna vez creada nuestra aplicación en DirectX 11 64 bits aprenderemos a pintar modelos de tipo Debug como Ejes, cajas, esferas y grids.\nMallas 3D y FísicaEn este módulo aprenderemos los conocimientos para poder renderizar modelos 3D exportados de una herramienta 3D Studio MAX en formato ASE.\nPor otra parte aprenderemos a cargar texturas en nuestro motor que podremos utilizar en nuestros modelos.\nPor último conoceremos los fundamentos de una librería de física como nVidia Physx que nos permitirá controlar la física y colisiones de nuestro videojuego.\nAnimación esqueletal. Inteligencia Artificial En este módulo aprenderemos a integrar una librería de animación esqueletal como Cal3D dentro de nuestro motor de juego. Gracias a esta librería podremos integrar modelos animados con animaciones de tipo acción o ciclos.\nPor último aprenderemos a implementar una Inteligencia artificial mediante una máquina finita de estados para aplicarlo en los bots de nuestro juego.\nBillboards. Sonido. GUIEn este módulo integraremos una librería de sonido como OpenAL en nuestro videojuego y aprenderemos a utilizar efectos de sonido en nuestro videojuego.\nAprenderemos el concepto de Billboards que nos permitirá introducir partículas en el motor.\nPor último implementaremos una pequeña GUI en nuestro juego que nos mostrará información de juego en pantalla mediante texto e imágenes 2D.\n\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Motores gráficos en videojuegos: game engine", 
    "price": 0, 
    "instructors": "Enric Martí Gòdia and Jordi Arnal Montoya", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/videojuegos-engine", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}