{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will examine how storytelling acts as a vital mechanism for driving video gameplay forward. Looking at several historical and contemporary games, you will be asked to evaluate and interpret different story styles with the goal of identifying themes and procedures for your own game ideas. We'll examine traditional narrative story processes, such as three-act structure, and how they fit into game story flows and the strategic elements of gameplay.  Ultimately, you will learn how to define character, setting, and structure to create a compelling game concept.\n\n                                            Syllabus\n                        Week 1: An Introduction to StoryFor the first week of the class, we will be analyzing the components of three-act structure using a classic fairytale as an example. We'll examine the characters in the story by figuring out their goals and the main conflict that creates a rising arc of action to keep the audience interested.Week 2: Game Story StructureIn this week, we will draw a parallel between last week’s discussion on rising action and how that relates to gameplay. Looking at a pair of contemporary games, we'll learn how to identify story structure and themes of rising action, just like we would with traditional stories and movies. Lastly, we’ll evaluate the role that primary and secondary characters come to play in the unveiling of a game’s story and discuss the importance of understanding how these games present their stories in the actual gameplay.Week 3: Story WorkshopThis week, we explore ideation techniques and learn how to consolidate our ideas into more formalized stories specifically for pushing them towards a game design. We will take a look at the importance of, and ways to refine, characters and settings as we develop an initial concept in story form first, and then next week, into a game.Week 4: From Story to GameFor this last week of class, we will begin by seeing what a game design document is, and evaluate a few different templates you can use. Then, we will take the story we built in last week’s course, The Shooter, and define it as a playable game outlined in a game design document. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Story and Narrative Development for Video Games", 
    "price": 0, 
    "instructors": "Dariush Derakhshani", 
    "institution_name": [
        "California Institute of the Arts"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/video-game-story", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}