{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    This course will take the student through the basics of visual development: from visual storytelling to character design; from creatures to vehicles. Beginning with simple visual elements, the student will learn how to create images that tell a story visually, as well as support a production in animation, live action, and video games.\n\n                                            Syllabus\n                        Session 1: Visual Components In this session we will analyze the visual components that form the basis for all images.Session 2: Pushing The Design Of The Character This session will cover finishing a character design.Session 3: Creature Design In this session, you will learn how a creature can be envisioned and designed.Session 4: Anatomy, Story And Creature Design This session will cover finishing a creature design.Session 5: Creating An Environment In this session you will learn how to create a believable environment in which to stage a character.Session 6: Moving The Eye Of The Viewer This session will cover finishing an environmental design.Session 7: Vehicle Design In this session you will learn how to employ shape to create a successful vehicle design.\n                                    ", 
    "end_date": "2017-01-19T00:00:00Z", 
    "title": "Visual Storytelling: Envisioning a Narrative for Film and Video Games", 
    "price": 0, 
    "instructors": "Ken Spirduso", 
    "institution_name": [
        "Ringling College of Art + Design"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.kadenze.com/courses/visual-storytelling-envisioning-a-narrative-for-film-and-video-games/info", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-12-01T00:00:00Z"
}