{
    "selfpaced": false, 
    "topic_name": [
        "Digital Media & Video Games"
    ], 
    "description": "\n\n                    \n                    \n                    Start creating your world. A game world is not just a backdrop for your game—be it minimal or detailed, contained or part of a much bigger universe, it provides the context for your player. Ultimately, a game world should feel alive and wholly unique to any player who will experience it. \n\nIn this course, we will explore game worlds in existing games and study the art and influences that inform their themes and styles. We will also investigate key components of environment and level design as well as strategies designers use to define gameplay or advance it. We’ll also look at navigation and the elements that make your world as real (or unreal) as you want it to be. A weekly challenge will prompt you to explore styles and inspirations for possible game worlds, and you’ll learn effective ways to communicate your ideas from concepts to presentation-worthy proofs of concept.\n\n                                            Syllabus\n                        Introduction to World Design During this first week, we'll start with a brief overview of game worlds and game design. We’ll also examine environments and larger world-based concepts to see how games incorporate a macro-level view of how they progress. At the end of the week, a short assignment prompts you to examine, analyze and comment on games that marked or interested you in terms of their environment design. Do Your ResearchWhere do you start when designing a world? Where should you begin to look for sparking that creative impulse? This week we will be exploring ideas and presentation techniques for a game’s environment and world design. I encourage you to draw inspiration from other art practices, artists, video games or even your everyday surroundings. The assignment at the end of the week challenges you to present a proposal for a possible world through concept artwork for peer evaluation. The Way You MoveHow do you move in a video game world? This week we’ll discuss fundamental components and concepts in world and level design. Naturally, these evolve as the gameplay progresses but there are specific strategies you can use to create the finer details in a game environment. At the end of the week, you are challenged to take the previous week’s visual research exercise and expand upon it, giving it shape and volume. A Whole WorldBring your game world to life. In this final week, we’ll be putting down what will eventually define the look, ambience and atmosphere of your world, learning specifically how to convey a mood for a unique and engaging game environment. Go back to your assignment from Week 2 to pull from your inspirations and models. Build on your volumetric model from Week 3 and add details. Define the light, the color palette and the overall visual context of your game space. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "World Design for Video Games", 
    "price": 0, 
    "instructors": "Théotime Vaillant", 
    "institution_name": [
        "California Institute of the Arts"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/video-game-world", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}