{"selfpaced": false, "topic_name": ["Foundations of Mathematics"], "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Mathematics\n                                                                                                    &gt; Foundations of Mathematics\n                                                            \n                            \n                                                \n                    \n                    \n                    A wondrously romantic belief is that brilliant thinkers magically produce brilliant ideas: Einstein jostles his hair and relativity falls out. We can enjoy these fanciful visions of leaps of genius, but we should not be fooled into believing that they’re reality. Brilliant innovators are brilliant because they practice habits of thinking that inevitably carry them step by step to works of genius. No magic and no leaps are involved.\nProfessor Starbird will discuss how habits of effective thinking and creativity can be taught and learned through mathematics. Anyone who practices them will inevitably create new insights, new ideas, and new solutions. Join us for puzzles and discussions prior to the course on Twitter (@StarbirdThink) and Facebook.\n\nWhat is the estimated effort for course?\nAbout 5 hrs/week.\n\nHow much does it cost to take the course?\nNothing! The course is free.\n\nWill the text of the lectures be available?\nYes. All of our lectures will have transcripts synced to the videos.\n\nDo I need to watch the lectures live?\nNo. You can watch the lectures at your leisure.\n\nCan I contact the Instructor or Teaching Assistants?\nYes, but not directly. The discussion forums are the appropriate venue for questions about the course. The instructor and TAs will monitor the discussion forums and try to respond to the most important questions; we also encourage discussion between students within the forums.\n\nIs this course related to a campus course of The University of Texas at Austin?\nYes. This course contains material taught in an undergraduate Signature Course at The University of Texas at Austin.\n\nWill I need textbooks?\nThe course is designed to be self contained within edX. We are working with Wiley to get you access to the \"Heart of Math\" textbook.\n\n                                    ", "end_date": "2014-04-22T00:00:00Z", "title": "UT.9.01x: Effective Thinking Through Mathematics", "price": 0, "instructors": "Michael Starbird", "institution_name": ["The University of Texas at Austin"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/effective-thinking-through-mathematics-utaustinx-ut-9-01x", "duration": "9 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2014-02-18T00:00:00Z"}