{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    People interviewing for jobs today often fail because they are using yesterday's strategies. Recruiting technology has become more sophisticated, and the best employers are constantly changing the way interviews are done. This course gives you detailed strategies for handling tough competency-based, or behavioral,  interviews so that you can communicate the knowledge, skills, and abilities that you have and that employers demand.\n\nYou will be able to:\n\n1.  Identify the objectives of the hiring organization is using behavioral interviewing techniques.\n\n2.  List the steps in the S.T.A.R. method and apply the steps, using reasonably correct language, to respond to  behavioral interview questions.\n\n3.  Use your responses to behavioral and competency-based questions to communicate your personal values.\n\n4.  Identify the objectives of the hiring organization in asking situational and wild-card interview questions.\n\n5.  List the steps in the P.R.E.P. and 5 W's methods and apply the steps, using reasonably correct language, to answer at least one wild-card and two situational interview questions.\n\n6.  Develop an optimal strategy for responding to the weaknesses question, based on recognizing why a hiring organization asks these questions.\n\n7.  Demonstrate your personal strengths and maturity through your responses to the weaknesses question.\n\n8.  Correctly apply hedging language to soften a negative and boosting language to emphasize a positive aspect of your professional and/or academic background.\n\n9.  Ask questions to determine how well an organization fits with your personality, career goals and salary objectives.\n\n10. Ask questions that communicate your competencies and strengths.\n\n11.  Negotiate the best job offer and compensation package for yourself.\n\n12.  Perform successfully on telephone interviews.\n\n                                            Syllabus\n                        Answering \"Tell Me About a Time...\" QuestionsIn this module, you will learn how to respond to behavioral interview questions, also known as competency-based interview questions. You will  learn to: differentiate competencies from skills, break down the thinking behind a hiring organization's use of this approach, contrast behavioral interview questions with traditional questions, identify the characteristics of a successful behavioral interview response, apply the S.T.A.R. response strategy to behavioral interview questions, recognize how behavioral interview responses show job competencies, respond to the three most common behavioral interview questions, and communicate benefits to the hiring organization through your responsesAnswering \"What If...\" QuestionsIn this module, you will learn how to respond to situational interview questions, also known as \"What If\" interview questions. These also include the so-called \"wild-card\" interview questions. You will  learn to: recognize what the hiring organization is looking for in asking these questions, communicate your character values through your responses, apply the P.R.E.P. response strategy to answering interview questions, apply the Pros. vs. Cons. response strategy to answering interview questions, and apply the 5 W's response strategy to answering interview questions.Answering \"What is Your Biggest Weakness?\"In this module, you will learn how to respond to questions that probe for weaknesses. You will learn to: recognize what the hiring organization is looking for in asking these questions, avoid common pitfalls in answering this question, demonstrate mature self-assessment skills through this question, demonstrate the ability to take responsibility for your own growth, demonstrate your ability to perform under pressure, use hedging language to soften negative information, use boosting language to emphasize positive information, and a strategy for positioning yourself for executive assignments.Handling the End of the InterviewIn this module, you will learn how to ask your own questions and how to negotiate a job offer. You will learn to: ask questions that communicate your strengths and competencies, ask questions that help you determine whether the organization is a good fit for you, ask questions that help you align the interview with your career goals, probe for organizational characteristics that can complement your strengths, assess your market value to the company, negotiate the best salary and compensation package for yourself.How to Ace a Telephone InterviewIn this module, you will learn how to perform successfully on telephone interviews.  You will learn: how best to prepare for phone interviews, how to communicate a strong, confident personality on the phone, how to maintain your confidence throughout a phone interview, how to manage the business conversation of a phone interview, how to close a phone interview in your favor, how to improve your skill with every phone interview. \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Advanced Interviewing Techniques", 
    "price": 0, 
    "instructors": "Charles Duquette and Daniela Wagner", 
    "institution_name": [
        "University of Maryland, College Park"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/interview-techniques", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}