{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    Roughly half of the world’s population is already online and so setting yourself apart from the crowd is more important than ever before.  One of the best ways to do that is by creating your own ePortfolio.  An ePortfolio is a site that showcases or shows your background, your resume, and samples of your work.  In this course, you will learn step by step how to build the site and you’ll learn the grammar, vocabulary and writing skills needed to create it.  You will learn how to apply information from your ePortfolio to other online tools like LinkedIn, Twitter, Instagram and YouTube in order to network with others so that you get a job or connect with other professionals.  For each step in that process, you will listen to lectures, take comprehension quizzes, and learn how to use English appropriately to each part of your site.  You will also complete self and peer assessments and gain the needed skills to make your ePortfolio a reality and establish yourself online.\n\nBy the end of this course, you will be able to \n•\tWrite a proper headline or title for your ePortfolio\n•\tDescribe your work in 1 sentence and in longer forms\n•\tIdentify how to use hashtags effectively\n•\tWrite an effective summary about yourself and your work\n•\tApply appropriate vocabulary to write your education and professional experience for your resume \n•\tUnderstand how to write a tweet to get a job \n•\tDiscover how to write specific comments and network work with others \n•\tApply what you have on your portfolio to other tools like Instagram, Twitter, LinkedIn or YouTube.\n\n                                            Syllabus\n                        Start Building Your BrandThis module focuses on getting your ePortfolio branding ready by creating an effective headline and summary of your capabilities.Showcase Your WorkThis module focuses on writing about your work and accomplishments. You will learn to write about your work in a one sentence caption as well as in a longer descriptive paragraph.Complete the Main Parts of Your ResumeThis module focuses on getting your education and work experience up-to-date and professionally ready on your resume. Network with Other ProfessionalsThis module focuses on networking online with other professionals to make meaningful connections and to create new career opportunities.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Build Your Professional ePortfolio in English", 
    "price": 0, 
    "instructors": "Karen Peterson", 
    "institution_name": [
        "Georgia Institute of Technology"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/eportfolio-english", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}