{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    In this course, you will engage in developing and strengthening the functional component of your career brand. Acting as “your own Chief Executive Officer” (P. Drucker), you will learn how to use strategic management models and techniques for enhancing your skills portfolio. You will learn how to increase your human capital by developing and documenting high-demand marketable skills. After completing this course, you will be able to: \n- Implement business strategy and models and tools, such as benchmarking and SWOT analysis, for identifying and analyzing your competitive strengths and addressing competency gaps in a skill-based, competitive job selection context; \n- Understand evidence-based, data-driven skill assessment methodologies and techniques; \n- Select appropriate assessment tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your transferable skills; \n- Create your critical competency profile (\"The Self-Assessment Grid for Evaluation, or SAGE\") and use it as an effective instrument for an objective, 360 degree self-assessment of your competitive strengths and competency gaps; \n- Create and use an effective instrument for organizing, directing and monitoring your skill-building activities (“The Skill-Building Dashboard, or Skill-Builder”); \n- Develop an effective tool (“The T-Portfolio”) for gathering and organizing samples of standards, best practices, assessment instruments and techniques in your chosen field; \n- Effectively organize your self-management information system to systematically collect and analyze job-related data, evaluate and assess required competencies and skills, develop and implement plans for self-improvement, and monitor your progress; \n- Develop and implement a realistic performance metric for your career development activities (\"Your Present Job Market Value\"); \n- Engage in self-coaching to support active self-development.\n\n                                            Syllabus\n                        Harnessing the Power of Personal Analytics for Career BrandingWelcome to the course! The introductory module takes you through all stages of developing and strengthening the functional component of your career brand. In this week, you will learn how to use strategic management models and techniques for enhancing your skills portfolio. You will also engage in creating an effective instrument for organizing, directing, and monitoring your skill-building activities (“The Skill-Building Dashboard, or Skill-Builder”). \nYou’ll continue exercising in Career Development Lab and learn how to develop an effective tool (“The T-Portfolio”) for gathering and organizing samples of standards, best practices, assessment instruments and techniques in your chosen field. \nYour instructors for this week are Amy Giaculli and Val Chukhlomin.\nUnderstanding AssessmentResearch shows that job candidates often overestimate their preparedness for a desired position.  Week 2 focuses on evidence-based, data-driven skill assessment methodologies and techniques from the perspective of experts in the field.  We will specifically focus on common tools and techniques experts use to evaluate competencies such as rubrics, frameworks, standards, and benchmarks. Your instructor for this week is Michele Forte, CDL facilitators are Amy Giaculli and Val Chukhlomin.Mastering Self-AssessmentYou will learn how to select appropriate assessment tools and apply them for a thorough, accurate, evidence-based and data driven self-assessment of your transferable skills. You will learn how to increase your marketability by getting familiar with the use of these tools and by developing and documenting high-demand skills. Your instructors for this week are Amy Giaculli, Val Chukhlomin, and Kymn Rutigliano.Putting Self-Coaching to WorkYou will create your critical competency profile (\"The Self-Assessment Grid for Evaluation, or SAGE\") and use it as an effective instrument for an objective, 360 degree self-assessment of your competitive strengths and competency gaps. You will also develop and implement a realistic performance metric for your career development activities (\"Your Present Job Market Value\"). You will learn how to engage in self-coaching to support active self-development. You instructors for this week is John Beckem, CDL facilitators are Amy Giaculli and Val Chukhlomin.Course ReviewWatch Course Review video, take the end-of-the-course survey and the final quiz. You instructors for this week are Amy Giaculli and Val Chukhlomin.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Career Brand Development and Self-Coaching", 
    "price": 0, 
    "instructors": "Michele Forte, Dr. Kymn Harvin Rutigliano , Amy Giaculli, Dr. Valeri Chukhlomin, Dr. Tonka Jokelova and Dr. John M. Beckem II", 
    "institution_name": [
        "State University of New York"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/career-brand-development-self-coaching", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}