{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    This two-part job search course guides you on the path to career success. Based on interviews with industry professionals and experienced recruiters, Part 1 helps you create a compelling CV / résumé and job application. Part 2 helps you interview successfully.\n\nThis job search course is for both native and non-native speakers of English. Native speakers will learn from industry professionals and recruiters about how to design effective CVs, résumés and cover letters and how to create a compelling online presence. Non-native speakers will also benefit from the English language input that is provided in each week of the course.\n\nPart 1 is followed by Part 2, English at Work in Asia: Preparing for a Job Interview, which covers how to succeed in job interviews so you trump the other candidates.\n\nOnce you have your professional knowledge and gained your experience, how you persuade others to believe that you are as good as you say you are is the challenge. Our instructors have had a 100% success rate in getting interviews and landing a job in Asia and we hope to share that experience with you. The course materials are designed based on our expertise as well as advice from accomplished professionals in the business, HR and academic field. Taking this course will bring you closer to getting that job.\n\n                                    ", 
    "end_date": "2016-06-13T00:00:00Z", 
    "title": "EWA1.1.1x: English at Work in Asia: Job Applications, CVs and Cover Letters", 
    "price": 0, 
    "instructors": "Bee Dy and Jessica Xia", 
    "institution_name": [
        "Hong Kong Polytechnic University"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.edx.org/course/english-work-asia-job-applications-cvs-hkpolyux-ewa1-1-1x-0", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-05-09T00:00:00Z"
}