{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    This course has been designed and developed by experts from The Careers Service here at The University of Sheffield to help you to succeed at interviews, whether you are applying for jobs or planning to study. \nBecause being offered an interview can be quite daunting, we’ve put together a set of materials to help you prepare and be successful on the day.\n\nWe’ll help you to research the organisation so you can answer that frequently asked question ‘why do you want to work for us?’ with style. We’ll provide advice on what to wear (and what not to wear) and go through some common interview questions. We’ll have tips from employers and admissions tutors on what they look for in candidates and cover the types of questions you should be asking them.\n\nFinally, we’ll help you to prepare for different types of interview including how to make an impression via telephone or video or within a group setting. We’ll also help you prepare for tests and practical work that may be included as part of the interview process.\n\nThe course is highly participative and includes articles for you to read, videos to watch and interactive material with tips to help you better understand how to prepare for your interview. There will also be discussions where you can learn from and support each other, self-reflective exercises and quizzes. Throughout the course you’ll be encouraged to collect a portfolio of your work which will help you with future interviews.\n\nBy the end of the three weeks we hope you will have the confidence to perform at your very best at interview.\n\nIf you’re still at the stage of writing your CV and submitting applications for a job or course, join our course\nHow to Succeed at: Writing Applications.\n\n\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "How to Succeed at: Interviews", 
    "price": 0, 
    "instructors": "Hilary Jones and Pamela Hafekost", 
    "institution_name": [
        "The University of Sheffield"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "http://www.futurelearn.com/courses/interviews?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-07-04T00:00:00Z"
}