{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Personal Development\n                                                                                                    &gt; Career Development\n                                                            \n                            \n                                                \n                    \n                    \n                    This course, the first in the \"Interviewing and Resume Writing in English\" specialization, guides you to discover the interests, talents and competencies that you can use to find and do work that leverages your strengths, passions and who you are as a person, so you can start doing work that matters to you and to the world. Whether you already have a career and are looking to move forward, whether you’re looking to change careers, whether you’re starting out in the world of work, whether you’re coming back into the world of work after some time away – this course will help you see your path more clearly and will teach you how to communicate your value to an employer in a way that he or she can immediately recognize.\n\nAfter completing this course, you will be able to 1) use your individual cognitive, social and emotional traits, together with areas of interest, to discover how to find the future jobs that can give you the greatest satisfaction; 2) identify transferable skills of greatest value to the employers who have the jobs you’re interested in; 3) apply a simple strategy for presenting your skills to an employer in an effective and convincing fashion.\n\n                                            Syllabus\n                        WelcomeThis module introduces you to the specialization, giving you background and an overview of what you will learn in the weeks ahead.Researching YourselfIn this module, you'll begin developing your individual strategy to guide your job search, from picking a career direction to measuring effectiveness of your search.Discovering Your Transferable SkillsIn this module, you'll learn how to develop and apply an important strategy used in the English-language world to communicate core competencies to a prospective employer.Improving Your English PronunciationIn this module, you'll learn how to control your use of intonation and rhythm in spoken English. These dynamics do more to improve your comprehensibility than any other feature of the spoken language.Becoming a More Efficient Language LearnerIn this module, you'll learn strategies you can adopt to becoming a more fluent and more confident speaker of English.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Interview Research and Preparation", 
    "price": 0, 
    "instructors": "Charles Duquette", 
    "institution_name": [
        "University of Maryland, College Park"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/interview-preparation", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}