{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    Branding is not only just for organizations, products and companies, It is also for people. ‘Personal branding’ has become an increasingly widespread phrase and permanently reason. Just because more traditional branding helps organizations to draw market consciousness, public recognition and also customer loyalty for them, building your own individual brand can employ a comparably positive impact on employers and the labor market’s attention to you as a specialist.In this course the learner will understand the power of building personal networks, and how to brand him/herself effectively. Learners will develop their personal brand and will learn to use social media to leverage it.  The learner will be able to identify and then communicate what makes him/her unique and relevant and differentiated for his/her target audienceThe learner will be able to use social networks to connect, share, and develop ideas. He/she will learn to brand him/herself to participate in a collective intelligence experience and put the social media to work in his/her personal benefit. We will discuss how to use LinkedIn, Facebook, Twitter and PinInterest to connect professionally with others.Learner will develop a LinkedIn Prolife, resume and online portfolio and be able to market him/herself using professional networks.\n\n                                            Syllabus\n                        Week 1:  From Bragging to Branding: How to Brand yourself effectively\r\nWeek 2: Branding using LinkedIn: Designing your Resume and your Profile\r\nWeek 3: The Power of Building Personal Networks\r\nWeek 4: Position Yourself- Designing your online portfolio and using Pin Interest\r\nWeek 5: Mapping and developing your own Social Networks\r\nWeek 6: Put the Social Media to Work for You (Facebook, LinkedIn and Twitter)\n                                    ", 
    "end_date": "2015-06-29T00:00:00Z", 
    "title": "Personal Branding for Social Networks", 
    "price": 0, 
    "instructors": "Elsa-Sofia Morote", 
    "institution_name": [
        "Open Online Academy, New York"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.ooed.org/learn/personal-branding-for-social-networks-summer-2015", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "EdCast"
    ], 
    "start_date": "2015-05-11T00:00:00Z"
}