{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    Brands originated as proofs of ownership, such as those burnt onto cattle. They evolved to become the symbolic identity for goods and services. This easy identification, with logos and trademarks, became a short cut for quality and trust. People putting their services in the marketplace also became ‘brand names’. This used to a game only for the rich, successful, or notorious. But In the 21st Century anyone participating in the Web has a searchable identity. So whether we like it or not, we have a brand to cultivate.\r\nThis course provides systematic ways of reviewing and implementing your existing and proposed brand identities, based on psychology and demography. Multimedia is now so affordable that a full Hollywood-style extravaganza is possible. So technology is no longer a constraint. Rather, the focus is on strategy to drive the use of the technology.\r\nWho should take this course?\r\nA personal brand can be useful for people needing to announce their presence and get out a message. Commonly that is a job seeker, someone promoting their art or music, someone starting a business, or a group promoting a ‘cause’. \n\n                                            Syllabus\n                        Strategy - What am I branding? My name? My nickname? My business name? My type of business? Keywords? Or maybe not mine but my customer's interests. \r\nWeb presence - Domain name, website, social media, lists, directories, trademarks, fonts \r\nSearch engine optimization – SEO is a career in itself, but we review some white hat basics \r\nMultimedia -  YouTube is now the second biggest search tool so audiovideo is a key  part of the branding toolkit. In this and our other courses we cover multi-tracking, animation, video, and special effects.\r\nPromotion - Integrating these with traditional media to achieve your goal\n                                    ", 
    "end_date": "2014-10-05T00:00:00Z", 
    "title": "Personal Branding: How to build & manage your image", 
    "price": 0, 
    "instructors": "Tom Benjamin", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.openlearning.com/courses/personalbranding", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "OpenLearning"
    ], 
    "start_date": "2014-08-31T00:00:00Z"
}