{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    According to the U.S. Bureau of Labor Statistics, in the current economy, Americans shift jobs every 4-5 years, which translates into 8-10 job transitions, including several career changes, over one’s life time. With competition for jobs on the rise, a person’s continuing employability and career success are increasingly defined by his or her mastery of individual career development and the ability to effectively \"manage oneself\" (P. Drucker). \n\nIn this course, you will learn how to think strategically and professionally about your career self-management. Through this course you'll develop an objective, external view of your marketable skills as a solid foundation for building a strong career brand. In particular, you'll be able to:\n\n-  explain why developing a protean and boundaryless career perspective based on transferable (portable) skills is advantageous for continuing employability and career growth; \n-  design your portable skills portfolio, identify and examine critically important competencies underpinning your transferable skills, and analyze your career self-management competency gaps;\n- increase self-awareness, pinpoint your career goals, and envision your future work self; \n- recognize the central role of self-management for developing transferable, marketable, skills and create a customized self-management information system (Career Development Lab) for ongoing personal development and professional growth;\n- conduct a thorough, competency-based job analysis in your area of interest and examine practices of evidence-based, data-driven competitive employee selection; \n-implement your newly developed skills for crafting effective selection criteria statements and refining your job applications.\n\n                                            Syllabus\n                        Getting StartedTo achieve a competitive edge on the job market, one needs to stand out by creating, managing, and communicating a strong career brand. The introductory module takes you through all stages of career brand building providing a bird's-eye view of the specialization. By completing Week 1, you'll be able to identify critical factors for career success in today's economy and recognize that building a strong career brand requires a combination of superior marketable skills and a powerful personal image. You will begin developing a personalized self-management information system and set up your Career Development Lab.Your instructors for this week are Amy Giaculli and Val Chukhlomin.Understanding careers and career skillsManaging and branding your career to align with a dynamic employment landscape, and with your personal interests, values, and goals requires ongoing skill development.  In Week 2, you will learn how to develop a skill-based view of yourself, with particular attention to transferable skills. Using a competency framework, you will examine your knowledge, skills, abilities, and attitudes as they relate to your career self-management.\n\nYou instructor for this week is Michele Forte. CDL Workout facilitators are Amy Giaculli and Val Chukhlomin.Crafting career self-strategyBy completing Week 3, you will be able to apply the tools of career self-management such as mapping your skill base in the Volatile Uncertain Complex Ambiguous (VUCA) environment. You will be able to implement self-discovery skills and better define your career goals and Future work self! You instructor for this week is Kymn Rutigliano, CDL Workouts facilitators are Amy Giaculli and Val Chukhlomin. How to be competitive on the job marketIn Week 4, you will analyze the competitive job market environment and job descriptions. You will also assess your mastery of critical tasks and your competency performance level. In addition, we will introduce SWOT and the Dashboard, which are two metrics that you can apply to gain a competitive advantage for your next job. \n\nYou instructor for this week is John Beckem. CDL Workout facilitators are Amy Giaculli and Val Chukhlomin.Putting career self-management to workIn Week 5, you will focus on your next job and apply competency mapping for creating a powerful selection criteria statement. You will examine ways of presenting the evidence of your knowledge, skills, and abilities, and putting it all together to create a solid foundation for your brand. Your instructor for this week is John Beckem. CDL Workout facilitators are Amy Giaculli and Val Chukhlomin.Course reviewWatch Course Review video, take the end-of-the-course survey and the final quiz. \n\nYou instructors for this week are Amy Giaculli and Val Chukhlomin.\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Strategic Career Self-Management", 
    "price": 0, 
    "instructors": "Michele Forte, Dr. Kymn Harvin Rutigliano , Amy Giaculli, Dr. Valeri Chukhlomin, Dr. Tonka Jokelova and Dr. John M. Beckem II", 
    "institution_name": [
        "State University of New York"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/strategic-career-self-management", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}