{
    "selfpaced": false, 
    "topic_name": [
        "Career Development"
    ], 
    "description": "\n\n                    \n                    \n                    How can you bring your resume to the top of the pile?  How can you present yourself to prospective employers using the language they already speak inside their company? This course will give you answers to those questions.  You will learn how to convert a boring resume into a dynamic asset statement that conveys your talents in the language that an employer understands.\n\nYou will be able to:\n\n1.\tExplain how Audience, Purpose, Presentation, Language and Evidence (A.P.P.L.E.) shape every piece of business writing.\n\n2.\tIdentify the real purpose of a resume.\n\n3.\tProduce a strong resume in a format (including the CV format) that is suitable both to your background and the position you’re interested in.\n\n4.\tUse your accomplishments inventory to strategically assemble the most relevant evidence of competency for a specific position.\n\n5.\tProduce strong cover letters for at least three potential positions.\n\n6.\tCompose a career development plan that considers future and immediate job prospects together with strategies for further English language development.\n\n                                            Syllabus\n                        Preparing to WriteIn this module, you'll learn to how position your resume to a specific marketing purpose, how to align your resume with the specific needs of the hiring organization, and how to ensure your resume ranks high on the relevancy scales used by top-notch organizations today.Writing a Winning ResumeIn this module, you will learn how to construct powerful accomplishment statements, how to write effective summary sections and job objectives, how to select action words to present you as a doer and achiever, and how to use two web resources that can help you find powerful language for your resume.Choosing a Resume FormatIn this module, you'll learn how to select the best resume format to support your experience and career goals. You'll learn how to prepare resumes for electronic submission and for submission to OCR engines. You learn the benefits of using an internal resume in your annual review process, and you'll learn what never to put on a resume.Writing a Winning Cover LetterIn this module, you'll how to prepare an effective cover letter and how to use marketing strategies to get you cover letter to work for you. You'll learn how to use similar strategies to write a follow-up letter after interviews.\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Writing Winning Resumes and Cover Letters", 
    "price": 0, 
    "instructors": "Charles Duquette", 
    "institution_name": [
        "University of Maryland, College Park"
    ], 
    "commitment": "", 
    "subject_name": [
        "Personal Development"
    ], 
    "course_url": "https://www.coursera.org/learn/resume-writing", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}