{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    Course videos are presented in Mandarin with English subtitles.\n\nIf you are having difficulty viewing this video in mainland China, you can also find it here.\n\n课程介绍视频也可以访问中国网站\n\nThis course was first offered at Peking University in 2008 as a Public Elective Course, and subsequently as a Course for General Education. It is now being offered globally as one of Peking University’s MOOCs. \n\n课 程所涉不仅涵盖古典音乐如新古典主义、表现主义、民族主义等流派，也对爵士乐、摇滚乐与流行音乐在20世纪的风格情状投以深切关注；在将包括中国音乐在内 的世界各国民族民间音乐纳入20世纪大背景予以研究探索之同时，关于大型综合艺术品例如歌剧、音乐剧、电影音乐的考察与分析，也设为专题，绝无偏废。\n\n课 程以20世纪西方音乐为主体内容，在清晰贯穿历史线索和侧重史观发展之同时，尤为强调音乐聆听能力的培养，增进音乐知识的积累，凸显理论与实践相结合的开 课理念。什么是音乐、什么是20世纪西方音乐、什么是有效聆听成为全课核心知识支柱，引导学生探查关于20世纪西方音乐的三种聆听模式，以期对关于20世 纪西方音乐文化诸多现象形成多视角、多维度、多方法、多接口的认识与理解，从而为学生开拓眼界、触类旁通、多学科交叉、创造力之发展，完美人格之形成，提 供实际而扎实的服务。\n\n点击上方绿色按钮报名。\n\nAddressing students' interests in 20th century Western Music Culture and incorporating music theory, the course examines 20th century Western music. By combining theory and practice, the course not only aims to provide a clear view of the historical development of the music, but also emphasizes the training of aural skills and the accumulation of musical knowledge. The course covers not only classical music, such as neo-classical, expressionism, nationalism and other genres, but also explores in depth jazz, rock, and pop music of the 20th century. While studying Chinese music and other forms of national folk music in the 20th century world music context, students will also analyze large and complex works such as opera, musicals, and film music. By enhancing students’ understanding of 20th century Western music (classical music, pop music, folk music, comprehensive art) as a foundation, three core questions will be addressed: what is music, what is the 20th century Western music, and what is effective listening? The course aims to guide students to examine the three listening modes of 20th century Western music with the hope of forming a diverse and multi-faceted, knowledge and understanding of the 20th-century Western music culture phenomena, expanding students’ horizons, enhancing their ability to reason by analogy, and promoting cross-disciplinary, creative development.\n\nThe course is one of the PKU-DeTao MOOCs, which is a joint effort by Peking University and DeTao Masters Academy. 该课程是“北大-德稻网络开放课程”中的一门，由北京大学与德稻教育联合提供。\n\nHow can I get access to reading materials?\n\nPlease download the materials from designated websites. Western Music in the 20th Century is the main textbook.\n \n\n如何获得课后阅读材料？\n在指定网站下载课后阅读材料，以《20世纪西方音乐》为主要教材。\n\nHow can I have access to the listening resources?\n\nPlease visit the designated websites to complete the listening exercises.\n\n如何获得课后聆赏素材资源？\n在指定网址链接点击课后指定聆赏的音视频资源。\n\nHow can I finish assignments?\n\nWritten and listening exercises will be a part of this course. Please submit them to the specified mailbox after completion.\n \n\n如何完成课后作业？\n课后作业依照情况而定，分为文字作业和聆听作业，完成后直接提交到指定邮箱。\n\nWhat will the exams be like for this course?\n\nThe exams will be open-book written assignments.\n\n如何考试？\n考试将采取开卷考试方式，根据不同学生群体情况，或以论文形式，或以在线考试，或以作业完成情况最终确定成绩。\n\nHow will scores be calculated?\n\nThe grading weights will vary per topics and tasks. Generally, all students can pass the course by completing all specified assignments. The passing score will be primarily decided by the final exam. \n\n考试成绩的计算？\n不同学期课题，不同学习任务，教师将及时调整考试成绩的计算方式。一般情况，在完成课程所指定任务的前提下，学生可以百分之百通过考试。分数确定主要以期末考试为主，期中考试是否举行，以情况而定。\n\nCan I submit graded assignments late? \n\nNo.如果考试方式是论文，是否允许延迟上交？\n绝对不允许。\n\nHow can I best engage with online learning for this course?\n\nApart from the questions gained from the micro lectures, students can also get their questions answered via e-mail, and have access to the discussion forum and online interest groups.\n\n在线学习如何进行？\n课程所提供的课前短课视 频系必读内容，在课后阅读、课后作业和课后聆赏完成过程中，产生的所有问题将被汇总，由教师或以文字邮件的方式或以视频短课录制的方式做出回答。此刻，教 师将根据学生的问题及时安排在线答疑、在线讨论，并发挥网络教学的便利，建立课程讨论区，组织兴趣小组\n\nWhat is the role of the on-campus class for this course?\n\nThe on-campus course will serve students who can attend the class for lectures, which are then recorded and released online.\n\n教师课堂面授的作用？\n为服务可以出席面授的学生，本课程将在在线学习之外，安排固定时间固定长度的教师课程面授，教学活动将被录制，在线发布，以保证在线学习学生的需求。\n\nWill I fail to keep up in the course due to my lack of understanding about the field of music?\n\nOur content is adjusted to a general audience. \n\n课程是否会因在音乐领域积累不足而无法跟进？\n教师依照课程核心，一方面给出清晰课程线索，跟进不难，另一方面，教师尽可能调整课程内容，照顾到全体情况。根据以往的经验，课程结束，同学均可跟进课程标准，且不乏各样收获。\n\nAre there content knowledge pre-requisites for this course?\n\nAn earnest desire to learn and a proactive, professional attitude are more important than prior knowledge of content matter. The learners are expected to absorb the basic content points quickly and use them as a base for further learning.\n\n课程内容秉持怎样的上课标准？教师保持一贯上课理念，认为专业，关于态度，不关乎知识，不会因同学不同程度，顾左右言其他，忽略最核心最关键知识点及问题的涉及。\n\nWhich is more important for this course, knowledge or ability?\n\nThis course is most concerned on the development of music listening ability, though some knowledge of music will be helpful. \n\n课程重视知识还是能力？\n课 程最关心音乐聆听能力的发展，在提供行之有效聆听技术的同时，安排适当知识内容的传授。加之考试不重知识，而重能力，因此，课程中因教室光线不足而造成无 法做太多笔记，恰恰是教师所希望的。课后传发同学的曲目说明，其中所标出的知识点，所指系能力而非知识。在音乐领域，所谓历史是听觉样本，即艺术品本身积 累起来的，而非人名和作品名串联起来的。艺术史，是感觉的历史，不是文字描述的历史。\n\nWhat is the aim of the music puzzle assignment within the course?\n\nThe purpose of the assignment is to prepare and develop audiometry and memory skills.\n\n课程所谓音乐拼图作业的目的是什么？\n作 业的目的，在于听觉甄别力和记忆力的筹备与发展。相当于我们小时候玩得拼图或积木游戏，从局部观察到整体把握，这一训练所形成的对线条、形状、色泽等构成 物的甄别与记忆，不仅是视觉所需，也是发达听觉所必备。多数情况下，类似课程作业的练习，在中国音乐课程中，很少会有。之所以课程一开始便这样做，是因为 知道学生听觉的普遍问题。不少同学在实践之初，会遇到困难，这很正常，如果没有做好接受困难的准备，也就不必来此课程分享，也就不必来北大读书了。\n\nWill the course provide information about music composition and technology?\n\nNo. Music composition mastery requires long-term training, usually at a conservatory level.\n\n课程是否可能或可以提供关于作曲的知识与技术？\n课 程不可能在作曲方面给予单独帮助，通过目前的教学方式，尽管正在探索，教师只能也必须照顾到最大多数同学的需求，这一难处，是客观的，请多谅解。关于作曲 四大件的技术发展，在音乐学院有一套完整的训练程序，乐理是入门，和声是基础，二者建立关于调性音乐系统的初阶。随后的复调写作，作曲系耗时约需一年甚至 更多，根据全面仿作练习，帮助同学发展多声思维和多声部操控技术。配器是第三梯度，约需一年时间完成，全面掌握乐队法。曲式分析，是封顶收官之课。将之前 所有梯队课程的内容，一并总结。\n\nWill the course be available in English?\n\nThe videos in the course will include English subtitles. However, the rest of the course content will only be available in Mandarin.\n\n这门课程使用英语授课吗？\n视频中教师使用中文授课，有英文字幕，但是课程的其他内容，如阅读、作业题、讨论等都只用中文。\n\n                                    ", 
    "end_date": "2013-12-16T00:00:00Z", 
    "title": "04332960X: Music in the 20th Century", 
    "price": 0, 
    "instructors": "Bryan Minghui", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/music-20th-century-pekingx-04332960x", 
    "duration": "12 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2013-09-23T00:00:00Z"
}