{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    20cnwm-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    课程介绍视频也可以访问这里。课程所涉不仅涵盖古典音乐如新古典主义、表现主义、民族主义等流派，也对爵士乐、摇滚乐与流行音乐在20世纪的风格情状投以深切关注；在将包括中国音乐在内的世界各国民族民间音乐纳入20世纪大背景予以研究探索之同时，关于大型综合艺术品例如歌剧、音乐剧、电影音乐的考察与分析，也设为专题，绝无偏废。课程以20世纪西方音乐为主体内容，在清晰贯穿历史线索和侧重史观发展之同时，尤为强调音乐聆听能力的培养，增进音乐知识的积累，凸显理论与实践相结合的开课理念。什么是音乐、什么是20世纪西方音乐、什么是有效聆听成为全课核心知识支柱，引导学生探查关于20世纪西方音乐的三种聆听模式，以期对关于20世纪西方音乐文化诸多现象形成多视角、多维度、多方法、多接口的认识与理解，从而为学生开拓眼界、触类旁通、多学科交叉、创造力之发展，完美人格之形成，提供实际而扎实的服务。If you are having difficulty viewing this video in mainland China, you can also find it here.This course was first offered at Peking University in 2008 as a Public Elective Course, and subsequently as a Course for General Education. It is now being offered globally as one of Peking University’s MOOCs. Addressing students' interests in 20th century Western Music Culture and incorporating music theory, the course examines 20th century Western music. By combining theory and practice, the course not only aims to provide a clear view of the historical development of the music, but also emphasizes the training of aural skills and the accumulation of musical knowledge. The course covers not only classical music, such as neo-classical, expressionism, nationalism and other genres, but also explores in depth jazz, rock, and pop music of the 20th century. While studying Chinese music and other forms of national folk music in the 20th century world music context, students will also analyze large and complex works such as opera, musicals, and film music. By enhancing students’ understanding of 20th century Western music (classical music, pop music, folk music, comprehensive art) as a foundation, three core questions will be addressed: what is music, what is the 20th century Western music, and what is effective listening? The course aims to guide students to examine the three listening modes of 20th century Western music with the hope of forming a diverse and multi-faceted, knowledge and understanding of the 20th-century Western music culture phenomena, expanding students’ horizons, enhancing their ability to reason by analogy, and promoting cross-disciplinary, creative development.\n\n                                            Syllabus\n                        第一讲 音乐的史纲与音乐的风格\n\n西方音乐历史作为可听可感的知识，与20世纪有怎样的不同，20世纪西方音乐又与20世纪之前的西方音乐有着怎样的联系。在进入20世纪之前，关于西方音乐历史的史纲意识，是一种必须培养的基本能力。本将第一部分集中讲解西方音乐历史进程中所呈现的“散而有序”“乐以表情”两大特征，是清晰掌握西方音乐通史框架、展开有效学习的重要准备。形成对音乐风格的认知，是继史纲意识之后的又一大素养。对音乐风格体的把握，更是基本的能力。从音乐风格体的六个构成要素：旋律、节奏、和声、织体、音色、曲式逐一介绍，由聆听对象、聆听方法和聆听顺序，更新对音乐的学习角度和接受角度。\n\n第二讲 音乐的空间与音乐的时间\n\n作为音乐聆听和欣赏的核心技术，音乐的空间一直是全球音乐教学的难题。本讲自“音乐是流动的建筑，建筑是凝固的音乐”的经典美感观点入手，通过有效类比音乐与建筑的共通特点，立足于音乐空间构成的核心材料：音乐的线条和音乐的段落，集中讲解关于音乐空间的接受和理解。通过对《卡农》和《青少年管弦乐指南》等典型音乐作品的深入分析，帮助学习者树立关于音乐空间的基本认识和感知能力，以期为音乐的时间这一后续课题的引入，做足准备。而音乐的时间是关于音乐最重要的核心课题之一。音乐时间感的训练，是全球音乐教学与实践的共同难题。本讲将由节拍型、时值型、节奏型、重拍型、速度型五大流程组成，以生动形象的讲解和练习，帮助训练学习者的音乐时间感，并引导学习者关注和思考生活与音乐的时间相关的种种现象。\n\n第三讲 20世纪西方音乐的多元新秩序特征\n\n在完成之前四讲全面展开的四大阶石入门课之后，从本讲开始，将逐一有序地接触关于20世纪西方音乐的课题。20世纪西方音乐的文化景观是怎样的，如何看待20世纪西方音乐的独特形态，古典、流行、民间三个重要领域在20世纪如何发生影响——通过介绍“音乐的概念”的讨论争鸣，约翰·凯奇的创作实践和音乐思想，引发学习者对于20世纪西方音乐重要议题的关注思考。\n\n第四讲 世纪末情结下的法国音乐：德彪西与拉威尔\n\n19世纪与20世纪之交在法国音乐舞台兴起的印象主义音乐，以德彪西的创作，带来一场改变西方音乐历史进程的革命。从本讲开始接触印象主义——20世纪西方音乐四大听觉样式风潮之一。通过介绍印象主义音乐与绘画、诗歌等领域相互影响，德彪西音乐语言的探索，个人风格的形成，帮助学习者掌握德彪西音乐的聆听顺序，了解印象主义音乐的基本风貌。拉威尔是重点研究的另一位印象主义音乐大师。本讲通过介绍拉威尔的创作历程，聆听各领域的重要作品，细致分析《波列罗》，帮助学习者接触拉威尔在印象主义中风格独标的音乐技法与内在激情；从拉威尔与德彪西的不同处理技法中，得到对印象主义音乐色彩斑斓背后的一些基本认识；进一步体会音乐的三种基本聆听形态。\n\n第五讲 表现主义与勋伯格、贝尔格、韦伯恩\n\n20世纪西方音乐四大听觉样式风潮之二，用时两讲。 根据新维也纳乐派师徒三人各自的创作历程和听觉变化阶段，表现主义音乐与诗歌、绘画相互间的联系，讲述表现主义音乐家所面对的现实世界和精神世界。以开放的心态、开放的耳界为旨，帮助学习者接触表现主义作品的美感表达和美学思想，理解无调性、十二音等音乐技法，思考历史上存在的作曲家与听众的三种关系。根据新维也纳乐派师徒三人各自的创作历程和听觉变化阶段，表现主义音乐与诗歌、绘画相互间的联系，讲述表现主义音乐家所面对的现实世界和精神世界。以开放的心态、开放的耳界为旨，帮助学习者接触表现主义作品的美感表达和美学思想，理解无调性、十二音等音乐技法，思考历史上存在的作曲家与听众的三种关系。\n\n第六讲 新古典主义与斯特拉文斯基、欣德米特、法国六人团\n\n新古典主义是20世纪上半叶出现在西方音乐创作领域的第三大重要流派。 本讲通过介绍俄罗斯、德国、法国等国家，斯特拉文斯基、欣德米特、六人团等音乐家的创作历程与代表作品，综合考察这一音乐风格的形成，帮助学习者对新古典主义音乐得法聆听，全面理解。\n\n第七讲 民族主义：匈牙利、英国、美国、俄罗斯\n\n20世纪西方音乐四大听觉样式风潮之四，重点介绍巴托克、科普兰、格什文、威廉斯、布里顿等代表作曲家，通过展现巴托克探索匈牙利民族主义音乐之路、英国民族主义的音乐复兴之路、美国民族主义音乐的振兴之路，帮助学习者理解“民族主义”这一重要风格标签的内涵，了解民族主义在1945年前后乃至整个20世纪西方音乐创作领域中，所提供给音乐家的不竭灵感。俄罗斯在苏联时期，有着不容低估的音乐成就，通过对普罗科菲耶夫和肖斯塔科维奇的集中介绍，引导学习者接触二人在不同历史时期的本土心境与多样风格，了解俄罗斯民族主义音乐家在20世纪的重要贡献。\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "20世纪西方音乐 Western Music in the 20th Century", 
    "price": 0, 
    "instructors": "毕明辉 Bryan Minghui BI ", 
    "institution_name": [
        "Peking University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/course/20cnwm", 
    "duration": null, 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-09-15T00:00:00Z"
}