{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    With the power to cross borders and languages, music serves as a compelling tool for unlocking creative potential.\r\nCreativity: Music to My Ears is a six week course designed to explore several factors that stimulate creativity in individuals, teams, and organizations. In each session we will focus on a different variable related to creativity, such as reframing problems, connecting and combining ideas, and challenging assumptions. All of the projects in this experiential course will deal with some aspect of music, including listening, creating, and sharing. No musical talent is required - just an interest in exploring the role that music plays in our lives.\r\nTo deepen your understanding of music, throughout the course we will include video clips from experts in the music industry, including world-renowned Warner Music recording artists, Stanford music scholars, and industry executives who work to bring new and innovative musical expression to a global audience.\r\nThe course includes weekly projects that will each take approximately 5 hours to complete. Each Wednesday a new challenge will be presented, and the results are due the following Tuesday. The first two weeks there individual challenges, followed by a two week team project, and a final individual assignment.\r\nFor the two-week, team project, you can select your own team members, we can put you on a team, or you can work by yourself. All assignments will be submitted on the course website and viewed by fellow class participants, allowing you to see a breadth of solutions for each challenge and get feedback on your work. There will also be a course Twitter feed and Facebook page, and several Google Hangouts that will enable active discussions on specific topics.\r\nAs Plato is quoted as saying, \"Music gives a soul to the universe, wings to the mind, flight to the imagination, and life to everything.\"\r\n \n\n                                    ", 
    "end_date": "2014-05-14T00:00:00Z", 
    "title": "Creativity: Music to My Ears", 
    "price": 0, 
    "instructors": "Tina Seelig", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "1-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://novoed.com/creativity-music", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "NovoEd"
    ], 
    "start_date": "2014-04-02T00:00:00Z"
}