{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    The string quartet can be defined in several ways. At the most basic level the musical term refers to the medium of four string instruments: two violins, viola, and violoncello. It can also be used to describe the collective identity of the instrumentalists themselves, in particular established professional ensembles. One such ensemble is the St. Lawrence String Quartet, Stanford University’s celebrated ensemble-in-residence, whose members are featured in this course, performing in Stanford’s 842-seat Bing Concert Hall as well as in that splendid facility’s smaller studio space.\r\nThanks to Joseph Haydn, the acknowledged father of the string quartet, the medium evolved into a genre. It is Haydn’s compositions for the medium above all — he composed 68 of them — that established the formal conventions and aesthetic values that secured the string quartet a special status and significance in Western musical culture. As developed by Haydn, the quartet became the preferred vehicle through which composers ever since, from Mozart to John Adams, have honed and displayed their compositional craft.\r\nTechnique and expression go hand in hand. The German poet Goethe described the quartet in terms of a musical conversation. For the audience, Goethe wrote, a quartet performance is like “listening to four rational people conversing among themselves.” Reflecting aesthetic sensibilities commonly associated with the genre in the Enlightenment age of Haydn, Mozart and Beethoven, the conversation metaphor nicely captures two defining features of the genre: its intimate, personal nature as well as its capacity to convey profound musical thought through the essential ingredients of four-part harmony and counterpoint. And, as Haydn’s compositions amply demonstrate, the medium of the string quartet can also lend itself to the expression of wit and humor.\r\nThis course, in defining the string quartet in these various ways, pays particular attention to Haydn’s towering, history-shaping achievement. In the first part of the course, after providing some general background on the origins of the medium in the seventeenth and early eighteenth century, we look at some examples of early string quartet writing by Allegri, Scarlatti and early-period Haydn. In the second half, because the very essence of the genre resides in musical detail and nuance, we develop the tools for informed listening and appreciation by presenting an in-depth analysis of a single work, Haydn’s String Quartet in F minor, opus 20, no. 5 from 1772. With frequent musical illustrations by the St. Lawrence Quartet, we explore the F-minor Quartet in terms of three complementary concepts: form, language, and gesture.\r\nIn a concluding section we analyze the final movement, comparing Haydn’s use of the compositional technique known as “fugue” to other fugues by Bach, Handel and Mozart. By means of this “learned style,” we argue, the composer connects his musical language to ecclesiastical traditions, just as the movement’s rhetorical character reflects his penchant for musical effects drawn from the world of opera. The aesthetic spheres of the chamber, church and theater converge. Haydn thus defines his watershed opus — in microcosm — as something at once intimate, recondite and playful.\n\n                                    ", 
    "end_date": null, 
    "title": "Defining the String Quartet: Haydn", 
    "price": 0, 
    "instructors": "Stephen Hinton", 
    "institution_name": [
        "Stanford University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://lagunita.stanford.edu/courses/course-v1:HumanitiesSciences+StringQuartet1+selfpaced/about", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Stanford OpenEdx"
    ], 
    "start_date": "2016-05-17T00:00:00Z"
}