{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    Learn the basic concepts and approaches needed to understand, create, and perform contemporary music.\n\nIf you have a passion for music and are curious about how it works, or if you are a musician who learned to play by ear without formal study, this course will provide you with an engaging introduction to key concepts and approaches needed to understand, create, and perform contemporary music. Taught by Berklee College of Music professor George W. Russell, Jr., the course includes six lessons that delve into harmony and ear training—two areas of intensive focus for every entering Berklee student. \n\nThe course will teach you the major scale and minor pentatonic scale, and how they are constructed. You will learn what intervals are, how to sing them, and how to find them in music. The course explores tonal centers and how to find the key a song is in, in addition to common time signatures such as 4/4 and 3/4. You will learn how to build chords—major and minor triads, and major and dominant seventh chords—and how to build a common chord progression—the I IV V. You will also learn how to recognize the blues and AABA song forms, and write a basic chord sheet to express your song ideas. \n\nIn addition to the video lectures, each lesson features Berklee student performances and interviews. The students share their musical journey and offer advice for those wanting to study music. The course culminates with an assignment that asks you to compose and perform a riff blues tune using the minor pentatonic scale. Above all, the course is designed to share the joy of creating music and sharing it with others.\n\nShannon Jacob will be your Teaching Assistant (TA) for the course. A recent graduate of Berklee, Shannon majored in Contemporary Writing and Production. Hailing from the island of Sri Lanka where she was the Director of Music.inc; a non profit show choir that granted the wishes of terminally ill children. She is a firm believer that music can be used as a powerful tool to educate and inspire those around her.\n\n                                            Syllabus\n                        Welcome to Developing Your MusicianshipWelcome to the course! Here we will cover all the details about the course and what you'll need to know to get the most out of your experience.The Major ScaleThis week, you'll learn about harmony and ear training and why they are important. You'll learn how to construct a major scale, how to identify and sing Major 2nd and Major 3rd intervals, and how to find the tonal center of a song.Major and Minor TriadsThis week, you'll learn how to identify Perfect 4th and Perfect 5th intervals and how to build major and minor triads. You will also learn about one of the most common chord progressions: the I IV V. Minor Pentatonic ScaleThis week, you will learn how to identify Major 6th and Major 7th intervals. You will also learn how to build and sing the Minor Pentatonic Scale. Major and Dominant Seventh ChordsThis week, you'll learn how to build Major and Dominant Seventh chords. You will also learn another common chord progression: the Blues Progression. Song FormThis week, you will learn about 7-3-5 chord voicings and 4/4 and 3/4 time signatures. You will learn about two different song forms - Blues and AABA - and you will learn how to write and read a chord sheet. ReviewThis week is a review of the past 5 weeks. You will also learn how to compose a blues riff tune using the Minor Pentatonic Scale. \n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Developing Your Musicianship", 
    "price": 0, 
    "instructors": "George Russell", 
    "institution_name": [
        "Berklee College of Music"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/develop-your-musicianship", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}