{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #3 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                            \n                            \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Music\n                                                            \n                            \n                                                \n                    \n                    \n                    This course, part 1 of a 2-course sequence, examines the history of rock, primarily as it unfolded in the United States, from the days before rock (pre-1955) to the end of the 1960s. This course covers the music of Elvis Presley, Chuck Berry, Phil Spector, Bob Dylan, the Beatles, the Rolling Stones, Jimi Hendrix, Cream, and many more artists, with an emphasis both on cultural context and on the music itself. We will also explore how developments in the music business and in technology helped shape the ways in which styles developed. \n\nRock emerged in the mid 1950s as a blending of mainstream pop, rhythm and blues, and country and western--styles that previously had remained relatively separate. This new style became the music of the emerging youth culture and was often associated with teen rebellion. We will follow the story of how this rowdy first wave of rock and roll (1955-59) was tamed in the early 60s but came roaring back with the Beatles and the Rolling Stones and then went psychedelic by the end of the decade.\n\n                                            Syllabus\n                        IntroductionThe World Before Rock and Roll (1900-1955)The Role of Tin Pan Alley in mainstream pop, the formation of a national audience through radio and the rise of television, the pre-rock pop of Frank Sinatra, Patti Page, and Les Paul and Mary Ford; rhythm and blues in the years before rock and roll; country and western and the rise of Nashville.The Birth and First Flourishing of Rock and Roll (1955-59)Chart crossover and cover versions, the first hits of Bill Haley, Chuck Berry, Fats Domino, and Little Richard, the rise of Elvis Presley, the music of Jerry Lee Lewis and Buddy Holly, the rise of American Bandstand, the payola scandal and the \"death of rock and roll.\"The Demise of Rock and the Promise of Soul (1959-63)Was this era the dark ages for rock music or was it a golden era cut short by the British invasion? The music of teen idols, the folk revival, early surf music, sweet soul, rockabilly pop, and girl groups. The Brill Building songwriters and the rise of the producer. Playlets and splatter platters.The Beatles and the British Invasion (1964-66)The Beatles transform the UK music scene and then invade America. Other Beatles-type British bands. The London blues scene and the Rolling Stones. Other Stones-type bands. The Who and the Kinks.American Responses (1965-67)Dylan, the Byrds and folk rock. Garage bands in the northwest. Sonny and Cher and the legacy of Phil Spector. TV rock, Paul Revere and the Raiders, and the Monkees. Music in New York and Los Angeles.Motown Pop and Southern Soul (1960-69)Berry Gordy and the rise and first flourishing of Motown. Atlantic, Stax, and southern soul (Memphis, Muscle Shoals, New York). Parallels between Motown and Stax. James Brown and the roots of funk. Psychedelia (1966-69)How can music be psychedelic? Underground psychedelic scenes in San Francisco and London. Psychedelia in LA. The Summer of Love and the rise of hippie culture. The birth of FM rock and rock magazines. Woodstock and Altamont.Final ExamFinal exam for this course.\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "History of Rock, Part One", 
    "price": 0, 
    "instructors": "John Covach", 
    "institution_name": [
        "University of Rochester"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/history-of-rock", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}