{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    This course provides exclusive access to the team, talent, and technology that transform how we create and consume music and video. We include interviews and case studies from companies such as Pandora, Native Instruments, Dolby, Sonos, LANDR, iZotope, Universal Audio, and more! Learn how to succeed in roles such as: research &amp; development, marketing, hardware engineering, industrial design, and the hiring and interview process.  \n\n                                            Syllabus\n                        Session 1: Hardware Engineering We listen to our music with high quality headphones and speakers, and enjoy room to room wireless audio and Bluetooth syncing among our devices. We plug-in our guitars to a stomp box and guitar amp, or use a MIDI keyboard to play some synth parts and record a vocal line with a microphone into an audio interface on our laptop. Or some of us have the privilege of working on an 80-fader mixing console. This is all enabled by hardware engineers. From the analog circuit design, to the power amplifiers, designing customer chips, industrial design, manufacturing millions of units, and wireless synchronization. In audio and music, their work makes music more visceral - creative, tactile, and sounding amazing.\r\nSession 2: Marketing The world's greatest product do not sell themselves - and I’ve seen firsthand how product launches can make or break years of R&amp;D. Marketing is about connecting to the customer - identifying who they are, what their needs and motivations are, how and where to deliver them, how to price them, and how to promote the products. Why should they care about your product? How do you keep them engaged in your community, happy with your product, and purchasing future products?\r\nSession 3: Research &amp; Development This session explores the teams and technology behind leading algorithms and advanced technologies. We look at how the R&amp;D is developed, prioritized, and implemented - and the technical and interpersonal skills these engineers use to succeed. We’ll look at Pandora’s music recommendation algorithm, audio signal processing algorithms from iZotope, and the audio fingerprinting algorithms that allow our mobile devices to recognize songs in 3 seconds or less! We’ll talk about how the R&amp;D engineers might often get a lot of the credit, but the core algorithm might only be 5% of the total work developed!\r\nSession 4: Product &amp; Industrial Design This session goes behind the scenes of the design of hardware controllers, mixing consoles, and hardware interfaces.\r\nSession 5: Intellectual Property (Patents And Employment Agreements) Learn about the contracts that all employees sign, including the impact of NDAs, non-compete agreements, invention assignment agreements, and prior invention agreements. Explore the world of patents and trademarks.\r\nSession 6: Hiring, Resumes, Interviews, And Job Offers How do you get into a company? What do HR managers and hiring managers look for when they are screening your resumes for a music and audio industry job, interviewing you, and coaching you through your career? Meet Johanna (HR Director) and Sedef (University Recruiter, Sonos)\n                                    ", 
    "end_date": "2016-03-01T00:00:00Z", 
    "title": "Inside the Music & Video Tech Industry", 
    "price": 0, 
    "instructors": "Jay LeBoeuf", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.kadenze.com/courses/inside-the-music-video-tech-industry/info", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Kadenze"
    ], 
    "start_date": "2016-01-19T00:00:00Z"
}