{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    Aprende sobre el proceso de producción de música -incluyendo la grabación, la edición y la mezcla- y sobre las herramientas disponibles para crear música contemporánea en tu computadora.\n\n                                            Syllabus\n                        Bienvenido a Introducción a la ProducciónBienvenido a Introducción a la ProducciónSonido y flujo de la señalComenzaremos con algo de información sobre la naturaleza del sonido y sobre cómo lo percibimos. Estudiaremos los componentes necesarios para grabar audio en la computadora, con el fin de comprender los dispositivos que el sonido debe atravesar durante el proceso de producción de música.El EADLa herramienta de edición contemporánea es la estación de trabajo de audio digital (EAD), un software que almacena y organiza todos los componentes de un proyecto musical. Nos centraremos en las herramientas de edición, esenciales para la producción de música contemporánea, que todas las EAD proveen.La mezcladoraEstudiaremos las funciones básicas del hardware y el software de las consolas mezcladoras de sonido, incluyendo volumen, panorámicas, mute, buses, inserciones, envíos y submezclas.Efectos dinámicosEl sonido debe ser procesado y modificado del estado de grabación para encajar con el contexto de la música. Esta semana nos centraremos en las herramientas que se pueden utilizar para dar efectos a la dinámica de las pistas y cómo usarlas en un contexto musical.Filtro y efectos de delayEl sonido grabado puede modificarse usando herramientas que efectúan cambios en la calidad real del sonido. Esta semana veremos la ecualización y el delay, y estudiaremos los diversos efectos de sonido que se derivan de estos dispositivos.SíntesisEstudiaremos el sintetizador, una herramienta muy importante dentro de la producción de música contemporánea. Aprenderemos cómo funciona el sintetizador, el cual te dará un lenguaje para describir el sonido. La música es una forma de arte colaborativa, por lo tanto, no hay nada más poderoso que una comunicación efectiva.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Introducción a la producción de música", 
    "price": 0, 
    "instructors": "Loudon Stearns", 
    "institution_name": [
        "Berklee College of Music"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/produccion-musical", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}