{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    While Italian opera set the standard in the Baroque era, German composer George Frederic Handel quickly gained popularity for his oratorios, which put operatic techniques to work in the service of sacred music. Handel’s Messiah premiered in Dublin on April 13, 1742, and remains popular to this day. Harvard’s Thomas Forrest Kelly (Morton B. Knafel Professor of Music) guides learners through Messiah’s musical highlights, while detailing Handel’s composition process, the preparations and rehearsals, and the premiere performance.\n\nLearners in this module of First Nights need not have any prior musical experience. In this unit, you will learn the basics of musical form and analysis, the genres and styles used in Messiah, the circumstances of its first performance, and its subsequent history. \n\nAdditional First Nights Modules:Beethoven’s 9th Symphony and the 19th Century Orchestra\n\nHarvardX requires individuals who enroll in its courses on edX to abide by the terms of the edX honor code. HarvardX will take appropriate corrective action in response to violations of the edX honor code, which may include dismissal from the HarvardX course; revocation of any certificates received for the HarvardX course; or other remedies as circumstances warrant. No refunds will be issued in the case of corrective action for such violations. Enrollees who are taking HarvardX courses as part of another program will also be governed by the academic policies of those programs.\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nHarvard University and HarvardX are committed to maintaining a safe and healthy educational and work environment in which no member of the community is excluded from participation in, denied the benefits of, or subjected to discrimination or harassment in our program. All members of the HarvardX community are expected to abide by Harvard policies on nondiscrimination, including sexual harassment, and the edX Terms of Service. If you have any questions or concerns, please contact harvardx@harvard.edu and/or report your experience through the edX contact form.\n\n                                    ", 
    "end_date": "2015-12-06T00:00:00Z", 
    "title": "MUS24.2x: First Nights: Handel’s Messiah and Baroque Oratorio", 
    "price": 0, 
    "instructors": "Thomas Forrest Kelly", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "2-3 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/first-nights-handels-messiah-baroque-harvardx-mus24-2x", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-11-15T00:00:00Z"
}