{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    Innovations in music rank among America’s most significant contributions to global culture, none more so than jazz. From its humble beginnings as dance hall entertainment, jazz is now embraced as an art form, respected and imitated the world over.\n\nThis music course addresses jazz from a listener’s perspective, but calls on professional jazz musicians to help us engage with this often mysterious aural experience. This six-week course will enable interaction with the basic components of jazz (swing, improvisation, structure and personal expression) while providing an inside connection to the artists who perform it.\n\nContent includes excerpts from the 300+ video interviews gathered with jazz personalities for the Fillius Jazz Archive, select scholarly readings and demonstrations offered by the instructor, a working musician. Students will engage in user-friendly activities that include listening, responding, counting, and internalizing the concepts that make jazz work. Rarely heard stories and anecdotes offered by our interviewees will stimulate the imagination and provide rich content for open discussion.\n\nJazz: The Music, The Stories, The Players will appeal equally to the casual listener, the avid fan and the proficient jazz player.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "MUSIC160x: Jazz: The Music, The Stories, The Players", 
    "price": 0, 
    "instructors": "Monk Rowe", 
    "institution_name": [
        "Hamilton"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/jazz-music-stories-players-hamiltonx-music160x-0", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-09-06T00:00:00Z"
}