{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    Join us as we explore the fundamental principles and early stages of teaching violin and viola through a series of engaging video lectures and lesson demonstrations, including: 1) Master classes with some of the world’s top string pedagogues, 2) Individual lesson demos of teaching violin/viola set up, left and right hand technique and pieces from the early violin/viola repertoire, 3) Group lesson demos of teaching music theory, ear training and fun activities that encourage good playing habits, and 4) A “field trip” to the violin shop, where we will outfit a new beginning student with a proper instrument and bow. You’ll also engage in a series of discussions and reflections with colleagues and peers across the globe. Upon completion of this course, we hope you’ll return to your studio with confidence, a new curriculum, and a renewed approach to sharing with your students the joyful experience of making beautiful music.\n\n                                            Syllabus\n                        Beginning StagesWelcome to Teaching the Violin and Viola: Creating a Healthy Foundation! We will begin by covering leading philosophies and pedagogical theories about teaching children the violin and viola. The beginning stages will cover the child’s setup, posture and first left hand techniques.Bow Arm and HandTo introduce the use of the right hand, we start by creating a “pinky house” for the child’s bow. We delve further into the violin setup and positioning through various creative exercises.Putting It All TogetherNow we get to put it all together by slowly incorporating the different movements of the right and left hand through four different pieces.Pieces in the Key of A MajorAfter good setup and posture have been established, we start teaching the fundamentals through elementary pieces in the key of A Major. We also get to learn our first scale!Playing with the Whole BowTo transition to using the full bow, we introduce the “adult “ bow hold and a series of exercises to extend the bow stroke. Pieces include Long, Long Ago, O Come, Little Children, and Butterfly, Flutterby.Pieces in the Key of D MajorWe can now introduce the key of D Major.  Students learn the D major scale along with pieces such as Bach Musette and Hushabye Lullaby. Pieces in the Key of G MajorWhen we progress to the G Major scale and arpeggio, we start adding etudes and more advanced technical concepts. Pieces covered include Minuet and Happy Farmer.Note Reading, Vibrato, and the Group ClassTo teach note reading, we will cover the best-practice teaching techniques for note reading and vibrato. We will also explore group teaching, group games, and group dynamics.Favorite Exercises for the Older StudentNow that our students are getting more advanced, we can begin to cover our favorite exercises for the older student. Exercises include \"Poof Bow\" and the \"Invisible Violin.\"The Master ClassIn our final segment, we will learn from top pedagogues Mimi Zweig and Roland and Almita Vamos in a master class setting. \n                                    ", 
    "end_date": "2014-12-01T00:00:00Z", 
    "title": "Teaching the Violin and Viola: Creating a Healthy Foundation", 
    "price": 0, 
    "instructors": "Stacia Spencer", 
    "institution_name": [
        "Northwestern University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/teach-violin-lessons", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-09-22T00:00:00Z"
}