{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    The blues is an American art form and the most important musical form in jazz. Although there are other formal paradigms of the blues, such as 8-bar or 16-bar, this course focuses on different incarnations of the 12-bar blues. There are considerable differences between Early Jazz blues, Swing blues, Bebop blues, Modal blues, and Post Bop blues. Each type has its unique harmonic syntax, melodic vocabulary and, associated with them, improvisational techniques. While other aspects of jazz performance practice have been constantly changing from one stylistic convention to another, the blues has never lost its identity and expressive power, and continues to exert a powerful influence on the harmonic and melodic syntax of jazz.\n\nThis seven-week course explores important aspects of the blues, blues improvisation, basic keyboard textures, jazz harmonic and melodic syntax. Topics include: (1) Blues Progressions; (2) Blues and Other Scales; (3) Improvisational Tools, and others. This course will also cover valuable theoretical concepts enabling the student to master the art of jazz improvisation. Each topic will be introduced from a practical perspective with the clearly stated goal: to improve one’s improvisational skills. Jazz improvisation is rooted in spontaneity, creativity, self-expression and, at the same time, self-control and order. A unique pedagogical approach based on a one-to-one musical interaction conducted with different instrumentalists will help to reinforce many of the concepts introduced in this course and realize its stated objectives.\n\n                                            Syllabus\n                        Blues Progressions – Theory and Practice Lesson 1 focuses on foundational aspects of the blues, examining its history, innovation, and evolving harmonic structure. At the end of this lecture, students should have a firm understanding of the harmonic structure of the basic, generic, and minor blues forms, as well as a familiarity with the A A’ B phrase-structure of the blues.\nBlues Scales Lesson 2 dives into what makes the blues tick, beginning with an examination of the blues scale and the basics of jazz rhythms and blues riffs. Students will then explore call and response techniques and application of the blues scale in improvisation through demonstration with a live musician.\nKeyboard Realization Lesson 3 introduces the concept of guide tones and its association with invertible counterpoint. Four-part and five-part chords are discussed in detail by exploring their construction and function, as well as techniques to facilitate good voice-leading between chords using chordal inversions.\n“Bird” Blues and Other Blues ProgressionsIn lesson 4 students analyze harmonic progressions from 3 jazz standards: “Now’s The Time,” “Billie’s Bounce,” and “Blues For Alice.” Practice techniques are discussed, including ear-training strategies, rhythmic displacement, and voice-leading exercises. Improvisational Tools Lesson 5 introduces 3 more jazz standards for analysis: “Mr. PC,” “Mr. Day,” and “Isotope.” Tritone substitutions are examined, and pentatonic scale as tools in improvisation are introduced through exploration of their construction, typical voicings, and voice-leading principles.Improvising the Blues – Part 1 Lesson 6 centers around the demonstration of improvisational techniques discussed thus far, including motivic development, guide-tone lines, and chordal arpeggiation. Observation of live Eastman musicians, as well as play-along tracks provided by the rhythm section, allow the student to imitate, assimilate, and apply the techniques discussed in the course.\nImprovising the Blues – Part 2Lesson 7 explores modal categories and scalar patterns in improvisation, in addition to continued discussion on pentatonics. As in the previous lesson, live musicians demonstrate key concepts and principles presented in the lecture, with additional play-along tracks provided for the student to explore concepts on their own. \n\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "The Blues: Understanding and Performing an American Art Form", 
    "price": 0, 
    "instructors": "Dariusz Terefenko", 
    "institution_name": [
        "University of Rochester"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/the-blues", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}