{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    The Music of the Beatles will track the musical development of the band, starting from the earliest days in Liverpool and Hamburg, moving through the excitement of Beatlemania, the rush of psychedelia, and the maturity of Abbey Road. While the focus will be on the music, we will also consider how recording techniques, the music business, the music of other artists, and the culture of the 1960s affected John, Paul, George, and Ringo as they created the Beatles repertory.\n\nThere is probably no band or artist that has had more written about their music than the Beatles. There are many good books on the band's biography, several insider accounts offering glimpses behind the scenes, books that interpret the meaning of the songs, and even books that catalog dates and people regarding the band. This course will try to synthesize much of that information into an account of the Beatles' development as musicians and songwriters.\n\n                                            Syllabus\n                        Introduction and Special FeaturesEarly Day and Success in the UKThe Beatles as pop craftsmen. Study of cover versions at Cavern and Hamburg shows, Please Please Me, With the Beatles, and the singles from this period.Success in America and the WorldThe Beatles begin to move toward the artist model. Music from  A Hard Day's Night, Beatles For Sale, and singles from this period. From this point on we will closely follow particular authorship of songs, keeping track of John, Paul, and George as individual songwriters.Pop MaturityIncreased experimentation, still mostly within the context of the pop single. The increasingly important role of the recording studio and recording techniques and innovations. Help!, Rubber Soul, and singles from this period.PsychedeliaThe artist model comes into full bloom. The rise of importance of the album and idea-driven projects. Revolver, \"Penny Lane,\" \"Strawberry Fields,\" Sgt. Pepper, Magical Mystery Tour, and other singles from this period, including the tracks that would end up on Yellow Submarine.A Co-Op of Singer-SongwritersThe White Album both begins a return to roots while also continuing the musical experimentation of the earlier music, but now each song is less of a group effort. Creative differences arise.  The White Album and singles from this period.Get BackOnce there was a way to get back home. The Get Back sessions embrace a return-to-simplicity approach but are aborted. Abbey Road attempts to get back to the band's previous manner of working. Let It Be combines material from Get Back with newly recorded tracks. Abbey Road, Let It Be, and singles from this period.\n                                    ", 
    "end_date": "2016-08-08T00:00:00Z", 
    "title": "The Music of the Beatles", 
    "price": 0, 
    "instructors": "John Covach", 
    "institution_name": [
        "University of Rochester"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.coursera.org/learn/the-beatles", 
    "duration": "7 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}