{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                            \n                            \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Art &amp; Design\n                                                                                                    &gt; Music\n                                                            \n                            \n                                                \n                    \n                    \n                    Louis Armstrong. Charlie Parker. John Coltrane. You’ve heard their names, but do you know what makes them great? In Jazz Appreciation, you will learn what these artists and many others contributed to America’s great original art form, revered the world over for its innovation and creativity. Jazz emerged during a time of tremendous change and upheaval in American society; this course will also discuss how its evolution both reflected and contributed to those changes.\n\nMuch more than a lecture series, Jazz Appreciation weaves in musical performances and examples that will deepen your understanding of the musical process and develop your ability to identify and analyze different jazz eras and great jazz soloists. It also incorporates cutting-edge adaptive learning technology that will allow you to practice your new knowledge and skills, at your own pace, until you reach mastery.\n\nJoin this course to enhance your enjoyment of jazz by developing an informed understanding and deep appreciation of the art.\n\nPlease note: This course includes a wealth of music. In sensitivity to artists’ rights, course videos including music are available for a limited time only. Materials are released weekly on Saturday mornings, and videos are removed nine days later, on Sunday nights. Please plan to keep pace with the course in order to get the most out of it. \n\n \n\n                                    ", 
    "end_date": "2016-03-29T00:00:00Z", 
    "title": "UT8.03x: Jazz Appreciation", 
    "price": 0, 
    "instructors": "Jeffrey Hellmer", 
    "institution_name": [
        "The University of Texas at Austin"
    ], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.edx.org/course/jazz-appreciation-utaustinx-ut8-03x", 
    "duration": "10 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-01-19T00:00:00Z"
}