{
    "selfpaced": false, 
    "topic_name": [
        "Music"
    ], 
    "description": "\n\n                    \n                    \n                    The objective of the course is to stimulate you to become a cultural explorer in your own community by discovering music traditions outside the normal day-to-day music heard on mass media. In the event that your community is small with minimum diversity then you are encouraged to explore your own cultural family heritage.Each module will build the your listening skills using the basic musical elements of Rhythm, Melody, Harmony, Texture and Dynamics progressively. This is to aid you in listening and analysing the cultural musics used in the course. Each module includes basic musical, cultural and ethnomusicological concepts.\r\nWhat will I learn?\r\n\r\nDevelop an understanding of musical concepts\r\nLearn about how four different tradition express cultural music\r\nApply techniques for gathering and documenting World Music performances\r\nDefine what World Music represents and how to find and access world music communities in your local environment\r\nDevelop an appreciation of different musical traditions and how they create cultural identity.\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nFilm-making and animation production\r\nMusic and performance management\r\nConferences and events production management\r\nMusic and theatrical performances and venues\r\nTraining and educational technology\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: RHYTHM IN MOTION\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: HEAR THE MELODY\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: COME TOGETHER IN HARMONY\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: BLENDING THE DRAMA\r\n\r\n\r\n\r\n\n                                    ", 
    "end_date": "2016-02-08T00:00:00Z", 
    "title": "World Music", 
    "price": 0, 
    "instructors": "Dr David Salisbury", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Art & Design"
    ], 
    "course_url": "https://www.open2study.com//node/1788", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Open2Study"
    ], 
    "start_date": "2016-01-11T00:00:00Z"
}