{"selfpaced": false, "topic_name": ["Theoretical Computer Science"], "description": "\n\n                    \n                    \n                    Experienced Computer Scientists analyze and solve computational problems at a level of abstraction that is beyond that of any particular programming language.  This two-part class is designed to train students in the mathematical concepts and process of \"Algorithmic Thinking\", allowing them to build simpler, more efficient solutions to computational problems.\n\nIn part 2 of this course, we will study advanced algorithmic techniques such as divide-and-conquer and dynamic programming.  As the central part of the course, students will implement several algorithms in Python that incorporate these techniques and then use these algorithms to analyze two large real-world data sets.  The main focus of these tasks is to understand interaction between the algorithms and the structure of the data sets being analyzed by these algorithms.\n\nOnce students have completed this class, they will have both the mathematical and programming skills to analyze, design, and program solutions to a wide range of computational problems.  While this class will use Python as its vehicle of choice to practice Algorithmic Thinking, the concepts that you will learn in this class transcend any particular programming language.\n\n                                            Syllabus\n                        Module 3 - Core MaterialsSorting, searching, big-O notation, the Master TheoremModule 3 - Project and ApplicationClosest pairs of points, clustering of points, comparison of clustering algorithmsModule 4 - Core MaterialsDynamic programming, running time of DP algorithms, local and global sequence alignment Module 4 - Project and ApplicationComputation of sequence alignments, applications to genomics and text comparison\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Algorithmic Thinking (Part 2)", "price": 0, "instructors": "Luay Nakhleh, Scott Rixner and Joe Warren", "institution_name": ["Rice University"], "commitment": "7-10 hours", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/algorithmic-thinking-2", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}