{"selfpaced": false, "topic_name": ["Theoretical Computer Science"], "description": "\n\n                    \n                    \n                    Experienced Computer Scientists analyze and solve computational problems at a level of abstraction that is beyond that of any particular programming language.  This two-part course builds on the principles that you learned in our Principles of Computing course and is designed to train students in the mathematical concepts and process of \"Algorithmic Thinking\", allowing them to build simpler, more efficient solutions to real-world computational problems.\n\nIn part 1 of this course, we will study the notion of algorithmic efficiency and consider its application to several problems from graph theory.  As the central part of the course, students will implement several important graph algorithms in Python and then use these algorithms to analyze two large real-world data sets.  The main focus of these tasks is to understand interaction between the algorithms and the structure of the data sets being analyzed by these algorithms.\n\nRecommended Background - Students should be comfortable writing intermediate size  (300+ line) programs in Python and have a basic understanding of searching, sorting, and recursion. Students should also have a solid math background that includes algebra, pre-calculus and a familiarity with the math concepts covered in \"Principles of Computing\".\n\n                                            Syllabus\n                        Module 1 - Core MaterialsWhat is Algorithmic Thinking?, class structure, graphs, brute-force algorithmsModules 1 - Project and ApplicationGraph representations, plotting, analysis of citation graphsModule 2 - Core MaterialsAsymptotic analysis, \"big O\" notation, pseudocode, breadth-first searchModule 2 - Project and ApplicationConnected components, graph resilience, and analysis of computer networks\n                                    ", "end_date": "2016-06-27T00:00:00Z", "title": "Algorithmic Thinking (Part 1)", "price": 0, "instructors": "Luay Nakhleh, Scott Rixner and Joe Warren", "institution_name": ["Rice University"], "commitment": "7-10 hours", "subject_name": ["Computer Science"], "course_url": "https://www.coursera.org/learn/algorithmic-thinking-1", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}