{"selfpaced": true, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    Learn the basics of Android and Java programming, and take the first step on your journey to becoming an Android developer! \n\nThis course is designed for students who are new to programming, and want to learn how to build Android apps. You don’t need any programming experience to take this course. If you’ve been using a smartphone to surf the web and chat with friends, then you’re our perfect target student! \n\nLearning anything new can be tough. We will walk you through the process of making Android apps, but to get the most out of this course, you must bring your enthusiasm for learning, and budget time on your calendar to learn with us.\n\nBy the end of the course, you’ll build two simple (but powerful) apps that you can share with your friends. We also hope that you will learn enough through this course to decide how best to continue your journey as an Android app developer, if you're interesting in pursuing such a path.Why Take This Course?If you're a consumer of technology, this course will help you to become a *creator* of technology. You are only limited by your imagination! \n\nAndroid powers over 80 percent of the world’s smartphones, and represents an incredible opportunity for developers everywhere. The next billion people coming online will interact with the internet for the very first time on a mobile device. Building for Android gives you the best opportunity to reach these users and make an impact -- both in your community, and on the world.\n\n                                            Syllabus\n                        ### Lesson 1: Building layouts\nTake your hand drawn app designs and lay them out on the phone screen. In this lesson you’ll learn the XML markup language used to lay out Android applications. You’ll create views, the basic building block of Android layouts, that display text and images. Then you’ll position your text and images on these screens. This highly interactive lesson encourages experimentation through coding challenges in Udacity’s XML Visualizer.\n\n### Practice Set 1\nCreate a birthday card application for your phone. You’ll start by installing Android Studio, a program used by professional developers to make Android applications. You’ll then transfer a simple application you create from your computer to your phone. Following that, you’ll take all the concepts you learned in Lesson 1 to build your birthday card app, and install it on your phone for your friends and family to see.\n\n### Lesson 2: Making an App Interactive\nHarness the power of Java to create an interactive coffee ordering app! You’ll start by writing simple statements in Java that add interactivity to your app. You’ll then incorporate buttons to trigger events. You’ll finally use a fundamental concept in programming, a variable, to keep track of all the coffee drinks ordered.\n\n### Practice Set 2\nReinforce the skills learned in Lesson 2 by creating a basketball score tracker. The first part of the practice set will solidify how to write and use variables before creating your basketball score tracker app.\n\n### Lesson 3: Work with the Android Framework and Control Flow\nTake a deeper dive into the Android Framework to complete the Just Java coffee ordering app! You’ll see in more detail how Android works behind the scenes and take your first steps towards learning Object Oriented Programming. You’ll add the ability to add toppings to your coffee, and show a detailed order summary when the customer purchases a coffee.\n                                    ", "end_date": "2015-06-08T00:00:00Z", "title": "Android Development for Beginners", "price": 0, "instructors": "Katherine Kuan and Kunal Chawla", "institution_name": ["Google"], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/android-development-for-beginners--ud837?utm_medium=referral&utm_campaign=api", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-05-11T00:00:00Z"}