{"selfpaced": false, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    An introduction to the Objective-C programming language.  This will prepare you for more extensive iOS app development and build a foundation for advanced iOS development topics.\n\nObjective-C programming requires a Mac laptop or desktop computer.  An iOS device is optional if the learner is willing to working exclusively with the simulator.  Some learners have been able to work with an OS X virtual machine on Windows, but explaining how to do that is beyond the scope of this course.\n\n                                            Syllabus\n                        Get Ready. Get Set. Go!Welcome to Week 1!  This week we will be discussing a variety of topics including the tools that we will be using, a basic orientation to the programming environment and the very basic programming syntax that Objective-C inherits from the C language.Functions, Scopes and Encapsulation - oh my!Welcome to Week 2!  This week we will be learning about how functions are defined in C and then how methods are defined in Objective-C.  We will look at the more complex rules surrounding scoping and encapsulation of variables and functions.  We'll end the week learning about Objective-C objects and memory.Object LessonWelcome to Week 3!  At the end of this week you will be able to use Objective-C objections by defining them, instantiating them and passing messages to them.  We will also introduce you to some of the objects that are build into the language.System Libraries to the RescueWelcome to Week 4!  This week we will be learning about built-in features that help to manage data structures and memory\n                                    ", "end_date": "2015-10-14T00:00:00Z", "title": "Foundations of Objective-C App Development", "price": 0, "instructors": "Don Patterson and Sam Kaufman", "institution_name": ["University of California, Irvine"], "commitment": "", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/learn/objective-c", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-09-16T00:00:00Z"}