{"selfpaced": true, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    Swift is a language created by Apple specifically for iOS and OS X development. It’s fast, concise, and comes with tools  which make it easier than ever to visualize one's code. \n\nThis course focuses on the syntax of the Swift programming language. By the end of the course, students should be able to apply Swift essentials to building iOS apps and employ Swift's more unique elements, like optional types and switch statements, with confidence.Why Take This Course?- A quick and fun introduction to Swift basics. \n- Practice with Playground exercises\n- Thorough explanations of Swift's less-intuitive features like Optionals and Closure Expressions.\n\n                                            Syllabus\n                        ###Lesson 1: Swift Basics\nIn this lesson, you'll become familiar with Swift types and operators, and develop deftness in defining variables and constants. \n###Lesson 2: Optionals\nLearn about your new Swift BFF: Optionals! In this lesson, you'll declare explicitly and implicitly unwrapped optionals, and unwrap optionals using both optional binding and optional chaining.\n###Lesson 3: Collections\nIn this lesson, you'll learn about Dictionaries, Arrays, and Sets and perform basic operations including: append, count, insert, remove, update, find, and retrieve. \n###Lesson 4: Control Flow\nIn this lesson, you'll practice fast iteration with for-in loops by iterating through items in Arrays and Dictionaries. You'll also get experience with if-else statements and switch statements.  \n###Lesson 5: Functions\nIn this lesson, you'll define and call functions, correctly use local and external parameters, and identify parameter types and return types. \n###Lesson 6: Classes, Properties, and Methods\nIn this lesson, you'll practice building custom classes with their own properties and methods. \n###Lesson 7: Enums and Structs\nIn this lesson, you'll learn the difference between value types and references types and practice choosing when to use enums, structs, and classes. \n###Lesson 8: Protocols and Extensions\nIn this lesson, you'll learn how protocols and extensions can help keep your code DRY.  Given a series of code snippets, you'll fix compiler errors by conforming to and implementing the appropriate protocols.  \n###Lesson 9: Closure Expressions\nIn this lesson, you'll practice using Swift closures  with the functions, sorted() and filter(). You'll also learn shorthand to make your closure expressions super concise.\n                                    ", "end_date": "2015-08-13T00:00:00Z", "title": "Learn Swift Programming Syntax", "price": 0, "instructors": "Gabrielle Miller-Messner", "institution_name": [], "commitment": "6 hours", "subject_name": ["Programming"], "course_url": "https://www.udacity.com/course/learn-swift-programming-syntax--ud902?utm_medium=referral&utm_campaign=api", "duration": "3 weeks", "language_name": ["English"], "provider_name": ["Udacity"], "start_date": "2015-07-23T00:00:00Z"}