{"selfpaced": false, "topic_name": ["Mobile Development"], "description": "\n\n                    \n                    \n                    This MOOC describes by example how to connect Android mobile devices to clouds via the use of object-oriented design techniques, Java programming language features, Jetty middleware, Java Servlets, the Java Spring Framework, and cloud computing platforms, such as Google App Engine. Although there will be 10 weeks of lecture material, the required core of the course is six weeks long and can be completed flexibly within the ten week schedule to provide flexibility for students during the summer.\r\nAn extended case study project will be used throughout the required core of the MOOC to showcase architectures for communicating with the cloud using HTTP, server-side processing of mobile data using servlets and the Java Spring Framework, and scalable storage of data using no-SQL databases and other platforms. Due to the importance of building secure and scalable mobile/cloud platforms, this MOOC will not only show you how to program handheld systems that talk to the cloud, but how to do so securely, scalably, and efficiently. Security and scalability topics will be woven into discussions of cloud service creation so that students learn, from the start, how to create robust cloud services for mobile devices.\r\nFour weeks of optional lecture material will also be provided for students who would like to gain a deeper understanding of the patterns and frameworks for building cloud infrastructure building. This material will be presented in the context of the open-source JAWS web server, which is implemented in C++ as part of the ACE open-source object-oriented concurrent and networked programming toolkit.\r\nAlthough the cloud service topics in this course will be taught in the context of connecting mobile devices to the cloud, the concepts are broader and will give students the ability to create the cloud services to support large-scale web applications, such as social networking applications; cloud services for embedded systems, such as the Internet of Things and Industrial Internet; and wearable computing devices, such as Google Glass. \r\n Note: This course is part of a trans-institution sequence of MOOCs entitled Mobile Cloud Computing with Android\r\nThis MOOC and two others, taught by Dr. Adam Porter from the University of Maryland and Dr. Douglas C. Schmidt from Vanderbilt University, have been designed to complement one another as part of the first trans-institution Specialization taught on the Coursera platform. Some of the programming assignments and the course project for these MOOCs will be coordinated. Dr. Porter's MOOC, Programming Mobile Applications for Android Handheld Systems, will be taught first; it focuses on the design and programming of user-facing application components. Dr. Schmidt's MOOC, Programming Mobile Services for Android Handheld Systems, will be taught next; it focuses on middleware systems programming topics, such as synchronous and asynchronous concurrency models, background service processing, structured data management, local inter-process communication and networking. This MOOC introduces the concepts and knowledge needed to connect the user-facing and service-based components, built in the first two courses, to the cloud.  \r\nIf you just want to take some of the MOOCs in this sequence or take them all in different order you’re certainly welcome to do so, and you’ll still learn a lot. If you take all the MOOCs in this sequence in the order presented, however, you’ll gain a deeper, end-to-end understanding of handheld systems, their applications and services, as well as their integration into the cloud.\n\n                                            Syllabus\n                        The course is organized into the sections outlined below.\r\nSection 1: Talking to the Cloud with HTTP\r\n\r\nModule 1: The HTTP Protocol\r\n\r\nIntroduction\r\nWhat are Communication Protocols?\r\nIntro to HTTP\r\nWhy HTTP?\r\nWhat is a cloud service?\r\nHTTP Request Methods\r\nHTTP Request Anatomy\r\nURLs Query Parameters\r\nMime Types Content Type Header\r\nRequest Body Encoding\r\nHTTP Response Anatomy\r\nHTTP Response Codes\r\nCookies\r\n\r\n\r\nModule 2: Designing Applications with HTTP Communication\r\n\r\nBuilding Cloud Services on HTTP\r\nProtocol Layering / HTTP Design Methodologies\r\nREST\r\nHTTP Polling\r\nPush Messaging\r\n\r\n\r\n\r\nSection 2: Building Java Cloud Services\r\n\r\nModule 1: Java Servlets\r\n\r\nWhat are Servlets?\r\nA First Cloud Service with a Servlet\r\nWeb.xml\r\nVideo Servlet Code Walkthrough\r\nVideo Servlet Test Walkthrough with HttpClient\r\nSecurely Handling Client Data Avoiding Injection Attacks\r\n\r\n\r\n\r\n\r\nModule 2: Better Abstractions for Building Java Cloud Services\r\n\r\nIntro to Java Annotations\r\nHTTP to Object Marshalling\r\nIntro to JSON\r\nThe Spring Dispatcher Servlet and the Controller Abstraction\r\nIntro to Spring Controllers\r\nAccepting Client Data with RequestParam Annotations\r\nAccepting Client Data with PathVar Annotations\r\nAccepting Client Data with RequestBody Annotations and JSON\r\nHandling Multipart Data\r\nGenerating Responses with the ResponseBody Annotation\r\nCustom Marshalling with Jackson Annotations Serializers/Deserializers\r\nSpring Boot Application Structure\r\nSpring Controller Code Walkthrough\r\nSpring Controller Test Code Walkthrough\r\n\r\n\r\nModule 3: Better Client-side Communication Abstractions\r\n\r\nIntroduction to Retrofit\r\nRetrofit Client Code Walkthrough\r\nAndroid Retrofit Client Code Walkthrough\r\n\r\n\r\nModule 4: Building Loosely Coupled and Extensible Java Services\r\n\r\nSpring Dependency Injection Auto-wiring\r\nSpring Configuration Annotations\r\nSpring Dependency Injection Controller Code Walkthrough\r\nSpring Dependency Injection Controller Test Code Walkthrough\r\n\r\n\r\n\r\nSection 3: Building Database-driven Java Cloud Services\r\n\r\nModule 1: Persistent Objects\r\n\r\nObject to DB Mapping\r\nJPA\r\nEntities\r\nRepositories\r\nUnderstanding SQL Injection Attacks\r\nSpring Data Code Walkthrough\r\n\r\n\r\nModule 2: RESTful Services for Persistent Objects\r\n\r\nSpring Data REST\r\nSpring Data REST Code Walkthrough\r\n\r\n\r\n\r\nSection 4: Restricting Service Access with User Accounts\r\n\r\nModule 1: Secure HTTP Communication\r\n\r\nMan in the Middle Attacks Public Key Infrastructure\r\nHTTPS\r\n\r\nModule 2: What was I Saying: Keeping Track of Sessions\r\n\r\nSessions\r\nSpring Security Overview\r\nSpring Security Configuration in Java\r\nBuilding a Custom UserDetailsService\r\nSetting up a custom UserDetailsService\r\nThe Principal\r\nSpring Security Role Annotations\r\nMore Complex Expression-based Pre Post Authorize Annotations\r\nSpring Security Controller Code Walkthrough\r\nSpring Security Controller Test Code Walkthrough\r\n\r\n\r\nModule 3: Authenticating Mobile Clients\r\n\r\nStateful Sessions with Cookies Why They Aren't Ideal for Mobile\r\nStateless Sessions with Tokens\r\nOAuth 2.0\r\nSpring Security OAuth 2.0\r\nA Spring OAuth 2.0 Secured Service\r\nA Retrofit Oauth 2.0 Client for Password Grants\r\n\r\n\r\n\r\nSection 5: Deploying to the Cloud Scaling\r\n\r\nModule 1: General Scaling Strategies\r\n\r\nStateless vs. Stateful Applications\r\nHorizontal Scaling\r\nAuto-scaling Horizontally\r\nCaching\r\nOffloading to Cloud Provider Services\r\nAsynchronous IO in Controllers\r\n\r\n\r\nModule 2: Scaling Up Data Storage\r\n\r\nNoSQL Databases\r\nOptimizing for Key-based Lookups\r\nOptimizing for Reads vs. Writes\r\nContention Sharding\r\nMongo DB\r\nSpring Data Mongo DB\r\nDatabase as a Service\r\nAmazon Dynamo\r\nSpring Data Dynamo DB\r\nApp Engine Big Table\r\n\r\n\r\nModule 3: Automating Packaging Deployment\r\n\r\nDeploying to Infrastructure as a Service\r\nDeploying to Amazon EC2\r\nPackaging Web Applications into WAR files\r\nAdapting Spring Boot Applications for Google App Engine\r\nDeploying to App Engine\r\n\r\n\r\nModule 4: Performance Testing\r\n\r\nIntro to Cloud Service Performance Testing\r\nApache JMeter\r\nBuilding Realistic Tests\r\n\r\n\r\n\r\nSection 6: Patterns and Frameworks for Concurrent and Networked Server Software [Optional Material]\r\n\r\nModule 1: Introduction to the Web Server Case Study\r\n\r\nApplying Patterns and Frameworks to Concurrent and Networked Software\r\nOverview of JAWS Web Server Case Study: Part 1\r\nOverview of JAWS Web Server Case Study: Part 2\r\nOverview of JAWS Web Server Case Study: Part 3\r\n\r\n\r\nModule 2: Patterns and Frameworks for Service Access and Communication\r\n\r\nAccidental Complexities with the Sockets API\r\nThe Wrapper Facade Pattern\r\nACE C++ Socket Wrapper Facades\r\nApplying the ACE Wrapper Facades to a Web Client and Server\r\n\r\n\r\nModule 3: Patterns and Frameworks for Synchronous Event Handling, Connections, and Service Initialization\r\n\r\nThe Reactor and Acceptor-Connector Patterns\r\nThe ACE Reactor Framework\r\nApplying the ACE Reactor to JAWS\r\nThe ACE Acceptor-Connector Framework and Applying it to JAWS\r\n\r\n\r\nPatterns and Frameworks for Service Configuration and Activiation\r\n\r\nThe Component Configurator Pattern\r\nThe ACE Service Configurator Framework\r\nApplying the ACE Service Configurator to JAWS\r\nApplying the Activator Pattern to JAWS\r\n\r\n\r\nPatterns and Frameworks for Concurrency and Synchronization\r\n\r\nThe Active Object Pattern\r\nThe ACE Task Framework\r\nApplying ACE Task and Acceptor-Connector to JAWS\r\nThe Half-Sync/Half-Async Pattern\r\nImplementing Half-Sync/Half-Async Using ACE\r\nThe Monitor Object Pattern\r\nApplying the Monitor Object and Synchronization Patterns to JAWS\r\nThe Leader/Followers Pattern\r\nApplying the Leader/Followers Pattern and ACE_TP_Reactor to JAWS\r\n\r\n\r\nPatterns and Frameworks for Asynchronous Event Handling\r\n\r\nThe Proactor pattern\r\nThe ACE Proactor Framework\r\nApplying the ACE Proactor Framework to JAWS\r\nThe Asynchronous Completion Token Pattern and Applying it to JAWS\r\n\r\n\r\nSummary\r\n\r\nEvaluating Patterns and Frameworks for Concurrent and Networked Software\r\n\r\n\r\n\n                                    ", "end_date": "2014-09-29T00:00:00Z", "title": "Programming Cloud Services for Android Handheld Systems", "price": 0, "instructors": "C. White and Douglas Schmidt", "institution_name": ["Vanderbilt University"], "commitment": "4-6 hours", "subject_name": ["Programming"], "course_url": "https://www.coursera.org/course/mobilecloud", "duration": "10 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-07-21T00:00:00Z"}