{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is a subset Course that is an extract of the first three lectures in Section 1and 2 lectures in Section 4 of Day 1 of the <em>Rapid Delivery Workshop for Enterprise Architecture</em>. It examines the reasons for the high level of redundant data in today’s legacy databases and systems and the solution to this problem. It discusses the impact of the Internet on the pace of change that we are experiencing today in every industry and enterprise: whether Commercial; Government or Defense. It demonstrates the need for rapid business transformation: to compete; and even to survive, in today’s rapid-change environment.</p>\n\n<p>The subset Course shows how the systems development methods that we have traditionally used must change, to be able to support the rapid business changes that are occurring today. The lectures of this subset Course show why the systems development methods that are needed to support the business for the future must be based on Strategic Business Plans that management define for that future.</p>\n\n\n\n\n\n<p>These new systems development methods are based on the use of Enterprise Architecture (EA). EA is NOT just an IT responsibility; it is – above all – a business responsibility. For success in today’s rapid-change environment, EA requires the active participation of senior and middle-level business managers (as the true architects of the business) and the business experts who report to them, along with IT experts – all working together in a design partnership.</p>\n\n\n\n\n\n<p><strong>To illustrate these methods in action, a real-world Enterprise Architecture project for a Medium–sized Regional Bank is discussed in some detail, with the final report to the Bank able to be downloaded for your review, This project has been extracted from Section 4 of Module 1 of the <em>“Rapid Delivery Workshop for Enterprise Architecture”</em>.</strong></p>\n\n\n\n\n\n<p>Enterprise Architecture typically uses for implementation the Rapid Delivery Technologies of Service Oriented Architecture (SOA) with Process Models and Workflow Models, diagrammed using Business Process Modeling Notation (BPMN); to automatically generate XML-based Business Process Execution Language (BPEL) executable code. When the business changes the BPMN process models and workflow models can be changed rapidly to then regenerate changed BPEL executable code. This subset course leads into the <em>Rapid Delivery Workshop for Enterprise Architecture.</em></p>\n\n\n\n\n\n<p><strong>After completing this subset course, you should next complete the Udemy Course - \"MODULE 1: <em>ENTERPRISE ARCHITECTURE FOR MANAGERS AND IT\",</em> from which the subset course was extracted.</strong><em> </em>The methods referred to in the subset course are presented in the Module 1 Course.</p>\n\n\n\n\n\n<p>The <strong><em>Rapid Delivery Workshop for Enterprise Architecture</em> </strong>comprises three Modules. Each Module is a separate Udemy Course. The training delivered in this workshop represents a full University year of training in the discipline of Enterprise Architecture. These Modules (courses) correspond to days in the workshop (or University semesters) as follows:</p>\n\n\n\n\n\n<ul>  <li>[Day 1] Module 1:      Introduction to Enterprise Architecture for Managers and IT <br>   (1 Semester)</li>  <li>[Days 2 – 4] Module 2:      Rapid Delivery Methods for Enterprise Architecture (2 Semesters)</li>  <li>[Day 5] Module 3: Rapid      Delivery Technologies for Enterprise Architecture (1 Semester)</li></ul>\n\n\n\n\n\n<p>Through the use of Exercises and Case Study hands-on, skills-transfer Problems, with Sample Solutions, the Workshop teaches the methods for transforming business plans into integrated strategic data models that eliminate redundant data and that can deliver into production priority, reusable, standardized processes comprising integrated databases and systems: rapidly, in 3-month increments of increasing functionality. These reusable processes, when implemented, can save large organisations millions of dollars of development cost through the elimination of redundant database silos and also hundreds of millions of dollars in annual operating costs arising from the integrated databases and reusable processes result in the elimination of redundant data maintenance processes.</p>\n\n\n\n\n\n<p>                                       <strong>Audience</strong>    </p>\n\n\n\n\n\n<p>This subset Course is directed to an audience of: senior-level business managers (CEOs, COOs, CFOs); Government Program managers; middle-level business managers; operational business managers; business experts; IT experts (CIOs, CTOs,CDOs);                                     IT managers; data modellers; systems analysts or developers. </p>\n\n\n\n\n\n<ul>  <li>This      course is NOT for students who want to learn detailed coding for various      programming languages</li></ul>\n\n\n\n\n\n<p>         <strong>Prerequisites</strong>    </p>\n\n\n\n\n\n<p>\nThis subset\nCourse does not require\nany prior knowledge of business planning or computers. It leads into the Module\n1 Course of the <em>“Rapid Delivery Workshop\nfor Enterprise Architecture”,</em> which is a prerequisite for the Module 2 and\nModule 3 Courses of the Workshop.\n\n</p>\n\n\n\n\n\n<ul><li><ul><li><em></em></li></ul></li></ul>\n\n\n\n\n\n<ul><li><ul><li><em></em></li></ul></li></ul>\n\n\n\n\n\n<ul><li><ul><li><em></em></li></ul></li></ul>", 
    "end_date": null, 
    "title": "1) Rapid Systems Development for Business Transformation", 
    "price": "25.00", 
    "instructors": "Mr. Clive Finkelstein", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630990_93e1_4.jpg", 
    "course_url": "https://www.udemy.com/rapid-systems-development-for-business-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T05:29:50Z"
}