{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Course Overview - Don't Panic!</strong><br></p>\n\n<p>If you're a new or first-time manager, you've no doubt panicked and asked yourself, \"How do I do this?\" I know that's what I asked myself when I was promoted to my first management position! <br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>In this course you'll learn how the core principles of effective team management and the mindsets required to rapidly become a rising star in your company, and how to leapfrog everyone around you while being known as a team player who isn't afraid to speak your mind or intelligently promote yourself in a way you deserve.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Basically, this course will teach you how to maximize the long-term career potential of your new role as a leader and manager in just 2 hours, ultimately ensuring your rapid rise in your company. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The Mindsets and Strategies I'll be teaching you in this course</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I'll be teaching you a broad set of management skills and mindsets that will be useful for any new or first-time manager, including:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Your new reality as a manager vs your old reality as an individual contributor</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- How to manage your direct and indirect reports in your office and around the world - and the differences in each of these situations</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- How to lead team meetings and how your style and substance impacts your credibility in front of your team and organisation</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Why conflict is not always a bad thing (and can be healthy) - and why you absolutely must get comfortable with (respectful) conflict if you want to succeed in the long-term</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Why only have one default mode of being (for many people it's being \"nice\") can be to your detriment</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>- Strategies for becoming widely known and influential in your company. It's not just about doing good work!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Learn from first-hand experience</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Isn't management something you learn by experience? Yes - you could, but research shows that more than half of new managers fail to live up to the expectations of those who promoted them to this new role. Rather than stumbling into the best practices (and making needless mistakes along the way), shortcut your success in a safe, easy way by learning from my successes and failures instead.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>How I'll be teaching this course </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Students will be learning via video lectures in this course. This course is 2 hours in length in total, and is structured around several core sections covering both strategic mindsets and tactical techniques for specific situations.</p>", 
    "end_date": null, 
    "title": "A Crash Course for Ambitious New Managers: Play to Win!", 
    "price": "20.00", 
    "instructors": "Richmond Wong", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827286_8da6_4.jpg", 
    "course_url": "https://www.udemy.com/a-crash-course-for-ambitious-new-managers-play-to-win/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T17:39:49Z"
}