{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Dear ACCA Student,</strong></p><p><strong><strong>This course is on sale 50% OFF for a limited time. The price will go up to the original price on March 1, 2015!</strong></strong></p><p><strong><strong></strong></strong></p><p><strong><strong>The format of this course is set out in a way that will walk students through ACCA F5 Performance Management syllabus step by step.</strong></strong><br></p><ul><ul><li><strong></strong>In each week of this course a new topic will be introduced</li><li>Week 1 already started</li><li>Each week will be concluded with a sum-up quiz</li><li>Regular updates on Technical Articles will be posted</li><li>Each week an open question session will be held to answer the students questions on Saturdays from 10:00am till 1:00pm CET.</li></ul></ul><p><em>ACCA F5 Performance Management is the <strong>first ACCA course on Udemy</strong>. It is designed specifically for ACCA students who tend to pass the Performance Management exam at first attempt.</em></p>  <p><strong>About me</strong></p><p>I am Anar Heydarli, an ACCA Member since October 2013. I passed all of 14 ACCA exams at <em>FIRST ATTEMPT</em>, while scoring high enough to achieve placewinning ranks in ACCA global statistics. Below are some of my scores in ACCA exams:</p>  <ul>  \t<li><strong>June 2013 </strong><strong>ACCA Top affiliate</strong> - According to the results of ACCA June 2013 Exam Session I became <strong>1st place</strong> top affiliate in Azerbaijan – <strong>42nd</strong> <strong>worldwide place</strong>;</li>  \t<li>  \t  \t\t<strong>June 2013 ACCA P4 - Advanced Financial Management</strong> - According to the results of ACCA June 2013 Exam Session I attained the <strong>highest mark</strong> in individual ACCA Paper P4 Advanced Financial Management in Azerbaijan and <strong>74 mark</strong> – <strong>11th worldwide place</strong>;  \t  \t</li>  \t<li>  \t  \t\t<strong>June 2013 ACCA P7 - Advanced Audit and Assurance</strong> - According to the results of ACCA June 2013 Exam Session I attained the <strong>highest mark</strong> in individual ACCA Paper P7 INT Advanced Audit and Assurance in Azerbaijan and <strong>66 mark</strong> – <strong>19th worldwide place</strong>  \t  \t</li>  \t<li>  \t  \t\t<strong>June 2012 ACCA P1 - Governance, Risk and Ethics</strong> - According to the results of ACCA June 2012 Exam Session I attained the <strong>highest mark</strong> in individual ACCA Paper P1 - Governance, Risk and Ethics in Azerbaijan and <strong>79 mark </strong>– <strong>10th worldwide place</strong>  \t  \t</li>  </ul>  <p>  \t                 I have a hands on experience in teaching the following ACCA exam papers:  </p>  <ul>  \t<li>F2 Management Accounting</li>  \t<li>F3 Financial Accounting</li>  \t<li>F5 Performance Management</li>  \t<li>F7 Financial Reporting</li>  \t<li>F8 Audit and Assurance</li>  \t<li>F9 Financial Management</li>  \t<li>P1 Governance, Risk and Ethics</li>  \t<li>P4 Advanced Financial Management</li>  \t<li>P5 Advanced Performance Management</li>  \t<li>P7 Advanced Audit and Assurance </li></ul><p>As the result of such broad experience with ACCA exams and working with students from different backgrounds face to face as well as through online courses, I have developed a solid approach on explaining challenging areas in F5 Performance Management course.<br></p>  <p>  \t                ACCA have scheduled the <strong>F5 Performance Management </strong>course on <strong>9</strong><strong> March 2015</strong>. Therefore I organised the course in the following format for the students to get the most out of it and be prepared for the <strong>BIG DAY</strong>:  </p>  <ul>  \t<li>I have uploaded introduction videos to the following topics in the syllabus:  \t<ul>  \t\t<li>  \t\t  \t\t\t                Explanation and application of <strong>cost accounting techniques</strong>;  \t\t  \t\t</li>  \t\t<li>  \t\t  \t\t\t                Application of <strong>decision-making techniques</strong> to facilitate business decisions and promote efficient and effective use of scarce business resources, appreciating the risks and uncertainty inherent in business and controlling those risks;  \t\t  \t\t</li>  \t\t<li>  \t\t  \t\t\t                Identification and application of appropriate <strong>budgeting </strong><strong>techniques and methods for  planning and </strong><strong>control</strong>;  \t\t  \t\t</li>  \t\t<li>  \t\t  \t\t\t                Use <strong>standard costing systems</strong> to measure and control business performance and to identify remedial action;  \t\t  \t\t</li>  \t\t<li>  \t\t  \t\t\t                Identify and discuss<strong> performance </strong><strong>management information and measurement </strong><strong>systems</strong> and assess the performance of an organisation from both a financial and non-financial viewpoint, appreciating the problems of controlling divisionalised businesses and the importance of allowing for external aspects.  \t\t  \t\t</li>  \t</ul>  \t</li>  \t<li>I am keeping the above 5 topics as general topics and developing subtopics on these. On a <strong>weekly basis</strong> you will receive a new notification through Udemy announcing the <strong>new lectures uploaded</strong>. This approach will help the students have <strong>weekly learning objectives</strong> and <strong>keep on track </strong>throughout the course. Following this approach and curriculum the students will be better prepared for the <strong>EXAM DAY</strong>.</li>  \t<li>The curriculum includes <strong>TWO MOCK EXAMS</strong> throughout the course. Exams will be held online and the Students will have 3 hours to address 5 questions - <strong>JUST LIKE IN REAL EXAM</strong>.</li>  \t<li>The <strong>online discussion forum</strong> is always open for Q&amp;A</li>  \t<li>There are <strong>quizzes </strong>for each and every subtopic to enhance the learning.</li>  </ul>  <p>  \t<em><strong>Let's make it together to the next ACCA exam session! Good Luck!</strong></em>  </p>", 
    "end_date": null, 
    "title": "ACCA F5 Performance Management - Complete Course", 
    "price": "45.00", 
    "instructors": "Anar Heydarli, ACCA", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417068_448a_3.jpg", 
    "course_url": "https://www.udemy.com/acca-f5-performance-management-complete-course/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T07:31:21Z"
}