{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    JOIN 800+ STUDENTS USING THESE IMPROVEMENT TECHNIQUES TO SAVE THEIR COMPANIES LOTS OF MONEY!  </p>  <ul>  \t<li>Do you care about how well your company is running?</li>  \t<li>Do you need to make major improvements at your job?</li>  \t<li>Trying to master a new skill as quickly as possible?</li>  </ul>  <p>  \t        If so, this course will give you the upper hand when it comes to making  measurable improvements. You will learn how to prepare yourself so that  you are ready to take on the challenging task of step-change  improvements in your business.. You will be able to garner the support  and loyalty of your employees, coworkers and customer.  </p>  <p>  \t<strong></strong>  </p>  <p>  \t          All businesses have processes and they are central to a company&#039;s success. This course will teach you a program I use to save my clients money, by helping them make their business processes effective and efficient.  I will share with you an example of how by applying these practices, my firm saved the client over $800,000 with just 3 weeks of effort.  </p>  <p>  \t                    This course, &quot;Accelerate Your Success&quot;, will help you interrupt the learning curve and make improvements at an higher speed. You will be trained to use several powerful tools that will help you measure, analyze, and predict what success is and how to achieve it.  </p>  <p>  \t<strong>If you need to achieve greater performance and you need to do it now, this class will set you up for success.  </strong>  </p>  <p>  \t<em>Use this course as 2 hours of Continuing Education for your Certification Maintenance for Associations such as APICS, ISM, and others.  (Save a copy of the Certificate of Completion for your records).</em>  </p>", 
    "end_date": null, 
    "title": "Accelerate your Success: Improve your performance now!", 
    "price": "20.00", 
    "instructors": "Erik Challeen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319726_b8ff_4.jpg", 
    "course_url": "https://www.udemy.com/accelerate-your-success/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T20:19:00Z"
}