{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Becoming known for having an “eye for talent” is one of the most sought after management skills in any industry today.   But don’t be fooled -- managers who hire the best people aren’t born with the ability to spot talent!</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">They just know the secrets of great interviewing!</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong>Learning Advanced Interviewing Skills Will Improve Your Hiring Accuracy</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<ul><li>You will be able to spot liars and fakes in your hiring process.</li><li>You will Impress your coworkers with insightful post-interview insights.</li><li>You will rest easy knowing that you hired the best person for the job.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Interviewing Skills Can Be Learned</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Hiring the right people is the most important job that a manager has -- so why do most managers simply “wing it” when it comes to conducting an interview?\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>The truth is, there aren’t many resources available for interviewers to help them learn interviewing techniques.   \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><em>That’s why we built this course. </em>   \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>To help new and experienced managers to gain an edge during the hiring process by learning the latest interviewing techniques used by some of the most progressive companies in the world. \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Don’t Let Job Applicants Outsmart You!</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Every job applicant today is more prepared than ever.   They come to the interview well-rehearsed to answer the easy questions that every manager asks.  “What are your strengths?”.  “What are your weaknesses?”.  “Why should I hire you?”.       \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>And while there are hundreds of thousands of articles and courses on the Internet aimed at helping candidates “beat the interview”, there are only a handful of resources available to help managers learn the skills that they need to make smart hiring decisions.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Contents and Overview</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>This course contains over 1.5 hours of video instruction.  It is designed for anyone who is responsible for interviewing job candidates at their company.   While there are some advanced interviewing topics, it is ideally suited for both experienced and inexperienced interviewers.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>The course starts by making you aware of how the modern job applicant today is preparing to outsmart you during the interview.  We also talk about the hidden costs of making the wrong hire.  You’ll be shocked at how much it really costs!\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Following the introduction, you’ll learn how to properly greet a candidate and then quickly transition into setting expectations and gaining control of the interview.    This section will give you the confidence you need manage even the most difficult candidates.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>After you learn how to take control of the interview, you’ll learn the difference between a great interview question and a bad one.  Unfortunately, most of the questions that are asked in interviews today, around the world, are really bad.  We’ll teach you how to avoid them.\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Once you have a foundation in proper questioning techniques, you’ll learn the most important interviewing skill you’ll need – probing skills.   We devote two sections to this critical topic and provide examples of some common tactics that candidates use to try to avoid telling you the full story.   With these skills you’ll never be fooled by a candidate who sounds great on the surface, but can’t back up their answers with facts.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>At the end of the course you’ll learn some advanced techniques used by some progressive hiring organizations to add more structure to their hiring decision process.   This section will ensure that you eliminate “gut decisions” and focus on “data driven hiring”.    \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>And across all of these lectures, we provide you with free tools and templates that will help you implement all of these best practices immediately!\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Who Is This Course For?</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n<p>Anyone who is responsible for interviewing job candidates at their company.  \n\n  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>What Will You Get Out of This Course?</strong></p>\n\n\n\n\n\n<ul><li>Over 1.5 hours of expert level content put together by recruiting leaders, hiring managers and PhD-level I/O psychologists.</li><li>Tools and templates you can use immediately to make better hiring decisions.</li><li>Practical exercises to help you identify common interviewing challenges.</li><li>Great questions that you can start asking candidates immediately.</li><li>Probing techniques to uncover more details from your candidates.</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Our overall goal is that you will be more confident and make better hiring decisions after taking this course.  </strong><br></p>\n\n\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">And who knows…maybe you’ll get that big promotion because your hiring skills helped you build an amazing team of high performing employees!</em></p>", 
    "end_date": null, 
    "title": "Advanced Interviewing Skills for New & Experienced Managers", 
    "price": "20.00", 
    "instructors": "James Colino", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821278_41e2.jpg", 
    "course_url": "https://www.udemy.com/advanced-interviewer-training/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-13T18:41:50Z"
}