{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong>Join One of the Web's Leading Professional Development Communities</strong></em></p><p><em>Course version 3.1 released November 2015</em></p><p>Similar to <strong>MIT's Advanced Management Program</strong> for high potential managers (which costs $57,000), this course will develop a comprehensive suite of skills that you need in order to be a manager that delivers exceptional value to your team, organization, and the communities you serve. </p><p><strong>Advanced Management Training for Business Leaders</strong></p><ul><li>Learn recipes for handling common management challenges</li><li>Communicate and persuade in the age of digital communication</li><li>Win in negotiations while cultivating long-term relationships</li><li>Maximize your personal productivity and handle time constraints</li><li>Understand issues faced by managers from a macroeconomic perspective</li><li>Transform your leadership style and develop your soft skills</li></ul><p><strong>Take the Next Step in Your Career</strong></p><p>This course will <strong>deepen your abilities </strong>as a manager, entrepreneur, or experienced executive and enable you to make a significant and long-lasting impact on your organization and the communities you serve. In the course, you'll acquire <strong>new frameworks and skills </strong>developed based on <strong>research from MIT, Stanford, Harvard </strong>and other leading institutions. You'll also see an exclusive series of interviews with Brian Burwell, the leader of one of the world's premier management consulting firms. Brian has led dozens of multimillion dollar consulting engagements with Fortune 100 companies from all over the world and will be with you in each section to contextualize your course material with over 35 years of real-world experience. In short, the course is here to help you take another step in your career and be a more effective change agent in the future.</p><p><strong>Engaging Video Lectures, Expert Interviews, and Interactive Exercises</strong></p><p>This course is ideal for new managers looking to successfully transition into leadership positions, entrepreneurs who find themselves responsible for growing businesses, and senior executives looking to invest in themselves so that they can continue to deliver value to their organizations. In the first third of the course, you'll learn how handle the most common management challenges and then how to be an effective communicator and a leader of high-performing teams. The modern leader effectively communicates through in-person <em>and</em> digital mediums. You'll learn how to make your messaging effective through multiple channels and to use communication models like the ELM, Minto Pyramid, and others.</p><p>In the second third of the course, you'll build your negotiation skills and learn how to increase your personal productivity. You're likely to face complex negotiation scenarios during your career. In the negotiation section, you'll learn to think “win-win\" <em>and</em> claim value from high-stakes negotiations. You'll learn how to use tools like the BATNA and Eazl's negotiation preparation tool. Then, you'll learn how to be more productive and how to work successfully with the many claims on your time and energy. </p><p><strong></strong> In the final third of the course, you'll develop an ability to look at key management issues from a macroeconomic perspective. This will enable you to anticipate macroeconomic events and important changes in government policies. In the final section, you'll learn to develop your leadership style by developing leadership guideposts and then building tools that you can use to understand people and work better in teams.</p><p><em>Version Release Notes:</em></p><ul><li>What's new in version version 1.1? <ul><li>Added welcome video to pose key questions and introduce key learning outcomes</li></ul></li><li>What's new in version 2.0?<ul><li>Lucky you! If you enrolled prior to June 2015, you've just been upgraded to masterclass! Over the summer of 2015, entire sections on macroeconomics for managers, negotiation, personal productivity, communication strategies, and teambuilding will be rolled out! Stay tuned!</li><li>All new intros are now included to support the conversion to a masterclass.</li><li>Woohoo! The section on macroeconomics for managers is live.</li></ul></li><li>What's new in version 2.1?<ul><li>Rock on! There's a great new section on negotiation for you!</li></ul></li><li>What's new in version 2.2?<ul><li>Woohoo! There's an awesome new section of modules on personal productivity!</li></ul></li><li>What's new in version 2.3?\n<ul><li>Check out the new section on persuasive, internal, and visual communication strategies for managers!</li></ul></li><li>What's new in version 3.0? We're proud to launch a fully upgraded version of the course! In version 3.0, you now have:<ul><li>A brand new section that provides detailed recipes for handling common management challenges. This section includes a guide to candidate interviewing and an entire additional set of modules.</li><li>We've now added contextual interviews with Brian Burwell, one of the world's business leaders. Though we can't tell you the name of the company Brian leads, you can certainly look it up on the web. Brian has led multimillion dollar management consulting engagements for some of the world's largest and most sophisticated firms (Fortune 100 companies) and you're very lucky to see and hear his perspective on the topics covered in each section of the course. </li><li>The content has been reordered, old introductions have been removed, and other changes have been made to upgrade your learning experience. Enjoy!</li></ul></li><li>What's new in version 3.1?<ul><li>Woohoo! Brand new section intros to make your learning experience even better!</li></ul></li></ul>", 
    "end_date": null, 
    "title": "Advanced Management Training: Leadership, Negotiation + More", 
    "price": "40.00", 
    "instructors": "Davis Jones, Team Eazl, Team Eazl", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482564_6fdc_3.jpg", 
    "course_url": "https://www.udemy.com/new-manager-training/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-21T21:16:58Z"
}