{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Fresh as of June 2015</em></p><p>Learn how to interpret changing macroeconomic conditions and leverage macro-level frameworks in a course that's similar to the <em>Macroeconomics for Managers</em> course in MIT's Advanced Management Training Program.</p><strong>Key Macroeconomic Issues for Managers and Executives</strong><ul><li>Learn how to interpret and use the critical macroeconomic signals. </li><li><span></span>Understand how to analyze comparative advantages and offshoring decisions. </li><li>Learn how to manage risk and see opportunities in environmental limits. </li><li>Find and use relevant economic data and make better decisions.</li></ul><span></span><strong>A Powerful Skill at Your Fingertips</strong><p>As you transition to roles of increasing responsibility, being able to interpret and use macroeconomic data will make you a valuable asset to any managerial team. Knowing what data matters and where to find it will enable you to take public data, make it meaningful, and use it to inform decisions that will impact you and your organization.</p><strong>Macroeconomics Made Accessible</strong><p>Suitable for people with no formal training in economics, this course is fun to watch, offers hands-on tutorials, and includes interviews with two of the leading American economic journalists of our time—Mike “Mish\" Shedlock and Charles Hugh Smith. Each learning module will equip you with a framework that you can use to contribute to big decisions and high-level conversations.</p><p>Starting with a deconstructed look at what GDP is and why it matters, the course introduces the key macroeconomic concepts that matter to managers. You'll learn about monetary policy. Government spending. Interest rates. Then, we'll look at what drives comparative advantages and offshoring decisions.</p><p>The course wraps up with a look at environmental limits. This framework will enable you to understand issues about sustainability, corporate responsibility, and ecological benefits through an economic lens. Finally, you have access to “over the shoulder\" tutorials as we collect easy-to-find economic research and use the Eazl macroeconomic resource bank to find and download more nuanced sources of public data.</p>", 
    "end_date": null, 
    "title": "Advanced Management Training: Macroeconomic Issues for Execs", 
    "price": "20.00", 
    "instructors": "Davis Jones, Team Eazl", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511852_38cc_2.jpg", 
    "course_url": "https://www.udemy.com/advanced-management-training-macroeconomics-mba-udemy/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T15:29:30Z"
}