{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Adventure Travel Business Management for Ground Suppliers is recommended for company owners and managers. It covers the business model for ground suppliers, and provides practical training for analyzing cost and sales structure. Participants learn how to best price products and manage their business to profitability.</p><ul><li>Gain knowledge and expertise from one-of-a-kind training designed specifically for adventure travel ground suppliers</li><li>Learn about pricing structures</li><li>Understand how to staff effectively </li><li>Learn the combination of rules and practices that govern business: B-to-B and B-to-C sales system and commissioning</li><li>Understand cost structure by dividing into operational, fixed, and marketing costs</li><li>Understand the profit index EBITDA and how to calculate EBITDA, gross profit, and net profit for your company</li><li>Learn adventure product pricing, including commission and taxes</li><li>Answer the key strategic questions any business owner must ask themselves</li><li>Understand the tourism business model, as well as the business models specifically in adventure travel</li><li>Sustainability: how to work with local communities, authorities, active trade associations and how to examine the local natural environment. </li></ul><p><strong><br></strong></p><p><strong>About AdventureEDU Educator Jean-Claude Razel of Alaya Expedições</strong></p><p> Jean-Claude has 30 years experience in the adventure business, specializing in safety management, operations and product development. Initially focused in mountaineering and climbing, Jean-Claude is now active in the whole chain of the adventure business. He has created safety systems for zipline circuits in Brazil, managed the Brazilian National Rafting Team, was president of ABETA in Brazil, and actively participated in Aventura Segura, one of the most successful qualification programs in Adventure Travel with more than 4000 qualified professionals and 100 companies certifying their operations and safety management.<br></p>", 
    "end_date": null, 
    "title": "Adventure Travel Business Management for Ground Suppliers", 
    "price": "50.00", 
    "instructors": "AdventureEDU .", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611802_cadd_2.jpg", 
    "course_url": "https://www.udemy.com/adventure-travel-business-management-for-ground-suppliers/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T15:35:05Z"
}