{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em style=\"\">&quot;Wir sind auch agil!&quot;, &quot;heute ist eh jeder agil!&quot;, &quot;unser Tool ist jetzt auch agil!&quot; - solche und ähnliche Aussagen sind Ihnen bestimmt - wenn Sie in der Software- oder Produktentwicklung tätig sind - bekannt.</em></p><p><strong style=\"\"><em style=\"\">Doch was genau ist eigentlich dieses agil? In diesem Kurs lernen Sie die Grundlagen, um mit reden und urteilen zu können!</em></strong></p><ul style=\"\"><li><strong style=\"\">Verstehen Sie, was agil für die Software- und Produktentwicklung im Kern bedeutet</strong></li><li><strong style=\"\">Lernen Sie, sich an Themen rund um &quot;agil&quot; zu beteiligen</strong></li><li><strong style=\"\">Verstehen Sie endlich, wovon Kollegen reden, wenn die von agile Entwicklung sprechen</strong></li></ul>Wenn Sie in Ihrem Unternehmen, in Zeitschriften oder auch in Gespräch mit Freunden und Kollegen auch auf den Begriff &quot;agil&quot; gestoßen sind und sich fragen, was genau hat es damit auf sich, dann sind Sie bei mir in diesem Kurs <strong style=\"\">genau richtig:</strong><ul style=\"\"><li><em style=\"\">Sie sollten grob verstehen, wie Projekte durchgeführt werden</em></li><li><em style=\"\">Sie brauchen in diesem Kurs keine Vorkenntnisse über spezielle Methoden</em></li><li><em style=\"\">Sie müssen keine Software oder Produkte erstellen</em></li><li><em style=\"\">Kommen Sie mit einem offenen Mindset und lernen Sie den Rest direkt bei mir im Kurs</em><span></span></li></ul><p><strong style=\"\">Mir persönlich ist es sehr wichtig ein <strong style=\"\">gemeinsames Verständnis</strong> über das Wort <strong style=\"\">agil</strong> zu schaffen, wie es in den Branchen verwendet wird. Ich habe Projekte scheitern sehen, Kollegen in Streit auseinander gehen und Manager über unterschiedliche Dinge reden sehen - alles nur, <strong style=\"\">weil die Bedeutung und das Verständnis dieses einen Wortes nicht klar war</strong>.</strong></p><p>Es ist auch nicht das Wort an sich, sondern das, was wir mit <strong style=\"\">impliziten Annahmen</strong> und Hörensagen in dieses Wort interpretieren, was aber nicht der Wahrheit entspricht.</p><p>Sie sind bei mir absolut richtig, wenn Sie</p><ul style=\"\"><li><strong style=\"\">... das Wort &quot;agil&quot; im Entwicklungsbereich noch gar nicht kennen</strong></li><li><strong style=\"\">... sich einfach einmal über die Hintergründe von &quot;agil&quot; informieren wollen</strong></li><li><strong style=\"\">... wenn Sie ihr Wissen über das Wort &quot;agil&quot; auffrischen wollen</strong></li><li><strong style=\"\">... sich innerhalb der Community einfach einmal darüber austauschen wollen</strong></li></ul>Ich freue mich schon auf Sie, bis gleich!", 
    "end_date": null, 
    "title": "Agil kompakt: Agile & Agilität verstehen lernen!", 
    "price": "20.00", 
    "instructors": "Sebastian Schneider", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566464_6db5_2.jpg", 
    "course_url": "https://www.udemy.com/agil-agile-kompakt/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T20:38:36Z"
}