{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong>Agile Professional Certification Preparation (PMI-ACP) </strong>from LearnSmart.</p><p>LearnSmart is <strong>Project Management Institute (PMI) Global Registered Education Provider (REP 3577).</strong> This course qualifies for <strong>24.25 credit hours</strong> toward the PMP, CAMP or ACP training contact hours or toward maintaining your current certification. Thus meeting the contact hour requirement necessary to register for the <strong>ACP</strong> exam or for experienced project managers wanting to brush up on their education.</p><p><strong><em>We are actively updating this course content Stay tuned to our latest update</em><em></em><br></strong></p><p><strong>Course Overview:</strong></p>Agile is an alternative methodology to traditional project management and is used in a wide range of applications. Agile anticipates project changes giving users maximum flexibility over traditional project management objectives; breaking projects into prioritized requirements. With Agile, detailed goals are set for many iterative levels within the project scope focusing specifically on expected changes, time estimates, budgets and project priorities.<p><br>This exclusive training bundle thoroughly examines Agile development so that students may learn strong team building skills and effective planning and estimating. Begin immersing yourself in the skills needed to work as an Agile expert within your business with this exclusive Agile training bundle from LearnSmart<br></p><p>This training includes an introduction to Agile, Change Management, Prioritization, Stakeholder Expectations, Team Empowerment, Levels of Planning Adaptation and much more. </p><p><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart meth</em><em>od to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>This course is of high quality - This course will let you become a ACP master and it will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlili</em></li><li><em>I enjoyed learning every bit of this course - worth every bit - This is the first time I sat thru the entire course lectures, listened very carefully and assim</em><em>ilated a lot of Scrum and Agile PM knowledge. This method of education is of prime value because you don't have to tax your eyes reading - just sit back and listen to any lecture you want. This helps in learning faster than reading. I am glad I took this course - the lectures and the 83 quizzes that really challenged my brain - Khurshid Khan</em></li></ul>", 
    "end_date": null, 
    "title": "Agile Professional Certification Preparation (PMI-ACP)", 
    "price": "25.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/727526_40c8_2.jpg", 
    "course_url": "https://www.udemy.com/agile-professional-certification-preparation-pmi-acp/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T01:55:50Z"
}