{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Starting a change effort can be really tough. Implementing the change can be even tougher. Sometimes you need a little help.</p>\n\n<p>A well thought through Change Plan can help you fully understand your change, decide on the best approach for your change and help you identify the right people to manage your change.</p>\n\n\n\n\n\n<p>Terrapin Agrada’s  AMAZING Change Management video series will help you to build  your own Change Plan.</p>\n\n\n\n\n\n<p>Download and use the Change Plan template provided to create your Change Plan that addresses your situation, your circumstances, the type of change you are implementing and the types of resources available to you to implement it.</p>\n\n\n\n\n\n<p>Then watch the videos covering change management basics and popular change models and theories. From there, add to / amend / build on your Change Plan, with your new information and new insights. </p>\n\n\n\n<p>Armed with the latest research, your Change Plan will help guide you through the pitfalls of change management with ease.</p>\n\n\n\n<p>THREE AIMS FOR THIS COURSE: </p>\n\n\n\n<p>1. The number one goal of this course is to help you create an AMAZING Change Plan for an existing or upcoming organisational change you are involved with (large or small)</p>\n\n\n\n<p>2. Each lecture introduces a new change management theory that will  help you complete, add to, edit, or amend your Change Plan, so that it is tailored to your circumstances</p>\n\n\n\n<p>3. Help you relate to changes going on in your organisation (either with you leading the change or when the change is being done to you) by providing opportunities for you to reflect on your experiences in light of the different change management theories and models. </p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "AMAZING Change Management", 
    "price": 0, 
    "instructors": "Susan Tuttle", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821938_dba2_4.jpg", 
    "course_url": "https://www.udemy.com/amazing-change-management/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T12:59:12Z"
}