{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Right now, there are over <strong>3,000+</strong> job listings worldwide that are looking for Product Managers, that pay on average<em> $100,000 / year</em>.</p><p>The demand for Product Management is increasing at an insane rate. More and more companies are finally figuring out how important this discipline and this role is to their success.</p><p>But how exactly do you get into the field? There aren't any degrees in Product Management &amp; there are no certifications. Most Product Managers get into the field through luck or connections - but that's going to change. In this course we'll get you up to date on ALL the skills you need to master Product Management AND get the job you need. There's no more ambiguity to it. We'll show you what you need to know and what you have to do - all taught from a Product Management insider.<br></p><p>Learn how to acquire the skills necessary to get up and running as a Product Manager. <em>Students aren't required to know anything beforehand</em> - we'll teach you the fundamentals, how to apply them, how to develop into an advanced product manager, and finally how to get a job as a Product Manager.</p><p><strong><em>Your instructors:</em></strong><br></p><p>Cole Mercer has been a Senior Product Manager at Soundcloud, Bonobos, Mass Relevance, and has taught the Product Management course at General Assembly in Manhattan, NYC.</p><p>Evan Kimbrell is a Top rated Udemy instructor with 11 courses on everything Entrepreneurship. His courses have over 35,000 students, 1,000+ 5 star reviews, and an average rating of 4.9 / 5.0. </p>", 
    "end_date": null, 
    "title": "Become a Product Manager | Learn the Skills & Get the Job", 
    "price": "35.00", 
    "instructors": "Cole Mercer, Evan Kimbrell", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673654_d677_7.jpg", 
    "course_url": "https://www.udemy.com/become-a-product-manager-learn-the-skills-get-a-job/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T19:35:12Z"
}