{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Start increasing your effectiveness and success now.</p><p style=\"\">1. Results count. Effectiveness is measured by Results.</p><p style=\"\">2.  To stay focused or regain focus quickly is both a science and an art. In this course I teach the science. This will start you on the path to becoming brilliant at this science and art. You will learn enough to remain effective but not be overwhelmed with information. </p><p style=\"\">3. Learn how to stay the distance. You will learn how to remain focused, motivated, optimistic, deal with adversity, be visionary and purposeful which will all help you stay the distance when pursuing your vision and goals. Staying the distance is crucial to reaching your goals and being effective.</p><p style=\"\">4. Learn easy-to-use methods. You will learn a number of easy-to-use methods to set goals so that you will always maintain clarity about your direction, plan in such a way that you maximize your own and others&#039; motivation, how to lead and manage with effectiveness and success in mind, maintain a more positive, hopeful and optimistic outlook, deal with adversity and obstacles in a way that energizes you, develop a vision and purpose consistent with these truths and on your terms.</p><p style=\"\">5. I combined practical experience with science. For the past 20 years I have used these methods when dealing with a variety of business owners – from large multi-million dollar companies to small operators. These techniques help me to cut through the clutter and retain focus, especially when discussing a variety of complex issues.</p><p style=\"\">6. Improve further even if already an effective owner, manager or leader. You will also be able to help you manage and teach others to become more effective. Refresh yourself by reinforcing what you already know by gut-feel.</p>", 
    "end_date": null, 
    "title": "Become Effective & Attain Personal, Work & Business Success", 
    "price": "45.00", 
    "instructors": "Harry Touzel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408380_ad94_2.jpg", 
    "course_url": "https://www.udemy.com/become-effective/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-30T20:24:22Z"
}