{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Through this course you'll get clear about who you are as a leader and how to position yourself for maximum impact. You will also become confident in yourself as a leader so that you feel energised and can energise your people. </p><p>Being an authentic, confident leader is an essential course for those who have focussed their development in a particular area of professional or technical expertise and who now need to develop as a leader. It is also for existing leaders who want to maximise their confidence, impact and effectiveness. </p><p>In the first part (lectures 2 to 4) you will learn what it means to be an authentic leader and create your own authentic leadership brand.</p><p>The second part (lectures 5 to 13) helps you to understand what prevents you from being confident as a leader and how you can put in place a self-support system that ensures you are a confident leader most of the time.</p><p>In lecture 14 you will identify how to take your learning forward. </p><p>Before you begin each part of the course download the participant notes. I have left spaces for you to fill in – this is to help with your attention and focus. </p><p>There are also two workbooks, one on creating your authentic leadership brand (lecture 4) and one on being a confident leader (lecture 13). They are an essential part of the course so download them and work through them after watching the videos. In addition there is a pdf on how to change those beliefs that are stopping you being authentic and confident as a leader. </p><p>To get the most out of this programme you need to create the optimum learning conditions for yourself. Please make sure you are not distracted by your phone or any other electronic devices.</p>", 
    "end_date": null, 
    "title": "Being an Authentic, Confident Leader", 
    "price": "25.00", 
    "instructors": "Sue Coyne", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/597486_05a5_2.jpg", 
    "course_url": "https://www.udemy.com/being-an-authentic-confident-leader/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-30T15:59:44Z"
}