{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>One of the most complicated and challenging tasks facing any manager, new or experienced, is managing people.   Getting a team of distinctly diverse employees to come together and deliver superior work is hard.  The workplace is complex and diverse.  It is always changing and being able to adapt to these changes is crucial to being a successful manager. <em>Be a better manager: Better management through understanding yourself</em> provides the skills and understanding that will enable you to develop high-performing and effective teams of satisfied and productive people by first getting to know yourself, your beliefs and your values.  </p>\n\n<p>An organization cannot reach its goals and objectives without effective, efficient and productive people.  Building strong successful teams is therefore of great importance.  Great teams of employees are created through exceptional leadership and management.  Being an exceptional manager and leader starts with understanding and managing yourself.  </p><p><strong>During this course you will learn:</strong></p><ul><li>How to develop self-awareness </li><li>How to develop and use emotional intelligence</li><li>How to develop and apply assertiveness</li><li>How to examine and adjust your limiting assumptions</li><li>How to develop you personal and professional values</li><li>How to develop your professional mission statement and managerial goals</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Better management through understanding yourself", 
    "price": "20.00", 
    "instructors": "Christa Van Greuning", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818846_f895_2.jpg", 
    "course_url": "https://www.udemy.com/better-management-through-understanding-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T16:46:36Z"
}