{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>What companies like Apple, Facebook, Coca-Cola, Mercedes, Armani have in common?</strong></p><p>They are recognized as Brands able to deliver something people love: a superior product experience compare to their competitors. </p><p>\t<strong>Brand Management</strong>: Build Successful Brands will teach you <strong>step-by-step</strong> how to create amazing brands that are worth money.</p>  <p>\tThe course is led by International Tought Leader on <strong>Brand Strategy</strong> Prof. Leslie de Chernatony, best seller author and professor in leading Universities.</p>  <p>\t This course start with the <strong>foundations of brand management</strong>. It will open by considering some of the issues involved in nurturing brands. To manage brands effectively there needs to be consensus about the nature of the brand in question. As brands are intangible assets a framework will be presented to characterize the nature of a brand. One of the problems is that an inconsistent approach to supporting the brand may result, so a framework to manage this will be discussed. Ways of building more emotion into a brand will be explored.</p>  <p>\t<strong>Effective brand strategy</strong> necessitates taking a pan-company perspective to understand the organization's competencies, identify new opportunities and leverage the advantage of corporate culture to deliver the brand promise. Brand success does not result just from focusing on customers, but rather from adopting a more balanced perspective by addressing stakeholders. In an era when it is easy to copy what a brand can deliver (functional values) it is more difficult to copy how the brand is delivered (emotional values). This session will address how by looking inside and outside an organization brands can grow and be sustained. It will open by presenting a model to strategically grow and sustain brands, \"From brand vision to brand evaluation\". After explaining the model, the different elements of the model will be explored to show how the model can be used to develop valuable brands.</p>", 
    "end_date": null, 
    "title": "Brand Management: Build Successful Long Lasting Brands ", 
    "price": "20.00", 
    "instructors": "Oxford Learning Lab", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116204_9474_7.jpg", 
    "course_url": "https://www.udemy.com/build-successfull-brands/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-06T19:57:33Z"
}