{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>THE GOAL</strong></p>\n\n<p>My goal of this program is to teach you to understand, to know, and to care for you brain. In order for you to perform at your best and to be your best self, you must have a brain that works at it’s best.</p>\n\n\n\n<p>This program to is to help you balance the function of your brain and to improve your life, since your brain and life are inseparably linked. Whether you are struggling at work, at home, in school, in relationships or within yourself, MINDtalk works hard to help you to get the best brain possible. </p>\n\n\n\n<p>The great news is the the brain is malleable and able to change. With some basic knowledge about the brain and targeted strategies you can make a good brain great. </p>\n\n\n\n<p>In order to keep our brains functional we need tune, balance, and properly nourish them to remain in excellent health. But if you don’t actively work out a plan to help it, the brain becomes significantly less active with age.</p>\n\n\n\n<p>This program is a practical guide to understanding and optimising the functioning in your own brain, so you can be the best person possible. It will also teach you how to enhance the brains of your children, your family, your friends, your colleagues and those you manage.</p>\n\n\n\n<p><strong>Part 1</strong> is a basic primer on the brain and will explain why it is essential take care and nurture the brain and how it is intimately involved in all you do. You will learn practical strategies and exercises that are based on real-life experience to learn to effectively bounce back from life’s inevitable set-backs. </p>\n\n\n\n<p><strong>Part 2 </strong>is where you will take the knowledge of Part 1 to help to enhance the brains of those around you by learning how to communicate, to coach and to build strong relationships with the brain in mind.\n</p>\n\n\n\n<p><strong>THE PROBLEM\n</strong></p>\n\n<p>It can be confidently said that most people rarely think about the day-to-day health of their own brain. People hardly ever give their own brains much thought, or considered how they work or how to keep them healthy. It is rarer still for people to actively exercise and nourish them.\n</p>\n\n\n\n<p>There are no required classes on practical brain science for everyday living in schools and universities, yet the brain is more important than law, finance, nursing, history, geography and hundreds of other subjects. In fact, the brain is the place where all this knowledge lives.\n</p>\n\n\n\n<p>People stress their brains by working at ever demanding and frenzied pace, living relatively sedentary lives, not getting enough sleep, holding on to grudges and resentments and the list goes on.\n</p>\n\n\n\n<p>Without realising it, people deprive the brain of proper nutrients, invigorating exercise, fitful sleep, deep learning, and enriching social relationships.\n</p>\n\n\n\n<p>When the brain is ineffective, over-stressed, and under performing, so are we.\n</p>\n\n\n\n<p><strong>THE PROMISE\n</strong></p>\n\n<p>By taking simple steps to balance and optimise your brain function, you will be able to enhance and take better control of your life.\n</p>\n\n\n\n<p>My goal has been to design a practical, straight-forward program to teach you the latest neuroscience research and cognitive psychology on how to achieve the best brain function possible.\n</p>\n\n\n\n<p>The principles and exercises in this program are based on years of learning and practical experience.\n</p>\n\n\n\n<p>MINDtalk’s purpose to is to help people to optimise and restore the brain.</p><p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Building a Better Brain. Building a Better You.", 
    "price": "25.00", 
    "instructors": "Jason Liem", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718252_c389_2.jpg", 
    "course_url": "https://www.udemy.com/managing-with-the-brain-in-mind/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T12:33:15Z"
}