{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Business Management Training - Be A Better Manager</strong></p><p>Learn how to use Data to improve your management skills<br></p><p><strong>Improve Your Management Skills - Data Driven Manager</strong></p><p>Do you want to learn how to learn how to improve your management skills and career by becoming a Data Driven Manager?</p><p><strong>Get Results</strong></p><p>Data driven managers are managers that get results.</p><p>By becoming a data driven manager, you can increase your department’s productivity, improve profits and get yourself recognised as a manager that can get results and progress in your management career.</p><p><strong>A Manager's Job</strong></p><p>A manager's job is hard, especially if your systems and processes are now working for you and showing you in a bad light.</p><p>But if you can learn to become a data driven manager and learn how to create and manage systems and processes, then you can climb the path to a successful career in management in rapid time.</p><p><strong>A Leading UK Expert</strong></p><p>Myself and Stephen Mather, a leading UK management consultant and managing director of the revolutionary ProPeC system of business improvement, have collaborated to bring you this course on being a data driven manager from the “Be A Better Manager”  series of training courses.</p><p><strong>What You Will Learn</strong></p><ul><li>In this course you will learn what a data driven manager is.</li><li>You will learn how a data driven manager thinks and behaves.</li><li>And you will also learn how a data driven manager achieves their goals and succeeds in their objectives.</li></ul><p><strong> </strong></p><p><strong>100% Money Back Guarantee</strong></p><p><strong></strong>Before you go any further, let us just say that we don’t want you to be disappointed.<br></p><p>If you are unhappy with the course for any reason whatsoever, you can get a full refund in the first 30 days, backed by Udemy, with no questions asked.</p><p><strong>Start Your Journey To Being A Better Manager</strong></p><p><strong></strong>Join us on the other side and learn how to become a data driven manager that gets results for their business and improve your career prospects!<br></p>", 
    "end_date": null, 
    "title": "Business Management - Data Driven Manager Training (NEW)", 
    "price": "35.00", 
    "instructors": "Mark Timberlake, Stephen Mather", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661070_d207.jpg", 
    "course_url": "https://www.udemy.com/business-management-training-become-a-data-driven-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T13:10:21Z"
}