{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>A Buddhist proverb warns, “Be mindful of intention. Intention is the seed that creates our future.” In a very real sense, this statement expresses the reason for business analysis. This discipline is really all about choosing and defining a desired future because without intention (expressed in business analysis terms, “requirements”), no future is more or less desirable than another.</p><p>In reality, every organization does some form of business analysis whether it uses the term or not. For many (especially larger organizations), it is an extremely structured, managed process while others thrive on change and only do business analysis when and as needed. The perception that business analysis is only needed to develop IT solutions is inaccurate. Actually, it is a critical component of any change initiative within an organization whether software is involved or not.</p><p>The course defines how business analysis is currently practiced. The authors provide insight into this fast-growing field by distinguishing <strong>strategic, tactical, </strong>and <strong>operational </strong>business analysis. It provides surveys of what Business Analysts really do and what business analysis techniques people use most often when they are the one “wearing the BA hat”. You will learn what “requirements” really are and what different types of requirements exist. Because many requirements define future information technology (IT) solutions, the authors share their experience on how Waterfall, Iterative, Agile, and Experimental (aka \"Chaotic\") Software Development methodologies impact the business analysis responsibility.</p><p>Although the field of Business Analysis offers great career opportunities for those seeking employment, some level of business analysis skill is essential for any adult in the business world today. Many of the techniques used in the field evolved from earlier lessons learned in systems analysis and have proven themselves to be useful in every walk of life. We have personally experienced how business analysis techniques help even in your private life.</p><p>We created this course for everyday people in the real world to give you a basic understanding of some core business analysis methods and concepts. If this course answers some of your questions, great. If it raises more questions than it answers (implying that it piqued your curiosity), even better. If it motivates you to learn more about this emerging and fascinating topic, it has served its purpose well.</p>", 
    "end_date": null, 
    "title": "Business Analysis Defined", 
    "price": "20.00", 
    "instructors": "Tom and Angela Hathaway, Daniel Myers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368474_6264_3.jpg", 
    "course_url": "https://www.udemy.com/business-analysis-defined/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T23:46:51Z"
}