{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Wow. Over 300 students enrolled within 48 hours of opening. These tips are practical and profitable and low-cost or no-cost.</p><p>In 2008 when the recession started and I was running different marketing and networking events and websites I made a series of videos called Recession Busters. These were quick tips for marketing and selling around different themes. For example how to Increase your profits dramatically. \"10 Top tips to to promote your business with Business Cards using business cards.\" I found these recently and after looking through I saw the potential use for them today. These ideas never die, but sometimes change. For example at the time, although I was using e-mail and online newsletters, I was producing printed copy which my team were distributing manually and by post. Today its unusual to see a printed newsletter except in churches or community groups, and these are usually duplicates of the online issue.</p><p>I've included an old video from 2008 in the end bonus section so you can see how quality of picture and sound has dramatically improved.</p><p>This course is really a series of fast tips that you can use day to day. Working alone? Watch one video on each Monday and try to use the 10 tips each day. Working with others or have your own sales team? Then show them one a week and see how it's gone the following Monday. Follow this pattern and soon everyone will know you mean business. And you will see positive results. </p><p>When you enrol and start using these tips I'd really  like to hear from you. Enrol now and start using these ideas tomorrow.<br></p>", 
    "end_date": null, 
    "title": "Business Builders No 1. 100 Top Tips to improve your Company", 
    "price": "20.00", 
    "instructors": "Mike Leahy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606328_f581_2.jpg", 
    "course_url": "https://www.udemy.com/business-builders-no-1-100-top-tips-to-improve-your-company/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T20:57:17Z"
}