{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong style=\"\">Are you new to Risk Management and struggling with Risk Management terms?</strong>  </p>  <p>  \t<strong style=\"\">Are you appearing in any certification exam such as PMP and want to refresh your understanding of Risk Management?</strong>  </p>  <p>  \t      +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t<strong style=\"\"> The   course   is currently priced at   $48   </strong>  </p>  <ul style=\"\">  \t<li>You   will   have   unlimited   lifetime   access   at   no   extra   costs,   ever</li>  \t<li>All   future   additional   lectures,   bonuses   in   this   Course   are   always   free</li>  </ul>  <p>  \t                            ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t<strong style=\"\">30   Day   Money   Back   Guarantee</strong>  </p>  <p>  \t                             Don’t   forget,   all   my   Courses have   an   unconditional,    30   Day   Money Back   Guarantee.      This   means   you   have    absolutely   no   risk   when   signing   up   to   one of   my   great    Courses.      I   never   ask   questions   and   always   refund 100%  in full.  </p>  <p>  \t                            +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <p>  \t                             This   Course   will   continue   to   grow,   new   ideas,    new   lectures,   new   great   tips,   tricks and   techniques...  </p>  <p>  \t                            but   the   price   will   grow   too!  </p>  <p>  \t                             This   Course   is   available   today   at   a   great    introductory   price   but   this   will   soon have   to   go   up!  </p>  <p>  \t<strong style=\"\">However,    if   you   enroll Today   you   are   “locked   in” – you   will    get   all   the   new lectures   and   materials   at   NO   extra    cost – EVER!</strong>  </p>  <p>  \t                            You   can   get   unlimited   lifetime   access   at   no   extra   cost ,   but   only   if   you   enroll today  </p>  <p>  \t                            ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>  <h4>Click   on   the Blue   “Take   This   Course”   Button   at   the   Top Right   Hand   Side   of   the   Page</h4>  <h4>Then   follow   the   instructions   to   register   and   pay   for   the course.</h4>  <hr style=\"\">  <p>  \t                                       How do you define risk? Risk is something which stops your organization to achieve its objectives.  </p>  <p>  \t                    What is risk management?  </p>  <p>  \t                  Five steps of managing risk include:  </p>  <ol style=\"\">  \t<li>Planning for Risk Management</li>  \t<li>Identifying Risks</li>  \t<li>Analyzing Risks</li>  \t<li>Planning Risk Response</li>  \t<li>Monitoring and Controlling Risks</li>  </ol>  <p>  \t                    Identified risks are recorded in risk register. These risks are analyzed using quantitative or qualitative techniques. One qualitative technique which is commonly used in Probability and Impact Matrix. I have explained this easy to use in detail in this course.  </p>  <p>  \t                    Risks could be negative or positive (opportunity). What are the approaches to address positive and negative risks? We need not only to address the negative risks but also the positive risks.  </p>  <p>  \t                  ISO 9001:2015 is in the process of getting revised. One new thing in this standard is Risk Based Thinking. This ISO 9001 standard will be released by end of 2015. This development has created a great interest in Risk Management.  </p>", 
    "end_date": null, 
    "title": "Business Risk Management", 
    "price": "20.00", 
    "instructors": "Sandeep Kumar ­", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334442_1b6c_4.jpg", 
    "course_url": "https://www.udemy.com/business-risk-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-03T00:49:49Z"
}