{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Business Management Training - Be A Better Manager</strong></p><p>Learn how to become influential and improve your management skills</p><p><strong>Improve Your Management Skills - Influential Manager</strong></p><p>Do you want to learn how to learn how to improve your management skills and career by becoming an influential manager?</p><p><strong>Get Results</strong></p><p>Influential managers are the managers that get ahead.</p><p>By becoming an influential manager, you can increase your income, improve your self esteem and accelerate your career advancement</p><p><strong>A Manager's Job</strong></p><p>A manager's job is hard, especially if you are struggling to influence those around you, both those above you and those below you.</p><p>But if you can learn to become influential and learn how successful managers influence those around you, both your team members, your peers and even your bosses, then you can climb the path to a successful career in management in rapid time.</p><p><strong>A Leading UK Expert</strong></p><p>Myself and Stephen Mather, a leading UK management consultant and managing director of the revolutionary ProPeC system of business improvement, have collaborated to bring you this course on being a data driven manager from the “Be A Better Manager” series of training courses.</p><p><strong>What You Will Learn</strong></p><ul><li>In this course you will learn what an influential manager is.</li><li>You will learn how an influential manager communicates.</li><li>And you will also learn how an influential manager achieves their goals and succeeds in their objectives.</li></ul><p><strong> </strong></p><p><strong>100% Money Back Guarantee</strong></p><p>Before you go any further, let us just say that we don’t want you to be disappointed.</p><p>If you are unhappy with the course for any reason whatsoever, you can get a full refund in the first 30 days, backed by Udemy, with no questions asked.</p><p><strong>Start Your Journey To Being A Better Manager</strong></p><p>Join us on the other side and learn how to become an influential manager that gets results for your business and improve your career prospects!</p>", 
    "end_date": null, 
    "title": "Business Management - Influential Manager Training (NEW)", 
    "price": "35.00", 
    "instructors": "Mark Timberlake, Stephen Mather", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661106_5c83.jpg", 
    "course_url": "https://www.udemy.com/business-management-training-become-an-influential-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T14:06:28Z"
}