{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>If you have ever been concerned that your home buyer demands are interfering with the efficient management of your construction business, this course is for you.</p><p>This course provides complete examples of the five Client Management Documents and sufficient design detail to construct your own set of documents, as long as you have an intermediate working knowledge of Excel.</p><p>Learn how the implementation of these five documents can put you back in control of your client relationships and your construction finances.</p><p>Built on years of actual construction experience, you’ll get insights into how to:</p><ul><li>Set initial specifications and get paid for changes;</li><li>Keep the client, lenders and yourself informed and up-to-date on the</li><li>finances of a job;</li><li>Bring any client issues to the surface before they cost you big-time;</li><li>Understand the motivations of your clients better;</li><li>Get paid quicker by customers and/or lenders;</li><li>Document problems between you and your clients so you are prepared for</li><li>confrontations;</li><li>Manage one of the biggest risks you face as a builder – Client Transaction Risk.</li></ul><p>Taught in a straight-forward, easy-to-understand manner by an instructor with university-level teaching experience and more than thirty years of construction management, this course, and all the courses in the “Nailing It” series, is meant for the hands-on management of your construction business.</p><p>When you complete this course and implement the Client Management Documents system you will be a better manager of your client relationships and your client transaction risks.</p>", 
    "end_date": null, 
    "title": "Client Management Documents for Contractors (Build Your Own)", 
    "price": "20.00", 
    "instructors": "Dennis Anderson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653984_e07a_4.jpg", 
    "course_url": "https://www.udemy.com/client-management-documents-for-contractors-build-your-own/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T23:38:24Z"
}