{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to <strong style=\"\">Climbing the Ladder: Moving from IT Pro to Manager </strong>from LearnSmart.</p><p style=\"\">LearnSmart is <strong style=\"\">Project Management Institute (PMI) Global Registered Education Provider (REP 3577</strong>). This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the<strong style=\"\"> Professional Development Unit (PDU)</strong> requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p style=\"\">  \tIn this course technical professionals will learn the skills to survive and thrive in the workplace. As a new and future managers will gain a clear understand of just how important clear lines of communication are -- with both employees and superiors. </p><p style=\"\">If you&#039;re interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for 9.75 PDU credit hours toward your PMP® certification from PMI.</p><p style=\"\"><strong style=\"\">Course Overview:</strong></p><p style=\"\">We understand how easy it can be to become overwhelmed, and that management isn&#039;t always so much about leading, as it is about pointing the way. In this course technical professionals will learn the skills to survive and thrive in the workplace. Understand the different ways of managing the development of technical professionals, grow through gaining key successful communication and process management skills, and ultimately develop as leader as you transition into management.</p><p style=\"\"><strong style=\"\">Course Breakdown:</strong></p><p style=\"\"><strong style=\"\">Section 1</strong>: In the pre-assessment quiz you&#039;ll face questions from all sections of this PMP Certification training. Test your current knowledge and know your strengths and weaknesses.</p><p style=\"\"><strong style=\"\">Section 2</strong>: As a technical professional, you will learn the skills to survive and thrive in the workplace. Understand what it takes to develop organizational skills,such as time management, performance management, and stress management.</p><p style=\"\"><strong style=\"\">Section 3:</strong> Gain a clear understand of just how important clear lines of communication are -- with both employees and superiors. In addition, students will see how easy it can be to become overwhelmed, with so much to do in what never seems like enough time. By concentrating on effective time management, these individuals can avoid much of the stress and pressure that comes with a new position.</p><p style=\"\"><strong style=\"\">Section 4</strong>: Management isn&#039;t always so much about leading, as it is about pointing the way. It is your duty to point the way by instructing, giving feedback and sharing your experience. This course looks at leadership roles, styles and behaviors, showing how to built the strengths of your team and overcome personality differences and conflict.</p><p style=\"\"><strong style=\"\">Section 5</strong>: As a short Final Exam, these questions ties all the above sections in a quick review of key concepts.</p><p style=\"\"><strong style=\"\">Recommendations</strong>:</p><p style=\"\">Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul style=\"\"><li style=\"\"><em style=\"\">Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li style=\"\"><em style=\"\">This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept. The instructor is highly engaging and highly motivating. Can&#039;t be better. Thank you -- Saber Tlili</em></li><li style=\"\"><em style=\"\">Excellent class! -- I already have my PMP, but wish I had this class as a study tool prior to taking the test. I am confident that a person who studies the materials presented in this course should have no problem with the exam. I took the class for the  PDUs to keep my certification up. On completion of the class I followed the instructions, and had no problem registering the credits with PMI -- Robert Vroom</em></li></ul>", 
    "end_date": null, 
    "title": "Climbing the Ladder: Moving from IT Pro to Manager", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427152_6059_5.jpg", 
    "course_url": "https://www.udemy.com/climbing-the-ladder-moving-from-it-pro-to-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T19:44:35Z"
}