{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\n                                        </p>\n\n<p><strong class=\"redactor-inline-converted\">Empieza a hacer esos cambios que llevas tanto tiempo esperando!</strong></p>\n\n\n\n<p>En este curso de <strong class=\"redactor-inline-converted\">+ de 2 horas en vídeos</strong>, <strong class=\"redactor-inline-converted\">24 clases</strong> y <strong>decenas de ejercicios</strong> te voy a llevar a un viaje al autoconocimiento personal, porque solo si sabes quién eres podrás sacar tus potencialidades y c<strong class=\"redactor-inline-converted\">onseguir TODO lo que propongas.</strong></p>\n\n\n\n<p>Además, <strong class=\"redactor-inline-converted\">si no quedas satisfecho</strong>, no te preocupes, <strong class=\"redactor-inline-converted\">recuperarás</strong><strong class=\"redactor-inline-converted\"> tu dinero.</strong> Pues estoy segura que esto es una <strong class=\"redactor-inline-converted\">inversión</strong> en la que tienes que ganar mucho más de lo que pueda costar el curso. He tenido<strong class=\"redactor-inline-converted\"> 0 reembolsos </strong>en mis<strong class=\"redactor-inline-converted\"> más de 200 alumnos</strong>.</p>\n\n\n\n<p>Y para darte pruebas de que los alumnos que han hecho el curso han quedado satisfechos y han empezado a la acción te dejo algunas de las calificaciones que han hecho del curso:<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Calificaciones de alumnos:</strong><br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><em>\"Excelente curso</em></strong><em>. María, prácticamente te lleva de la mano, paso a paso al objetivo. Muy buen curso.\"</em></p>\n\n\n\n<p>Marcelo Tapia</p>\n\n\n\n<p><em>\"<strong class=\"redactor-inline-converted\">EXCELENTE</strong>. Este curso es magnífico y María es una coach increíble, a mí me ha ayudado muchísimo a enfocarme en mis objetivos y ha sido una gran dosis de energía positiva.[...] En realidad lo considero un curso del que se puede beneficiar todo aquel\n que desee un cambio positivo en su vida. GRACIAS DE CORAZÓN MARÍA :)\"</em></p>\n\n\n\n<p>Inines</p>\n\n\n\n<p><em>\"<strong class=\"redactor-inline-converted\">¡Gracias por todo Maria!</strong> Vale la pena hacer \neste curso y acabarlo hasta el final, te da las herramientas para \nconseguir conocerte y así llegar donde desees, recomendable 100%.\"</em></p>\n\n\n\n<p>Marta Romero</p>\n\n\n\n<p>Por suerte, día a día recibo feedback como estos que me animan a seguir haciendo lo que hago. Hasta ahora, solo formaba presencialmente, ahora, UDEMY me ha dado la oportunidad de romper las distancias y <strong class=\"redactor-inline-converted\">ayudar a gente de todo el mundo</strong>. <br></p>\n\n\n\n<p>El coaching parte de la premisa de que cada uno tiene <strong class=\"redactor-inline-converted\">el conocimiento y las herramientas para conseguir sus objetivos y solucionar sus problemas</strong>,  y de aquí la relación con la frase de Ortega y Gasset, el coach no te  va a decir qué debes hacer o cómo, jamás te va a aconsejar. El coach ve a  su coachee (cliente) como un <strong class=\"redactor-inline-converted\">diamante en bruto </strong>al que hay que sacarle  brillo para que sea aún mejor. El coach te ayudará a <strong class=\"redactor-inline-converted\">fijar tus metas</strong>,  te dará las herramientas necesarias para definir tus necesidades y tus valores, te motivara por el camino para que no decaigas… Es un guía que te empuja hacia tu <strong class=\"redactor-inline-converted\">éxito personal</strong>.  El objetivo es el autoconocimiento, y cuando realmente sabemos quién  somos, podemos dar lo mejor de nosotros, podemos <strong class=\"redactor-inline-converted\">ser nuestra mejor  versión.</strong></p>", 
    "end_date": null, 
    "title": "Coaching para el Exito. Alcanza ya tus Objetivos!", 
    "price": "20.00", 
    "instructors": "Maria del Olmo Vila", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151314_2381_8.jpg", 
    "course_url": "https://www.udemy.com/auto-coaching-para-el-exito/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T10:46:35Z"
}