{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong><em></em></strong><strong><em>Coaching and Development for Business - incorporating the 4-E model®</em></strong></p><p>Do you want to turn disengaged employees into passionate, present employees?</p>  <p>Do you want to improve your employees sense of job satisfaction?</p>  <p>What about helping your company stand out from your competitors?</p>  <p>Increase overall business performance and efficientcy?</p>  <p><strong>If so, then this course is for you.  Here is why:</strong></p>  <p>Coaching will deepen your employees view of themselves and how they fit in the company.  They will see the company as their own instead of a means to live.  Coaching will show your employees that they are seen, supported and belong in the company they are working for. Your bosses will see the company begin to benefit as more and more employees unveil their hidden potential and skills.  This may result in further career opportunities for you or that long-awaited promotion. Either way you will benefit along with your employees and your company.</p>  <p>More and more companies are incorporating coaching as an available resource to their employees.  Managers, CEOS, staff, and even high profile VIPs are benefiting from coaching in their careers.  Some celebrities that have benefited from coaching include US President Barack Obama, Oprah Winfrey, and the band Metallica.  Many top athletes have benefited from coaching.  Eric Schmidt, Chairman and CEO of Google, highly recommends coaching to new and upcoming CEOs because of its value in career and company success. These high profile people have seen their career dreams and paths come to fruition.  Today these people live in the rewards of hard work, growth, and perseverance; skills they learnt from a fantastic coach.  Their companies have become profitable and benefited in recognition and esteem.</p>  <p><strong>If some of the top VIPs and CEOS not to mention companies in the world are benefiting from coaching, you can be sure that yours will too.</strong></p>  <p>How is this course different from other coaching or business courses?</p>  <p>I am glad you asked.  This course does not focus on a high level of integration between coaching and business nor do you need to study two different courses to get the same information.  Instead we have condensed this course into turning you from a manager into a coaching manager.  We will equip you with all the skills and values you need to understand your employees and stretch them past their comfort zones.  We go into more specifics on how to be a coach in the business world and benefit your own company. By the end of this course you will be ready to take on your employees and send them in hot pursuit of their career paths.</p>  <p>This course also takes on a fresh perspective.  That of coaching you throughout the course.  How many courses coach you and walk with you step for step?  Some do, but most relay information.  We have taken time to think of popular questions that you may have regarding coaching and your company.  We have answered these questions as best as we can whilst including many examples to bring about a clear understanding. Our goal is to inspire you and show you that you have what it takes to coach your staff. We believe in you and what coaching can do for your company.</p>  <p>Coaching has a ripple effect.  It starts with one person and the effects filter through until the company as a whole has been impacted.  As a manager wanting to coach and walk alongside employees, you are the starting point of the ripple effect.  I applaud you for the vision you have for your company and employees as well as the bravery to go beyond your own comfort zones. As you explore this course, we hope that you find yourself well-equipped and transformed from a directive manager to a coaching manager.</p>", 
    "end_date": null, 
    "title": "Coaching and development for business", 
    "price": "20.00", 
    "instructors": "Adriaan Brits", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736866_8621_3.jpg", 
    "course_url": "https://www.udemy.com/coaching-and-development-course-for-business/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T14:59:21Z"
}