{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Si tienes el deseo de mejorar profesionalmente, generar ahorros y utilidad para tu empresa, este curso es ideal para ti, con esta iniciativa podrás crecer y mejorar en lo que sea que hagas, aprenderás los conceptos generales de la Calidad y los Principios de ISO, tendrás la seguridad y capacidad de liderar un proyecto de implementación en tu empresa de un Sistema de Gestión de la Calidad o un proyecto de mejora continua, o un proyecto de certificación tipo ISO9000, porque tendrás los conocimientos y herramientas para hacer un excelente trabajo. \n\n  </p>\n\n<p>Si tu empresa tiene problemas de crecimiento, se han hecho inversiones en publicidad, se han bajado los precios, y aun así no hay incremento en clientes, no se genera un crecimiento y rentabilidad; es que tal vez se están ejecutando las acciones equivocadas, con este curso aprenderás a ver todos los aspectos que hay que considerar para lograr una gestión de calidad integral y producir mejores resultados.<br></p>\n\n<p>A través del tiempo las empresas han enfrentado los problemas de calidad desde diferentes enfoques, el problema de algunas radica que solo trazan estrategias para el corto plazo, no ven más allá de sus necesidades inmediatas, la planeación de este tipo no les permite obtener niveles óptimos de calidad y por lo tanto su rentabilidad es baja.\n\n  </p>\n\n\n\n<p>Las técnicas que aprenderás son aplicables a cualquier tipo de empresa y tamaño, industrial, de servicios o gubernamentales.<br></p>\n\n<p>Conocerás Los Fundamentos de la Calidad y Los principios de la Calidad según ISO, y la manera de cómo ponerlos en práctica, para que de forma inmediata empieces a generar una nueva cultura organizacional, buscando la excelencia, generando crecimiento, acciones que podrán incluso significar el permanecer o no en el mercado. \n\n  </p>\n\n<p>El programa general a seguir se divide en cinco secciones:<br></p>\n\n<p>·        Sección 1 Veras Porque es importante la Calidad y Fundamentos.\n\n  </p>\n\n<p>·        Sección 2 Veras Los 8 Principios de la Calidad para el Éxito empresarial.\n\n  </p>\n\n<p>·        Sección 3 Veras La Documentación y los Manuales de Procedimientos\n\n  </p>\n\n<p>·        Sección 4 Veras Lo que implica una Gestión por valores.\n\n  </p>\n\n<p>·        Sección 5 Veras algunas Estrategias de mejora según expertos.\n\n  </p>\n\n<p>Invierte en tu preparación profesional, no lo dudes, inscribirte y tomar este curso será una excelente decisión. Si aún no lo has hecho, inscríbete ya!\n\n  </p>\n\n<p>Si ya te inscribiste, te felicito, la forma más noble de crecer, mejorar y ayudar a los demás es preparándose!!</p>", 
    "end_date": null, 
    "title": "Como lograr objetivos organizacionales de forma eficiente", 
    "price": "30.00", 
    "instructors": "Rodolfo Pinera", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806308_9956_3.jpg", 
    "course_url": "https://www.udemy.com/como-lograr-objetivos-organizacionales-eficiente-y-eficaz/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T17:08:57Z"
}