{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t              We live in interesting times as on the one hand our industrial age systems of organization are ending their life cycle and on the other globalization and information technology are enabling the emergence of new forms of organization, this transition is in turn driving a fundamental  transformation in our theory and methods of management, one that goes beyond our traditional paradigm designed for dealing with relatively static hierarchical organizations within relatively stable environments, to more complex networked organizations that are adapted to operating in a so called VUCA world of volatility, uncertainty and rapid change driven by innovation.  </p>  <p>  \t              This course is a first of its kind bringing together some of the latest ideas from complexity theory and emerging approaches to the management of complex organizations. During this course we will explore many of these new ideas including, network organizations, co-evolution, co-creation of value, systems thinking, agile development, and the adaptive cycle to name just a few.  </p>  <p>  \t<strong style=\"\">Complex systems and systems thinking</strong>  </p>  <p>  \t              We will start this section with an overview to complex systems theory, talking briefly about systems thinking and what exactly a complex system is, with some examples. Following on from this, we will take an introduction to the basic concepts from complexity theory, that we will be using throughout the rest of the course such as self-organization, networks, evolution, systems and more.  </p>  <p>  \t<strong style=\"\">Complex environment of the 21<sup style=\"\">st</sup> century</strong>  </p>  <p>  \t              It is often said that we live in an increasingly complex world, the pace of change, the degree of connectivity and the scale of operations are leading to rapidly escalating complexity in many domains. The aim of this section is to give you an overview to the main forces that are shaping the complex environment within which organizations have to operate in the 21<sup style=\"\">st</sup> century. We will try to untangle and understand the underlying drivers that are causing this volatile environment of heightened complexity.  </p>  <p>  \t<strong style=\"\">The VUCA framework</strong>  </p>  <p>  \t              The net result of the complex environment that we explored in the previous section is what the business world calls VUCA.  VUCA is an acronym for volatility, uncertainty, complexity and ambiguity; it captures the most salient challenges faced by leaders operating in complex environments. In this section we introduce the concept of VUCA and give an overview to navigating these challenging environments.  </p>  <p>  \t<strong style=\"\">Networked organizations</strong>  </p>  <p>  \t          The environment within which organizations operate has become greatly more complex over the past few decades. In the face of this our industrial model of organization that was design for operation within a very different environment is showing its limitation across a number of dimensions. In response to this is emerging a new type of organization that goes beyond the industrial age model, enabled by information technology, it is networked in structure, collaborative by nature, open and self-organizing. In this module we explore the DNA of these new forms of organization contrasting them with our more traditional form to understand their key features and finish by discuss approaches to managing them.  </p>  <p>  \t<strong style=\"\">Complex project management</strong>  </p>  <p>  \t              In this module we will see how a very different approach to our traditional linear project management methods are needed when projects reach a high degree of complexity. We will look at the methods presented by complexity management that are designed for managing large projects, under volatile and uncertain condition, within this paradigm projects are seen less as a set of linear stages to be completed and more as complex adaptive systems that evolve over time.  </p>", 
    "end_date": null, 
    "title": "Complexity Management: an introduction", 
    "price": "20.00", 
    "instructors": "Complexity Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/293074_907b_7.jpg", 
    "course_url": "https://www.udemy.com/complexity-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-03T11:02:19Z"
}