{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Dear Managers and Leaders:</strong></p><p>Are you dreading having a Critical Conversation (or what you might call a \"crucial conversation\" or a \"difficult conversation\")? Did you have a Critical Conversation recently that went awry? Did you just take on a new role and already know that you will need this essential communication skill? I invite you to enroll in this course so you can conquer your Critical Conversations. </p><p><em>Update March 2016: Clients and those enrolled in the course are using the information to help them move forward in their careers. Another development is that in addition to having success with their 1:1 Critical Conversations, they are having Critical Conversations with groups of people as well. </em></p><p><strong>In less than 2 hours, you can learn the \"S C O P E\" Approach for Having Your Critical Conversations and Building Your Leadership Brand in the Process</strong><br></p><p><strong>What you gain from this course: </strong><br></p><ul><li>Identify why you procrastinate (and why it's understandable when you do!)</li><li>Learn compelling reasons to go ahead and have the conversations</li><li>Recognize the two words to avoid when starting the conversation</li><li>Practice using the \"S C O P E\" approach (TM)</li><li>Hear real-world examples about people on both sides of Critical Conversations</li></ul><p>You will be provided a Planning Guide that you may use when preparing for your Critical Conversations. The course experience includes quizzes, other \"check your learning\" activities, and bonus information.</p><p><strong>Background information: </strong><br></p><p><strong></strong>In a recent survey of 835 professionals, 75% of them reported that the biggest drain on their resilience reserves is managing difficult people and office politics (Harvard Business Review online, January 5, 2015). As you manage people and projects, it is inevitable that you will encounter <strong>Sticky Situations, Tough Topics, and Poor Performance </strong>-- all of which have the potential to drain <em>your </em>resilience reserves. This course shows you how to have the Critical Conversations with ease so that your reserves are not drained. <br></p><p><strong></strong><em>****************************************************************************************************</em></p><p><em>After I hired Charlotte in 2007, I began to marvel at the way in which she communicates   with her students. She is adept at helping students and clients learn how to have critical conversations. I am pleased to learn that Charlotte and her colleagues at Perfect Balance are <strong>taking </strong><strong>her programs to         a global audience through this Udemy course. </strong></em><br></p><p>Robert L. Chapman<br>University administrator (retired)<br>Durham, North Carolina </p><p>****************************************************************************************************<br></p><p><em>Each time I attend one of your programs, i am reminded again of the importance of communication. Even though things move at a quick pace in my business, I know it's essential for me to stop, listen, and process the information clients share. Also, <strong>I am             now better prepared to have critical conversations, thanks to you.</strong></em><strong><br></strong></p><p>Cynthia Ward Manley, QSC, SFR<br>Master Certified Financial Coach<br>Caring Realty Partnership, LLC<br>Raleigh, North Carolina</p><p>****************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Conquering Critical Conversations", 
    "price": "25.00", 
    "instructors": "Charlotte Purvis", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539642_0779_6.jpg", 
    "course_url": "https://www.udemy.com/conquering_critical_conversations/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T00:00:42Z"
}