{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t            Questo video corso costituisce il primo approccio alla Contabilità Generale.  </p>  <p>  \t            E’ appositamente studiato per risolvere quelle tipiche difficoltà che incontra lo studente che affronta questo argomento di Economia Aziendale restando disorientato e confuso e che spesso sono causa di un insuccesso. Ma è concepito anche per tutti coloro che per lavoro devono o desiderano avvicinarsi a questo argomento, soprattutto se hanno lasciato gli studi da diversi anni.  </p>  <p>  \t            Impara la <strong>Contabilità</strong> in modo <strong>Semplice</strong> e <strong>Definitivo!</strong>  </p>  <ul>  \t<li><strong></strong>Risolvi definitivamente i problemi che incontri nell&#039;apprendimento a scuola!</li>  \t<li><span>Migliora il tuo rendimento scolastico</span></li>  \t<li><span>Entra nella logica del sistema contabile</span></li>  \t<li><span>Registra tutte le principali operazioni aziendali </span></li>  \t<li><span>Analizza e interpreta una situazione contabile</span></li>  \t<li><span>Formati solide basi per poter compiere qualunque scelta futura</span></li>  </ul>  <p>  \t<strong>Il Corso affronta tutte le tematiche che stanno alla base della contabilità.</strong>  </p>  <p>  \t            La Contabilità da sempre è utilizzata dalle aziende per comprendere e tenere sotto osservazione il proprio andamento economico e le disponibilità finanziarie a disposizione.  </p>  <p>  \t            E’ un mondo particolare, solo chi lo conosce può essere veramente utile ad un’azienda.  </p>  <p>  \t            Imparare le basi significa poter ambire - approfondendo l’argomento - ad essere colui che può controllare, analizzare, interpretare la gestione e dare suggerimenti fondamentali e indispensabili per una corretta gestione aziendale  </p>  <p>  \t            Il corso è quindi indirizzato oltre che agli studenti di corsi commerciali, anche a tutti coloro che ambiscono a ruoli di responsabilità quali ad esempio Responsabili/Direttori Amministrativi e Finanziari, Controller, Analisti.  </p>  <p>  \t            Il corso è composto da 18 lezioni suddivise in 6 sezioni  </p>  <p>  \t          Ogni lezione è preceduta da una &quot;pillola&quot; introduttiva che ha lo scopo di predisporti subito all&#039;ascolto e all&#039;apprendimento.  </p>  <p>  \t            La lezione è poi trattata con estrema semplicità perché è indirizzata a chi non ha nessuna conoscenza in materia e ogni punto particolarmente importante è distintamente richiamato.  </p>  <p>  \t            Il corso non si limita all’aspetto tecnico, ma quando necessario introduce anche aspetti teorici e culturali dell’argomento, utili per la completa comprensione sia del corso che di eventuali tuoi approfondimenti futuri.  </p>  <p>  \t            Un riepilogo finale sia di <em>ogni lezione</em> che di <em>ogni sezione,</em> ha lo scopo di consolidare definitivamente quanto imparato, mentre un sottofondo musicale, diverso per ogni lezione, accompagna il tuo apprendimento, rendendolo originale, piacevole e unico.  </p>  <p>  \t            E se ancora hai bisogno di qualche chiarimento, hai la possibilità di contattare il docente e chiarire gli ultimi dubbi!  </p>  <p>  \t            Poni le basi per un futuro migliore, il corso base di Contabilità Generale è il primo e indispensabile passo per affrontare tutti i tuoi progetti.  </p>", 
    "end_date": null, 
    "title": "Contabilità Generale. Le solide basi per capirla a fondo.", 
    "price": "25.00", 
    "instructors": "Marco Bianchi", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114544_2d3f_4.jpg", 
    "course_url": "https://www.udemy.com/contabilitageneraledibase/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-03T05:36:26Z"
}