{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   The first step towards a successful business or life for that matter, is to create, review or revive your vision: for your life but primarily for your business. Following this is the task of setting goals to create the ladder to reach your vision.  </p>  <p style=\"\">  \t   In this practical module you will create a 3 year roadmap and set goals for all areas of your life including your business.You will be guided with, video, audio, worksheets and various podcasts and articles. All of my clients have successfully worked through their vision and goals with extraordinary results.  </p>  <p style=\"\">  \t   So join me as we do the same for you and take you on a journey that will ruin you for the ordinary.  </p>  <p style=\"\">  \t<strong style=\"\">The Process</strong>  </p>  <p style=\"\">  \tIn each section of the module you will watch a video and then be guided through the audio worksheets.  </p>  <p style=\"\">  \t<strong style=\"\">Introduction</strong>  </p>  <p style=\"\">  \tThis is an overview of what the full course is all about. It explains the 7 keys elements entrepreneurs need to master in order to be successful.  </p>  <p style=\"\">  \t<strong style=\"\">Vision</strong>  </p>  <p style=\"\">  \tHere we take your through the process of creating a compelling vision in seven key areas of your life such as business, finance, family, personal development etc. Again there is a video to watch that explains the process followed by guided audio worksheets. These worksheets are downloadable from the sidebar in each section.  </p>  <p style=\"\">  \t<strong style=\"\">Goals</strong>  </p>  <p style=\"\">  \tOnce you have established the compelling vision you want to achieve, we will help you translate it into simple measurable goals. These are recorded on downloadable goalsheets in order track them . Here are 5 key elements that need to be in place with goals in order for the brain to engage them:  </p>  <p style=\"\">  \t<strong style=\"\">1. Think  it through</strong>  </p>  <p style=\"\">  \t<strong style=\"\">2. Write it down.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">3. It must be specific.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">4. It must be time-based.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">5. You must speak it out.</strong>  </p>  <p style=\"\">  \tThis module forms  part of a 7 module series that are being released on a regular basis.  </p>  <p style=\"\">  \tSo join me as we do the same for you and take you on a journey that will ruin you for the ordinary.  </p>", 
    "end_date": null, 
    "title": "Creating a Compelling Vision & Setting Achievable Goals", 
    "price": "20.00", 
    "instructors": "Murray  Kilgour", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74476_5611_5.jpg", 
    "course_url": "https://www.udemy.com/7-keys-for-entrepreneurs-goals-and-vision/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T12:50:14Z"
}