{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Culture is not so easily defined. We think about culture as the mix of ingredients to get a recipe right. How to make team decisions with Learoy Tonight will provide you with the skills and knowledge to understand what drives culture and what you can do to create and foster the one that's right for you.</p><p>As a leader, aren't you sick of being the one making all the decisions? Well, there's a clear reason why this is still happening and it's staring you right in the face every time you look in the mirror.</p><p>Collaborating with your team to make decisions comes with many rewards. Not only does it drive motivation through a sense of empowerment and ownership, it also builds team cohesion, drives innovation, oh, and did I mention relieves personal burdens as well?</p><p>Each lecture in this course has been carefully selected for you to explore how to implement relevant and meaningful strategies to support you as a leader and culture driver now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support the environment you're trying to create.</p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be.</p><p>This course will take you approximately 30 to 45 minutes to complete and will cover ways you can make effective decisions. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your journey to a strong team culture. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our Culture: In the Mix journey. If you would like to really challenge yourself, join us for the entire culture building experience.</p>What are you waiting for? Start tonight, be on your way to amazing culture tomorrow.", 
    "end_date": null, 
    "title": "Culture | How to Make Team Decisions", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585072_48a6.jpg", 
    "course_url": "https://www.udemy.com/culture-how-to-make-team-decisions/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T06:32:51Z"
}