{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Culture is not so easily defined. We think about culture as the mix of ingredients to get a recipe right. How to build collaborative, performance focused teams with Learoy Tonight will provide you with the skills and knowledge to understand what drives culture and what you can do to create and foster the one that's right for you.</p><p>Building trust and ultimately collaboration leads to real support for each other. A factor that's so important as any business strives to achieve the goals of individuals and teams within it.</p><p>One of the most critical jobs you have as a leader, is to set your team up, with a clear understanding of what good looks like, by defining goals and forming a great plan. </p><p>A good culture is one that allows everyone to support the others playing to strength, where it's 'we're all in this together' not 'every man for himself'. A plan helps us give purpose to get there.</p><p>Each lecture in this course has been carefully selected for you to explore how to implement relevant and meaningful strategies to support you as a leader and culture driver now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support the environment you're trying to create.</p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be.</p><p>This course will take you approximately 30 to 45 minutes to complete and will cover all of the things you need to build collaborative, performance focused teams. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your journey to a strong team culture. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our Culture: In the Mix journey. If you would like to really challenge yourself, join us for the entire culture building experience.</p><p>What are you waiting for? Start tonight, be on your way to amazing culture tomorrow.</p>", 
    "end_date": null, 
    "title": "Culture | How to Build Collaborative and Focused Teams", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582772_cfa5.jpg", 
    "course_url": "https://www.udemy.com/culture-how-to-build-collaborative-and-focused-teams/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T06:14:40Z"
}