{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Culture is not so easily defined. We think about culture as the mix of ingredients to get a recipe right. How to be a great coach with Learoy Tonight will provide you with the skills and knowledge to understand what drives culture and what you can do to create and foster the one that's right for you.</p><p style=\"\">Culture needs to be constantly supported and massaged to ensure it stays on the right path. Just like adding a little extra spice or giving the pot a little more time to simmer before serving, the extra work you put into your mix can make all the difference.</p><p style=\"\">Coaching and giving feedback are two tools that you can use to maintain and drive your culture. It's all about driving high performance. Sometimes this means improving their technique, and at other times, it means motivating them to keep their head in the game. While it's all about them – their success becomes yours too, as you work together to elevate them to levels they didn't even know they had in them.</p><p style=\"\">Each lecture in this course has been carefully selected for you to explore how to implement relevant and meaningful strategies to support you as a leader and culture driver now and in the future.</p><p style=\"\">This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support the environment you're trying to create.</p><p style=\"\">Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be.</p><p style=\"\">This course will take you approximately 30 to 45 minutes to complete and will cover various methods and approaches to coaching and providing your team feedback. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your journey to a strong team culture. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p style=\"\">This course is a small section of our Culture: In the Mix journey. If you would like to really challenge yourself, join us for the entire culture building experience.</p><p style=\"\">What are you waiting for? Start tonight, be on your way to amazing culture tomorrow.</p>", 
    "end_date": null, 
    "title": "Culture | How to be a Great Coach", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585064_c331.jpg", 
    "course_url": "https://www.udemy.com/culture-how-to-be-a-great-coach/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T06:11:16Z"
}