{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>There is no question about the impact great customer service has on an organisation. How to develop customer metrics will give you the tools to make a connection and build a relationship with your customer base. Today we may be providing a service, tomorrow we may be a receiving one; it is the beauty of this that makes good customer service a truly human endeavour.</p>  <p>‘But I’ve told my people how important good customer service is, and they’re still not providing it!’ Have a look at how you’re measuring your people. To inspire good customer service behaviour, we must be able to measure customer experiences meaningfully. This course will give you the tools needed to choose effective customer metrics, measure appropriately and integrate them into staff KPI’s – to drive the behaviours you want.</p>  <p>Each lecture has been carefully selected so that you can explore relevant and meaningful strategies to create a truly customer centric workplace. Build a culture that values the importance of each customer interaction and empowers employees to provide the best service possible. This course is full of tips and tricks to use inside and out of your workplace. It will motivate you to really understand and support the environment you’re trying to create.</p>  <p>Learoy Tonight is a fresh business with interesting and modern ideas about education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We’re excited about education and want to give you the opportunity to be the best you can be.</p>  <p>Each course will take you approximately 30 to 45 minutes to complete and will cover all of the components required to develop good customer metrics. Our content will give you the opportunity to listen to experts and understand relevant models to use on your leadership journey when creating a truly human customer experience. Enjoy a collection of videos, interviews and engaging imagery used throughout our presentations.</p>  <p>This course is a small section of Customer – At Your Service. If you would like to really challenge yourself, join us for the entire journey.</p>  What are you waiting for? Start tonight and be on your way to providing amazing customer service tomorrow.", 
    "end_date": null, 
    "title": "Customer | How to Develop Customer Centric Metrics ", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640944_55a0.jpg", 
    "course_url": "https://www.udemy.com/customer-how-to-develop-customer-centric-metrics/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T02:19:06Z"
}