{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Entsprechen Ihre Webseite oder Ihre angebotenen Online-Dienste den Anforderungen des deutschen Datenschutzes?</p><p>Vermittelt Ihre Internetpräsenz oder Ihr Onlinedienst, dass die persönlichen Daten Ihrer Kunden und Interessenten bei Ihnen gut aufgehoben sind?</p><p><strong><br></strong></p><p><strong>Eine Datenschutzerklärung auf Ihrer Webseite ist genauso Pflicht wie das Impressum und trotzdem gibt es zahlreiche Onlineauftritte, die die Anforderungen des Datenschutzes nicht umgesetzt haben!!!</strong></p><p><br></p><p>In diesem Kurs erfahren Sie die Anforderungen des Datenschutzes an Ihre Onlinedienste und Sie erfahren, was Sie tun müssen, um den Datenschutz bei Ihnen zu optimieren und das Vertrauen Ihrer Besucher in Sie dadurch zu erhöhen. </p><ul><li>Wie muss eine Datenschutzerklärung eingebunden werden, welche Inhalte muss Sie haben?</li><li>Wenn Sie zusätzliche Funktionen oder Plugins nutzen, wie z.B. Formulare oder Analysetools, wird erläutert, was diesbezüglich zum Datenschutz beachtet werden muss.</li><li>Vernetzen Sie Ihre Webseite mit sozialen Medien, müssen Sie ebenfalls Datenschutzanforderungen beachten, die im Kurs erläutert werden.</li><li>Sie versenden Newsletter? Auch hierzu werden wichtige Punkte im Kurs behandelt.</li><li>Welche Anforderungen das Gesetz an den Umgang mit den erhobenen Daten an Sie hat, erfahren Sie ebenfalls in diesem Kurs.</li><li>Abschließend erhalten Sie nach der Zusammenfassung eine Checkliste, mit der Sie den Datenschutz bei Ihren Diensten überprüfen können. </li></ul><p><br></p><p>Um effizient die die Inhalte des Kurses gleich in der Praxis umsetzen zu können, finden Sie viele zusätzliche Unterlagen mit Vorlagen und Verweisen zu Vorlagen, die Sie auf Ihrer Webseite einbinden können. </p><p><br></p><p>Bevor der Kurs mit den Praxis-Lektionen startet, erfahren Sie in einem kurzen Abschnitt die wichtigsten Informationen zum Datenschutz und zum Datenschutzgesetz.</p><p><br></p><p><strong>Optimieren Sie den Schutz der persönlichen Informationen und erhöhen Sie das Vertrauen Ihrer Besucher und Kunden</strong><strong> in Ihren Onlinedienst!</strong></p>", 
    "end_date": null, 
    "title": "Datenschutz-Praxis für Webseiten und Onlinedienste", 
    "price": "25.00", 
    "instructors": "Regina Stoiber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721236_e979.jpg", 
    "course_url": "https://www.udemy.com/datenschutz-praxis-fur-webseiten-und-onlinedienste/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T21:44:20Z"
}