{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>How effective are you at processing information from your environment and using emotion to drive your decision making?</em></p><p><em>How rational and objective are you in solving problems?</em></p>  <p>From the decision to rise in the morning to the decision go to bed at night, you are constantly solving problems and making decisions.  Throughout each day you are confronted with a variety of <strong>problems and decisions </strong>that require a <strong>rational</strong>, <strong>thoughtful response</strong> underpinned with good<strong> emotional awarenes</strong><strong>s</strong>.</p>  <p>This course is about <strong>proactively working towards solutions </strong>that help you to <strong>make timely decisions</strong> as you solve work problems to bring value to your company and your customers. In addition, the skills, processes and tools taught in this course can bring value to other aspects of your life.</p>  <p><strong>Good decision making </strong>means that you can grasp problems and mindfully devise effective solutions. It means that you can <strong>deal realistically with situations</strong> as they arise and <strong>manage emotions and impulses</strong> that may disrupt effective decision making.</p>  <p>Both <strong>creativity</strong> and <strong>mindfulness</strong> form a basic part of <strong>solving problems </strong>along with <strong>intuition</strong>. Intuition is a decision making process that is often overlooked in business. Applied in a mindful way, and used well, it can add richness and speed to developing realistic solutions to problems. </p><p>The course is based around the <strong>Decision Making</strong> component of Reuven Bar-On's comprehensive assessment of emotional intelligence.  You do not need any knowledge of this model or about emotional intelligence to take the course.  <em>(It is important for me to stress that I have no commercial affiliation with Reuvon Bar-on and the EQ-i 2.0 assessment.)</em></p>  <p>This course is a standalone course for anyone interested in understanding how to solve problems and make good quality decisions more effectively.  It forms part of a comprehensive course that explores <strong>emotional intelligence</strong> in more depth.</p>  <p>The course covers the ways to stimulate creativity and looks in detail at the fashionable business technique of mindfulness.  Within this course, mindfulness is applied to decision making.</p>    <p>You'll receive all the information that you need and will be <strong>coached</strong> using<strong> loads of practical hints</strong> that you can use straight away.</p>    <p>The course is made up of a series of lectures and contains a comprehensive workbook. There are a series of interactive exercises that involve some activity with other people and some reflection.</p>    <p>The course material makes up a one to two day workshop so is equivalent to 8 -12 hour's training. It forms part of our <strong>advanced emotional intelligence course</strong> endorsed by the <strong>Institute of Leadership and Management</strong>.</p>    <p>Please note that all programmes are continually refined and updated to ensure they remain current and relevant.</p>", 
    "end_date": null, 
    "title": "Decision Making: Solve Problems with Emotional Intelligence", 
    "price": "30.00", 
    "instructors": "Robin Hills", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684890_35b1_3.jpg", 
    "course_url": "https://www.udemy.com/effective-problem-solving-and-decision-making/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T11:34:47Z"
}