{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>***JANUARY 2016 UPDATED. COMPLETE COURSE. GRAB NOW AT THE LOW SALE PRICE AND OWN FOREVER***</strong></p><p><strong></strong><strong>Delegation is a key skill for anyone who wants to be more productive and make fast progress on their professional and personal goals.</strong> Critical for managers and entrepreneurs but it is also absolutely necessary for anyone in today's global economy.</p><p>Unfortunately, many people are hesitant to delegate routine tasks because they have had a bad experience in the past or feel “If I want it done right I have to do it myself\" or other obstacles that have hindered them.</p><p>“People and organizations don't grow much without delegation.\" <strong><em>-Steven Covey</em></strong></p><p><strong>THIS COURSE WILL TEACH YOU HOW TO BECOME GREAT AT DELEGATION SO YOU CAN LEVERAGE THE TALENTS OF OTHERS, BE MORE PRODUCTIVE, AND HIT YOUR GOALS!</strong></p><p><strong>You will learn:</strong></p><ul><li>All the key steps to effective delegation that will ensure when you delegate things will go smoothly. Perfect execution everytime.</li> <li>Various levels of delegation so you can match the right person to the right task.</li> <li>Specifically how to delegate to various stakeholders such as subordinates, peers, team members, vendors/partners, virtual assistants…and even your boss!</li></ul><p>Learning to be great at delegation changed your instructor's life and set him up for success and it can for you as well. I was a very hard working but failing young manager and learning how to properly delegate helped me quickly become a superstar who earned maximum bonuses and was rapidly promoted. </p><p>No matter if you are a manager, entrepreneur, or an individual contributor I want to share with you these important and practical real life techniques and best practices that can help you as well. </p><p><strong>Get even more:</strong></p><ul><li>Lifetime access to the course so you get updates and new bonus lessons for FREE. </li> <li>Ask questions and <strong>I will answer them for you</strong>. Very focused on this to personalize learning. </li> <li>Udemy 30-day no questions asked refund guarantee. I want you to love the course or simply return it.</li></ul><p><strong>SUCCESS DEPENDS ON FOCUSING ON WHAT'S MOST IMPORTANT AND DELEGATING THE REST. </strong></p><p>No risk to sign up and impact could be life-changing. Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. Don't delay. </p><p><strong>Click the TAKE THIS COURSE button</strong> in the upper right corner and let's get started.</p><p>Many thanks and I appreciate your interest and hope to see you in the course! </p><p>-Steve Ballinger</p>", 
    "end_date": null, 
    "title": "Delegation Mastery: Increase Productivity & Hit Your Goals!", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487670_6bb1_3.jpg", 
    "course_url": "https://www.udemy.com/delegation-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T16:35:16Z"
}