{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Making sense of who you are in the world involves <strong>a good level of self-awareness</strong>; <strong>knowing your value</strong>s and how <strong>your strengths and weaknesses </strong>can support you or limit you in your life.</p><p>How you manage yourself - <strong>your thoughts and your feelings</strong> - depends \nupon how you well you understand your emotions, how control them and how use them as you make you way through life.</p><p>It is one of the ways that you use your \n<strong>emotional intelligence</strong>.  The course covers the awareness part of how you manage your inner world of being.  <br></p><p>This course is a stand \nalone course for anyone interested in understanding themselves better \nand determining their core purpose, vocation or destiny in life.  It forms part of a\n comprehensive course that explores emotional intelligence in more \ndepth.  </p><p>Emotions are not about being soft and fluffy, they are \nvital in help you to make hard, direct management decisions. Managing \nyour emotions well can mean managing your life with \nmore influence and impact.  <br></p><p>In this course, we will explore \nthe way that you <strong>manage your emotions</strong> and how this drives <strong>your \nself-confidence</strong>, <strong>your beliefs</strong> about yourself, and how you work with <strong>your life goals</strong>.  You will also be taken through an understanding of <strong>your behavioral preferences </strong>to determine <strong>your personality type</strong>.  This will give you more self-awareness, a better understanding of yourself and others and will help you to make sense of who you are in tge world.</p><p>You'll receive all the information that you need and will be <strong>coached</strong> \nusing <strong>loads of practical hints</strong> that you can use straight away.</p><p>The\n course is made up of a series of lectures and contains a comprehensive \nworkbook. There are a series of interactive exercises that involve some \nactivity with other people and some reflection.</p><p>The course material makes up a one to two day workshop so is equivalent to 8 -12 hour's training.  It forms part of our <strong>advanced emotional intelligence course </strong>endorsed by the <strong>Institute of Leadership and Management</strong>.</p><p>Please note that all programmes are continually refined and updated to ensure they remain current and relevant.<br></p>", 
    "end_date": null, 
    "title": "Develop your Self Awareness with Emotional Intelligence", 
    "price": "30.00", 
    "instructors": "Robin Hills", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620616_857d.jpg", 
    "course_url": "https://www.udemy.com/making-sense-of-who-you-are-in-the-world/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T19:40:46Z"
}