{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este es el primer curso en español de Gestión y Dirección de Producto. Aprenderás las habilidades esenciales para dirigir el proceso de producto, desde la ideación, investigación de mercado, wireframing, prototipado y creación de historias de usuario usando métodos ágiles. Hemos creado este curso en colaboración con Charles Du de fácil entendimiento para personas que se embarcan en la aventura de la Dirección de Producto.</p>\n\n<p>Adicionalmente de perfeccionar estas habilidades, también podrás llevar a la práctica activamente al aplicación de herramientas que facilitan la dirección de producto como Popplet, Axure y Pivotal Tracker. Tendrás oportunidad de desarrollar y construir una de tus ideas de producto a través de 10 ejercicios explicativos paso a paso con material complementario y plantillas preparadas para ti. Al final del curso, tendrás las especificaciones de un producto escritas en un backlog de funcionalidades, wireframes y hasta un prototipo interactivo.</p>\n\n\n\n\n\n<p>Te has preguntado, ¿cómo las grandes compañías: Apple, Nasa, Telefónica, Ticketmaster diseñan sus productos? Luego de tomar este curso lo descubrirás. Recibirás el conocimiento condensado de más de 12 años de experiencia profesional en la Dirección de Producto, de veteranos que hemos manejado un buen número de equipos de prestigiosas organizaciones y que hemos lanzado decenas de productos usadas por millones de usuarios diariamente. Te mostraremos todo con ejemplos reales de los productos más exitosos en los que hemos trabajado.</p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Dirección de Producto usando Metodología Ágil", 
    "price": "35.00", 
    "instructors": "Charles Du, Laura Eguren, Marivi Briz", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794892_5073.jpg", 
    "course_url": "https://www.udemy.com/direccion-de-producto-usando-metodologia-agil/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T16:54:41Z"
}