{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to <strong style=\"\">Effectively Managing Employee Performance</strong> from LearnSmart.</p><p style=\"\">LearnSmart is <strong style=\"\">Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the <strong style=\"\">Professional Development Unit (PDU) </strong>requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p style=\"\">If you&#039;re interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong style=\"\">4.00 PDU </strong>credit hours toward your PMP® certification from PMI.</p><p style=\"\"><strong style=\"\">Course Overview</strong>:</p><p style=\"\">Through this course you&#039;ll concentrate on how to successfully and effectively manage employee performance by learning about ways to identify and prevent performance problems and causes, positive ways to deliver feedback and counseling and disciplining problem performance. </p><p style=\"\"><strong style=\"\">Course Breakdown</strong>:</p><p style=\"\"><strong style=\"\">Section 1</strong>: In the pre-assessment quiz you&#039;ll face questions from all sections of this project management training. Test your current knowledge and know your strengths and weaknesses.</p><p style=\"\"><strong style=\"\">Section 2</strong>: The most effective method for managing performance problems is preventing them As a manager,  take a closer look at the dynamics of the employee-manager relationship, and gain insight on different ways to avoid performance problems in your staff. It&#039;s important that you have the knowledge and tools used to prevent performance problems. </p><p style=\"\"><strong style=\"\">Section 3</strong>: Regardless of how effective you are in establishing practices that prevent performance problems, you will at some point run into performance problems. Learn about the different types of performance problems and their causes and the best way to respond to them. Discover the difference between conduct problems and performance problems and explore the role that personality plays in performance problems. You&#039;ll be able to tackle performance problems head on using the knowledge accumulated here.</p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">Section 4</strong>: Counseling can be used to get to the root of why employees are unable to meet performance expectations. The most important tool a supervisor can use in addressing performance problems is feedback and counseling. Another tool that will assist you is a Performance Improvement Plan. Learn how to use these tools to effectively address performance problems and improve workplace performance. Hone your managerial, supervisory, coaching, and teaching techniques. </p><p style=\"\"><strong style=\"\">Section 5</strong>: Understand the impact of mishandling discipline, particularly the implications it has on the employee-manager relationship. After taking disciplinary action, there are additional options to consider as manager including termination, discipline without punishment, and performance change.</p><p style=\"\"><strong style=\"\">Section 6</strong>: As a short Final Exam, these questions ties all the above sections in a quick review of key concepts.</p><p style=\"\"><strong style=\"\">Recommendations</strong>:</p><p style=\"\">Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul style=\"\"><li style=\"\"><em style=\"\">Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li style=\"\"><em style=\"\">This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept. The instructor is highly engaging and highly motivating. Can&#039;t be better. Thank you -- Saber Tlili</em></li><li style=\"\"><em style=\"\">Excellent class! -- I already have my PMP, but wish I had this class as a study tool prior to taking the test. I am confident that a person who studies the materials presented in this course should have no problem with the exam. I took the class for the PDUs to keep my certification up. On completion of the class I followed the instructions, and had no problem registering the credits with PMI -- Robert Vroom</em></li></ul>", 
    "end_date": null, 
    "title": "Effectively Managing Employee Performance", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437860_dbe5_5.jpg", 
    "course_url": "https://www.udemy.com/effectively-managing-employee-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T19:43:17Z"
}