{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to<strong> </strong><strong>Effectively Disciplining Problem Performance</strong> from LearnSmart.</p><p>LearnSmart is <strong>Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the <strong>Professional Development Unit (PDU) </strong>requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p>If you're interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong>1.5</strong><strong>0 PDU</strong> credit hours toward your PMP® certification from PMI.</p><p><strong>Course Overview:</strong></p><p><strong></strong>You will spend studying the elements of an effective disciplinary policy, the role of warnings, and steps taken to formally discipline an employee. You’ll also look at the impact of mishandling discipline, particularly the implications it has on the employee-manager relationship. After taking disciplinary action, there are additional options to consider as manager including termination, Discipline Without Punishment, and performance change.</p><ul><li>Resolve Issues Through Disciplinary Policy</li></ul><p><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the materials are interesting and creative specially the flashcards and the exercises -- I.A</em></li><li><em>I want to be a leader!!!I thought leadership is a hereditary thing. It should be streaming along with your ancestry blood. But wait! I am wrong. This course taught me to learn how to be a leader. It is not hereditary. It is a skill that everybody should learn. Leader initiates good changes, so managing the people is vital to be an effective leader. Thanks for LearnSmart LLC. Very clear explanation, easy to understand, delivered in very slow and deliberate manner. I love LearnSmart LLC!!! More Power and Success!!! -- M.A.</em></li><li><em>A Complete Jumpstart - What has impressed me the most is the depth of the content to this coarse. Each HD video is crystal clear in both the visual and audio, even including quality closed captioning (great for reading along with the lectures). I wasn't interested in the flashcards or the crossword puzzles when I started the program, but I've found them to be very useful in staying engaged in the class when away from home. This is everything you need to get started and have a classroom quality experience from home. Dive in and stay focused! -- P.C.</em></li></ul>", 
    "end_date": null, 
    "title": "Effectively Disciplining Problem Performance", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333102_af57_3.jpg", 
    "course_url": "https://www.udemy.com/effectively-disciplining-problem-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T23:48:19Z"
}