{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>UPDATE 11/7/2015: Another Bonus material posted! - Flashfill! Check out the new Bonus section.</p><p>UPDATE 6/13/2015: Bonus material posted! - Online survey/event sign-up/quiz made easy with Excel online! Check out the new Bonus section.</p><p>UPDATE 5/20/2015: Lecture 1 and 2 combined, and video updated.</p><p>UPDATE 4/16/2015: Lecture 8 video updated.</p><p>---------------</p><p>Have you ever received an Excel spreadsheet from your colleagues and wondered: What on earth is this doing?</p>  <p>  \t  Have you ever wondered if you should re-finance your mortgage or car loan but do not know how much money you can save?  </p>  <p>  \t  Have you ever thought about keeping tracking your stock portfolio by building an Excel spreadsheet?  </p>  <p>  \t  Hi, I am Professor Justin Ren.  I have taught thousands of students over the years, and I have consulted Fortune 500 companies as well as small start-ups.  Two things continues to amazes me to this day:  </p>  <p>  \t  (1) How prevalent Excel is in the workplace.  In fact, many of the biggest corporations in the world run many of the most important strategic analysis and decisions based on Excel spreadsheets.  The same is true for small businesses. Or even in managing our own daily lives.  In my humble opinion, Excel is here to stay despite the fact that there are more and more alternative spreadsheets programs.   Excel remains the indisputable go-to choice for serious spreadsheet modelers.  </p>  <p>  \t  (2) How common it is for people to use Excel improperly or 'dangerously'.  Let me give you an example.  In my consulting and teaching career over the years, I have seen too many instances where people do 'copy and paste' in a rather haphazard manner: ignoring formula when they should be kept, or keeping formula in when they should be thrown away.  The consequence of such bad practices can sometimes be devastating: Do you know that bad Excel practices played a role in the 2009 financial crisis (Just google “London whale Excel\")?  It is those mispractices that motivated me to write a training course to teach how to do Excel analytics in a safe and proper way.  </p>  <p>  \t  This introductory series is designed for readers who are interested in building business analytics skills and applying them into business situations such as:  </p>  <p>  \t  ● Meeting budgets,  </p>  <p>  \t  ● Predicting demand,  </p>  <p>  \t  ● Selecting mortgages,  </p>  <p>  \t  ● Managing cash flows,  </p>  <p>  \t  ● Picking stock portfolios,  </p>  <p>  \t  ● Identifying trends and patterns,  </p>  <p>  \t  ● Making purchase decisions to minimize cost…  </p>  <p>  \t  When it comes to analytics with Excel, my view is that there is a set of essential skills to be acquired.  Such skills include:  </p>  <p>  \t  ● Finding information efficiently;  </p>  <p>  \t  ● Using commonly used math, statistical, and financial functions;  </p>  <p>  \t  ● Building a correct and clear model to analyze a problem;  </p>  <p>  \t  ● Scenario analysis to make decision under uncertainty;  </p>  <p>  \t  ● Summarizing information (e.g., with pivot tables);  </p>  <p>  \t  ● Finding patterns among data;  </p>  <p>  \t  ●Simulation and analyzing risks;  </p>  <p>  \t  ● Optimization for better decision making.  </p>  <p>  \t  Those skill sets are taught through an extensive set of examples in this series. There are seven modules in this course:  </p>  <p>  \t  1: Basic Skills  </p>  <p>  \t  2. Model Building  </p>  <p>  \t  3. Power Analytics with Data Tables and Pivot Tables  </p>  <p>  \t  4. Visualizing data  </p>  <p>  \t  5. Pattern Finding, Curve Fitting, and Regression  </p>  <p>  \t  6. Problem Solving and Optimization  </p>  <p>  \t  7. Simulation  </p>  <p>  \t  Each section will be taught with real-life examples. There are videos to watch, files to download, and problems to practice.  </p>  <p>  \t  I trust you will enjoy this learning journey.  It is my goal that by taking this course, you will become a better business person, a better manager, and a better decision maker.  </p>", 
    "end_date": null, 
    "title": "Excel for Business Professionals and Managers", 
    "price": "20.00", 
    "instructors": "Justin Ren", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436624_2b71_3.jpg", 
    "course_url": "https://www.udemy.com/microsoft-excel-course/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T15:50:50Z"
}