{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>You have reached a point in your career where you feel that a transition is inevitable, a transition that will move you from being a manager to the realms of leadership. If you feel that you are ready then this course is for you. Discover how to acquire larger “drawing canvas\" - see the bigger picture and lead your teams towards success. This course will enhance your ability to shun doubts and dogma and allow you work on core areas that not only qualify you as a leader but also help you manage organizations and people, and drive profitability better.</p><p>Whether you are a professional, businessman, student, or an entrepreneur - managing just a few people or a large team, you can utilise the insights of this course to gain and practice the mindset that produces effective leadership and result orientation.</p><p><strong>By end of this course you will be able to –</strong></p><li>Take your management skills to the next level!</li><li>Understand how you impact common perception and outcomes in an organization</li><li> Learn what successful leaders do and don't</li><li> Empower yourself and establish yourself as a leader</li><li> Exploit current research and accepted wisdom to enhance your leadership style</li><li> Use practical insights to be an effective communicator</li><li> Manage time better and be more productive  </li><p><strong>As a bonus,</strong> the course includes optional exercises that let you reaffirm and ingrain the learning better through practise or by receiving or getting feedback from your peers by uploading the assignments to the discussion board. <strong>Sign up for this course and bridge the gap to your leadership development today!</strong></p>", 
    "end_date": null, 
    "title": "From Manager To Leader: Simplified Leadership For Success", 
    "price": "25.00", 
    "instructors": "Global Finance School", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/443492_2452.jpg", 
    "course_url": "https://www.udemy.com/gfsleadership/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T07:44:41Z"
}