{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will prepare you for the Project Management Professional (PMP速) exam and help you obtain the most recognized project management certification worldwide. You will be provided with all the necessary information to pass the test while covering all 10 knowledge areas in the PMBOK速 Guide. Furthermore, each of the 47 processes are assigned to their respective domain task.<br><br>The lectures include all inputs, tools, techniques, and outputs, presented in an understandable manner, as well as useful exam advices and a comprehensive study guide.<br><br>By completion of the course you will have gained essential knowledge on:<br>- The 10 knowledge areas and 47 processes included in the PMBOK速 Guide<br>- The 42 domain tasks and the associated skills included in the PMP速 Examination Content Outline<br>- How to successfully study for the exam as well as practical exam taking techniques</p><p>You will get 87 contact hours (87 PDU's) which exceeds the minimum of 35 PDU's required to take the exam:</p><ul><li>Video-Lectures: 13h</li><li>Review Questions: 14h</li><li>PMP exam Study Guide book: 30h</li><li>PMP exam prep questions book: 30h</li></ul><p>Total contact hours: 87h</p><p>In order to get the most out of the course you should be a practicing project manager with at least 3 years of experience. This is a fantastic opportunity to attest your own work experience and take a big step forward in your career.</p>", 
    "end_date": null, 
    "title": "Full PMP Preparation Package: Master your Examination!", 
    "price": "50.00", 
    "instructors": "Lecturio GmbH", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/665796_8f3f_3.jpg", 
    "course_url": "https://www.udemy.com/pmp-training-lecturio/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-10T12:55:28Z"
}