{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Este curso está direcionado para quem está interessado:</strong></p>\n\n<p>·         Entender o processo comunicacional e identificar suas principais barreiras;\n\n  </p>\n\n<p>·         Identificar o impacto das dimensões da interação humana no processo de\n\n  </p>\n\n<p>            convivência e de alcance de resultados em conjunto;\n\n  </p>\n\n<p>·         Adquirir ferramentas para lidar com as questões relativas às diferenças individuais;\n\n  </p>\n\n<p>·         Entender o porquê os projetos tendem à fracassos devido a falta de Comunicação.  \n\n  </p>\n\n<p>Saber se comunicar é hoje em dia um das principais competências necessárias para um profissional, no caso, o gestor de projetos independente do perfil é fundamental ter essa característica. Saber se comunicar e relacionar-se bem, em qualquer contexto é atualmente indispensável. \n\n  </p>\n\n<p>Uma boa gestão da comunicação pode determinar o sucesso ou o fracasso de um projeto.\n\n  </p>\n\n<p>A capacidade de liderar a equipe, manter os gestores informados entre inúmeras outras funções são diretamente ligadas à comunicação.\n\n  </p>\n\n<p>Apresentações em público, motivação de equipes, liderança, reuniões, contatos com clientes, vendas, entrevistas, negociações, palestras e networking são algumas das funções de um gestor que envolve a comunicação.\n\n  </p>\n\n<p>A comunicação certamente é uma das áreas de conhecimento mais importantes para o gerente de projeto, senão for a mais importante. Ela representa cerca de 90% do tempo do gerente de projeto e é o elo de ligação entre as pessoas, as ideias e as informações.\n\n Além disso, a maioria dos problemas dos projetos são oriundos de falha de comunicação e existe uma forte correlação entre o desempenho do projeto e a habilidade do gerente de projeto em administrar as comunicações.\n\n  </p>\n\n\n\n<p>O curso será com material aula (PPT) e exercícios tanto no final de cada aula, como alguns que serão disponibilizados para discutirmos na aula seguinte.</p>", 
    "end_date": null, 
    "title": "Gerenciamento das Comunicações", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/865766_3c9d.jpg", 
    "course_url": "https://www.udemy.com/estacio-gerenciamento-das-comunicacoes/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T13:59:29Z"
}