{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Vire um líder…</p><p>Todo profissional que sonha em destacar no mercado, subir na carreira, gerenciar uma equipe, se tornar um líder, precisa pensar como um empresário, mas te pergunto, basta vender muito, ter muitos resultados para se tornar um líder? Claro que não! Primeiro você tem que entender que existe uma grande diferença entre um funcionário uma posição de liderança, um é ativo, o outro é proativo!  <strong>Uma habilidade do sucesso: a proatividade, ou seja, FAZER ACONTECER.</strong></p><p>O mercado hoje, em todos os segmentos, ficam cada dia mais complexos e ao entender o funcionamento do mercado, fica mais fácil vender, porque você aprende a como oferecer a melhor solução para o problema do cliente. Entender também não é o suficiente, é preciso também inovar, aprender a vender cada dia mais e melhor, este é o objetivo de todo profissional.<strong> Este curso vai te ensinar todos estes passos, do começo ao fim, vai te ajudar a ter argumentos melhores e técnicas para multiplicar suas vendas. Um curso de inovação em vendas.</strong></p><p>O sucesso só depende de você e não de terceiros, como aceita a maioria. Isso mesmo, aprenda a fugir do senso comum, a construir e escrever a sua própria história.<em>Crie um roteiro de vitórias, em que você ganha ajudando os outros a encontrar o melhor serviço, que você ganha quando o outro ganha.</em> Uma vida baseada na prosperidade, na generosidade, onde o seu sucesso alavanca o sucesso de várias pessoas a sua volta. Para que os outros ganhem mais para você ganhar mais.</p><p>Todos passamos por altos e baixos, a vida é uma montanha russa, mas que seja em uma pista sempre subindo em direção ao céu. Sim, <strong>você precisa aprender a lidar com riscos, com adversidades, para se tornar um LÍDER</strong>, todos temos problemas, mas o segredo do sucesso é como lidamos com eles. Seja um homem/mulher mais forte a cada dia, que vê em cada derrota um aprendizado, uma superação. <strong>O único fracasso da vida é desistir!</strong> Nestes altos e baixos que todos os seres humanos precisam passar pelo simples fato de estar vivo, são na verdade um aprendizado para que você seja cada dia melhor. Eu acredito nisso e foi baseado nesta crença que a minha vida deu grandes passos, pois agora sou um homem melhor a cada dia. <em>Deixa eu te mostrar o caminho, se eu fui capaz, você também é!</em></p>", 
    "end_date": null, 
    "title": "Gestão", 
    "price": "50.00", 
    "instructors": "Roberto Pantoja", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/734242_be6e_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-lideranca-gerencia/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-19T15:42:43Z"
}