{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>O Curso Gestão de Equipes aborda aspectos fundamentais para criar equipes de alta performance.</p>\n\n<p>No contexto de alta competitividade e marcado por constantes mudanças e desafios, torna-se essencial o foco na Gestão de Pessoas. \n\n  </p>\n\n<p>Selecionar, desenvolver e reter talentos são elementos que impactam em criar organizações que aprendem, que mantém o seu diferencial competitivo, que mudam e se reinventam através de processos contínuos de criatividade e inovação.\n\n  </p>\n\n<p>No processo de evolução das empresas, a gestão de equipes deixa de ser responsabilidade exclusiva da estrutura de Recursos Humanos, evoluindo para que líderes assumam o compromisso de atrair e reter talentos.\n\n  </p>\n\n<p>Os colaboradores, por sua vez, se responsabilizam por sua carreira profissional, focam em sua evolução e compartilha com as organizações a responsabilidade pelo seu desenvolvimento profissional.\n\n  </p>\n\n<p>Este cenário impõe às organizações, aos líderes e aos colaboradores repensar os conhecimentos, habilidades e atitudes necessárias para criar equipes de alta performance.\n\n  </p>\n\n<p>O Curso Gestão de Equipes está alinhado à esta nova demanda de mercado. Trazendo um programa que aborda a Gestão de Equipes em diferentes ângulos, compartilhando o seu sucesso com as atribuições dos atores deste processo: o próprio indivíduo, as equipes, os líderes.\n\n  </p>\n\n<p>O curso também aborda que, para criar equipes de alta performance, tornar-se essencial a coordenação dos processos organizacionais relacionados a Gestão de Pessoas, tais como: seleção, treinamento e desenvolvimento, motivação e clima organizacional, avaliação de desempenho e desenvolvimento, etc.\n\n  </p>\n\n\n\n<p>O curso pode ser realizado em 4 horas. Não se pretende esgotar o tema de Gestão de Pessoas, mas convidá-los para aprofundar os estudos deste encantador e desafiador conteúdo relacionado a equipes, liderança, pessoas e organizações.</p>", 
    "end_date": null, 
    "title": "Gestão de Equipes", 
    "price": "20.00", 
    "instructors": "Universidade Estácio", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872270_da9b.jpg", 
    "course_url": "https://www.udemy.com/estacio-gestao-de-equipes/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T12:12:54Z"
}