{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Resumo: </strong>curso gratuito ofertado pelo professor Frederico Aranha e distribuído pelo Site Campus. Neste curso, o professor apresenta o o que é validação de hipóteses e a metodologia <strong>Lean para Startups</strong>. Você pode fazer este curso online pela plataforma EAD do <strong>Site Campus</strong> - <em>a sua escola de gestão na internet</em>.</p><p>  \tUm curso rápido sobre <strong>LEAN para startups</strong>. Neste curso, você vai aprender os principais conceitos e o processo de <strong>validação de hipóteses</strong> que irá economizar tempo e dinheiro na sua carreira como empreendedor.  </p>  <p>  \tPodemos entender como produto final do processo <strong>LEAN o MVP</strong>, assim como todo o conhecimento que geramos a partir das iterações que nos levam a construção deste <strong>MVP</strong>. Descubra mais sobre <strong>LEAN </strong>neste curso rápido e objetivo.  </p>  <p>  \tO curso oferece, em slides narrados, todos os elementos fundamentais do <strong>LEAN </strong>para <strong>startups</strong>. Com o curso, você poderá estruturar suas ideias e alcançar um <strong>MVP </strong>- produto mínimo viável - que seja vendável. O objetivo principal do curso é fazer com que você economize tempo e dinheiro por meio da aplicação de práticas básicas de <strong>LEAN</strong>.  </p>  <p>  \tAo aplicar o processo <strong>LEAN </strong>você estará garantindo o sucesso da sua ideia. Ao definir um problema, um cliente, uma solução e validar esta solução no mercado você consegue antecipar muitos dos problemas que futuramente teria com este negócio - porque validou. <strong>Validação</strong>, inclusive, é a chave do <strong>LEAN</strong>.  </p>  <p>  \tO público-alvo deste curso são estudantes de graduação com algum conhecimento em gerenciamento de projetos e de negócios. Claro que se você estiver interessado pode fazer o curso, até porque ele é super rápido e prático. Não precisa ter muita experiência, mas como são tópicos reduzidos é importante que você já tenha alguma vivência na área.  </p>  <p>  \t<strong>Startups </strong>são empresas novas com um modelo de negócios disruptivo. Por disruptivo entenda algo diferente, uma forma de se fazer algo e de se ganhar dinheiro como ainda não existe ou não existe na escala em que se pretende executar tal projeto. Não é necessário ser da área de TI, tecnologia da informação, mas precisa ser inovador. O mundo está cheio de inovações e muitas delas vem de áreas que não são da informática, como agricultura e outras. Junte-se a nós!  </p><p><strong>E não se esqueça:<em> </em></strong><em>você pode fazer este mesmo curso, do professor Frederico Aranha distribuído pela escola <strong>Site Campus</strong>, pela plataforma online EAD do <strong>Site Campus -</strong> a sua escola de gestão na internet.</em></p>", 
    "end_date": null, 
    "title": "Guia de Sobrevivência Lean Startup", 
    "price": 0, 
    "instructors": "Guilherme Calabria Etcheverry, Site Campus, Frederico de Azevedo Aranha", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/276818_5b9b_5.jpg", 
    "course_url": "https://www.udemy.com/curso-gratuito-lean-startup/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-07T20:06:22Z"
}