{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tEste es un curso teórico/práctico, creado por la empresa mexicana &quot;P4 Publicidad&quot;, dirigido a empresas, ONG’s, fundaciones, organizadores de eventos, profesionales de la mercadotecnia y público en general interesados en el diseño, definición, búsqueda, negociación, venta, contratación y valoración económica de patrocinios publicitarios.  </p>  <p style=\"\">  \t            Durante el curso usted desarrollará una carpeta de presentación de un proyecto de patrocinio y descubrirá las posibles ventanas de implementación con las diferentes empresas interesadas en patrocinar.  </p>  <p style=\"\">  \t            Los datos y fórmulas comerciales dictadas en el curso son de <strong style=\"\">carácter internacional y universal </strong>por usted lo podrá aplicar a nivel mundial, sin menoscabo de la región o cultura donde se esté negociando.  </p>  <p style=\"\">  \t            ¿Qué logrará usted, su evento, organización, empresa, fundación o territorio con este curso?  </p>  <p style=\"\">  \tFormarse y contar con colaboradores capacitados en la comercialización de patrocinios y en la búsqueda y logro de <strong style=\"\">financiamiento adicional </strong>mediante el convenio con marcas y productos, usando para ello mercadotecnia “Below the Line” en la modalidad de patrocinios.  </p>", 
    "end_date": null, 
    "title": "Guía de Negociación de Patrocinio Publicitario", 
    "price": "40.00", 
    "instructors": "Demian Hurtado", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404822_5412_5.jpg", 
    "course_url": "https://www.udemy.com/metodo-de-comercializacion-de-patrocinios/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T22:59:35Z"
}