{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The <i><strong>Hiring Smart: Human Resources Management for Beginners</strong></i> course, from Global Finance School, is your best bet for learning all the ins and outs of organizational business management. Whether you're looking to improve your current managerial skills, or want to benefit from in-depth knowledge of Human Resources as a whole, our online management course is the right course for you. </p><ul><li><strong>Ramp up your management strategies, with a flexible program, that covers the business of Human Resources from the ground up.</strong></li><li>Learn to effectively recruit, manage, evaluate, and motivate personnel</li><li>Discover the benefits of teams and team cycles in the workplace</li><li>Understand the moral and ethical implications behind professional employee management</li><li>Uncover the pros and cons of remote working, and virtual teams</li></ul><p>Human Resource Management is the backbone of any effective business. People are what drive every organization, and understanding the concepts behind the successful management of this vital resource will help your company thrive. Our easy-to-understand, lecture-based course material fully covers the information you'll need to manage personnel at any level. Whether you're a small business owner with only a few employees, a student of organizational psychology, or a manager looking to advance your Human Resources career, our course will help set you on the path to success. HR Management is all about hiring, supporting, and keeping good people. We offer 50 lectures, featuring three full hours of content, that will teach you everything you need to know about becoming an effective management professional. With links to real-life examples - and review tests and projects you can reset and repeat - our e-learning course gives you the practical skills necessary to run and grow your business or career. Learn about recruiting, supervising, and motivating personnel, the advantages of teams in the workplace, and the essentials of dealing with employee health &amp; safety issues. You'll explore the implications of remote working, and find out how to coordinate virtual groups.</p><strong></strong><p><strong>By the end of this course you will become a better manager, and build a better business team.</strong> With our <i>Human Resources Management for Beginners</i> online course, Global Finance School will help you navigate the management maze, and get you <i>Hiring Smart</i>.</p>", 
    "end_date": null, 
    "title": "Hiring Smart: Human Resources Management For Beginners", 
    "price": "25.00", 
    "instructors": "Global Finance School", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384784_d0bd.jpg", 
    "course_url": "https://www.udemy.com/human-resources-management2/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T11:02:05Z"
}