{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Many Independent Hotels and Bed &amp; Breakfasts owners aspire to have a business that can operate like a well-oiled machine but lack the time or the technical skills to systematize their property. </p><p>In this Series we walk you through the steps of setting up your properties Organizational Structure. In this 5 part tutorial series you will find:</p><ul style=\"\"><li>The 1st tutorial we are going to look at why and how to create an organizational strategy. We look at what type of hospitality property owner you are and the type of responsibilities to effectively operate a hotel or Bed &amp; Breakfast.</li></ul><ul style=\"\"><li>The 2nd tutorial is about developing your Management Strategy. We are going to look at the importance of and how to develop an Operations manual.</li></ul><ul style=\"\"><li>The 3rd tutorial examples of policies and topics should be included in your Operation Manual.</li></ul><ul style=\"\"><li>The 4th tutorial is about how to determine whether the your Operations Manual Works.</li></ul><ul style=\"\"><li>The 5th tutorial looks at the benefits and where to find Outsourcing for handling your extra workload.</li></ul><p>After completing this series you will have the tools to turn your hospitality property into a business envied by your competitors, appreciated by you guests and respected by your employees.</p>", 
    "end_date": null, 
    "title": "Hospitality Property Organizational Structure", 
    "price": "20.00", 
    "instructors": "Gerry MacPherson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455582_f683_2.jpg", 
    "course_url": "https://www.udemy.com/hospitality-property-organizational-structure/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T10:19:58Z"
}