{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Creating and developing your own Independent Hotel or Bed &amp; Breakfast can be a work of dedication and passion; but too often you can get lost in our own property world. In this 6 Part Tutorial Series, we will challenge you to step back and look at your property, the Big Picture. Many have been surprised with what they have found. We will focus on:</p><ul><li>Learning how to compare your Independent Hotel or Bed &amp;Breakfast to your competitor's properties. In lecture #1 I will share a compiled a list of items that we at Keystone HDC feel every hospitality property should have.</li><li>In the 2nd lecture you will find out how to become your own guest, to see your property from the outside. Included are four different checklists for you to use when going through your property.</li><li>The 3rd lecture you will learn how to determine if<b> </b>your hospitality property is accessible by reviewing standard guidelines for hospitality properties. This is for property owners who wish to be accessible to a worldwide customer base.</li><li>Find out if your restaurant is meeting its potential in the 4th lecture. Methods will be revealed that hospitality properties could use improve the profit from their dining area.</li><li>In the 5th lecture you will learn how to get endless referrals; a very effective way to grow your business.</li><li>In the 6th lecture you will find ways to turn negative reviews into positives for both your current and potential guests.</li></ul><p><strong></strong></p><p>Your business should be in your life, not your life. Learn how to see your property from the outside.</p><p>Find out how by enrolling now!</p>", 
    "end_date": null, 
    "title": "How to Review Your Independent Hotel or Bed & Breakfast", 
    "price": "20.00", 
    "instructors": "Gerry MacPherson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456558_bd75_2.jpg", 
    "course_url": "https://www.udemy.com/a-close-look-at-your-independent-hotel-or-bed-breakfast/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-25T08:29:52Z"
}