{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em>Over <strong>2,000+ successful students</strong> have taken this course.</em></p>  <p>  \t<em>(Course Updated: Nov 2015)</em></p><p>\"<em>...the best training course I took [about] virtual management.</em>\" - <strong>Robin H.</strong></p><p>\"<em>Extremely valuable course for ALL virtual team managers</em>\" - <strong>Philip M.</strong></p><p>\"<em>...the tips are immensely practical.</em>\" - <strong>Hal W.</strong></p><p>\"<em>Extremely clear and well-presented material</em>\" <strong>- Nikolay P.</strong></p><p>See more Udemy reviews below!</p><p>+++++++++++++++++++++++++++</p>  <p>  \t<em>NEW! FREE Lecture released</em>: Did you know that <strong>using </strong><strong>a SINGLE WORD with your virtual team can increase compliance by 33%?</strong>  </p>  <p>  \t<strong></strong>Find out what that word is by checking out Lecture 15 below (scroll down to Lecture 15 and click on the \"Preview\" button to watch it for free. No sign-in required).  </p>  <p>  \t                      +++++++++++++++++++++++++++  </p>  <p>  \t              Start managing your virtual team more effectively today.  </p>  <p>  \t              This course is PACKED with step-by-step tactics that help you discover the <strong>p</strong><strong>sychological secrets</strong> of <strong>p</strong><strong>ersuasion &amp; communication</strong> that <strong>i</strong><strong>nfluence your virtual team members to do what you want them to do. </strong>  </p>  <p>  \t<strong></strong>You'll also build <em>TRUST and ACCOUNTABILITY without w</em>asting time on <em>u</em><em>seless technology tools, frustrating meetings or countless back &amp; forth emails</em>  </p>  <p>  \t              +++++++++++++++++++++++++++  </p>  <p>  \t<strong>Virtual teams are the future</strong>.  </p>  <p>  \t                                 If you manage a virtual team today, then you'll probably continue to do so for the rest of your career.  </p>  <p>  \t                                 If you don't, then you probably will in the next 5 years.  </p>  <p>  \t                                 Learning how to manage people you don't see face-to-face is an important skill that you need regardless of what industry you're in.  </p>  <p>  \t                                               With \"Managing &amp; Influencing Virtual Teams,\" you will learn the psychological secrets of <em>persuasion </em>and <em>communication </em>that influence your virtual team members to do what you need them to do.  </p>  <p>  \t                                               The course will also help you <em>increase the level of trust and accountability</em> among your team members, while <em>reducing the time you spend</em> on frustrating meetings, useless technology tools, and back-and-forth emails.  </p>  <p>  \t                                        At the end of each lecture in the course, you'll get <em>specific, actionable steps</em> that you can implement immediately.  </p>  <p>  \t                                      In addition, you'll also get <em>downloadable sample scripts and templates</em> that you can simply copy &amp; paste and use with your own virtual team.  </p>  <p>  \t<strong>The course contains the following sections</strong>:  </p>  <p>  \t<em>- The Psychology of Communication in Virtual Teams</em>: Psychological strategies to effectively communicate with your team and reduce ambiguity and miscommunication  </p>  <p>  \t<em>- Principles of Behavior Change</em>: Four strategic principles that will change your team's behavior to get things done  </p>  <p>  \t<em>- Tactics of Influence &amp; Persuasion</em>: Step-by-step tactics that influence your team members to do what you need them to do  </p>  <p>  \t<em>- Managing Virtual Meetings Effectively</em>: How to have fewer meetings while increasing their effectiveness at the same time  </p>  <p>  \t<em>- Choosing and Evaluating the Right Technology</em>: A simple framework to choose and evaluate the right technology tools to use with your virtual teams  </p>  <p>  \t<em>- Building Trust in Virtual Environments</em>: A methodical blueprint to increase the level of trust among your virtual team  </p>  <p>  \t<em>- Killer Email and Phone Techniques</em>: Powerful email and phone techniques that you can use to influence your virtual team members  </p>  <p>  \t<strong>What is different about this course?</strong>  </p>  <p>  \t                                        There are a lot of courses about managing virtual teams. Here are three reasons why this one is different  </p>  <p>  \t<strong>Reason #1</strong>: <strong>Tactics, not just strategies</strong>  </p>  <p>  \t                                        Most courses about virtual teams focus on high-level strategies and theories.  </p>  <p>  \t                                        Very few actually give you the <em>tactics </em>that you need to implement those strategies.  </p>  <p>  \t                                        In my course, I'll show you exactly how you should apply the management tactics to your own situation. I will give you step-by-step techniques and scripts that will save you a lot of time in managing your virtual team.  </p>  <p>  \t                                        In other words, I will answer both those questions for you:  </p>  <p>  \t<em>-What do I need to do?</em>  </p>  <p>  \t<em>-How exactly do I do it?</em>  </p>  <p>  \t                                        Moreover, every video also has a “Summary of Actions\" slide at the end that summarizes the course lecture for you, and tells you <em>exactly what you need to do as a next step</em>.  </p>  <p>  \t<strong>Reason #2: </strong><strong>Proven Science-based Research</strong>  </p>  <p>  \t                                        For the course, I did a ton of science-based research about powerful psychological and productivity studies in the areas of influence and management.  </p>  <p>  \t                                        Some of the research references include journals from the Harvard Business School, Kelley School of  Business, and McKinsey Global Institute.  </p>  <p>  \t                                        I also reference studies from international bestselling books such as “Influence: The Science of Persuasion,\" “Made to Stick,\" and “The Tipping Point,\" among others.  </p>  <p>  \t                                        I've tested the findings from those references myself, and selected what works and what doesn't in virtual teams.  </p>  <p>  \t                                        So you will get the absolute best of the best concepts that work for you and your team.  </p>  <p>  \t<strong>Reason #3: </strong><strong>Practical insights that work (not just theory)</strong>  </p>  <p>  \t                                        I've been managing virtual teams for over 10 years, both as an entrepreneur and as a project manager.  </p>  <p>  \t                                        In fact, I still work as a remote program manager, and my full time job is to manage virtual teams across the world to deliver highly complex projects.  </p>  <p>  \t                                        Unlike most courses that are taught by professors who have studied this space from a purely theoretical view, you'll be getting a unique perspective on how to manage people remotely from someone who does this for a living.  </p>  <p>  \t<strong>In short, the course will help you:</strong>  </p>  <p>  \t                                             - Communicate more effectively and build trust with your team  </p>  <p>  \t                                             - Stop worrying about being caught up in pointless day-to-day details  </p>  <p>  \t                                             - Save valuable time spent on useless meetings and back &amp; forth emails  </p>  <p>  \t                                             - Choose the right technology tools and techniques for effective team collaboration  </p>  <p>  \t                                             - Influence  your team to be accountable for getting tasks accomplished  </p>  <p>  \t<strong>NOTE for Project Management Professional (PMP) certification holders</strong>  </p>  <p>  \t<strong></strong>This course qualifies for 3 Professional Development Units (PDUs) under PMI's \"Category B: Continuing Education\" category. After you're done with the course, you will get a \"Certificate of Completion\" from Udemy, which you can use as evidence for PMI.  </p>  <p>  \t<strong>Ready to Enroll? </strong>  </p>  <p>  \t            Click on the \"Take this Course\" button in the top right corner of this page and start learning how to effectively manage and influence your virtual team today.  </p>", 
    "end_date": null, 
    "title": "How to Manage & Influence Your Virtual Team", 
    "price": "20.00", 
    "instructors": "Hassan Osman", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/110240_9cb3_7.jpg", 
    "course_url": "https://www.udemy.com/virtual-teams/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-24T18:32:20Z"
}