{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Are you considering a career in management consulting? You are probably aware that the competition for this type of job is tougher than ever. You will be competing against the best of the best. We can help you prepare for the whole recruitment process.</p><p>This online course teaches you everything you need to know to get a consulting job: from case interview prep to networking and writing your application. Don't read old case prep books and spend hours searching the internet for outdated advice.</p><p>We will cover the whole process – everything you need to know. How to network, write a cover letter and resume, prepare for tests, do the case interviews, and the fit interviews. Don't worry – we still have many cases for you to practice. There is a lot of material to read and videos to watch, all based on real-life experience and interviews with consultants.</p><p>Below are the different modules of this course.</p><p></p><p><strong>Foundations</strong></p><p>This module contains the information you should know before you send your application. We will address the application process, key success factors, and why networking is so important. You will also learn how to network properly in a detailed networking course.</p><p></p><p><strong>Resume</strong></p><p>Module 2 outlines and elaborates all sections of a superior resume. It also teaches you how to highlight strengths in this powerful self-marketing tool. You will see good and bad examples throughout this module so you can quickly start writing your own resume.</p><p></p><p><strong>Cover Letter</strong></p><p>In this module, we will give you guidelines on how to qualitatively present your credentials in a cover letter. We will show you what and what not to include through easy-to-understand examples. The cover letter is very important as it demonstrates your written communication skills – one of the key success factors.</p><p></p><p><strong>Tests</strong></p><p>Module 4 consists of videos about various tests. Some consulting firms will require you to take several tests. We will deep-dive into numerical reasoning tests, verbal reasoning tests, logical/abstract reasoning tests, as well as personality tests. This module will help you prepare for these tests and improve your score.</p><p></p><p><strong>Fit Interviews</strong></p><p>In fit interviews you need to demonstrate your personality, experience and your career plans. You will learn how to present yourself properly and avoid the typical mistakes. We will guide you through typical interview questions and answers and help you avoid the trick questions. Finally, we will help you present yourself confidently.</p><p></p><p><strong>Case Interviews</strong></p><p>This elaborates the nature of case interviews, their structure and type. You will learn all the necessary steps on how to solve a case interview in a structured way. We will also present ten of the most common frameworks used for case interviews. These frameworks will help you feel more confident and focus on analysis and recommendations.</p><p></p><p><strong>Practice Cases</strong></p><p>Practicing cases in mock interviews is very important. The whole of module 7 contains nothing but practice cases. We will show you real-life cases accompanied with charts and other supporting data. Forget text-cases from case text books – consulting firms don't present cases like this anymore. We will walk you through answers and explain in detail how to answer the cases.</p>", 
    "end_date": null, 
    "title": "How to Get a Consulting Job and Ace the Case Interview", 
    "price": "45.00", 
    "instructors": "Daniel Stefanac", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578858_2257_3.jpg", 
    "course_url": "https://www.udemy.com/management-consulting-job/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T09:17:23Z"
}