{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p class=\"PIN_1372850574664_hazClick\" style=\"\"><p style=\"\">One of the hardest  aspects in any leadership role is to ensure that all people in the team you  have responsibility for are carrying out the right activities in an effective  manner to drive business success.</p>  <p style=\"\">Your success as a  leader depends on this, and therefore your success depends on your ability to  lead, coach and mentor your people effectively – or to ensure that the <strong style=\"\">managers</strong> working for you are  effectively leading <strong style=\"\">their</strong> people in <strong style=\"\">their</strong> teams – all the way to the front  line.</p>  <p style=\"\">This module  provides a framework for ensuring that a leader has a process for identifying  what activities need to be driven each week and how, as a leader, you can be  sure that these activities are being led, coached and managed – at all levels –  in an effective manner.</p>  <p style=\"\">Why is the video a  must for all leaders, irrespective of the level of management you are in?&nbsp; Simple.&nbsp;  All leadership roles will be assessed in terms of what their team  delivers and how they get their team to deliver.&nbsp; In other words, the performance review.</p>  <p style=\"\">This video provides  the link between the performance review, providing the framework and most  importantly the “how”.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "How to lead, coach and manage a team from the front.", 
    "price": "20.00", 
    "instructors": "Angus Patterson & David Dowe", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/63381_e851_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-lead-from-the-front/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-02T09:46:23Z"
}