{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t          Did you know that a failure to build trust is the number one reason for breakdowns in communication and failure to succeed in virtual teams and less than half of all virtual teams actually achieve their objectives? If you are a leader or member of a virtual team and a lack of trust is getting in the way of your ability to achieve as a team, this course will give you eight practical techniques to create the trust that your virtual team needs.  </p>  <p>  \t  Here is what a recent student had to say about the course:  </p>  <p>  \t<em>&quot;I </em><em>write about research that&#039;s conducted by teams who are often dispersed across the world. This course has helped me understand why sometimes I have difficulty connecting/sharing meaning with members of a team. Although I am not always part of the team, I need to gain their trust and this course offers some excellent tips for what I can do to build trust with people I&#039;ll probably never meet face to face. Korrine is very easy to listen to and her slides are very easy to comprehend.&quot;</em> Leanne W.  </p>  <p>  \t    All the techniques covered in the course are very practical and easy to implement. They are based on my 12 years experience as a virtual team leader, plus the experience of hundreds of virtual team leaders and members that I have trained, consulted to, worked with and interviewed. They are proven to work!  </p>  <p>  \t    By taking this course, you will understand the type of trust that tends to build in virtual teams and the importance of leveraging this swift trust to build real, enduring trust. The good news is that it is possible to build real trust across the team, even without meeting your team mates face to face, and this course will show you how.  </p>  <p>  \t    You will learn eight proven, practical techniques for developing trust in a virtual team, <strong>all in less than one hour!</strong>  </p>  <p>  \t    After learning these strategies, you will be able to create shared goals in your team, agree on ground rules, develop communication protocols, manage effective virtual meetings and build strong team relationships. The course includes quizzes to consolidate your learning and a number of example documents and checklists, to assist you along the way. By completing this course, you will be able to bullet proof your team by building the levels of trust it needs to succeed.  </p>", 
    "end_date": null, 
    "title": "How to Build Trust in your Virtual Team", 
    "price": "20.00", 
    "instructors": "Korrine Jones", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331096_060e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-trust-in-your-virtual-team/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T06:16:58Z"
}