{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t    You&#039;ll learn a proven process methodology for corporate transformation that&#039;s been developed while working with companies like GE, Apple, IBM, Symantec, Office Depot and many more.  </p>  <p style=\"\">  \t    Accelerated Corporate Transformation (ACT) was developed by Dr. Robert H. Miles while working at Harvard Business School as a workshop process with top CEOs, then honed over many decades of direct experience with 25 full transformations and many consulting projects.  </p>  <p style=\"\">  \t    You&#039;ll learn the 6 Inhibitors and Accelerators published in the Harvard Business Review, plus never before revealed strategies for transformational leaders at every level.  </p>  <p style=\"\">  \t    Beyond change management, you&#039;ll learn how and why this proven methodology works, including the organizational development science and insights into human behavior.  </p>  <p style=\"\">  \t    Any CEO or member of a corporate leadership team who wishes to fully support their company&#039;s change management efforts should learn the difference between transformation and change.  </p>  <p style=\"\">  \t    This course will take you far beyond that - you&#039;ll gain strategies, skills and leadership insights that will add to the value you already bring to your organization and help you grow your career.  </p>  <p style=\"\">  \t    Anyone who manages a team of people will take skills from this course that they can immediately put to use in more effectively <strong style=\"\">engaging</strong> others for better performance - through a proven process methodology that creates commitments and accountability with clear communication across every level in a structured, streamlined way.  </p>  <p style=\"\">  \t    Corporate leaders will gain profound insights into high-level organizational performance and learn how to gain high shareholder value from lower-performing organizations.  </p>", 
    "end_date": null, 
    "title": "How CEOs Transform Companies with Robert H. Miles, PhD.", 
    "price": "20.00", 
    "instructors": "Aaron McManus, Robert H. Miles, PhD", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319662_eba9_4.jpg", 
    "course_url": "https://www.udemy.com/transform/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T18:58:06Z"
}