{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>The following philosophy will let your organization perform 10 times better in\nthe long term!</p><p>Shareholder capitalism is under pressure and may have had its day. The\nOccupy movement, an international protest movement against social\nand economic inequality, is a public expression of this. Newspapers are\nalso criticizing the consequences of organizations’ one-sided focus on\nshort-term financial results in order to meet shareholder expectations\nin particular. The past decades, however, have thankfully provided\nincreasing examples of organizations demonstrating that things can be\ndone differently. Companies that focus on creating sustainable value for\nall stakeholders. Creating sustainable growth entails delivering value for\nemployees, for customers, for shareholders and for society. The underlying\nidea of this philosophy is the exchange of value between various\nparties in long-term relationships. To sustain these relationships, an\norganization must not only take value, but also give it back. Only then\ndoes the exchange relationship become structurally profitable for both\nparties. The value that an organization provides to employees (training,\ndevelopment, purpose, salary, etc) motivates and helps them to deliver\nvalue to customers. If a customer is highly satisfied in return, this fosters\nloyalty and exemplary behaviour, elements that are in turn valuable to the organization. This creates profit for the organization, allowing it to\ncreate value once again for society, employees and customers. In other\nwords, it is a self-sustaining cycle. We call this stakeholder capitalism, or\nthe Value Profit Chain, and it is the concept upon which this MOOC is\nbased.</p><p>How to create sustainable value? How do you keep your stakeholders enthusiastic about your organization? This MOOC will answer these questions by means of a lot of great examples, inspiring cases (like Starbucks and Zappos) and new research. While watching this MOOC you will also have to answer self-reflecting questions and you will get tools to work with!</p><p><br></p>", 
    "end_date": null, 
    "title": "How to change your organization?", 
    "price": "50.00", 
    "instructors": "Jeroen Geelhoed, Salem Samhoud, Nur Hamurcu", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718328_be2e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-change-your-organization/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T14:27:10Z"
}