{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Do you want to get paid at least 20% Higher at The Entry Level ?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">and You have no Idea HOW to ASK for MONEY?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">YOU have Come to the RIGHT Place</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Salary Negotiation </strong>can be one of the most <strong style=\"\">stressful aspects</strong> of the job search and selection, especially when you’re just <strong style=\"\">Starting your career</strong>.  </p>  <p style=\"\">  \t           How do you justify <strong style=\"\">Asking for More</strong> than the company is offering you, especially for an <strong style=\"\">Entry-level position?</strong>  Do you have <strong style=\"\">Something Special</strong> that can help you negotiate. Is it even an option to negotiate?  </p>  <p style=\"\">  \t          Salary negotiation is an art and this course will help you learn just that.<strong style=\"\"> This course has been delivered several times to fresh graduates and has earned excellent feedback</strong>. Most of them got good salaries because they were taught the skill of negotiation in this course. The course will teach you <strong style=\"\">how you can prove your worth better to employer</strong>. What to ask and what to answer during the negotiation. And most importantly <strong style=\"\">what are your cards and when to play them</strong> during the negotiation process.  </p>  <p style=\"\">  \t            After taking this course you will understand that how <strong style=\"\">YOUR opinion matters</strong> the most in this process. You will also be exposed to information of knowing the company and the <strong style=\"\">Salary Range</strong> before going for the interview. You will know how different scenarios can present themselves in the negotiation process and how you can best help those situations.  </p>  <p style=\"\">  \t            The salary negotiation is a choice.. But you will have only one shot at it... So you might as well do that right!  </p>", 
    "end_date": null, 
    "title": "How To Negotiate A New Job Position", 
    "price": "20.00", 
    "instructors": "Z Saqib", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298148_4954_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-negotiate-a-new-job-position/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T05:24:08Z"
}