{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>To add further value to your workplace and personal decisions, learn about ideas breaking through, what they have in common, and how to gain access.  Learn what happens to ideas on their way to worthy outcomes.  This Course improves your everyday use of ideas.<br></p><p><strong>Get on the inside of game-change.  Discover what happens to ideas in organisations. </strong><br></p><ul><li>Identify and resolve idea problems in your organisation, and elsewhere</li><li>Overcome idea-based gaps that restrain decision-making, performance, and opportunity</li></ul><p><strong>What am I going to get from this Course?</strong><br></p><ul><li>Gain a fresh perspective about what happens to ideas: their successes, and failures</li><li>Learn what is happening when our ideas overcome problems and resistance</li><li>Recognise and witness how ideas break through: access these insights</li><li>Harness and apply a new 'Breakthrough Passage' framework</li><li>Add value to your decisions, and your everyday use of ideas</li><li>Game-changing and game-lifting opportunity</li></ul><p><strong></strong></p><p><strong>Benefits the Course Provides</strong></p><ul><li>Provides a new, idea-based way of thinking and solution framework</li><li>Reveals\nhow successful ideas address problems and opportunities</li><li>Enables you to recognise these problems in organisations</li><li>Sets guidelines so that you can apply the new framework</li><li>Enables you to build and extend professional results: for you, and others</li></ul><p><strong>Who is this Course For?</strong></p><ul><li>Decision-makers, and</li><li>Those keen to upgrade their views about how ideas add value, and</li><li>Those keen to address troublesome workplace issues</li><li>Game-changers</li></ul><p><strong>What the Course Covers</strong><br></p><ul><li>Reviews the role of ideas in organisations, and elsewhere</li><li>Invites, compares, and illustrates fresh views about the role of ideas in workplaces </li><li>Witnesses breakthrough\nand game-change</li><li>Includes: industries, colleagues, and events.  </li><li>Provides examples of idea activity: brief, structured, and spanning over 2000 years.</li><li>Original perspective, upgrades conventional management</li><li>Uses case-outcomes to develop an enhanced view about what happens to ideas </li></ul><p><strong>Course Format</strong></p><ul><li>Story and narrative presentations </li><li>Includes perspective, problems, solutions, applications, and summaries</li><li>Five theme sections: 33 Lectures, covering 23 Topics, with quizzes and projects</li><li>20 multiple-choice questions: to support Course learning</li><li>15 Project exercises to apply your learning to workplaces and decision-making</li><li>Video illustrations</li></ul><p><strong>What's Unique about this Course</strong></p><ul><li>This Course is about what happens to ideas around you, and elsewhere, and how you can learn from their successes </li><li>It enables you to understand overcoming barriers to the way things are done, and to successfully challenge existing approaches</li><li>“Ideas Breaking Through” is a great way to a better way of thinking about ideas and their application. </li><li>Adds value to a very wide range of decisions</li><li>Shows how ideas underpin: management, strategy, organisation, HR, and leadership</li><li>Challenges and extends mainstream management thinking</li><li>Evidence-based and Plain speaking</li><li>Provides universal application, including: workplace, community, industry, and nation</li><li>The Course provides everything you need, including examples, so that you can set aside some quality time, and learn, in a structured manner, how ideas help us to transform and reconstruct our world.  And your world.</li></ul><p><strong>-------------------------------------------------------------------------------------------------------------------</strong></p><p><strong>Why choose this Course?  To think differently and better, support ideas breaking through, and more confidently use ideas to weave value into your personal and professional decisions. </strong><br></p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Ideas Breaking Through", 
    "price": "20.00", 
    "instructors": "Dr Glenn Rothberg", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413783_d182_6.jpg", 
    "course_url": "https://www.udemy.com/ideas-breaking-through/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T04:01:14Z"
}