{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Este curso cubre, paso a paso, la implementación de todos los elementos administrativos que necesitamos para crear y hacer madurar equipos de alto desempeño en nuestras organizaciónes. El curso asume que ya tenemos el diseño de esa estructura administrativa, cuyo desarrollo fué explicado en un curso previo, que es bueno estudiar antes que éste, aunque esto no es un requisito indispensable.</p><p>El curso esta hecho en un lenguaje sencillo, que le va a servir mucho a la persona que ve este tema por primera vez, como también a alguien que ya tiene equipos en su organización y que quiere asegurarse de que su estructura de soporte incluye todos los aspectos necesarios para el buen desempeño y crecimiento de sus equipos.</p><p>El curso incluye 14 conferencias y dos exámenes que recomendamos tomar, porque al mismo tiempo que validan los conocimientos adquiridos, nos permiten profundizar en el entendimiento de los temas cubiertos en las conferencias. El curso en si requiere de una hora para estudiarlo, aunque los examenes, si son hechos y revisados cuidadosamente, pueden extender el tiempo a invertir hasta hora y media o dos horas.</p><p>Las secciones principales del curso cubren el plan de implementación, el proceso de implementación de todos los elementos de la estructura de soporte y la sección final que explica como medir el avance del proyecto y como sostener el proceso a largo plazo. También se incluye un documento que explica los diferentes ahorros y beneficios que se pueden obtener del sistema de equipos.</p><p>Al final vamos a comprender el proceso de implementación de equipos de alto desempeño, vamos a reconocer toda la terminología asociada con ellos y vamos a poder evaluar el desempeño de los equipos y su nivel de madurez. Asi mismo vamos a darnos cuenta que que para tener equipos de alto desempeño,  son indispensables ciertos elementos para que los equipos se desarrollen y tengan un impacto importante en los resultados de la empresa.</p>", 
    "end_date": null, 
    "title": "Implementación de un Sistema de Equipos de Alto Desempeño", 
    "price": "45.00", 
    "instructors": "Mr. Rodrigo Montano Mejia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640552_bb93_2.jpg", 
    "course_url": "https://www.udemy.com/implementacion-de-un-sistema-de-equipos-de-alto-desempeno/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T17:00:19Z"
}