{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Growth through innovation is recognized as a strategic imperative. More than ninety five percent of all CEOs around the world recognize the importance of business innovation and yet most are unhappy with their company’s ability to innovate and create business impact. Innovation is no longer just for product development and R&amp;D but is now recognized as crucial for development of new processes, services, brands, channels, business models and growth engines across the organization.  </p>  <p>  \t  This course will cover the definition of business innovation and its importance, the difference between innovation and breakthrough innovations, and the principles behind breakthrough innovations. This course will share the challenges and barriers faced by individuals for making innovation real inside their company. Individuals will learn tools and techniques to help them think and act differently. They will also learn a simple and proven process in creating more and better business ideas. Different ideation tools and techniques will also be shared to help individuals be a more creative thinker.  </p>  <p>  \t  This course is developed by IXL Center, a GIM Institute-certified Registered Training Provider, as a preparatory course for the GIM Institute&#039;s Level 1 innovation certification exam. GIM Institute&#039;s Innovation Certification Program is designed for anyone interested in becoming certified in innovation as a business discipline, from creative minds to innovation professionals to business managers and leaders. This applies to anyone who wants to broaden their capabilities in innovation, build a career in innovation, or help their organization become a leader and high performer in both the creation and capture of business value from innovation. Certified professionals will gain insights around new approaches to many different functional areas of a business, including marketing, technology, finance and sales.This Level 1 course is designed to help individuals understand what business innovation is and what process and tools are needed to generate new breakthrough ideas for their organization.  </p>", 
    "end_date": null, 
    "title": "Innovation: How to Generate Breakthrough Growth Ideas", 
    "price": "50.00", 
    "instructors": "Global Innovation Management Institute", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310244_fb08_5.jpg", 
    "course_url": "https://www.udemy.com/giminstitutelevel1-by-ixlcenter/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-29T19:13:38Z"
}