{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>How are organizations created? Do they just pop up out of nowhere? Later on, how do these grow? These are quite crucial questions for all of us, whether we are students, entrepreneurs or managers. This course is about to give you introduction to Organization Theory, which is a field that contributes to marketing, product development and even the management.</p><p>You can look forward several interesting concepts such as the understanding of “Organizational Stakeholders\". And no it´s not shareholders, that´s something different. Hence this course is ideal as an introduction for more advanced Organizational Theory courses such as Organizational Change or Organizational Design.</p><p>Have you ever wondered how it would look like if you studied this subject at the university? We allow you to do so now! This course is designed after the materials as being taught at Swedish universities. Even better, if you are currently a student of such university course anywhere around the world, we will definitely make your studies easier and more fun.</p><p>This course covers the full basics of Organizational Theory divided into three main areas. Firstly, we focus on the organizations themselves and describe why do these exist and what are these trying to achieve. Secondly, we focus on organizational stakeholders and their varying desires. And thirdly, we look outside of the organization and try to understand the environment that these organizations are facing. You can expect to find here up to 15 videos that will lead you through the subject in an intuitive way!<span></span></p>", 
    "end_date": null, 
    "title": "Introduction to Organizations", 
    "price": 0, 
    "instructors": "Robert Barcik", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614584_04ea.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-organizations/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T08:37:41Z"
}