{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>\r\n\t   Managers need to develop their interpersonal or people skill if they are going to be effective in their jobs.  Organizational behavior is a field of study that investigates the impact that individuals, groups, and structure have on behavior within an organization, and then it applies that knowledge to make organization work more effectively. Specifically, organizational behavior focuses on how to improve productivity; reduce absenteeism, turnover, and deviant workplace behavior; and , increase organizational citizenship behavior and job satisfaction.\r\n</p>\r\n<p>\r\n\tThis course uses the book of Stephen P. Robbins and Timothy A. Judge-Organizational Behavior 12th edition. All the quizzes are subjective questions that is intended for critical thinking and ethical comprehensions of the students.  The perceptions of the students on the additional materials for the specific lectures will help them conceptualize the essence of becoming an effective leader and manager.\r\n</p>\r\n<p>\r\n\tThe course is 106 minutes long on the instructional part, but with the inclusions of additional materials and quizzes would depend on how the students work on each lectures.  This course in a standard classroom would take one semester with five credit hours.\r\n</p>\r\n<p>\r\n\tStudents should take this course for them to understand, explain, and summarize the importance of attitude, behavior, job satisfaction, and job involvement in the work force.\r\n</p>\r\n<p>\r\n\tBiography:\r\n</p>\r\n<p>\r\n\tPhD in Business and Technology with Capella University\r\n</p>\r\n<p>\r\n\tMBA with Colorado Technical University\r\n</p>\r\n<p>\r\n\tBS in Accounting with University of Nevada Las Vegas\r\n</p>\r\n<p>\r\n\tInternal Auditor for five years\r\n</p>\r\n<p>\r\n\tForensic Accountant\r\n</p>\r\n<p>\r\n\tExperience in Gaming Industry for fifteen years\r\n</p>\r\n<p>\r\n\tOnline instructor for a year.\r\n</p>", 
    "end_date": null, 
    "title": "Introduction to Organizational Behavior", 
    "price": "50.00", 
    "instructors": "Gloria S. Castro, Ph.D.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134088_c03d_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-organizational-behavior/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-15T22:43:23Z"
}