{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Here is a summary of topics covered in this course.</strong></em></p>\n\n\n\n\n\n\n\n<ul><li>Definitions of Quality<ul><li>How can you achieve quality if you don't understand what quality is?</li></ul></li><li>Why business need to produce quality product?</li><li>Difference between Quality and Grade</li><li>Difference between Quality Assurance and Quality Control</li><li>Quality Management System</li><li>History of Quality</li><li>Quality Tools<ul><li>Learn about seven basic quality tools.</li></ul></li><li>Quality Costs - or the Cost of Poor Quality (COPQ)<ul><li>Prevention cost, appraisal cost, internal failure costs and external failure costs</li></ul></li><li>Quality Awards - Deming Award, EFQM and MBNQA<ul><li>In this section you will learn about these three top global quality awards.</li></ul></li><li>Quality Gurus - Edwards Deming, Joseph Juran and Philip Crosby.<ul><li>In this section learn about the life and works of these quality gurus.</li></ul></li><li>and many more topics to get you started in the field of quality management.</li></ul><p><em><strong>Who should take this course:</strong></em><br>  \t</p><p>Are you new to Quality and struggling with Quality Management terms?  </p>\n\n<p>  \tDid your organization put you in the Quality Management function without providing any formal training?  </p>\n\n\n\n\n\n\n\n<p>  \tAre you appearing in any certification exam such as PMP, CQA, CQE and want to refresh your understanding of Quality Management?</p>\n\n\n\n\n\n<h4></h4>\n\n\n\n\n\n\n\n<hr><br><p><strong class=\"redactor-inline-converted\">Defining Quality:</strong></p>\n\n\n\n<p>  \t                          How do you define quality? Quality has different meaning for different people. That leads to the question, how would you define quality? This course starts with a number of definitions of quality such as fitness for use, conformance to specification, reduced variation, consistency, meeting or exceeding customer expectations etc.  </p>\n\n\n\n\n\n\n\n<p>  \t                                There is a misconception that quality costs money and that better quality products are costlier than poor quality products. Deming's chain is used to explain how good quality reduces waste, improves productivity and that in turn makes the product cheaper to produce. This ultimately leads to the survival of the organization in this competitive market and provides employment.  </p>\n\n\n\n\n\n\n\n<p>  \t                                Difference between quality and grade and the difference between quality assurance and quality control is also explained in this course. A $10,000 pen is not of better quality than a $1 pen, since these are two different products (grade) with different purposes.  </p>\n\n\n\n\n\n\n\n<p>  \t                              What is Quality Management Systems (QMS)? What are the documents included in a Quality Management System? Quality Policy, Quality Manual, Procedures, Work Instructions and Forms together form a QMS.  </p>\n\n\n\n\n\n\n\n<p>  \t                                Quality Management has changed from 19th century till date from inspection to quality control, and then to quality assurance and Total Quality Management (TQM). In recent time ISO 9001, Six Sigma and Lean Manufacturing are key quality concepts in use. Did you know that the Control Charts, which are the backbone of Six Sigma concept were introduced way back in 1920?</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Introduction to Quality Management", 
    "price": "25.00", 
    "instructors": "Sandeep Kumar ­", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292038_74c5_10.jpg", 
    "course_url": "https://www.udemy.com/quality-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T00:50:32Z"
}