{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>This course provides the strategic overview and operational details with</strong><strong class=\"redactor-inline-converted\"> real world examples, critical analysis of most common mis-concepts and sharing of good and bad practices in implementing this standard.  The course will provide an opportunity to clarify all the possible critical issues most commonly found in its implementation and auditing by the certification agencies.</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Suitable for</strong></p>\n\n\n\n\n\n<ul><li>CEOs, Departmental Heads and Business Managers who are required to implement this standard</li><li>Quality Managers and Professionals involved in its training and implementation</li><li>QMS Internal and External auditors</li><li>Management Consultants, Trainers and Educators providing ISO 9001 training and support to organizations</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">A powerful course which also lays the conceptual foundation of QMS</strong><br></p>\n\n\n\n\n\n<p>ISO 9001:2015 has been upgraded with a number of new elements to move companies to a higher level of excellence.  The course provides an in-depth coverage of the revised requirements of ISO 9001:2015 version with strong conceptual understanding.  It will also provide practical guidelines on how to implement and audit the new requirements.  The course will prepare you to understand and implement the transition smoothly and effectively. It will cover practical examples, critical analysis and success factors, and how to overcome the potential hurdles and difficulties in implementation.<br></p>", 
    "end_date": null, 
    "title": "ISO 9001:2015 Transition Course", 
    "price": "50.00", 
    "instructors": "Dr. Kamran Moosa", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708134_a4cb_15.jpg", 
    "course_url": "https://www.udemy.com/iso-90012015-transition-course/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T02:19:34Z"
}