{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Question:</strong></p><ol><li>Do you want to <strong>learn </strong>the basics and why your business should be using Quality Management <strong>TODAY</strong>?</li><li>Do you know why your quality will reflect your <strong>professionalism </strong>in the eyes of the client?</li></ol><p>It's a misconception that 'quality costs money' as a poor quality product or service will ultimately cost you more.</p><p>Whether you're starting out in business or have been trading for a number of years, 'Quality Is Everything'. Unless a prospective client already knows you or you already have an established reputation, trying to gain new clients can be a difficult task, especially in today's climate of competition.</p><p>To give yourself the best chance to win that new client, you must show that you're not only equally as good as your competition but BETTER, much better in fact!</p><p>In this course we will be looking at the history of quality management over the past two hundred years and how it has evolved to become an International Standard, the ISO9001. We will be defining 'Quality' and 'Quality Management' to better understand how we can achieve these requirements for our clients.</p><p>We will be looking at the ISO9001 and specifically Clause 4 that deals with what needs to be included in a QMS (Quality Management System) and working through a 'Quality Manual' template that I provide so at the end of the course you will be well on your way to having your own Quality Management System.</p><p>Finally we will be looking how to implement your QMS and continual improvement so that you get the most out of Quality Management and ultimately achieve your business goals.</p><p>If your company or professional body requires you to complete <b>Continuing Professional Development</b> (<b>CPD</b>) or <b>Continuing Professional</b> <strong>Education (CPE)</strong>, then this course will constitute half a days 'training'.</p><p><strong>++++++++++++++++++++++++</strong></p><p><strong>Bonus</strong></p><ol><li><strong>Quality Manual Template </strong>for you to work through and for part of your QMS<strong></strong></li><li><strong>Course Notes </strong>on each section for you to read and reference off line<strong></strong><strong></strong></li></ol><p><strong>++++++++++++++++++++++++</strong></p>", 
    "end_date": null, 
    "title": "ISO9001 Quality Management System", 
    "price": "25.00", 
    "instructors": "Marc Thomas", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/573424_54f6_4.jpg", 
    "course_url": "https://www.udemy.com/iso9001-quality-management-system/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-04T12:26:17Z"
}