{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Kreativität im Unternehmen ist wichtig, nicht nur um innovative Produkte zu entwickeln, sondern vor allem, um konkurrenzfähig zu bleiben. Sonst verliert man ganz schnell den Wettbewerb mit Konkurrenz-Produkten oder Unternehmen, die sich teilweise nur minimal unterscheiden. Wichtig ist, dass die Kunden Deinen Namen und Dein Produkt kennen und schätzen - nur dann werden sie es auch kaufen. Um genau das zu erreichen, ist Kreativität eine Grundvoraussetzung - gerade in einem Hochlohnland wie Deutschland, Österreich oder der Schweiz. In unserem Training wirst du verschiedene Tools und Techniken kennen lernen, um Kreativität besser zu verstehen und selbst anwenden zu können, bzw. die Voraussetzung dafür in Deinem Unternehmen zu schaffen. Dieses Training konzentriert sich auf die Grundlagen und wie man das richtige Umfeld und Rahmenbedingungen schafft, damit die Techniken auch wirklich funktionieren.</p><p>Das Training verschafft Dir ein solides Grundverständnis von Kreativität und Innovation. Außerdem vermittelt es Dir mit ein paar konkreten Anwendungsbeispielen, wie Du bereits morgen früh an Deinem Schreibtisch kreativer werden kannst und andere dazu bringst, kreativer zu sein und mit mehr Spaß an der Arbeit bessere Produkte und Dienstleistungen zu schaffen. </p><p>Also komm mit uns auf eine spannende Reise, um Deine Kreativität und die Kreativität Deines Unternehmens zu entdecken und zu fördern. Dafür benötigst du nicht mehr als insgesamt eineinhalb Stunden Zeit und ein paar zusätzliche Materialien, die Du auf der Einkaufsliste findest. Diese Materialien sind sehr wichtig, damit Du auch die Übungen durchführen kannst. Denn nichts ist wichtiger als das Erlernte auch direkt in die Tat umzusetzen und auszuprobieren. Natürlich merkt man sich Sachen besser, wenn man diese auch anwendet und selbst ausprobiert hat. Wie heißt es so schön - Liebe geht durch den Magen. Das ist im Business keinen Deut anders - wenn Du die Übungen in unserem Kurs anwendest, hast Du am meisten davon. Und damit die Kreativität Dich begeistert, ist es am besten, wenn Du Dir die Zutaten besorgst und gleich damit loslegst. </p><p>Was mir sehr wichtig ist: Jeder kann kreativ sein. Kreativität beschränkt sich nicht auf die \"kreativen Berufe\" wie Mediendesigner oder Ähnliches. Jeder kann es, es muss nur das richtige Umfeld dafür da sein und die beteiligten Menschen müssen die notwendige Offenheit dafür mitbringen. Dafür ist natürlich auch die Unternehmenskultur sehr wichtig. Wenn Dein Unternehmen alles andere als kreativitätsfördernd ist - und das ist leider recht häufig der Fall - dann kannst Du in unsrem eLearning lernen, wie Du Dir die nötigen Freiräume in Deinem Unternehmen schaffen kannst, damit Kreativität eine faire Chance bekommt, sich auch in Deinem Unternehmen zu entwickeln - schon kleine Änderungen können einen großen Unterschied machen.</p><p>Bist Du bereit für diese Challenge? Bist Du bereit deine kreative Ader zu entdecken und diese zu fördern? Dann klicke jetzt auf den blauen Button und lass uns gemeinsam die Reise zu einem kreativeren Alltag starten. Damit helfen wir Deiner Kreativität, was Dir mehr Spaß und noch bessere Arbeitsergebnisse bescheren wird.</p>", 
    "end_date": null, 
    "title": "Kreativität im Business", 
    "price": "30.00", 
    "instructors": "Simon Sch.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857296_1997_3.jpg", 
    "course_url": "https://www.udemy.com/kreativitaet-im-business/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T08:37:52Z"
}