{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      If you want to make a difference, you have to adapt to the ever-changing world of work.  </p>  <p>  \t      But people don&#039;t like to change.  </p>  <p>  \t      So, how can you move your team through a transition, when fear of the unknown, resistance and all kind of emotions kick in?  </p>  <p>  \t      By preparing for those reactions; by trying to understand resistance instead of trying to break it down; by coaching your team and looking after yourself.  </p>  <p>  \t      This course guides you through some simple principles sprinkled with a bit of management theory to help you prepare a change plan that will move your team through change.  </p>  <p>  \t      It&#039;s not just the change period that&#039;s important, but making sure the results are sustained in the long-term.  </p>  <p>  \t      Each section consists of one short video lecture, perfect for watching over a cup of coffee. You can then use the supportive materials to go over the material as you create your action plan.  </p>  <p>  \t     The sections include:  </p>  <ul>  \t<li>A video presentation with action points, theory and moments of reflection to apply the learning to your particular situation. <br>  \t</li>  \t<li>A PDF document with the slides from the presentation.</li>  \t<li>A PDF transcript of the script.</li>  \t<li>The audio version of the lecture, in case you want to listen to it again in your MP3 player.</li>  </ul>", 
    "end_date": null, 
    "title": "Leadership and Change", 
    "price": "35.00", 
    "instructors": "Pilar Orti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121260_8b9d_2.jpg", 
    "course_url": "https://www.udemy.com/leadership-and-change/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-17T18:10:04Z"
}