{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Leadership is an essential life skill at home, at work, and in every stage of your career. If you're in charge of two or more people at work, this course could change your life.</strong></p>    <p>Leadership is often seen an elusive or complex skill, but with this practical course you'll soon have it mastered. Whether you're managing a small team or an entire business this course will build essential skills for your time management, team motivation, and personal happiness.</p>  <p>Chris Croft is an international speaker, and widely published author, who's been teaching Leadership Skills to companies for over 20 years. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p>    <p>This Leadership course covers everything you need to know from delegating and motivating, differing leadership styles, keeping your finger on the pulse, and planning the future of your business. It looks at lots of real life examples (some of which will definitely get you laughing) and gives practical tools you can use right away to get better results.</p>    <p>The course overview includes:</p>  <ul><li>What makes a great leader</li><li>How to motivate teams and personalise your approach</li><li>Which common mistakes will instantly crush your credibility</li><li>Creating the perfect balance of delegating and monitoring</li><li>Building confidence and skills into your employees</li><li>Key academic theories made practical</li><li>Why being replaceable is a good thing</li><li>And lots lots more!</li></ul>                <p>By becoming great at leadership, not only will you pave the way for future promotion, you'll also have a better work/life balance, and a much happier team. </p>", 
    "end_date": null, 
    "title": "Leadership: Practical Leadership Skills", 
    "price": "20.00", 
    "instructors": "Chris Croft, Louise Croft", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613808_3c1c_5.jpg", 
    "course_url": "https://www.udemy.com/practical-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T15:18:48Z"
}