{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Come on a journey to increase your leadership skills. <strong style=\"\">How to understand your brand</strong><strong style=\"\"> </strong>with Learoy Tonight will provide you with the skills and knowledge to become a great leader, for yourself and your team. <strong style=\"\"></strong></p><p style=\"\">A brand is potentially just the non-generic name for the source of a product. But, when people feel a strong relationship with a brand, it can become so much more. The brand describes the product!</p><p style=\"\">What you stand for and your value proposition is just as important as any other product. Think about a celebrity you admire – and one you don&#039;t. What people feel your brand represents and how you define our unique value proposition can define your career success.</p><p style=\"\">Each lecture in this course has been carefully selected for you to explore <strong style=\"\">how</strong> to implement relevant and meaningful strategies to support you as a leader now and in the future.</p><p style=\"\">This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support your team. </p><p style=\"\">Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be. </p><p style=\"\">This course will take you approximately 30 to 45 minutes to complete and will discover what you and your brand stand for. We will also work through building your personal brand and communicating it to others. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your leadership journey to understanding your brand. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p style=\"\">This course is a small section of our <strong style=\"\">Leadership-off the leash</strong> journey. If you would like to really challenge yourself, join us for the entire leadership experience.</p><p style=\"\">What are you waiting for? Start tonight, be on your way to becoming an amazing leader tomorrow.</p>", 
    "end_date": null, 
    "title": "Leadership | How to Understand your Brand ", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545168_bf22.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-understand-your-brand/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T02:48:21Z"
}