{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Come on a journey to increase your leadership skills. <strong style=\"\">How to Succeed through Direction</strong> with Learoy Tonight will provide you with the skills and knowledge to become a great leader, for yourself and your team.</p><p>Your organisation&#039;s mission, vision and values play key roles in cementing the direction and ultimate success of the business. When team members understand how their role fits into the bigger picture, they get a true sense of ownership and feel valued. This, in turn, leads to higher levels of performance and business success.<strong style=\"\"></strong></p><p>As a leader, you play a critical role in not only setting the direction of your organisation, but also in defining and communicating this to your team so that they know how their role fits into the bigger picture. Building a purpose focused culture is also about supporting social responsibility, and developing strategies to encourage positivity in the workplace.</p><p>Each lecture in this course has been carefully selected for you to explore <strong style=\"\">how</strong> to implement relevant and meaningful strategies to support you as a leader now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support your team. </p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be. </p><p>This course will take you approximately 30 to 45 minutes to complete and will cover what mission, vision and values are, the importance of a vision statement and how to craft one. We will also give you tips on leveraging your clarity on direction and behavior to drive your culture. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your leadership journey to achieving business success. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p> This course is a small section of our <strong style=\"\">Leadership-off the leash</strong> journey. If you would like to really challenge yourself, join us for the entire leadership experience.</p> What are you waiting for? Start tonight, be on your way to becoming an amazing leader tomorrow. <p></p>  ", 
    "end_date": null, 
    "title": "Leadership | How to Succeed through Direction", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528192_7167.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-succeed-through-direction/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T23:54:00Z"
}