{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Come on a journey to increase your leadership skills. <strong style=\"\">How to Lead Engagement</strong> with Learoy Tonight will provide you with the skills and knowledge to become a great leader, for yourself and your team.</p><p>To achieve engagement through your leadership, we&#039;ll start to really unpack the why&#039;s, what&#039;s and how&#039;s of workplace engagement and learn about the drivers of engagement in others. By exploring what this looks like you will be able to improve or sustain engagement in your team. </p><p>The most effective leaders have a strong sense of self – they understand their own emotions and positively direct their behaviour as the team needs. Through strong emotional intelligence, they also understand other people&#039;s moods and behaviors to identify the cause, and manage interactions successfully. </p><p>These are the qualities that make other people want to go on the journey with them and they know how to adjust those qualities when circumstances require them to do so. The most effective leaders are those who know their own strengths and limitations, create and effectively communicate a positive realistic vision and motivate and inspire their team to reach their true potential. </p><p>Each lecture in this course has been carefully selected for you to explore <strong style=\"\">how</strong> to implement relevant and meaningful strategies to support you as a leader now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support your team. </p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be. </p><p>This course will take you approximately 30 to 45 minutes to complete and will cover how you as a leader can drive engagement, understand when your team are engaged, why it will equal better business and know how to tell when your team are engaged or dis-engaged. We will also focus on you, and help you build your own Emotional Intelligence to support developing engagement within your team. Our content will give you the opportunity to hear from experts and understand relevant models for you to use on your leadership journey to achieving workplace engagement. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our Leadership-off the leash journey. If you would like to really challenge yourself, join us for the entire leadership experience.</p> What are you waiting for? Start tonight, be on your way to becoming an amazing leader tomorrow.", 
    "end_date": null, 
    "title": "Leadership | How to Lead to Engagement", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/524862_2373.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-lead-engagement/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-10T05:48:24Z"
}