{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t   Have you ever felt that there was an invisible ceiling above your success?  </p>  <p>  \t   Or, are you ready to <strong style=\"\">get to the next level</strong> of your business, and want a roadmap to show you how to get there?  </p>  <p>  \t    This class is the answer to every one of these questions and more...  </p>  <p>  \t<strong style=\"\">What Separates Top Income Earners From Everyone Else?</strong>  </p>  <p>  \t    Did you know that the biggest thing that separates successful people from those that are not, is one thing...Leadership.  </p>  <p>  \t    Leadership also determines how much income you will make.  The better of a leader you are the more zeros you end up with at the end of your paycheck.  </p>  <p>  \t    This class will teach you everything you need to learn about the <strong style=\"\">secrets of top income earners</strong>, and why they continue to have <strong style=\"\">massive success</strong> in their lives and businesses.  </p>  <p>  \t    In this class you will learn:  </p>  <ul style=\"\">  \t<li>How To Overcome the Greatest Obstacles to Your Success</li>  \t<li>How to <strong style=\"\">Maximize Your Potential</strong> By Maximizing Your Time</li>  \t<li>3 Ways to Accomplish the Most Valuable Things in Your Business</li>  \t<li>How To <strong style=\"\">Get Things Done</strong> While Other People Fail</li>  \t<li>How to <strong style=\"\">Maximize Your Efforts</strong> By Upgrading Your Peer Group</li>  \t<li>How to <strong style=\"\">Become an Expert</strong> at The Most Valuable Thing - Leadership!</li>  \t<li>How to Make Decisions That Really Count So You Can <strong style=\"\">Make A Lot More Money</strong></li>  \t<li>How to Maximize Yourself Through Continual Improvement</li>  \t<li>Learn to Create an Environment That Makes it <strong style=\"\">Impossible To Fail</strong></li>  \t<li>How to <strong style=\"\">Supercharge Your Results</strong> by Maximizing Your Talents</li>  \t<li>And much, much more...</li>  </ul>  <p>  \t    If you are ready to break through the ceiling that is holding you back, or if you are ready to <strong style=\"\">get to the next level in your success</strong> - then this class is for you.  </p>  <p>  \t    Sign up for this class and prepare for an incredible leadership journey!  </p>", 
    "end_date": null, 
    "title": "Leadership - The #1 Key to Guaranteed Business Success", 
    "price": 0, 
    "instructors": "William U. Peña, MBA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170844_e6ff_3.jpg", 
    "course_url": "https://www.udemy.com/learn-the-leadership-secrets-of-top-income-earners/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-22T07:48:26Z"
}