{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Being a leader is easy, the hard part is getting people to follow. This witticism hits home with today&#039;s leaders who are trying to cope with a constantly changing world where the very essence of being a leader is being questioned.</p><p style=\"\">Gone are the days when a leader could get away by saying it is my way or the highway. Today, to be a true leader, one needs to be able to use social influence and flex one&#039;s leadership style with diverse sets of people to get things done. </p><p style=\"\">In this course, you will learn how to lead a team of diverse individuals to achieve targets, using an award winning software simulation game called <strong style=\"\">iLead</strong>. You might ask &quot;how can I learn leadership using a game?&quot;. The ex-CIO of Starbucks, Stephen Gillett was in his early 30s when he became the CIO of Starbucks. When asked about where he picked up his leadership skills from, he said that he learned the art and science of it from a massively online multiplayer game called &quot;World of Warcraft&quot;. Games allow you to learn new behaviors and help apply them in real-life. That&#039;s exactly what we will do in this course using the iLead simulation game.</p><p style=\"\">You will learn what leadership styles are and how to flex styles with a variety of team members to help them achieve their true potential.</p><p>This course will roughly take around 2 hours. With 1 hour of Video lessons and 1 hour of Business Simulation<strong style=\"\"> iLead.</strong></p><p><strong style=\"\">Lead on !<br style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Leadership Styles For Team Effectiveness - iLead game", 
    "price": "50.00", 
    "instructors": "Rajiv  Jayaraman", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476946_e76e_8.jpg", 
    "course_url": "https://www.udemy.com/leadership-styles-for-team-effectiveness/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-15T10:21:39Z"
}