{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Come on a journey to increase your leadership skills. <strong style=\"\">How to commit to self-discovery</strong> with Learoy Tonight will provide you with the skills and knowledge to become a great leader, for yourself and your team.</p><p>Ok so you&#039;re here. You&#039;ve signed on the dotted line and made your commitment. Now where do you start? Let&#039;s work first on what others are looking for in you. The key behaviours and attitudes of an authentic style of leadership, and the impact on business results. What attributes make a leader great? Where should you build competency, and how you can do this through your personal character? </p><p>Your journey to leadership is about becoming a self-actualised individual who is aware of their strengths, limitations and emotions. This can only come when we commit to self-discovery, asking ourselves what we&#039;re about and how we can use that to help others be the best version of themselves. In doing this, they will see us for what we are – a person who others want to follow. We will also identify the fatal flaws that might completely derail your leadership journey, if you don&#039;t know to watch out for them.</p><p>Each lecture in this course has been carefully selected for you to explore <strong style=\"\">how</strong> to implement relevant and meaningful strategies to support you as a leader now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support your team. </p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be. </p><p>This course will take you approximately 30 to 45 minutes to complete and will cover what makes an authentic leader and what it looks like in action. We will work through leadership strengths and components of authentic leadership, and provide a profile for behaviour to model. We will also explain the fatal flaws that derail leaders, so that you can identify them and know how to stop you from happening to you on your leadership journey. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your leadership journey to achieving self-discovery. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our <strong style=\"\">Leadership-off the leash</strong> journey. If you would like to really challenge yourself, join us for the entire leadership experience.</p> What are you waiting for? Start tonight, be on your way to becoming an amazing leader tomorrow.", 
    "end_date": null, 
    "title": "Leadership | How to Commit to Self-Discovery", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543984_54d4_2.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-commit-to-self-discovery/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-03T11:09:26Z"
}