{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Aside from adapting to a new role with increased responsibilities, new managers must learn to be leaders and explore how to communicate effectively with employees, fellow managers, and senior executives. Learn everything you need to know as a new manager to lead a team effectively, coach with confidence and make better decisions, in this comprehensive course bundle.  </p>  <p>  \t<strong>Master Strategies for Effective Leadership as a New Manager</strong>  </p>  <ul>  \t<li>Lead by setting an example and become more confident and influential in the process.</li>  \t<li>Communicate effectively with your colleagues and senior managers.</li>  \t<li>Motivate your staff to encourage personal and professional development.</li>  </ul>  <p>  \t  In this course you will learn that management isn't always so much about leading, as it is about pointing the way. It is your duty to point the way by instructing, giving feedback and sharing your experience with your staff. In this course, you will learn how to develop leadership skills to confidently coach a team. Further, you will master the arts of successfully facilitating meetings, appraising performance, providing feedback and resolving conflicts within your team and organization.  </p>  <p>  \t<strong>At the end of this course, you will be able to confidently lead a team through day-to-day operations, interpersonal challenges and crisis situations.</strong>  </p>  <p>  \t  This course is a bundle of the following LearnSmart courses, and includes comprehensive information for the following topics:  </p>  <ul>  \t<li>Introduction to Management</li>  \t<li>Developing Leadership and Transitioning into Management</li>  \t<li>Leading and Communicating as a Manager</li>  \t<li>Facilitating Meetings and Groups</li>  \t<li>Appraising Performance</li>  \t<li>Coaching with Confidence</li>  \t<li>Effective Delegation</li>  \t<li>Fundamentals of Business Crisis Management</li>  \t<li>Successful Communication and Process Management Skills</li>  \t<li>Taking Control as a Manager</li>  \t<li>Making an Impact as a Manager</li>  </ul>", 
    "end_date": null, 
    "title": "Leadership: Foundational Training for First Time Managers", 
    "price": "25.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357898_76d9_5.jpg", 
    "course_url": "https://www.udemy.com/leadership-ultimate-training-for-first-time-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T17:21:03Z"
}