{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t  Aside from adapting to a new role with increased responsibilities, new managers must learn to be leaders and explore how to communicate effectively with technical employees, fellow managers, and senior executives. Learn everything you need to know as a new manager to assist the technical professionals you manage in reaching and exceeding their goals, in this comprehensive course bundle.  </p>  <p>  \t  <strong>Master Strategies for Effective Management of Technical Professionals</strong>  </p>  <ul>  </ul>  <ul>  \t<li>Lead by setting an example and become more confident and influential in the process.</li>  \t<li>Communicate effectively with your colleagues and senior managers.</li>  \t<li>Motivate your staff to encourage personal and professional development.</li>  </ul>  <p>  \t  In this course you will learn that management isn't always so much about leading, as it is about pointing the way. It is your duty to point the way by instructing, giving feedback and sharing your experience with your staff. In this course, you will learn how to develop leadership skills to confidently coach a team of technical professionals. Keeping these dedicated employees motivated in high-tech business environments will help support their professional growth, as well as your company's strategic objectives.  </p>  <p>  \t  At the end of this course, you will be able to confidently lead and guide a team of technical professionals through day-to-day operations, interpersonal challenges and crisis situations.  </p>  <p>  \t  This course is a bundle of the following LearnSmart courses, and includes comprehensive information for the following topics:  </p>  <ul>  \t<li>Introduction to Management</li>  \t<li>Developing Leadership and Transitioning into Management</li>  \t<li>Leading and Communicating as a Manager</li>  \t<li>Successful Communication and Process Management Skills</li>  \t<li>Taking Control as a Manager</li>  \t<li>Making an Impact as a Manager</li>  \t<li>Managing Technical Professionals</li>  \t<li>Managing the Development of Technical Professionals</li>  </ul>", 
    "end_date": null, 
    "title": "Leadership: New Manager Training for Technical Professionals", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/405440_9702_4.jpg", 
    "course_url": "https://www.udemy.com/leadership-new-manager-training-for-technical-professionals/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T17:19:02Z"
}