{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>In today's collaborative, fast, and practical business environment, leadership can mean taking an action on a new idea, or coming up with a more effective and efficient way to reach your goals...etc In the 21<sup>st</sup> century, leadership is not just a top-down management. Leadership takes place at every level of every company or social group — from top down to bottom up.</p><p>Managing day-to-day duties and achieving key goals can be quite a challenge, especially when working with professionals who don't report to you. To succeed, leaders need to find new ways to influence, persuade, collaborate and get buy-in for their vision and goals</p><p>To explore these emerging concepts of business leadership, eSoft Skills offers Leadership and Influence, a course focused on developing the management and interpersonal tools that you can use to join forces with and motivate others toward a common goal.<br></p><p> <strong>Learning Objectives:</strong> </p> <ul> <li>Understand what “leadership\" means</li><li>Explore the Great Man Theory</li><li> Explore the Trait Theory</li><li>  Learn about Transformational Leadership</li><li> Learn how to adapt your leadership styles to the individuals you lead</li><li> Explore the concept of leading by Directing</li><li>Explore the concept of leading by Participating</li><li>Explore the concept of leading by Delegating</li><li>Understand Kouzes and Posner</li><li> Conduct a personal inventory</li><li> Implement an action plan</li><li>Set Personal Goals</li></ul>", 
    "end_date": null, 
    "title": "Leadership & Influence Skills", 
    "price": "30.00", 
    "instructors": "Adam Karchoufa", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615950_b941.jpg", 
    "course_url": "https://www.udemy.com/leadership-influence-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-18T16:19:40Z"
}