{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">Skilled and disciplined leaders are not necessary innovators; on the other hand the innovative leader may be very unconventional and poorly skilled in daily management. Committed top executives establish a competitive edge by balancing between the possible and the probable, failure and success, internal drive and external forces, the inner sense of originality and customers’ needs, and placing people and products into innovative strategy models. Innovative leadership skills can be acquired in customer driven process management, innovative information and change management, obstacles removal and focus on continuous improvement.</span>  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p style=\"\">  \t1. Diference between management and leadership  </p>  <p style=\"\">  \t2. 10 competencies of a good leader  </p>  <p style=\"\">  \t3. Styles of leadership  </p>  <p style=\"\">  \t4. Situational leadership – Tannenbaum and Schmidt  </p>  <p style=\"\">  \t5. Model for constructive feedback  </p>  <p style=\"\">  \t6. Dealing with agression (angry customer, colleague, boss, etc.)  </p>  <p style=\"\">  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">A few word about the author of this course:</strong>  </p>  <p style=\"\">  \tTania Ayerst has over 20 years of experience in Management Consulting and over 15 years in the area of People Management and Development. Her expertise includes Strategic Management, Agile/Lean management, Strategic Human Capital Management, Customer Relations, Organizational Culture Change, Employee Engagement, Performance Management, Competency Modelling, Total Rewards Management, Learning and Development, Talent Management, HR Transformation, etc.  </p>  <p style=\"\">  \tShe help companies re-think and re-design their culture and organization using NEO-MANAGEMENT. This is a group of new management methods, based on new paradigm. It is better suited to the contemporary hyper-competitive, totaly connected market.  </p>  <p style=\"\">  \tTania Ayerst has a Master’s Degree in Human Resources Management and Development from WAC University, USA. She also holds a Diploma in Management Studies from the Open University, UK as well as a specialization in People and Organizational Management Management from AOTS, Yokohama, Japan.  </p>  <p style=\"\">  \tShe is Certified Management Consultant (CMC) by the Institute of Consulting in London according to the standards of the International Council of Management Consulting Institutes (ICMCI).  </p>", 
    "end_date": null, 
    "title": "Leadership", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413910_49ba_3.jpg", 
    "course_url": "https://www.udemy.com/leadership11/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T08:10:15Z"
}