{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course will help you develop arguments that get through the barriers people often put in the way. You will increase your success at getting others to follow your lead.</p><p><strong>Create arguments that have a greater rate of success by applying the principles in this course.</strong><br></p><ul><li>Learn how people react to arguments (it is not what you may think).</li><li>Learn the elements of a more successful argument.</li><li>Deconstruct arguments you have used to figure out what worked, what did not, and why.</li><li>Create arguments that cut through people's barriers.</li></ul><p><strong>Leading Others Gets Results</strong></p><p>Leading others (instead of ordering) produces long term, positive results. The key to leading others requires understanding how people react to the arguments we use. Once we understand how people react, we can create arguments that are often successful.</p><p>This course you will learn the principles behind how people react to arguments, and you will apply these principles to arguments you have used in the past—both successful and unsuccessful. Finally, you use what you have learned to create new, more powerful arguments to lead others.</p><p><strong>Content and Overview</strong><br></p><p>Useful for adults of any age or experience, this course contains 25 lectures, 14 quizzes, and 6 activities to help you learn, understand, and apply the parts of a successful argument. You will learn by doing including reviewing arguments you have used to identify if they had the parts that make an argument more successful.</p><p>First, you will learn the ABCs of people. The A(ffective)B(ehavioral)C(ognitive)s form the basis for building our arguments. Second, you will learn when to lead and when to order (spoiler alert: this course will focus on leading). Third, you will identify who may be a blocker to your argument and why. Sometimes, you may be the blocker! Fourth, you will learn about the power behind a concrete (real) argument that is situated (placed in their reality) versus the weakness of an abstract (theoretical) argument. Fifth, you will place the elements of the argument in the most effective order. Sixth, you will construct an affective, concrete, and situated argument that also addresses the cognitive part of the argument. Seventh, you will put what you have learned into practice.</p><p>This course is about learning, doing, and then getting positive results leading people with effective arguments. </p><p>The course videos are captioned in English.</p>", 
    "end_date": null, 
    "title": "Leading Peers (or anyone else)", 
    "price": "20.00", 
    "instructors": "Bruce D. Reeves", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623684_9eed_3.jpg", 
    "course_url": "https://www.udemy.com/leading-peers-or-anyone-else/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-27T12:20:29Z"
}