{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t   Are you frustrated about organizational change? Do you want to improve your skills as a consultant or a manager? Does your organization need change to succeed this time? What would it be like if you could really make a difference....?  </p>  <p style=\"\">  \t <strong style=\"\">  Enroll now to learn how!</strong> &quot;Leading Successful Change&quot; offers you 5 inspirational and insightful lectures stuffed with real cases and examples that you can utilize right away! The videos were recorded during the 3-day workshop we do twice a year - in front of an audience which makes them lively and interesting.  </p>  <p style=\"\">  \t   Based on the book “Organizational Culture Change: Unleash your Organization’s Potential in Circles of 10”, author, consultant and trainer Marcella Bremer will guide you through the <strong style=\"\">“Change Circles of 10”-approach of successful change</strong>. This approach:  </p>  <ul style=\"\">  \t<li style=\"\">includes everyone in Change Circles,</li>  \t<li style=\"\">engages and empowers people to</li>  \t<li style=\"\">co-create the change that will work for them.</li>  </ul>  <p style=\"\">  \t   You learn to build trust, dialogue and engagement, while you focus on specific behaviors and on what is working well. Learn to guide change and develop your coworkers and your organization into <strong style=\"\">a great place to work</strong>: ready for change and future proof!  </p>  <p style=\"\">  \t   We&#039;ve got 4 hours of video lectures based on the latest theories and practices:  </p>  <p style=\"\">  \t   * Why does Organizational Change often fail - and how does it succeed?  </p>  <p style=\"\">  \t   * What is Organizational Culture and why does it matter in Change?  </p>  <p style=\"\">  \t   * How to use the Competing Values Framework in Change?  </p>  <p style=\"\">  \t   * How to guide Change in Change Circles?  </p>  <p style=\"\">  \t   * How to utilize Viral Change and Positive Leadership?  </p>  <p style=\"\">  \t   * How to focus on personal behaviors and support in the Change Circle?  </p>  <p style=\"\">  \tLast but not least, we offer our latest Webinar on Leading Change with Culture. This gives you a nice overview of Leading Change in 1,5 hours.  </p>  <p style=\"\">  \t <strong style=\"\">Enroll today to make a difference to your (client&#039;s) organization, too! Learn how to lead successful change.</strong>  </p>", 
    "end_date": null, 
    "title": "Leading Successful Change", 
    "price": "50.00", 
    "instructors": "Marcella Bremer", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102918_5e76_6.jpg", 
    "course_url": "https://www.udemy.com/leading-successful-change/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-08T06:42:48Z"
}