{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Come on a journey to increase your leadership skills. <strong>How to create their 'walk in the door' moments</strong> with Learoy Tonight will provide you with the skills and knowledge to become a great leader, for yourself and your team.</p><p>Why do you walk in the door every day? Leading a positive work environment is all about creating and maintaining a space that inspires and motivates team members to higher levels of performance and commitment. Make them want to be there!<strong></strong></p><p>Creating a positive work environment needs to support teams in the modern world. When we're 'switched on' 24/7, well-being becomes about more than just a winter flu shot and tea and coffee in the break room. Leaders now need to cultivate an environment that taps into the individual and team needs in a range of ways.</p><p>This investment in teams pays off in productivity. The happier our teams are, the more they do. The happier they are because of us, the more they do for us. Not only that, but the happier they are, the nicer it is for everyone to be around each other, breeding positivity from within so that the team creates what they expect. At this stage, you have a truly sustainable, positive work environment.</p><p>Each lecture in this course has been carefully selected for you to explore <strong>how</strong> to implement relevant and meaningful strategies to support you as a leader now and in the future.</p><p>This course will provide you with many tips and tricks you can utilize inside and out of your workplace, it will encourage and motivate you to really understand and support your team. </p><p>Learoy Tonight is a fresh business with interesting and modern ideas towards education. Many people take part in creating these courses – from subject matter experts, to researchers and designers – to ensure you are provided with the best learning experience and the most up to date information. We are excited about education and want to give you the opportunity to be the best you can be. </p><p>This course will take you approximately 30 to 45 minutes to complete and will cover what well-being in the workplace is and how to create a culture of well-being. We will work through creating productivity and what a results only work environment is and give you tips on how to lead a positive work environment. Our content will give you the opportunity to listen to experts and understand relevant models for you to use on your leadership journey to creating their 'walk in the door' moments. This will be an experience to enjoy with a collection of videos, interviews and engaging imagery throughout our presentations.</p><p>This course is a small section of our <strong>Leadership-off the leash</strong> journey. If you would like to really challenge yourself, join us for the entire leadership experience.</p> What are you waiting for? Start tonight, be on your way to becoming an amazing leader tomorrow.", 
    "end_date": null, 
    "title": "Leadership | How to Create their ‘Walk in the Door’ Moments", 
    "price": "30.00", 
    "instructors": "Learoy Tonight", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528282_1ae9.jpg", 
    "course_url": "https://www.udemy.com/leadership-how-to-create-their-walk-in-the-door-moments/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T03:10:24Z"
}