{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to <strong></strong><strong>Leading and Communicating as a Manager</strong><strong> </strong>from LearnSmart.</p><p>LearnSmart is <strong>Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the <strong>Professional Development Unit (PDU) </strong>requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p>If you're interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong>1.0</strong><strong>0 PDU</strong> credit hours toward your PMP® certification from PMI.</p><p><strong>Course Overview:</strong></p>Aside from adapting to a new role with increased responsibilities, new managers must learn to be leaders and explore how to communicate effectively with employees, fellow managers, and senior executives. To train in these areas, you will learn the five primary leadership roles that managers serve in business. Then, you'll go through discussions about leading teams concentrating on how to lead them, about how to know when your team is being effective, and about the different stages of team development. Next, you'll look at effective delegation. You'll also examine Maslow's hierarchy and consider how that relates to an individual's performance and behavior. Finally, you'll study how communication works and principles for chairing a meeting.<p><br><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlili</em></li><li><em>Excellent class! -- I already have my PMP, but wish I had this class as a study tool prior to taking the test. I am confident that a person who studies the materials presented in this course should have no problem with the exam. I took the class for the PDUs to keep my certification up. On completion of the class I followed the instructions, and had no problem registering the credits with PMI -- Robert Vroom</em></li></ul>", 
    "end_date": null, 
    "title": "Leading and Communicating as a Manager", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332978_c990_3.jpg", 
    "course_url": "https://www.udemy.com/leading-and-communicating-as-a-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T20:46:50Z"
}