{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>BECOME A THOUGHT LEADER IN THE MOVEMENT THAT IS CHANGING HOW CORPORATIONS INNOVATE.</strong><br></p><p><strong>23 LECTURES, 7 IN-DEPTH COMPREHENSION TESTS.</strong></p><p><strong></strong><strong>THE ONLY CERTIFICATION FOR APPLYING LEAN STARTUP TECHNIQUES IN AN ENTERPRISE ENVIRONMENT. FROM THE AUTHOR OF THE BEST SELLING BOOK, THE LEAN ENTERPRISE.</strong></p><p>Even in a tough economic climate, small startups have found ways to create innovative products in shockingly short timeframes. So why should larger, more established companies take notice? Because they have everything to gain when they examine and adopt the process, strategies, and mentality of high-growth startups. In this course you will learn the tools and methodologies large businesses need to compete with a new generation of highly-empowered startups.</p><ol><li>Essential course for innovation managers, directors, senior executives, and even board members of Fortune 2000 companies</li><li>Explains the forces that stall innovation in large enterprises</li><li>Offers a comprehensive approach for structuring innovation teams and maximizing the odds of success</li><li>Includes quizzes designed to maximize understanding of difficult concepts</li></ol><p>Don't be mystified by the success of startups. Master the methods of this new era and compete on a level playing field.</p><p><strong>PRAISE FOR THE LEAN ENTERPRISE</strong></p><p>\"The Lean Enterprise presents a framework for companies to create an environment that empowers the greatest entrepreneurial talent to thrive inside the organization, retaining the great innovative minds and reaping the benefits of their greatest inventions.\"</p><p><strong>- Brad Smith, Intuit President &amp; CEO</strong></p><p>\"The Lean Enterprise provides savvy insights on the organizational structures, systems, and processes that will maximize success odds with corporate entrepreneurship.\"</p><p><strong>- Professor Thomas Eisenmann, Harvard Business School</strong></p><p><strong>IMPORTANT!</strong></p><p>For successful completion of this course, it's recommended you read the book, <em>The Lean Enterprise: How Corporations Can Innovate Like Startups</em>.</p>", 
    "end_date": null, 
    "title": "Lean Enterprise: Corporate Innovation Certification", 
    "price": "45.00", 
    "instructors": "Trevor Owens, Michael Gold", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466334_2676_14.jpg", 
    "course_url": "https://www.udemy.com/lean-enterprise-corporate-innovation-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T01:46:02Z"
}