{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<ul><li>Over 10,000 students in my courses!</li><li>Over 300 5-star reviews in my courses!</li><li>This course updated in February 2016</li></ul><p><strong><u>Earn PDU's:</u></strong><strong> </strong><strong>Students who complete this course are eligible to receive 2.75 PDU's in PMI continuing education credits. Instructions for claiming PDU's are provided with the last lesson in the course.</strong></p><p><strong><u>Money-back Guaranty:</u></strong><strong> </strong><strong>Try this course and if you are not satisfied with the value you received from the course, just send an email to Udemy support and they will give you a 100% refund within 30 days.</strong></p><p><span>\n\n<strong><u>Course Summary:</u></strong>\n\n<br></span></p><p>Learn how to develop a high-impact Agile Project Management approach that is well-integrated with your business environment!</p><p>In many areas, “Agile\" is becoming a hot new buzz word and everyone wants to jump on the “Agile bandwagon\" without necessarily fully understanding why they're getting into it and exactly what they expect to get out of it. Many companies also make the mistake of assuming that whatever is good for the development process is good for the business as a whole and that is not necessarily the case.</p><p>While Agile has huge potential benefits for a business, it's important to not get carried away with some of the hype that exists about Agile and develop an objective understanding of its benefits and limitations to know how and when to apply it successfully. The right approach is to not necessarily to just implement Agile for the sake of becoming Agile; but figure out how it's going to help your business and what problems it will solve. The typical questions and challenges this poses for business managers and executives are:</p><ul><li>How do I reconcile an Agile development approach with my existing business management and project management processes?</li><li>Do I need to unravel all of my existing management processes in order to adopt an Agile development approach?</li></ul><p>This course will help you answer those questions and includes assessment tools and planning tools to help you develop a very effective Agile Project Management approach that is very well-aligned with your business.</p>", 
    "end_date": null, 
    "title": "Making Agile Work for Your Business for Business Managers", 
    "price": "50.00", 
    "instructors": "Chuck Cobb", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321770_8f69_7.jpg", 
    "course_url": "https://www.udemy.com/agile-project-management-overview-for-executives/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T19:56:30Z"
}