{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>When three bricklayers were asked what they were doing, each replied differently. One said he was earning his livelihood, the other said he was perfecting the art of bricklaying whereas the third fellow said he was building a castle. They are respectively the ordinary worker, the skilled worker and the manager, says Peter Drucker.</p><p><b>Management For The New Managers</b> will show you the difference between a worker and a manager, it will help you in making a smooth transition, it will show you what skills are required to become a successful manager. </p><p><b>What are the requirements?</b></p><p>Anyone interested in learning the basic management skills.</p><p><b>Course Content and Overview:</b></p><p>This course contains 31 lectures with 7 case studies and is designed for anyone who needs to have a basic knowledge about management. In this course you will learn about what is management, difference between efficiency and effectiveness, 7 steps on how to make the transition, the management functions of planning, organizing, leading, implementing, controlling and evaluating, 6 steps to rational decision making, 7 steps to innovation and 5 steps to change management.</p><p><b>What I am going to get from this course?</b></p><p>By end of the program you will be able to make a smooth transition from a worker to a manager, understand and perform basic management functions efficiently and effectively, deal with the information overload, develop the skill for rational decision making, understand why innovation and change matters and know what it takes to become a successful manager and where you stand!</p><p><b>What is the target audience?</b></p><p>This Basic Management course is for the new managers, first line managers, business owners, self-employed persons and even students studying management who want to acquire fundamental knowledge and skills on general management. Middle managers looking for a quick refresher on some fundamental management concepts and skills can also benefit from this. No formal knowledge is needed. This course is probably not for you if you're looking to learn advanced management concepts in a particular discipline.</p><p>If you have been just promoted to a management or supervisory position and don't know anything about management, then this program is a must for you!</p>", 
    "end_date": null, 
    "title": "Management For The New Managers", 
    "price": "20.00", 
    "instructors": "Dr. Jeelani S. F.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413464_4b9c.jpg", 
    "course_url": "https://www.udemy.com/management-for-the-new-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T19:38:27Z"
}