{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>~~~Over 1,370 students enrolled in my courses.~~~ (Updated as of June 2016)</strong></p>\n\n<p><strong>~~~See why and how my videos helped over 110,000 students---</strong></p>\n\n<p><strong>~~~Learn everything about Managerial Accounting in less than 4 hours.~~~</strong></p>\n\n\n\n\n\n<p>I believe that you should not fall asleep when learning something new. You need to be encouraged and excited instead. In order to be excited about learning, you need to understand easily. If you struggle to understand, of course you will fall asleep. I have implemented a new way of teaching. Animated videos which are easy to understand. Problem solving videos that teach you how to apply what you have learned. Learning has never been so exciting.</p>\n\n\n\n\n\n<p>In this course you will find great tools used in business that will aid the decision-making process. You will be able to identify and use important accounting information, identify and analyze various alternatives (projects, investments), and choose the best.</p>\n\n\n\n\n\n<p>  \t  In this course you will find everything explained with a video lecture. There are 2 types of video lectures. The first type is an animated (cartoon) video that breaks down the most difficult concepts used in business. The second type is a problem solving shared screen that will help you with the calculations and analysis, as well as your thinking process.  </p>\n\n\n\n\n\n<p>  \t  Depending on your commitment, this course can take you somewhere from a week to few weeks to complete. The curriculum is designed as such, so that you will retain the information you will receive.  </p>\n\n\n\n\n\n<p>  \t  Whether you are a business owner, manager, or a student, you will need this course. This course will provide you with great tools that will make your decisions much more informative and calculated.  </p>", 
    "end_date": null, 
    "title": "Managerial Accounting: Easily ace the course!", 
    "price": "50.00", 
    "instructors": "Stefan Ignatovski", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378398_cc91_2.jpg", 
    "course_url": "https://www.udemy.com/managementaccounting/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T07:15:14Z"
}