{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This Management 101 course will teach you everything you need to know to be a great boss. It covers a huge spectrum of subjects with quick, practical, bite size tips. You&#039;ll learn everything from Leadership to Time Management to Selling, and much much more. </p><p style=\"\">Chris Croft is an international speaker and widely published author, who&#039;s been teaching Negotiating skills to companies for over 20 years. He&#039;s taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p><p style=\"\">This course is carefully curated from all Chris&#039; experiences to ensure it covers everything you need to know, whether you&#039;re an existing or aspiring manager. You&#039;ll be given practical tools you can use right away to get better results, and in every subject you&#039;ll need.</p><p style=\"\">The course overview includes:</p><ul style=\"\"><li style=\"\">Negotiating to save yourself both money and time</li><li style=\"\">Selling to customers to ensure they&#039;re happy and keep coming back for more</li><li style=\"\">Using Assertiveness to get a great deal, without being aggressive or disliked</li><li style=\"\">Managing people to motivate and inspire them</li><li style=\"\">Mastering Time Management to get the most from you life at home and at work</li><li style=\"\">Becoming an effective Leader to ensure continual promotions</li><li style=\"\">Creating and delivering amazing Presentations that captivate your audience</li><li style=\"\">Running Projects on time and on budget consistently</li><li style=\"\">And lots lots more!</li></ul>", 
    "end_date": null, 
    "title": "Management - Leadership, Negotiating, Assertiveness, Sales", 
    "price": "20.00", 
    "instructors": "Chris Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474246_17d8.jpg", 
    "course_url": "https://www.udemy.com/management-101/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T17:13:44Z"
}