{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to<strong> </strong><strong>Managing People: Address and Respond to Performance Issues </strong>from LearnSmart.</p><p>LearnSmart is <strong>Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the <strong>Professional Development Unit (PDU) </strong>requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p>If you're interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong>1.5</strong><strong>0 PDU</strong> credit hours toward your PMP® certification from PMI.</p><p><strong>Course Overview:</strong></p><p>The most important tool a supervisor can use in addressing performance problems is feedback and counseling. Counseling can be used to get to the root of why employees are unable to meet performance expectations. Another tool that will assist you is a Performance Improvement Plan. Learn how to use these tools to effectively address performance problems and improve workplace performance.<br><br>Disciplining employees is the final phase in addressing performance issues. You will study the elements of an effective disciplinary policy, the role of warnings, and steps taken to formally discipline an employee. You’ll also look at the impact of mishandling discipline, particularly the implications it has on the employee-manager relationship.</p><p><em>This course is a bundle of the following LearnSmart courses:<br></em></p><ul><li>Feedback and Counseling</li><li>Effectively Disciplining Problem Performance<br></li></ul><p><strong>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlili</em></li><li><em>Excellent class! -- I already have my PMP, but wish I had this class as a study tool prior to taking the test. I am confident that a person who studies the materials presented in this course should have no problem with the exam. I took the class for the PDUs to keep my certification up. On completion of the class I followed the instructions, and had no problem registering the credits with PMI -- Robert Vroom</em></li></ul>", 
    "end_date": null, 
    "title": "Managing People: Address and Respond to Performance Issues", 
    "price": "40.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357452_f5d2_2.jpg", 
    "course_url": "https://www.udemy.com/managing-people-address-and-respond-to-performance-issues/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T00:06:37Z"
}