{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Looking at a company through the lens of sustainability can help identify opportunities to drive business value and reduce risk. In this module you will learn key tools to baseline sustainability efforts and better manage performance in the future. <strong style=\"\"></strong></p><p>In this course we&#039;re going to talk about this session some key tools that will help you get a baseline of your sustainability performance so you can help manage for sustainability going forward, including sustainability SWOT, GAP analysis and carbon footprinting, or a &quot;greenhouse gas inventory&quot;. </p><p>We&#039;re also going to talk about a case study where by doing so, you&#039;re actually see the triple bottom line benefits and we want you to go into this module truly understanding with your eyes open that you&#039;re going to run into some obstacles. It&#039;s not going to be sweet roses. It is going to be difficult work. You need to be prepared for it, but you also need to be able to understand that you&#039;re going to be a little stealthy and covert in how you get things done. So when you are finished with this module, you&#039;re going to have a better understanding of how you&#039;re going to manage for sustainability.</p><p>By looking at your business through the lens of sustainability and identifying where those strengths, weaknesses, threats and opportunities are, by looking at your gaps from a sustainability standpoint and by doing a carbon footprint, you are going to be looking at your business from a risk and opportunity perspective in a new way in ways to drive business value, brand value, and identify new opportunities for top line revenue production. </p><p>By the end of the module, you should be able to answer these questions:</p><ul style=\"\"><li>What are risks and hotspots associated with business decisions around sustainability?</li> <li>How do I calculate a carbon footprint (GHG inventory)?</li> <li>What metrics do I need to help guide my organization&#039;s business decisions around sustainability?</li></ul>", 
    "end_date": null, 
    "title": "Managing for Sustainability", 
    "price": "30.00", 
    "instructors": "Kevin Wilhelm", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/532436_8259.jpg", 
    "course_url": "https://www.udemy.com/managing-for-sustainability/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T19:17:51Z"
}