{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Activezi într-un ONG sau ești pasionat de sectorul nonprofit? Atunci te numeri printre cei care schimbă lumea în bine în fiecare zi, puțin câte puțin. Ai o pasiune puternică pentru cauza în care crezi și vrei să o transformi în realitate prin organizația ta nonprofit!</p><p>Dar cum faci ca ONG-ul tău să fie acolo și peste 10 ani? Cum te asiguri că dacă tu pleci din organizație, ea va continua să se dezvolte? Cum poți să-ți dezvolți organizația pentru a avea un impact mai mare, sustenabil? Cum îți poți eficientiza activitatea?</p><p>Ei bine, noi în cadrul <strong>Centrului pentru Managementul Organizațiilor Nonprofit </strong>credem că <em><strong>#eTimpulPentruSustenabilizare</strong></em>, astfel că te invităm la primul curs online dedicat managementului ONG-urilor din România! Îți propunem un curs adaptat la nevoile locale, plin de resurse care te vor sprijini în eficientizarea și sustenabilizarea organizației tale. </p><p>În cadrul modulelor, îți propunem o varietate de resurse:</p><ul><li>Video-uri</li><li>Studii de caz</li><li>Teme de reflecție</li><li>Interviuri cu experți din sectorul ONG</li><li>Materiale</li><li>Assignment-uri structurate</li></ul><p><br></p><p>Instructorii tăi de la acest curs sunt <strong>Ana-Maria Stancu</strong> (fost director al Asociației Pro Democrația, actual Președinte al Asociației E-Civis, cu o vastă experiență în sectorul nonprofit) și <strong>Radu Florea </strong>(consultant în management cu o experiență de peste 15 ani în sectorul ONG, fost manager de finanțări la FDSC, USAID și altele). </p><p><span></span></p><p>Cursul este realizat de <strong>Asociația Young Initiative</strong> în parteneriat cu <strong>Federația VOLUM</strong> și <strong>ASE București</strong>, cu sprijinul financiar al <strong>Granturilor SEE</strong> 2009-2014, în cadrul <strong>Fondului ONG</strong> în România. Conținutul acestui curs nu reprezintă în mod necesar poziția Granturilor SEE 2009-2014, întreaga responsabilitate asupra acestuia revenind organizatorilor.</p>", 
    "end_date": null, 
    "title": "Managementul Sustenabil al Organizației Nonprofit", 
    "price": 0, 
    "instructors": "Asociatia Young Initiative", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715436_a855_5.jpg", 
    "course_url": "https://www.udemy.com/management-ong/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T10:34:33Z"
}