{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \tEste é o primeiro curso completo sobre o MarketUP - O primeiro sistema de gestão 100% Grátis e Online. Esqueça o papel e as planilhas do excel e comece a utilizar o MarketUP agora para ajudar você a realizar toda a gestão da sua empresa  </p>  <p style=\"\">  \tNesta série de vídeo aulas, você irá aprender a registrar todas as operações do dia a dia da sua empresa no seu sistema:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Controle Financeiro - Não      fique mais perdido com planilhas e papéis para acompanhar o seu negócio.      Organize as finanças de sua empresa de uma forma simples e descomplicada.      Tenha em mãos todas as ferramentas necessárias para analisar a saúde      financeira do seu negócio.</span></li>  </ul>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Controle de Vendas – Faça o      registro de todas as Vendas da sua empresa, seja ela através do talonário      de Orçamentos e Pedidos, através da Frente-de-Caixa, ou através da nossa      Loja Virtual!</span></li>  </ul>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Controle de Clientes - Com o      MarketUP você consegue fazer o cadastro e gestão completa de seus clientes      de forma rápida e fácil. Saiba quem são os seus melhores clientes, quais      produtos eles mais compram, quais são os clientes que estão deixando de      comprar de você, entre diversas outras informações gerenciais. Utilize esses      dados para fazer ofertas direcionadas e melhorar o relacionamento com seus      clientes.</span></li>  </ul>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Controle de Compras e      Estoque - Registre todas as movimentações do seu estoque de maneira      integrada às suas vendas e/ou outras necessidades de movimentação. Tenha      informações detalhadas sobre as entradas e saídas de mercadorias na sua      empresa e acompanhe quais pedidos de compra você ainda tem que receber,      além de quais pedidos de venda ainda precisam ser entregues.</span></li>  </ul>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">Emissão de Relatórios      Gerenciais, Controle de Produção, Emissão de notas Fiscais e muito mais –      O MarketUP é o sistema de gestão pensado para o PME!</span></li>  </ul>  <p style=\"\">  \tAlém de ser o mais completo sistema de gestão para a sua empresa, o MarketUP é totalmente gratuito também. Isso mesmo, não há nenhum tipo de custo com o MarketUP:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">·Sem Limite de Uso</span></li>  \t<li style=\"\"><span style=\"\">·Sem Mensalidades</span></li>  \t<li style=\"\"><span style=\"\">·Sem Tempo de Validade</span></li>  \t<li style=\"\"><span style=\"\">·Sem custo de instalação</span></li>  \t<li style=\"\"><span style=\"\">·Sem necessidade de adquirir recursos extras</span></li>  </ul>  <p style=\"\">  \tCaso tenha qualquer dúvida sobre o sistema, nós oferecemos um suporte online totalmente através da nossa Central de Atendimento. Nossa equipe está preparada para sempre atendê-lo da melhor maneira possível!  </p>  <p style=\"\">  \tInformatize agora mesmo a sua empresa: Não perca mais tempo com cadernos e planilhas ultrapassadas e tenha a visão gerencial completa da sua empresa onde estiver.  </p>", 
    "end_date": null, 
    "title": "MarketUP - O primeiro sistema de gestão Totalmente Gratuito!", 
    "price": 0, 
    "instructors": "MarketUP ERP 100% Grátis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/280332_c6bb_4.jpg", 
    "course_url": "https://www.udemy.com/marketup/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-13T18:43:48Z"
}