{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>With people applying to Product Manager positions more and more, you’ve got to be able to answer whatever challenging questions an interviewer may throw at you and stand out from the competition.</p><p>I designed this course for anyone who wants to <strong>master the Product Manager interview</strong>. You could be someone who’s <strong>new to product management</strong> and want to transition into this field. Or You could be an <strong>experienced product manager who wants to change companies</strong> and land a better job. </p><p>I remember what it felt like when I interviewed for my first few product management jobs. I felt nervous, stressed, and under prepared. I had no idea what they were they were going to ask and had no idea how to prepare. When I went into the interview, these negative emotions held me back from showing my best side and I let many awesome opportunities slip away.</p><p>Fortunately for you, this course will prepare you for these challenging interviews. I’ve done the hard part for you already. In my career I’ve interviewed at some of the most innovative tech companies in the world. Companies like <strong>NASA, Apple, Google, Microsoft, Ticketmaster, Live Nation and Yelp</strong>. I’ve answered hundred of the toughest product manager questions and <strong>I’m going to teach you the proven techniques and how to answer them perfectly.</strong> This course takes all that experience and knowledge and packages it in a <strong>structured, easy to learn way.</strong></p><p>Here’s what you’ll learn in this course: You’ll learn how to answer:</p><p>I<strong>nstructional questions, product vision questions, behavioral question, estimation questions. </strong>You’ll also learn everything you need to know beyond the interview. You’ll learn the <strong>secrets to finding Product Manager jobs</strong> and how to <strong>upgrade your resume</strong> so it stands out from the pack, you’ll learn how to <strong>optimize your online profile</strong> and learn <strong>how to prepare on the day of the interview</strong> and <strong>what to do after the interview. </strong></p><p>I’ve also packed this course with a ton of prep materials. You’ll get <strong>over 110 sample questions</strong> and <strong>25 video mock interview exercises.</strong> You’ll get <strong>email templates,</strong> <strong>resume examples,</strong> <strong>slides</strong>. My goal is to provide you with the <strong>most comprehensive and accurate information on the Product Manager interview process</strong> and give you the <strong>knowledge and confidence</strong> you need to ace that interview. </p><p>This course includes <strong>lifetime access</strong> so you can use it to prep for other interviews in the future and it comes with a <strong>30 day money back guarantee</strong> so you can get your money back for whatever reason if you’re not happy with the course. I also look at the discussion forums every single day and will answer whatever question you might have so I’ll be there learning with you ever step of the way. So what are you waiting for? </p><p>Click on the \"Take This Course\" button and join me. </p>", 
    "end_date": null, 
    "title": "Master the Product Manager Interview - The Complete Guide", 
    "price": "35.00", 
    "instructors": "Charles Du", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679990_b85c_2.jpg", 
    "course_url": "https://www.udemy.com/productmanagementinterview/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T23:02:46Z"
}