{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">Learn from a &#039;Meeting Expert&#039;</strong><br style=\"\"></p><p>Not only you get to learn from this course, you will also recruit an expert as your personal consultant to get all your questions answered and to propel you in becoming highly productive in planning and leading meetings in any context.</p><p style=\"\"><strong style=\"\">DID YOU KNOW:</strong> People who master running efficient and productive meeting have a 33% more chance to get higher promotions and faster.</p><p style=\"\"><strong style=\"\">DID YOU KNOW</strong>: if you can lead highly productive meeting with your peer team, you will eventually become their boss (even if you don&#039;t know the subject matter)</p><p>Your future in business Depends on your skills to run effective meetings. It just make sense to conquer this skill and become a meeting expert.</p><p>In employment, business and life in general, meetings are essential to create understanding, formulate solutions and sometimes get things going. You cannot escape meetings. From the short meetings in the office, to a large boardroom and shareholders meetings, the basics are always the same. </p><p>Your career actually depends on successful meetings. If you are managing work with your team, setting the path for new projects, collecting and reviewing results, creating a mind shift in your company, it is always in a meeting. </p><p>YET I have witnessed high level CEOs failing to deliver an effective meeting. New managers struggling to work out an agenda or open a meeting. </p><p>I spend my days either in meetings or in trainings. Sometimes I have meetings from dawn to dusk. Non stop! I can assure you I have been in meetings where I just wanted out. </p><p>Actually as a management consultants my fees are $x,000 per one day training on: &#039;How to run effective meetings&#039; for organizations. Why so much? Because effective and productive meetings transform the way organization and people do business. The organization become more productive!</p><ul style=\"\"><li>Do you want to become a better manager?</li><li>Do you want to become a better business person?</li><li>Do you want to learn how to manage results oriented meeting?</li><li>Do you need to stop wasting time with inefficient meeting?</li><li>Do have you have any problems dealing with counterproductive people?</li><li>Do you want to learn how to initiate, setup and lead productive meetings?</li></ul><p><strong style=\"\">If any of the above answers is Yes then this course is for you.</strong><br style=\"\"></p><p>If you work on your skills you will have a tremendous advantage on the people who work only on their job. You will move forward faster and better. </p><p>Not only you will benefit from the course content, you will also have the chance to ask your questions and draw from my vast experience. It is like you have your own meeting management expert. </p><p>You know this course is guaranteed and if you don&#039;t like my services (I don&#039;t see how) you can always cancel and get your refund, no question asked!</p>", 
    "end_date": null, 
    "title": "Meeting Management: How to Lead & Master Productive Meetings", 
    "price": "20.00", 
    "instructors": "Ultimate Results", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445862_b896_3.jpg", 
    "course_url": "https://www.udemy.com/meetings-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T15:47:32Z"
}