{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><em><strong class=\"redactor-inline-converted\">[Missed</strong><strong> the sale? </strong>No problem! Use <strong class=\"redactor-inline-converted\">\"25 OFF\"</strong><strong class=\"redactor-inline-converted\">(no space)</strong> when<strong class=\"redactor-inline-converted\"> checkout]</strong></em><br></p>\n\n<p>  \t    This MYOB training course consists of a series of training videos, case studies and practices. It focuses on the fundamental skills required for you to build your own company files and cope with daily bookkeeping affairs. This course is suitable for all learners, especially for students with some basic accounting knowledge and small business owners.  </p>\n\n\n\n\n\n<p>  \t    You will start with setting up your company file, and then learn how to manage your daily operations by setting up accounts related to service, inventories, customers and suppliers. You will understand how to create invoices and manage purchases, sales and funds transfers. This course will show you how to create purchase orders and pay bills as well as record sales and payments received. Also, you can track your own inventory and manage all your banking tasks. Additional working materials are provided which allow you to follow along with this course throughout the lessons. Besides the basic use of the accounting software, more advanced contents such as prepayments, depreciation, bad debts, contra entry adjustments and GST return will also be covered in this course. At the end of each section, you will learn how to generate various reports related to your business.  </p>\n\n\n\n\n\n<p>  \t    By the time you have completed this online MYOB course, you will have a clear understanding of how to set up and maintain your company's finances on a day to day basis, as well as access to the financial information you need to help you succeed in your business.  </p>", 
    "end_date": null, 
    "title": "MYOB AccountRight 2015 Essential Training", 
    "price": "50.00", 
    "instructors": "Kevin Bao, Leonard Guan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436268_e859_2.jpg", 
    "course_url": "https://www.udemy.com/myob-accountright-2015-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T06:23:12Z"
}