{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Do you feel underpaid and undervalued at work and want to ask for a raise, but are anxious and don't know how to do it?\n\n  </p>\n\n<p>Are you looking for jobs, but keep running into dead ends?\n\n  </p>\n\n<p>Are you ready to take your earnings to the next level? \n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">If you're like many of my students, the answer is yes. You may even be getting underpaid by THOUSANDS of dollars a year. \n\n  </strong></p>\n\n<p><strong>Did you know that while 80+% Recruiters were willing to negotiate, but 79% of all people did not even attempt to negotiate their salary and benefits?</strong>\n\n  </p>\n\n<p>Here's why: The thought of negotiation makes them nervous, they don't know how to find their worth, they're afraid of losing the offer, and they simply don't know what to say. Unfortunately, they're leaving thousands, even millions on the table.\n\n  </p>\n\n<p>In reality, Salary Negotiations are like romantic comedies.  We all know that the first argument is never the end of the relationship.   We all know that in the end, the guy gets the girl (or vice versa).  Similarly, we all know the first salary offer is never the best offer.  The manager always has some more money at his disposal for your raise.  We just need to know the right way to follow so that the boy gets the girl i.e. you get the salary you deserve.  By the end of this course, you will have your personalized system to get the salary raise you deserve. This system has been developed based on numerous discussions with employers, HR and decision makers (from startups to billion dollar companies). This has worked for me. This has worked for my students. And this will work for you.\n\n  </p>\n\n<p>Learning to negotiate is the best investment you can make in your life. Imagine if you boost your salary by $500 per month today, can you guess how much difference it would make? Let’s say that you work for 50 years. If we apply a compound interest of 6%, this $500 raise will help you get an extra $1.8 Million in the bank. Yes, this sounds unbelievable! But, it's the true. Carnegie Mellon Economist, Linda Babcock, estimates that failing to negotiate your salary at the beginning of your career will cost you $1.0 – $1.5 million in earnings over the course of your career. So, I am sure you have understood that a small salary difference today can completely change how you live your retirement years. So, if you want to boost your lifetime earnings by millions, just go through the course and be successful in getting that salary raise that you truly deserve. \n\n  </p>\n\n<p>The best way to become an effective negotiator (and develop any skill) is by actually doing it. The only problem with learning how to negotiate your salary from your own experience, is that the stakes are so high. In salary negotiations, making a mistake will have a lasting effect on your lifetime earnings. Future raises are almost always based on your current salary, and if you fail to negotiate well, you will be playing catch-up for the rest of your career. \n\n  </p>\n\n<p>In this course, I'll be teaching you the exact system that I used to double my salary every 3 years, allowing me to get out of huge debt and save up 6 years of living expenses.\n\n  </p>\n\n<p><strong>How would you like to have an extra $5,000 every year?</strong>\n\n  </p>\n\n<p>I surveyed former students and the average raise was more than $5,000. 1 in 5 increased their salary by $10,000 or more! Money that could be used for a vacation, a new home, or to pay off student loans or credit cards.\n\n  </p>\n\n<p>Using an easy-to-follow storytelling approach -- along with my proven system, case studies, interesting stories, graphs, templates, humor, and personal experience, this course gives readers the tools to conquer \"the evil HR lady.\" \n\n  </p>\n\n<p><strong>Depending on what stage you are; you can experience an increase in your income in the next 3 months</strong> \n\n  </p>\n\n<p>Please – if you are looking for some instant double your income, get rich quick scheme then this is not the course for you. You will need to put into action the methods taught in this course over a short period of time and then you will get the results you want to experience.\n\n  </p>\n\n<p>Whether you're an investment banker or a sales representative, this course will help to negotiate the best remuneration package.\n\n  </p>\n\n<p>You'll also have access to tools and other resources like worksheets and email templates to help you implement what you learn. You will be equipped with word-for-word scripts and powerful tactics that you can use to confidently and effectively boost your earnings.\n\n \n\n \n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">And, at the end of this course, you will be prepared to effectively negotiate...</strong>\n\n  </p>\n\n<ul><li>Your salary</li><li>Your signing bonus</li><li>Your relocation bonus</li><li>Your targeted performance bonus</li><li>Your corporate housing</li><li>Your stock compensation (equity)</li><li>Sick days</li><li>Vacations days</li><li>Remote working</li><li>Hours in the office</li><li>And much more!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Special <strong>BONUSES</strong> include:\n\n  </p>\n\n<ul><li>The magical salary negotiation scripts</li><li>Frequently asked questions about the negotiation process, including common mistakes and <strong>SECRET</strong> tactics</li></ul>\n\n\n\n<p>\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">Click the \"take this course\" button right now ... every hour you delay is costing you money you should be earning ...</strong>\n\n  </p>\n\n<p>I'll show you how you can get paid what you deserve....\n\n  </p>\n\n<ul><li>Even if you've never negotiated before</li><li>Even if you're not sure you're worth it</li><li>Even if you don't have 15 years of experience</li><li>Even in this economy...when they \"don't have a budget\"</li></ul>\n\n\n\n\n\n\n\n<p>\n\n  </p>\n\n<p>My goal for YOU in this course is to provide you with the most simple, useful, and powerful techniques regarding this often misunderstood topic. Finish this course and you'll feel empowered regarding a topic that makes most\n\n people squirm and ultimately settle for less.</p>", 
    "end_date": null, 
    "title": "N.E.U.R.O Salary Negotiation System™:5 Mins to Higher Salary", 
    "price": "50.00", 
    "instructors": "A. K. Goel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/868432_5b0b_2.jpg", 
    "course_url": "https://www.udemy.com/neuro-7step-salary-negotiation-system-to-double-your-salary-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-04T05:26:05Z"
}