{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Enrol now and get the other BNS course, Negotiation Winning Strategy, for only $10,- (as soon as you enrol you will get the coupon code)</strong></p><p>This course is about the 14 most important psychological principles used in today's negotiation practice. Where they come from, their scientific background and most importantly: how to use them to achieve a much better outcome of your negotiations. </p><p>Preparation is perhaps the most important part of negotiation, and the process of preparing is loaded with psychological obstacles that might lead to inadequate or ineffective preparation. </p><p>This intermediate level course is meant for business people in management, financial or legal positions. Or for students learning for these functions. </p><p>  In this course, we will cover the psychological principles in 14 video clips with additional materials. This will take about two hours to complete. </p><p>You should take the course if you want to become a better negotiator and if you want to understand where they come from, why they work and why they are so important that may  of these founders won a Nobel Prize.</p><p> These include:  </p>  <ul><li>The Availability Heuristic</li><li>Anchoring</li><li>The Endowment Effect</li><li>False Consensus</li><li>The Myth of the Fixed Pie</li><li>Positive Illusions</li><li>Perspective Biases</li><li>The Illusion of Control</li><li>Temporal nature of preferences</li><li>Irrational escalation</li><li>Possibility and certainty</li><li>One sided evidence</li><li>Biased assimilation</li><li>Confirmation bias</li></ul>  \t                          ", 
    "end_date": null, 
    "title": "Negotiation Preparation Psychology", 
    "price": "20.00", 
    "instructors": "Richard Birke", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/377014_1163.jpg", 
    "course_url": "https://www.udemy.com/negotiation-preparation-psychology/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-24T14:13:01Z"
}