{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">This is a course on strategic collaboration for entrepreneurs and their stakeholders. It consists of an introduction to the basic principles of strategic negotiation, a guide to negotiating with agents of organizations, a discussion of negotiating about price, and four videos on how to use the preparation templates that are included with the course.</p><p style=\"\">Course participants have access to occasional live webinars in which we demonstrate how to analyze and prepare for specific negotiation challenges such as resolving conflicts with co-founders, deal making with angel investors, get a line of credit at a bank, and more.</p><p style=\"\">Every leader of a startup is continually working with other people to get something done or thinking about ways to get help from someone. That is the essence of negotiation.</p><p style=\"\">What makes strategic negotiation strategic is the incorporation of the interests of other people into the plan for getting what we want. If other people are either necessary or a potential impediment to what we want to accomplish, we must take what they might do or be persuaded to do into account. That means we must consider what they want and need—their interests.</p><p style=\"\">Strategic negotiation is a form of collaborative negotiation, a process of working together to create more value for all involved rather than pushing against each other in an effort to outwit, outfox, outmaneuver, coerce, or otherwise prevail in a game of winning and losing, where most often everyone loses.</p><p style=\"\">This course introduces the basics of the strategic negotiation method to entrepreneurs and their stakeholders. It is only the beginning, but for entrepreneurs it is a valuable set of tools and techniques.</p>  ", 
    "end_date": null, 
    "title": "Negotiation for Entrepreneurs", 
    "price": "20.00", 
    "instructors": "Michael Palmer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57504_8996_12.jpg", 
    "course_url": "https://www.udemy.com/negotiation-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-31T15:29:06Z"
}