{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><u style=\"\">Special Course Notes</u></strong>  </p>    <p style=\"\">  \t                        Whether you have already gotten your first promotion into management, are working toward it, or are just considering making the move, this course will teach you what you need to succeed in the role. This course focuses on <strong style=\"\">both the hard skills and soft skills</strong> needed by managers. Instruction is practical and can be applied immediately in your workplace to see results.  </p>  <p>  \t<strong style=\"\">Accelerate Your Career and Increase Your Influence and Income</strong>  </p>  <ul style=\"\">  \t<li>Master both the hard skills and soft skills needed to do the job</li>  \t<li>Learn how to manage difficult personalities</li>  \t<li>Start positioning yourself for your next promotion from day one</li>  \t<li>Identify the best people in job interviews and avoid those who will undermine you</li>  \t<li>Build a productive team and a positive work environment</li>  \t<li>Set yourself up for both immediate and long-term success</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Transition yourself to a higher paying career path that rewards experience and maturity</strong>  </p>  <p style=\"\">  \t                                   This course is focused on applied learning. It is taught by the President of Awaken, LLC and founder of Aspiratech, a corporate business process optimization and technology firm. Drawing upon over a decade of experience working with executives at top companies, from Cisco Systems to Comcast, the instruction is relevant to what you most need to know in order to move up the corporate ladder and achieve your goals.  </p>  <p style=\"\">  \t                                   While this course will be useful to all new managers, it will be of <strong style=\"\">special value for developers</strong> and others with a technical background. The examples used in the course are of a new manager coming from that background.  </p>  <p style=\"\">  \t                                   Each lecture in this course presents practical instruction on the “How-To&quot; of management. Lectures also provide homework exercises you can do to put into <strong style=\"\">practice what you are learning</strong>. Handouts accompany many of the lessons, providing further details to help you develop your business skills and grow your career as a result of this course.  </p>  <p style=\"\">  \t                                   As a special support for some hard skills needed by managers, all students enrolling in this course will also receive a <strong style=\"\">free enrollment</strong> in Aspiratech&#039;s &quot;Salesforce New User Training&quot; course, which retails for $59. (The free coupon is included in the handout for one of the lectures.) Other student perks are found throughout the course.  </p>  <p style=\"\">  \t                                   It is our intent to fully prepare you for success in your first promotion as manager and the many to follow. <strong style=\"\">Enroll now</strong>, and get started building these critical career skills before you are called upon to already know them. As they say, it is better to be prepared and not have an opportunity than to have an opportunity and not be prepared.  </p>  <p style=\"\">  \t<strong style=\"\">After completing this course</strong> you will have the skills you need to make the most of your first management opportunity. With knowledge and skill, you will be able to impress your superiors and inspire dedication from your subordinates. You won&#039;t be sitting there wondering what you&#039;re supposed to be doing or what is expected of you. The pathway to success will be clear, and you will be fully equipped to navigate that path with a skill set your competitors lack.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Onward and upward!</strong></em>  </p>", 
    "end_date": null, 
    "title": "New Manager Training", 
    "price": "50.00", 
    "instructors": "Aspiratech Training", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414220_e761_3.jpg", 
    "course_url": "https://www.udemy.com/succeeding-as-a-new-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T16:08:39Z"
}