{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn the basic concepts, tools and skills that you will need to become successful as a manager. Learn how to build and lead effective teams through both the easy and the hard times.<sub style=\"\"></sub></p><p><strong style=\"\">Build a strong foundation for your successful leadership with this comprehensive course</strong></p><ul style=\"\"><li style=\"\">Learn to communicate clearly and how to work with constructive feedback.</li><li style=\"\">Recognize and use group dynamics for better results.</li><li style=\"\">Manage conflicts and relationships in a productive, energy efficient way.</li><li style=\"\">Build motivated and self-learning teams with a high level of trust.</li><li style=\"\">Learn how to best manage the demands and expectations of the management role.</li></ul><p><strong style=\"\"><br style=\"\">Time and Energy Saving Knowledge and Skills at Your Disposal</strong></p><p>This course is built on more than 20 years experience with training new and experienced managers from all corners of the world.</p><p>Successful managers have all invested in their leadership skills. These skills are often what makes or breaks a new manager. </p><p><strong style=\"\">Content and Overview</strong></p><p>I designed this course to be easily understood and applied by absolute beginners. Each section contains a separate &quot;Get Started Today&quot; lecture to get you up to speed right away.</p><p>Complete with easy-to-digest theories, models and practical examples. A total of 10 sections with over 60 lectures filled with proven tips and tricks, with quizzes at the end of each section to help you grasp the key concepts.</p><p>You will walk away from this course with a solid toolbox of skills and knowledge that you can use to succeed in your new management role.</p><p>You will be able to communicate more clearly, give and receive constructive feedback and manage conflicts. You will understand group dynamics and be able to adjust your leadership to the development stage of your team.</p><p>You will avoid energy drains by clarifying expectations, guidelines for behavior and working with values. You will be able to motivate yourself and others, build trusting and effective relationships while managing the challenges related to the management role.</p>", 
    "end_date": null, 
    "title": "New Manager: The Basics and More of Becoming a Great Leader", 
    "price": "50.00", 
    "instructors": "Markus Amanto", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429062_6e2a_4.jpg", 
    "course_url": "https://www.udemy.com/new-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-22T13:17:02Z"
}