{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Are you a new manager, or soon-to-be manager, who has not had any training in management?</strong></p><p>You are probably good at doing what you do, but managing others is a new skill. You need to win respect, motivate effort, and improve performance. There is a lot to learn.<br></p><p><br></p><p><strong>The New Manager's Five-week Success System will give you all the information you need to start managing effectively, from day 1.</strong></p><p>And, if you are already a new manager, then you will be able to apply this material straight away, and get immediate results.</p><p><br></p><p><strong>Dr Mike Clayton - my Management Story</strong></p><p>Hi, I'm Mike Clayton.         I’ve been training new managers for nearly 20 years. And I was once that new manager myself, so I know the challenge of going from a doing role to a managing role. It doesn’t matter how good you are at doing: management is something new.</p><p>So, I have included in this course all the things<em><strong> I most wish I'd known</strong></em> when i started managing teams of colleagues. And I have created it around nuggets of advice that you can put straight into action: 100 of them.</p><p>Using thee tools, ideas, and methods, I was <strong><em>promoted</em></strong> from Manager to Senior Manager at Deloitte Consulting <em><strong>in one year</strong></em> - the minimum possible.</p><p><br></p><p><strong>Here's what you'll get...</strong></p><p>At the end of this course, you will be able to manage your team well… and to do so with confidence.  You will be ready to take your place as an effective manager in your organization.</p><p>In this course, you’ll get 25 modules, covering all the basics of management. They are split into five sections with five themes: </p><ul><li>personal effectiveness</li><li>communication skills</li><li>managing individuals </li><li>managing teams</li><li>manager’s toolkit</li></ul><p>Take a look at the 25 lectures in the curriculum to see what you'll be covering, in more detail.</p><p>So, that’s one group of five videos a week: one a day. Each video gives you four essential tips that you can apply straight away to get guaranteed results. They build up into an indispensable list of <em><strong>100 </strong></em><em><strong>‘do this’ essentials</strong></em> that will transform your ability to get results.</p><p><br></p><p><strong>Do you want to succeed quickly?<br>...or fail slowly?</strong></p><p>Take this course if you aim to succeed in management, and you want to make a rapid start.<br></p><p>... Especially if you are in a management role for the first time and feel out of your depth, without the support and guidance you need.<br></p><p>Let Mike Clayton, with 20 years of being a manager and training managers, be your guide.</p><p><br></p><p><strong>Do You Have to do One-a-day for Five Weeks?</strong></p><p>No.</p><p>That structure makes it easy for people with only a few minutes to spare, each day. </p><p>If you prefer to work through them, faster, or to dip in and out, or to watch what you need, when you need it... That's all fine by me.</p><p>And however you watch these videos, don't forget: I will be here to <em><strong>answer any questions</strong></em> you have.</p><p><br></p><p><strong>Your Unconditional, No-questions, 30-Day Guarantee</strong></p><p>The best way to assess how valid this material is in you culture is to try it out. I am so confident that this course will change your life that I offer you an unconditional, no questions asked, full 30 day money-back-in-full guarantee. If you don't think this will give you the tools to do more with your time, then just ask for your money back.</p><p><strong>And What if you have questions?</strong></p><p>I will be on hand to answer your questions if you get stuck, puzzled, or just want to know more. As a professional trainer, this is what I do, and I promise to respond within 24 hours of your question arriving with me from Udemy. </p><p><strong>Enroll Now</strong></p><p>Enroll for this course now, so you can start to regain control of your life straight away.</p>", 
    "end_date": null, 
    "title": "New Manager's Five-week Success System: 25 Days > Management", 
    "price": "35.00", 
    "instructors": "Dr Mike Clayton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621408_ca09_2.jpg", 
    "course_url": "https://www.udemy.com/new-managers-five-week-success-system/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T15:18:08Z"
}