{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This <strong>leading edge</strong> course is designed to provide you with <strong>practical, hands-on knowledge and tools</strong> for any business or organisation to achieve competitive advantage.  It focuses on optimising your only true source of competitive advantage - the <strong>people!</strong></p><p>Designed and facilitated in an easy to watch style, it <strong>i</strong><strong>ncludes examples, tips, worksheets and exercises</strong> to customise the learning for your particular team or organisation or group.</p><p>The course consists of <strong>lecture videos and support materials such as worksheets, assessments and guides</strong> which will assist you step by step to achieve new levels of performance and results for your team and/or organisation. </p><p> The <strong>facilitator has over thirty years of global experience</strong> in implementing performance enhancing initiatives in many varied industries. His style includes <strong>many examples</strong> of his personal experience to illustrate important learning points.</p><p>The world of the 21st century consists of a complex and rapidly changing environment.  Leaders of groups, teams, departments and organisations need to remain at the forefront of leading edge thinking in order to survive and remain competitive.  This course will provide you with powerful insights, tools and techniques.</p><p>It is is a <strong>must</strong> for any group or team or organisation wishing to remain at the forefront in highly competitive environments.</p><p>Welcome</p>", 
    "end_date": null, 
    "title": "Optimising People Performance in your team/organisation!", 
    "price": "20.00", 
    "instructors": "Dave Woods", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580124_f788_2.jpg", 
    "course_url": "https://www.udemy.com/optimising-people-performance-in-your-teamorganisation/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T13:28:29Z"
}