{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><p style=\"\">This Cultural Diversity Training: Organizational Culture Change Video  Training is developed by OCAI Online, based on Marcella Bremer&#039;s pragmatic  book: &quot;Organizational Culture Change: Unleash your Organization&#039;s  Potential in Circles of 10&quot;. How to make change work this time...?</p>    <p style=\"\">In this Organizational Culture Change Video Training, Marcella shares her  knowledge and experience guiding change starting with the <strong style=\"\">Organizational  Culture Assessment Instrument (OCAI)</strong>, developed by Cameron and Quinn and based  on their <strong style=\"\">Competing Values Framework</strong>, followed by engaging OCAI Workshops that  turn into change circles.</p>    <p style=\"\">The core cultural diversity training course  consists of 37 lectures, approximately 11 hours of explanation, cases and  examples about <strong style=\"\">organizational culture change</strong>. You can watch the videos whenever  it suits you. Because we combine basic to advanced levels in this  organizational culture change training, you may want to skip some videos or  watch them all, depending on your background.</p>    <p style=\"\">This engaging approach to organizational (culture)  change is described in the paperback &quot;Organizational Culture Change&quot;  (by Marcella Bremer) and is being taught and practiced twice a year on the  international 3-day workshop: Culture Change Days.</p>    <p style=\"\">Take this ultimate Cultural Diversity Training course  right now and learn how to create success with OCAI</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Organizational Culture Change: Create Success with OCAI", 
    "price": "50.00", 
    "instructors": "Marcella Bremer", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/37709_6cc2_6.jpg", 
    "course_url": "https://www.udemy.com/organizational-culture-change/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-23T14:01:15Z"
}