{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong><strong>Thank you for your interest in this Art Gallery Management and Exhibition Design Course. </strong></strong>Since 2010, this course has been taught to more than <strong><strong>200 students </strong></strong>in London, Uk and has built a network of <strong><strong>successful curators, gallery managers and artists. </strong></strong><strong>Now virtually available for the first time this course covers all the key aspects to working in the art market.</strong>  </p>  <p>  \t          The course is taught by Tina Ziegler, experienced gallery manager and curator. Through informative and detailed voice lectures in a video presentation, Tina introduces the course in three specific classes covering all the key aspects of working in the art market and presented in a easy &#039;how to&#039; format.  </p>  <p>  \t          This is the perfect short course to introduce you to the art market and will give you a complete overall understanding of how the art market works and the the hands on skills required to start working with art.  </p>  <p>  \t<strong>The course is presented in three focused courses:</strong>  </p>  <p>  \t<strong>Part one: Art Gallery Management - </strong><em><em>This course acts as an introduction to the art market, the responsibilities of a gallery manager and how to manage an art space, work with artists and manage art buyers. A complete overview to working in an gallery environment.</em></em>  </p>  <p>  \t<strong>Part two:</strong> Art Exhibition Design and Curating  </p>  <p>  \t<strong>Part three:</strong> Art Handling and Installation  </p>  <p>  \t         The complete course is also available at a discounted price.  </p>  <p>  \t<strong>What students say about this course:</strong>  </p>  <p>  \t<em><em>&quot; Whether you are a student looking to start a career in the commercial art world or a gallery manager looking to hone your skills this course is relevant to all. Tina&#039;s wealth of knowledge is invaluable, and coupled with her relaxed delivery style presents gallery management as an exciting but obtainable challenge.&quot; - Ruth</em></em>  </p>  <p>  \t<em>“ </em><em><em>Absolutely fantabulous workshop teaching you everything you need to know about gallery management and business. Highly recommended to everyone involved in gallery/art business or thinking about dealing with art and artists in the future. I personally would recommend this workshop to students of art colleges and schools if they think whether to go into this business or not. Lovely atmosphere, many interesting useful ideas and fantastic students attending this workshop. Don&#039;t hesitate to buy this course, you&#039;ll get 10 hours of amazing and inspiring workshop. I loved these two days with Tina Ziegler and my class mates. Many thanks, Tina, for your workshop. “ - Irina</em></em>  </p>  <p>  \t<em>“</em><em><em>This course was exactly what I was looking for in order to understand the world of the small art gallery. Tina made it interesting, informative and enjoyable. I would certainly recommend the course to anyone wishing to gain some knowledge of curating and managing an art gallery.”- June</em></em>  </p>  <p>  \t<em>“ </em><em><em>Just wanted to say thanks to Tina for this absolutely essential, very informative workshop. Will definitely look for her courses again. Many thanks. </em></em><em>“ </em><em><em>- Irina</em></em>  </p>  <p>  \t<strong>About Tina Ziegler, the creator and teacher of Art Gallery Management and Exhibition Design.</strong>  </p>  <p>  \t         &quot; My name is Tina Ziegler, I have been working in the arts as a curator and gallery manager for 9 years. I created Stimulus Workshops in 2010 and started this Art Gallery Management and Exhibition Design course. Since then I have taught over 200 individuals in London, UK. This course was created to teach the reality of what goes on inside a gallery and the things you need to know before you start working in an art gallery, managing artists, organising exhibitions or handling art works. I realised after running a gallery in London that many educated individuals were applying to work in the gallery, however they lacked the necessary hands on skills that were required to handle the day to day of working and running a Contemporary Art Gallery. Many individuals understood curating, or how the art market worked, but didn&#039;t know how to package a painting, hang a piece of art or manage an artist. So this course teaches you just that; The day to day tools you will need to know to work in an art gallery, curate an exhibition, sell art or even open your own gallery space.&quot;  </p>", 
    "end_date": null, 
    "title": "Part 1: Art Gallery Management ", 
    "price": "25.00", 
    "instructors": "Tina Ziegler", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/262594_0f2e_7.jpg", 
    "course_url": "https://www.udemy.com/part-1-art-gallery-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-16T14:27:32Z"
}