{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">2 five star excellent reviews in our first week online. You will love this course.</strong>  </p>  <p style=\"\">  \tIn 30 minutes, this course will provide you with a good understanding of the approach, which you can use immediately.  </p>  <p style=\"\">  \t<span style=\"\">We all use processes every day, to perform both routine and adhoc activities in business. T</span><span style=\"\">he visualisation of processes through process mapping provides a huge opportunity for efficiency and effectiveness improvements. So, let’s look at who should take this course.</span>  </p>  <p style=\"\">  \t      The company manager/owner: Why should you learn to use process mapping? To learn how performance is dependent on resources and processes working together. It is possible to see the machines and people operating, but it can be difficult to visualise the process without this pictorial view of the process map. Once you have created this picture, it can be improved, controlled and ultimately managed.  </p>  <p style=\"\">  \t      For the operator of the process, inefficient processes can be frustrating, and also difficult to amend or improve. We all hear of people talking about different ways to do things, but process mapping can be the tool that opens up the process for others to improve it – less talking, more doing!  </p>  <p style=\"\">  \t      For the student of business transformation, process mapping is a basic building block in your curriculum and will be used frequently in your future career.  </p>  <p style=\"\">  \t<span style=\"\">Sign up to this 30 minute course and find out for yourself how easy it is to learn and get started at process mapping!</span>  </p>", 
    "end_date": null, 
    "title": "Process Mapping to uncover issues holding you back", 
    "price": "20.00", 
    "instructors": "e-Lean  Academy, Ross Garrett", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/365818_ab12_5.jpg", 
    "course_url": "https://www.udemy.com/process-mapping-to-uncover-issues-holding-you-back/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-08T14:02:18Z"
}