{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t    This course is for those people who want to learn new skills on customer centric process leadership. You will learn what is Process Leader Framework and how it will help your business to increase revenues and profits, decrease costs and improve customer service simultaneously. We have collected the best material together to make a primer on business process management and the content of this course has been enjoyed by over 40,000 people so far.  </p>  <p>  \t    The course includes series of training videos and a free course book (which is also available for purchase from Amazon, but we&#039;ll give it to you for free). Once you have finished the course here, you may apply membership to our exclusive Process Leader Academy where like-minded people meet to learn more skills together.  </p>  <p>  \t    The course consists of one book and series of training videos. Those videos give you ideas on customer centric process excellence and business process management. We share best practice techniques and ideas with you, so you can apply them in your organisation. We focus especially on Process Leader Framework, which helps you to align business strategy to customer strategy, processes and IT systems.  </p>  <p>  \t   This free course is part of Process Leader Academy, where we teach these concepts in even more depth. Access to Process Leader Academy is available for purchase separately.  </p>", 
    "end_date": null, 
    "title": "Process Leader Framework", 
    "price": 0, 
    "instructors": "Janne Ohtonen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164682_0f05_2.jpg", 
    "course_url": "https://www.udemy.com/process-leader-framework/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T09:12:29Z"
}