{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>بفضل الله ، عدد طلاب هذه الدورة لغاية الآن <strong>270</strong> متدرباً، و تم تقييم الدورة ب ( 4.8 من 5 ) من قبل 92 ، وقد ساعدت العديد من المتدربين على الاستعداد و النجاح في اختبار ال</strong><br></p>\n\n<p><strong>PMP</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>و كذلك ساعدتهم على تحسين فرص عملهم و ظروفها</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>سجل الآن و استفد من كامل مميزات التسجيل في الدورة</strong></p>\n\n\n\n<p><strong>**************************************</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>التسجيل في الدورة سيمنحك فرصة الإستفادة من عدد من المميزات و التي منها:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>1- إمكانية الوصول (مدى الحياة) إلى أكثر من 120 مقطع فيديو تشرح مادة إدارة المشاريع الإحترافية مبنيةً على آخر إصدار من كتاب و منهجية إدارة المشاريع الإحترافية.</p>\n\n\n\n\n\n\n\n\n\n<p>2- إمكانية الوصول (مدى الحياة) إلى 13 إختباراَ للمساعدة في تأكيد المعلومات الواردة في كل وحدة.</p>\n\n\n\n\n\n\n\n\n\n<p>4- إمكانية الوصول (مدى الحياة) إلى إختبار كامل للمادة مكون من 200 سؤال للتدرب على إختبار إدارة المشاريع الإحترافية الفعلي.</p>\n\n\n\n\n\n\n\n\n\n<p>5- إمكانية الإنسحاب من الدورة خلال 30 يوماً إن لم تلبي الدورة توقعاتك، و استعادة رسوم التسجيل.</p>\n\n\n\n\n\n\n\n\n\n<p>6-  ستحصل على شهادة حضور يمكن إرفاقها في السيرة الذاتية، و كذلك يمكنك من خلالها تقديم إختبار إدارة المشاريع الإحترافية .</p>\n\n\n\n\n\n\n\n\n\n<p>7- يتيح لك التسجيل في الدورة كتابة الأسئلة و مناقشة المواضيع المختلفة بين المتدربين و المدرب، بحيث تتمكن من الإستفسار عن أي نقطة أو تساؤل أثناء مشاهدة المادة وحضور الدورة.</p>\n\n\n\n\n\n\n\n\n\n<p>8- يمكنك مشاهدة مقاطع الفيديو باستخدام الأجهزة المختلفة (لابت توب، تابلت، ..) و باستخدام أنظمة التشغيل المختلفة (آندرويد، ويندوز، ...).</p>\n\n\n\n\n\n\n\n\n\n<p>10- تم تقسيم مقاطع الفيديو بحيث لا يزيد أي مقطع عن (20 دقيقة)، بعد تسجيلك في الدورة ستتمكن من حضور هذه المقاطع بحسب ما يناسب، و بعدد المرات التي ترغب بها.</p>", 
    "end_date": null, 
    "title": "Project Management Professional (PMP) Exam Preparation  ", 
    "price": "50.00", 
    "instructors": "Mesk Academy, Jamil Faraj", 
    "commitment": "26.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353180_e0d7_10.jpg", 
    "course_url": "https://www.udemy.com/ma_jf_pmp/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T19:19:53Z"
}