{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                   Would you like to reduce the conflict and improve the relationships in your personal and professional life? This course can help you do that by revealing a major hidden cause behind a lot of the conflicts and miscommunication we all face&mdash;generational differences.  </p>  <p>  \t                   You might be familiar with the traditional approach to generations, like Baby Boomers, Gen X, Gen Y, etc., but in this course you&rsquo;ll learn why the traditional approach to generations is flawed and discover a new and powerful approach that makes much more sense. You&rsquo;ll probably even learn that you&rsquo;re part of a generation, or &ldquo;Value Population,&rdquo; you&rsquo;ve probably never even heard of before, such as the Performers, the Techticians, the Believers, etc.  </p>  <p>  \t                   What&rsquo;s more, you&rsquo;ll see how you and people of different generations in your life grew up in very different times and have very different values and perspectives on life. It&rsquo;s as if you come from very different worlds. To bridge this gap, you&rsquo;ll gain powerful tools to help you communicate and get along with them better, both at work and at home.  </p>  <p>  \t <strong style=\"\">At work, this knowledge can help you in areas such as:</strong>  </p>  <ul style=\"\">  \t<li> Sales and Marketing&mdash;to better communicate and connect with customers</li>  </ul>  <ul style=\"\">  \t<li> Management&mdash;to better lead employees of different generations</li>  </ul>  <ul style=\"\">  \t<li> Human Resources&mdash;to better attract, engage, and retain employees</li>  </ul>  <ul style=\"\">  \t<li>Continuous Improvement&mdash;to improve collaboration, productivity, and innovation</li>  </ul>  <p>  \t <strong style=\"\">At home, this knowledge can help you improve relationships with:</strong>  </p>  <ul style=\"\">  \t<li>  Yourself&mdash;it&rsquo;s a powerful tool for self-discovery and personal growth</li>  </ul>  <ul style=\"\">  \t<li>  Your Kids, Parents, Spouse, Friends, Neighbors, etc.</li>  </ul>  <ul style=\"\">  \t<li>  Basically Anyone&mdash;who was born in America and is of a different generation</li>  </ul>  <p>  \t <strong style=\"\">Here&rsquo;s what a few people who have taken this course had to say about it:</strong>  </p>  <p>  \t                   &ldquo;<em style=\"\">I&rsquo;ve been using the Near Bridge generational concepts for the last few years, personally and professionally. They have been invaluable tools to help me understand my clients and my two sons &ndash; who are both in different Value Populations. I only wish I&rsquo;d had this knowledge when my parents were alive&hellip;it explains so much and would have led us to a much richer understanding and relationship.</em>&rdquo;  </p>  <p>  \t               &mdash;Bill Hertan, founder, TRI Partners, Inc.  </p>  <p>  \t               &ldquo;<em style=\"\">A wealth of information presented in a dynamic, interactive way. Get ready to be engaged and informed!</em>&rdquo;  </p>  <p>  \t               &mdash;Aurora Realin, manager, Florida Hospital  </p>  <p>  \t                   To help you get started, the first 8 lectures are offered for free so you can learn how this powerful approach can change your life.  </p>", 
    "end_date": null, 
    "title": "Reducing Generational Conflict", 
    "price": "50.00", 
    "instructors": "Ken Beller", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/372624_c468_5.jpg", 
    "course_url": "https://www.udemy.com/managing-generational-conflict/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-17T18:54:26Z"
}