{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\">We all want to get referrals right?</strong></p><p>Yet, despite seeing the boring old question 'How likely is it that you would refer us to a friend?' everywhere, the actual level of referrals has fallen, not risen in recent years.</p><p>At the same time, 'trad' marketing is becoming ever more ineffective as routes to market proliferate at break neck speed, and customers rely more an more on other people's reviews and opinions.</p><p>At a time when referrals are needed more than ever, they are getting harder and harder to come by.</p><p>This course gets rid of the mist and BS around referrals and teaches you how to actually GET significantly more referrals (and develop your reputation on and off line) in a steady and straightforward manner.</p><p>It's a mix of video, audio and text and is suitable for anyone who genuinely wants REAL progress in this area, from one man bands or aspiring managers to owners and directors of major organisations, these principles are proven to work, and work very well indeed.</p><p>All audio and text is downloadable, so you can do further study off line, and the whole course is 30 sessions, designed to be completed in small chunks. </p><p>Why bother? Because this is the marketing of the future: unless you're a major brand, in the age of the empowered customer and transparent market, you need to learn how to do this brilliantly before your competitors do.</p><p>It's as basic as that.</p>", 
    "end_date": null, 
    "title": "Referrals: how to genuinely get more (without the BS)", 
    "price": "35.00", 
    "instructors": "Guy Arnold", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425402_9387_3.jpg", 
    "course_url": "https://www.udemy.com/how_to_get_referrals/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T22:31:53Z"
}