{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course helps students who attend the advanced SMS course by ACS group to prepare and refresh the SMS concepts.</p><p>It is required material before starting the course in-company.</p><p>It covers three main aspects of Safety Management Systems:</p><p><strong>Section 1: Why do we need SMS to manage safety in aviation?</strong></p><p>The first section details the history of Safety Management in aviation before SMS. <br> We discuss the Organisational accident causation or Swiss cheese model developed by James Reason and how it impacts our approach to managing safety. Then we define what safety, hazards and risk are according to ICAO. <br> Furthermore we go over the management dilemma of choosing between dedicating resources towards production or protection and how a re-active approach to safety management can cost more.</p><p>Afterwards we discuss the importance of Human factors in safety management.</p><p>Finally we define the purpose of the SMS and how you can ask 4 simple questions to evaluate if the SMS is really working in your area of responsibility.</p><p><strong>Section 2: How does the Safety Risk Management process work</strong></p><p>We describe the properties of a successful SMS, how we try to achieve risk based decision making and a simple model of safety risk management.</p><p><strong>Section 3: What are the elements in an ICAO style Safety Management System?</strong></p><p>We go over the ICAO based 4 pillar model and explain the various elements contained in each pillar:</p><p><u>Pillar 1: Safety policies and objectives</u></p><p>We go over the requirements of Management commitment and safety accountabilities of the managers we need to have a successful SMS. We talk about the role of the key safety personel and the SMS implementation plan. </p><p>Also we need to think about the Emergency Response plan and finally the documentation of the SMS.</p><p><u>Pillar 2 Safety Risk Management</u></p><p>Since we will discuss this in-depth in the advanced course we only give a quick overview</p><p><u>Pillar 3 Safety Assurance</u></p><p>The role of the Quality Management systems and setting the right Safety Objectives and targets.</p><p><u>Pillar 4 Safety Promotion</u></p><p>We cover how we can improve our Just Culture and the overall safety culture by the Safety Training and Communication</p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Refresher course of Safety Management Systems", 
    "price": 0, 
    "instructors": "Jan Peeters", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680522_2996_4.jpg", 
    "course_url": "https://www.udemy.com/acsgroup-basic-refresher-course-of-sms/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T13:50:22Z"
}