{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                         This course gives you the tools required to excel in today&#039;s rapidly changing medical office. You will master the art of managing risks, avoiding legal landmines, and protecting your medical office from lawsuits.  </p>  <p style=\"\">  \t<strong style=\"\">Increase Your Confidence And Value To Your Medical Office Team</strong>  </p>  <p style=\"\">  \t      By  the end of this course, you will understand your role in minimizing risks.  </p>  <p style=\"\">  \t            - Understand tort law and how to avoid accusations of assault and battery, false imprisonment, and invasion of privacy.  </p>  <p style=\"\">  \t            - Recognize the importance of staying within your &quot;scope of practice,&quot; patient satisfaction and its role in managing legal risk.  </p>  <p style=\"\">  \t      - Comprehend and appreciate the &quot;team approach&quot; in minimizing risk and accusations of malpractice and negligence.  </p>  <p style=\"\">  \t<strong style=\"\">Your role in managing risk in the modern medical office.</strong>  </p>  <p style=\"\">  \t  Do you know that 53% of medical-related lawsuits are related to outpatient healthcare? The average settlement is about $290,000. However, a vast majority of risk management investment has been on the inpatient, or hospital environment.  </p>  <p style=\"\">  \t  This course focuses on outpatient risk management. It emphasizes the role of patient satisfaction, regulatory compliance and interpersonal communications play in minimizing legal exposure.  </p>", 
    "end_date": null, 
    "title": "Risk Management for Medical Office Staff", 
    "price": "20.00", 
    "instructors": "Cole Morris", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269314_63e4_4.jpg", 
    "course_url": "https://www.udemy.com/risk-management-for-medical-office-staff/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-26T23:38:31Z"
}