{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t                This quality management system will engage you quickly by breaking your improvement down into chewable bits that you can correct with little effort. It's also a program that's just plain fun to do, and at the same time super simple, and proven to be highly effective?  </p>\n\n<p><strong>How to Set Up a Simple Quality Improvement System </strong>is a fun, simple and effective way to find solutions of almost any kind. It will rival any CQI or TQM program you'll find. Not only can you learn all you need to know in 2 hours, you could start implementing it <strong class=\"redactor-inline-converted\">while</strong> you're taking this course. And I'll guide you, so you can use your own improvement as your course project.</p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Set Up An Easy, Productive QM System Overnight, Literally</strong>  </p>\n\n\n\n<p>  \t                This complete quality improvement and quality management system generates:  </p>\n\n\n\n<ul><li>Programs</li><li>Improvements</li><li>New revenue opportunities</li><li>Products</li><li>Savings</li><li>Complete improvement and risk management plans</li><li>Plans to resolve problems, needs and concerns</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t              and does this just by letting people do what they do best ~ their jobs.  </p>\n\n\n\n<p>  \t                Whether you’re a sole proprietor, or have hundreds, even thousands of employees, this system will help you tap the latent resources that lie within your employees, clients, and even your critics, and convert that knowledge into growth, improvement and profits for you and your company. </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">And talk about simplifying risk management: </strong> This is a program we used with great success in our rural hospital district.  We not only used this CQI system to develop a very successful fall-prevention program for our elderly residents that reduced falls 40% over 8 months, but extended that program to a community-wide program designed to improve safety for all residents. That program was designed to interconnect all health care discharge planning with all fitness, health, and recreation programs in the community, right down to the public swimming pool. The point being that this simple system enabled us to create a very complex program involving a number of internal and external entities.  </p>\n\n\n\n<p>  \t        But our <em>internal</em> fall-prevention program was entirely the work of the staff from four different departments: Long Term Care Center, Physical Therapy, Dietary and Laundry.  </p>\n\n\n\n<p>  \t                Other improvements <strong class=\"redactor-inline-converted\">recovered $16,000</strong> in fraudulent overcharges from a vendor to just one department for a single year; <strong class=\"redactor-inline-converted\">one month’s salary</strong> equivalent plus another <strong class=\"redactor-inline-converted\">$7,200</strong> in administration expenses, by installing a convenience and safety device for employees; countless dollars and improved safety by improving medication storage; and many, many more improvements ~ all developed by employees. We also created dozens of new, grant-fundable programs that expanded our services and met needs that weren’t previously met. I’ll tell you how they did it, and teach you to do this for your business.  </p>\n\n\n\n<p>  \t                You'll learn how the LTCC r<strong class=\"redactor-inline-converted\">educed their employee turnover of 135% to about 5% per year</strong>. No one wanted to leave anymore. Employees were happy. Patients (customers) were happy. You, too, can have happy employees.  </p><p>And you'll learn how to overcome the most common reasons to resist change. </p>\n\n\n\n<p>  \t                You’ll get:  </p>\n\n\n\n<ul><li>Our timeless 92-page ebook “CQI/TQM for the Rest of Us”</li><li>All the forms we discuss</li><li>Flow maps to help you picture the flow of everything</li><li>All of the preparation steps to take</li><li>Detailed how-to’s for identifying root causes, and developing improvements</li><li>Instructions on how to train employees and implement this program</li><li>One-to-one support from me as you set your program up.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                Just post your questions in the discussion area of the course and I’ll guide you in applying this system to your situations.  </p>", 
    "end_date": null, 
    "title": "Set Up a Simple Quality Improvement System", 
    "price": "40.00", 
    "instructors": "Michele Boyer, RRT", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381882_69b0_3.jpg", 
    "course_url": "https://www.udemy.com/cqitqm-for-the-rest-of-us/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T00:12:25Z"
}