{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This course is entirely about managing products the traditional way. In specific, my focus is on day-to-day product management skills for B2B type of companies, where you are making, marketing and selling products to business entities, not end consumers. </p><p>  \t        Interviewing for your first product management job makes you feel you've just been presented with a chicken and egg problem. The hiring manager says, \"Well, you don't have any PM experience,\" and you are thinking, \"How am I going to get that experience if they don't give me a chance to do the job first!\"</p>  <p>Here's the thing. When PM hiring manager says you don't have experience, very likely she is indirectly saying this: \"I am not seeing the PM mindset in you.\" </p><p>It's indeed a chicken and egg problem, right? How do you get that PM mindset without actually doing the PM job?  </p>  <p>  \t        Don't let that hiring manager's feedback discourage you. Take it from me, it is very much possible to get into that product management mindset. It is very much possible to switch from an engineering role to a product management role. In fact people with technical background are most suitable for product management roles.  </p>  <p>  \t        However, there is one big--very big--barrier that slows, sometimes entirely preventing, one from getting into product management.</p><p>This barrier is how you think, how you talk, what kind of language you use, and what impression you give to product management hiring manager. This is that \"PM mindset.\" </p><p>It is a barrier because nothing in the engineering, design and development experience will give you that PM mindset; but at the same time, the PM hiring manager will look for it in a candidate.  </p>  <p>  \t        My suggestion is this: watch the intro video in this course. Then enroll in this course. And sit through each video and finish it. You don't have to take any notes or anything. Just let your mind relax and think about what I am saying in the videos. </p><p>Finish the videos. </p><p>Finish the videos, that's important. Then think about what this \"PM mindset\" is. I guarantee you, you will know a lot more about it then. Keep using that mindset to revise your resume, to change the way you talk, to change the way you use the language when you talk to PM hiring managers.  </p>  <p>  \t                           I created this course because I've seen others struggle to become good in product management, and I believe my experience--with the lessons learned over 21 years of Silicon Valley life in technology profession--can offer useful guidance to others looking to shift into product management.  </p>  <p>  \t                        This course is intended for beginners; no prior product management experience is needed. You don't even have to know technology, for that matter. Just bring your passion.  </p>  <p>  \t        The course is organized primarily into <strong>34 lectures (33 video lectures running over 6 hours.)</strong>  </p>  <p>  \t                             I expect to add further material as we go along and I get substantial feedback.  </p>  <p>  \t                             So, please join me as we get started.  </p>", 
    "end_date": null, 
    "title": "Skillsets to Shift Your Career to Product Management", 
    "price": "45.00", 
    "instructors": "Raj Karamchedu", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96950_b654_6.jpg", 
    "course_url": "https://www.udemy.com/productmanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-25T02:36:33Z"
}