{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Why do Small Businesses Owners have such a difficult time becoming successful? <br style=\"\">What can we learn from the amount of failure with small business that we can apply to our own business aspirations? There are many reasons why a small company can fail, and at surface level the primary reason businesses fail is they simply run out of cash.</p><p style=\"\">Or that is what many people think, but what reasons could influence a business to fail?</p><p style=\"\"><strong style=\"\">There may be many reasons why a Small Business can fail</strong><strong style=\"\">...and to me, the most important are:</strong><br style=\"\"> <br style=\"\"> <em style=\"\"><strong style=\"\">Reason #1:</strong></em> They are not really in touch with customers through deep dialogue.<br style=\"\"> <em style=\"\"><strong style=\"\">Reason #2:</strong></em> There is no no clear and real differentiation in the market (read: lack of unique value propositions)<br style=\"\"> <strong style=\"\"><em style=\"\">Reason #3:</em></strong> The Failure to communicate value propositions in clear, concise and compelling fashion.<br style=\"\"> <em style=\"\"><strong style=\"\">Reason #4:</strong></em> Leadership breakdown at the top (yes — founder dysfunction).<br style=\"\"> <strong style=\"\"><em style=\"\">Reason #5:</em></strong> Inability to establish a profitable business model with adequate financial indicators. (Are you the type of owner that mixes personal and company finances?)<br style=\"\"></p><p style=\"\"><em style=\"\"><strong style=\"\">If you can identify with one of the reasons, I need you to ask yourself...</strong></em></p><p style=\"\"> <strong style=\"\"><em style=\"\">Even if you have a lot of experience and expertise in many areas, you can be lacking the necessary skills to run every area efficiently. You may not be able to supervise every aspect of your business and if you try to handle too many responsibilities, you can be putting growth, development and even your own company at risk. </em></strong><br style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">Is your business facing challenges:</strong><br style=\"\"> Do you have adequate financial management practices? Financial Indicators?<br style=\"\"> Do you have a business plan? A Marketing Strategy?<br style=\"\"> Do you know the industry and the market?<br style=\"\"> Are your profits at risk? Do you monitor and control your expenses?<br style=\"\"> Do you use cash flows and budgets? Does that information help you make better decisions?<br style=\"\"> How do you monitor performance? Do you have the right team to achieve your goals?<br style=\"\"> <br style=\"\"> <strong style=\"\">You as the leader</strong><strong style=\"\">:</strong><br style=\"\"> Are you motivated? Organized?<br style=\"\"> Do you monitor your performance and profitability?<br style=\"\"> Are you a good leader? Do you have high personnel rotation?<br style=\"\"> Are you reaching your personal goals being a small business owner? </p><p style=\"\">Is your company designed for YOUR well being? I<br style=\"\"></p><p><br style=\"\"></p><p>  \tIf you are here, you already own a small company or you are about to start your own business, either way, this course is designed to help you learn about critical topics needed to manage and succeed when you are a small business owner. </p><p>After you finish the course, it will allow you find areas where you can improve an existing business or prepare to start one the right way.  Understand that every small business, no matter the industry, has a risk of failure, and that will depend on many factors. Not only your knowledge, skill set, experience and desire, but other areas that you might not control, or are not aware how to handle.  Is there a way where you can minimize that risk? Yes, you can be prepared from the beginning or have the ability to correct the course of action if you have already started. </p><p>This course will help you identify critical tasks and areas within your company that you need to evaluate. We will do exercises and tests that will allow you to learn about small business finances, being a leader, marketing, hiring the right team, be organized and help you improve the chances of your company becoming successful.  </p>", 
    "end_date": null, 
    "title": "Small Business Management and Marketing Essentials", 
    "price": "50.00", 
    "instructors": "Alvaro Santizo", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387818_f3c4_2.jpg", 
    "course_url": "https://www.udemy.com/small-business-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T17:09:29Z"
}