{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Why do companies place such importance into a business plan? Well, the creation of a business plan will allow any company to develop a road map to where they want to go and more importantly, how they are going to get there. </p><p style=\"\"> A good business plan will add value to your company, and in the long run will allow your company to achieve goals in a more efficient manner. Putting your concepts and ideas in a plan will allow you to learn about your market, competitors, and prepare your company for the changes needed to succeed.</p><p><em style=\"\"><strong style=\"\">Marketing </strong></em>is the business strategy designed to be the link between what your business is selling and what your costumers are buying. It is talking WITH your costumers instead of to them.</p><p>Marketing is a cycle that starts with costumer knowledge and goes around your whole operation all the way to customer service.</p><p>Each company has completely different needs and tactics that can be implemented to create a marketing plan. However, the process, resources and time required to develop and execute an efficient marketing strategy is based on the same principles. </p><p><strong style=\"\">Getting Organized:</strong></p><p>If you start to make changes but do not supervise, track and monitor them frequently, you are destined to repeat mistakes and limit your ability to change and improve.</p><p>If you want your business to succeed, the first step is to be ready, and we have covered a lot of important aspects to help you in that area within the course. Once you are confident about every area in your company, you need to plan, execute and follow up. And you, as the owner, are the key element of this task. </p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Small Business Marketing and Business Plan Essentials", 
    "price": "20.00", 
    "instructors": "Alvaro Santizo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468624_8de4.jpg", 
    "course_url": "https://www.udemy.com/small-business-marketing-and-business-plan-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T03:18:07Z"
}