{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>This is an introductory course dedicated to show you what the Smart Customer Management © philosophy and model is all about, and how it can help you and your organization dramatically improve its performance by building up a customer-centered strategy.</p><p>In this course you are going to learn about why and how the Smart Customer Management  © model is one of the most comprehensive methods to set up and/or evolve a successful customer-centric management strategy and what implementation approaches are available for your organization to progress over time.</p><p>As you probably know, there are many frameworks and models in the marketplace today. Some of them have successfully developed practices that help organizations improve specific parts of the business. However, organizations usually face many challenges that require a systemic approach to the customer and a smooth implementation. </p>    <p>This is exactly to what the Smart Customer Management © model stands for. It is the first management model in the marketplace that is focused entirely on improving your organization's customer-centric capability, and the only one that integrates in a single and holistic framework all the goals, processes and tools an organization needs to commit to successfully transform itself into a customer-centered organization. </p>    <p>Whether your organization has already developed a customer-centered strategy or is a newcomer, this course provides you with basic knowledge to further progress on the transformation towards customer-centricity.</p>    <p>We have lot to cover, so let’s get started!<br></p>", 
    "end_date": null, 
    "title": "Smart Customer Management for Customer-Centered Companies", 
    "price": "20.00", 
    "instructors": "Francisco Javier Navarro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/732672_4131_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-smart-customer-management/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T13:04:17Z"
}