{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>SPYCAM DETECTION</strong> teaches the basic investigative skills necessary to identify and detect covert spy cameras. It also provides a complete due diligence strategy to help organizations protect their employees, customers and visitors against this privacy invasion. By taking a pro-active approach to <em>“the video voyeur in the workplace problem\"</em> the organization also mitigates the risk of expensive lawsuits, damaging publicity and loss of good will.</p><p>In addition to the forensic training, the student receives a 25-page course text which includes a strong <strong>Recording in the Workplace</strong> policy template, a simple Inspection Log form and links to additional information. </p><p>Upon completing the course, the student will be able to conduct a professional inspection without the need for expensive instrumentation. Should an organization want to invest in instrumentation (useful for large scale inspections) links to these items are provided in the course text.<strong></strong></p><p><strong>SPYCAM DETECTION is primarily useful for:</strong></p><ul><li>security managers,</li><li>facilities managers,</li><li>store managers,</li><li>security officers,</li><li>private investigators,</li><li>landlords,</li><li>real estate management companies,</li><li>targets of activist groups,</li><li>and businesses which invite the public into their locations.</li></ul><p>~</p><p><strong>Recognizing and detecting spy cameras is also a valuable skill for:</strong></p><ul><li>law enforcement personnel,</li><li>security management students,</li><li>and the general public wishing to protect themselves against video voyeurism.</li></ul><p>~</p><p><strong>The course is structured to give the student:</strong></p><ul><li>a full understanding of the video voyeur problem,</li><li>a written policy which provides deterrence, leverage, and shows due diligence in court,</li><li>an understanding of the different types of spy cameras and how to identify them,</li><li>instruction on how to plan and execute a proper inspection,</li><li>and instruction on what to do if a camera is found and how to handle the evidence.</li></ul><p>The course takes about an hour to complete.</p><p>Spy cameras are inexpensive and readily available via the Internet and local spy shops. Every child and adult is a potential target. Business especially have a duty to protect the people using their expectation of privacy areas. </p><p><strong>Although SPYCAM DETECTION focuses heavily on protecting workplace environments there is a greater good. </strong>By taking this course you will be able to use what you have learned to protect yourself and your family during your everyday travels. The effect is cumulative. As more people take this course, opportunities for video voyeurs decreases. </p>", 
    "end_date": null, 
    "title": "Spycam Detection in Workplace Expectation of Privacy Areas", 
    "price": "20.00", 
    "instructors": "Kevin D. Murray", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531454_5de3.jpg", 
    "course_url": "https://www.udemy.com/spycam-detection/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-18T17:35:03Z"
}