{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<span>Individual motivational receptiveness changes daily to such a degree that developing employee self-motivation requires creative management approaches to strengthen positive experiences. The initial step is aligning the organisational aims with the motivational activities, supplemented by ice breakers, team building games, role playing, workshops, motivational questionnaires, variety of events and life coaching sessions. Powerful positive imagery in quotations, speakers, brainstorming sessions, and the working environment encourages self-motivation, confidence, the feeling of success and achievement and contributes to improving performance.</span>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">The course include the following video topics:</strong>  </p>  <p>  \t1. Will start with an exercise  </p>  <p>  \t2. Theories of Motivation  </p>  <p>  \t3. Extrinsic and Intrinsic motivation  </p>  <p>  \t4. Iceberg model of Motivation - What causes motivation  </p>  <p>  \t5. Motivation Killers  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">A few word about the author of this course:</strong>  </p>  <p>  \tTania Ayerst has over 20 years of experience in Management Consulting and over 15 years in the area of People Management and Development. Her expertise includes Strategic Management, Agile/Lean management, Strategic Human Capital Management, Customer Relations, Organizational Culture Change, Employee Engagement, Performance Management, Competency Modelling, Total Rewards Management, Learning and Development, Talent Management, HR Transformation, etc.  </p>  <p>  \tShe help companies re-think and re-design their culture and organization using NEO-MANAGEMENT. This is a group of new management methods, based on new paradigm. It is better suited to the contemporary hyper-competitive, totaly connected market.  </p>  <p>  \tTania Ayerst has a Master’s Degree in Human Resources Management and Development from WAC University, USA. She also holds a Diploma in Management Studies from the Open University, UK as well as a specialization in People and Organizational Management Management from AOTS, Yokohama, Japan.  </p>  <p>  \tShe is Certified Management Consultant (CMC) by the Institute of Consulting in London according to the standards of the International Council of Management Consulting Institutes (ICMCI).  </p>", 
    "end_date": null, 
    "title": "Staff Motivation", 
    "price": "20.00", 
    "instructors": "Slavi Slavov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413894_9cec_2.jpg", 
    "course_url": "https://www.udemy.com/staff-motivation/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T07:51:15Z"
}