{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">Welcome to <strong style=\"\">Successful HR in Business</strong> from LearnSmart.</p><p style=\"\">LearnSmart is <strong style=\"\">Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the<strong style=\"\"> Professional Development Unit (PDU) re</strong>quirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p style=\"\">If you're interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong style=\"\">5.25 PDU</strong> credit hours toward your PMP® certification from PMI.</p><p style=\"\"><strong style=\"\">Course Overview:</strong></p><p style=\"\">This course provides a clear understanding of management's roles and responsibilities under the ADA, detailing standards set by the law. Students will learn the correct procedures for interviewing and evaluating job candidates to avoid discrimination, as well as the procedures for accommodating - and ensuring a safe, discrimination-free environment for - employees with disabilities. Learn the successful HR strategies when it comes to hiring and terminating employees.</p><p style=\"\"><strong style=\"\">Course Breakdown:</strong></p><p style=\"\"><strong style=\"\">Section 1</strong>: The Americans with Disabilities Act of 1990 brought with it a complex set of challenges that face employers who wish to avoid discrimination against the disabled in the workplace. </p><p style=\"\"><strong style=\"\">Section 2</strong>: Successful Hiring will show you the guidelines and procedures that will dramatically increase your percentage of successful hires. </p><p style=\"\"><span style=\"\"></span><strong style=\"\">Section 3</strong>: Designed specifically for managers to teach them how to handle those potentially awkward times when it becomes necessary to “pink slip\" someone. More importantly, managers are provided with a number of helpful suggestions for meting out employee discipline. Study all the ins and outs to successfully terminate an employee.</p><p style=\"\"><strong style=\"\">Recommendations:</strong></p><p style=\"\">Learn from others! Here are some reviews from participants (Click on reviews to see full list of reviews)</p><ul style=\"\"><li style=\"\"><em style=\"\">Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- I.A.</em></li><li style=\"\"><em style=\"\">This course is of high quality - This course will explain you every concept from scratch. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- S.T.</em></li><li style=\"\"><em style=\"\">Thanks for LearnSmart LLC. Very clear explanation, easy to understand, delivered in very slow and deliberate manner -- R.B.</em></li></ul>", 
    "end_date": null, 
    "title": "Successful HR in Business", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332928_5504_6.jpg", 
    "course_url": "https://www.udemy.com/successful-hr-in-business/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T20:00:03Z"
}