{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Supervisors are the linchpins in an organisation that set the performance levels when it comes to safety, productivity, skills development and job satisfaction. <br></p><p>This training has been devised for companies who&#039;ve got a great or &quot;getting great&quot; safety culture in place, but they realise employees are getting complacent with safety and that they need to re-energise and empower staff.<br></p><p>This course teaches supervisors the importance of their job role and that <strong><em>what they   demonstrate and request from staff determines safety levels</em></strong>.&nbsp; It provides supervisors with information about what makes a high performance safety culture, followed by 9 &quot;Connect &amp; Collaborate&quot; Skills to improve employee safety engagement, teamwork and create a happy working environment.<br></p><p>The course goes through how to use these skills in toolbox meetings and includes a <strong>Toolbox Meeting Template</strong> to help supervisors encourage better safety meeting performance.<br></p><p>This engaging and activity based video course (with just around an hour of content) includes a workbook with activities, a toolbox talk template and a quiz.&nbsp; It also provides additional training content to reinforce training via regular fortnightly emails.<br></p>The course is structured into seven main topics:<br><br><ol><li>Introduction<br></li><li>The Importance of Supervisors</li><li>A New Workplace Culture Model</li><li>How to Connect Well with your Team</li><li>9 Connect &amp; Collaborate Skills</li><li>Running a Great Toolbox Meeting<br></li><li>Using the Toolbox/Safety Meeting Template</li></ol>This course is vital to supervisors who want to improve their ability   to communicate and engage on safety matters, including making others   more accountable for safety.&nbsp; <br><br>It is beneficial for companies   who want to change their safety culture or who realise that their   supervisors are not leading staff or safety meetings effectively.&nbsp; It will also create a workplace where workplace bullying will be a thing of the past.<br><br>  ", 
    "end_date": null, 
    "title": "Supervisor Leadership Skills for a Safe Workplace", 
    "price": "50.00", 
    "instructors": "Marie-Claire Ross", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/57427_1fdb_6.jpg", 
    "course_url": "https://www.udemy.com/supervisor-leadership-skills-for-a-safe-workplace/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-31T05:17:21Z"
}