{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Welcome to<strong> Taking Control as a Manager</strong><strong></strong><strong> </strong>from LearnSmart.</p><p>LearnSmart is <strong>Project Management Institute (PMI) Global Registered Education Provider (REP 3577)</strong>. This course qualifies for the above credit hours toward the PMP or CAMP training contact hours or toward maintaining your current certification. Thus meeting the <strong>Professional Development Unit (PDU) </strong>requirement necessary to continue their PMP Certification or for experienced project managers wanting to brush up on their education.</p><p>If you're interested in becoming an accomplished project manager, this training will give you valuable real-life project management techniques. Learn the skills you need to be an effective project manager - this course qualifies for <strong>1.0</strong><strong>0 PDU</strong> credit hours toward your PMP® certification from PMI.</p><p><strong>Course Overview:</strong></p>Taking Control as a Manager is designed to help new managers understand how to relate to fellow managers and other employees and how to deal with the pressures that come with the position. You will look at the seven aspects of management to invest in and different things you can do as a new manager to help win your team over; discuss performance management and using budget as a tool of control; go through the steps you can take to help employees overcome their insecurities and feel more comfortable on the job; and understand the common causes of managerial stress and strategies to overcome them. You will also learn the best practices to maintain control of your department. This course qualifies for 1.00 PDU credit hours toward the PMP® certification from PMI.<p><strong><br>Recommendations</strong>:</p><p>Learn from others! Here are some reviews from the participants enrolled in this course (Click on reviews to see full list of reviews)</p><ul><li><em>Smart method to learn - This course is helpful and using smart way to motivate thinking and understanding. The instructor has a professional delivery method, and the he materials are interesting and creative specially the flashcards and the exercises -- Ibrahim Alsayed</em></li><li><em>This course is of high quality - This course will let you become a PMP and CAMP master and it will explain you every concept. The instructor is highly engaging and highly motivating. Can't be better. Thank you -- Saber Tlili</em></li><li><em>Excellent class! -- I already have my PMP, but wish I had this class as a study tool prior to taking the test. I am confident that a person who studies the materials presented in this course should have no problem with the exam. I took the class for the PDUs to keep my certification up. On completion of the class I followed the instructions, and had no problem registering the credits with PMI -- Robert Vroom</em></li></ul>", 
    "end_date": null, 
    "title": "Taking Control as a Manager", 
    "price": "20.00", 
    "instructors": "LearnSmart LLC", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/332990_61a5_2.jpg", 
    "course_url": "https://www.udemy.com/taking-control-as-a-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-31T20:55:54Z"
}