{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn the basic concepts skills, processes and conditions that you will need to be a more positive and engaging leader.</strong></p><p>Take your personal leadership skills to the next level with this introduction into Teal Leadership, practices and the personal skills required to develop cohesive and self managing teams. </p><p>We will examine together how organizations have reinvented themselves in order to create work environments that promote wholeness through distributed authority.</p><p>You will see how removing the top down authority model in organizations can lead to more productive and energised workers.</p><p>you will understand the necessary conditions for changing the way you lead, in order to take your own leadership to that next level. </p><p><strong>A necessary skill for todays changing world.</strong></p><p>Understanding how we have allowed fear to rule how we operate as leaders in organization is an important skill in being able to adapt to the changing face of the modern workforce. Success is now a measure of how we contribute to the greater good, and not based on what we have accumulated. </p><p>People are no longer prepared to just turn up to work without having a sense of meaning and purpose attached to what they are doing. Organizations are no longer focused purely on the skills of a person. Skills today are something that can be taught, how people behave and how they are aligned with the purpose of the organization are playing a greater role in the selection of perspective candidates.</p><p><strong>Content and Overview</strong></p><p>This is an introduction to the concepts described in the Book Reinventing Organizations by Frederic Laloux. You will learn through the use of case studies, how organizations are moving away from a top down leadership approach and moving to a structure that promotes employee engagement and responsibility.</p><p>We start by looking at the History of Leadership and how we have developed over they years. Understanding how we have been formed and how we develop in stages, with each stage playing a significant role in preparing us for the next.</p><p>We will then look in depth of the characteristics of what is believe to be the emergence of our next leap in our human development termed the Evolutionary - Teal stage.</p><p>Each stage in our history has brought with it some key learning, we take a in-depth look at what are three important breakthroughs in this Teal paradigm; Self Management, wholeness and evolutionary purpose. Each of these examined through the lens of currently organization.</p><p>Students completing this course will have the knowledge to review their own situation and utilise what this to engage their own workplace or organization.</p>", 
    "end_date": null, 
    "title": "Teal Leadership: introduction for CEO, managers & Leaders.", 
    "price": "30.00", 
    "instructors": "Michael Kelly-Cruise", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338114_851c.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-leadership-for-next-level-consciousness/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T01:33:31Z"
}