{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>During this course, you'll learn how to increase your influence as an innovative leader by applying cutting edge research and techniques to real-world situations. Together, we'll look at what it means to lead a culture of innovation and how we can translate the abstract concept of \"innovation\" into something real, tangible, and actionable.</p><p><strong>Increase your influence as an innovative leader.</strong></p><ul><li>Increase your influence as an innovative leader</li><li>Translate “innovation” from an abstract concept to a specific plan of action</li><li>Improve your team’s culture through small but powerful steps</li><li>Experience new ways to approach problems and find solutions</li></ul><p><strong>Innovate, relate, create.</strong></p><p>This is a course for anyone who wants to increase his or her impact as an innovative leader. Through an interactive, conversation-based approach, we explore innovation and leadership in a research-backed <em>and </em>practical way. This course will empower you to increase your skills in the areas of innovation and leadership, and you’ll leave with actionable tools that you can use right away, back out in the “real world.” We bring together research, case studies and examples, reflection, self-awareness, and personalized action planning for an offering that we suspect you’ll find to be a little bit different than some of the other innovation courses out there. </p>", 
    "end_date": null, 
    "title": "The Innovator's Academy ", 
    "price": "30.00", 
    "instructors": "Allison Poss, Ed.D., Sarah Young", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567654_320b_2.jpg", 
    "course_url": "https://www.udemy.com/theinnovatorsacademy/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-28T19:58:03Z"
}