{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Attention: This course did just go through a major make-over. Reviews before 22nd of April may not reflect the actual content. </strong></p>\n\n<p>I just spent the last four months working on this course to give it a major make-over. Not that it wasn't good before, but it was too similar to another one of my courses, <em>Master Your Brain</em>, and wanted to address that.</p>\n\n<p>Now that this issue has been addressed, I'm extremely proud to present you  '<em>The Science of Leadership</em>'. This course has the ambition to build a bridge between a century of science and 21st century managers. A bridge between how our brain works and how to use that knowledge to improve our communication and leadership abilities.</p>\n\n<p>The course itself is quite dense, so take your time. Don't rush through it. Let the information sink and try things out gradually, before moving on. This way you'll get the most out of this course.</p>\n\n<p>We\"ll go over a series of major studies and experiments, but more importantly, each time we'll see how the conclusions apply to our team, so we can turn all these insights into concrete actions.</p>\n\n\n\n<p>So expect some theory, of course, but most of all, </p>\n\n<ul><li>expect scientific insights to manage your teams more effectively, </li><li>expect powerful communication techniques to coach your team members </li><li>expect to gain a deep understanding of motivation and how to apply that to your team</li><li>expect a new model for leadership which will give you a unique perspective on your team</li></ul>\n\n<p><br></p>\n\n\n\n<p>If this isn't your first course with me, you know you can ask me any question you want (preferably related to the course) in the discussion forum of the course. I normally react within 24 hours (and most of the time much faster than that).</p>\n\n\n\n<p>So, welcome! I'm excited to have you here, and hope you'll enjoy this course as much as I did creating it.</p>\n\n\n\n<p>See you inside!</p>\n\n\n\n<p>Gregory</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The Science of Leadership", 
    "price": "30.00", 
    "instructors": "Gregory Caremans", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/361272_a767_9.jpg", 
    "course_url": "https://www.udemy.com/neuromanagement/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-02T08:50:34Z"
}