{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Learn straight from a management consultant and turnaround artist how to create and implement a management control system for any area of any business in any industry and then to manage that area making it leaner, faster and better all the while highlighting your success for the world to see.  </p><p>We all want to grow in our management careers.  The Manager who sits in his/her chair the longest with the most paper on the desk is rarely the one promoted.  It's usually the one who takes whatever and whomever is given and makes it BETTER!  The one who succeeds where everybody else fails is the manager on the career fast track.</p><p>If your successes are invisible, then they might as well not exist.  So we'll be creating from scratch a management control system that will measure the performance of your area, show it change and improve over time, document your actions, and turn into not only a management tool, but also a biography of YOUR VALUE to the company.</p><p>Your next performance review doesn't have to consist of your boss telling you what (s)he thinks about you and making sorry excuses as to why you aren't getting much of a raise.  It can be a tour de force of you walking in and laying hard, empirical evidence of your contributions on the table and illustrating in indisputable terms (i.e. dollar values) why YOU ARE the company's superstar!</p>", 
    "end_date": null, 
    "title": "The Superstar Manager Course", 
    "price": "50.00", 
    "instructors": "Paul Lynn", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362176_ae77_3.jpg", 
    "course_url": "https://www.udemy.com/manger-training/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T11:07:39Z"
}