{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>Throughout this course, you will learn eight skills and shifts in thinking that are essential for being an effective supervisor.</p><p>Being an effective supervisor requires different skills, behaviours and thinking to being an effective team member. A team will typically expect a new supervisor to demonstrate the skills, behaviours and thinking they associate with a leader. It can be challenging for a new supervisor to meet these expectations without some development and support, because the basic skills, behaviours and thinking are rarely acquired through life prior to taking on a leadership role.</p><p>Based on experience helping thousands of new supervisors successfully make the transition from being a team member to being an effective leader, this course condenses the absolute essentials into eight short modules. </p><p>Each module explains some of the core concepts and breaks them down into practical actions that can be immediately applied on the job.</p><p><strong>Outcomes</strong></p><p>At the end of this course, you will have a working understanding of how to:</p> <ul><li>Explain what is required to be accepted as the leader of a group.</li><li>Explain motivation and employ some leadership strategies to create an environment where people are motivated.</li><li>Set expectations of performance and behaviour with teams and individuals.</li><li>Delegate tasks effectively.</li><li>Facilitate a group decision making process where staff feel genuinely involved.</li><li>Coach and develop staff.</li><li>Use recognition to reinforce desired behaviours.</li><li>Prepare for and hold a performance conversation.</li></ul><p><strong>Duration</strong></p><p>2 hours (8 x 15 minute modules).</p>", 
    "end_date": null, 
    "title": "The 8 essential leadership skills of great supervisors", 
    "price": "20.00", 
    "instructors": "Gerald Pauschmann", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546118_799e_5.jpg", 
    "course_url": "https://www.udemy.com/supervisor-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T00:33:11Z"
}