{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">With all the tools available now a days, companies should have no trouble accessing and analyzing the information they require to make decisions that benefit their success. But somehow, small business owners and people in general, are known for taking guesses or going with their gut feeling. And if you are one of them and are already operating small business, well trust me, you are not alone. </em></strong></p><p>We have to understand that many starting business owners are pretty much relying on their instincts and knowledge to establish and grow a company. And there is nothing wrong with this, there are learning curves in every company; that allow you to gain the necessary experience to determine what type of information will be critical in assisting you to make better decisions. </p>Do you have a software system or the necessary skills to generate useful information to manage your company and make the right calls?<p>If you are currently just relying on your instincts and knowledge of the business, well, let me ask you a couple of questions: </p> <ul style=\"\"><li>What drives your business decisions? </li><li>What type of information do you analyze or have when considering expansions or changes in your business operation? </li><li>What do you base on when hiring or firing employees? </li><li>What comparison or evaluation do you realize when considering change of location? </li><li>How do you track employee productivity?</li></ul><br style=\"\"><p>You may be very organized, have an established business plan, a net and detailed budget and you are ready in any aspect possible. </p><p>But what happens if nothing goes as planned? Or if something varies from your initial or established strategy? You may be forced to take educated or logical guesses at those times, and that might help you come up with solutions or options. </p><p>When this type of reality strikes you, many are not prepared to adapt. You can have a plan but if you are not able to track progress close enough to react, a small bump in a strategy or a wrong turn can completely ruin your plans and put your company at risk.</p>", 
    "end_date": null, 
    "title": "The Importance of Accurate Information in Small Business", 
    "price": "20.00", 
    "instructors": "Alvaro Santizo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466432_1a14.jpg", 
    "course_url": "https://www.udemy.com/the-importance-of-accurate-information-in-small-business/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T05:22:57Z"
}