{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Learn the core skills</strong> that make up the entire Product Management process, from <strong>ideation</strong> to <strong>market research</strong> to <strong>wireframing</strong> to <strong>prototyping</strong> to <strong>user stories</strong> to Product Management<strong> leadership</strong>. I designed this course to be easily understood by people who are new to Product Management.</p><p>In addition to mastering the core skills, you'll actively apply it by learning <strong>popular Product Management tools like Popplet, Axure, Pivotal Tracker</strong>. You will get a chance to build out one of your own product ideas through 10 step-by-step exercises complete with working files and sample templates. At the end of the course, you'll have a product spec with a feature backlog, wireframes, and an interactive prototype. </p><p>Ever wonder how organizations like <strong>Apple</strong>, <strong>NASA</strong>, and <strong>Ticketmaster</strong> design their products? You will know after taking this course. You'll be getting a condensed knowledge transfer from a 8 year Product Management veteran who has led teams at those prestigious organizations and has launched over a dozen products used by millions of users daily. You'll get a behind-the-scenes look at several real life examples of wildly successful products and learn the secret sauce.</p>", 
    "end_date": null, 
    "title": "The Complete Product Management Course", 
    "price": "35.00", 
    "instructors": "Charles Du", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508302_0eac.jpg", 
    "course_url": "https://www.udemy.com/the-complete-product-management-course/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T18:37:09Z"
}