{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Doing What You Want, Doing What You Need</strong></p><p>Pretty much everyone agrees that the best plans and strategies are useless - unless people make enough time to get them done. </p><p>If you're a MANAGER, a SUPERVISOR, or an ENTREPRENEUR and you want to manage your time better – starting now  - you'll get straightforward help that actually works in today's businesses. </p><p>The great Peter Drucker once said that until we can manage time, we can manage nothing else. Yet time itself is simply a measurement. Principally, it measures motion, the earth's orbit around the sun. And we all get the same twenty four hour allocation. So what do we 'manage' when we save ourselves time? Well, as one example, when you take a proper look at how every business, every organization makes people do things at least twice (instead of once) you'll see how to manage 'motion' and save more hours than you might imagine.</p><p>In fact, the '7Keys' authors have 30 years of experience helping managers at all levels, across most industries, from CEO level to first-line supervisor. And they share more of the practices that great time managers actually use to manage their time.</p><p><strong>Ten Short, Illustrated Videos</strong> </p><p>The course has 10 illustrated video talks that each take about 5 to 7 minutes to watch. Each lecture concludes with a 'Take-away' - a page summary of the key points of the talk and the the action you can take right away for immediate progress. </p><p>It comes with a PDF workbook containing a lecture summary, illustrations  and your chapter by chapter action lists.</p><p>The course discusses nine major topics, major time-management principles and the opinions of various time-management gurus. Most of all it doesn't do a 'one-size fits all'  but gives you the menu to choose which principle will give you, personally  the biggest gain right now. </p><p><strong>1. Focus - what is it and how can you increase it and direct it to accomplish more?</strong></p> <p><strong>2. Motion - how do you spot and reduce the occasions where you inadvertently waste       or misdirect  your actions, <strong>do things twice</strong> and use double the time? </strong></p>    <p><strong>3. </strong><strong>Energy - when does your brain function best for what type of work activity?</strong></p>    <p><strong>4. </strong><strong>Clutter - what effect does it have on losing you time and what can you do?</strong></p><p><strong>5.</strong><strong> Your Optimal Organizing System - what is it for what you do?</strong></p><p><strong>6. </strong><strong>Prioritization - from pointless meetings to your primary focus, how do you manage         your priorities when priorities shift?</strong></p><strong>7. 80/20 Rule - what activities give you the biggest payback for the energy you expend      - and which ones drain you</strong>  <p><strong>8. </strong><strong>Planning - do you have the simplest, best planning system for the work you do?</strong></p>   <p><strong>9. </strong><strong>Do-it-Now - how do you put this golden rule, procrastination killer into action?</strong></p><p><strong>10. Summary</strong></p><p><strong></strong>If you believe, as Peter Drucker says - until you can manage time you can manage nothing else - this course could be the biggest boost for your management activity, your personal productivity and your career.<strong></strong><strong></strong></p>", 
    "end_date": null, 
    "title": "Time Mastery For Managers", 
    "price": "35.00", 
    "instructors": "7 Keys Solutions", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586212_5071_2.jpg", 
    "course_url": "https://www.udemy.com/time-mastery-for-managers/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T10:11:39Z"
}