{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Ultimate Product Manager</strong> is a course designed for the <strong>future innovators and product managers</strong>. This course will not only help students get a better idea of what it takes to be a great product manager, but also help product owners learn what skills and characteristics to look for when searching for someone lead their product team.</p><p>The product manager is the person responsible for defining, in detail, the <strong>'why', 'what' and 'when' </strong>of the product that the engineering team will build. <em>The Product Manager</em> is responsible for setting a product vision and strategy. Their job is to clearly articulate the business value to the product team so they understand the intent behind the new product or product release. They own the strategy behind the product and its roadmap and must work with engineering to build what matters.</p><p>This course is to the point with no fluff. It is developed so that you can have a better understanding of the role and responsibilities of a product manager. The are 36 modules divided into the following 8 sections:</p><p><strong>Introduction to Product Manager 101</strong></p><p><strong>The 4 Rules of Representing the Product Internally</strong></p><p><strong>The 7 Characteristics and Traits of a Good Product Manager</strong></p><p><strong>Know Your CPC: The 3 Factors of Knowledge</strong></p><p><strong>A Good Product Leader's Attitude: 3 Golden Rules</strong></p><p><strong>The 6 Critical Skills of a Good Product Manager</strong></p><p><strong>Concluding Product Manager 101 &amp; Next Steps</strong></p><p><strong>Product Manager Templates</strong></p><p>More content will be added as we move on with the course. This course will roughly take you around 2 hours to complete and will help you develop a <strong>visionary view</strong> as a Product Manager.</p>", 
    "end_date": null, 
    "title": "Ultimate Product Manager: Become a Visionary Product Leader ", 
    "price": "20.00", 
    "instructors": "Fareed Raja", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/590824_9f09_3.jpg", 
    "course_url": "https://www.udemy.com/product-manager/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-23T05:39:16Z"
}