{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\"><em style=\"\"><strong style=\"\">Are you planning to lead your organization to ISO 9001:2008 certification?    </strong></em></p><hr style=\"\">  <p style=\"\">  \t<strong style=\"\">This course will help you to lead the implement ISO 9001:2008 standard in your organization. Your step by step implementation and certification guide. Topic include:</strong></p><p style=\"\">Six Step process of ISO 9001:2008 certification includes these steps:</p><p style=\"\"><strong style=\"\">Step 1: </strong>Get management commitment.</p><p style=\"\"><strong style=\"\">Step 2: </strong>Conduct the gap analysis and prepare documentation required for ISO 9001.</p><p style=\"\"><strong style=\"\">Step 3:</strong> Implement Quality Management System.</p><p style=\"\"><strong style=\"\">Step 4:</strong> Conduct internal audits.</p><p style=\"\"><strong style=\"\">Step 5:</strong> Select a certification Body and get the Pre-assessment audit done.</p><strong style=\"\">Step 6: </strong>Final certification audit.<p style=\"\">In this course you will also learn about:</p><ul style=\"\">  \t<li style=\"\">Clause by clause explanation of ISO 9001:2008 requirements in plain and simple language. (<strong style=\"\">bonus</strong>)</li><li style=\"\">Documentation strategies to avoid repeated revisions</li>  \t<li style=\"\">QMS Implementation and external audit strategies</li><li style=\"\">Dos and Don&#039;t during certification audit</li></ul><p style=\"\">As a<strong style=\"\"> bonus</strong> I have included clause by clause explanation of these ISO 9001:2008 clauses in plain and simple language: 1. Scope 1.1 General 1.2 Application 2. Normative References 3. Terms and Definitions 4. Quality Management System 4.1 General Requirements 4.2 Documentation Requirements 4.2.1 General 4.2.2 Quality Manual 4.2.3 Control of Documents 4.2.4 Control of Records 5. Management Responsibility 5.1 Management Commitment 5.2 Customer Focus 5.3 Quality Policy 5.4 Planning 5.4.1 Quality Objectives 5.4.2 Quality Management System Planning 5.5 Responsibility, Authority, and Communication 5.5.1 Responsibility and Authority 5.5.2 Management Representative 5.5.3 Internal Communications 5.6 Management Review 5.6.1 General 5.6.2 Review Input 5.6.3 Review Output 6. Resource Management 6.1 Provision of Resources 6.2 Human Resources 6.2.1 General 6.2.2 Competence, Training, and Awareness 6.3 Infrastructure 6.4 Work Environment 7. Product Realization 7.1 Planning of Product Realization 7.2 Customer-Related Processes 7.2.1 Determination of Requirements Related to the Product 7.2.2 Review of Requirements Related to the Product 7.2.3 Customer Communication 7.3 Design and Development 7.3.1 Design and Development Planning 7.3.2 Design and Development Inputs 7.3.3 Design and Development Outputs 7.3.4 Design and Development Review 7.3.5 Design and Development Verification 7.3.6 Design and Development Validation 7.3.7 Control of Design and Development Changes 7.4 Purchasing 7.4.1 Purchasing Process 7.4.2 Purchasing Information 7.4.3 Verification of Purchased Product 7.5 Production and Service Provision 7.5.1 Control of Production and Service Provision 7.5.2 Validation of Processes for Production and Service Provision 7.5.3 Identification and Traceability 7.5.4 Customer Property 7.5.5 Preservation of Product 7.6 Control of Monitoring and Measuring Equipment 8. Measurement, Analysis, and Improvement 8.1 General 8.2 Monitoring and Measurement 8.2.1 Customer Satisfaction 8.2.2 Internal Audit 8.2.3 Monitoring and Measurement of Processes 8.2.4 Monitoring and Measurement of Product 8.3 Control of Nonconforming Product 8.4 Analysis of Data 8.5 Improvement 8.5.1 Continual Improvement 8.5.2 Corrective Action 8.5.3 Preventive Action<br style=\"\"></p><ul style=\"\">  </ul>  <hr style=\"\">  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Certificate of Completion provided.</strong></li>  \t<li style=\"\"><strong style=\"\">Satisfaction Guaranteed. Get your money back in 30 days if you are not satisfied. No Questions Asked! <u style=\"\">There is no reason to delay because I am taking all the risks. There is no risk to you.</u><br style=\"\">  \t</strong></li>  </ul>  <hr style=\"\">  <p style=\"\">  \t                                                                                                             This course is priced at great introductory price of <strong style=\"\">just $98</strong>.  </p>  <hr style=\"\">  <p style=\"\">  \t                                                                                   This course is prepared based on my 30 years of practical experience in Quality Management.  </p>  <p style=\"\">  \t                                                                                   This course provides clause by clause explanation of ISO 9001:2008 standard and implementation guide.  </p>  <p style=\"\">  \t                                                                                                             You will learn the auditing skills  through short and easy to understand video lessons and quizzes. Discussion forum on  the right side of this course would be  used to discussed specific  problems and issues.  </p>  <hr style=\"\">  <p style=\"\">  \t<strong style=\"\">30   Day   Money   Back   Guarantee</strong>  </p>  <p style=\"\">  \t                                                                                                             Don&#039;t   forget,   all   my   Courses have   an    unconditional,   30   Day   Money Back   Guarantee.      This    means   you   have   absolutely   no   risk   when   signing   up   to    one of   my   great   Courses.      I   never   ask   questions   and    always   refund 100% in full.  </p>  <hr style=\"\">  Click   on   the Blue   “Take   This   Course&quot;   Button   at   the   Top Right   Hand   Side   of   the   Page  Then   follow   the   instructions   to   register   and   pay   for   the course.  <hr style=\"\">", 
    "end_date": null, 
    "title": "Understanding and Implementing ISO 9001:2008", 
    "price": "20.00", 
    "instructors": "Sandeep Kumar ­", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/354886_5947_5.jpg", 
    "course_url": "https://www.udemy.com/iso-9001/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T01:32:42Z"
}