{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong>Emotional intelligence </strong>is the ability to <strong>combine thinking </strong>with <strong>feelings </strong>in order to <strong>build good quality relationships</strong> and to make <strong>good authentic decisions</strong>.</p><p>Emotional intelligence is different from IQ - cognitive intelligence, and offers <strong>a different perspective on success</strong> and <strong>performance at work</strong>.</p><p>This introduction course looks at what emotional intelligence is and what it is not.   It looks at some models of emotional intelligence and what they mean. </p><p>The course covers the <strong>advantages </strong>and <strong>disadvantages </strong>of emotional intelligence, ways it can be improved and <strong>some do's and don'ts</strong> of working with emotional intelligence.<br></p><p>Changing the way that you work with your emotions is not easy.  This course will give you <strong>some insights</strong> BUT developing your emotional intelligence will take you <strong>time </strong>and <strong>a lot of effort</strong>, and even then you are not going to get it right all the time!!</p><p>The course contains narrated videos, quizzes and some fun material to download - including a series of complementary crib cards.  </p><p>There is also an exercise for you to do outside of the course to find out how you view your emotional intelligence and how others view your emotional intelligence. This involves some activity with other people and some reflection.  It will help to guide you on what and how you need to change.  <em>[<strong>WARNING</strong>: this takes some effort and you may not like what you find out!]</em></p><p>The course material makes up part of a one day workshop endorsed by the <strong>Institute of Leadership and Management</strong>.  It is equivalent to about 8 hour's CPD  training.  </p><p>Please note that all programmes are continually refined and updated to ensure they remain current and relevant.<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Work with Emotional Intelligence for a Richer, Fuller Life", 
    "price": "20.00", 
    "instructors": "Robin Hills", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580110_c18d_5.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-emotional-intelligence/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T13:11:18Z"
}