{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p style=\"\">  \t                   Requirements define the future. They express conditions that their author expects the future to fulfill. Unfortunately, the word “requirement” has become a four-letter-word in many organizations, particularly when the requirements define a future Information Technology (IT) application. The reason? Nearly every independently executed, root-cause analysis of IT project problems and failures in the past half-century have identified “misunderstood or incomplete requirements” as the primary cause. This has made requirements the bane of many projects. The real problem is the subtle differences between “understanding” someone else’s requirement and “sharing a common understanding” with the author.  </p>  <p style=\"\">  \t                &quot;Writing Better Requirements in Plain English&quot; gives you a set of 3 simple rules that will make your requirement statements more easily understood by all target audiences. The focus is to increase the “common understanding” between the author of a requirement and the solution providers (e.g., in-house or outsourced IT designers, developers, analysts, and vendors).  </p>  <p style=\"\">  \t                This course is the first in a series of three that will dramatically reduce the failure rate of projects suffering from poor requirements. Regardless of your job title or role, if you are tasked with communicating your future needs to others, this course will help.  It is interactive (includes exercises with instant feedback), instructionally designed (based on modern learning theory), and &quot;intellimated™&quot; (uses animated visuals with an accompanying audio track) to hold your interest and increase retention.  </p>", 
    "end_date": null, 
    "title": "Writing Better Requirements in Plain English", 
    "price": "20.00", 
    "instructors": "Tom and Angela Hathaway, Daniel Myers", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/275246_fa86_4.jpg", 
    "course_url": "https://www.udemy.com/writing-software-requirements-it-projects/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-05T13:29:51Z"
}