{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t<strong>Erleben Sie in unserem Online-Video-Kurs alle Zeitmanagement Methoden der neusten Generation. Begreifen Sie unser Zeitmanagement Seminar als ein Werkzeug Ihre pers&ouml;nlichen Ziele zu erreichen. Starten Sie jetzt mit unseren Zeitmanagement Tipps durch. Ihre Personal &amp; Business Coaches Michael Bloss und Michael Mey sind Zeitmanagement-Experten und werden Ihnen ein Zeitmanagement Training der Extraklasse verpassen - Von A wie Alpen Methode bis Z wie Zeitdieb!</strong>  </p>  <p>  \t    Sie wollen Ihr Einkommen in den n&auml;chsten 12 Monaten um 30% steigern?  </p>  <p>  \t    Sie wollen bessere Noten in Schule / Studium bekommen?  </p>  <p>  \t    Sie m&ouml;chten ab sofort mehr Freizeit mit Ihrer Familie und Ihren besten Freunden verbringen?  </p>  <p>  \t    Sie wollen eine harmonische Partnerschaft f&uuml;hren, oder endlich Ihre Traumfrau bzw. Traummann kennen lernen?  </p>  <p>  \t    Sie m&ouml;chten bis zum n&auml;chsten Sommer eine attraktive Strandfigur bekommen?  </p>  <p>  \t    Sie wollen sich ab sofort ges&uuml;nder ern&auml;hren, oder ab morgen endlich mit dem Rauchen aufh&ouml;ren?  </p>  <p>  \t    Sie m&ouml;chten vor gro&szlig;en Gruppen Pr&auml;sentationen halten und einfach selbstbewusster und souver&auml;ner werden?  </p>  <p>  \t    Sie wollen sich mehr Ruhe, Entspannung und Ausgleich g&ouml;nnen?  </p>  <p>  \t    Unabh&auml;ngig davon welche Ziele Sie genau erreichen wollen - Sie brauchen immer Zeit Ihre Ziele zu erreichen! Sie brauchen jetzt sofort eine pers&ouml;nliche und individuelle Strategie diese Zeit zu gewinnen!  </p>  <p>  \t<strong><em><br>  \t</em></strong>  </p>  <p>  \t<strong><em>&bdquo;Wie Sie Ihre gewonnene Zeit nutzen, entscheiden bei uns nur Sie&ldquo;</em></strong>  </p>  <p>  \t<strong><em><br>  \t</em></strong>  </p>  <p>  \t <strong>1) Schluss mit Orientierungslosigkeit - Sie haben Ihre pers&ouml;nlichen Ziele im Fokus</strong>  </p>  <p>  \t    Wir sind davon &uuml;berzeugt, dass das &bdquo;Werkzeug&ldquo; Zeitmanagement weit mehr f&uuml;r Sie tun kann, als Sie nur immer mehr in immer weniger Zeit leisten zu lassen. Selbstverst&auml;ndlich k&ouml;nnen Sie dieses Produkt auch ausschlie&szlig;lich daf&uuml;r nutzen. Im Zentrum unserer virtuellen Zeitmanagement Schulung stehen Sie und Ihre pers&ouml;nlichen Ziele. (Coaching Session #1)<a href=\"http://time-management-coaching.com/zeitmanagement-seminar\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>2) Schluss mit t&auml;glichem </strong><strong>Stress und Hektik - Sie sind entspannt und souver&auml;n</strong>  </p>  <p>  \t    Wir stellen die Themen Work Life Balance und Biorhythmus, gepaart mit Ihren eigenen Zielen und W&uuml;nschen, in den Mittelpunkt. Ein gesunder Ausgleich zwischen Freizeit und Berufsleben ist die Voraussetzung daf&uuml;r langfristig leistungsf&auml;hig zu sein - Das Leben (dazu geh&ouml;rt auch Ihre Karriere) ist kein Kurzsprint, sondern ein Marathon. Unser Coaching ist eine hervorragende Burn-Out- und &quot;Herzinfarkt mit 50&quot;-Pr&auml;vention. (Coaching Session #2 und Coaching Session #3)<a href=\"http://time-management-coaching.com/biorhythmus\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>3) Schluss mit Ausreden - Sie wissen was Sie wollen und tun jetzt was n&ouml;tig ist</strong>  </p>  <p>  \t    Zeit kann man nicht managen - Die Art und Weise, wie Sie Ihre Aufgaben und T&auml;tigkeiten angehen schon. Der Weg des geringsten Widerstandes ist dabei h&auml;ufig so verlockend und f&uuml;hrt langfristig doch immer in die Katastrophe. Sie wissen - eigentlich - ganz genau was zu tun ist und - eigentlich - n&ouml;tig, um erfolgreicher, zufriedener und motivierter zu sein. Beim Abschlag eines Golfballs entscheiden wenige Millimeter &uuml;ber die richtige Flugbahn - &uuml;ber Erfolg, oder Niederlage. Wir zeigen Ihnen, wie Sie Gewohnheiten und Verhalten &auml;ndern k&ouml;nnen, ohne gleich Ihr ganzes Leben auf den Kopf zu stellen. Manchmal sind es eben nur Millimeter. (Coaching Session #4)<a href=\"http://time-management-coaching.com/gewohnheiten-aendern\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>4) Schluss mit Verwirrung - Sie planen Ihren Alltag und haben alles im Griff</strong>  </p>  <p>  \t    Wir sorgen daf&uuml;r, dass Sie morgens aufwachen und genau wissen was zu tun ist. Auf unvorhergesehene Ereignisse k&ouml;nnen Sie deutlich schneller, flexibler und besser reagieren, wenn Sie die &Uuml;bersicht und einen Plan haben. Wir zeigen Ihnen, wie Sie realistisch und intelligent ein Zeitplanbuch f&uuml;hren und bestens vorbereitet in den Tag/ die Woche/ den Monat/ das Jahr starten. (Coaching Session #5)<a href=\"http://time-management-coaching.com/zeitplan\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>5) Schluss mit &Auml;ngstlichkeit - Sie treffen selbstbewusst Entscheidungen</strong>  </p>  <p>  \t    Priorit&auml;ten setzen, selbstbewusst sein und richtige Entscheidungen treffen. Zeitmanagement ist ein Werkzeug Ziele zu erreichen. Dies k&ouml;nnen Ihre ganz pers&ouml;nlichen Ziele sein, oder die Ziele von Anderen. Ohne Ziele ist Zeitmanagement absolut zweck- und sinnfrei. Wir richten unseren Zeitmanagement Kurs auf Ihre Ziele aus, die Sie gleich zu Beginn in der ersten Coaching Sessionsetzen. Im Alltag wird der eigene Zeitplan schnell durcheinander gebracht. Sie lernen anfallende Aufgaben zu priorisieren und richtig einzusch&auml;tzen. (Coaching Session #6)<a href=\"http://time-management-coaching.com/prioritaeten-setzen\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>6) Schluss mit 100% Ergebnis - Sie handeln ziel- und ergebnisorientiert</strong>  </p>  <p>  \t    Falscher Perfektionismus hindert oft daran rechtzeitig Ergebnisse zu erzielen. Dahinter steckt oft die Einstellung bzw. manchmal sogar die Angst auf keinen Fall einen Fehler machen zu wollen. Mit der 80-20-Regel von Pareto und dem dahinter stehenden Konzept sind Sie in Zukunft bestens ger&uuml;stet mit so wenig Zeit wie n&ouml;tig ein hervorragendes und bestm&ouml;gliches Ergebnis zu erzielen. (Coaching Session #7)<a href=\"http://time-management-coaching.com/pareto-analyse\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>7) Schluss mit &Uuml;berlastung - Sie geben Verantwortung ab und lassen los</strong>  </p>  <p>  \t    Besonders F&uuml;hrungskr&auml;fte &uuml;berfordern sich gerne, denn sie k&ouml;nnen viel und wollen das auch gerne jederzeit und &uuml;berall beweisen. Bl&ouml;d, dass der Tag nur 24 Stunden hat. Wir bringen Ihnen bei zu jagen wie ein L&ouml;we. Haben Sie einen L&ouml;wen etwa schon einmal bei der Jagd gesehen? Nein! Genau, denn das Jagen hat er clever an seine Frauen, die L&ouml;winnen, delegiert. Sie delegieren in Zukunft ebenfalls Aufgaben und k&uuml;mmern sich um die Dinge, die f&uuml;r Sie Top-Priorit&auml;t haben. Z.B. so wie der L&ouml;we das eigene Revier zu verteidigen, oder einfach in der Sonne das verdiente Nickerchen zu halten. (Coaching Session #8)<a href=\"http://time-management-coaching.com/richtig-delegieren\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>8) Schluss mit Umst&auml;ndlichkeit - Sie sind effizient und effektiv im Flow</strong>  </p>  <p>  \t    Stellen Sie sich vor Sie h&auml;tten eine Einkaufsliste gemacht und w&uuml;rden f&uuml;r jeden einzelnen Artikel zum Supermarkt hin und zur&uuml;ck laufen. Das w&uuml;rde sicherlich niemand machen! Allerdings verhalten viele sich bei t&auml;glichen Aufgaben und T&auml;tigkeiten genau so umst&auml;ndlich. Wir werden gemeinsam herausfinden, wie Sie effektiv und effizient Aufgabenbl&ouml;cke bilden und Sie werden schnell im Alltag merken, dass es deutlich mehr Spa&szlig; macht Dinge hintereinander weg zu erledigen und Ihnen viel leichter von der Hand geht, wenn Sie erst einmal so richtig im Flow sind. (Coaching Session #9)<a href=\"http://time-management-coaching.com/aufgabenbloecke-bilden\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>9) Schluss mit Fremdbestimmung - Sie sagen freundlich &quot;Nein&quot;</strong>  </p>  <p>  \t    Warum f&auml;llt es oft so schwer einfach &quot;Nein&quot; zu sagen? Sicherlich man m&ouml;chte es sich nicht mit seinen Mitmenschen verscherzen, aber langfristig erzeugt ein halbherziges Ja eindeutig mehr Kummer und Unzufriedenheit, als ein freundliches und konsequentes: Nein. Die gute Nachricht lautet, dass es lediglich eine Frage der &Uuml;bung ist den richtigen Ton zu treffen und sich eine gute Argumentationsstrategie zurechtzulegen. Wir werden Ihnen die richtige Einstellung mit auf den Weg geben und Sie auf Ihren Auftritt vorbereiten. (Coaching Session #10)<a href=\"http://time-management-coaching.com/nein-sagen-lernen\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>  </p>  <p>  \t<strong>10) Schluss mit Aufschieberitis - Sie treten in Aktion und handeln</strong>  </p>  <p>  \t    Nur Videos gucken und unser e-Handbook lesen reicht nicht. Deswegen ist es bei unserem Zeitmanagement Seminar obligatorisch, dass Sie mit unserer &quot;Action des Tages&quot; Ihre Comfort-Zone verlassen. Diese gezielten &Uuml;bungen und Aufgaben haben f&uuml;r Sie - abh&auml;ngig von Ihrem Vorwissen und Grad an pers&ouml;nlicher Reife - unterschiedliche Schweregrade. Die Action des Tages verfestigt das Geh&ouml;rte und Gelesene und erm&ouml;glicht es Ihnen Methoden, Techniken und Tricks im Alltag zu erpoben und zu neuen, besseren Gewohnheiten werden zu lassen.  </p>  <p>  \t<strong>11) Schluss mit Looser-Verhalten - Sie haben eine eigene Erfolgs-Strategie</strong>  </p>  <p>  \t    Viele Berater, Trainer und Coaches machen den Fehler ihren Klienten die eigenen Erfolgsrezepte aufzwingen zu wollen und die Welt zu erkl&auml;ren. Das funktioniert fast nie, sorgt f&uuml;r Frust und De-Motivation. Wir machen das nicht. Wir geben Ihnen einen strukturierten Gesamt-&Uuml;berblick &uuml;ber die vorhandenen Methoden und Techniken. Nach unserem Zeitmanagement Coaching wissen Sie alles &uuml;ber Zeitmanagement was n&ouml;tig sein wird mehr Zeit f&uuml;rs Wesentliche zu gewinnen. Alles was Sie f&uuml;r Ihren Erfolg tun m&uuml;ssen ist auszuprobieren was f&uuml;r Sie funktioniert und was nicht. Oftmals reicht es sogar schon, wenn Sie es schaffen 20% unseres Wissens in Ihrem Leben umzusetzen, Zeit zu gewinnen und zu machen was Ihnen wichtig ist. Der alte Satz stimmt: Probieren geht &uuml;ber studieren! Also let&#039;s go!  </p>  <p>  \t<strong>12) Die beste uns sicherste Investition mit dem langfristig gr&ouml;&szlig;ten Gewinn? Ihre Pers&ouml;nlichkeit, Wissen und F&auml;higkeiten! </strong>  </p>  <p>  \t    Viele Menschen nehmen Ver&auml;nderungen in der Welt und in ihrem eigenen Leben als Bedrohungen war und reagieren mit Angst. Angst Fehler zu machen, Angst sich l&auml;cherlich zu machen, Angst etwas zu riskieren. Wir besch&auml;ftigen uns schon viele Jahre aktiv mit Pers&ouml;nlichkeitsentwicklung und noch viel l&auml;nger mit der dahinter stehenden Theorie und kommen zu einem eindeutigen Ergebnis: langfristig(!!!) betrachtet zahlt sich eine Investition in sich selbst und das eigene Leben immer aus! Wenn Sie K&ouml;rperkraft (Sport) investieren, werden Sie mehr Kraft und Energie erhalten; wenn Sie in die Liebe und in soziale Beziehungen investieren, dann werden Sie erf&uuml;llendere und tiefer gehende Beziehungen aufbauen; wenn Sie in Ihr Business (Mitarbeiter, Maschinen, Technologie etc.) investieren, dann wird Ihr Gesch&auml;ft wachsen. Kurzfristig gibt es immer R&uuml;ckschl&auml;ge und Niederlagen - langfristig ernten Sie Erfolg und Zufriedenheit.  </p>  <p>  \t    Dieses Prinzip gilt auch f&uuml;r Ihre eigene Pers&ouml;nlichkeit, denn diese ist der Motor, der alles am Laufen h&auml;lt. Unser Zeitmanagement Coaching Programm ist eine Direkt-Investition, die daf&uuml;r sorgt, dass Sie Ihre Ziele erreichen. Wir versprechen Ihnen, dass sich Ihr Leben zum Besseren ver&auml;ndern wird und Ihre Zufriedenheit steigt, denn unser Angebot d&uuml;rfte in seiner Aufmachung und umfangreichen, sowie inhaltlichen Qualit&auml;t momentan weltweit einzigartig sein - Geh&ouml;ren Sie zu den ersten, die jetzt davon profitieren!  </p>  <p>  \t    Fangen Sie an, wenn Sie dazu bereit sind - es wird keinen besseren Moment geben als jetzt, denn wenn Sie gerade diesen Text bis hierher gelesen haben, dann haben Sie sich in Ihrem Herzen schon l&auml;ngst daf&uuml;r entschieden etwas in Ihrem Leben zu &auml;ndern. Worauf warten Sie also noch? Vertrauen Sie genau auf dieses Gef&uuml;hl und investieren Sie!  </p>  <p>  \t<strong>Kommen Sie JETZT in unser Team!</strong>  </p>  <p>  \t <strong><br>  \t </strong>  </p>  <p>  \t    Ihre Personal &amp; Business Coaches  </p>  <p>  \t    Michael Mey &amp; Michael Bloss  </p>", 
    "end_date": null, 
    "title": "Zeitmanagement Coaching Programm", 
    "price": 0, 
    "instructors": "The Life Artists, Michael Mey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140702_359c_3.jpg", 
    "course_url": "https://www.udemy.com/zeitmanagement/", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-02T07:16:53Z"
}