{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p>  \t      ¿Es para mí el teletrabajo?  </p>  <p>  \t      Es un curso que permitirá a sus estudiantes conocer las definiciones y fundamentos del teletrabajo, los escenarios y requisitos para teletrabajar de tal forma que estén preparados para dar el paso en esta modalidad laboral o tener los argumentos para no teletrabajar.  </p>  <p>  \t      Durante el recorrido por sus 13 lecciones se conocerá los conceptos y requerimientos para desarrollar una actividad laboral mediante la modalidad de teletrabajo.  </p><p>Actualmente las empresas están adecuando sus procesos y su tecnología para ofrecer sus vacantes bajo la modalidad del teletrabajo. </p><p>Para acceder a los beneficios del teletrabajo, los futuros empleados bajo esta modalidad, deben estar preparados en los diferentes frentes que se requieren.</p><p>Si estás pensando en teletrabajar, en este videocurso online encontarás lo que necesitas saber. </p><p>Al finalizar las dos horas del curso, estarás preparado con los conceptos que necesitas para incursionar en el mundo laboral mediante la modalidad de teletrabjo.</p><ul><li>Entenderás que es el teletrabajo.</li><li>Conocerás los beneficios que ofrece el teletrabajo.</li><li>Conocerás las competencias que se requieren para teletrabajar.</li><li>Conocerás el marco legal para el teletrabajo.</li><li>Conocerás las herramientas para el teletrabajo.</li><li>Sabrás como preparar tu oficina para el teletrabajo</li></ul><p>No esperes más para descubrir la modalidad de trabajo del presente.</p>", 
    "end_date": null, 
    "title": "¿Es para mí el teletrabajo?", 
    "price": "25.00", 
    "instructors": "Ing. Cesar Escobar", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277722_3c29_4.jpg", 
    "course_url": "https://www.udemy.com/es-para-mi-el-teletrabajo/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-09T13:20:01Z"
}