{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><br></p><p>يشهد عالم التسويق تغيراً مضطرداً ومستمراً وسريعاً جداً بسبب التغير السريع في طبائع البشر الذي أفرزته تقنيات المعلومات ونظم العولمة ودخول الشركات العابرة للقارات وظهور شرائح جديدة مؤثرة في عالم المال والأعمال من أفراد وشركات وأفكار كسرت حواجز الحدود الدولية والفكر التقليدي والحاجات الأساسية والعقل النمطي والبرمجة العقلية للأسواق. <br></p><p>التسويق هو <strong>كل شيء</strong> تقوم به للترويج لعملك من اللحظة التي تؤسس بها عملك إلى المرحلة التي يفضل بها الزبائن منتجاتك وخدماتك عن بقية المنافسين ويشترونها <strong>باستمرار</strong>. </p><p>فالتسويق يشمل كل شيء: اختيارك لاسم الشركة، تعريفك للمنتج أو الخدمة التي ستطرحها، آلية التصنيع أو تقديم الخدمة، انتقاء الألوان، الأحجام، الشكل والتغليف، موقع العمل، الوسائل الترويجية، العلاقات العامة، تدريب مندوبي المبيعات، تخطيط أتيكيت التواصل الهاتفي، آليات حل المشاكل، خطة النمو والتطور، خطة استقطاب زبائن جدد بواسطة الزبائن القدامى، خطة المتابعة، وغيرها. </p><p>يمكن التفكير بالتسويق على أنه دائرة، نقطة البداية هي نفسها نقطة النهاية، فالبداية بالمنتج والنهاية هي توافد الزبائن جدد وقدامى بسبب السمعة المتنامية، فإن لم يكن كذلك فإن عملك سيمشي بخط مستقيم يبدأ بالتأسيس وينتهي بالإفلاس. </p><p>وبعبارة أخرى إن قسم التسويق يجب أن يعرف كيف يحدد ويقسم السوق إلى قطاعات وكيف يوزع سلعه وخدماته القادرة على تلبية احتياجات هذه القطاعات المستهدفة والتي تم اختيارها. وينبغي عليهم أن يعلموا كيف يحددون الأسعار على السلع المنتجة وكيف يجعلونها جذابة، وكيف يختارون القناة التسويقية والتحكم بها لإيصال هذه السلع والخدمات إلى المستهلك في كل مكان. وعليهم أن يعرفوا كيف يعلنون ويحركون سلعهم وخدماتهم بحيث يعرف المستهلك عنها ويرغب بالتالي في اقتنائها. </p>", 
    "end_date": null, 
    "title": "أهم أسس التسويق المعاصر", 
    "price": "50.00", 
    "instructors": "Sobhi Akbik", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640090_6da5_2.jpg", 
    "course_url": "https://www.udemy.com/modern_marketing_principles/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T06:54:29Z"
}