{
    "selfpaced": true, 
    "topic_name": [
        "Business"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">كن مديراً ناجحاً لموقعك أو مواقع عملائك وتعلم فنون إدارة الويب</strong></p>\n\n<p>أقدم لكم الدليل العملى الشامل لكيفية إدارة مواقع الويب باستخدام لوحة تحكم الاستضافة والتى لا غنى عنها فى أى موقع بالعالم والتى تمكنك من مراقبة وتطوير أداء موقعك والارتقاء به دائماً</p>\n\n<p>في هذا الكورس \"<strong class=\"redactor-inline-converted\">إدارة المواقع باستخدام cPanel</strong>\" تجد الطرق العملية المجربة 100% والتى تمنحك كافة الأدوات اللازمة لحجز الاستضافة والدومينات والتعامل معها وتشغيل موقعك وإدارة ملفاته بأمان وسهولة وتركيب أشهر وأسهل نظم إدارة المحتوى</p>\n\n<p>الآن يمكنك امتلاك كافة المهارات التى تحتاجها لإدارة أى موقع على الإنترنت وحل أغلب المشاكل التى تواجه موقعك لكى يعمل بأقصى كفاءة ممكنة وإدارة حسابات البريد الإلكتروني بموقعك للتواصل مع عملائك وزوارك للمزيد من الأمان والفاعلية</p>\n\n<p>ولأننى واثق من مدى قوة هذا الكورس ومن نتائجه المؤكدة النجاح، أقدم خدمة الدعم الفني للدارسين عقب الانتهاء من الكورس للإجابة عن استفساراتك ومساعدتك فى تنفيذ كل الخطوات العملية المشروحة في الكورس لكى تلمس بنفسك العائد الذى يمكنك الحصول عليه بعد امتلاك هذه المهارات المتميزة</p>\n\n<p><strong>فى هذا الكورس سوف تتعلم عملياً ما يلى:</strong></p>\n\n<ul><li>اختيار خطة الاستضافة المناسبة لك ولاحتياجات عملائك</li><li>حجز الاستضافات المتقدمة التى تتناسب مع الاحتياجات التجارية والشركات الكبرى</li><li>خطوات حجز الاستضافة</li><li>وسائل الدفع على الإنترنت والشراء بأمان وتجنب مشاكل الشراء المعتادة</li><li>الحصول على خصومات وعروض خاصة</li><li>الاحتفاظ ببيانات الاستضافة وتسهيل الوصول إليها وتأمينها في نفس الوقت</li><li>اختيار وحجز الدومين المناسب</li><li>الحصول على الخصومات وبيانات الدومين</li><li>تشغيل الموقع وحل مشاكل Name Servers</li><li>إعدادات التعامل مع حسابات البريد الإلكترونى</li><li>إعدادات لوحة التحكم ورفع كفاءة كلمة السر الإدارية</li><li>إنشاء وإدارة Email Accounts</li><li>الدخول إلى Web Mail</li><li>إعادة توجيه الإيميلات Forwarders</li><li>الرد التلقائي Autoresponders</li><li>إدارة القوائم البريدية Email Lists</li><li>إدارة محتوى الموقع</li><li>إدارة الموقع من خلال File Manager</li><li>إدارة وتأمين حساباتFTP </li><li>إدارة الموقع من خلال برنامج FileZilla</li><li>صمم موقعك في دقائق وحافظ على استمراريته</li><li>إدارة الدومينات الفرعية Subdomains</li><li>أسرع طرق بناء وتنشيط الموقع من خلال Weebly</li><li>تجهيز الصفحات والتصميمات والنشر</li><li>عمل نسخة احتياطية واسترجاع الموقع</li><li>مراجعة استهلاك الاستضافة Disk Space Quota</li></ul>\n\n<p>كما يشتمل الكورس على كافة المصطلحات الانجليزية التى تحتاجها لفهم هذا المجال مع شرح مبسط لمعنى كل مصطلح مما يساهم في رفع قدرتك على متابعة كافة التطورات في هذا المجال</p>", 
    "end_date": null, 
    "title": "إدارة المواقع باستخدام cPanel", 
    "price": "20.00", 
    "instructors": "Mohammed Fakhry", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/832756_a4fc_2.jpg", 
    "course_url": "https://www.udemy.com/cpanel-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Management"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-26T19:31:01Z"
}