{
    "selfpaced": true, 
    "topic_name": [
        "Chemistry"
    ], 
    "description": "\n\n                    \n                    \n                    This course will cover the topics of a full year, two semester General Chemistry course.  We will use a free on-line textbook, Concept Development Studies in Chemistry, available via Rice’s Connexions project. \n\nThe fundamental concepts in the course will be introduced via the Concept Development Approach developed at Rice University.  In this approach, we will develop the concepts you need to know from experimental observations and scientific reasoning rather than simply telling you the concepts and then asking you to simply memorize or apply them.\n\nSo why use this approach? \n\nOne reason is that most of us are inductive learners, meaning that we like to make specific observations and then generalize from there.  Many of the most significant concepts in Chemistry are counter-intuitive.  When we see where those concepts come from, we can more readily accept them, explain them, and apply them. \n\nA second reason is that scientific reasoning in general and Chemistry reasoning in particular are inductive processes.  This Concept Development approach illustrates those reasoning processes.  \n\nA third reason is that this is simply more interesting! The structure and reactions of matter are fascinating puzzles to be solved by observation and reasoning.  It is more fun intellectually when we can solve those puzzles together, rather than simply have the answers to the riddles revealed at the outset.\n\nRecommended Background: \nThe class can be taken by someone with no prior experience in chemistry.  However, some prior familiarity with the basics of chemistry is desirable as we will cover some elements only briefly.  For example, a prior high school chemistry class would be helpful.\n\nSuggested Readings:\nReadings will be assigned from the on-line textbook “Concept Development Studies in Chemistry”, available via Rice’s Connexions project. In addition, we will suggest readings from any of the standard textbooks in General Chemistry.  A particularly good free on-line resource is Dickerson, Gray, and Haight, \"Chemical Principles, 3rd Edition\".  Links to these two texts will be available in the Introduction module.\n\n                                            Syllabus\n                        IntroductionThis lecture will cover the unique approach used in this course to the introduction of the fundamental concepts of Chemistry. The Concept Development Study approach was created, implemented, developed and refined at Rice over the course of more than twenty years.  In this pedagogy, each new concept is developed from experimental observations and scientific reasoning.  By contrast, most introductory Chemistry courses simply present each concept as an accepted fact, without foundation.  This is why most Chemical concepts seem abstract and unapproachable. The CDS approach has been shown to more effective for most beginning students. I hope that this opening lecture will pique your curiosity about how you might learn Chemistry in a way which is more effective and more fun.Atomic Molecular Theory and Atomic MassesChemistry can be understood fundamentally as the study of atoms and molecules.  In this module, we will examine the experiments which reveal that all matter is composed of atoms which combine to form molecules.  The clever analysis of these experiments illustrates scientific reasoning at its finest, allowing us to understand the existence and properties of particles which could not be directly observed.  In addition, by measuring the relative masses of the different types of atoms, we can begin to predict the ratios of masses of reactants and products during a chemical reaction.Structure of an Atom and the Electron Shell ModelProving the existence of atoms and knowing that they combine to form molecules does not provide a means to predict how or why these atoms might combine.  This requires greater detail about the structure and properties of individual atoms.   In this module, we extend our understanding of atoms by making observations which reveal the internal structure of the atom including a model for the arrangement of the electrons around the atomic nucleus.  Electron Energies and OrbitalsThe electron shell model does not account for all of the observable properties of atoms, including the energies and motions of electrons.  In this module, we observe that these energies are quantized.  We also observe behaviors which reveal the surprising fact that electron motion is described by waves or “orbitals” which provide the probability for the movement of the electrons about the nucleus.  This module takes us into the strange world of quantum mechanics.Bonding and Structures in Covalent MoleculesTo understand the types of compounds which can be formed and the properties of those compounds, we have to understand how atoms bond together to form molecules.  In this module, we develop a model for the bonding of non-metal atoms to non-metal atoms, called a covalent bond.   The model can be used to predict which combinations of atoms are stable and which are unstable.  Observations of the structures of the molecules lead to a model to understand molecular geometries and properties related to those geometries.  From this, we build a foundation for understanding and predicting how molecular structure is related to molecular reactivity and function.Types of Bonding: Non-Metals, Metals, and Salts In this module, we extend our model of bonding by observing properties of compounds formed between metals and non-metals.  These properties reveal the existence of ionic bonds, which contrast to covalent bonds.  We also consider the properties of pure metals and of metal compounds, leading to a model which explains the bonding between metals atoms.  We develop a means to differentiate and predict the three types of bonding: covalent, ionic, and metallic.Energy Changes and Reaction EnergiesChemical reactions involve energy changes, most commonly with the transfer of heat into or out of the reaction.  Many chemical reactions are performed specifically because of the release of heat or other forms of energy.  In this module, we develop a means to measure these energy transfers and we use these measurements to develop laws which govern energy transfers.  These laws permit us to calculate and predict energy changes during reactions and to understand the energy of a reaction in terms of the energies of the bonds between atoms breaking and forming during a reaction.Ideal Gas Law and the Kinetic Molecular Theory One of the powers of chemistry is the ability to relate the properties of individual molecules to the physical and chemical properties of the compounds of these molecules. In other words, we want to relate the atomic molecular world to the macroscopic world of materials.  We begin this study by observing the physical properties of gases and deriving an equation which relates these properties.  From this law, we can devise a model which describes how these physical properties result from the properties and motions of individual molecules.  Understanding the significance of temperature is a critical part of this study.Phase Transitions and Phase EquilibriumSubstances can exist in different physical states, which we call “phases.”  These include solid, liquid and gas.  In this module, we study the transitions between these phases, which are observed to occur only at specific combinations of temperature and pressure.  In addition, we observe that phases exist in equilibrium with one another at this specific temperatures and pressures.  We develop from our observations a model to describe phase equilibrium using the concepts of the kinetic molecular theory deduced in the previous module.Chemical KineticsChemical reactions occur at very different rates, some occurring so slowly that we only notice them with great passing of time and some occurring explosively rapidly.  In this module, we develop measurements of the rates of reaction, determining the factors which can make a reaction proceed more rapidly or more slowly.  These observations are summarized in equations called Rate Laws, where each reaction has its own empirical rate law.  By using kinetic molecular theory, we develop a model to understand how and why each factor in the rate law is important in determining the rate of a chemical reaction.Chemical EquilibriumMany chemical reactions are observed to “go to completion,” meaning that essentially all of the reactants are consumed in creating products within the constraints of the stoichiometry of the reaction.  However, other chemical reactions do not go to completion.  Rather, we observe that reactants and products can coexist simultaneously at specific observable concentrations or pressures.  This equilibrium between reactants and products is observed to follow an equation called the equilibrium constant.  In this module, we observe many examples of reactions at equilibrium, we measure their equilibrium constants, and we use these to make predictions about how to maximize the yield of chemical reactions.  Included in these important reactions are those involving acids and bases. Chemical ThermodynamicsOne of the most subtle aspects of chemistry is in understanding the factors which make a chemical reaction favorable or unfavorable.  In this module, we pursue this understanding by observing what makes a process “spontaneous,” and we develop the concept of entropy as a predictive tool for spontaneity.  We observe the second law of thermodynamics, and from this, we develop a model for predicting chemical equilibrium based on a new quantity called the “free energy.”  We conclude by relating the free energy to the equilibrium constant observed in a previous module, culminating in one of the most beautiful theories in all of science.\n                                    ", 
    "end_date": "2015-09-16T00:00:00Z", 
    "title": "General Chemistry: Concept Development and Application", 
    "price": 0, 
    "instructors": "John Hutchinson", 
    "institution_name": [
        "Rice University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/general-chemistry", 
    "duration": "11 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-07-01T00:00:00Z"
}