{
    "selfpaced": false, 
    "topic_name": [
        "Chemistry"
    ], 
    "description": "\n\n                    \n                    \n                    Con este curso aprenderás los conceptos básicos relacionados con las reacciones químicas y profundizarás en su estudio desde el punto de vista cuantitativo, es decir su estequiometría. Entenderás el comportamiento de los gases y las disoluciones y aplicarás las leyes que regulan su comportamiento en los procesos químicos en los que participan.\n \nLa ecuación química representa lo que sucede cuando tiene lugar un proceso en el que unas sustancias se convierten en otras mediante una “reacción química”.\nEn las reacciones se cumple la ley de la conservación de la masa y es posible calcular las cantidades de reactivos que reaccionan y de productos que se obtienen.\n \nEl estudio de las reacciones químicas y de los aspectos cuantitativos de las mismas, es decir su “estequiometría”, es competencia de la Química, una materia básica que se estudia en muchas titulaciones Universitarias.\n \nEste curso va dirigido a los alumnos que acceden a la Universidad, especialmente aquellos que no han cursado Química y que requieren de los conocimientos básicos en estos aspectos.\n \nLas unidades que trataremos:\n\nConceptos básicos: masa, mol y fórmula química\n\tGases. Ecuación de los gases ideales\n\tDisoluciones y formas de expresar la concentración\n\tEcuaciones y reacciones químicas\n\tEstequiometría y cálculos en reacciones completas\n\tReacciones reversibles y cálculos estequiométricos en el equilibrio\n\n\n                                    ", 
    "end_date": "2017-06-06T00:00:00Z", 
    "title": "IQ101.4x: Reacciones Químicas y Cálculos Estequiométricos", 
    "price": 0, 
    "instructors": "Carmen Gómez Benito and Isabel Morera Bertomeu", 
    "institution_name": [
        "Universitat Politècnica de València"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.edx.org/course/reacciones-quimicas-y-calculos-upvalenciax-iq101-4x-0", 
    "duration": "49 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-28T00:00:00Z"
}