{
    "selfpaced": false, 
    "topic_name": [
        "Chemistry"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Science\n                                                                                                    &gt; Chemistry\n                                                            \n                            \n                                                \n                    \n                    \n                    This course is about how the brain creates our sense of spatial location from a variety of sensory and motor sources, and how this spatial sense in turn shapes our cognitive abilities.\n\nKnowing where things are is effortless.  But “under the hood,” your brain must figure out even the simplest of details about the world around you and your position in it.  Recognizing your mother, finding your phone, going to the grocery store, playing the banjo – these require careful sleuthing and coordination across different sensory and motor domains.  This course traces the brain’s detective work to create this sense of space and argues that the brain’s spatial focus permeates our cognitive abilities, affecting the way we think and remember.\n\nThe material in this course is based on a book I've written for a general audience.  The book is called \"Making Space: How the Brain Knows Where Things Are\", and is available from Amazon, Barnes and Noble, or directly from Harvard University Press. \n\nThe course material overlaps with classes on perception or systems neuroscience, and can be taken either before or after such classes.\n\nDr. Jennifer M. Groh, Ph.D.\nProfessor\nPsychology &amp; Neuroscience; Neurobiology\nDuke University\n www.duke.edu/~jmgroh\n\nJennifer M. Groh is interested in how the brain process spatial information in different sensory systems, and how the brain's spatial codes influence other aspects of cognition.  She is the author of a recent book entitled \"Making Space:  How the Brain Knows Where Things Are\" (Harvard University Press, fall 2014).\n\nMuch of her research concerns differences in how the visual and auditory systems encode location, and how vision influences hearing.  Her laboratory has demonstrated that neurons in auditory brain regions are sometimes responsive not just to what we hear but also to what direction we are looking and what visual stimuli we can see.  These surprising findings challenge the prevailing assumption that the brain’s sensory pathways remain separate and distinct from each other at early stages, and suggest a mechanism for such multi-sensory interactions as lip-reading and ventriloquism (the capture of perceived sound location by a plausible nearby visual stimulus).\n\nDr. Groh has been a professor at Duke University since 2006.  She received her undergraduate degree in biology from Princeton University in 1988 before studying neuroscience at the University of Michigan (Master’s, 1990), the University of Pennsylvania (Ph.D., 1993), and Stanford University (postdoctoral, 1994-1997).  Dr. Groh has been teaching undergraduate classes on the neural basis of perception and memory for over fifteen years.  She is presently a faculty member at the Center for Cognitive Neuroscience and the Duke Institute for Brain Sciences at Duke University.  She also holds appointments in the Departments of Neurobiology and Psychology &amp; Neuroscience at Duke.\n\nDr. Groh’s research has been supported by a variety of sources including the John S. Guggenheim Foundation, the National Institutes of Health, the National Science Foundation, and the Office of Naval Research Young Investigator Program, the McKnight Endowment Fund for Neuroscience, the John Merck Scholars Program, the EJLB Foundation, the Alfred P. Sloan Foundation, the Whitehall Foundation, and the National Organization for Hearing Research.\n\n                                            Syllabus\n                        Course Introduction and Vision (Part 1)This module contains an introduction to the course as a whole (Video 1.1) and an exploration of how our eyes detect light and deduce the location light is coming from (Videos 1.2-1.6). You'll also learn about how scientists from Democritus to Alhazen to Kepler figured this out. The final video for the module involves an experiment to test what happens when special goggles turn the world upside down (Video 1.7). I'll show experiments frequently throughout this course -- they are how we know what we know. This module’s quiz is ungraded and available to both auditors and certificate students.  Consider it a sample of the style of question in the quizzes for the remaining modules, and an opportunity to determine if you’d like to pursue a certificate for this course.  Vision (Part 2), the Body, and Neural SignalsIn this unit, we cover the visual scene in 3D - the many clues to depth. We then turn to body senses (position and touch) and how our brains detect the configuration of our own bodies. Along the way, we cover the resting membrane potential, the action potential, and how they arise. Finally, we bring vision and the body together, and throw some beanbags at a visual target while wearing prisms! This material is covered in Making Space, chapters 2 and 3.  Brain MapsIn this unit, we turn to the brain and how it uses the spatial position of neurons within the brain to organize information about the spatial position of stimuli in the world (Making Space chapter 4). You'll learn about how we identify where one object ends and another begins, what a receptive field is, and how some neurons are sensitive to edges and the boundaries of objects. Maps occur in both visual cortex and body (somatosensory) cortex, and these maps may be responsible for various \"phantom\" sensations (examples from normal vision, patients with body part amputations, and electrical stimulation experiments). Sound and Brain RepresentationsIn module 4, we turn to the fascinating puzzle of how we deduce sound location--a process that requires quite a bit of detective work. Our brains piece together multiple types of clues, including subtle differences in timing, loudness, frequency content, and how sounds appear to change as we turn our heads. Because our ears don't form images of sounds, our brains don't have to use maps to encode sound location. The second half of the videos this module concern alternative forms of brain representation, how the brain translates between different types of representation, and what we know about brain representations for sound location. The material is covered in chapter 5, \"Sherlock Ears\" and chapter 6, \"Moving with Maps and Meters\", in Making Space. Be forewarned, there are about 70 minutes of video this module, as compared to previous modules' 50-60 minutes. After watching the full set, you'll see why these videos are grouped together as a unit. To make things more manageable, we've broken the quiz into two parts; that way, you can get feedback on one part before moving on to the next, if you like. Reference Frames and NavigationThis module we turn to how spatial locations are defined, and discuss the concept of a reference frame. Initially, reference frames are quite different for visual, auditory, and somatosensory information. Visual location is defined with respect to the eyes, whereas sound locations are detected with respect to the head and ears, and tactile locations are detected based on body surface position. As you'll see, the brain transforms these signals into new reference frames to facilitate interactions between these sensory systems. We then consider space on a larger scale, and ask how we know where we are and how we navigate from one place to another. Knowledge of self-motion relies in part on the vestibular system, our sense of balance. The vestibular system works in concert with vision and motor systems to update our sense of position and keep us from getting lost. This module's material is covered in chapters 7, \"Your Sunglasses Are in the Milky Way\", and 8, \"Going Places\" of Making Space.Memory and CognitionIn this final module of the course, we build several important links between the sense of space and other kinds of cognition. Videos 6.1-6.5 concern the relationship between space and memory. Memory is reflected in multiple different kinds of neural mechanisms and involves multiple brain regions. The memory and spatial functions of these mechanisms and brain regions overlap. Video 6.5 in particular features work by John O'Keefe concerning response patterns known as \"place fields\" in the hippocampus, and work by May-Britt and Edvard Moser concerning grid cells. This seminal work was recognized by the 2014 Nobel Prize in Medicine and Physiology. Videos 6.6-6.9 turn to thought more generally, and present a series of theories and experiments that suggest that the brain is actually using sensory and motor structures to think and reason. Thus, our brain systems for space may be engaged in a wide set of mental functions, which are shaped by the multiple purposes of this neural infrastructure. This module's material is covered in chapters 9, \"Space and Memory\", and 10, \"Thinking about Thinking\" of Making Space. I hope you enjoy this synthesis of all you have learned and what it means!\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "The Brain and Space", 
    "price": 0, 
    "instructors": "Jennifer Groh", 
    "institution_name": [
        "Duke University"
    ], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/human-brain", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}