{
    "selfpaced": false, 
    "topic_name": [
        "Chemistry"
    ], 
    "description": "\n\n                    \n                    \n                    《有机化学》是研究各类有机化合物的结构、性质、相互转化及其规律的一门学科，是化学专业本科学生必修课之一，是生物化学、分子生物学、医学、药学等课程的先修课，在教学计划中占有重要的地位。\n\n本课程主要介绍烷烃、烯烃、芳香烃、卤代烃、醇、酚、醚，醛、酮、醌、羧酸及其衍生物、胺、杂环等有机化合物的性质、相互转化以及机理问题。此外，介绍立体化学和波谱学基础。\n\n通过本课程的学习，你能够掌握常见有机化合物的结构、命名和性质，掌握官能团之间的相互转换及其规律、以及立体化学特征、典型有机反应的机理，简单有机化合物的合成路线的设计等知识，从而为进一步的专业学习打下坚实基础。\n\n课程结构：\n\n本课程的学习内容包括：5~15分钟左右的视频课程，每个视频中间将出现1~2个课间提问，以辅助你的学习，每一章将会布置约10个单元练习题，课程结束后还会设立一次课程考试。\n\n学习该课程，你需要具备高中化学知识，并具备一定的大学无机化学或普通化学基础知识。\n\n推荐阅读：\n1. 唐玉海主编，《有机化学》，化学工业出版社，2011\n2. 邢其毅主编，《基础有机化学》，高等教育出版社，2009\n3. John E. McMurry, Eric E. Simanek, Fundamentals of Organic Chemistry (6th), USA: 2006\n\n                                            Syllabus\n                        绪论欢迎学习有机化学，有机化学是研究各类有机化合物的结构、性质、相互转化及其规律的一门学科。在本模块中你将学习什么是有机化学，什么是有机化合物；有机化合物有哪些特点；共价键有几种类型？σ键和π键是如何形成的，各自有何特点；共价键的断裂方式有几种；不同断裂方式对应哪种反应类型，以及有机化合物该如何分类等知识重点。烷烃和环烷烃本模块将重点介绍烷烃和环烷烃的结构、命名、性质。请你带着这些问题学习本模块内容：烷烃的命名方法是什么；什么是构象？何谓优势构象？环己烷什么构像最稳定；烷烃自由基取代反应的机制是什么；环烷烃与烷烃的化学性质有何异同；环烷烃稳定性与环的大小有何关系。烯烃和炔烃 本模块将重点介绍烯烃、炔烃和共轭二烯烃的结构特征，烯烃的亲电加成反应及机理，电子效应等知识。请你带着这些问题学习本模块内容：如何标记碳碳双键的构型；什么又是烯烃的亲电加成反应？其机理是什么；烯烃和炔烃在化学性质上有哪些异同点；什么是马氏规则；何为诱导效应和共轭效应。波谱学基础本模块将介绍有机波谱学的基本知识，包括核磁共振波谱、红外吸收光谱、紫外吸收光谱和质谱。请你带着这些问题学习本模块内容：何为有机化学四大波谱？它们在有机物结构鉴定方面主要解决什么问题；核磁共振发生的条件是什么？核磁氢谱的主要参数有哪些？如何解析核磁氢谱；影响分子振动吸收频率的主要因素有哪些；具有什么结构特征的化合物具有紫外吸收现象；质谱的原理又是什么？芳香化合物本重点介绍苯的结构、芳香烃的亲电取代反应及机制、亲电取代反应的定位效应、非苯性芳烃及Hückel规则。请你带着这些问题学习本模块内容：芳香烃是如何命名的；芳香烃的结构特点是什么；芳香性的含义是什么；怎样判断化合物分子是否具有芳香性；苯环上亲电取代反应的定位效应是什么？其原因又是什么？立体化学本模块将重点介绍立体异构中所涉及的一些基本概念。请你带着这些问题学习本模块内容：什么是旋光异构体？什么是旋光度、比旋光度；手性、手性分子、手性碳原子、对映异构体、非对映体、内消旋体、外消旋体分别是什么含义；分子的对称因素与手性有何关系？如何判断化合物是否具有旋光性；Fischer投影式的书写规则是什么；旋光异构体构型的标记方法有几种？又是如何标记的呢？卤代烃本模块将介绍卤代烃结构、类型及其反应，并重点介绍SN1、SN2、E1、E2反应及其机制。SN和E的竞争性反应等知识。请你带着这些问题学习本模块内容：卤代烃的分类方法有几种；伯卤代烃与叔卤代烃发生的亲核取代反应机制有什么不同；卤代烃的消除反应有什么规律？不同结构卤代烃发生消除反应的活性大小顺序如何；亲核取代反应和消除反应的竞争受哪些因素的影响；乙烯型卤代烃和烯丙型卤代烃发生亲核取代反应的活性有何不同？为什么？醇、酚、醚 本模块将醇、酚、醚的基本结构、命名和性质。请你带着这些问题学习本模块内容：醇的卤代及脱水反应中，为什么会出现分子重排产物；邻二醇都有哪些特性；酚的结构有什么特点？酚羟基与醇羟基有什么不同；鉴别醇和酚都有哪些方法；醚键是如何断裂的？取代环氧乙烷的开环反应有何规律？醛、酮、醌 本模块将重点介绍醛、酮、醌的结构和命名、醛酮的亲核加成反应、缩合反应、氧化还原反应等知识。请你带着这些问题学习本模块内容：醛、酮和醌在结构上有何联系与区别；醛酮亲核加成反应的机理与烯烃亲电加成反应的机理有何不同；不饱和醛酮的亲核加成反应是怎样进行的；什么是碘仿反应？羟醛缩合反应发生的条件是什么；醌的结构决定了它有哪些化学性质？羧酸及其衍生物 本模块将重点介绍羧酸及其衍生物的结构、分类和命名，羧酸的酸性及其影响因素，羧酸衍生物的亲核取代反应及其机制等知识。请你带着这些问题学习本模块内容：羧基中存在什么类型电子效应；羧酸的酸性强弱取决于哪些因素，有何规律；不同二元酸受热时所发生的反应有何差异；羧酸衍生物的水解、醇解和氨解属于什么反应类型？它们的活性次序如何；什么是Claisen酯缩合反应？什么类型的酯才能进行该反应。胺和杂环本模块将重点介绍胺和杂环化合物的结构、分类、命名及性质。请你带着这些问题学习本模块内容：伯、仲、叔胺的化学性质有何异同之处？如何鉴别；影响胺类碱性强弱的因素有哪些；胺和酰胺的化学性质有什么不同；为什么吡咯有一定的酸性而吡啶却显碱性；为什么吡啶既能发生亲电取代又能进行亲核取代反应。\n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "有机化学", 
    "price": 0, 
    "instructors": "唐 玉海", 
    "institution_name": [
        "Xi'an Jiaotong University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Science"
    ], 
    "course_url": "https://www.coursera.org/learn/organic-chemistry", 
    "duration": "11 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}