{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course your will know all about Search Engine Optimization.</p><p>First thing is that I will add more lectures soon and I will update this course from time to time. The course will be containing over 100 Lectures.</p><p>Following are the points that you will cover in this course,</p><ul><li><span></span><strong>What is Search Engine?</strong></li><li><strong>What is Search Engine Optimization and Why it is Important?</strong></li><li><strong>All about keywords, keywords research and best tools for keyword research.</strong></li><li><strong>Guide about doing SEO before starting a website or blog.</strong></li><li><strong>Factors of Search Engine Optimzation.</strong></li><li><strong>On page SEO &amp; Off Page SEO.</strong></li><li><strong>Guide to On Page SEO including keyword density, keyword stuffing and perfect post length.</strong></li><li><strong>How to Optimize Blog post with proper keyword placement in post, title, url, meta description and image in order to make the post search engine friendly.</strong></li><li><strong>Off Page SEO, Importance of Backlinks Dofollow &amp; Nofollow Links.</strong></li><li><strong>All about Link Building.</strong></li><li><strong>Blog Commenting, Its Importance, How to find blogs and How to write a good and satisfied comment.</strong></li><li><strong>What is Email outreach program, its importance, how to get market email addresses, how to compose Email and a worksheet for Email outreach work.</strong></li><li><strong>Directory Submission, Article Submission and Forum Posting with proper guide.</strong></li><li><strong>Social Bookmarking, Use fiverr for social bookmarking, 200+ dollow social bookmarking sites.</strong></li><li><strong>Will tell you about how I got 851 visits in just one night.</strong></li><li><strong>All about video sharing, best whiteboard animation tools, recording softwares and Sharing Sites.</strong></li><li><strong>What is Guest Posting, how to write an acceptable guest post, 200 Sites that accept guest post in different niche.</strong></li><li><strong>Three best SEO book that will guide to rank your website in top of Google.</strong></li></ul><p>This course will let you know each and every knowledge of SEO, Link Building and It's Strategies. With the help of this course you will be able to rank your or your client website. <br></p>", 
    "end_date": null, 
    "title": "(COMPREHENSIVE) SEO Course - Rank any website in Google", 
    "price": "20.00", 
    "instructors": "Hassan Ahmed, HasKom Instructors", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/646250_2d7f_3.jpg", 
    "course_url": "https://www.udemy.com/advance-seo-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T22:32:56Z"
}