{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>Are you ready for a major breakthrough in </em><em>SEO</em><em>?</em></p>  <p><strong>It takes only 10 minutes and $10 to get your YouTube video to page 1 of Google.</strong> This system is designed to help you<strong> dramatically improve the ranking of any YouTube video.</strong> Videos keep getting stuck on page 2? Time break through to the next level and get to page 1 by following this comprehensive system. </p>  <p><strong>This course is designed for ALL BUSINESSES </strong>– if you have a video for your business, you can<strong> get it to page 1 on Google </strong>with this method. This powerful 10-minute, 10-dollar system (taught through step-by-step videos) is designed to maximize your ranking results in under 1 month and often in only 1 week. <strong>This proven, effective system</strong> is not available from any other source.</p><p> During this in-depth training, you will learn how to properly write your video description, upload your video in a specific way to get Google’s attention, and get a secret set of high-quality backlinks for only $10.  </p>  <p>To make this method as easy as possible, I screen recorded the entire<strong> step-by-step process. </strong>When you join this course, you will receive <strong>bonus help through the forum,</strong> for which you have access to for a lifetime. </p><p><strong>And this method is risk-free with the attached money back guarantee.</strong> </p>  <p><em>This power</em><em>-</em><em>packed program </em><em>will train you to become an expert at ranking YouTube videos in Google. </em><strong>Realize that many companies often pay $7,000+ per month for video ranking. </strong>If you’re a business owner, you can drastically cut down on those costs. <strong>If you’re an SEO freelancer, you can offer your services to these businesses, charging hundreds of dollars for a process that only costs you $10. </strong></p>  <p>This comprehensive system includes the tools and techniques I have discovered - on accident – <strong>that can best rank a YouTube video on page one of Google.</strong></p>  <p>What does it take? Only<strong> 10 minutes and 10 dollars.</strong></p>", 
    "end_date": null, 
    "title": "10 Minute, 10 Dollar YouTube Video SEO Ranking System", 
    "price": "20.00", 
    "instructors": "We Teach Marketing, Damon Verial", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626600_e542_2.jpg", 
    "course_url": "https://www.udemy.com/video-ranking/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-30T03:04:32Z"
}