{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course has been designed to provide a quick and easy resource for both new and experienced SEOs. The video are short and straight to the point, I've gone into the most important parts of SEO and teach you have to set them up quickly.</p><p>It doesn't matter whether you are business owner looking to improve your company's rankings or whether your interested in a career in SEO, these videos will jump start the process.</p><p>The course breaks down SEO into 6 sections;</p> <ul><li><strong>Keyword Research</strong> – Probably the most important section, find out those special keywords that are going to drive traffic and ultimate turn into conversions.</li> <li> </li> <li><strong>On-Page</strong> – This is the foundation for SEO, on-page SEO makes sure search engines can find your content and index it properly. </li></ul>  <ul><li><strong>Local</strong> – If you own a local business there are extra steps in order to fully optimize your website.</li></ul>  <ul><li><strong>Wordpress</strong> – Wordpress is great for SEO out-the-box but make sure you use its full potential.</li></ul>  <ul><li><strong>Monitoring</strong> – After you've set up your SEO campaign it's now time to start monitoring those results so you can show your boss how well your doing!</li></ul>  <ul><li><strong>Tips, Tricks and Advice</strong> - These are the small things I've picked up from reading countless blogs, articles and podcast on SEO.</li></ul> <p>Not only will you get all of this but I will be updating the videos when needed so you can stay up-to-date with Googles new algorithms and any new tricks I may learn.</p>", 
    "end_date": null, 
    "title": "2015 SEO Foundation: Includes SEO for Wordpress and Tips", 
    "price": "20.00", 
    "instructors": "Jason Da Silva", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/555450_2098_3.jpg", 
    "course_url": "https://www.udemy.com/2015-seo-course-wordpress-tipsandtricks/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-15T15:34:16Z"
}