{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\"><strong>5 Star SEO Course!</strong></p><p style=\"\"><strong>My Stundents love this course, get learning essential SEO tips and tricks today!</strong></p><p style=\"\"><strong>\"This was a fantastic basic course and delivered exactly what it promised! I wanted to demystify the Google SEO process and found the information in the course helpful.\"</strong><br></p>  <p>  \t\"Outstanding course. Very easy to follow the instructor. Extremely useful information. Dave is an instructor I will seek out in the future. Excellent!\"  </p>  <p>  \t<strong>- Amy Dee-Kristensen</strong>  </p>  <p style=\"\">  \t              \"I have been intimidated and befuddled by the whole SEO concept. I finally understand . . . I wish I had been able to take this course 6 months ago! Now I feel much more informed about how to make my site more SEO friendly . . . Thanks, Dave!\"<br style=\"\">  \t<em><strong>- Jennifer Schmid</strong></em>  </p>  <p style=\"\">  \t          \"This is a great course and it helped me understand everything about SEO. Well explained and so valuable for business.\"<br style=\"\">  \t<em><strong>- Juliette Barredo</strong></em>  </p>  <p style=\"\">  \t<em><em>*************************************************************************</em></em>  </p>  <p style=\"\">  \t<em><strong>If you've been wondering about Search Engine Optimization and how to use it to rank your website higher, make more sales and drive more revenue then this is the course for you.<br style=\"\">  \t<br style=\"\">  \t<em>*************************************************************************</em></strong></em>  </p>  <p style=\"\">  \t              Discover how to optimize your website for Search Engine ranking “Google\" from a 15 year trusted and respected SEO professional so that you can increase traffic to your website and increase sales. I will walk you, hand in hand through the fundamentals of what you need to improve your websites rankings so that you can make more sales, drive more traffic and help build your audience.  </p>  <p style=\"\">  \t              If you're a website owner looking to improve your SEO through this highly recommended course I will show you exactly what an expensive agency would do for you, and how to do it yourself at a fraction of the expense of an agency.  </p>  <p style=\"\">  \t<em><strong><strong>Enrol in this course today and have the confidence of Udemy's 30 day money back guarantee</strong></strong></em>  </p>", 
    "end_date": null, 
    "title": "5 Star SEO Course - Discover Essential Google SEO tricks", 
    "price": "30.00", 
    "instructors": "Dave Sheppard", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342370_4585_5.jpg", 
    "course_url": "https://www.udemy.com/seo-basic-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-12T13:32:36Z"
}