{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Updated <strong>05/06/2016</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Bonus:</strong> Every Full Price Buyer of Our Course Can Send Message + Print Screen and Earn 30 min ASO training with one of our managers</p>\n\n\n\n\n\n\n\n<ul><li> <strong class=\"redactor-inline-converted\">Are you trying to make downloads, but can't while other people you know were able to make it?</strong></li><li><strong class=\"redactor-inline-converted\">Do you want to increase downloads for your app?</strong></li><li><strong class=\"redactor-inline-converted\">Do you want to learn the basics of ASO from one of the famous ASO teachers?</strong></li></ul>\n\n\n\n\n\n\n\n<p>With more than 1.2 million apps in the App store, you have heard about App Store Optimization (ASO), and you know that you should market your app but don't know where to start?</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Then this course is for you!</strong></p>\n\n\n\n\n\n\n\n<p>=================================================================</p>\n\n\n\n\n\n\n\n<p>My name is Tolik - AskTolik CEO . I'm an app developer, marketer and entrepreneur based in Israel . I published my first iPhone app in the store in 2013 , and from then published more than 1000 apps and sell most of them already. This is the first course from the 10 courses that I am going to publish regarding important matters that you must to know about app business to achieve 100% success.</p>\n\n\n\n\n\n\n\n<p>In this course, I am going to teach you step by step on how to make good ASO for your app , even if you are only a beginner. This is the right place to start learning.</p>\n\n\n\n\n\n\n\n<p>====================================================================</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What am I going to get from this course?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Over 20 lectures and 3 hours of content!</li><li>Learn how to get more downloads for your iOS apps in AppStore</li><li>Learn step by step on how to RESEARCH using simple tools that are mostly free and can be used daily.</li><li>I will teach you new ideas about ASO, not only about looking on your keywords and title</li><li>Learn how to rank your app using multiple keywords that people are looking for on Apple store</li><li>I will reveal the four simple steps of App Store Optimization method to analyze and evaluate keywords and find your MAIN KEYWORD for your app.</li><li>Learn what makes a good APP ICON and how this can affect your downloads.</li><li>SAFE ways to get reviews to your app and skyrocket your downloads.</li><li>Tips on how to improve your app visibility in the store in simple ways</li><li>It tells you what people are looking for, and is great to use to find new niches for reskinning apps.</li></ul>\n\n\n\n\n\n\n\n<p>====================================================================I<br></p>\n\n\n\n\n\n<p>I know you think that this is a course of some Guru, but it's not the case , I am a simple guy who can't find a job and learned how to make apps and I also know how you <strong class=\"redactor-inline-converted\">feel in the beginning, it's so hard!!! </strong>It's hard in the beginning, and it gets worst :-) Just kidding…</p>\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "App Store Optimization 2016 White Hat and Black Hat Methods", 
    "price": "30.00", 
    "instructors": "Anatoli (Tolik) Eidelman", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/510460_927b_5.jpg", 
    "course_url": "https://www.udemy.com/app-store-optimization-aso-for-ios-no-marketing-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-24T22:12:09Z"
}