{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn the Latest SEO Techniques and How to Apply Them to Google's Blogger From a Leading Expert with Years of Real World Hands On Experience in this widely acclaimed SEO training course.</p><p><strong>Get Higher Rankings In Google and Increase Your Traffic!</strong></p><p>Every time you search for something on Google you find sites near the top of the rankings run by small website owners and people without massive SEO budgets.</p><p>I'll teach you the best way and easiest way to <strong>increase your rankings</strong> and maximize the SEO value of your content!</p><p>For most business owners or people who just want to share their amazing content, SEO is that thing you've heard about but have always thought it was just beyond your grasp - an insurmountable mountain of technical challenges and internet black magic.</p><p><strong>This course will change that for you!</strong> I am going to share my Five years of practical hard earned experience and break down SEO into something that you can <strong>put into practice in minutes</strong> on your own blogger site <strong><em>starting right away</em></strong>!</p><p>While other forms of traffic like social media are great, <strong>Google is still the single largest referrer of traffic on the internet</strong>. If you want to gain new customers or share your message with a wider audience, you can't simply ignore SEO.</p><p>But Google is constantly making changes and it's very hard to keep up!</p><p>And that's one thing I'm going to help solve for you. <strong>This course will be regularly updated</strong> as new Google algorithm changes occur or I unearth new strategies in my SEO business that can keep you ahead of the curve.</p><p>This course is backed by Udemy's 30 day guarantee and my personal promise that for just a small investment of your time, <strong>you'll be shocked at just how easy it is to rapidly improve your site's overall SEO posture</strong> and gain the favour of the search engine gods!</p><p><em>Who this course is not for:</em></p><p><em>I have learned over the years that <strong>trying to trick and manipulate Google is a fool's game</strong>. This is often referred to as Black Hat SEO and if that's what you're looking for, then this course isn't for you.</em></p><p><em><strong>You will learn best practice</strong> and safe ways to make your site and your content more attractive to Google through what is commonly referred to as White Hat SEO.</em></p><p><em>Also, if you're looking for some magic bullet to shoot you to the top of the search results, then I'm afraid there's nothing for you here (or probably anywhere) that can help you.</em></p>", 
    "end_date": null, 
    "title": "Basic SEO Guide For Google Blogger | Be No 1 On Google", 
    "price": "20.00", 
    "instructors": "Jahanzeb Malik", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/701324_5fe6_3.jpg", 
    "course_url": "https://www.udemy.com/basic-seo-guide-for-google-blogger-be-no-1-on-google/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-19T07:59:36Z"
}