{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Stop agonizing over teaching yourself SEO, and learn it the easy way.</p>  <p>  \tNo complex material to study or memorize, and no “secrets&quot; that only the professionals can use for you; this course is designed to make SEO approachable and simple to use.  </p>  <p>  \tDuring this course, we&#039;ll show you how to make your page crawlable, and how to set it up so that the search engines find exactly what they are looking for to give your site the high rank that will translate into the traffic you&#039;re looking for.  </p>  <p>  \t<strong style=\"\">Learn Search Engine Optimization the Easy Way</strong>  </p>  <ul style=\"\">  \t<li>On-Page Optimization</li>  \t<li>Off-Page Optimization</li>  \t<li>Site Foundation</li>  \t<li>SEO for WordPress</li>  \t<li>Panda, Penguin, and Hummingbird Updates</li>  </ul>  <p>  \t<strong style=\"\">Higher Rankings Mean More Traffic</strong>  </p>  <p>  \tThis easy to follow course walks you through SEO to give you the most detailed understanding possible. From building a new website from scratch and making your site crawlable, to finding the right keywords, you&#039;ll finish this course able to begin applying what you&#039;ve learned right away.  </p>  <p>  \tGoogle updates its algorithm frequently to try to stay ahead of the spambots. Each time it does, this course has updated as well, so you can get the most up-to-date information on SEO available. From Panda to Hummingbird this course will show you what to do - and what not to do - to get the search engine&#039;s attention.  </p>  <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p>  \tWith lots of real word examples and hands on activities this course is designed to introduce you to the ins and outs of SEO.  </p>  <p>  \tIn the five hours of content you&#039;ll go from having little to no understanding of how SEO works today, to being able to understand and apply high-level theories to real websites.  </p>  <p>  \tYou&#039;ll begin with a good introduction to SEO that includes examples of how search engines view SEO and what they are looking for. Once the basics are covered, you&#039;ll begin learning a detailed action plan that is designed to help you get a brand new site fully optimized and rising in the ranks as quickly as possible.  </p>  <p>  \t  \tBy the end of this course you&#039;ll not only understand how search engines rank traffic, you&#039;ll be able to put this knowledge to practical use. Updated with each of the Google updates, this course will help you keep your webpages relevant in an competitive market.  </p>", 
    "end_date": null, 
    "title": "ClickMinded Search Engine Optimization Training", 
    "price": "50.00", 
    "instructors": "Tommy Griffith", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16797_f217_14.jpg", 
    "course_url": "https://www.udemy.com/seo-training/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-24T04:59:34Z"
}