{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>So you think you have found the perfect keywords but do you have any idea how easy or difficult it will be to rank for them?</p><p>This is where analysing your online competition comes in and it&#039;s one of the most important parts of search engine optimisation. </p><p>Get it wrong and you are doomed but get it right and wait for Google love.  \t</p><p>In this course you will discover:</p><p>• The TWO vital ingredients that guarantee front-page rankings, in days or weeks – instead of months or years – plus how to quickly &amp; easily check for these 2 factors in less than 5 minutes• A PROVEN blueprint to understanding your competition SEO secrets and how to just pick out all the juicy bits of data you need and simply discard the rest• The VITAL component that 99% of people miss - you will be shocked at what it is!• How to analyse your competitors to discover exactly where their “Achilles Heel&quot; is and where you can gain a massive advantage over them• Our Underground SEO Tool we use every day that helps us obliterate the competition – and you have probably never even heard of it• Why quitting is important. Sometimes you simply need to move on to another keyword. We will show how to determine if it time to quit and move on - saving you a huge amount of time, money and stress• The EXACT formula to follow to GUARANTEE your SEO efforts pay big dividends• Plus so much more</p><p>PLEASE….Don&#039;t be like the 99% of people who fail to research your competition properly – and fail.</p><p>Be in the 1% that does – and succeeds!</p><p>So take the course and let&#039;s get started straight away</p><p>Start ranking your website with an unfair advantage</p><p>Enrol now by hitting the buy button on this page </p>", 
    "end_date": null, 
    "title": "Competitor Analysis - How To Anaylze Your Online Competition", 
    "price": "20.00", 
    "instructors": "Jon Shawcross, Anton Nadilo", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394582_2009_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-anaylze-your-online-competition/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-15T04:23:54Z"
}