{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course I am going to walk you through exactly how I go about creating very simple audits for SEO (Search Engine Optimization)</p>\n\n<p>Some of the general benefits of this course will be to teach you how to improve your own website's SEO.</p>\n\n<p>If you running your own marketing agency, you can also use this course to fix your clients websites issues and provide them a very clean SEO audit report. </p>\n\n<p>I'm going to show you how I use a few different tools to check the health of a website.</p>\n\n<p><strong>Why is all of this important?</strong></p>\n\n<p>Google and other search engines crawl the pages of your site to determine what content is displayed in their index. If data is missing, broken or needs improvement these audits will help you make the improvements needed to see better results in the search engines for your content. </p>\n\n<p><strong>This course will help you learn about the following metrics on a website:</strong></p>\n\n<ul><li>Meta tags that are too long, duplicated or empty</li><li>Title tags that are too long, duplicated or empty</li><li>Find broken links and 404 pages that need to be fixed</li><li>Determine if a site is mobile friendly</li><li>Check if your website contains an XML sitemap</li><li>Excessive links on pages</li><li>Link redirects</li><li>Determine if your website is mobile friendly</li></ul>", 
    "end_date": null, 
    "title": "Create a Search Engine Optimization Audit For Your Website", 
    "price": 0, 
    "instructors": "John Shea", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814692_4348_3.jpg", 
    "course_url": "https://www.udemy.com/create-a-search-engine-optimization-audit-for-your-website/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T17:23:25Z"
}