{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Los buscadores, con Google a la cabeza, están otorgando una importancia cada vez mayor a las búsquedas locales y a la calidad de sus resultados en función de las preferencias y localización de los usuarios, es esencial definir el mercado objetivo de nuestro negocio o nuestro sitio web. Uno de los pasos más importantes antes de plantearnos cualquier estrategia de posicionamiento en buscadores es definir claramente quiénes son y dónde se encuentran nuestros clientes objetivo. </p><p>El posicionamiento local está adquiriendo una mayor relevancia gracias a las búsquedas móviles (más del 67% de las búsquedas en Internet se ven ya afectadas por la ubicación geográfica de los usuarios), las cuales tienen en cuenta la geolocalización del usuario de forma cada vez más precisa. Por este motivo, no tiene mucho sentido aspirar a posicionarnos por palabras clave generales a nivel mundial si el target de nuestra empresa se reduce a una zona geográfica concreta (un país, comunidad, provincia, estado, ciudad, población, etc.).</p><p>El concepto de SEO local se resume básicamente en una idea: proporcionar a los buscadores la información necesaria para que éstos consideren nuestro sitio web relevante para los resultados de las búsquedas locales.</p><p>El SEO local beneficiará a:</p><ul><li>Negocios locales con una tienda física</li><li>Empresas que ofrecen servicios en áreas geográficas concretas</li><li>Cadenas con varias ubicaciones</li></ul><p><br></p><p>Si tienes un negocio con ubicaciones físicas o que dan servicio a territorios muy concretos, te interesa el SEO local. \n\nCon este curso entenderás a la perfección el funcionamiento del SEO local y aprenderás a posicionar por ti mismo tu negocio en Internet en las localizaciones exactas donde se encuentran tus clientes.\n\nAdelántate a tu competencia implementando unas sencillas técnicas SEO.</p>", 
    "end_date": null, 
    "title": "Curso SEO local", 
    "price": "20.00", 
    "instructors": "Juan Jose Ramos", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541696_468f_2.jpg", 
    "course_url": "https://www.udemy.com/curso-seo-local/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T22:56:42Z"
}