{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Lerne die Grundlagen, Tools und Aspekte um einen perfekten YouTubkanal zu erstellen.</p><p><strong style=\"\">Lerne die wichtigsten Aspekte kennen um auf dieser Plattform gefunden zu werden.</strong></p><p>Die Keywordsuche für ein Vorhaben oder Projekt</p><p>Die Socialmediaverknüpfungen</p><p>Das Design eines Kanales</p><p>Die wichtigsten Funktionen im Kanal</p><p>und die externen Verknüpfungen</p><p>Millionen von Usern besitzen Youtubekanäle und legen täglich neue an. Doch ein Großteil wird feststellen, das Ihre Videos und Kanäle nie gesehen werden. Wenn Sie sich nicht &quot;hinten anstellen&quot; wollen, sondern Erfolg und Besucher generieren. Dann lernen Sie hier in meinem Kurs die Grundlagen dafür. Ich zeige Ihnen eine Betrachtungsweise, wo Sie Projekte aus einem Marketing Blickwinkel sehen. Sie lernen die Keywordsuche in der SEO Technik und sehen sofort, ob Interessenten da sind.</p><p><strong style=\"\">Inhalt und Übersicht</strong></p><p>Für einen perfekten Start in Ihr Videobusiness habe ich diesen Kurs erstellt, mit insgesammt 13 Videlektionen, über 1,5 Stunden Lehrmaterial. Das Projekt was ich im Videokurs frisch erstelle, können Sie 1:1 für andere Vorhaben übernehmen. Schauen Sie mir über die Schulter bei der Erstellung. Wir beginnen mit einer Idee, dann checken wir unter allen Aspekten, ob viele Menschen diese Idee teilen und wie sich das &quot;Keyword&quot; nennt. Darauf basierend wird ein googlemail Account erstellt, Webseite, Twitter, Facebook und der Youtubekanal. Warum das nur so funktioniert lerne ich Ihnen. Ebenso wie die Designgestaltung, die Menüauswahl und die Einbindung von Links zu Ihrer Webseite ins Video. Am Ende diese Kurses werden Sie einen oder mehrere Kanäle bei Youtube erstellen können, die SEO technisch perfekt sind.</p><p>Diese Natürlichkeit öffnet Ihnen die Tore des Erfolges.</p>", 
    "end_date": null, 
    "title": "Der perfekte YouTube Kanal", 
    "price": "30.00", 
    "instructors": "OLaf Hüttmann", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466032_3c8b_4.jpg", 
    "course_url": "https://www.udemy.com/der-perfekte-youtube-kanal/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T17:53:07Z"
}