{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Die <strong>fehlende Einrichtung</strong> der Google Webmaster Tools (neuerdings: Search Console) erlebe ich Tagtäglich bei Neukunden im SEO-Bereich. Dabei handelt es sich hier um ein kostenloses Tool von Google, dass fast mehr kann als viele kostenpflichtige SEO-Tools von Drittanbietern. </p>\n\n<p>Mein Fazit: Wer mit den Webmaster Tools besser umgehen kann, hat schlussendlich eine Website, die bei Google besser gefunden wird. Warum ist das so?</p>\n\n\n\n<p>- Man erkennt Fehler schneller (nach Eintragung warnt uns Google bei Spam-Abmahnungen, Crawling-Fehlern usw.)</p>\n\n\n\n<p>- Mittels geschickter Filter (in diesem Kurs erklärt), sieht ein Homepage-, Shop oder Blog-Betreiber auf welchen Positionen eine Website rankt. Im Durchschnitt. Und der Website-Betreiber sieht das erste mal ein ungeschöntes Bild seiner Positionierung bei Goolge (nicht personalisiert, sondern real, basierend auf historischen Daten, mit gebildetem Durchschnitt)</p>\n\n\n\n<p>- Du als Website Betreiber kannst dir anschauen wie häufig deine Website auf welche Suchbegriffe bei Google ausgeliefert wird (Impressionen), wie häufig diese Ergebnisse geklickt werden (Klicks) und wie die Rate (Klicks geteilt durch Impressionen) ist. Dadurch kannst du sehen, ob deine Website-Meta-Informationen perfekt für Google optimiert sind. </p>\n\n<p>- Du kannst Googles Ergebnisse direkt beeinflussen (Durch Löschung von irrelevanten Links auf deine Website, durch Sitelink-Abwertung und durch manuelles Indexieren)<br></p>\n\n<p>Diese 3 Aspekte sind Gold für die Suchmaschinenoptimierung!</p>\n\n<p>Ich wünsche Dir viel Erfolg mit diesem SEO Kurs!</p>\n\n<p>Dein Malte Helmhold:) </p><p>(Ihr findet mich auch auf YouTube;) </p>\n\n<p><br></p>\n\n<p><br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Die Google Search Console (Webmaster Tools) für SEO-Hungrige", 
    "price": "30.00", 
    "instructors": "WordPress, SEO & Programimerung Malte Helmhold", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831230_5aa3.jpg", 
    "course_url": "https://www.udemy.com/die-google-search-console-webmaster-tools-fur-seo-hungrige/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T10:44:23Z"
}