{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Do you want to learn how to rank your business higher in Google Search?</strong></p><p><strong><span>Do you own a small business?</span> </strong></p><p><strong>Do you just want to do the work on your own? <br></strong></p><p><em>This is the perfect course for you.</em></p><p>I've created a step-by-step course that walks you through everything you need to know about boosting your visibility in the Google local map pack.</p><p>In August of 2015 Google changed the \"local 7 pack\" into the \"local 3 pack\".</p><p>It's now more important than ever to be working on Local Search Optimization for your business. </p><p>Only 3 businesses are now shown within the local business pack when typical \"service + city\" terms are used in Google search.</p><p><strong>In this course I walk you through the basics of:</strong></p><ul><li>Setting up your website for local search</li><li>Setting up your Google+ business page</li><li>Adding your business to important website directories such as Yelp</li><li>Setting up basic social media profiles such as Facebook, Twitter &amp; LinkedIn for business. </li><li>I walk you through several tools that can be used for tracking your rankings and auditing your business for search.</li><li>I show you the importance of content and how to optimize it for your business</li><li>I provide ways to generate more reviews for your business on Google, Yelp and others.</li><li>I show you some other websites you can use to generate new clients for your business.</li></ul><p>If you've been struggling with SEO for many years as a local business, this is the course for you!</p><br style=\"\">", 
    "end_date": null, 
    "title": "Do It Yourself Local SEO For The Small Business Owner", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641380_c441_2.jpg", 
    "course_url": "https://www.udemy.com/do-it-yourself-local-seo-for-the-small-business-owner/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T14:05:55Z"
}