{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Hitting on the first page of the Google is not that easy. It needs a lot of practice, hard work and knowledge of <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">G</em></strong><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">oogle ranking factors</em></strong>. The person who gives you guarantee that he/she will help you to hit first page in 2 days, then there are only two possibilities either he/she is a magician or he/she is using black hat <em class=\"redactor-inline-converted\">SEO</em> techniques. Ask yourself why you want your site to hit the first page? Obviously your answer would be “Because I want more sales or I want more visitors”. The most important reason why you want your website to hit the first page is that you want your product/service to be seen by everyone. There are a lot of <strong class=\"redactor-inline-converted\">ON-page</strong> and <strong>Off-page</strong> <em>SEO</em> techniques that allow you to improve your ranking, but those techniques can only be useful if you will know how to use them.</p>\n\n<p> If you get first page rankings, congratulations! But don’t rest on your laurels yet. That’s because you still have lots of work to do. There are a lot of possibilities that you might lose your ranking. I don’t want to take the description to long. Let’s discuss what you will find in the course.\n\n  </p>\n\n\n\n<p>In this course I have share all the best hidden factors that can affect your ranking to a great extent. I assure you that, the factors you will find here will help you a lot to improve your ranking and day by day you will see your website hitting high ranks on Google.\n\n  </p>\n\n\n\n<p>What are you waiting for? Just hit the up button and purchase the course. If you do not find my course interesting, then 100% money back guaranteed. \n\n  </p>", 
    "end_date": null, 
    "title": "Dominant Google Ranking Factors: The Most Advance List", 
    "price": "20.00", 
    "instructors": "Ammar Pervez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415820_99a4_2.jpg", 
    "course_url": "https://www.udemy.com/dominant-google-ranking-factors-the-most-advance-list/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-07T14:53:38Z"
}