{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      The <strong>Essential SEO </strong>course covers all the major concepts an online marketer must know to survive in the digital world. This will be an useful reference guide for digital marketers and webmasters alike. If you have a website, a product to sell online, interested in affiliate marketing or a student of digital marketing it is a great resource for you. This easy to follow course will explain all the terminologies and tools that are used by SEO experts world over. The curriculum covers the following  </p>  <p>  \t<strong>    SEO- Important Terms and Concepts - Learn the important terms and concepts you need to know before you start with the actual techniques  </strong>  </p>  <p>  \t<strong>    On Page SEO - Learn what is onpage SEO and why it is important. Learn about different types of SEO tags , Anchor text and Internal links.  </strong>  </p>  <p>  \t<strong>    Off Page SEO - Learn about page rank. Learn the smart link building techniques and how to recover your site from toxic links.  </strong>  </p>  <p>  \t<strong>    Site Foundation - Learn all about technical seo strategies. Find out about 301 redirects and www vs non www sites.  </strong>  </p>  <p>  \t<strong>    SEO Tips and Strategies - Learn advance SEO tips and tricks. Master authorship and domain marketing concepts.  </strong>  </p>  <p>  \t<strong>    Website Audit - Learn to audit websites to make them more SEO friendly.  </strong>  </p>  <p>  \t<strong>    SEO tools - Learn about essential monitoring tools to help you manage your website search engine rankings  </strong>  </p>  <p>  \t      Learn all this and much more with course and quickly master SEO techniques followed by the top experts globally. See you on the other side..  </p>", 
    "end_date": null, 
    "title": "Essential SEO Training For Online Marketing", 
    "price": 0, 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373690_5cef_2.jpg", 
    "course_url": "https://www.udemy.com/essential-seo-training-for-online-marketing/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T06:16:04Z"
}