{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "  <h5>Master the art of SEO and Web Marketing for Web Entrepreneur.</h5>    <p>In this training course for SEO (Search Engine Optimization) fundamentals, expert author and internet marketer, Kevin Bates takes you through the sometimes confusing world of web site optimization for search engines. This SEO tutorial is designed for the beginner, and you do not have to have prior knowledge of SEO - however some HTML knowledge and website experience are recommended.<br style=\"\">  <br style=\"\">   You will start with the basics of what SEO is, how search engines operate, and some of the tools available to you. Once you are comfortable with the basics, Kevin delves into the technical side of SEO - sitemaps, redirects, nofollows and how to handle dynamic content. You will learn about on and off page optimization, how to measure, track and test your optimization, and even how to use paid search effectively.<br style=\"\">  <br style=\"\">  By the conclusion of this video based training for search engine optimization, you will be familiar with the process of optimizing your website, choosing keywords and the basics of paid search marketing to generate more traffic for your website.</p>  <p><strong style=\"\">Course Goals:</strong></p>      <p>Learn highly effective SEO techniques that boost rankings</p>    <p>Learn how not to trip over optimization penalties that could lead to your site being sandoxed or banned.</p>    <p>Learn to reverse engineer your Competitors SEO Strategies and turn them to your advantage</p>    <p>Learn how to find niche keywords with a high conversation rate</p>    <p>Learn how to use Google&#039;s own reporting to find untapped commercial traffic</p>    <p>Gain an Understanding of Commercial Intent and learn how to capitalize on it.</p>    <p>Learn the fundamentals of Paid Search and how to make it profitable</p>    <p>Learn effective use of Social Media Marketing</p>  ", 
    "end_date": null, 
    "title": "Essential SEO Training For Successful Web Marketing", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25624_038f_7.jpg", 
    "course_url": "https://www.udemy.com/essential-seo-techniques-for-successful-web-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-29T16:08:04Z"
}