{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Search engine optimization doesn't have to be difficult, and you certainly don't need to buy expensive software or hire an expensive agency. Gaining an understanding of how search engines function and the quick tweaks you can make to your website to rank higher will help you increase your traffic and—ultimately—grow your business.</p><p><strong>Join over 1,400 students who have learned search engine optimization (SEO) and are optimizing their websites and increasing their rankings without spending a dime.</strong></p><p>You'll learn how to:</p> <ul><li>Quickly research keywords that attract relevant visitors</li> <li>Analyze said keywords and prioritize them based on effectiveness</li> <li>Rework your web content to accommodate search engines like Google, Yahoo and Bing</li> <li>Build links that point back to your site</li> <li>Track your progress</li></ul> <p>Paired with quizzes, helpful content, and a few tips here and there, you'll get a taste of everything involved with increasing the search visibility of your website.</p><p><strong>Here's what a few of my <em>favorite</em> students had to say:</strong></p><p>\"I thought that I knew something about SEO, but this course has shown me \nthat I have a lot to learn.  I'm going to have to watch it over, and \nover to make certain that I do things the correct way.\" <em>– Craig</em><span></span></p><p>“This is a fantastic course, especially for the price. There is a lot of information packed into about an hour of lecture, so you can move through it fairly quickly while still getting a ton of resources. Highly recommend.\"<em> – Briana</em> </p><p>“I would recommend this class to any serious Digital Marketer who is interested in SEO practices. This cheap course provides great and in depth study of SEO practices done the correct way. Evan simply goes above and beyond.\" <em>– Christian</em> </p><p>(These are quotes from three of the 20 five-star reviews this course has earned!)</p><p><strong>All the Information You Need to Master Search Engine Optimization</strong></p><p>Imagine what it would be like to handle the SEO of your website yourself, without having to fork over piles of cash to a search agency. With any luck, at the end of this course, you'll feel confident enough to take the reins and get your site to that top spot all on your own. </p><p>In dozens of easy-to-understand videos, I will uncover the secrets of conquering the practice of search engine optimization. These videos are delivered online so you can watch them from the comfort of your own home. By incorporating intermittent quizzes, you can be sure you comprehend the most important concepts and keep yourself motivated to stay attentive.</p><p><strong>Course Overview</strong></p><p>As any search engine optimizer will tell you, successful SEO starts with keywords. This course will start by walking you through my go-to strategies for finding keywords that are relevant for your target audience. The next step in the process is analyzing the keywords and prioritizing them based on effectiveness. I'll show you how to calculate the Keyword Efficiency Index (KEI), a good starting point for anyone new to the practice of SEO.</p><p>With a list of highly effective keywords in hand, the course will move to teach students how to properly optimize their content. You will learn how to best incorporate your keywords and how often to employ your keywords on each page. The course will also explain the differences between the major search engines—Google, Yahoo and Bing.</p><p>Once your web content is optimized for search engines, you'll want to start attracting more visitors and search engine crawlers. The course will take an in-depth look at the most effective and popular strategies for building links.</p><p>And, last but not least, you will learn how to track your progress so that you can always be improving.</p>", 
    "end_date": null, 
    "title": "Everything You Ever Wanted to Know About SEO!", 
    "price": "20.00", 
    "instructors": "Evan VanDerwerker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/256058_0c68_13.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-05T12:46:21Z"
}