{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    Learn the basic concepts, tools and strategies to get your content on the first page of the search engines.  </p>  <p style=\"\">  \t<strong style=\"\">Build a strong foundation in Keyword Research with this tutorial for beginners.</strong>  </p>  <p style=\"\">  \t    Learn how to find the keywords your clients are using to find your product and/or service<br style=\"\">  \t     Build a list of your most profitable keywords with this one quick and easy strategy<br style=\"\">  \t     Learn the strategies that others pay thousands to have agencies perform<br style=\"\">  \t     Learn how to find your competitors keywords and legally use them as yours<br style=\"\">  \t     Learn strategies on where to place keywords that will get your content noticed<br style=\"\">  \t     Learn this process step-by-step while looking over the instructors shoulder  </p>  <p style=\"\">  \t<strong style=\"\">Learn and Master the Strategy that is Essential in Today’s Digital Economy.</strong>  </p>  <p style=\"\">  \t    Learning the fundamentals of keyword research puts a powerful and very useful tool in your hands. Knowing which keywords your clients use to find your products and /or services online is an essential skill that makes anyone who masters keyword research invaluable.  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview</strong>  </p>  <p style=\"\">  \t    This course contains 12 lectures and over 2 hours of content. It’s designed for anyone, regardless of experience level, who wishes to learn a skill that is in high demand.  </p>  <p style=\"\">  \t    Students will learn step-by-step how to research keywords that their clients are using to find their products and/or services online. By using the strategies taught in this course, the student can literally place their products and/or services in front of a lot of traffic, just by knowing which keywords people are searching with.  </p>  <p style=\"\">  \t    Starting with logging into Google Adwords, this course will take you through how to use targeting of keywords to downloading the most profitable keywords into your marketing machine. By going through this course, you’ll gain invaluable insights and a strong understanding of the importance of keywords in the digital economy.  </p>  <p style=\"\">  \t    With the basics mastered, the course will take you through finding your competitors keywords, how to calculate your most profitable keywords and how to rank keywords based on Average Monthly Search Volumes. Then the course shows you how to get your content on the top of search engines quicker by using a little know strategy called localization.  </p>  <p style=\"\">  \t<em style=\"\">What this course is not:</em>  </p>  <p style=\"\">  \t<em style=\"\">I do not cover items that are freely published by Udemy as these are available for free from Udemy. <strong style=\"\">I present you with real evidence of what works to get views which turn into sales which turn into repeat sales.</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">I will not &quot;look at keyword list&quot; and &quot;tell you what&#039;s wrong&quot;. I don&#039;t know your niche, target market or your knowledge - and it would be reckless of me to advise you. <strong style=\"\">You must have something (anything!) you can market and/or sell online or be selling currently online. </strong></em>  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\"></strong></em>  </p>  <p style=\"\">  \t<em style=\"\">I won&#039;t teach you anything that in any way breaks Udemy&#039;s terms, rules, conditions etc, whether they are written or implied -<strong style=\"\"> I value my Udemy earnings too much!</strong></em>  </p>  <p style=\"\">  \t<em style=\"\">This course is not backed or produced by Udemy - it&#039;s all my own work ... but the excellent Udemy staff are there to help you, too, of course! </em>  </p>  <p style=\"\">  \t    But, if you want my personal &quot;insider&quot; information - you need to get this course now ... right this minute.  </p>  <p style=\"\">  \t<strong style=\"\">Every minute you delay is actually COSTING you money ....</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Enroll now!</strong>  </p>", 
    "end_date": null, 
    "title": "Get Your Content On Page 1 Of Google!", 
    "price": "25.00", 
    "instructors": "Pat Gage", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367748_b014.jpg", 
    "course_url": "https://www.udemy.com/8-steps-to-getting-your-content-on-page-1-of-google/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T01:35:47Z"
}