{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is about using effective search engine optimization (SEO) techniques to generate more traffic to your blog or site. The course focuses on researching the most profitable keywords for your site, and then using the On Page SEO best practices to use those keywords to write a well optimized article for your blog or website content. </p><p>Using the techniques in this course, the content you write will help you to rank for hundreds of profitable keywords. Ranking for hundreds of keywords means not only more traffic for you, but also more profit. The techniques in this course will teach you how to get the most amount of traffic and profit by doing the least amount of work possible.</p><p>This course will take approximately five hours to finish. In this course, you will learn:</p> <ul style=\"\"><li>The mistakes most beginner bloggers make and how to avoid them, and the type of keywords to use to create a profitable blog.</li><li>How to identify quality visitors, so you make maximum profit, and how to avoid low-quality visitors.</li><li>The On Page SEO factors that can help you rank for as many profitable keywords as possible.</li><li>How to optimize your website using the On Page SEO techniques in a step-by-step manner.</li></ul> <p>By the end of this course, you will have written an example piece of optimized content that can rank for hundreds of profitable keywords, so you get the most traffic and profit possible. </p><p>If you are not getting the amount of visitors you want to your site, or if you have just started blogging, this course can help you to get thousands of visitors to your site and make more profit.</p>", 
    "end_date": null, 
    "title": "Get 1000 Visitors to Your Blog Using On Page SEO", 
    "price": "20.00", 
    "instructors": "Endy Daniyanto", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432798_18c4_3.jpg", 
    "course_url": "https://www.udemy.com/get-1000-visitors-to-your-blog-using-on-page-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T08:26:26Z"
}