{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course is about high-quality link building using the largest link database on the planet provided by Majestic.</p><p>Right from the first video, the approach practical and useful. </p><p>There's no fluff, just straightforward advice that will get you up to speed quickly. The videos are short and to the point, usually between 5-10 minutes, and are available online whenever you need.</p><p>Complete beginners will find lots of guidance in the first 3 videos, while more experienced people will find that the rest of the course is peppered with useful workflows, techniques and strategies that will make your working life easier. </p><p>Take this course if you are:</p><ul><li>a marketer who wants to know more about modern SEO </li><li>An entrepreneur who wants to build competitive advantage and explore niche markets</li><li>A start-up that wants to build your presence and reputation in your market</li><li>A new staff member at an SEO or marketing agency and needs to know quickly how to use Majestic's suite of tools effectively</li><li>A student considering a career in online marketing.</li></ul><p>The course uses lots of real-life examples, to help you apply the learning principles to your own situation.</p><p>There's a full transcript with each video so if English is not your first language, you'll easily follow the main points. And the simple worksheets show you exactly what you need to do.</p><p>You'll get the most out of the course if you have a basic subscription to Majestic. But even if you don't have a subscription, you'll learn much about the whole process of link building.</p>", 
    "end_date": null, 
    "title": "Getup to speed with Majestic link building", 
    "price": 0, 
    "instructors": "Ken McGaffin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654606_bdfc_2.jpg", 
    "course_url": "https://www.udemy.com/getup-to-speed-with-majestic-link-building/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T15:00:22Z"
}