{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course I'm going to teach you how to master Google AdWords so that you can do what I did - build a business from <strong>$0 in revenue in 2010 to $33 million in revenue in 2016</strong> using Google AdWords.<br></p>\n\n<p>By implementing the lessons in this course, you should expect to become proficient in the most powerful online advertising tool that exists today, Google AdWords. You should also expect to increase your business revenue exponentially, and most importantly these skills will change your life like they did mine.</p>\n\n<p>With virtually every business online these days, you need to have some advantage over the competition, and usually that advantage is online.</p>\n\n<p>By understanding Google AdWords to the level that I'll teach you, not only will you have a better understanding of all parts of your business, you'll also very quickly have a better understanding of your customer, a better understanding of your competition and you'll be able to turn advertising dollars into revenue and profit from day one.</p>\n\n<p>In my career, I've achieved upwards of <strong>20x ROI </strong>on my advertising spend. That means <strong>for every dollar spent I've received $20 back</strong>. Imagine if you knew how to replicate that.</p>\n\n<p>It doesn't matter if you're looking to sell info products, B2B consulting or even local plumbing services. Understanding AdWords can mean the difference between a life of mediocrity and a life of success.</p>\n\n<p>In order to give you and your business the best chance of succeeding, I'm going to teach you how to use AdWords specifically for your needs. I'm going to do this by leveraging real world examples from my business and the many businesses I've consulted with.</p>\n\n<p>The specific skills you'll learn in this course include:</p>\n\n<ul><li>Creating campaigns, keywords, and AdGroups</li><li>Conducting competitor research and online advertising</li><li>Identifying optimal bidding strategies</li><li>Geo-targeting your customers</li><li>Budget optimization for both large and small spends</li><li>How to understand common performance benchmarks</li><li>How to create a landing page that converts</li><li>How to track your online advertising efforts</li><li>And how to avoid all the common mistakes that most people make and that I've made myself</li></ul>\n\n<p>I know that I'm the best person to teach this AdWords class to you. Do you know why? Not only did I achieve $33 million in revenue using Google AdWords, I also learned AdWords on my own using videos like this one. Additionally I'm AdWords certified and I've consulted with over 100 companies in a variety of industries to improve their AdWords efforts.</p>\n\n<p>Last but not least, I'm going to give you a <strong>100% money-back guarantee</strong>. If you don't make your money back in the first 30 days after taking this class, I will give you a 100% refund no questions asked.</p>\n\n<p>All that being said, I highly recommend you sign up now. There's never going to be a better time to become highly successful.</p>", 
    "end_date": null, 
    "title": "Google AdWords For Beginners and Businesses", 
    "price": "20.00", 
    "instructors": "Sara Shikhman", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/617656_afd1.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-for-beginners-and-businesses/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T00:59:47Z"
}