{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong><em>**Note: This course is current and up to date as of April 2016**</em></strong>  </p>\n\n<p><strong><em>**We have just added new videos with the latest ad extensions rolled out by Google.</em></strong></p>\n\n<p><strong><em>We have also added videos about the Google Display Network and will be adding plenty more. So get in now before the price increases as we add more and more content.</em></strong></p>\n\n<p>  \t<strong><em>------------------------------------------------------------</em></strong>  </p>\n\n<p>  \t    Join over 400 successful students now who have already taken this course and are improving their AdWords performance!  </p>\n\n<p>  \t    Start getting a <strong>positive</strong> return on investment from your AdWords campaigns by applying the correct structure and optimization strategies. These are the exact strategies we look for in every account we manage in our AdWords agency.  </p>\n\n<p>  \t<em><strong>Recent review \"Just think of the cost you really will pay Google, if you don't follow this advice!\".</strong></em>  </p>\n\n<p>  \t    ------------------------------------------------------------  </p>\n\n<p>  \t<em>In this course you will discover the <strong>default settings that I change for ALL of the accounts that I manage</strong> - that <strong>Google don't tell you about</strong>.</em>  </p>\n\n<p>  \t<em>By the end of this course, you will learn how to optimize your account structure so you get the <strong>best Return on Investment (ROI)</strong>  and importantly, how to drill down into your account to <strong>find specific areas which are most profitable</strong>. </em>  </p>\n\n<ol>  \t<li>Have you set up your AdWords account but unsure you have set it up properly? </li>  \t<li>Are you just spending a lot of money with Google and not getting much back? </li>  \t<li>Are you struggling to find which areas you need to focus on? </li>  </ol>\n\n<p>  \t<strong>Then this course is for you......</strong>  </p>\n\n<p>  \t      I will guide you step by step as I <strong>walk you through a live AdWords account</strong> showing you:  </p>\n\n<ol>  \t<li>Why account structure is critical to the success of your account and how to do it properly</li>  \t<li>What to avoid so you can learn from other people's mistakes - with real live examples</li>  \t<li>Common pitfalls to avoid so your budget can go as far as possible.</li>  \t<li>How to find \"nuggets of gold\" (your MOST profitable keywords) in your account so you can ensure you aren't missing out on any more of them. Note, finding these keywords is the key to ongoing AdWords success.</li>  </ol>\n\n<p>  \t<strong>  Structuring &amp; Optimising Your AdWords Account for Max Profit</strong> course is designed for anyone with an AdWords account or someone who is thinking of getting started with AdWords who would like to know how to structure their account for the best chance of success. This course also hows you how to find additional profitable opportunities within your existing account.  </p>\n\n<p>  \t                        This course first shows you how to set up your account properly with conversion tracking and the importance of linking AdWords account with Google Analytics.  </p>\n\n<p>  \t                        It then shows you in a step by step manner how to best optimise your account on a Campaign, Ad Group, Keyword level. It also shows you some default settings which are recommended to change for best performance.  </p>\n\n<p>  \t                            The course then shows you how to slice and dice your account to <strong>identify areas of profitability</strong> and <strong>also areas of unprofitability</strong>. The course is presented in an easy to follow, step-by-step manner that can be applied to any account.  </p>\n\n<p>  \t                            Ilana also shares some of the latest AdWords features which are critical to the optimal profitability of any account.  </p>\n\n<p>  \t                  Every lesson contains a <strong>screencast walk-through of a live AdWords account</strong>.  </p>\n\n<p>  \t                  Staying up to date with AdWords changes is also critical to staying ahead of your competitors. So, this course is regularly updated to include new features and changes from Google, so that you can stay ahead of the game.  </p>\n\n<p>  \t    ---------------------------------------------------  </p>\n\n<p>  \t    So, click on the \"Take This Course\" button now - located on the top right, as every day that you delay, is just giving Google more and more money. And trust me, they don't need any more money than they already have!  </p>\n\n<p>  \t    And, best of all, as with all Udemy courses, you have 30-day money back guarantee if you are not completely happy with the course :)  </p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Google AdWords: Structuring & Optimizing For Maximum Profit ", 
    "price": "30.00", 
    "instructors": "Ilana Wechsler", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/330384_75a7_3.jpg", 
    "course_url": "https://www.udemy.com/structuring-optimizing-your-adwords-account-for-max-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-29T11:55:09Z"
}