{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em>**This course is up to date as of April 2016. Did you know that Google made over 400 changes to their AdWords platform last year - that's more than one a day! So, staying up to date is critical to keeping ahead of your competitors.</em></p>\n\n<p><em>So, this course will be continually updated with the latest content and the price will increase accordingly. So, get in now before the price of this course increases.</em>  </p>\n\n<p>  \t<em>*****************************</em>  </p>\n\n<p>  \t<em><strong>Some of our recent reviews</strong>:</em>  </p>\n\n<p>  \t<em>\"</em>This is a terrific course. It is broken down into \"chewable chunks\" and explained slowly and systematically by someone who is obviously a real expert.\"  </p>\n\n<p>  \t\"I appreciate the course. It was a good introduction to Adwords and helped clarify a few concepts I had missed previously.\"  </p>\n\n<p>  \t<em>*****************************</em>  </p>\n\n<p>  \t<strong>Google AdWords is a great way to market your business online, boost your website traffic and ultimately generate leads or make sales online. </strong>  </p>\n\n<p>  \t<strong>By the end of this course, you will be able to create and manage AdWords campaigns for your own business or on behalf of clients (and charge for it!).</strong>  </p>\n\n<p>  \t<strong>*****************</strong>  </p>\n\n<p>  \t              This course will teach you <strong>all you need to know to get started with Google AdWords.</strong> In as little as 4 hours, you will get up to speed on all things you need to know when creating your first AdWords campaign. This course will give you the opportunity to learn from someone who manages tens of thousands of dollars each and every month on behalf of businesses.  </p>\n\n<p>  \t              You will learn <strong>how to successfully set up a Google AdWords account the right way</strong>, giving you the best possibility for success with Google AdWords.  </p>\n\n<p>  \t              We will show you how to create your first campaign, the default settings you MUST change (and most people don't) and everything else in between that you need to know to have a successful AdWords account. We will show you all the common pitfalls that people fall into and make sure you will avoid them.  </p>\n\n<p>  \t              Each section of the course contains:  </p>\n\n<ul>  \t<p>  \t\t              1. Thorough video lesson  \t</p>  \t<p>  \t\t              2. Live walk through in a live account so you know what to look out for  \t</p>  </ul>\n\n<p>  \t<strong>    What am I going to learn in this course?  </strong>  </p>\n\n<ul>  \t<p>  \t\t              · 40 lectures &amp; over 4 hours of pure content. No fluff.  \t</p>  \t<p>  \t\t              · Learn all the jargon and AdWords terminology.  \t</p>  \t<p>  \t\t              · Thorough walk through of the AdWords interface so you know how to navigate your way around your account with confidence.  \t</p>  \t<p>  \t\t              · Learn how to set up and structure an account the RIGHT way (Note: you'd be surprised how many people get this wrong!)</p><p>Learn how to create BOTH, search campaigns and display campaigns.</p>  \t<p>  \t\t              · Learn all the Campaign default settings you need to change (that Google don't tell you about).  \t</p>  \t<p>  \t\t              · Learn how to master location targeting so you don't waste unnecessary ad spend showing ads to the wrong people.  \t</p>  </ul>\n\n<p>  \t              This course will be continually updated so you can be sure you will kept up to date with all the constant changes that Google make.  </p>\n\n<p>  \t              So, if you want to master Google AdWords and have no experience at all, then this course is for you. Click Enrol Now to access the course instantly.  </p>\n\n<p>  \t              And of course, if you are not satisfied with this course, you will receive a full refund for up to 30 days after your purchase.  </p>", 
    "end_date": null, 
    "title": "Google AdWords Training: A Beginners Guide To Profitable Ads", 
    "price": "30.00", 
    "instructors": "Ilana Wechsler", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362726_149f_3.jpg", 
    "course_url": "https://www.udemy.com/google-adwords-training-a-beginners-guide-to-profitable-ads/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T02:14:59Z"
}