{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&quot;This course was exactly what I needed. I will watch it several times and would suggest it for anyone looking to start with AdWords.&quot; </strong><em style=\"\"> -Brad Fach, Founder, PatentFile</em>  </p>  <p style=\"\">  \t                                                                                                                                In just over <strong style=\"\">3 hours </strong>you will learn how to create Google AdWords campaigns that boost traffic, increase sales and build your business online – or your money back!  </p>  <p style=\"\">  \t                                                              Throughout this comprehensive course you will learn all of the elements that go into creating campaigns that deliver a high return on every dollar you spend – from targeting, to research, to writing compelling ads, to campaign optimization.  </p>  <p style=\"\">  \t                                                              You will also get a firm grasp on the basics of AdWords and how it works, which is necessary to create successful campaigns. And, on top of lifetime access to the course, you&#039;ll also get <strong style=\"\">a FREE copy</strong><strong style=\"\"> of my Google AdWords for Beginners eBook</strong></p>  <p style=\"\">  \t                                                                                                                                       After completing Google AdWords for Beginners, you will be armed with the knowledge needed to launch your first campaign or drastically improve an existing one. I include detailed examples and proven strategies that I&#039;ve personally used to run thousands of successful AdWords campaigns.  </p>  <p style=\"\">  \t<strong style=\"\">Each lesson includes:</strong>  </p>  <ol style=\"\">  \t<li style=\"\">An in-depth video lesson</li>  \t<li style=\"\">A screencast walk-through using a live AdWords account </li>  \t<li style=\"\">Links to tools and relevant articles for further reading</li>  </ol>  <p style=\"\">  \t                                                                                                                                       The walk-through is to give you a first-person perspective on each aspect of setting up and running your campaigns so that you can follow along in your AdWords Account or know exactly what&#039;s needed when launching your first campaign.  You will learn faster by <em style=\"\">doing</em>, rather than just listening.  </p>  <p style=\"\">  \t                                          This course is regularly updated to include new features and changes from Google, so that you can stay up-to-date with all of the tools available in your AdWords tool belt.  </p>  <p style=\"\">  \t                                                                                                                                       If all of that sounds good to you, enroll now, and we&#039;ll get started with Google AdWords for Beginners.  </p>  <p style=\"\">  \t<em style=\"\">***Course is currently up-to-date as of Janurary 2015***</em>  </p>", 
    "end_date": null, 
    "title": "Google AdWords for Beginners", 
    "price": "30.00", 
    "instructors": "Corey Rabazinski", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50735_c4fd_40.jpg", 
    "course_url": "https://www.udemy.com/learn-google-adwords-course-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-21T18:07:15Z"
}