{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>On average this course gets the students 250 more qualified, local, targeted leads visiting their website, calling their store and ultimately turning into customers... all for free!</em><br></p><p><br></p><p><strong>Course Updated:</strong></p><p>16th of October, 2015</p><p><br></p><p><strong>Objectives Of The Course:</strong></p><p>This course is a guide to getting your business on the front page of Google using Google+ Local so that you can impact local search results and get more customers on your website and through your door.</p><p><br></p><p><strong>What You Will Learn:</strong></p><p>This course will teach you the exact steps on how to leverage Google and get thousands of people on your website and through your door each year.</p><p><br></p><p><strong><em>The Five Steps</em></strong></p><p><br></p><p>Step 1 - Introduction to Local SEO</p><p><br></p><p>Local SEO is the most powerful change in small business history but not many people know about it. Learn why local SEO is incredible and the results you can expect when you harness it yourselves.</p><p><br></p><p>Step 2 - Getting on the Front Page</p><p><br></p><p>This section is all about how to create your Google+ page for your business and optimize so it's ready for the front page. This section will clearly outline every step you need to make to change your page from a Google zero to a Google hero.</p><p><br></p><p>Step 3 - Content Marketing</p><p><br></p><p>This section is all about learning how to content market. Content marketing is the most powerful way to get your message across the internet and most people think it's hard. In this step you learn how to almost automate your content marketing so you can spread your message and still have plenty of time doing what you love.</p><p><br></p><p>Step 4 - Search Engine Ranking Factors</p><p><br></p><p>These are the factors that Google (and people) take into account when they decide who gets front page and who doesn't. Keeping these in mind as you do any work online will ensure that your website becomes and stays front page material.</p><p><br></p><p>Step 5 - Bonus!</p><p><br></p><p>These bonus tools cover the most common mistake most companies make when trying to optimize their site. Make sure you're not following the crowed (who aren't on the front page) and learn from the few websites that are!</p><p><br><strong>Do What Google Wants You To Do:</strong></p><p>Knowing how to do all the things Google wants you to do gives you an advantage.</p><p>Local search is now appearing <em>above </em>organic search!</p><p>Creating a strong local SEO (search engine optimisation) strategy is key and this course will guide you through how Google+ can be a part in that process.</p><p><br><strong>Course Format:</strong></p><p>The course is presented in a really simple format that anyone can understand and all terms are clearly explained throughout the course.</p><p><br><strong>Who Is This Course For:</strong></p><p>If you are a business owner, that serves a local area or a website owner that wants to get more customers in their local region, then this course contains essential information.</p><p>It is also useful if you are running a marketing business as it will give you very specific SEO training on how Google+ can help your clients impact their position in search, which will deepen the strength of your service offerings.</p><p><br><strong>The Guarantee:</strong></p><p>So sign up for the course and learn what has taken us over 12 months to learn about Google+ and local SEO.</p><p>It comes with a full 30 day money back guarantee, backed by Udemy, if you are not happy with it for any reason, just get a refund! It's as easy as that.</p><p><br></p><p><br></p><p><strong>This course includes everything you need to know about local SEO and leveraging Google for thousands of free, qualified, local customers each year. </strong></p>", 
    "end_date": null, 
    "title": "How To Get 50 Customers A Day With Local SEO!", 
    "price": "20.00", 
    "instructors": "Steven Male", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471376_46f9_9.jpg", 
    "course_url": "https://www.udemy.com/famous-10-step-local-seo-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T00:32:09Z"
}