{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>If you are someone who has a blog, website or E-Commerce store you may understand how difficult it can be to get people to discover you naturally online.</p>    <p>Learning to do Keyword Research will give you an instant head start and advantage of increasing your chances to appear on the all-important first page of search engine results.</p>    <p>Keyword Mastery shows you exactly how to use keywords to boost the SEO potency of your content and improve how search engines view your articles.</p>    <p>Watch a live case study in action as we go step-by-step through the process of Keyword Research.</p>      <p><strong>What Keyword Mastery will teach you:</strong></p>    <ul><li>What keywords are and why they are important</li><li>How Keywords can help you reach the first page of Google</li><li>The reasons why doing Keyword Research can increase organic traffic</li><li>How to use fantastic tools to carry out Keyword Research</li><li>Tips and tricks for using Keywords in your content to boost your rankings</li></ul><p><br><strong>Contents and Overview</strong></p>    <p>The course will guide you through the full process of Keyword Research, aimed at beginners and full of important and useful information. </p>    <p>Starting with an overview of what Keywords are and the purpose they play in the online world, you will quickly grasp the importance of using Keyword Research and begin to understand how people are using it to gain an almost unfair advantage.</p>    <p>You will then be taken step-by-step through the full process of Keyword Research. </p>    <p>Armed with your newly acquired knowledge, I will show you how to use two extremely powerful tools that will give you lists of viable keywords you can use to rank higher in search engines. </p>    <p>Throughout the case study, you will discover expert tips to ensure you carry out effective research, whilst learning how to avoid obstacles other website and blog owners often get tripped up by.</p>    <p>Once you have learned how to use the two pieces of software, I will teach you how to use your keywords to maximum effect. </p>    <p>The end result is a wider knowledge of how people use Keywords to reach the front page of search engine results, and all the information required to join them!</p>", 
    "end_date": null, 
    "title": "How To Find Keywords To Reach The First Page Of Google", 
    "price": "20.00", 
    "instructors": "Sandor Kiss, Carl Radley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752340_9d21_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-keywords-to-reach-the-first-page-of-google/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-04T14:18:04Z"
}