{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">CURRENT FOR 2015</em></strong>  </p>  <ul style=\"\">  \t<li>If you take this course you get access to my<strong style=\"\"> Private Facebook Group where you can ask questions and I will provide direct support. I am committed to making sure you are able to get your website found in Google.</strong></li>  \t<li><strong style=\"\">You also get discounted access to my up and coming signature program.</strong></li>  </ul>  <p>  \t<strong style=\"\">IMPORTANT</strong>:  </p>  <p>  \t    This course is designed for business owners who have just built a website or have an existing website that they cannot find  ANYWHERE in Google when they search using their target keywords.  </p>  <p>  \t    If you can only find your website when you search for your business name, but NOT when you search using your target keywords, then t<em style=\"\">his course is designed to make your investment in your website worthwhile.</em>  </p>  <p>  \t<strong style=\"\"> The #1 reason most business &amp; e-commerce websites get no traffic is simply because their pages are not optimised to target the right keywords. </strong>  </p>  <p>  \t     By choosing the r<strong style=\"\">ight keywords then optimising the pages</strong> with compelling page titles and meta descriptions, your pages will <strong style=\"\">suddenly appear in search results. </strong>  </p>  <p>  \t     Once they start ranking all of your marketing and link building efforts will work to improve your rankings for those keywords.  </p>  <p>  \t     This video based training comes with a quick start guide and my personal Keyword Research and Onsite Optimisations Spreadsheet to allow you to start your website pages within a day.  </p>  <p>  \t     Without properly optimising your website pages, <strong style=\"\">y</strong><strong style=\"\">our link building efforts will be wasted as Google struggles to know what to rank your pages for.</strong>  </p>  <p>  \t    You will learn:  </p>  <p>  \t    - How to identify if there are any technical issues stopping your site from getting indexed and ranked  </p>  <p>  \t    - How to find the right keywords for the pages of your website  </p>  <p>  \t    - How to draft compelling page titles and meta descriptions for your site so your site ranks in Google  </p>  <p>  \t     Start now to get Instant Visibility in Google.  </p>", 
    "end_date": null, 
    "title": "How to SEO Your Website for Instant Visibility in Google", 
    "price": "25.00", 
    "instructors": "Edmund Pelgen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/409006_30c2_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-instant-visibility-in-google/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T13:08:14Z"
}