{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      If you have ever wanted to earn a full time income, working part time, then this course is for YOU. Your instructor Kalena Jordan has been a freelance SEO consultant for 15 years and is well known and respected in the industry, after helping clients in over 60 countries increase their visibility in search engines.  </p><p>Learn how Kalena stumbled across the secret to optimizing web sites in 1996 and turned her new-found skills into a career spanning the globe. </p>  <p>  \t    You&#039;ll learn how to create your own portable business by taking advantage of the huge global demand for search engine optimization skills. Work from home, set your own hours, pick and choose your clients and take back life&#039;s most precious commodity: TIME. You&#039;ll discover how to harness the powers of automation and passive income to reduce your working day to 5 hours or under, without sacrificing a full-time income.<br style=\"\">  \t<br style=\"\">  \t      This 27 lesson video-based course comes with a full range of downloadable tools, templates and resources to ensure you can hit the ground running. Learn from the mistakes of a 18 year SEO veteran to ensure your new business is primed for success.<br style=\"\">  \t<br style=\"\">  \t      If you have learned - or are learning - Search Engine Optimization (SEO) with a view to starting your own business or on-selling your services as a SEO freelancer, then you are in the right place. Let&#039;s get you started on your journey...  </p>", 
    "end_date": null, 
    "title": "How to Earn a Full Time Income as a Part Time SEO Consultant", 
    "price": "45.00", 
    "instructors": "Kalena Jordan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249150_1da2_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-earn-a-full-time-income-as-a-part-time-seo-consultant/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T04:19:41Z"
}