{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Are you looking for more information on how to do keyword research for SEO and ranking your content on Google?</strong></p><p>In this course we explain why keyword research is a critical first step in achieving results with your content.</p><p>Have you have ever produced a blog article and wondered why you were not getting any website traffic? </p><p>The simple answer is that<strong> your article may not contain keywords people are searching for!</strong></p><p>In this course we take you step by step through every step needed to do the proper research needed to find keywords people are actually looking for on Google.</p><p><strong>In this course you will learn:</strong></p><ul><li>Why keyword research is the first thing you should do before producing any content on a website</li><li>How to use the Google Keyword Planner. This includes seeking out keywords, finding keyword volume, merging keywords, and working with bulk data. </li><li>Doing advanced keyword research and competition analysis with tools such as Long Tail Pro, Majestic, SEMRush, Ahrefs and Moz.</li><li>Understanding what Long Tail keywords are and how you can utilize these to create content that generates lots of traffic for your website.</li><li>How to use additional free sites like Quora, Soovle, UberSuggest, Google Trends and much more to do additional keyword research. </li><li>Determining commercial intent with your keywords - Learning if your content will encourage others to buy products from you.</li><li>Advanced competition analysis - Determine if a keyword is worth trying to rank and if it's even possible for you based on the existing competition. </li></ul><p><strong>We even include a live case study of a perfect long tail keyword generating revenue with Amazon products through the Amazon affiliate program. </strong></p><p>If you have ever wanted to learn more about keyword research this course includes everything you need to know about finding the best keywords out there!</p>", 
    "end_date": null, 
    "title": "How To Do Keyword Research For SEO & Ranking On Google", 
    "price": "20.00", 
    "instructors": "John Shea, Doug Cunnington", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724398_faff_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-keyword-research-for-seo-ranking-on-google/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T18:40:52Z"
}