{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course provides the student with several lectures that collectively when finished, provides them with a greater understanding of the strategies and techniques they can employ to improve the likelihood of their web or blog sites being found by search engines on the Internet.  </p>  <p>This course covers the following topics:</p>  <ul><li>What is SEO and how does it work</li><li>How do you optimize and improve your web or blog site so as to improve its chances of being found by search engines</li><li>How does one do keyword and keyword phrase analysis and what tools – paid and free – can help to get the job done?</li><li>How do the experts use keyword analysis to find new business niches that they can exploit to be financially successful?  What tools and strategies do they employ to make a lot of money on the Internet?</li><li>How do you get your website “Righteous” with Google so they don’t penalize you in their organic search engine rankings</li><li>What sites can help me analyze and debug my web and blog sites so that I can maximize their loading speed potential and reduce or eliminate bounces to my web or blog site(s)</li><li>What analytical tools and websites are out there so that I can track various aspects of my web or blog site’s performance?</li><li>What strategies will best help me to generate steady organic traffic to my web or blog site?</li><li>If I want to pay for traffic to my web or blog site, where do I get the “Best bang for my buck?”</li></ul>                  <p>At the end of this course, the student will have gained greater insights into the world of SEO, creating backlinks, building a stable and far reaching online business presence and in general, getting their sites found on the Internet.  This knowledge gained should help the student to improve his or her business “online presence” so it can be found more easily by organic searches.  This should lead to more sales or content consumption by potential customers.</p>", 
    "end_date": null, 
    "title": "How to Get Found on the Internet", 
    "price": "20.00", 
    "instructors": "Dan Grijzenhout", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709312_92a6_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-found-on-the-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T05:08:25Z"
}