{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>In this course <em>Introduction into SEO &amp; Google Optimization</em>, the ex-Googler Jonas Weber (Search Quality team) &amp; SEO expert (over 10 years experience in SEO) gives you an overview why it is important to invest into SEO and why it is essential to achieve top positions in Google. This will lead to more relevant visitors on your website and increases your revenue. The best: all visitors out of organic/natural search are free, you don't have to pay for this traffic. Jonas Weber shows you the most important rankings factors in Google and explains the last important Google updates which are important for your SEO optimization process.</p><ul><li>mainly for beginners into SEO but also advanced learners of SEO &amp; Google Omptimization</li><li>the perfect start into the very exiting field of search engine optimization!</li><li>what is the search quality team dong at Google</li><li>learn about the difference between SEO and SEA</li><li>market shares of search engines worldwide</li><li>clear message why an investment into SEO is so important and valuable</li><li>what kind of search queries exist</li><li>learn about manual penalties vs. algorithmic Google filters</li><li>At a glance all the most recent and important Google Updates</li><li>how does a smart SEO process look like</li></ul><p>Get the big picture about the SEO industry and its marketing power. Get ready and excited for lots of free traffic!</p>", 
    "end_date": null, 
    "title": "Introduction into SEO & Google Optimization with Ex-Googler", 
    "price": 0, 
    "instructors": "Jonas Weber", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787146_c0c3_4.jpg", 
    "course_url": "https://www.udemy.com/introduction-seo-google-optimization-with-ex-googler/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T10:00:20Z"
}