{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Keywords and keyword research are the crucial foundation for online success - without proper keyword research everything else is wasted time and money.</strong>  </p>  <p style=\"\">  \t          In this course SEO Guru Adrian Knight shows you how to use keywords to jump into the minds of your customers, and how to use that insight to tailor your products, services, marketing and website around what you KNOW your customers want (not what you THINK they want).  </p>  <p style=\"\">  \t          Adrian will show you how to build, segment and organize a powerful keyword list around your customers buying intent (how likely they are to buy at that specific point in time) - and more importantly - how to use that information to drive them to making a purchase.  </p>  <p style=\"\">  \t          Topics include:  </p>  <ul style=\"\">  \t<li style=\"\">  \t<p style=\"\">  \t\t        How-to Use Keyword Research To Understand What Your Customers And Potential Customers REALLY Want (Hint: It&#039;s Not What You Think)  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        How-to Use Keyword Research To Tailor Products, Services And Marketing Around What You KNOW Your Users REALLY Want (Rather Than What You THINK They Want)  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        How-to Use Keyword Research To Structure Your Website And Maximize Website Conversions  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        How-to Use A Custom Made Keyword Research Spreadsheet To Organize Your Keywords Around Customer Buying Intent (Free Download)  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        How-to Use Keyword Research To Identify Major Trends And Seasonal Trends In Your Market That You Can Tailor Your Marketing Promotions Around  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        Know Why The Free Google Keyword Planner Is The Only Tool You&#039;ll Ever Need For Professional Keyword Research  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        Have A Full Understanding Of The Consumer Buying Process And How To Incorporate It Into YOUR Business  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        Merge Your Keywords With The Consumer Buying Process For MAJOR Profits  \t</p>  \t</li>  \t<li style=\"\">  \t<p style=\"\">  \t\t        Use Keywords To Create Your Website Content (And Convert Visitors Into Sales)  \t</p>  \t</li>  \t<li style=\"\">And much more!</li>  </ul>  <p style=\"\">  \t      We guarantee that this short course (which takes less than an hour to complete) will be one of the most POWERFUL marketing courses you will ever take on Udemy - it&#039;s a true business transformer!  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Enroll in this course RISK-FREE now and lay the foundation to a high performing business today!</em></strong>  </p>", 
    "end_date": null, 
    "title": "Keyword Research For Profit: A SEO Guru's Beginner Blueprint", 
    "price": "20.00", 
    "instructors": "Adrian Knight", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375466_3292_2.jpg", 
    "course_url": "https://www.udemy.com/keyword-research-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T08:32:41Z"
}