{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t   If you're a beginner keyword researcher who wants to know the secrets of <strong style=\"\">keyword research</strong>, SEO, and content marketing, then you're about to discover how to get on page one of the search engines including Google, Yahoo, and Bing right now!  </p>  <p style=\"\">  \t <br style=\"\">  \t   In fact, if you want to know learn the basics of keyword research and search engine optimization, then this new <em style=\"\"><strong style=\"\">Udemy course</strong></em> - \"Keyword Research Made Easy\" - gives you the answers to 19 important questions and challenges every beginner keyword researcher faces, including: <br style=\"\">  \t <br style=\"\">  \t   - What is keyword research and SEO? <br style=\"\">  \t   - What tools do I need to perform keyword research? <br style=\"\">  \t   - How do I determine a good keyword from a bad keyword?<br style=\"\">  \t   - How many keywords do I need to find? <br style=\"\">  \t   - How do I use those keywords in my content? <br style=\"\">  \t   ... and more! <br style=\"\">  \t <br style=\"\">  \t   So, if you're serious about wanting to get on page one of the search engines including <strong style=\"\">Google, Yahoo, and Bing</strong> and you want to know learn the basics of keyword research and search engine optimization, then you need to grab a copy of \"Keyword Research Made Easy\" right now, because <strong style=\"\">keyword research Expert</strong>, Rick Grubb, will reveal to you how every beginner keyword researcher, regardless of experience level, can succeed - Today!  </p>", 
    "end_date": null, 
    "title": "Keyword Research Made Easy", 
    "price": "20.00", 
    "instructors": "Rick Grubb", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/195202_4dfc_5.jpg", 
    "course_url": "https://www.udemy.com/keyword-research-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-07T17:44:41Z"
}