{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \tFast-track your keyword research and optimize your content with our Keyword Research and Search Engine Optimization Fast Track Course!  </p>  <p style=\"\">  \t <strong style=\"\">SECTION 1: INTRO TO THE GOOGLE KEYWORD PLANNER</strong>  </p>  <p style=\"\">  \t   You may remember the moans and groans that echoed through the Internet Marketing forums when Google announced that it would be discontinuing its free Keyword Tool — a staple of the Internet Marketer’s toolbox for over a decade.  </p>  <p style=\"\">  \t   Luckily, they didn’t leave us empty handed — they gave us the <strong style=\"\">new and improved Google Keyword Planner</strong> — but there are some <strong style=\"\">major changes</strong> compared to the old Keyword Tool, so that means <strong style=\"\">major changes in the way you do your keyword research,</strong> as well.  </p>  <p style=\"\">  \t   If you’re like most busy marketers, poking around inside the Google Keyword Planner itself is a luxury you simply do not have… You need to make the best use of your precious time to run your business and still have time to spend doing the things you love with the people you love.  </p>  <p style=\"\">  \t <strong style=\"\"><em style=\"\">You&#039;re not alone!</em></strong>  </p>  <p style=\"\">  \t   In the first section of this course, we’ll cut straight to the chase and cover all the most important points to make sure you understand the differences between the old Keyword Tool and the new Keyword Planner, and of course how to use it effectively.  </p>  <p style=\"\">  \t <strong style=\"\">SECTION 2: KEYWORD RESEARCH MADE EASY</strong>  </p>  <p style=\"\">  \t     Next, you&#039;ll learn how to research and select <strong style=\"\">high-traffic</strong> keywords for your niche, as well as how to organize and track your keyword research most efficiently, using our printable workbook and step-by-step instructions.  </p>  <p style=\"\">  \t <strong style=\"\">SECTION 3: PUTTING YOUR SELECTED KEYWORDS TO WORK ON YOUR WEBSITE</strong>  </p>  <p style=\"\">  \t   Next, you need a steady stream of <strong style=\"\">quality content</strong> based on your keywords in order to maximize your site’s search engine rankings and your visitors’ satisfaction.  </p>  <p style=\"\">  \t     Spending hours, days and weeks trying to come up with fresh content ideas is another thing we busy marketers have no time for. So we’ll help you shortcut that process as well, putting your selected keywords to work on your website as quickly, easily and effectively as possible with our Fresh Ideas Content Brainstorming Series!  </p>  <p style=\"\">  \t <strong style=\"\">SECTION 4: OPTIMIZING YOUR CONTENT FOR SEARCH ENGINES</strong>  </p>  <p style=\"\">  \t     Lastly, after compiling all your fresh content ideas, you need to make sure your content is <strong style=\"\">targeted toward the right customer demographic</strong>, with <strong style=\"\">effective headlines</strong>, and <strong style=\"\">optimized for the search engines</strong>. Then you have to <strong style=\"\">notify the search engines that you exist</strong>.  </p>  <p style=\"\">  \t     We’ll help you do all of that and more in the final section of this course, which includes our comprehensive workbook walking you step-by-step through the process, using both on-site and off-site search engine optimization strategies.  </p>", 
    "end_date": null, 
    "title": "Keyword Research and Search Engine Optimization Fast Track", 
    "price": "20.00", 
    "instructors": "Veronica J. Kirchoff, MyBizBuilders Team", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/153334_1047_2.jpg", 
    "course_url": "https://www.udemy.com/keyword-research-and-search-engine-optimization-fast-track/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-27T07:23:16Z"
}