{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t    In this course you&rsquo;ll learn the strategic and technical  fundamentals of search engine optimization (SEO). The contents of this  course include:  </p>  <p>  \t<strong style=\"\">Introduction to SEO</strong><br style=\"\">  \t    In this chapter you&rsquo;ll be  introduced to search engine optimization and begin learning the skills  and tools you need to get started in this powerful new industry.  </p>  <p>  \t<strong style=\"\">Search Engine Overview</strong><br style=\"\">  \t    To understand SEO, it  helps to start where your customers start, with search engines. In this  chapter you&rsquo;ll see how search results are organized, presented, and  modified based on the searcher&rsquo;s intent.  </p>  <p>  \t<strong style=\"\">Keyword Research</strong><br style=\"\">  \t    In this chapter we&rsquo;ll look at  keywords, which are the core of SEO. Words show intent, associations,  and motivation. Understand this, and you will understand your customer.  </p>  <p>  \t<strong style=\"\">Applying Keyword Research to Your Web Pages</strong><br style=\"\">  \t    Now  that you have a grasp of how keywords work, it&rsquo;s time to put them into  practice. In this chapter you&#039;ll learn how to add keywords to important  page elements and show visitors that they have reached the right page.  </p>  <p>  \t<strong style=\"\">Using SEO Tools</strong><br style=\"\">  \t    This chapter will cover some of the best software tools for SEO, which can help make many of your tasks easier.  </p>  <p>  \t<strong style=\"\">Online Marketing and SEO</strong><br style=\"\">  \t    SEO is not just about  getting people to your website &ndash; that&rsquo;s just the start. Once you get  them there, how do you get them to do what you want them to do? We&rsquo;ll  explore some ideas in this chapter.  </p>  <p>  \t<strong style=\"\">Linking Builds Rankings</strong><br style=\"\">  \t    Links from other websites  help your site gain rankings and credibility. In this section, we will  look at the different types of links that exist and which links are the  most valuable in terms of gaining business visitors and rankings.  </p>  <p>  \t<strong style=\"\">Link Building Through Marketing and Social Media</strong><br style=\"\">  \t    Social  media are a great way to expand your website&rsquo;s visibility and gain new  customers. As you&rsquo;ll see in this chapter, they are also a way to develop  great relationships for building links outside your immediate network.  </p>  <p>  \t<strong style=\"\">Local, Mobile, and Search</strong><br style=\"\">  \t    Any locally based  business can benefit from the free visibility that search engines and  social media provide. In this chapter you&rsquo;ll learn some simple  strategies that can bring new customers to your door.  </p>  <p>  \t<strong style=\"\">SEO Measurement</strong><br style=\"\">  \t    How do you know that all of your  efforts have been worth the time and investment? Analytics enable you to  effectively measure of all of your actions and strategies, and this  chapter will show you how.  </p>  <p>  \t<strong style=\"\">SEO for Different Business Models</strong><br style=\"\">  \t    SEO is not the  same for everyone, so in this chapter we&rsquo;ll break down the major  differences in business models and explore the demands and opportunities  presented by each.  </p>  <p>  \t<strong style=\"\">Technical Issues in SEO</strong><br style=\"\">  \t    SEO is not simply a  matter of adding a few keywords to your website. It also involves  managing lots of little details, many of them technical, as you&rsquo;ll see  in this chapter.  </p>  <p>  \t    The lessons are wrapped in a feature-rich interface that lets you  jump to any topic and bookmark individual sections for later review.  Full-Screen mode provides a hi-def, immersive experience, and  Watch-and-Work mode shrinks the video into a small window so you can  play the videos alongside your application. Also included are exercise  files that give you an easy way to try out the techniques you learn.  </p>", 
    "end_date": null, 
    "title": "Learning Search Engine Optimization (SEO) from Scratch", 
    "price": "20.00", 
    "instructors": "Skill Pass", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/114538_0625_9.jpg", 
    "course_url": "https://www.udemy.com/learnseo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-03T04:23:50Z"
}