{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    Search engine optimization or SEO for short has been around for quite some time, but not till recently has the search engines really cracked down on how they rank websites. Ranking for keywords is one of the most important and basic steps to growing visitors to your website.  </p>  <p style=\"\">  \t    Just for an example if you type in google &quot;<em style=\"\">basketball shoes</em>&quot; - you will see that <em style=\"\">footlocker</em>comes up number one in the organic search results. There are roughly 33,000 searches a month with this exact set of keywords. Can you imagine how many footlocker shoes are being sold because of this traffic?  </p>  <p style=\"\">  \t    Want some proof that my techniques work? Of course you do! My website learnseoclass is number one spot in google for &quot;learn seo step by step&quot; and &quot;learn seo start to finish&quot;  </p>  <p style=\"\">  \t    After this Skillshare class you will be able to SEO your website yourself, tell your web guy how to SEO the website, or keep track of your SEO company to make sure they are doing their job correctly. I have heard all the bad stories about people spending thousands of dollars and not seeing any results.  </p>  <p style=\"\">  \t    Goolge and other search engines are CONSTANTLY changing the way they rank websites, so I am going to keep this class updated with new videos on the changes. The biggest changes usually occur with how we build backlinks.  </p>  <p style=\"\">  \t    This class will  take you through all the steps that a person should take to learn SEO correctly. Unlike other SEO tutorials,  we will apply each step we learn to our weebly project website. This will help you guys to really learn SEO techniques - hands on.  </p>  <p style=\"\">  \t    Here is a lesson breakdown:  </p>  <ul style=\"\">  \t<li style=\"\">What is SEO and how do search engines rank websites</li>  \t<li style=\"\">Setting up our project website</li>  \t<li style=\"\">Measure Existing Traffic with Analytics</li>  \t<li style=\"\">Choosing Keywords</li>  \t<li style=\"\">Onsite SEO (Internal Linking, Content, Meta Tags...)</li>  \t<li style=\"\">Offsite SEO (Link Breakdown, Building Backlinks...)</li>  \t<li style=\"\">SEO Tools for keyword rankings and backlink checkers</li>  \t<li style=\"\">Measure Traffic and Keyword Rankings</li>  \t<li style=\"\">Do&#039;s and Do Not&#039;s, Tips and Tricks</li>  </ul>  <p style=\"\">  \t    Understanding the fundamentails of the way search engines rank is key. The best way to know if an SEO technique works is to try it out and measure results. This is how you will get better at learning what works and does not work. We will go over all the best tools to use.  </p>  <p style=\"\">  \t    A friend of mine referred to Search Engine Ranking as the wild west. That is true to some extent. There are no rules, but some things will get you in trouble with the search engines. We go over &quot;white hat&quot; and &quot;black hat&quot; techniques to keep you out of the penalty box.  </p>  <p style=\"\">  \t    This class will leave you ready and excited to increase your own rankings and start getting more visitors/customers to your website. Everything I know is revealed.  </p>", 
    "end_date": null, 
    "title": "Learn SEO To Grow Your Website", 
    "price": "50.00", 
    "instructors": "Joshua Cavin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/298566_cafd_5.jpg", 
    "course_url": "https://www.udemy.com/learn-seo-to-grow-your-website/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-11T19:12:52Z"
}