{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t  Être en première position sur Google vous intéresse ? En tant qu&#039;entrepreneur, que freelance ou blogueur cela peut paraitre compliqué. Il existe tant de cours très théoriques sur la question !  </p>  <p>  \t  Et puis vous n&#039;avez pas de temps. Ça tombe bien, moi non plus ! En tant qu&#039;entrepreneure et freelance, je cherche à optimiser mon temps le plus possible. C&#039;est pourquoi j&#039;ai créé ce cours : pour vous donner <strong style=\"\">une méthode infaillible pour être plus visible sur internet</strong>.  </p>  <p>  \t<strong style=\"\">Mon cours est centré sur la pratique</strong> et vous permettra de vous hisser en tout premier dans les résultats de recherche de Google sur votre secteur d&#039;activité. <strong style=\"\">L&#039;objectif est que les personnes qui ne vous connaissent pas vous trouvent en exprimant leur besoin</strong>. Par exemple, une personne qui cherche &quot;<em style=\"\">outil notes de frais pme</em>&quot; vous trouvera tout de suite, alors qu&#039;actuellement elle est obligée de taper le nom de votre startup !  </p>  <p>  \t<strong style=\"\">Découvrez mon plan d&#039;action en 6 étapes simples !</strong>  </p>  <ul style=\"\">  \t<li>En premier, <strong style=\"\">nous travaillerons votre identité.</strong> Qui êtes-vous et, surtout, comment voulez-vous que vos internautes vous trouvent ? Vous découvrirez, à travers des exercices simples, comment vous définir en mots-clés pertinents qui vous amèneront du trafic !</li>  </ul>  <ul style=\"\">  \t<li>Puis vous créerez <strong style=\"\">l&#039;organigramme de votre site</strong>. Dans cette partie, vous mettrez en avant les mots qui vous apporteront du trafic pour créer les grandes parties de votre site. A la fin, vous aurez une vue globale de l&#039;architecture de votre site !</li>  </ul>  <ul style=\"\">  \t<li>La troisième partie est consacrée à la création de votre site en soi. Par besoin de notions particulières en programmation ! Je vous apprendrai <strong style=\"\">comment créer votre en 15 minutes et comment le sécuriser</strong>. Nous utiliserons Wordpress, très connu pour sa communauté très nombreuse et son utilité. Pour les développeurs, une vidéo vous donnera en détail les bases à implémenter dans tout projet web !</li>  </ul>  <ul style=\"\">  \t<li>Vous vous intéresserez ensuite à la création de contenu. <strong style=\"\">Comment rédiger efficacement ?</strong> Ecrire pour le web est très différent de l&#039;écriture papier. Je vous apprendrai, dans cette partie, comment organiser votre page pour que les lecteurs et Google se régalent en lisant vos articles ! Vous pourrez aussi télécharger des ressources qui vous aideront lors de la rédaction.</li>  </ul>  <ul style=\"\">  \t<li>La cinquième partie met l&#039;accent sur la communication. <strong style=\"\">Comment vous faire connaitre ?</strong> Comment avoir quelques sites qui parlent de vous alors que personne ne vous connait pour le moment ? Quels réseaux sociaux utiliser, quelles sont les bonnes pratiques sur le web ? Je vous donnerai des astuces et vous montrerai comment utiliser des outils qui doubleront votre audience !</li>  </ul>  <ul style=\"\">  \t<li>Enfin, vous construirez un <strong style=\"\">planning de publication réaliste et adapté à vos besoins</strong>. Il n&#039;est pas nécessaire d&#039;écrire beaucoup pour &quot;plaire&quot; à Google, mais plutôt d&#039;écrire régulièrement. Vous découvrirez des outils de hacker pour optimiser votre communication et vous consacrer à ce qui est le plus important : l&#039;évolution de votre business.</li>  </ul>  <p>  \t<strong style=\"\">Créez votre site en une semaine et positionnez-le en haut des résultats de Google !</strong>  </p>  <p>  \t  Ma promesse : <strong style=\"\">vous donner des méthodes efficaces et des outils testés au quotidien !</strong>  </p>  <p>  \t<strong style=\"\">Ma pédagogie : </strong>des actions facilement activables, des démonstrations en direct, de la théorie pour vous permettre de comprendre et des ressources à télécharger ! Vous pouvez me contacter à n&#039;importe quel moment : <strong style=\"\">je m&#039;engage à répondre à toutes les questions dans un délai de 24h</strong>.  </p>  <p>  \t    Ce que vous apprendrez dans ce cours sera valable de longues années. Les actions que je présente sont durables et efficaces. <strong style=\"\">En seulement 3 heures vous aurez toutes les bases pour comprendre Google et lancer votre site comme un pro !</strong>  </p>", 
    "end_date": null, 
    "title": "Les clés du SEO pour un site qui transforme vraiment !", 
    "price": "40.00", 
    "instructors": "Céline Martinet Sanchez", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357164_9015.jpg", 
    "course_url": "https://www.udemy.com/premier-sur-google-entrepreneurs-freelances-et-blogueurs/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-26T17:37:06Z"
}