{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This course will make you very good at getting very high quality, relevant links to your website.</p><p>And all those links will get your website to rank higher in Google searches, and all those Google searches will bring you high quality traffic which will turn into more customers and more revenue, and more growth for your business.</p><p>So go ahead and enroll in the course, and let's get you some great links starting today!<br></p><p><strong>Industry research shows that quality links are still the #1 ranking factor when it comes to getting your website to rank higher in Google search</strong></p><p>Have you tried building links without much success? Or did you hire online consultants or SEO agencies who didn't get you great results and possibly used questionable methods to build links? </p><p>Now all that can be over because I will teach you how to get great and relevant links to point to your website, all on your own. This means that you will save money and won't have to hire anyone to do this in the future, and will be able to do it all on your own.</p><p>Go ahead and enroll in the course, and let's get you some great links starting today!</p><p><strong>Bonus gift for you worth more than the course itself</strong></p><p>When you enroll in the course, I will link to your website from my business blog. All you have to do is ask me to do it, and tell me where to link. I explain this gift that I give to my students in lecture #2 of the course.</p><p><br></p>", 
    "end_date": null, 
    "title": "Link building for SEO", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601864_f3f3_2.jpg", 
    "course_url": "https://www.udemy.com/link-building-for-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T21:15:37Z"
}