{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Local SEO: Google ranks local businesses differently in the search results so this course is designed to help you understand those differences and how to take advantage of them.<br></p><p><strong>Get Your Local Business to the Top of the Search Results</strong></p><p>✔ A 14-Point Local SEO Checklist for your business <em>or for your clients business</em></p><p>✔ Step-by-step instructions to increase your exposure, traffic and sales with Local SEO</p><p>✔ An in-depth understanding of how your website, Google My Business, Facebook, Yelp etc. can all be part of your local marketing strategy.</p><p>Once enrolled, you'll also have access to myself, an experienced SEO expert, so you can get feedback, advice and support as you complete the lectures.</p><p>You Don't Need SEO Experience Take This Course</p><p>No previous SEO knowledge is required to carry out any of the 14 actions listed on this Local SEO checklist. If anything is unclear, just reach out to me. I'm happy to add additional lectures if you feel anything is missing.</p><p>Content &amp; Overview<br></p><p>Using the most up to date SEO tools and criteria, I'll walk you through each point on the SEO checklist, explain why it's important for SEO and show you how to complete the action.<br></p><p>This course is designed for anyone who wants to develop a local SEO marketing strategy to increase traffic and sales. Whether you're a beginner, intermediate or want a refresh as advanced, this training will help your grow your business (or future business!) with SEO.</p><p><strong>Stand out from the crowd. Enrol today to learn how to grow your local business with local SEO!</strong></p>", 
    "end_date": null, 
    "title": "Local SEO Checklist: Rank Your Local Business in 2016", 
    "price": "20.00", 
    "instructors": "Daragh Walsh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618896_fcb2_12.jpg", 
    "course_url": "https://www.udemy.com/local-seo-checklist/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T05:57:26Z"
}