{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h4>☆☆☆  Sign up Today &amp; Get a <strong class=\"redactor-inline-converted\">PREMIUM Landing Page Builder Plugin</strong> For FREE <strong>(Worth: $67)</strong> which will help you save 100's of dollars on landing page design.☆☆☆</h4><h4>If You Own A Small Business And Need To Generate New Clients Fast Today Is Your Lucky Day</h4>\n\n<p>Running a small business in 2016 is hard. Getting new customers on a regular basis can be your business' life blood.   </p>\n\n\n\n\n\n\n\n<h4>Using The Google Ad Network To Grow Your Business, Is The Easiest Way To Increase Bookings Today!</h4>\n\n\n\n\n\n\n\n<p>You would be stunned if you knew how many small business owners and other Business Owners just like you still have not made the small investment of time required to grow their business using basic paid search advertising in Google's Ad Network.</p>\n\n\n\n\n\n\n\n<p>There are hundreds of thousands of businesses just like yours that would make more sales and money if they used paid Google Ad's in their business but they just do not have the knowledge to get started.<br></p>\n\n\n\n\n\n<p>When <strong class=\"redactor-inline-converted\">advertising your business with Google Adwords </strong>you \"<strong class=\"redactor-inline-converted\"><u>Only Pay For Results</u></strong>\" It does not cost anything to signup for Google Adwords, you only pay when someone clicks your ad to visit your website or when someone calls you.  <br></p>\n\n\n\n\n\n<p>With a solid PPC search marketing campaign you can count on those top 3 local search listings bringing  more customers through the door. <br></p>\n\n\n\n\n\n\n\n<p>Let me show you how easy you can get more clients starting today using basic Paid Google Ad's in your Business with my step-by-step video training!</p>\n\n\n\n\n\n<p>we will walk you through everything you need to know to bring in more customers, more sales, and more revenue all within the next 7 to 30 days.<br></p>\n\n\n\n\n\n<h4>Your Local Business Will Grow Fast Once You Have A Kick-Ass Google Ad Network Marketing System In Place,Guaranteed...</h4>\n\n\n\n\n\n<p>So, Join The Course Now And Start Getting More Sales!!</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Master Google AdWords And Double Your Sales in 7 Days", 
    "price": "25.00", 
    "instructors": "Boost Top", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800242_f412_6.jpg", 
    "course_url": "https://www.udemy.com/complete-google-adwords-training/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T21:13:24Z"
}