{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t  Wer sich für <strong style=\"\">Online Marketing</strong> entscheidet, hat eine Reihe von Möglichkeiten ein Unternehmen bekannt zu machen. Bietet man eine lokale Dienstleistung an, kommt man an Google Places kaum vorbei.  </p>  <p style=\"\">  \t  Leider gibt es immer wieder eine große Verwirrung und Laien begehen kapitale Fehler in diesem Themengebiet.  </p>  <p style=\"\">  \t  Dieser Videokurs zielt darauf ab <strong style=\"\">Anfängern und Fortgeschrittenen</strong> in einfachen Worten und mit simplen Anleitungen alle Werkzeuge in die Hand zu geben, um mit einem <strong style=\"\">lokalen Unternehmen</strong> in den Google Places die <strong style=\"\">vordersten Ränge</strong> einnehmen zu können. <br style=\"\">  \t  Es ist kein Vorwissen, keine weitere Investition und kein nenneswertes Talent erforderlich.  </p>  <p style=\"\">  \t  Zielgruppe sind <strong style=\"\">kleine und mittelständige Unternehmen, sowie Agenturen</strong>, die an der Google Places Präsenz des eigenen Unternehmen oder dem eines Kunden arbeiten und nachhaltige Erfolge erzielen wollen.  </p>  <p style=\"\">  \t  Gleichzeitig lehrt der Kurs einige Techniken die aus dem <strong style=\"\">Online Reputation Management</strong> bekannt sind, also den Ruf des Unternehmens stärken.  </p>  <p style=\"\">  \t  Jeder Kursteilnehmer muss etwa mit einem Zeitaufwand von einer halben Stunde rechnen, in der er konzentriert mitarbeiten und mitdenken muss. Da mit Videos gearbeitet wird, können diese aber jederzeit pausiert und wiederholt werden. Als Lehrmaterialien dienen mir Powerpoint-Folien, Bilder und Excel-Tabellen, welche als Download bereitstehen.  </p>  <p style=\"\">  \t  Dieser Kurs gibt dir die Möglichkeit <strong style=\"\">sehr günstig und nachhaltig</strong> mit einem lokalen Unternehmen auf die erste Seite zu kommen. Du musst aber damit rechnen, dass dies mit einem gewissen Arbeitsaufwand verbunden ist, der von dir geleistet werden muss.  </p>  <p style=\"\">  \t  Das Wissen welches in diesem Kurs vermittelt wird, wurde schon <strong style=\"\">etliche Male in der Praxis auf die Probe gestellt</strong> und führt zu <strong style=\"\">erstklassigen Ergebnissen</strong>. Des Weiteren ist es vollkommen konform mit den Richtlinien Googles und <strong style=\"\">außerordentlich kosteneffektiv</strong>.  </p>  <p style=\"\">  \t  Menschen die ein lokales Unternehmen leiten, in einem solchen für das Marketing zuständig sind und Agenturen die ihren Kunden einen Google Places Service anbieten möchten, sollten <strong style=\"\">unbedingt zuschlagen</strong>!  </p>", 
    "end_date": null, 
    "title": "Mit lokalem SEO bei Google auf Seite 1", 
    "price": "45.00", 
    "instructors": "Silvan Mundorf", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321606_7fc8_2.jpg", 
    "course_url": "https://www.udemy.com/mit-google-places-auf-die-erste-seite/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T15:46:36Z"
}