{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Looking for an effective learning course or training class for PPC advertising? In order to learn PPC advertising (aka SEM) with Google Adwords, you'll need to have a great foundation of knowledge which is packed up right here in this tutorial style course. This course is developed for individuals who have had little success on their own with search engine marketing and who are looking for expert guidance. Rather than creating a learning course with advanced techniques and terminology that sounds foreign, I've designed a course that is both easy to digest and highly effective for those seeking to sharpen their skill set. If you've asked yourself the following questions at some point, this course is meant for you. </p><ul><li>I don't have a marketing degree but I want to learn about PPC advertising.</li><li>I've tried learning SEM on my own but I don't know where to begin!</li><li>It's too expensive to outsource PPC management so I want to do it on my own.</li><li>I hired a PPC marketing company and I was not happy with their performance.</li><li>I have a business that just needs marketing to be successful and I'm considering PPC.</li></ul><p>There is no question, PPC advertising is difficult, but so is anything in life that yields fruitful rewards. When I first discovered PPC advertising many years ago, I had to learn Google Adwords marketing on my own through tedious trial and error along with trying to find any type of pay per click training classes online but truthfully there weren't many resources available at the time. Which is why I decided to build my own Google Adwords PPC Tutorial course here on Udemy. After completing my course, you will feel confident, empowered and motivated enough to start working on your own campaign based on the real world success I've had. </p><p>My name is Sergio Aicardi and I am one of the founders of Profitable Web Properties &amp; the owner of www.themiamiseocompany(dot)com which together comprise of the largest and most effective marketing agency in South Florida to specialize in search engine marketing (aka SEM). We not only help individual learn how to setup an Adwords account from scratch and teach them how to manage them properly in this course, we also offer world class marketing services in case it's just too much to handle on your own.</p><p><strong>What makes me qualified as your potential instructor for this in-depth Adwords PPC training course?</strong></p><p>In 2014 I managed an SEM campaign which I presented a case study for in the US Search Awards of 2014 (powered by Pubcon in Las Vegas once a year). The case study was nominated for the \"Best PPC Campaign\" alongside with the marketing agencies that were managing the campaigns for HSNBS, PGA &amp; a Microsoft product division. </p><p>I founded a marketing company that specializes in SEO/PPC and in the 3 years that it's been in business, we have grown to become the most well known search engine marketing agency in South Florida. If you do your due diligence on me, you will find that I am a guest writer for the Search Engine Journal, SEMRush, Ahrefs, Social Media Today and many other well-respected sites that are known for having industry experts write about their successes and experiences. </p><p>I have hundreds of case studies and white papers that show the success I've had with my own companies and the campaigns that I've managed for other companies at my marketing company. Simply put, this is the one training class for Adwords that you won't want to miss out on, sign up today and obtain the knowledge that can earn you large salaries or generate huge profits for your business.</p>", 
    "end_date": null, 
    "title": "Online Google Adwords Training Course - Pay-per-click (PPC)", 
    "price": "50.00", 
    "instructors": "Sergio Aicardi", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481216_7242_4.jpg", 
    "course_url": "https://www.udemy.com/online-google-adwords-training-course-pay-per-click-ppc/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T14:47:36Z"
}