{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<h4><strong style=\"\">tl;dr:</strong></h4>  <p>  \t              Learn the ins and outs of PPC (pay-per-click) and digital marketing. This comprehensive course covers everything you need to know about Google Adwords and Facebook Ads.  </p>  <p>  \t              As a bonus, we&#039;ll also cover Google Analytics fundamentals as well as powerful Google Analytics reports. We&#039;ll also understand how to setup and run an A/B test (with a clear hypothesis) using Optimizely.  </p>  <h4><strong style=\"\">The long-ish version:</strong></h4>  <p>  \t            If you have a website or run your business online, I’m about to read your mind: You want more people to visit your site, more people to like your stuff, and more people to buy from you.  </p>  <p>  \t            To sum it up ... you need help with marketing.  </p>  <p>  \t<strong style=\"\">Marketing is like a pie.</strong>  </p>  <p>  \t            The whole pie is all of your customers and there are different ways to reach them: social media, email marketing, SEO, etc.  </p>  <p>  \t            Some slices may be bigger as you may get more customers from SEO (20% of your pie) vs. content marketing (only 2% of your pie). To truly be successful with your marketing, it’s important to try the different slices and find out which ones bring you the most customers.  </p>  <p>  \t<strong style=\"\">One of the simplest and most successful marketing slices I&#039;ve used throughout my career is paid search advertising on Google and Facebook.</strong>  </p>  <p>  \t            So, if you own a hot sauce business and someone searches for &quot;delicious hot sauce&quot;, you&#039;re able to show relevant ads and get that person on your site to buy your hot sauce. But, if you don’t know what you’re doing with paid ads, it’s one of the riskier methods and can suck up a ton of your money.  </p>  <p>  \t            If you’ve always been intimidated by paid marketing and want to finally add it to your marketing pie, I have something just for you: <strong style=\"\">A course that teaches you exactly how to run ads on Google and Facebook that don’t waste money and actually drive sales.</strong>  </p>  <p>  \t            The course consists of over 5+ hours of high-quality video content cut up into small, digestible and organized segments. <strong style=\"\">This is for anyone who&#039;s new to paid search advertising. It&#039;ll show you how to go from ZERO to having a campaign that&#039;s live and driving relevant traffic.</strong>  </p>  <p>  \t            Here’s exactly what you&#039;ll learn:  </p>  <ul style=\"\">  \t<li><strong style=\"\">Keywords</strong>: Learn the different keyword match types and how to best use them</li>  \t<li><strong style=\"\">Increasing CTR</strong>: Learn how to increase your click-through-rate (CTR) with ad extensions and dynamic keyword insertion</li>  \t<li><strong style=\"\">Getting sales from Facebook</strong>: Learn how to use Facebook to drive sales, not likes or other vanity metrics</li>  \t<li><strong style=\"\">Google Analytics</strong>: How to pull valuable reports on a daily basis and how to apply them to your marketing</li>  \t<li><strong style=\"\">Remarketing</strong>: How to setup and use remarketing campaigns, which often have the highest ROI</li>  \t<li><strong style=\"\">From scratch</strong>: How to create AdWords campaigns and Facebook campaigns from scratch</li>  \t<li><strong style=\"\">Tons and tons more</strong>: With over 40+ lessons, you&#039;ll learn how to start using paid marketing for your business immediately</li>  </ul>  <p>  \t<strong style=\"\">All of the content in the course was updated in late 2014, so you know you’re getting the most up-to-date information.</strong>  </p>  <p>  \t            Don&#039;t waste hours of your time going through other people’s blog posts, forums, and trial-and-error to learn how to use ads to get new customers.  </p>  <p>  \t            P.S. Every Udemy course comes with a free, 30-days, 100% satisfaction guarantee. If, for whatever reason, you&#039;re not fully satisfied you can ask for a full refund.  </p>", 
    "end_date": null, 
    "title": "PPC Training: Learn Google Adwords & Facebook Ads", 
    "price": "25.00", 
    "instructors": "Carl Sednaoui", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/225430_9ec3_6.jpg", 
    "course_url": "https://www.udemy.com/ppc-training-digital-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T19:32:13Z"
}