{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>I’ll be walking you through the process of optimizing your ecommerce store for Google and other search engines so that more sales result within 90 days. I’ll show you how to quickly identify a keyword that will bring in revenue and does not require much work to get on the first page of Google.</p>    <p><strong>Master E-commerce SEO Using KPIs To Guide You To More Revenue</strong></p>  <ul><li>Use Google Search Console and Google Analytics Ecommerce to track and measure SEO and online marketing performance</li><li>Identify and prioritize keywords and landing pages based on revenue</li><li>Optimize your ecommerce store accordingly</li><li>Learn my proven method to reduce shopping cart abandonment</li></ul>          <p><strong>How to identify and prioritize Ecommerce SEO opportunities that generate revenue</strong></p>    <p>E-Commerce has become an important tool for small and large businesses worldwide; every year ecommerce sales are hitting new records and retailers must stay ahead to maximize profits from SEO and online marketing channels. We’ll delve into a case study so you can see what I did to nearly double the revenue within 90 days for one ecommerce store.</p>    <p>This is not a beginner level SEO course, it’s specifically designed for ecommerce store owners and marketers who want more revenue from organic search. I’ll explain the important KPIs ecommerce stores must track and how to improve them to hit your revenue goal. </p>    <p>We’ll be using Google Analytics, Google Search Console and a few extra resources to evaluate SEO and online marketing performance. I’ll teach you how to identify and prioritize keywords and landing pages based on revenue. And, you’ll get my proven method to reduce shopping cart abandonment.</p>    <p>Don’t worry, I’ll walk you through everything step-by-step and show you examples and case studies along the way. All you need is a basic understanding of SEO and Google Analytics.</p>", 
    "end_date": null, 
    "title": "Revenue-based SEO", 
    "price": "25.00", 
    "instructors": "Tom Shivers", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655864_04a0_2.jpg", 
    "course_url": "https://www.udemy.com/revenue-based-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T21:07:00Z"
}