{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>This SEO for WordPress online training course you will learn teach you how to optimize your website using on-site and off-site SEO best practices.</strong><br></p>\n\n<p>This isn't a get-rich-quick scheme that promises #1 rankings overnight. Actually, it's the opposite. It is a tried-and-true SEO process use with my consulting clients.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Don't waste your time with other SEO for WordPress courses that are outdated and only focus on simple concepts, or black hat techniques. This course contains comprehensive strategies and techniques for ranking highly in organic search for targeted keywords so you can drive more traffic to your website or blog. It's much more than a simple demonstration of Yoast's SEO for WordPress plugin. It's a proven, step-by-step process for increasing your rankings and traffic. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course features overview lectures in each section where I break down SEO concepts to help you understand how search engines work and why certain tasks are important. Then, you will see examples of best practices using WordPress SEO tools and WordPress plugins available at no cost to you. Then, you will learn how to improve your website's domain authority, through off-site SEO, as I walk you through link building methods. Plus, you will get demonstrations and recommendations for professional SEO tools that will make you more productive.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I have been executing SEO campaigns and developing custom WordPress solutions for over 7+ years. Now, I have spent countless hours preparing training video lectures, slides and reference materials for Udemy so that you will fully understand how search engines work and how to improve your search engine rankings.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Check out the course topics below, and sign up for this class to get started.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Course Topics include:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>SEO statistics and trends. </li><li>How search engine rankings work. </li><li>Search engine ranking factors.</li><li>Conducting keyword research.</li><li>Planning your WordPress website structure for maximum search engine visibility.</li><li>Best practices in page structure within WordPress.</li><li>Creating custom page titles and meta descriptions with Yoast's SEO for WordPress plugin.</li><li>Blogging for SEO.</li><li>Creating and submitting an XML sitemap to Google Search Console and Bing Webmaster Tools.</li><li>Mastering off-site SEO.</li><li>Domain and Page Authority.</li><li>Ways to build links.</li><li>SEO Data and Reporting.</li><li>Improving your website speed.</li><li>Things you should avoid so don't get penalized by search engines. </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Plus, I will be updating this course with new lectures and bonus materials to keep you informed about new SEO techniques for WordPress in the future.</p>", 
    "end_date": null, 
    "title": "SEO for WordPress: Rank Higher & Drive More Traffic", 
    "price": "20.00", 
    "instructors": "Craig Rentmeester", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644980_0e45_5.jpg", 
    "course_url": "https://www.udemy.com/seo-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T18:01:23Z"
}