{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong style=\"\">SEO SECRET GAME PLAN AND TRAINING WITH SOFTWARE ($47 WORTH) 100% Free With This Course</strong></p><p><strong style=\"\">Want to learn how to rank for 100+ Keywords In Google within just 2 to 4 Weeks?</strong></p><p><strong style=\"\">Tired of the Google Penguin And Panda Update?</strong></p><p><strong style=\"\">I am revealing my strategy with complete step-by-step blueprint along with my $47 Worth Software 100% Free Only For My Udemy Students.</strong></p><p>I will practically move through each step and exactly show how i find and rank 100+ Keywords on any niche.</p><p><strong style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p>This is going to be your ultimate Search Engine Optimization course (<strong style=\"\">SEO TRAINING</strong>) and you will learn everything from how to find laser targeted keywords and how to rank them instantly/</p><p>After completing this course, you can rank for 100+ Keywords on any niche or category for you or for your clients.</p><p><strong style=\"\">++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</strong></p><p>The total new version of SEO That works in 2015 and will always work in future.</p><p><strong style=\"\">The Main Topics We Will Be Covering In This Course Are:</strong></p><ul style=\"\"><li>The Importance Of Choosing Your Keyword For Any Niche</li><li>How To Find 100+ Keywords That Have Really No Competition</li><li>Long And Mid Tail Keywords And Its Importance</li><li>My Blueprint On How To Find Low Competition Keywords And Rank Them Instantly</li><li>How To Use the Software That Generates Thousands Of Your Competitor Keywords</li><li>How To Use The Auto Suggest Keyword Method And Get Laser Targeted Customers</li><li>Various Methods To Rank These Keywords In Search Engines</li><li>Use Link Building Concept To Rank 100+ Keywords</li></ul><p>I will be personally reply and answer every question to the students who enroll to this course. I will make sure everyone who tries out this method gets 100% success in ranking for their keywords.</p><p>I provide 100% Money Back Guarantee with this course (if you cannot rank the keywords with this ideal plan) I refund your money. No questions asked.</p><p>Click <strong style=\"\">&quot;Take This Course&quot;</strong> Button At The Top Right and Rank for 100+ Keywords In Just 2 Weeks. What Are You Waiting For?</p>", 
    "end_date": null, 
    "title": "SEO Secret Plan+Software", 
    "price": "20.00", 
    "instructors": "Hema Chandiran", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500062_1b3d_2.jpg", 
    "course_url": "https://www.udemy.com/long-tail-keywords-website-ranking/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T15:27:36Z"
}