{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t      Google Search ranking plays a major role in getting free organic traffic to your website. However, Google&#039;s rules change very frequently, and website owners, marketers are always confused on what they need to do to get their website on the top of the Google Search Results.  </p>  <p>  \t      While no one can (and should) guarantee a good ranking, following some best practices will help you with a better chance of getting higher search ranking and hence more free traffic from Google Search. These are genuine tips that are prescribed by Google and hence everyone website owner and marketer should know about them.  </p>  <p>  \t      Also, there are so many misconceptions about what matters for SEO that I have seen some very good site get in the trap of bad SEOs (called Black Hat SEOs) which get their site in trouble. Once your site has been blacklisted, it is very difficult to get it back up the ranking, and sometimes, get it in the search rankings itself. Hence fully understanding the implication of their SEO efforts is very important.  </p>  <p>  \t      This is an attempt to educate the common users about SEO and the best practices one should follow. I have tried to keep away from heavy jargons and explain the basics in a manner that everyone can understand and appreciate.  </p>  <p>  \t      The course covers the following topics:  </p>  <p>  \t        1) What is SEO?  </p>  <p>  \t        2) How does a Search Engine work? What is Page Rank? What is crawl, index, rank and serve for a search engine?  </p>  <p>  \t        3) what are some of the best practices about SEO?  </p>  <p>  \t        4) How to get good links to your site?  </p>  <p>  \t        4) What are some of the top myths about SEO?  </p>  <p>  \t        This program is meant for entrepreneurs, business owners, students, and digital marketing professionals who want to understand SEO and implement it on their websites. Of, course, this is not meant for those seasoned SEOs who are looking for advance material.  </p>", 
    "end_date": null, 
    "title": "SEO Introduction from an ex-Googler", 
    "price": 0, 
    "instructors": "Amitabh Verma", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/331354_da06_2.jpg", 
    "course_url": "https://www.udemy.com/seo-introduction-from-an-ex-googler/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-30T05:03:08Z"
}