{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">Is seo totally confusing you? Stop, relax and breathe. Your pathway to simplified<strong style=\"\"> SEO Training</strong> is now at hand in the SEO Mastery course.</p><p style=\"\">It's time to learn it straight from professional SEO consultant, Greg Gillespie. Inside this course he will show you that the complexities of SEO are really just smoke and mirrors, made up by those who want to keep this a secret society.</p><p style=\"\">If you are looking for the truth about SEO and are tired of the conflicting reports about what works with ranking your website in the search engines, then this is the course for you. Everything from how to make your site crawlable by Google, to how to set up your site, so that it can rank highly in the search results.</p><p style=\"\"><strong style=\"\">Your Simplified SEO Training Starts Here</strong></p><p style=\"\">Learn Proper <strong style=\"\">Keyword Research</strong></p><p style=\"\">Discover <strong style=\"\">Competitor Analysis</strong> Time Saving Tools</p><p style=\"\">Execute Website Setup and <strong style=\"\">On-Page SEO to 2015 Standards</strong></p><p style=\"\">Understand <strong style=\"\">Backlinks and Off-Page Optimization</strong></p><p style=\"\">Discover <strong style=\"\">Leaked Google Panda Quality Scores Secrets</strong></p><p style=\"\">Staying <strong style=\"\">Penguin Algorithm</strong> Compliant</p><p style=\"\">Understand The <strong style=\"\">Hummingbird Engine</strong></p><p style=\"\">While a lot of courses on SEO attempt to train you to follow difficult and time consuming processes and procedures, this course will show you the easy way to get all your ducks in a row, so that the search engines show you the love your website deserves.</p><p style=\"\">We cover everything you need to know in order to get top placed rankings in the <strong style=\"\">SERPS </strong>(search engine results pages). This course is filled with up to date information on Google and it's many known requirements along with <strong style=\"\">a list of unofficial leaked documents</strong> that will give you the insiders view on what they really want from your website.</p><p style=\"\">There are <strong style=\"\">68 lectures</strong> and over <strong style=\"\">8 hours of video</strong> where Greg will cover and reveal everything you need to learn about SEO. He covers real world examples as you watch over his shoulder to see how an SEO consultant actually works, to bring about top rankings for his clients.</p><p style=\"\"><strong style=\"\">Overview of Course Contents</strong></p><p style=\"\">To begin with the course takes a 40,000 foot view of the 4 main areas of search engine optimization. We move through the course basics and on to the more complex theories and rules of the new on-page SEO quality score check points. We will be examining how backlinks work and how to attract them to your website and build out a high quality ranking profile, as quickly as possible.</p><p style=\"\"><strong style=\"\">By The End Of The Course</strong></p><p style=\"\">On completion of this course, you will not only have a solid understanding of the way search engines work but know exactly what you need to do to compete in todays search marketing landscape and come out a winner. Plus you will have at your disposal all the tools, guides and helps that Greg himself uses on a daily basis, doing professional SEO for his many clients around the globe.</p>", 
    "end_date": null, 
    "title": "SEO MASTERY - #1 For Search Engine Optimization Training ", 
    "price": "50.00", 
    "instructors": "Greg Gillespie", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/511438_94ee_7.jpg", 
    "course_url": "https://www.udemy.com/search-engine-optimization-training/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T03:53:52Z"
}