{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>SEO can be a powerful tool if used correctly</strong>. Implemented properly, Search Engine Optimization can improve your site's visibility in search results, which will translate to a higher traffic volume and ultimately to more sales for your business.</p>  <p>  \t             But this discipline can also be extremely confusing for the uninitiated, complex concepts, technical terms and implementation methods and lots and lots of information.  </p>  <p>  \t             Your company could greatly benefit from the implementation of SEO best practices but first you need to understand the concepts to the point where you could filter the good from the bad, be able to use and implement recommended tactics. This is what this course is for.  </p>  <p>  \t <strong>WHAT YOU WILL GET:</strong>  </p>  <p>  \t             - You will learn everything you need to know about SEO in a series of bite-size videos using PowerPoint slides and screencasts.  </p>  <p>  \t             - Over 3.5 hours of high quality content  </p>  <p>  \t             - Over 40 lectures with more content to come  </p>  <p>  \t <strong>WHO IS THIS COURSE FOR:</strong>  </p>  <p>  \t             This is a complete SEO course targeted at small and medium size businesses. It's created with the purpose of providing information in a way that is clear, easy to understand and implement so that anyone in the company will be able to take this course, learn the SEO best practices and implement them in relation to their respective roles.  </p>  <p>  \t             You should take this course if you are a business owner, a marketing professional, web developer or web designer and want to improve the performance of your online property.  </p>  <p>  \t <strong>WHAT IS THE COURSE STRUCTURE:</strong>  </p>  <p>  \t             This course is divided into 11 sections that cover all SEO levels:  </p>  <p>  \t             - <strong>the basic level</strong> (what is SEO, how search engines work and how can search engine optimization contribute to your business success)  </p>  <p>  \t             - <strong>the intermediate level</strong> (understanding your audience and keywords, choosing keywords and devising a keyword strategy, on-page and off-page optimization elements and methods)  </p>  <p>  \t             - <strong>the more </strong><strong>advanced tactics</strong> (semantic search, rich snippets, local SEO, mobile friendly websites)  </p>  <p>  \t             This is the course that will take your website to the next level of online visibility, traffic and user engagement so <strong>TAKE THIS COURSE NOW!</strong>  </p>", 
    "end_date": null, 
    "title": "SEO for Small and Medium Businesses", 
    "price": "50.00", 
    "instructors": "Flavius Cerbu", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/96434_b91a_6.jpg", 
    "course_url": "https://www.udemy.com/seo-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-24T08:24:49Z"
}