{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>++Update 21.01.2016 - Einleitung++</strong></p><p><strong>&gt;&gt;22.01.2016 Neu: Kapitel 6 - Social Media &amp; SEO&lt;&lt;</strong></p><p><strong>Suchmaschinenoptimierung - SEO für Unternehmer, Dienstleister, Handwerker, Ärzte und Rechtsanwälte</strong><br></p><p>Lernen Sie Ihre Website für Google zu optimieren und gewinnen Sie gratis neue Kunden.</p><p><strong>Fakt ist mehr als 90% der Deutschen nutzen Google um sich zu informieren und einen Kauf vorzubereiten.</strong> D.h. anders als bei der klassischen Werbung, wo Bedürfnisse geschaffen werden müssen, ist das Bedürfnis bei einer Suche in Google bereits vorhanden. Ein konkretes Bedürfnis muss also lediglich gedeckt werden!</p><p>Sie haben Zahnschmerzen? Dann suchen Sie einen Zahnarzt</p><p>Ihr Auto ist defekt? Dann suchen Sie eine Werkstatt...</p><p>Sie wollen einen neuen Fernseher? Dann...</p><p>Richtig! und genau so passiert dies 600 Millionen mal am Tag in Deutschland! <strong>600 Millionen Suchanfragen Tag für Tag über Google.</strong></p><p>Klar dürfte deshalb sein, wer gefunden wird, insbesondere wer auf Seite 1 bei Google gefunden wird, hat eine verdammt gute Chance als Anbieter oder Dienstleister gewählt zu werden.</p><p><strong>Mein Kurs zeigt ihnen Schritt für Schritt wie sie auf Seite 1 bei Google kommen. Dabei beschränke ich mich nicht auf theoretische Abhandlungen sondern zeige ihnen was in der Praxis bei mir funktioniert.</strong></p><p>Ihre Aufgabe besteht nur darin meine Beispiele nach zu machen und ebenfalls auf Seite 1 oder noch weiter vorne bei Google gefunden zu werden.</p><p>Grundkenntnisse in der Bedienung Ihrer Website sind sinnvoll aber sie können auch alle Arbeiten oder diesen Kurs an Ihnen Webmaster delegieren.</p><p><strong>Dieser Kurs wurde hauptsächlich für Sie - lieber Unternehmer oder Unternehmerin geschaffen und bedienst sich einer Sprache und Methoden, die Sie verstehen werden.</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "SEO 2016 - Suchmaschinenoptimierung vom Testsieger!", 
    "price": "20.00", 
    "instructors": "Norbert Weber", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592614_fe58.jpg", 
    "course_url": "https://www.udemy.com/seo-suchmaschinenoptimierung/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T08:09:45Z"
}