{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong><strong>**This course is completely updated and tailored to help you achieve great results in 2016! Let's make this year a great one guys**</strong></strong><br></p><p>I will offer Skype support to every student who asks for it. If you have a problem/question, send me a private message and we will set a time for the call.</p>  <p>  \t<em><em><strong>-------------------------------------------------------------------------------------------------------------</strong></em></em>  </p>  <p>  \t<strong><strong>Would you like to learn how to rank your website higher with search engines ?</strong></strong>  </p>  <p>  \t                               I will lay down very straightforward instructions to achieve this, after a short introduction to the theory of Search Engine Optimization ( SEO ).  </p>  <p>  \t<strong><strong>Let me help you !</strong></strong>  </p>  <p>  \t                              In this course, <strong><strong>I will teach and DEMONSTRATE </strong></strong>every step of the process from keyword research to on-page optimization, with or without Wordpress. </p>  <p>  \t                               Better yet, the learning curve for this course is very short. Watch it once and you'll be ready to go. Monkey sees monkey does. SEO doesn't have to be hard..</p>  <p>  \t                               ·Do you need/want to rank your website higher ?  </p>  <p>  \t                               ·Do you have very low starting capital, or wish to invest as little money as possible?  </p>  <p>  \t                               ·Are you busy and want to get things done as fast as possible?  </p>  <p>  \t                               ·Do you want to attract more visitors to your website or blog ?  </p>  <p>  \t                              If you answered « yes » to <em><em>these </em></em>questions, <strong><strong>then consider this course to be your blueprint to success.</strong></strong>  </p><p>With years of experience behind us, we have compiled every SEO advice and SEO ranking tactics we have <em><strong>personally</strong></em> used to rank our websites #1 in Google.</p>  <p>  \t                               Upon enrolling, you will get my personal help. I will answer any question that you may have in the member's area, and I also offer Skype support if needed.  </p>  <p>  \t<strong><strong>I would like to remind you that my course comes with a 30 days « no questions asked » money back guarantee. </strong></strong>You have a full month to give it a spin, and try it out and if, for whatever reasons, you are unsatisfied, just ask for your refund. You take absolutely no risk !  </p>  <p>  \t                              You can get started right after you have taken my course -That means <em><em><strong>TODAY!</strong></em></em>  </p>  <p>  \t                              Click the \"Take This Course\" button now. That's your first step to implementing SEO , arguably your strongest tool to grow your audience. Every minute that goes by without action is <strong><strong>a minute you are not getting back.</strong></strong>  </p>  <p>  \t                               Cheers!  </p>  <p>  \t                               Howard  </p>", 
    "end_date": null, 
    "title": "SEO For Beginners", 
    "price": "20.00", 
    "instructors": "Howard Lynch, Antoine Lelievre", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362160_c70f_4.jpg", 
    "course_url": "https://www.udemy.com/seo-for-newbies/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T10:25:14Z"
}