{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Suchmaschinenoptimierung (SEO) für Einsteiger!</strong></p>\n\n<p>Herzlich Willkommen!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Wir freuen uns, dass Sie sich für den Kurs \"Suchmaschinenoptimierung (SEO) für Einsteiger\" interessieren. Unser Team von SEOacademy hat geballte 25 Jahre an Erfahrung und Know-how für Sie strukturiert und einfach aufbereitet. Mit über 35.000 Studenten gehören wir weltweit zu den größten Trainings-Anbietern im Bereich der Suchmaschinenoptimierung.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In dem Kurs \"Suchmaschinenoptimierung (SEO) für Einsteiger\" lernen Sie alle Grundlagen der Suchmaschinenoptimierung kennen. Es ist uns wichtig sicherzustellen, dass Sie nicht nur sämtliche Fachbegriffe rund um das Thema Suchmaschinenoptimierung vermittelt bekommen sondern auch zu 100% verstehen, worauf es bei einer professionellen Optimierung ankommt.</p>\n\n<p><strong>SEO IST DIE ZUKUNFT!</strong> - Wo suchen Sie, wenn Sie Informationen über ein Thema benötigen? Richtig! Im Internet! Wo sonst? Höchstwahrscheinlich nutzen Sie für Ihre Recherche Google, wie über 90% aller Deutschen und sogar aller Europäer.<br><br>Worauf warten Sie also noch?<br>Fangen Sie an und überholen Sie Ihre Konkurrenz schon in den nächsten Wochen!</p><p>Vergessen Sie nicht: Jeder kann SEO lernen!</p><p><br></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Am Ende dieses Kurses werden Sie in der Lage sein:</strong></p>\n\n<p>✔ mit dem Know How aus der Keywordrecherche bessere Keywords auszuwählen und dadurch mehr Traffic und Verkäufe zu generieren!<br></p>\n\n<p>✔ einschätzen zu können welche Rankingfaktoren wichtig sind und welche nicht!<br></p>\n\n<p>✔ bei den Basisthemen von SEO mitreden zu können</p>\n\n<p>✔ mit der Optimierung Ihrer Website zu starten<br></p>\n\n<p>✔ Einschätzen zu können in welche Richtung sich Google entwickeln wird und wie daher    nachhaltig optimiert werden kann<br></p>\n\n<p>✔ Meta-Tags richtig zu optimieren und zu implementieren<br></p>\n\n<p>✔.... und vieles mehr!!!<br></p>\n\n<p><br></p>\n\n<p>Wir sehen uns im Kurs!</p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "SEO für Einsteiger: Suchmaschinenoptimierung einfach erklärt", 
    "price": "35.00", 
    "instructors": "SEO Academy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/845380_56c4_2.jpg", 
    "course_url": "https://www.udemy.com/seo-lernen/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-10T20:48:22Z"
}