{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>SEO beginner? Let me show you how to get high ranking in searches by learning the basics of search engine optimization. It's SEO easy!</strong></p><p>In this course, I show you how I get 1,000 visitors a day - that's a third of a million people a year. And it's not the mythical 'hits' that some people boast about. These are real live humans.</p><p>AND IF YOU ARE A WEB DESIGNER, APPLICATION DEVELOPER, FREELANCER, THIS COULDN'T BE MORE APPROPRIATE. YOU ARE SELLING TO EXACTLY THE SAME AUDIENCE I SELL TO. </p><p>And I did all the search engine optimization myself. I don't pretend to be an SEO guru. In fact, I hate technology, but I realized some time ago that your rankings in Google searches are too valuable to entrust to others. There's no need to spend a fortune with SEO companies when you can achieve astounding results yourself - without any technical expertise. After all, no-one knows your business like you do, and no one can be as highly motivated.</p><p><strong>Does it work?</strong></p><p>These are the results of some of my key phrase Google rankings (PS I am a copywriter)</p><p>IT Copywriter - position number one out of over 13 million competing sites</p><p>Brochure Copywriter - top position out of 375,000 competing sites</p><p>White Paper Copywriter - number one out of 233,000 sites</p><p>Logistics Copywriter - top out of half a million site</p><p><strong>Copy and Paste</strong></p><p>In this search engine optimization training course, there's no sales hype. I just lift the kimono and show you exactly what I did to my own site – and you can do exactly the same to <em>your </em>site – just 'copy and paste'. And, yes, it does take into account the latest changes that Google has made to its ranking algorithm.</p><p><strong>A jargon-free zone</strong></p><p>We start very gently, taking a bite at a time. In the entire course there are just six hard-core jargon words (I couldn't avoid those). They are search engine optimization basics, so they are easy to understand. The rest is pure layman's language. Each video introduces a new concept and is followed by a downloadable pdf, so you have a hard copy and can add notes of your own.</p><p>Oh – and I am very accessible. Any queries, or anything not clear, just email me.I am here to help.</p><ul><li><strong>WARNING: If you are already proficient at SEO, this course is NOT for you. It's not for 'techies', so you will be disappointed and frustrated. It is intended for people like me, too occupied running my business to want to get down to the minutia. I just want top ratings – and that's what I get.</strong></li></ul>", 
    "end_date": null, 
    "title": "SEO beginners : how I get 1,000 visitors a day with SEO", 
    "price": "20.00", 
    "instructors": "Len Smith, Sean Kaye", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/12196_c290_13.jpg", 
    "course_url": "https://www.udemy.com/search-engine-optimization-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-12-29T13:46:52Z"
}