{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Instant access to Search Engine Optimization building block basic&#039;s and the fundamental principles of what makes it work. Twenty-four categories that are found on most web pages that you have some control over to adjust or compare.</p><p>SEO is not black hat magic, but a calculated procedure that can be repeated by following established results. We will use our X-Ray vision to pick apart what&#039;s needed to blend in with those that have made the top ten already.</p><p>Search Engines are always trying to improve, and with that new rankings. We can look at who&#039;s ranking for what keyword phrases, both long tail and local terms, and use what their content shows us to work our way up towards them.<br style=\"\"></p><p><strong style=\"\">YOU WILL LEARN AND BE ABLE TO:</strong></p><ul style=\"\"><li style=\"\">Identify each and every part of a pages required sections </li><li style=\"\">Learn how not to spam your pages with overload of keyword phrases</li><li style=\"\">Discover who your competition is, and use their own methods to blend in</li><li style=\"\">Find old, existing domain names to buy which already beat your competition</li><li style=\"\">Find old, existing domain names to buy that already have incoming links to them</li><li style=\"\">Find old, existing domain names to buy and auction them off to make money</li><li style=\"\">Discover what the top ten sites for your keyword phrase are doing right</li></ul><p style=\"\"><strong style=\"\">EACH OF THE 24 GROUPS INCLUDE:</strong></p><ul style=\"\"><li style=\"\">Its own ranking level for scoring</li><li style=\"\">What that level of importance is based on</li><li style=\"\">If it is considered On Page, Off Page, or Off Site</li><li style=\"\">If you have control over the changes or others do</li><li style=\"\">An example of the HTML code for reference</li><li style=\"\">Best use considerations for that group</li><li style=\"\">What you should NOT do for that group</li><li style=\"\">The description of that group and its use</li><li style=\"\">Most of the groups come with Tips and Advice that can help even more</li></ul><p style=\"\"><br style=\"\"></p><p><br style=\"\"></p>", 
    "end_date": null, 
    "title": "SEO Training Complete With Its Own SEO Ranking Tool", 
    "price": "30.00", 
    "instructors": "David Reynolds", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/378632_80fc_16.jpg", 
    "course_url": "https://www.udemy.com/search-engine-optimizing-to-rank-in-the-top-ten-positions/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-27T17:23:22Z"
}