{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>This \"SEO Primer\" course will teach you the basics of a sustainable, long-term SEO strategy.  However, it is not just about showing you how to optimize your website.   I'm sure you have heard the expression \"give a man a fish, feed him for a day, teach a man to fish, feed him forever\".  Well, that is my approach to teaching you SEO in this course.  I want you to leave this course with an SEO Mindset, so you understand what Google wants, and how to give it to them. I want you to understand why some SEO techniques are risky, while others are not, and have the ability to evaluate SEO techniques you hear about on-the-fly.</p><p>This course introduces you to SEO, what it is and why it is necessary.  </p><p>You'll learn about Black Hat, White Hat and Grey Hat SEO, and how to spot these three different \"varieties\" of search engine optimization.</p><p>I'll show you how SEO used to be done a few short years ago, with real examples of content that used to rank very well, and make good money for me.  We'll look at what those techniques no longer work, and then concentrate on the factors that are the most important today.  </p><p>You will learn the very best place to get your SEO knowledge from - Google itself.</p><p>In the final section of this primer, you'll learn how to create high quality content for your site.  You'll also learn all about the importance of backlinking.  I'll show you my \"Holy Grail\" of backlinks -  a checklist of things to look for when you evaluate a backlinking opportunity, as well as the best way to achieve this type of backlink.</p><p>By the time you finish this primer, you'll have a good grasp of White Hat SEO which will give you a powerful foundation for your SEO adventures.  Most importantly of all, you'll have an SEO mindset that will act as your compass as you navigate the web and start to improve your web page rankings.</p>", 
    "end_date": null, 
    "title": "SEO Primer - Search Engine Optimization for Beginners", 
    "price": "20.00", 
    "instructors": "Andrew Williams", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562424_aca5.jpg", 
    "course_url": "https://www.udemy.com/seo-primer-search-engine-optimization-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T08:52:25Z"
}