{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>¡Mas de 550 estudiantes han elegido ya este curso!</strong></p><ul><li><strong>Aprende SEO para que tu web adelante a la competencia</strong></li><li><strong>Gana dinero con tu web</strong></li><li><strong>Aprende a espiar a tu competencia</strong></li><li><strong>Ultimo vídeo subido en Diciembre de 2015</strong></li><li><strong>Contesto dudas a diario...</strong></li></ul><p>El curso seo expone todos los principios del seo y te explica paso a paso, desde cero, qué hacer para posicionar tu web en Google, adelantar a tu competencia y por fin conseguir ganar dinero con tu web.<br></p><p>Es un curso basado en vídeos y algunos materiales adicionales en PDF. Está estructurado en 12 secciones a las cuales se irán añadiendo más con el tiempo. </p><p>El último vídeo de la sección 12 ha sido añadido en <strong><em>Diciembre de 2015</em></strong>, poco a poco iré subiendo nuevos vídeos...</p><p>Estas 12 secciones forman ya un paquete adecuado para tener los conocimientos que necesitas para posicionar tu página en Google y también para aprender temas interesantes sobre redes sociales. Puedes hacer el curso a tu ritmo. A una semana por sección como mínimo, tardarías 12 semanas, con algo de práctica, en unos 3 meses podrías tener aprendidos los conocimientos, aunque se recomienda más tiempo para practicar y experimentar...</p><p>Te cuento todas las técnicas y trucos que he ido aprendiendo y probando con los años, además de informo de más ideas y promociones... además, tienes mi garantía y la de UDEMY de 30 días. Te garantizo que si no te gusta el curso , se te devuelve el dinero durante los primeros 30 días.... pero eso no va a pasar, seguro que te gusta... :)</p>  <p>  \t          Si deseas conocer las técnicas, trucos y guías sobre SEO para adelantar a tu competencia, este es tu curso. ¡Atrévete a ganar dinero con tu web! </p>  <p>  \t<em><strong>¡¡¡ 80 vídeos para que lo pases bien aprendiendo SEO... No te lo pierdas!!!</strong></em>  </p>", 
    "end_date": null, 
    "title": "Seo paso a paso. Aprende a posicionar tu web en Google.", 
    "price": "30.00", 
    "instructors": "David Garcia Velo", 
    "commitment": "21.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/202522_2c3e_3.jpg", 
    "course_url": "https://www.udemy.com/cursoseo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-21T11:37:20Z"
}