{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>The main focus of this course is to create a more search engine friendly Word press website. Whether you be new to search engine optimization, social media marketing, content marketing, or search engine marketing, this is a great way to start or improve your knowledge. You will be taught how to optimize a Wordpress website, build back links, and use site analyzers with different SEO tools. This lesson is ideal for anyone who's looking to learn what works in today's world of SEO on Wordpress. I show how to use the SEO by Yoast plugin and set it up properly, optimize pages and blog posts, share content through social media, analyze keyword density, find out what's working for competitors, and build back links through an app called Buzzsumo. Furthermore, this course is about an hour long and will give you quick valuable knowledge that will help take your website to the next level. The course starts out with a lecture on how to set up your Yoast plugin and then optimize your pages with it. Additionally, we continue by sharing through social media and how to implement social media buttons. Afterwards, I briefly show you several SEO tools you will want to use to help you with your SEO efforts. I will make sure to provide prompt feedback to anyone who has questions about what they will learn in this overview. </p>", 
    "end_date": null, 
    "title": "SEO (Search Engine Optimization) for Wordpress", 
    "price": "20.00", 
    "instructors": "Search Engine Optimzation Chase Reiner", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620684_67ee_5.jpg", 
    "course_url": "https://www.udemy.com/seo-search-engine-optimization-for-wordpress/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T20:53:16Z"
}