{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Important Note: This course was last updated on 1st June 2015 and currently has over 4700 students and is rated 5 stars.</strong>  </p>  <p>  \t                ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++  </p>    <p>  \t<strong>SEO Training Just Got Easy (Over 3000 Students Already)!</strong>  </p>  <p>  \t                                                            Have considered entering the world of SEO - Search Engine Optimisation only to say to yourself:  </p>  <ul>  \t<li>I just feel it's too hard</li>  \t<li>I think it's too complicated</li>  \t<li>I lack of basic knowledge </li>  \t<li>I don't know where to start</li>  \t<li>I simply don't have the time</li>  \t<li>I don't have the money or resources to action an online marketing campaign</li>  \t<li>I have used the services of a 'SEO &amp; Online Marketing\" company before and    felt the return on investment was poor</li>  </ul>  <p>  \t                                                           We have coached and consulted with thousands of business owners and entrepreneurs and can totally relate to how you are feeling and the obstacles you are facing.  </p>  <p>  \t                                                          That's why we created SEO Enigma - the ultimate SEO training programme.  </p>  <p>  \t<strong>SEO Enigma Reloaded</strong> is a comprehensive, fully fledged SEO education, aimed at delivering long term targeted traffic.  </p>  <p>  \t                                                                         Over 60+ lectures (3-12 mins each in duration) and 9 hours of content cover every important aspect of SEO from a basic introduction, to the keyword &amp; competition research phase, optimization process and finally tracking.  </p>  <p>  \t                                                                         The course is split into TEN (10) easy to consume, step-by step modules:  </p>  <p>  \t<strong>Introduction Module:</strong>  </p>  <p>  \t                                                                 An introduction to SEO, covering some of the basics and background and including terminology. Also learn how a domain name matters and understand about hosting.  </p>  <p>  \t<strong>Module 1 – Keywords</strong>  </p>  <p>  \t                                                                 Perhaps one of the most misunderstood areas of optimization but also one of the most important. Identifying your keywords and analyzing competition is essential  </p>  <p>  \t<strong>Module 2 – Structure</strong>  </p>  <p>  \t                                                                 Understand why site structure is important for both visitors and the search engines and why calls to action and navigation is vital.  </p>  <p>  \t<strong>Module 3 – Setup</strong>  </p>  <p>  \t                                                                 Lean how to install wordpress and make some basic settings changes, which will dramatically affect how your site is viewed by Google. Learn about permalinks, ping services, plugins and themes.  </p>  <p>  \t<strong>Module 4 – Onsite Optimization</strong>  </p>  <p>  \t                                                                 Learn what is onsite optimization and how to make sure your pages are fully optimized so that the search engines understand what your contentis about.  </p>  <p>  \t<strong>Module 5 – Offsite Optimization  \t</strong>  </p>    <p>  \t                                                                 Learn about offsite optimization and how it impacts on SEO. Discover how link values differ and how to build high quality links back to your site.  </p>  <p>  \t                                                                 Furthermore, discover how to recover from past errors that may have affected your web presence and rankings since Panda and Hummingbird updates  </p>  <p>  \t<strong>Module 6 – Social Signals</strong>  </p>  <p>  \t                                                                 Social signals have become so important, we dedicated a whole module to them. Discover what exactly they are and how to get the most from your social profiles.  </p>  <p>  \t<strong>Module 7 – Local SEO</strong>  </p>  <p>  \t                                                                 Learn why local search has exploded in the last few years and how to optimize for local search terms, including how to optimize your Google Places page  </p>  <p>  \t<strong>Module 8 – Mobile SEO</strong>  </p>  <p>  \t                                                                 Mobile web use has gone stratospheric and more and more of us use our phone to surf the web and search. Discover how presenting a mobile optimized website will drastically increase conversions and how to optimize for mobile search'  </p>  <p>  \t<strong>Module 9 – Analytics and Tracking</strong>  </p>  <p>  \t                                                                 It's essential to track and test so you can find out what is working and what is not. In this final module, we look at how to track your websites performance using Google Analytics and how to create goals and advanced segments, along with an introduction to Webmaster tools.  </p>  <p>  \t<strong>Module 10 - Google Updates</strong>  \t  \t                 Have you heard horror stories about Google's never-ending train of algorithm updates? In this module, we look at each one in detail and how to make sure your SEO efforts are completely Google update proof. There is actually nothing to be afraid of once you understand how and why they work  \t<strong>  \t                 Module 11 - Linkbuilding for 2014</strong>  \t  \t                 Is link building dead? Far from it is the answer and we have the proof to show you. Not only that but link building is here to stay for a long time into the future. Learn how to build links specifically for Panda and Penguin and Hummingbird take advantage of massive extra rankings and traffic.  \t  \t<strong>Module 12 - Quality Content For Maximum Traffic</strong>  \t  \t                 Learn how to write quality content that the search engines love and leverage your efforts. Content can be Time-consuming, but will show you how to work smarter not harder. Get our top 10 tips for producing effective copy that will boost your rankings and keep your visitors coming back for more.  </p>  <p>  \t                                                        This comprehensive course will <strong>reveal EVERY tactic</strong> we have learned and are currently using in our successful SEO business. We have left no stone unturned and unlike many other courses - NOTHING has been left out.  </p>  <p>  \t                                                        Not only will everything be laid bare for you to devour, but more importantly, you will personally master these strategies to ensure maximum success and leverage for you and your business in one of the fastest growing marketplaces - the online world.  </p>  <p>  \t                                                 Enrol Today!  </p>  <p>  \t<strong><em>Jon Shawcross &amp; Anton Nadilo</em></strong>  </p>  <p>  \t                 Your Instructors - SEO Enigma Reloaded  </p>", 
    "end_date": null, 
    "title": "SEO Training - Master The Art Of Search Engine Optimization", 
    "price": "50.00", 
    "instructors": "Anton Nadilo, Jon Shawcross", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/122606_72cd_11.jpg", 
    "course_url": "https://www.udemy.com/seo-enigma/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-20T01:27:56Z"
}