{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Welcome to the SEO Master Course, where you’ll learn everything you need to know to drive free, organic traffic to your website.</p><p>My name is Ryan Wiley, and I’m so excited to present this course to you. For over 7 years now, I’ve worked for one of the largest digital marketing agencies in the United States. I’ve done SEO for multi-million dollars brands you’ve most likely heard of. Sites that were receiving tens of thousands of visitors a day even before I began working with them. I’ve also worked on the other end of the spectrum… individuals who were only getting a few visits a day. I was able to get them to a point where they were getting calls and emails daily for their products and services.</p><p>At the end of this course, you’ll be able to…<span></span></p><ul>\n<li>Confidently optimize your website using proven SEO principles</li>\n<li>Build out a content plan based on strategic keyword and competitive research</li>\n<li>Set your website up for success, even as technology and search algorithms change</li></ul><p>I’ll be teaching you how to…<span></span></p><ul>\n<li>Set up your pages so they have the best opportunity to rank well</li>\n<li>Create content better and faster than you ever thought possible</li>\n<li>Perform a technical analysis of your website to ensure it isn’t being penalized by search engines</li>\n<li>Use SEO tactics that even Google approves of</li></ul><p>You'll learn what works, and equally importantly, what doesn’t work. Some SEO courses go into great depth on things like link building, but can I let you in on a little secret?... </p><p>Google is really REALLY smart! </p><p>Tricks and tactics that worked a few years ago, even as recent as 2015, no longer do. Trust me, I wish they did! The strategies you’ll learn should work long into the future, because it aligns perfectly with what search engines want from us website creators.</p><p>The ideal student is someone that has any interest in learning SEO. I start from the very beginning, so even if you don’t even know what SEO stands for, but want to drive traffic to your website I can help you. And if you’re a little more experienced, it’s not long before we get to the good stuff. Even if you’ve done SEO work for a few years, I’m sure I can teach you a few tricks you haven’t seen or heard of before.</p><p>If this sounds good, then hit the “Take This Course” link right now, where you’ll get lifetime access to constantly updated material. You’ll also be able to post in the discussions any questions you have. I love helping people and have a real passion for SEO. I look forward to seeing you on the inside!</p>", 
    "end_date": null, 
    "title": "SEO Master Course - Get Tons of Free, Organic Search Traffic", 
    "price": "20.00", 
    "instructors": "Ryan Wiley", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683338_7b30_2.jpg", 
    "course_url": "https://www.udemy.com/seo-master-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T14:26:50Z"
}