{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">SEO - Local SEO</strong><br></p>\n\n<p>SEO Training - With a little bit of training, you can learn how to improve your local search rankings and SEO rankings using the latest techniques for 2016 and grow your local based business.</p><p><strong>Wordpress Not Required</strong></p><p>Most Local SEO courses assume you have Wordpress, but you can use the methods in this course with any website, not just Wordpress.</p>\n\n<p><strong class=\"redactor-inline-converted\">Objectives Of The Local SEO Course</strong></p>\n\n<p>  \t                                                                                              This course is a guide to show you how to improve you local search position for your business using the latest Local SEO techniques.</p>\n\n<p>  \t  \t<strong class=\"redactor-inline-converted\">Complete Guide To Local SEO:</strong></p>\n\n<p>  \t                                                                                            This is a complete guide with step by step instructions on how to improve your local search rankings in Google local search, Google personalised search and Google maps search.</p>\n\n<p>  \t                                                                                              Knowing how to do all the things Google wants you to do, gives you an advantage.  </p>\n\n<p>  \t                                                                                              If someone in your area is searching for your business on Google, you will need to appear in search in a favourable position.  </p>\n\n<p>  \t                                                                                              Creating a strong local SEO (search engine optimisation) strategy is key and this course will guide you through how Google+ can be a part in that process.  </p>\n\n<p><strong class=\"redactor-inline-converted\">What You Will Learn About Local SEO In This Course:</strong><br></p>\n\n<p>In this course, you will learn how to set up your business in local search so that it can be found</p>\n\n<p>And you will learn how to improve your rankings and competitiveness in local search results.</p>\n\n<p>You will also learn how to master local online search marketing so that you can grow your business with highly targeted potential clients in an easy to understand way!</p>\n\n<p>So if you are a business owner, that serves a local area and you want to compete in Google search with organic traffic (free traffic), then this course contains essential information that will help you do that.</p>\n\n<p>It is also useful if you are running a marketing business as it will give you very specific SEO training on how Google+ can help your clients impact their position in search, which will deepen the strength of your service offerings.</p>\n\n<p><strong class=\"redactor-inline-converted\">Special Note For Marketeers Who Want To Learn Local SEO:</strong><br></p>\n\n<p>Once you have gone through the course, you will in turn, be able to train others, we recommend that you practice the principles first however, until you are completely sure that you have grasped all the ins and outs that we discuss in the training.</p>\n\n<p>  \t  \t<strong class=\"redactor-inline-converted\">Course Format:</strong>  </p>\n\n<p>  \t                                                                                              The SEO training is presented in a really simple format that anyone can understand and all terms are clearly explained throughout the course.  </p>\n\n<p>  \t                                                                                              This is a video course with on screen notes and screen shares throughout.  </p>\n\n<p><strong class=\"redactor-inline-converted\">The Guarantee:</strong><br></p>\n\n<p>Before we go any further, let me just say, I don’t want you to be disappointed.<br></p>\n\n<p>If you don’t like this course for any reason, you can get a full refund in the first 30 days, which is backed by Udemy’s 30 day guarantee, with no questions asked!</p>\n\n<p>  \t  \t<strong class=\"redactor-inline-converted\">Questions This Course Answers:</strong>  </p>\n\n<ul>  \t<li>How can I get my business to do better in local search results?</li>  \t<li>How do I get my business higher in Google maps results?</li>  \t<li>Will Google+ help me with SEO?</li>  \t<li>How do I get my business found on Google?</li>  \t<li>Why don't I see my business in Google maps?</li><li>How does Google My Business work?</li>  </ul>\n\n<p><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Join Me On The Other Side And Learn Local SEO:</strong></p>\n\n<p>So join me on the other side and learn how to use local search marketing to grow your business profits and your business!<br></p>", 
    "end_date": null, 
    "title": "SEO - Local SEO 2016 - Learn Local SEO Fast", 
    "price": "35.00", 
    "instructors": "Mark Timberlake", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329444_8db6_10.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-use-google-for-local-search-seo-benefit/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T15:29:11Z"
}