{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<em>LATEST: Course Updated On September, 2015:</em>  </p>  <ul>  \t<li><em>Secret white hat strategy that takes advantage of the strongest ranking factor to  beat the competition</em></li>  \t<li><em>Example of how to use the Google Keyword tool</em></li>  \t<li><em>Example of how to use authoritative sites to rank </em></li>  \t<li><em>Lecture on how to write better headlines that increase click-through rates </em></li>  \t<li><em>Example of how to use social media to boost the rankings of your web pages</em></li>  </ul>  <hr style=\"\">  <p>  \t<em>* OVER 1,000 DELIGHTED STUDENTS HAVE TAKEN THIS COURSE</em>  </p>  <hr style=\"\">  <p>  \t          Learn the SEO strategies I used to reach over a million people by combining SEO with social media, publicity, and using savvy techniques to side-step competition and get lots of traffic to my products!  </p>  <p>  \t                                                                                This course is meant to make you very strong at SEO marketing. In the course I share knowledge from my 10+ years of doing SEO for various websites, and helping many entrepreneurs learn SEO.  </p>  <p>  \t                                                                                Since I have been working with many entrepreneurs, I have a deep understanding of the kinds of mistakes they typically make, and the misunderstandings and questions they usually have. In this course I address precisely those issues. Plus, I give many insightful and effective \"white hat\" SEO strategies in order to make you a great SEO marketer.  </p>  <p>  \t                                                                                The course is made up of over 30 video lectures, and should take three hours to complete.  </p>  <p>  \t                                                            In addition to the course lectures, you get my help and advice! Students are able to start discussions and message me with private questions. I answer 99% of questions within 24 hours. I love helping students who take my courses and I look forward to helping you.  </p>  <p>  \t                                                                               The course is structured into three parts. The first part of the course is meant to give you solid SEO fundamentals. The topics that are covered are the history of SEO, keyword research, blogging, and related issues.  </p>  <p>  \t                                                                               The second part of this SEO course covers further SEO topics like how to dominate the top-10 search results of Google with more than one listing, how to do SEO on other platforms to reach great scale, long tail vs. short tail keywords, Google penalties, and much more.  </p>  <p>  \t                                                                               The third part of this SEO course focuses on how to do keyword research. I explain what kinds of links are good to get, and what kinds of links you should stay away from. I also explain how to get links by getting press coverage for your business because that is the best of both worlds. Typically links from press mentions also bring you website traffic, and those links come from very strong websites in terms of SEO.  </p>  <p>  \t                                                                              I hope you enjoy the course, and find it helpful. I made it with the intention of giving you practical and actionable knowledge to empower you to be a very good SEO marketer.  </p>  <p>  \t                                                                    +++++++++++++++++++++++++++++  </p>  <p>  \t                                                                    MONEY BACK GUARANTEE  </p>  <p>  \t<em>The course comes with an unconditional, Udemy backed, 30 day money-back guarantee so you can try the course risk free. This is not just a guarantee, it's my personal promise to you that you will succeed ... just like my thousands of other Udemy students.</em>  </p>", 
    "end_date": null, 
    "title": "SEO Strategies 2016", 
    "price": "20.00", 
    "instructors": "Alex Genadinik", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187246_fab1_2.jpg", 
    "course_url": "https://www.udemy.com/seo-with-google-other-large-platforms-to-get-great-scale/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-23T11:41:39Z"
}