{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Starting at the beginning, this course covers everything you need to know to get your pages ranked without resorting to loopholes and tactics that will get your site penalized.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">SEO 2016 course - Student Reviews</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"The lessons in this course go way beyond pure information. Andrew (the instructor) knows his stuff inside out, and more significantly, he knows how to pass his knowledge clearly so that I can take action on it right away.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Thanks Andy, I've done the whole course and it is brilliant. It covers the full range of SEO components in a clear, practical and friendly way. I'm quite 'picky' but have no hesitation in recommending it without reservation at all levels from beginner upwards. (I'm probably around the intermediate level). It debunks many common myths and the advice is always actionable.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Andy is one of the most thorough teachers I've seen on this subject and his knowledge of SEO is brilliant. I like his step by step teaching style and clearly produced videos. I highly recommend this course to anyone wanting to learn SEO\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"This course is loaded with important information and I know I'll be referring back to it as I improve my website. It's a great course.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Very personable and easy to listen to. He has a tonne of helpful suggestions and is content rich. Anyone who is interested in this type of course don't hesitate to pick up this course. It is the best value for your money that you can find! Very happy with my purchase!\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I love this course! Andrew is not shy about helping people do the right thing by working in alignment with Google to learn SEO (white hat) fundamentals. The course was thorough and highly informative. Four hours of practical and densely practical instruction that will benefit any business person or webmaster stay up to date with smart SEO advances and practical skills. I sincerely recommend this course!\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"Easy to understand — both well-structured, and great diction! Very methodical and analytical, which is what you want in a good SEO program.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I love Andy's information. It is very thorough and what he teaches just makes sense. If you're looking for a common sense and safe way to SEO your website then I totally recommend following Andy's advice.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>\"I have studied SEO and Google for several years now and I think Andrew has covered many topics of importance in a short and concise way for beginners and professionals to learn SEO in depth\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This Course is different because?</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>No tricks</li><li>No gimmicks</li><li>No Loopholes</li><li>No worry about Google slapping a penalty on your site.</li></ul>\n\n\n\n\n\n\n\n\n\n<p>  \tIf you want to learn modern SEO and how to make a website rank in Google, safely, effectively and without resorting to gimmicks, tricks and loopholes, then this is the course for you.  With over a decade of front-line experience in SEO, this instructor has plenty of applied experience and is well known for his high ethics when it comes to ranking in Google.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThe course starts off with an introduction to SEO, highlighting the main differences between SEO today, and SEO just a few short years ago.  You'll learn all about the major Google updates, and why they were introduced.  As you learn about the updates, you'll begin to understand exactly what Google want to achieve, and the types of content they want to rank at the top of the search engine.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThe course goes on to introduce you to the FOUR main pillars of modern SEO.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tYou'll learn all about LSI and how themeing your content can give you a major SEO boost in the results pages.  There are checklists and details on each of the elements of a web page, and how to SEO for Google.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You'll also learn about the best types of backlinks to pursue, and how to go about getting them.  With backlinks causing so many problems for so many webmasters, you'll also learn about the types of backlinks that Google are on the lookout for, and why they punish sites that employ them.  A lot of SEO sites offering tips on how to rank will get this terribly wrong.  So wrong that following their SEO advice will get your site penalized or even banned from the top search engines.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You'll learn about site organization - why it is important and how to achieve a good site structure that benefits your SEO efforts and helps your visitors.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThis course emphasizes visitor experience for one very good reason.  Google wants to create an algorithm that cannot be manipulated by SEOs and webmasters.  What better measure for Google is the visitor's experience?  Get that right and half the battle is won.  </p>\n\n\n\n\n\n<p>Start the SEO 2016 course and begin to take control of your website traffic, visitors and profits.</p>", 
    "end_date": null, 
    "title": "SEO 2016 - Better Search Engine Rankings with Safe SEO", 
    "price": "35.00", 
    "instructors": "Andrew Williams", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417316_6bd2_4.jpg", 
    "course_url": "https://www.udemy.com/seo-search-engine-optimization-course/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T14:25:20Z"
}