{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>We all know that better ranking equals more traffic which equals more sales online.</p><p>SEO The practice of Search Engine Optimization has changed a lot and will continue to evolve.  Develop a mindset, in order to evolve alongside.  There are several constants when it comes to good ranking.   Learn common sense practices for better understanding of what to consider when it comes to your SEO website planning.</p><p>From an instructor who’s been online since 1999 and has created hundreds of websites driving hundreds of millions of views.  By regularly keeping pace with best SEO practices this course will outline what you can do to better optimize your websites.  </p><p>This course will illustrate what can be done to improve your chances of ranking well within search results.  There are over 250 tips discussed throughout the course, which help you think smarter about SEO and to better help you optimize your website.  It’s not about learning a magic trick to get to the top, it’s about thinking and using common sense to create better performing websites.  If you are looking for a secret magic formula, this is not the course for you.  It takes hard work, and persistence but success online is in reach for anyone who wants it. </p><p>The course instructor has comprised a list of over 250 plus items which get discussed within the course, that you should consider when you want to improve your search engine ranking.  This is a list of tips that have been kept and regularly updated when new guidelines and strategies are released.  This course is not about memorizing all these techniques it about learning to think about what works in SEO.  Our approach to SEO is more like a natural common sense approach, than a set of rules.   Finding that fine line now when it comes to what is important for your individual website SEO.</p><br>Understanding the principles discussed in the course will help you better navigate the complex and sometimes opposing strategies for SEO.", 
    "end_date": null, 
    "title": "SEO Basics Tips for Ranking Better", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/794242_945e_2.jpg", 
    "course_url": "https://www.udemy.com/seo-basics-tips-for-ranking-better/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-16T00:37:00Z"
}