{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t    This Beginner SEO Training Course for WordPress takes you on a step-by-step journey  which provides you with practical tips that will enable you to achieve and maintain the best search engine results possible for your site.  </p>  <p style=\"\">  \t        Having Search Engine Optimisation knowledge means that you can do your own SEO. You will be able to respond to changes in the industry and apply changes in your organisation much faster and especially cheaper than if you required to use an external company to do the SEO for you.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">In this course you will learn:  </strong></em>  </p>  <ul style=\"\">  \t<li>  Understand the basics of SEO and get best practice information on how to start</li>  \t<li>  Learn how to do Keyword research and identify the correct keywords for your kind of business</li>  \t<li>  Learn how to apply  SEO techniques to WordPress</li>  \t<li>  Learn how to catch your visitors attention and implement these tips into your marketing strategy</li>  \t<li>  Implement tools to monitor and review the effectivity of your SEO Strategy </li>  </ul>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">At the end of this course you will:</strong></em>  </p>  <ul style=\"\">  \t<li>Know precisely what Search Engine Optimisation is, and how you will be able to make it work for your business</li>  \t<li>Know what you need to do to rank your website in search engines and look for for relevant keywords</li>  \t<li>Be able to apply your SEO strategies on your WordPress website</li>  </ul>  <p style=\"\">  \t      Take this course now to optimise your website. Encourage people, increase your sales and create a steady income from your site!  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "SEO & Social Marketing for WordPress 4: Increase Web Traffic", 
    "price": "35.00", 
    "instructors": "DigitalGuides Online", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/395814_9cc5_2.jpg", 
    "course_url": "https://www.udemy.com/seo-social-marketing-for-wordpress-4-increase-web-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-16T15:39:01Z"
}