{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>SEO tutorial for business owners, web designers, marketeers and anyone looking to broaden their horizons with this highly paid online skill.</p>\n\n<p>Student Testimonial: <em class=\"redactor-inline-converted\">★★★★★</em> \"<em class=\"redactor-inline-converted\">From feeling confused to now feeling confident. This course was really great, thank you!</em>\" - Emily E Hunt<br></p>\n\n\n\n\n\n\n\n<p>In this SEO tutorial for beginners, you'll learn about the <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Three Pillars of Powerful SEO:</em></strong><br></p>\n\n\n\n\n\n\n\n<ol><li><strong class=\"redactor-inline-converted\">Keyword Research:</strong> How to find keywords that attract visitors who want to buy</li><li><strong class=\"redactor-inline-converted\">On Page Optimisation:</strong> How to increase your site visibility in the search engines</li><li><strong class=\"redactor-inline-converted\">Off page optimisation: </strong>How to build authority on your site using links so Google knows you have the best content for it's users.</li></ol>\n\n\n\n\n\n\n\n<p>Getting to the top of the search results is the goal of search engine optimisation because the higher you appear in the search results, the more free traffic you'll get which means more sales and more money in your pocket!</p>\n\n\n\n\n\n\n\n<p>Because my goal is to get you up to speed as quickly as possible, I've been careful to make the course lectures snappy, efficient and always delivered in plain english. Throughout the course, I've also included lots of examples to help you retain the key concepts and strategies we discuss.</p>\n\n\n\n\n\n\n\n<p>This SEO Tutorial for beginners is a valuable investment to make in yourself because SEO is a skill you can use for your own online ventures <strong class=\"redactor-inline-converted\">AND ALSO</strong> bring to table to help friends, colleagues and other business partners.</p>\n\n\n\n\n\n\n\n<p>And the Bottom line is if you don't understand SEO and apply it to your business online, you're MISSING OUT on Massive amounts of <em class=\"redactor-inline-converted\">free traffic </em>from the search engines</p>\n\n\n\n\n\n\n\n<p>Believe me, the only regret you're going to have is that you didn't find this course 6 months ago and get started then.</p>\n\n\n\n\n\n\n\n<p>So go ahead and hit the \"<strong class=\"redactor-inline-converted\">take this course</strong>\" button and join the <strong><em>2</em></strong><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">4000+ students already enrolled.</em></strong></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">---</em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Student testimonials</strong></em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\">★★★★★ \"This course is well-organized, logical, and easy to follow. A helpful introduction to SEO. I was able to watch the course in one tab, and make changes to my website to improve the SEO as I took the course. A great beginner course that was well-woth the time. Thank you!</em><em class=\"redactor-inline-converted\">\" - <strong class=\"redactor-inline-converted\">Diana Hutchinson</strong></em></p>\n\n\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">★★★★★ </em>\"Thank you so much for this course. It was very clear and went straight to what we need to start with SEO. English is not my mother language. I didn't have to worry about the flow of your speech. Thanks a lot! :).\" - <strong class=\"redactor-inline-converted\">Océane Massé</strong></em></p>", 
    "end_date": null, 
    "title": "SEO for SEO Beginners", 
    "price": 0, 
    "instructors": "Daragh Walsh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/466000_ba10.jpg", 
    "course_url": "https://www.udemy.com/seo-tutorial/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-02T17:27:26Z"
}