{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>♚ Over 12000 satisfied students enrolled in my courses</p><p>♚ Over 97 5 Stars Reviews from very happy students</p><p>________________________________________________________________________</p><p><em></em><em><em><em><em><em>Course updated on the 15th of March 2016.</em></em></em></em></em><em></em></p><p><strong></strong></p><p>\t<strong>In this course you will learn how to switch a website from HTTP to HTTPS. </strong>  </p>  <p>\tSo if you want to switch your website to HTTPS or if you work as an agency and you are not sure if you should recommend this step to your clients thenthis is the right course for you!</p>  <p>\tAs you may have heard, Google announced that using HTTPS now became a ranking factor. Also many SEO experts confirmed that using HTTPS helps to boost a website's ranking.. Is this true or is it just another SEO myth? You'll know the answer after finishing this course!If this is raly true you will know after taking this course!</p>  <p>\tI am going to give a basic knowledge about SSL and will continue with some important technical information. Last but not least I am going to give you a step by step guide on how to move your website from HTTP to HTTPS without loosing any of your rankings. contunie with some technicel stuff that you need to know followed by a step by step guide how to move you side from HTTP to HTTPS without loosing any rankings. \t \tBut watch out! A move to HTTPS does not make sence for all kinds of websites!These questions will be answered in my course:</p>  <ul>\t<li>What is a SSL certificate?</li>\t<li>Why should I switch to SSL?</li>\t<li>Will my rankings increase if I switch to SSL?</li>\t<li>How do I switch from non SSL to SSL without loosing my rankings?</li>\t<li>How do I set up Google Webmaster Tools?</li>\t<li>Which tools are out there that help me to avoid problems when using SSL?</li>\t<li>What does Google say about switching from nonHTTPS to HTTPS</li>\t<li>What does Google say about SSL and SEO?</li>\t<li>Should I switch to SSL with my existing website?</li>\t<li>I am starting a new website - should I use SSL?</li>\t<li>What should I do if my rankings drop after switching to SSL? \t</li>  </ul>  <p>\tAfter completing this course you will easily be able to decide if a move to HTTPS is a good idea or not. If you'd like to switch to HTPPS you'll exactly know what steps have to be taken to switch to HTTPS without loosing any rankings or without having technical troubles!</p>", 
    "end_date": null, 
    "title": "SEO: HTTPS for SEO - Better Rankings using HTTPS!?", 
    "price": "20.00", 
    "instructors": "Harald Tschuggnall", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413228_c851_3.jpg", 
    "course_url": "https://www.udemy.com/https-for-seo-better-rankings-using-https/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-04T15:24:25Z"
}