{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>  \t<strong>Updated for March 2016.   (</strong>Now over 600 students. 5 Star Ratings)</p>\n\n<p>  \t<strong>Drastically reduce your spending on advertising</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  And  <strong>Bring a constant stream of new customers or clients to your business with Local SEO.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong>All with zero ongoing costs</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t  In the past we would probably have opened the Yellow Pages if we wanted to find, say, a new hairdresser, but now, with fast broadband and Smart phones, most people will go straight to Google and search for 'Hairdresser Newark' or 'Hairdresser San Diego'.  </p>\n\n\n\n\n\n\n\n<p>  \t  In other words they search for what they're looking for (Indian restaurant, driving school, plumber, beds etc.) followed by their town or city name.  </p>\n\n\n\n\n\n\n\n<p>  \t  Try this in Google for your business and the town. If your website appears in the top 10 or so results then you will already be getting visitors to your website from Google. But if you don't appear then you are missing out on lots of new potential customers or clients! Take a look at your competitors who are appearing on that page of results … <strong>they are the ones getting free advertising from Google</strong>!  </p>\n\n\n\n\n\n\n\n<p>  \t  Free advertising?  </p>\n\n\n\n\n\n\n\n<p>  \t  Yes, the great thing is, once you get your website to appear on this first page, there are no costs involved and so it is totally free advertising for your business. Many businesses have been able to drastically reduce or even completely stop other forms of paid advertising when they appeared on page one for relevant search terms.  </p>\n\n\n\n\n\n\n\n<p>  \t  How much of a difference would it make to you if you could stop spending on advertising but still have more customers than you are getting current?  </p>\n\n\n\n\n\n\n\n<p>  \t  So how do I get my website on the first page of Google?  </p>\n\n\n\n\n\n\n\n<p>  \t  There are really two options available to you:  </p>\n\n\n\n\n\n\n\n<p>  \t  The first is to pay an SEO expert to do it for you but this can cost hundreds or thousands of $'s or   </p>\n\n\n\n\n\n\n\n<p>  \t  The second option is that I will teach you how to do it yourself and this is where my <strong>Local Business SEO Course</strong> comes in!  </p>\n\n\n\n\n\n\n\n<p>  \t  This Local SEO course lets you watch over my shoulder as I start without a website or even a domain name but then show you simple, step by step, everything I do to get ranked on the first page of Google within 3 weeks.  </p>\n\n\n\n\n\n\n\n<p>  \t  This <strong>Local Business SEO </strong>course is split into small sections so that you can watch one section then complete the necessary actions for your own site before you move on to watch the next section. Over 3 hours of essential information ensures that you know exactly what to do to get your own website listed on page 1.</p>", 
    "end_date": null, 
    "title": "SEO for Small Businesses - Your Website on Google's 1st Page", 
    "price": "20.00", 
    "instructors": "Chris Towland", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21254_6328_7.jpg", 
    "course_url": "https://www.udemy.com/easy-local-seo-your-business-website-to-google-page-1/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-16T15:57:19Z"
}