{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>SEO<strong> Search Engine Optimization </strong>course designed to help web developers create and think more about search ranking during the design process.</p><p>Thinking about SEO is an important aspect when it comes to web development.  Website success depends on traffic, the main source for web traffic is search engines.  Having optimized content and website structure helps create success online.</p><p>On-page onsite SEO that webmasters can utilize for better search ranking and for better user experiences.  Search ranking algorithms are based on ques that mimic user behavior. The more time a user spends on a website means that the more the algorithm will consider the content on the site to be meaningful.  Search engines want their users to be satisfied with the results and have a good experience with the websites that receive their traffic.  The end result is that if you have a well designed, well optimized website that real people enjoy, means that search engines will want to rank you.  Lower bounce rates more time on site are all important measurements that help rank your site in search results.</p><p><strong>By the end of this course you will be able to better utilize SEO technique in your web development process resulting in more successful websites.</strong></p><ul><li><strong>Introduction to SEO - </strong>covering all about the Search Engine Optimization.</li><li><strong>Brainstorming </strong>keywords and creating keyword lists</li><li>Tags HTML structure and website design for<strong> SEO</strong></li><li><strong>TOP SEO Resources</strong> links and tips</li><li><strong>Links</strong> internal and external</li><li>Best tools and tweaks for <strong>better performance</strong></li></ul><p>Everything is included in this course.  Downloadable PDF's that outline and note content covered in the videos.</p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "SEO for Webmasters Thinking SEO", 
    "price": "20.00", 
    "instructors": "Laurence Svekis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721946_4cb9_3.jpg", 
    "course_url": "https://www.udemy.com/seo-for-webmasters-thinking-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T16:46:40Z"
}