{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Du hast immer gedacht es ist schwierig mit einem lokalen Unternehmen auf Platz 1 bei Google zu kommen?<strong> Das stimmt noch nicht für lokale Suchergebnisse! </strong></p>\n\n<p>Denn mit einem Unternehmensstandort ist die Konkurrenz für spezifische Keywords bei Google, die relevant für deinen Standort sind, viel viel kleiner als international. <strong class=\"redactor-inline-converted\">Denn seit einiger Zeit erkennt Google \"lokale Suchanfragen\", filtert diese und zeigt eine Map mit den lokalen Unternehmen. Ganz OBEN!</strong></p>\n\n\n\n\n\n<p>Denk mal an das Keyword \"Deine Dienstleistung + Deine Stadt\". Z. B. \"Buchhaltung Leipzig\". Das ist ein Keyword das eine viel kleinere Konkurrenz hat als einfach nur \"Buchhaltung\". Und das tolle ist: viele Unternehmen und auch viele Agenturen haben das Potenzial von Google \"local search\" noch nicht erkannt! Viele wissen nicht mal, dass die ersten 3 Ergebnisse inzwischen jene sind, die unterhalb einer Map platziert werden (Werbung ausgenommen). Diese nennt man \"<strong class=\"redactor-inline-converted\">lokale Suchergebnisse</strong>\". Und man kann sie nur belegen, wenn man  ein lokales Unternehmen verifiziert hat. D. h. viele lokale Unternehmen verschenken hier ihr Potenzial! - Dies wollen wir in diesem Kurs für Dich und Dein Unternehmen ändern. Wir wollen zusammen das gesamte Potenzial nutzen um auf Platz 1,2 oder 3 in der local Search zu ranken. </p>\n\n\n\n\n\n<p>Am Ende dieses Kurses wirst Du viele Tricks und Geheimnisse über Google My Business und die Google Suche allgemein gelernt haben. Dazu gehören z. B.: </p>\n\n\n\n\n\n<p>- Wissen über den <strong class=\"redactor-inline-converted\">Google Cache</strong></p>\n\n\n\n\n\n<p>- Wissen über die <strong class=\"redactor-inline-converted\">Relevanz</strong> (z. B. Relevante Wörter im Unternehmensnamen für die Dienstleistung oder den Ort)  </p>\n\n\n\n\n\n<p>- Du wirst genau wissen wie man <strong class=\"redactor-inline-converted\">Keywords analysieren </strong>kann und welche Keywords am meisten bei Google eingegeben werden (in Deinem Dienstleistungs- oder Produktbereich)</p>\n\n<p>Mit der Google lokalen Suche habe ich viel positive Erfahrung zusammen mit meinen Kunden gesammelt. Diese waren wirklich überrascht, dass es im Gegensatz zum schwerlich erreichbaren \"Platz 1\" in der normalen Suche vergleichbar schnell geht in der local Search gut zu ranken. Es handelt sich meistens nur um wenige Tage, wenn nicht stunden in der Klickverbesserungen zu erkennen sind. D. h nach nur kurzer Zeit wird das eigene Unternehmen bei Google häufiger gefunden - und wenn man es richtig anstellt (auch in diesem Kurs erklärt) auch häufiger geklickt! </p>\n\n\n\n\n\n<p>ich wünsche dir viel viel Erfolg mit deiner Optimierung,</p>\n\n\n\n\n\n<p>Malte Helmhold</p>", 
    "end_date": null, 
    "title": "SEO, Erfolgreich mit Google My Business (Mein Geschäft)", 
    "price": "30.00", 
    "instructors": "WordPress, SEO & Programimerung Malte Helmhold", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/810658_1417_2.jpg", 
    "course_url": "https://www.udemy.com/google-my-business/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-02T08:46:02Z"
}