{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>UPDATED TECHNIQUES SEO COURSE! </strong></p>\n\n<p><strong>Is your website buried in search results? Are you struggling to know where to begin? Within just a few hours, learn current, powerful and easy to follow steps that will make a difference in your online results.</strong></p>\n\n<p><strong>What am I going to get from this course?</strong></p>\n\n<ul><li>Over 20 lectures/4 hours stocked full of practical lessons and tips</li><li>Discover how to harness the power of SEO to improve your Google ranking</li><li>Learn how to help the search engines find, read and catalogue your website</li></ul>\n\n<p><br></p>\n\n<p>Ranking higher with the search engines will increase your leads and ultimately sales. You can start a path to becoming an industry leader by learning and implementing the steps in this course – steps others are paying thousands for others to do for them. I will walk you through the sites and tools I use that have helped businesses get to the first page of Google.</p>\n\n<p>If you want free traffic coming into your site, then please try this course. I want to help! I will even show you tools you can use to “spy\" on your competition to determine why they are outranking you. </p>\n\n<p><strong>Notes:</strong></p>\n\n<p>The advice provided is current to 2016. This course offers SEO fundamentals – a great STARTING point for results! There is a lot more you can and should do to raise your authority and ranking including advanced SEO techniques, content, video, etc. 30-day money back guarantee!</p>\n\n<p><strong>Disclaimer:</strong></p>\n\n<p>This course does not tell you what the search engines specifically want as the specific formulas used by search engines are secret. The information in the course is based on what the search engines have said or written, principles used by SEO experts in my network and principles I have used to get my clients results.</p>", 
    "end_date": null, 
    "title": "Street Basics Power Guide to SEO ", 
    "price": "20.00", 
    "instructors": "Patricia Martin (Belmonte)", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600810_8787_8.jpg", 
    "course_url": "https://www.udemy.com/street-basics-power-guide-to-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T20:24:08Z"
}