{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Suchmaschinenoptimierung für Fortgeschrittene: SEO gemeinsam praxisnah und Schritt für Schritt umgesetzt</strong></p>\n\n<p>Herzlich Willkommen!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Wir freuen uns, dass Sie sich für den Kurs \"<strong>Suchmaschinenoptimierung für Fortgeschrittene: SEO gemeinsam praxisnah und Schritt für Schritt umgesetzt</strong>\" interessieren. Unser Team von SEOacademy hat geballte 25 Jahre an Erfahrung und Know-how für Sie strukturiert und einfach aufbereitet. Mit über 35.000 Studenten gehören wir weltweit zu den größten Trainings-Anbietern im Bereich der Suchmaschinenoptimierung.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In dem Kurs \"<strong>Suchmaschinenoptimierung (SEO) Website Optimierung von A-Z</strong>\" lernen Sie praxisnah, worauf es in der Suchmaschinenoptimierung ankommt. Wir zeigen Ihnen, welche Aspekte und Faktoren besonders wichtig sind, um mehr Besucher zu erhalten und höhere Umsätze generieren zu können. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Wir behandeln alle wichtigen Rankingfaktoren, angefangen von der richtigen Domainauswahl über die richtige Länderausrichtung bis hin zum richtigen Hosting für Ihre Webseite. Darüberhinaus lernen Sie bei uns alle Tipps und Tricks, wie Sie mit Hilfe technischer und OnPage Optimierungen das Beste für Ihr Webprojekt herausholen können! </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">SEO IST DIE ZUKUNFT!</strong> - Wo suchen Sie, wenn Sie Informationen über ein Thema benötigen? Richtig! Im Internet! Wo sonst? Höchstwahrscheinlich nutzen Sie für Ihre Recherche Google, wie über 90% aller Deutschen und sogar aller Europäer.\n\nWorauf warten Sie also noch?\nFangen Sie an und überholen Sie Ihre Konkurrenz schon in den nächsten Wochen!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Vergessen Sie nicht: Jeder kann SEO lernen!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Am Ende dieses Kurses werden Sie in der Lage sein:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>✔ sicherzustellen, dass Sie die richtige Domain verwenden und dass Ihre Domain auch auf die richtige Zielgruppe ausgerichtet ist.</p>\n\n\n\n\n\n\n\n\n\n<p>✔ zu wissen, ob der Server-Standort und die Art des Hostings heutzutage noch ausschlaggebend sind<br></p>\n\n\n\n\n\n\n\n\n\n<p>✔ zu entscheiden, ob Sie ein SSL-Zertifikat erwerben und installieren sollen<br></p>\n\n\n\n\n\n\n\n\n\n<p>✔ die richtigen SEO-Plugins und Tools auszuwählen<br></p>\n\n\n\n\n\n\n\n\n\n<p>✔ eine SEO-freundliche Seitenstruktur zu planen und umzusetzen<br></p>\n\n\n\n\n\n\n\n<p>✔ interne Verlinkungen optimal zu überwachen und zu steuern<br></p>\n\n\n\n\n\n\n\n<p>✔ abzuschätzen, ob interner oder externer doppelter Inhalt Ihrem Rankings schaden kann<br></p>\n\n\n\n\n\n\n\n<p>✔ optimierte Landinpages zu erstellen<br></p>\n\n\n\n\n\n\n\n<p>✔ zu wissen, welche die wichtigsten technischen SEO-Faktoren sind und wie man diese optimiert<br></p>\n\n\n\n\n\n\n\n<p>✔ zu wissen, welche die wichtigsten OnPage SEO-Faktoren sind und wie man diese optimiert<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>✔.... und vieles mehr!!!\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Wir sehen uns im Kurs!</p>", 
    "end_date": null, 
    "title": "Suchmaschinenoptimierung (SEO) - Website Optimierung von A-Z", 
    "price": 0, 
    "instructors": "SEO Academy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/857396_5c38_3.jpg", 
    "course_url": "https://www.udemy.com/suchmaschinenoptimierung-seo/", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-23T11:05:19Z"
}