{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><em>\"Christine guides you very well thru this course. She breaks it down in sections for you so you never feel lost. The over the shoulder example from beginning to end helped me tremendously as I am mostly a visual person and like to see examples.\" - Luis Palacios</em><br></p><p><em>____________________________________________________________________</em></p><p>If you've been wanting to rank local business websites so you can provide local SEO services to clients, you're in the right place.</p><p>In this course I take you along so you can watch me rank a real live local business website both organically on the first page of Google and in the Google local pack.</p><p>Here you will watch as I make changes to the client's website so you will know not only the exact steps you need to take but why you should take them. We'll start by covering:</p><ul><li>The exact information you should be collecting from local clients</li><li>The exact spreadsheet I use to track my work </li><li>How to maintain current rankings through a redesign process</li><li>How to monitor your site after a re-design</li><li>Checking the site's SEO health to improve rankings</li></ul><p>After getting organized and gaining a better understanding of the website's health we'll begin the SEO process by:</p><ul><li>Researching the best keywords to target</li><li>How to find your top competitors and see what you need to do to outrank them</li><li>How to set-up a demo site during the re-design process</li><li>How to keep Google from indexing your demo site</li><li>Building local pages and where to put keywords for maximum benefit</li></ul><p><em><em>____________________________________________________________________</em><br></em></p><p><em>\"Christine has put this course together logically, in a way that you can understand, and makes you feel like you're doing things the right way. I cannot say enough about the course. This is my 3rd SEO course, it's the first that I will finish.\" - P. Compton</em></p><p><em>____________________________________________________________________</em></p><p>Next we'll get into even more crucial SEO steps. We'll start off with on-page optimization which includes:</p><ul><li>Several step-by-step methods for using images to improve rankings</li><li>Why you should be using schema, what it is and exactly how to implement it</li><li>How to have a fast loading website</li><li>How to inform Google of a newly designed website or new pages</li></ul><p>Finally we'll look at off-site optimization which will take our SEO efforts to the next level. In these sections we'll look at:</p><ul><li>The step-by-step process for ranking websites in the Google local pack </li><li>Why, how and where to build local citations for maximum benefit</li><li>How to increase local business reviews</li><li>The exact companies you can use to outsource local pack rankings</li><li>Where to find the best back link opportunities for local business websites</li></ul><p>There are several resources for you to download and use and lots of bonus tips and tricks you can use as well. </p><p>There has never been a better time to start providing local SEO services to increase your income. If you're new to ranking local business websites, you'll be fully prepared to provide local SEO services by the end of this course.</p><p>Increase your monthly recurring income by providing local SEO services. Enroll now and I'll help you through the process. </p>", 
    "end_date": null, 
    "title": "The Complete SEO Guide to Ranking Local Business Websites", 
    "price": "30.00", 
    "instructors": "Christine Maisel", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632826_9159.jpg", 
    "course_url": "https://www.udemy.com/rank-local-business-websites/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T20:13:47Z"
}