{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p>Learn the practical white-hat SEO strategies to rank your keywords in Google faster. Know each <strong><em>Search Engine Optimization</em></strong> tip &amp; component to bring your website on the <strong>1st Page of Google</strong>. Bring more visitors to your websites/blogs to get more customers. This course is completely for <strong>beginners and intermediate</strong> users.</p><p>I'll show you step by step process to rank up several keywords in Google in less than 30 days, we'll practically work on content and off-page to rank up keywords in Google quickly.</p>  <p><strong>Bonus: \"Google Page One Ranking Formula\" Premium E-Book has been added to the course.</strong></p><p><strong>Updates: This course was last updated on 15 October, 2015.</strong></p>  <p>  \t          ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>  <p>  \t                  This is a complete Search Engine Optimization course, by saying this I mean, you'll learn every single SEO component in this course. This course will give you a clear step by step understanding of SEO, and after completing this course, you'll be able to optimize your own websites as well as websites for clients.</p>  <p><strong><em>The Main SEO Topics We'll Cover in This Course are Following:</em></strong></p>  <ul>  \t<li>Complete Keyword Research </li><li>Complete On-Page SEO </li><li>Complete Off-Page SEO</li><li>Complete Guide to Link Building</li><li>Complete List of SEO Tools </li><li>Complete Google Webmaster Tools &amp; Bing Webmaster Tools </li><li>Complete Google Analytic Tools </li><li>Complete Guide to Google Algorithms i.e Panda &amp; Penguin </li><li>Complete Guide to Recovery from Google Panda &amp; Penguin </li><li>Complete Guide to Work As SEO Expert</li>  </ul>  <p><strong><em>Course Overview &amp; Content: </em></strong></p><p>This course is super great for those who know nothing about SEO, but this will also help those who have a basic understanding of SEO, this course can further help the marketers who want to find new real SEO techniques. The course is structured very well from beginning till the end. We've started SEO before creating a website, and then step by step, we've optimized the content on the website, then after publishing, we've used social media to increase visibility, and finally we did some link building for ranking up our website &amp; keywords in Google in less than 30 days. Over 15 hours content and 110+ video lectures, we've covered all the basic and advance aspects of search engine optimization and particularly the standards for SEO defined by Google. And yes, I'll be updating this course on regularly basis with new content according to the latest changes in Google's algorithms.</p>  <p>  \t<strong>Bonus Material with the course:</strong></p>  <ul>  \t<li>Free SEO Resources with Each Lecture </li>  \t<li>Free SEO PDF e-Books </li>  \t<li>Regular Updates to the Course </li>  \t<li>List of Tools, List of Directories, List of Backlinks</li>  </ul>", 
    "end_date": null, 
    "title": "The Complete SEO Course - Rank Your Website in Google Easily", 
    "price": "20.00", 
    "instructors": "Abdul Wali", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312496_32df_4.jpg", 
    "course_url": "https://www.udemy.com/complete-seo-training-drive-traffic/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T22:45:31Z"
}