{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p><strong>Thor Alexander: Vom perfekten Domännamen zur erfolgreichen Domänstrategie</strong></p><p>Alles über Domännamen - Welche Kriterien sollen Domänen erfüllen? - Wie können Domänen vor Mitbewerbern schützen?<br></p><p><strong>Die richtigen Domains sind die Basis für mehr Erfolg im Netz</strong></p><p>Dieser Kurs ist ein Muss für Alle, die den perfekten Domännamen suchen oder mit Domains Geld verdienen wollen.</p><p><strong>Doch was macht einen guten Domännamen (engl. Domain-Name) aus?</strong> </p><p>Im Domains-Kurs erfahren Sie alles über den perfekten Domain-Namen, über die Arten von Domains, über TLD und neue generische Domänen.</p><p>Sie erhalten viele Vorschläge, um künftig für Ihren Netzauftritt den am besten passenden Domain-Namen zu finden, egal ob für Website, Homepage, Blog oder Webshop.</p><p>Zudem wird erklärt, wo Sie Ihre neue Domains registrieren können. Sie lernen, was eine gute Domänstrategie ausmacht und wie Sie von Mitbewerbern einfach profitieren können.</p><p><strong>Und wenn Sie mit Domains Geld verdienen möchten</strong></p><p>.. auch kein Problem! Eine spezielle Lektion beschäftigt sich mit dem Kaufen/Verkaufen von Domains sowie Domänhandelsplätzen. Sie erfahren, was die teuerste jemals verkaufte Domäne ist sowie aktuelle Spitzenpreise bei Domains.</p><p><strong>Als Ergänzung zum Webshop-Kurs empfehle ich folgende Online-Kurse:</strong></p><ul><li>Online verkaufen und 5.000 € monatlich verdienen</li><li>Rechtskonformes Impressum selbst erstellen</li><li>5 x Webanalyse per Google - kostenlose Webstatistiken</li></ul><p><strong>Vorbeischauen im Domains-Kurs lohnt sich. Besuchen Sie jetzt diesen Online-Kurs.</strong></p><p>Allerdings verwende ich im Kurs nur das deutsche Wort für Domains - nämlich Domäne.</p>", 
    "end_date": null, 
    "title": "Vom perfekten Domännamen zur erfolgreichen Domänstrategie", 
    "price": "25.00", 
    "instructors": "Dipl.-Ing. Thor Alexander", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703586_5e43.jpg", 
    "course_url": "https://www.udemy.com/domaenen/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T07:33:31Z"
}