{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">If you&#039;ve been wondering about Search Engine Optimization and how to use it to rank your WordPress website higher, make more sales and drive more revenue then this is the course for you.</em>  </p>  <p style=\"\">  \t<em style=\"\"><br style=\"\">  \t<em style=\"\">*************************************************************************</em></em>  </p>  <p style=\"\">  \tDiscover how to optimize your WordPress website for Search Engine ranking “Google” from a 15 year trusted and respected SEO professional so that you can increase traffic to your website and increase sales. I will walk you, hand in hand through the fundamentals of what you need to improve your websites rankings so that you can make more sales, drive more traffic and help build your audience.  </p>  <p style=\"\">  \tI will show you how I make my WordPress websites SEO friendly and show you the best FREE plugins that you can use to send your website up the Search Engine Rankings.  </p>  <p style=\"\">  \tIf you’re a WordPress website owner looking to improve your SEO through this highly recommended course I will show you exactly what an expensive agency would do for you, and how to do it yourself at a fraction of the expense of an agency.  </p>  <p style=\"\">  \t<em style=\"\">Enrol in this course today and have the confidence of Udemy’s 30 day money back guarantee.</em>  </p>", 
    "end_date": null, 
    "title": "WordPress SEO - Rank your pages higher with SEO skills.", 
    "price": "20.00", 
    "instructors": "Dave Sheppard", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367314_5476_2.jpg", 
    "course_url": "https://www.udemy.com/friendly-wordpress-seo/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T13:24:44Z"
}