{
    "selfpaced": true, 
    "topic_name": [
        "Marketing"
    ], 
    "description": "<p style=\"\">تهيئة المواقع لمحركات البحث SEO : Search Engine Optimization</p><p style=\"\">هو واحد من أهم مجالات التسويق الإلكتروني على الإطلاق في العصر الحديث، ويوصف بأنه العمل الأكثر رقيا والأعلى دخلا في العالم، ويمكنك أن تقوم بهذا العمل بمفردك كما يمكنك أن تقوم به ضمن فريق عمل</p><p style=\"\">إن احترافك لمجال تهيئة المواقع لمحركات البحث يساعدك على تسويق وإشهار موقعك الشخصي أو موقعك التجاري أو شركتك أو العمل كمتخصص تسويق عبر محركات البحث وتقديم هذه الخدمة إلى العملاء الذين يطلبونها بكثرة على الانترنت الآن والحصول على دخل مجزي شهريا</p><p style=\"\">ولأن تهيئة المواقع لمحركات البحث مجال قوي ومتشعب فيجب عليك أن تدرس هذا المجال على عدة مراحل وليس في مرحلة واحدة، بدءا من المرحلة التمهيدية ومرورا بالمرحلة التطبيقية وانتهاء بالمرحلة الاحترافية التخصصية</p><p style=\"\">في هذا الكورس &quot;أساسيات تهيئة المواقع لمحركات البحث&quot; أقدم لك كل ما تحتاجه لكى تمتلك المقومات التمهيدية لارتياد هذا المجال، وثق أن المعلومات المجانية التى ستحصل عليها هنا ستكون بداية لانطلاقة ناجحة في رحلة عملك عبر شبكة الانترنت</p><p style=\"\"><strong style=\"\">كن متميزا وامتلك المهارات الأساسية لتهيئة أى موقع على شبكة الانترنت لمحركات البحث Be a professional Search Engine Optimization Specialist</strong></p><p style=\"\">فى هذا الكورس سوف تتعرف على</p><ul style=\"\"><li style=\"\">فهم طريقة عمل محركات البحث وكيفية تهيئة المواقع بشكل صحيح</li><li style=\"\">كيف تجنب موقعك أو موقع العميل أى عقوبات نتيجة للتهيئة الغير شرعية</li><li style=\"\">كيف تختار الكلمات المفتاحية الصحيحة</li><li style=\"\">كيف تستوعب رغبات الباحث عبر شبكة الانترنت من خلال سلوك المستهلك</li><li style=\"\">كيف تحلل الكلمات المفتاحية بدقة وسرعة</li><li style=\"\">تعرف على كيفية ظهور محتوى الموقع من نصوص ووسائط متعددة بالنسبة لمحركات البحث</li><li style=\"\">التهيئة والكثافة والتوزيع وعلاقتهم الوثيقة بالكلمات المفتاحية</li><li style=\"\">وضع الخطة والاستراتيجية التسويقية لتهيئة الموقع لمحركات البحث</li><li style=\"\">بناء الروابط العكسية من خلال الخطة العامة للتهيئة</li><li style=\"\">طرق استهداف الزوار عبر الروابط العكسية وقياس نجاح الاستراتيجية</li></ul><p style=\"\">فى نهاية هذا الكورس سوف تكون واحدا من المتميزين الذين يمتلكون الأساس العلمي الحديث للعمل في مجال تهيئة المواقع لمحركات البحث مما يؤهلك للانتقال إلى المرحلة التطبيقية في عملك كمتخصص في هذا المجال</p><p style=\"\"><span style=\"\"></span>ينقسم الكورس إلى أربعة أقسام بحيث لا يزيد عدد المحاضرات في كل قسم عن 5 محاضرات فقط وتتناول كل محاضرة موضوع واحد ومحدد مما يساعدك على سهولة استرجاع المعلومة ومراجعتها في أي وقت مجانا</p><p style=\"\">كما يشتمل الكورس على كافة المصطلحات الانجليزية التى تحتاجها لفهم هذا المجال مع شرح مبسط لمعنى كل مصطلح مما يساهم في قدرتك على متابعة كافة التطورات في مجال تهيئة المواقع لمحركات البحث من خلال المصادر المتخصصة إذا رغبت في ذلك</p>", 
    "end_date": null, 
    "title": "أساسيات تهيئة المواقع لمحركات البحث SEO", 
    "price": "20.00", 
    "instructors": "Mohammed Fakhry", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564974_cba2_3.jpg", 
    "course_url": "https://www.udemy.com/seo-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Search Engine Optimization"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T08:45:10Z"
}