{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t  Animal Hospice Foundations is the course for you if you find yourself crossing the threshold of another family&#039;s home in service or support of animal hospice. This program specifically addresses all of the non-medical peripheral, yet crucial information when supporting a family through animal hospice.  </p>  <p style=\"\">  \t<strong style=\"\">Understand The Hidden Components of Animal Hospice Care</strong>  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\"></strong>Identify the unspoken concerns of the family</li>  \t<li style=\"\">Understand spiritual, cultural, and family dynamics</li>  \t<li style=\"\">Build your own hospice team</li>  \t<li style=\"\">Nurture clear, compassionate communication</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Confidently and Completely Support Families in Animal Hospice</strong>  </p>  <p style=\"\">This course is foundational to every member of the hospice team. We address and identify various components of animal hospice not obvious to any one practitioner on the team.</p><p style=\"\">The intention of this foundational course is to give you the complete view and understanding to the unseen dynamics in order to complement your particular strength and function within the hospice care team.</p><p style=\"\">To get you into the material more quickly, I designed this course with overview style lectures; with an emphasis on the supplemental materials. In order to get the most from this course I recommended you schedule time to review the supplemental materials as well as explore and research the additional resources offered and map out a plan for implementation.</p><p style=\"\">Care went into creating the materials in a way that would be accessible regardless of your skill set or experience in animal hospice care. I encourage you to take advantage of the weekly office hours available.</p><p style=\"\">The best thing is there&#039;s no risk. Here&#039;s a quote from the Udemy refund page (July 31, 2015) </p><p style=\"\">“Sometimes a course doesn&#039;t work out, and that&#039;s OK! Udemy has a 30 day money back guarantee for all courses purchased on the site.&quot;</p><p style=\"\">Enroll today to learn the hidden elements to successfully supporting animal hospice.</p><p style=\"\">Course updated: 7/31/2015</p>", 
    "end_date": null, 
    "title": "Animal Hospice Foundations", 
    "price": "20.00", 
    "instructors": "Robyn Kesnow", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343742_5208_4.jpg", 
    "course_url": "https://www.udemy.com/animal-hospice-foundations/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T22:56:06Z"
}