{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This online seminar consists of six hours of video lecture by renowned animal behaviorist and dog trainer, Dr. Ian Dunbar. It has been approved for 6 continued education credits by the IAABC &amp; NADOI (CCPDT credits have been applied for).</p><p>This course contains a collection of concepts that range from common sense to cutting edge. The one thing they have in common is that they are all crucial for developing a solid understanding of dog training and behavior. This course is perfect for anyone that wants to understand how to raise a well-trained companion dog, or anyone that is interested in learning more about how to better train their current dog.</p><p>Much of the seminar deals with motivating your dog by making training into an enjoyable activity that functions as it's own reward, thereby eliminating the continued reliance on training tools and food lures. </p><p>Of course, dogs don't always do what we want, so much of this seminar also focuses on how to correct misbehavior. By redirecting our dogs to appropriate behaviors we not only stop them from misbehaving, we also ensure that they are doing the right thing, all without pain or fear.</p><p>Almost every dog will, at some point, develop a phobia or reactivity problem so it's also crucial that dog owners and trainers understand how to quickly and easily address these issues. Differential Classical Conditioning, the Jolly Routine and the use of Secondary Reinforcers can quickly resolve these problems.</p><p>Finally, Dr. Dunbar will explain an idea that should be common sense, but is becoming increasingly cutting edge in today's world of overly clinical and mechanical dog training. He will show you how to turn your voice into the most powerful tool in dog training.</p>", 
    "end_date": null, 
    "title": "Crucial Concepts in Dog Behavior & Training", 
    "price": "30.00", 
    "instructors": "Dr. Ian Dunbar", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614070_26bd_2.jpg", 
    "course_url": "https://www.udemy.com/crucial-concepts-in-dog-behavior-training/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T18:48:46Z"
}