{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">** Over 600 students have already enrolled  in this 'Dog Training - BARF - Feed Your Dog a Raw Diet' course <strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">and have left numerous full 5 Star ecstatic reviews.**</strong></strong></strong></em></strong></em></p>\n\n<p><strong class=\"redactor-inline-converted\">Maggie Styles gave the course a 5 star review and wrote...</strong></p>\n\n<p><em class=\"redactor-inline-converted\"></em></p>\n\n<p><em class=\"redactor-inline-converted\">\"I've worried for some time about feeding my dog conventional dog food and the potential harmful effects of doing so after reading so many alarming reports. I'd heard about raw feeding and how beneficial this feeding method is and wanted to swap to this way of feeding but didn't know where to start or what to do. </em></p>\n\n<p><em class=\"redactor-inline-converted\">Sharon is an excellent teacher, the videos are high quality and her explanations are clear, precise and do-able. This is an A-Z guide to raw feeding where Sharon explains 3 different ways to feed your dog a natural diet, how much to feed them and where to get the food from - she covers everything, nothing is left out! </em></p>\n\n<p><em class=\"redactor-inline-converted\">I love that raw feeding  is cheaper than conventional dog food and has no additives or low quality ingredients and I can't wait to get started! Thank you Sharon for another AMAZING course\"</em></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Leka Loko gave the course a 5 star review and wrote...</strong></em><br></em></p>\n\n<p><em class=\"redactor-inline-converted\">\"If you want to feed your dog a diet that is designed to give them optimum health, body weight and longevity, here you will find all you are looking for.\"</em></p>\n\n<p><strong>Sandor Kiss gave the course a 5 star review and wrote...</strong></p>\n\n<p><em>\"I attempted to feed my dog a raw diet a while ago but didn't feel confident in my ability to do it properly so stopped. When I saw this course I jumped on it straight away because I know that raw feeding is the best feeding method for dogs and I really want to support my best friend in any way I can. </em></p>\n\n<p><em>This course is a goldmine of information and Sharon breaks it done in a way that is easy to understand and implement. She explains 3 different raw feeding methods step-by-step and I am surprised how easy it is to do now I know how to do it, where to get the food from and how much to feed. It's great seeing my dog eating like a dog and not only is his coat shining, his eyes are bright and he's no longer hungry all the time. Fantastic course - highly recommended.\"</em></p>\n\n<p><em class=\"redactor-inline-converted\"><strong>LATEST:</strong> This course is fully up to date for April 2016.</em></p>\n\n\n\n<p><strong>This course is taught by Sharon Bolt who has been featured in over 40 different local and national newspapers, magazines, television and radio stations. She was featured in the BBC Documentary “Britain’s Most Embarrassing Pets.” and has a monthly slot on BBC Radio, which she's had since 2008, where she answers the listeners’ doggie dilemmas. </strong></p>\n\n\n\n<p><strong>Sharon answers student questions in all her Udemy courses daily.</strong></p>\n\n\n\n<p>This dog training - feed your dog a raw diet course is for people who want to feed their dog a diet that is designed to give them optimum health, body weight and longevity and for people who would like to reduce their dog food bills and save a fortune at the vets.</p>\n\n<p>Some dog food ingredients can cause health problems and behavioural issues in dogs such as hyperactivity and aggression. When dogs are fed the right diet dog training either becomes much easier or often the unwanted behaviours simply disappear. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n\n\n<p>In this dog training - feed your dog a raw diet course you'll get the information you need in order to feed your dog a diet that has no preservatives, colourants, additives or low quality ingredients. You'll learn a feeding method which is natural, is easy for dogs to digest and gives them vibrant health, regardless of their age, current health or weight. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You are what you eat and your dog is what you feed them.</strong></p>\n\n\n\n<p>Long before the dog food industry took a firm hold on us, dogs were lean, fit and didn't suffer from the numerous illnesses we see today. Back then there were no cans or packets of dog food to open, dogs were fed like dogs and were healthy, well balanced and well behaved. People didn't need the dog training methods back then that are essential today.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">It's time to take back control and feed your dog the way nature intended.</strong></p>\n\n\n\n<p>This is a natural way of feeding puppies and dogs of all ages, it gives them:</p>\n\n\n\n<ul> <li>Clean teeth</li> <li>Fresh breath (not doggie breath!)</li> <li>Bright eyes</li> <li>A shiny coat</li> <li>A strong immune system</li> <li>Healthy joints</li> <li>A good temperament</li> <li>Optimum health and longevity</li> </ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">And stops:</strong></p>\n\n\n\n<ul> <li>Foul smelling stools and wind</li> <li>Them 'dragging' their bottom across the carpet</li> <li>Big vet's bills</li> <li>Reoccurring illnesses</li><li>Unwanted dog behaviours caused by food allergies and deficiencies.</li> <li>And much more...</li> </ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What You Will Get From This Dog Training - Feed Your Dog A Raw Diet Course</strong></p>\n\n\n\n<p>You'll discover 3 different ways you can choose to feed your dog a raw diet, what they are and why they are so effective.</p>\n\n\n\n<p>You'll also learn step-by-step HOW to feed a raw diet and WHERE to buy the food to do so.</p>\n\n\n\n<p>You'll discover that this is not only a much more healthy way of feeding your dog it is much cheaper than feeding regular dog food too.</p>\n\n\n\n<p>You'll also find out why many of the conventional diets cause so many health problems in dogs today – I think this may well shock you!</p>\n\n\n\n<p>During this dog training - feed your dog a raw diet course you'll get the answers to common myths about raw feeding – these myths can stop people feeding their dog a raw diet which in turn fills veterinary surgeries with poorly dogs. It also creates the need for additional dog training in order to resolve the unwanted behviours caused by feeding dogs conventional dog food.</p>\n\n\n\n<p>You'll also get the exact diet Sharon feeds her 2 dogs which stopped them scooting their bottoms across the floor within days and has kept them away from veterinary clinics for the last 11 years.</p>\n\n\n\n<p>Plus you'll get a checklist of what you need to get started straight away (It's MUCH easier than you might think.) No need to waste another minute where your dog's health is concerned.</p>\n\n\n\n<p>By the end of this dog training - feed your dog a raw diet course you'll know how to switch to feeding your dog to raw diet, what to feed them, how much to feed them and where to get your supplies. You'll know exactly how to take control of what is fed to your dog which comes without nasty side-effects, promotes optimum health and will save you a fortune at the vets.</p>\n\n\n\n<p>Imagine your dog with a shiny coat, optimum body weight and vibrant health, that's what you can look forward to after completing this course. It's never too early or too late to feed dogs raw food.</p>\n\n\n\n<p>Is this really possible? Absolutely! Click on the green 'Take This Course' button at the top of the page to enroll in this easy, fun and informative raw feeding course which comes with a 30 day money back guarantee - both you and your dog will be pleased that you did!</p>", 
    "end_date": null, 
    "title": "Dog Training - BARF - Feed Your Dog A Raw Diet", 
    "price": "20.00", 
    "instructors": "Sharon Bolt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/468858_a9fd_3.jpg", 
    "course_url": "https://www.udemy.com/barf-raw-food-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-06T11:36:14Z"
}