{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><em>\"This course is the real deal, put together with world experts in CPR and dog safety — for $60 it's a majorly good investment. I love Melanie Monteiro's work! \" — Jessica Vogelsang, DVM</em></p><p><em>\"Professional and concise. I recommend this course to any and all dog owners.\" — Susan Bertram, DVM</em></p><p>This unique course is modeled on <em>The Safe Dog Handbook</em><em> </em>to arm you with the skills, resources and knowledge to protect your pups in the real world; react confidently and intelligently in a life-threatening emergency; and boost your profile credentials to help you stand out in the highly competitive online marketplace of pet care providers.</p><p>My approach to dog safety has been praised by top veterinarians, VPI Pet Insurance, national humane organizations and countless dog parents. You'll learn the same skills I cover in my hands-on workshops and more - because here on Udemy, I'm also able to incorporate  amazing teaching tools such as video clips of real emergencies, guest experts and a bonus e-book download. Plus plenty of adorable dog action! </p><p><strong>You'll learn:</strong></p> <ul> <li><strong>How to perform pet CPR, plus life-saving first aid skills for  choking, heatstroke, bleeding, car accidents, accidental poisonings and more</strong></li> <li><strong>How to read a dog's vital signs</strong></li> <li><strong>How to handle encounters with aggressive dogs while out walking</strong></li> <li><strong>How to spot a bloating dog</strong></li> <li><strong>Which car restraints provide the best protection </strong></li> <li><strong>What apps and numbers to have on your smartphone</strong></li> <li><strong>How to create a dog-safe home and outdoor environment</strong></li><li><strong>How to prevent accidents and prepare for a successful outcome BEFORE an emergency happens</strong></li> <li><strong>Extra precautions for puppies</strong></li> </ul> <p><br></p><p>The course is broken up into concise, single-topic lessons, so you can go at your own pace. The format includes video demonstrations with my beautiful senior Labrador Taiga, lectures, visual aids, and printable handouts and instructions. When appropriate,  I provide deeper explantations about various emergencies so you'll not only learn how to spot the signs and what actions to take, but also WHY you're doing it — to help you better retain the knowledge and skills to react in a stressful situation. I worked closely with leading vets throughout the development of this course to ensure that each lesson, demonstration and handout is accurate, up-to-date and veterinarian-approved.</p><p><strong>Happy endings! Testimonials for Melanie's training videos and hands-on workshops:</strong></p><p><em>\"I used CPR to save Woody's life yesterday! It was a freak accident - I came home to find Mia's jaw caught around Woody's collar. Mia was frantic, flopping Woody around like a rag doll trying to break free. Her mouth was bloody and she couldn't let go. By the time I was able to remove the collar, Woody was lifeless. His eyes were milky and his gums were blue. Needless to say I was in a complete panic, but I remembered our CPR class and was able to calm down to give him rescue breathing and CPR, and he regained consciousness - I couldn't believe it! I rushed him to the vet, and he will be ok. I already ordered safety collars but until they get here, the dogs will stay in and the collars will stay off. Thank you!\" — Monika H., Los Angeles, CA</em></p><p><em><em>\"Last night my dog began choking on a cherry tomato. While my wife tried in vain to dislodge the tomato, I remembered your video about back blows and the Heimlich maneuver. We did exactly what you said. The Heimlich worked, and the tomato popped out. It was a long, terrifying couple of minutes. You saved our precious boy's life! Thank you! We are forever in your debt.\"</em><em>— Dale W. Portland, OR</em></em></p><p><em>\"Your CPR video saved my sweet dog Casey's life and I could never ever thank you enough. In three weeks, our story is going to be in our local newspaper and they will be printing the link to your video. I will send you the link to read the story online as soon as it's up! Thank you again, your video is amazing and every single dog owner should know how to perform CPR in case of an emergency. THANK YOU!!!!!\" —  Stefanie A., Joliet, Il</em><em></em></p><p>....................................................................................................................................................</p><p>*This course is not intended to replace veterinary advice. Always seek prompt veterinary care in an emergency. While every caution was taken to provide safe recommendations based on the standard accepted methods of pet first aid, it is impossible to predict the outcome of their use. Melanie Monteiro assumes no liability for any harm arising from the use of these techniques, and students should exercise personal judgement when applying them. Woof!</p>", 
    "end_date": null, 
    "title": "Dog CPR, First Aid + Safety for pet pros + dedicated owners", 
    "price": "40.00", 
    "instructors": "Melanie Monteiro", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320482_89ab_6.jpg", 
    "course_url": "https://www.udemy.com/dog-cpr-first-aid-safety-for-pet-pros-dedicated-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T22:00:26Z"
}