{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>** Over 900 people have already enrolled in this 'Natural Remedies For Health and Dog Training' course <em><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">and have left numerous full 5 Star ecstatic reviews.**</strong></strong></em></em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"></strong></p>\n\n<p><strong>Amy Bentley gave the course a 5 star review and wrote..</strong>.</p>\n\n<p>\"Wow! This is a fantastic course - it's obvious that Sharon knows her stuff and has a great way of explaining what to do in a way that makes sense and is 'doable'. I love the idea of treating my dog naturally and this course has given me the knowledge to feel confident to do that. A 'must have' course for every dog owner - highly recommended!\"</p>\n\n<p><strong class=\"redactor-inline-converted\">James Budd gave the course a 5 star review and wrote...</strong><br></p>\n\n<p>\"This is a brilliant course on how to treat your dog's ailments using natural remedies. Sharon is an enthusiastic and passionate instructor who really knows her stuff. It is an A-Z guide of what herbs, homeopathic remedies etc. heal common complaints in dogs and I love the <br>way Sharon shows step-by-step exactly what they are, how to use them and where to get them from - nothing is left out. I've already created my natural first aid kit following Sharon's suggestions and it feels good that I can treat my dog naturally, without side effects and save a fortune at the vets at the same time. I highly recommend this course.\"</p>\n\n<p><strong>Scott Paton gave the course a 5 star review and wrote...</strong></p>\n\n\n\n\n\n<p>\"I am so happy I took this course! I got so much out of how I can use herbs and aromatherapy to keep my dog healthy. Sharon is so good at sharing what works and what doesn't. She is so engaging and has put together a high quality class which all dog lovers need to take if they care about their pets.\"</p>\n\n<p><em><strong>LATEST:</strong> This course is fully up to date for April 2016.</em></p>\n\n\n\n<p><strong>This course is taught by Sharon Bolt who has been featured in over 40 different local and national newspapers, magazines, television and radio stations. She was featured in the BBC Documentary “Britain’s Most Embarrassing Pets.” and has a monthly slot on BBC Radio, which she's had since 2008, where she answers the listeners’ doggie dilemmas. </strong></p>\n\n\n\n<p><strong>Sharon answers student questions in all her Udemy courses daily.</strong></p>\n\n\n\n<p>This natural remedies for health and dog training course is for people who would like to know how to successfully treat and heal their dogs with natural remedies rather than using antibiotics and medication which often comes with a whole host of nasty side effects. It's also for people who would like to spend a lot less time at the vets and save a fortune on veterinary bills, as well as being for dog owners who'd like to use natural remedies as part as their dog training program.  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Course Description</strong></p>\n\n\n\n<p>In this natural remedies for health and dog training course you'll get the information you need in order to naturally treat common complaints in dogs such as diarrhea, skin conditions, ear infections and joint problems. You'll discover which herbs, homeopathic remedies, aromatherapy oils and Bach Flowers have miraculous healing effects with so many different disorders. </p>\n\n<p>You'll also learn what natural remedies are great to use for dog training and how they can help in resolving unwanted behaviours such as:</p>\n\n<ul><li>Aggression</li><li>Separation Anxiety</li><li>Incessant Barking</li><li>Pulling on the lead</li><li>And much more...</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">How to have a fit, healthy, vibrant and well behaved dog using natural remedies.</strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\"></strong><strong class=\"redactor-inline-converted\">During this natural remedies for health and dog training course you'll learn:</strong></p>\n\n\n\n<ul><li>What natural remedies can be beneficial for improving both your dog's health and changing unwanted behaviours. Try this simple strategy and you'll be surprised how fast your dog heals and ailments disappear, even those stubborn ones that have been hanging around for some time. Dog training becomes much easier when you have a calm and healthy dog. </li></ul>\n\n\n\n<ul><li>The number one remedy you must have that works like magic for so many health conditions in both dogs and humans.</li></ul>\n\n\n\n<ul><li>Which herbs work wonders with specific health complaints and behaviours in dogs plus where you can get them for a very good price. When a dog is healthy and feeling good dog training methods are so much more effective. </li></ul>\n\n\n\n<ul><li>What Homeopathic Remedies are good when dealing with particular ailments and behaviours in dogs. You'll be surprised just how simple it can be.</li></ul>\n\n\n\n<ul><li>How Aromatherapy and Bach Flowers can make such a difference to the healing and balancing of your dog – let nature do what it knows how to do without you having to do all the work.</li></ul>\n\n\n\n<ul><li>The exact natural product Sharon used that stopped one of her dogs from having an operation when his knee cap 'popped out' when he was playing with the 'big boys' down the park. Even though 2 vets told her the only answer was to operate this product saved the day and everything healed beautifully.</li></ul>\n\n\n\n<ul><li>How to create a natural first aid kit especially for your individual dog or dogs. This simple, yet highly effective kit could well be a life saver when any 'symptoms' arise or an emergency occurs.</li></ul>\n\n\n\n<p>By the end of this natural remedies for health and dog training course you'll know how to heal your dog using natural remedies, what remedies to use and where to get them from. You'll have the knowledge and confidence to help your dog in a way that promotes optimum health as well as saving you a fortune at the vets. You'll also know how to use natural remedies as part of your dog training program.</p>\n\n\n\n<p>If your dog has reoccurring illnesses, or you are concerned about their health, vitality and unwanted dog behaviours then this natural remedies for health and dog training course is for you!</p>\n\n\n\n<p>Imagine your dog with a shiny coat, bright shiny eyes and vibrant health, that's what you can look forward to after completing this natural remedies for health and dog training course. It's never too early or too late to use natural remedies for your dog.</p>\n\n\n\n<p>Is this really possible? Absolutely! Click on the green 'Take This Course' button at the top of the page to enroll in this easy, fun and informative natural healing and dog training course which comes with a 30 day money back guarantee - both you and your dog will be pleased that you did!</p>", 
    "end_date": null, 
    "title": "Dog Training - Natural Remedies for Health & Dog Training", 
    "price": "20.00", 
    "instructors": "Sharon Bolt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469698_9493_3.jpg", 
    "course_url": "https://www.udemy.com/dog-illnesses-and-home-remedies-for-dogs/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T08:03:40Z"
}