{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">** Over 1400 students have already enrolled in this 'Dog Training - Leash Training Your Dog' course </em></strong><strong class=\"redactor-inline-converted\">and have left numerous full 5 Star ecstatic reviews.**</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Jo Hunter gave the course a 5 star review and wrote...</strong></p>\n\n\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"></em></em></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"It's magic, within a short time and i mean minutes our bolshy (but totally lovable) cheeky 7 month old staffy bitch was walking to heel like a professional, honestly you would think she had been doing it for years. she walked, turned and even sat when we stopped and looked up as if to say ' ready when you are boss'. Looking forward to the next course.\"</em></em></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">David Dingman gave the course a 5 star review and wrote...</strong><br></em></em></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"The lease training was an incredibly simple solution and I was doing it all wrong. Ignorance is NOT bliss, and does not help the puppy or dog to understand what I what them to do. Now that I am doing it correctly, the issues I created are gone and we are communicating much more effectively and have better walks. Thank you.\"</em></em></p>\n\n<p><strong>Eddison Paguia</strong><strong class=\"redactor-inline-converted\"> gave the course a 5 star review and wrote...</strong></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"></em></em></p>\n\n<p><em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">\"Just finished the course, and applied just a few during our afternoon walk and it worked marvelously. Maybe old dogs can learn new tricks after all :)\"<em class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\"></em></em></em></em></p>\n\n<p><em><strong>LATEST:</strong> This course is fully up to date for April 2016.</em></p>\n\n\n\n<p><strong>This course is taught by Sharon Bolt who has been featured in over 40 different local and national newspapers, magazines, television and radio stations. She was featured in the BBC Documentary “Britain’s Most Embarrassing Pets.” and has a monthly slot on BBC Radio, which she's had since 2008, where she answers the listeners’ doggie dilemmas. </strong></p>\n\n\n\n<p><strong>Sharon answers student questions in all her Udemy courses daily.</strong></p>\n\n\n\n<p><em><em><em><strong>Please Note:</strong> All students who enroll in Sharon's \"Dog Training - Become A Dog Trainer - Dog Training Career\"</em><em> course here on Udemy get full access to this dog training course for free!</em></em></em></p>\n\n<p><em class=\"redactor-inline-converted\"></em></p>\n\n\n\n<p>Learning the right dog training methods is vital when you want to get your dog to walk calmly by your side and for getting them to come back when called off leash.  The good news is that dog training is not difficult to do when you understand your dog's language and tick their boxes in a kind and gentle way. During this dog training course you'll learn exactly how to do this. You'll also learn how to be your dog's pack leader in this area plus get the knowledge, tools and easy methods you need in order to have a happy, well behaved and well balanced dog.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn the Simple, Clear, Concise Communication And Dog Training Methods Which Dogs Love that Stops:</strong></p>\n\n\n\n<ul><li>Pulling on the leash</li> <li>Mouthing the leash</li> <li>Zig –zagging on the leash</li> <li>Dogs coming back when they want – they come back when you call them instead.</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You Can Teach Old Dogs New tricks And Young Ones Too With These Dog Training Techniques.</strong></p>\n\n\n\n<p>Dogs live in the present moment which means when given the right dog training information their behaviour changes fast, even if they've been behaving a certain way for a long time. </p>\n\n\n\n<p>Once you've learned what dogs are looking for and what dog training methods work you'll know what to do for life. Dogs speak the same language regardless of age or breed. The dog training methods you'll learn will work with your dog, your friend's and family's dogs and any other future dogs you may get.</p>\n\n\n\n<p>Dogs are not like computers they do not require constant updates or need to have new dog training programs developed, once you know what to do, you've got it! </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">What You'll Get From This Dog Training Course.</strong></strong></p>\n\n\n\n<p>This dog training course is designed for any dog owner, regardless of their experience, who would like to have a more enjoyable walk, have their dog walk nicely by their side and for their dog to come back when called when off leash. </p>\n\n\n\n<p>The course focuses on empowering you, the dog owner. You're given the tools, knowledge and dog training methods in order to have a pleasurable walk. You're shown exactly how to do these processes through step-by-step video demonstrations using the pack leader theory combined with positive reinforcement techniques.</p>\n\n\n\n<p>During this dog training course you'll learn what to do before going out which will make such a difference to the walk, simple methods of what to do when your dog pulls on the leash and even a 'miracle technique' which is rarely spoke about that works like magic in getting your dog to walk calmly by your side.</p>\n\n\n\n<p>You'll also learn dog training techniques that stop dogs from mouthing the leash, how to prevent dogs from zig-zagging in front of you and how to get your dog to come back when called off leash. </p>\n\n\n\n<p>By the end of this dog training course you'll have the dog training knowledge and confidence you need to make a positive difference to your walk. You'll also know how you can become your dogs Pack Leader without shouting, hitting or using force in this area. As well as confirmation of where you are already doing things right and suggestions where some 'fine tuning' may be beneficial.</p>\n\n\n\n<p>Imagine going on a walk where your dog walks happily by your side, responds favourably to your commands, comes back when called and wants to do as you say, that's what you can look forward to after completing this dog training course. </p>\n\n\n\n<p>Is this really possible? Absolutely! Click on the green 'Take This Course' button at the top of the page to enroll in this easy, fun and informative dog training course that comes with a 30 day money back guarantee - your dog will be pleased that you did!</p>", 
    "end_date": null, 
    "title": "Dog Training - Leash Training - Simple Dog Training Methods", 
    "price": "20.00", 
    "instructors": "Sharon Bolt", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430438_4662_3.jpg", 
    "course_url": "https://www.udemy.com/dog-training-how-to-get-your-dog-to-walk-by-your-side-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T23:14:10Z"
}