{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t    INTRODUCTION  </p>  <p style=\"\">  \t    Dogs truly are our best friends. They provide us with hours of companionship, love and fun, and ask for very little in return. Our dogs enjoy nothing better than spending time with the family at work and play, or just hanging out with us.  </p>  <p style=\"\">  \t    Teaching your dog to walk nicely on a lead and be obedient is an important part of dog ownership. However, dogs are capable of learning so much more. Dog tricks are a great way for you and your best friend to have fun together and form a close bond. Dogs love to be the centre of attention and are real show-offs! Performing tricks for family and friends is very rewarding for both the dog and the owner.  </p>  <p style=\"\">  \t    This course will show you how to teach your best friend a number of different tricks in a fun, easy and positive way. It doesn’t matter whether you have a pup or an older dog, any dog can learn new tricks. We begin with some basic obedience positions and simple tricks before following through with some more complex show-stoppers.  </p>  <p style=\"\">  \t    Most dogs need mental as well as physical exercise to keep them happy and healthy. Adding a few tricks to your pet’s daily exercise routine can also help prevent boredom and create a more obedient dog that is less likely to be destructive when the family is out at work or school.  </p>  <p style=\"\">  \t    No matter what sort of dog you have, you and your best friend are sure to find a few favourites in the following pages. Your pet will really look forward to a small amount of time spent training before morning or evening walks and it’s addictive ... once you teach one trick, you’ll want to teach another ... and another!  </p>", 
    "end_date": null, 
    "title": "Dog Tricks & Training - Over 25 Tricks.", 
    "price": "20.00", 
    "instructors": "Hinkler Books", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67982_d20f_6.jpg", 
    "course_url": "https://www.udemy.com/dogtrickstraining/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-22T11:16:28Z"
}