{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Dr. Dunbar taught the world's very first off-leash puppy socialization and training classes and he has been perfecting the SIRIUS Dog Training business model for the past 30 years.  If you are a dog training professional, or you're thinking of becoming one, this is the course you simply must take.</p><p>The SIRIUS Academy is a structured and comprehensive course on how to run a successful dog training business.  This course cuts to the chase and focuses on the essential information that you absolutely need to know in order to effectively teach people to train dogs as quickly, easily and enjoyably as possible.The full Academy consists of all 4 days of lecture, 6+ hours each, as well as substantial notes, including notes for the lectures, a Behavior Problem Solving Matrix, and the complete SIRIUS Syllabi for Puppy 1, Puppy 2, and Adult 1 classes, with week-by-week-schedules and minute-by-minute class notes.  You will also get two free eBooks and 16 Behavior Blueprints which you can customize with your business information and distribute freely to clients and colleagues to aid in training and promotion.</p><p>Day 1: Business, Promotion, People Training &amp; GamesDay 2: Behavior CounselingDay 3: Adult Dog Classes &amp; Home TrainingDay 4: Puppy Classes &amp; Home Training<em>“Whether you're new to dog training and wondering how to get started in the business, or you've been doing it for ages (like me) and you're looking for some fresh ideas to super-charge your business, this is the very best place to get what you need. I found myself taking detailed notes for some long-term changes, and then also jotting down little nuggets of gold to go home and immediately implement into my classes or business practices…This four-day event, and yes, you MUST attend all four days, offers the attendee who already has some hands-on experience with dogs everything they need to start up their own classes. Those of us who've already been running our own classes come away with many new ideas for classroom games and exercises for both puppies and adult dogs, PLUS a comprehensive, tested plan to measure and increase our success, and to market ourselves (which we could all use help with).I am so excited to make some changes! Thanks so much for everything!\"</em>- Michelle Douglas, CPDT-KA, CDBC – Past President of the APDT</p>", 
    "end_date": null, 
    "title": "Dr. Ian Dunbar's SIRIUS® Dog Trainer Academy - All 4 Days", 
    "price": "50.00", 
    "instructors": "Dr. Ian Dunbar", 
    "commitment": "28.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53424_d671_8.jpg", 
    "course_url": "https://www.udemy.com/sirius-dog-trainer-academy-4days/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-11T17:18:16Z"
}