{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t              Everything you need to know to <strong class=\"redactor-inline-converted\">make owning a dog or a puppy a success</strong>. Whether you are thinking about getting a puppy or a rescue dog, you just got one or you have an older dog and would like to train them properly then this course is for you!  </p>\n\n<p>  \t              The course \"From Puppy To Dog Training\" follows the natural process from when you first think about getting a dog <strong class=\"redactor-inline-converted\">all the way to a fully trained well behaved dog</strong>. This course will help you avoid a lot of the common mistakes, help you understand why your dog behaves the way it does and how to achieve the most out of life with your dog.  </p><p><em>PLEASE NOTE:</em> <strong class=\"redactor-inline-converted\">This course does NOT include the Classic Beginner Dog Training classes. </strong>It does however go much deeper than that: it is FOUNDATIONAL, the core training of <strong>everyday life</strong>. Just like with children you can teach them how to take their first steps or tie their shoes, but without proper foundational training your child will still misbehave, not listen and even disrespect you. It's nice to make your dog sit, stay, come, heel etc. But outside of that, how would you get your dog to actually behave? This course goes over that. <br></p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">Here are some of the things you will learn in this course:</strong>  </p>\n\n<ul>  \t<li>5 Crucial things to consider before getting a dog or puppy. </li>  \t<li>How to choose the right dog or puppy for you and your family.</li>  \t<li>What to expect when bringing your puppy home and 3 things you absolutely cannot do in the first few weeks.</li>  \t<li>The one trick that will supercharge the potty training process for your dog.</li>  \t<li>When NOT to get a rescue dog.</li>  \t<li>The 7 Principles to Success in Training Your Dog.</li>  \t<li>How to introduce a puppy to your other pet(s).</li>  \t<li>The one crucial issue that can break the fundamentals.</li>  \t<li>How to train your puppy in an apartment or condo.</li>  \t<li>The best ways to care for your dog.</li></ul>\n\n<p>  \t              By following this video course <strong class=\"redactor-inline-converted\">step-by-step</strong> you will encounter the most effective ways to training your dog through practical application that is based on real life solutions for the every day person.  </p>", 
    "end_date": null, 
    "title": "From Puppy To Dog Training", 
    "price": "50.00", 
    "instructors": "Berry Van Loenen", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367636_60e0.jpg", 
    "course_url": "https://www.udemy.com/from-puppy-to-dog-training/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T21:20:02Z"
}