{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>El curso es una <strong>guía básica</strong> para <strong>aplicar un plan de gestión ética</strong> en colonias de gatos libres <strong>basado en la experiencia de miles de personas</strong>, <strong>colonias</strong> y diferentes <strong>asociaciones </strong><strong>que trabajan la gestión</strong> de animales libres <strong>desde los años 70 </strong>del siglo pasado, y <strong>recopiladas desde 1998</strong> por profesionales que forman parte de GEA.  </p><p>Entre los <strong>materiales de refuerzo</strong> podrás encontrar <strong>manuales</strong> para presentar el proyecto a <strong>Comunidades de personas</strong> (vecinos, escuelas…) a <strong>Administraciones públicas</strong> y para transformar a las <strong>Personas Alimentadoras en Gestoras de Colonias o Agentes Cívicos</strong>, información sobre las <strong>principales enfermedades</strong> que pueden afectar a los animales y posibles <strong>zoonosis y como evitarlas</strong>, <strong>vídeos promocionales</strong> para trabajar conceptos básicos con las comunidades humanas que conviven con los gatos… </p><p>El curso se <strong>estructura</strong> básicamente en <strong>dos partes</strong> en las que se muestra la <strong>formación, protagonistas y gestión correcta</strong> de la colonia y también los <strong>principales errores</strong> que se repetidamente se cometen en la mayor parte de los proyectos y que impiden que estos sean exitosos.<br></p><p>Hemos realizado este curso de forma que sea <strong>divertido, útil y que signifique un bien personal para ti</strong>, para que tengas el máximo de herramientas posibles para ayudar más y mejor a los animales y a la comunidad humana con la que conviven.</p><p>Porque la gestión ética es un beneficio para todos y a través de ella construimos un mundo más ético para todas las comunidades.<br> </p>", 
    "end_date": null, 
    "title": "Gestión ética de colonias de gatos libres", 
    "price": "20.00", 
    "instructors": "GEA, Gestión Ética Animal", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/608046_41a8_3.jpg", 
    "course_url": "https://www.udemy.com/gestion-etica-de-colonias-de-gatos-libres/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T15:11:09Z"
}