{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t  These days many people understand the importance of early puppyhood socialization. They take their puppy to group training classes, they introduce their puppies to lots of friends and neighbors and they may even host a puppy party or two. This is a wonderful development and it has done a lot to improve the temperament of countless dogs.  </p>  <p>  \t  Unfortunately, after this intensive period of early socialization period many owners slack off. They see that their hard work has paid off and that their puppy is friendly and sociable in every situation they find themselves in. What they don&#039;t realize is that dogs naturally become more shy and standoffish as they get older. Adolescent and adult dogs develop fears and phobias to stimuli that they aren&#039;t continually exposed to.  </p>  <p>  \t  Keeping your dog well-socialized to other dogs is not so easy, and often this area of their socialization deteriorates the most rapidly. At some point most dogs will get into at least one fight with another dog. Sadly, this often marks the beginning of the end when it comes to their socialization with other dogs. The owners want to avoid future fights so they avoid future opportunities to socialize. The dogs socialization deteriorates further and the likelihood of them fighting when they see another dog increases.  </p>  <p>  \t  Resolving this problem in the course of everyday life is very difficult. Dr. Dunbar demonstrates how to use a Growl Class to classically condition dogs and rehabilitate and re-socialize them to once again enjoy the company of other dogs.  </p>", 
    "end_date": null, 
    "title": "Growl Class - A Workshop Demo for Reactive Dogs", 
    "price": "50.00", 
    "instructors": "Dr. Ian Dunbar", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/356500_a78e_4.jpg", 
    "course_url": "https://www.udemy.com/dunbar-growl-class/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T21:40:26Z"
}