{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">   Gain An Unfair Advantage And Learn The Easy To Implement Equine Muscle Therapy That Will Almost Overnight Transform Your Tired Aching Horse Into A Performance Athlete.</em></strong>  </p>  <p style=\"\">  \tEQUUS Muscle Management Therapy, ‘EMM Therapy’ is a unique equine therapy that brings fast, effective relief from muscular pain due to stress, strain or overwork.  </p>  <p style=\"\">  \t   Developed by Steve and Kath Rochford, the principles of Equus Muscle Management, who have been treating horses since 2001 and training therapists in their unique modality since 2004 across Australia, England, Germany, Austria and Switzerland.  </p>  <p style=\"\">  \t     The therapy enables your horses&#039; body to unwind, returning the muscles to a relaxed and static state enabling faster recovery from injury, plus, gaining improved flexibility and greater freedom of movement.  </p>  <p style=\"\">  \t<strong style=\"\">What Our Therapy Can Do For You and Your Horse</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Provide immediate relief to your horse from muscular stress and tension.</li>  \t<li style=\"\">Allow you to quickly treat your horse yourself to get them back into competition or to work</li>  \t<li style=\"\">Prevent injury or speed up recovery</li>  \t<li style=\"\">Make your horse easier to work with and be more responsive</li>  \t<li style=\"\">Save money by not paying for ongoing treatments with other therapies as you get faster results with less work using our therapy.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Who is it for?</strong>  </p>  <p style=\"\">  \t     The therapy is ideal for any horse rider or owner looking for the ability to treat their horses muscular ailments and improve their horses performance.  </p>  <p style=\"\">  \t     It is also an ideal introduction for practitioners of other equine therapies looking to get accredited in the EMM Therapy.  </p>  <p style=\"\">  \t<strong style=\"\">What You get?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">All 20 lectures covering both the background information and the videos of the corrections</li>  \t<li style=\"\">8 detailed videos showing you how to apply the corrections to your horse.</li>  \t<li style=\"\">Supporting video transcripts</li>  </ul>", 
    "end_date": null, 
    "title": "Horse Muscle Care - Rochfords' Way", 
    "price": "50.00", 
    "instructors": "Steve and Kath Rochford", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/135964_ea3e_5.jpg", 
    "course_url": "https://www.udemy.com/emm-therapy-horse-muscle-care-rochfords-way/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-20T06:23:47Z"
}