{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>When you <strong>watch the video above</strong>,\nyou can see my qualifications with the Russian Tortoise and parts of\neach section of this course that will result in  you knowing more about\nthese tortoises than 95% of all current owners!</p>\n\n\n\n\n\n<p><strong>What you'll enjoy about this course</strong>\nis how easy it is to follow along with and it contains just the\nimportant information you need to have a healthy, long-lived Russian\ntortoise, not detail designed for advanced tortoise keepers.</p>\n\n\n\n\n\n\n\n\n\n<p>It's a 100% video course with a couple\nof PDF documents at the end for building your own indoor pen just\nlike mine, the core diet items, and links to other valuable websites\nand Russian tortoise resources.</p>\n\n\n\n\n\n\n\n\n\n<p>The course has an hours worth of\nmaterial, which is all you need, to have a strong understanding of\nthe unique needs of this fascinating tortoise.</p>\n\n\n\n\n\n\n\n\n\n<p>The course is structured based on my\nfour levels of tortoise husbandry that starts with understanding\nwhere they come from and how it determines the type of pen they need\nand the diet and food items they need to thrive. \n</p>\n\n\n\n\n\n\n\n\n\n<p>As you watch the 20 video lessons,\nyou'll understand where they come from and why having their pen\nsimulate their native environment is critical to their survival -\nwhat they eat in the wild and how it's simple and inexpensive to\nreplicate - wherever you live.</p>\n\n\n\n\n\n\n\n\n\n<p>And you'll be happy to learn that\n30-40% of your Russian tortoises diet can be found in your backyard\nor vacant lot!</p>\n\n\n\n\n\n\n\n\n\n<p>This course gives those people who own\nor are thinking of buying one these these amazing animals everything\nI've been doing for my Russian group for 16 years (and the\naccumulated wisdom of 45 years with tortoise species like the\nRussian) to ensure your Russian tortoise lives a long, healthy,\nactive life.</p>", 
    "end_date": null, 
    "title": "How To Successfully Choose and Care For a Russian Tortoise", 
    "price": "20.00", 
    "instructors": "Ernie Johnson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/754642_040f.jpg", 
    "course_url": "https://www.udemy.com/russiantortoise/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-06T20:26:25Z"
}