{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p style=\"\">  \t   From delving into your relationship with your special companion and finding the important story you want to tell, to organizing what you need to tell that story and finally to the key things to remember when putting together your final edit, How to Make a Film to Honour Your Pets will help you create a testament to that relationship that is so important.  </p>  <p style=\"\">  \tThe unique part about this course is that it teaches you to create a story with whatever equipment you have access to - even just a cell phone, if that is all you have.  We completed this course with non-industry equipment because we want you to see that creating a story is possible regardless of your equipment.  </p>  <p style=\"\">  \t   The course is broken into several sections which follow regular filmmaking lines: Pre-production, Production and Post Production.  Within each section, you will learn the important parts that change your film from a home movie to a compelling documentary that will be a structure piece from beginning to end.  </p>  <p style=\"\">  \t   For anyone who has experienced the special relationship, joy and comfort that a pet can bring, How to Make a Film to Honour Your Pets will help you to utilize the technology available to most everyone (a cell phone will do, if you have no other choice) and teach you how to present your a film; you will learn how having a good story is more important than any technology when it comes to documentary filmmaking.  </p>  <p style=\"\">  \t   To succeed in this course, you need access to a computer, the ability to read pdf documents, and it would be helpful to have Microsoft Word to utilize the templates, however you can create your own using whatever technology you have access to.  Templates come in both pdf and doc format for you to make that choice.  </p>  <p style=\"\">  \t   As well, you will require editing software.  We give some choices of both free and consumer software to use.  The choice is yours but the film cannot be completed without a non-linear editing program.  </p>  <p style=\"\">  \t   Both Simon and myself, Stephanie, have experienced the loss of one of our special friends and we both have a great deal of passion about bringing you this information to help you capture that special relationship before you no longer can.  </p>", 
    "end_date": null, 
    "title": "How to Make a Film to Honour Your Pets", 
    "price": "20.00", 
    "instructors": "Stephanie Powers, Simon Robinson", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161392_b870_4.jpg", 
    "course_url": "https://www.udemy.com/honour-your-pets/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-10T20:01:25Z"
}