{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Want your puppy to be a model housemate? Enroll in our online Polite Puppy training course and teach your dog proper house manners. By taking our Polite Puppy program you will be preventing and/or solving the following in-home problem behaviours: door dashing, counter-surfing, incessant barking, and other rude or pushy behaviour. With your dog’s refined house manners not only will they be better behaved in your home, they may even be invited to someone else’s.</p>\r\n<p><strong>&nbsp;</strong></p>\r\n<p><strong>Who should take this dog training course?</strong></p>\r\n<p><span>Dogs and owners that are new to positive reinforcement / clicker training. Perfect for your new puppy, or recent adopted rescue.</span></p>\r\n<p><span><strong>What will you learn?</strong></span></p>\r\n<ul>\r\n<li>Clicker training basics – Sit, Down, Hand Target and Name Response</li>\r\n<li>Go to Your Mat/Settle</li>\r\n<li>Stay</li>\r\n<li>Doggie Zen/Leave-It</li>\r\n<li>Boundary Training/Wait patiently by the door</li>\r\n<li>Crate training</li>\r\n<li>Barking: Resolve any issues with barking</li>\r\n</ul>\r\n<p><span><strong>Format of the course:</strong></span><br><span>Your Treatpouch puppy training course is presented through video and online content. You’ll get direct coaching and feedback from us via questions you post in our discussion forum. We are committed to your success! You are not just buying access to view a course, but instead, interact with two professional dog trainers.</span></p><p><span><strong>What's Not Included</strong></span></p><p><span>Please note, that the scope of the course is limited to the syllabus. We will answer questions related to the exercises that are covered in this program, not every possible dog training question that might be out there.</span></p><p><span><strong>About Treatpouch.com's Trainers</strong></span></p><p><span><strong>Julie Posluns</strong></span></p><p></p><p>After graduating from a correction-style dog training program in 2003, Julie got a new puppy – a Pug Beagle X (Puggle) named Tyson. At 8 months Tyson started barking and lunging at people, at 10 months he became leash reactive towards dogs, by 1 year he had full out aggression towards puppies. When Julie realized that she had not learned proper techniques to deal with aggression – punishing Tyson for his behaviour made him lash out with greater intensity, she started looking for new ways to help her dog. Clicker training brought a new light to Tyson’s aggression and gave Julie a skill-set to manage his behaviour. This inspired Julie to learn about positive reinforcement training and set her on the path to becoming a professional positive reinforcement dog trainer.</p><p>Julie is a Certified Pet Dog Trainer, Knowledge Assessed (CPDT-KA) through the Certification Council for Pet Dog Trainers (CCPDT). As the owner of a successful dog walking company in Toronto, Julie sharpens her training skills daily when she is out on her group walks. When she’s not dog walking you can find her teaching tricks to her own dogs.</p><p>Both her dogs have titles in Rally Obedience and Freestyle but her greatest accomplishment is being able to bring her Puggle out with her on group walks. Treatpouch.com is her way of sharing with the world both the power of positive reinforcement training and the joy that comes from working with your dog.</p><p>Julie is currently pursuing her Master's degree in Animal Behavior, at Memorial University, in St. John's, Newfoundland, Canada.</p><p><strong>Andre Yeu</strong></p><p></p><p>Andre’s passion for dog training began when he rescued his beagle, Duke, who suffered from on-leash reactivity and dog-aggression. Andre quickly discovered clicker training and the power of positive reinforcement, and through patience and care was able to help Duke overcome his fear and dislike of other dogs.</p><p>Duke’s success gave Andre the confidence to volunteer and foster with a number of animal rescue organizations in the city. While each foster dog presented new challenges every dog could be helped through clicker training.</p><p>In 2009, Andre decided to open When Hounds Fly! in Downtown Toronto, to make positive reinforcement training convenient and accessible to members of the community, and to improve the quality of life for dogs and dog owners in the downtown core. With the success of his school and the transformation he’s seen in the neighbourhood dogs, Andre decided that it would be a worthy cause to offer people the benefits of positive reinforcement based training regardless of where they live. Through Treatpouch.com Andre hopes to improve the lives of dogs and their people all over the world.</p><p>Andre is a Karen Pryor Academy Certified Training Partner (KPA CTP), a Certified Pet Dog Trainer, Knowledge Assessed (CPDT-KA), and a Truly Dog-Friendly Trainer. He grew up in Vancouver, has a bachelor’s degree in commerce, with honors, from the University of British Columbia, and lives in Toronto with his partner, Hyedie Hashimoto, and their rescue beagles, Duke and Petey.</p><p></p><p></p>\r\n", 
    "end_date": null, 
    "title": "Polite Puppy Dog Training Class", 
    "price": "30.00", 
    "instructors": "Treatpouch", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18719_2257_3.jpg", 
    "course_url": "https://www.udemy.com/politepuppy/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-29T14:13:15Z"
}