{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Dr. Dunbar&#039;s Off-Leash Reliability &amp; Games Workshops have brought back some sparkle, some excitement, and some razzle-dazzle to pet dog training, all while helping owners achieve huge improvements in reliability with their dogs. Training your dog while off-leash in an exciting and distracting environment makes it much more likely that they will follow your instructions in other distracting situations as well.</p><p> Games are extremely enjoyable for dogs and they often bring out the best performances. Dogs are highly motivated because their owners are highly motivated, excited and animated.<br style=\"\"></p><p> All of Dr. Dunbar&#039;s games are designed to improve the quality of the relationship between dogs and their people and each individual exercise or game is specifically designed to fine-tune essential ingredients of your dog&#039;s training repertoire. The prospect of playing games motivates owners to practice. For some owners, heeling and sit-stay homework is not very exciting, but many will stay up to the wee hours to practice for Doggy Dancing or Musical Chairs.</p><p> In addition, playing games is an enjoyable and non-threatening way to objectively quantify performance and fine-tune all basic obedience skills, including attention, position changes, stays, following, heeling, and precision work. </p><p>Turning training into games and quantifying responses with a stopwatch or tape measure, enables pet dog trainers to remind owners to celebrate with the dog each time they surpass a personal best. Nothing motivates owners more than when they see that they are improving, even with baby steps, and nothing advertises that you&#039;re a great pet dog trainer than the dog&#039;s progressive improvement. </p><p>Games make it easy and fun to quantify behavior and training, and quantifying your dog&#039;s responses allows you to prove whether or not your training methods are working, exactly how well they are working and when you surpass a personal best performance.</p>", 
    "end_date": null, 
    "title": "Reliability and Games 2-Day Dog Training Workshop", 
    "price": "50.00", 
    "instructors": "Dr. Ian Dunbar", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439726_e597_2.jpg", 
    "course_url": "https://www.udemy.com/reliability-and-games-2-day-dog-training-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T18:46:21Z"
}