{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>Mein Kurs Seitenblicke (Der Online-Kurs zu meinem gleichnamigen Buch) ist die praktische Perspektive auf meine Methode. Hier erkläre ich Dir anhand von vielen Videos und zusammen mit meinen Pferden, wie Du meine Methode leicht und zielgerichtet auch für das Training mit Deinem Pferd umsetzen und nutzen kannst.</p><p>Du solltest auf jeden Fall schon ein wenig Ahnung im Umgang mit Pferden haben. Aber Fortgeschritten oder Profi musst Du nicht sein. Es wird Dir dann nur leichter fallen, nachvollziehen zu können, von was ich spreche.</p><p>Meinen Kurs habe ich nach meinem sechs-Stufen Training konzipiert und arbeite diese sechs Stufen in unterschiedlicher Zahl an Video-Lektionen ab. Später im Kurs biete ich Dir noch einen Schwung Trainingsanleitungen zum Download und den einen oder anderen Extra-Artikel als Ergänzung.</p><p>Wenn es Dir wirklich am Herzen liegt, Deine Beziehung zu Deinem Pferd deutlich zu verbessern, leichter mit ihm arbeiten können willst und mit viel Spaß und Freude Dinge erreichen willst, die Dir bisher nicht möglich waren, dann ist mein Online-Kurs eine optimale Unterstützung für Dich.</p><p>Probiere es einfach aus. Nutze meine Tipps und Tricks, nutze jeden Baustein meiner Methode um die Beziehung zwischen Dir und Deinem Pferd deutlich zu verbessern. Ich wünsche Dir ganz viel Spaß damit und freue mich auf Dein Feedback.</p>", 
    "end_date": null, 
    "title": "Seitenblicke - Trainieren & Leben mit Pferden (Teil II)", 
    "price": "50.00", 
    "instructors": "Timo Ameruoso", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/746678_b3ff.jpg", 
    "course_url": "https://www.udemy.com/seitenblicke-trainieren-leben-mit-pferden-teil-ii/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-30T08:33:56Z"
}