{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>This online seminar consists of six hours of video lecture by renowned animal behaviorist and dog trainer, Dr. Ian Dunbar. It has been approved for 6 continued education credits by the CCPDT, IAABC &amp; NADOI.<br></p><p>This seminar will offer simple solutions for the most common dog behavior and training problems, including: housesoiling, destructive chewing, excessive barking, digging, home-alone problems (and separation anxiety), leash reactivity to other dogs, hyperactivity, jumping-up, not coming when called, pulling on leash, plus lack of attention and compliance.</p>  <p>Obviously, preventing predictable doggy problems is the way to go but what do we do when adolescence exuberance, distraction and the development of fears and phobias override socialization and training? How can we retrain dogs in shelters to make them more adoptable? And how do we retrain newly adopted adolescent and adult dogs? </p>  <p>Whereas rehabilitating adult dogs with temperament problems (fearfulness, fighting and biting) can be extremely time consuming, especially the older the dog, behavior and training problems may be resolved at any time in a dog’s life. When training begins, good habits begin to replace bad habits. We may need different training techniques (All-or None Reward Training) to get started but otherwise, by and large, treatment protocols are virtually identical to prevention protocols. Moreover, retraining an adult dog is often much quicker than training a young puppy. </p>  <p>This is a full agenda and whereas we’ll discuss fearfulness and reactivity to other dogs unfortunately, there will not be sufficient time to discuss dogs that have serious aggression problems and have injured a dog person or another dog.</p>  <p>The seminar is suitable for both dog owners and dog professionals.</p>", 
    "end_date": null, 
    "title": "Simple Solutions for Common Dog Behavior & Training Problems", 
    "price": "30.00", 
    "instructors": "Dr. Ian Dunbar", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626182_207f_2.jpg", 
    "course_url": "https://www.udemy.com/simple-solutions-for-common-dog-behavior-training-problems/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T19:21:04Z"
}