{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>\r\n\t       In this class you will learn the step by step process of teaching your dog to fetch you a tissue on cue and how to get it to be a reliable behavior.  For most dogs, the training should be completed in about 4-6 weeks if you work on regularly.  Please allow for variations.\r\n</p>\r\n<p>\r\n\t       Why should you take this course?\r\n</p>\r\n<p>\r\n\t       Training tricks like this provides a great activity for you and your dog during poor or seasonal weather.  Training sessions can be just as exhausting as physical exercise.\r\n</p>\r\n<p>\r\n\t       If your dog has a fascination with tissues, teaching them this skill can curb it but you must see the training to completion to reap the full benefits.\r\n</p>\r\n<p>\r\n\t       This is a great impulse control exercise.\r\n</p>\r\n<p>\r\n\t       Fetching a tissue on cue is what is called a back-chained behavior which can teach the elements of backchaining by example. (Backchaining as theory is not covered in this course.)\r\n</p>\r\n<p>\r\n\t     You should NOT take this course if your dog exhibits signs of possessive aggression which includes but is not limited to:\r\n</p>\r\n<p>\r\n\t     Growling or showing teeth when you approach your dog with novel items.\r\n</p>\r\n<p>\r\n\t     Has a bite history that includes bites to humans when removing objects from mouth.\r\n</p>\r\n<p>\r\n\t     Growls or shows teeth when they have a paper product such as tissues or paper towels.\r\n</p>\r\n<p>\r\n\t     YOU MUST address this behavior first with a qualified professional Canine Behavior Consultant, Applied Animal Behaviorist, Veterinary Behaviorist or another EDUCATED and experienced dog training professional) before teaching this to your dog.\r\n</p>", 
    "end_date": null, 
    "title": "Teach Your Dog A Trick:  Get Me A Tissue", 
    "price": "20.00", 
    "instructors": "Elizabeth Mattei-Miller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145872_ee9c_4.jpg", 
    "course_url": "https://www.udemy.com/teach-your-dog-a-trick-get-me-a-tissue/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-12T15:57:58Z"
}