{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p>  \t <em><strong> Are you thinking about getting a cat? Do you have a cat, but want to improve both of your lives?</strong></em> Do you have a cat that doesn't use the litter box, scratches the furniture, doesn't let you pet them, hisses at you, spraying, staying up all night, or does other 'naughty' things?  </p>  <p>  \t  This is the course for you. The Happy Cat Course will help you understand your cat better than ever before. By knowing more about your cat, and where they're coming from, you'll be able to create a cat-friendly environment built for a happy cat. You'll know how to interact with your cat better by knowing the different ways in which your communicates with you. Play time with your cat will better than ever by using proper interactive play techniques which can decrease poor behavior and lead to a better quality of life for you cat.  </p>  <p>  \t  I'm not a cat whisperer. I'm just a normal guy that loves cats and wants to share my knowledge with you. Many of these lessons teach skills that top cat researchers have studied and written about. I've broken down the basics of cat ownership into digestible topics that are fun to watch.  </p>  <p>  \t  Sprinkled in between the lessons will be funny and cute videos of my cat Zorah. Yes I'm a crazy cat guy. But you don't have to be a crazy cat person to have a great and happy life with your cat.  </p>  <p>  \t  Enroll now to start learning more about cats, and how to build your own happy cat life.  </p>  <p>  \t  Cheers,<br>  \t  Phil<br></p>", 
    "end_date": null, 
    "title": "The Happy Cat Course - Cat Adoption and Ownership Tips", 
    "price": 0, 
    "instructors": "Phil Ebiner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177098_a32d_4.jpg", 
    "course_url": "https://www.udemy.com/cat-adoption-and-ownership-tips/", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T05:57:54Z"
}