{
    "selfpaced": true, 
    "topic_name": [
        "Lifestyle"
    ], 
    "description": "<p><strong>Do you have multiple cats in your house that just will not get along?</strong></p><p>I've been there and I know what's it's like! </p><p>After bringing a 3rd cat into our home we had to deal with constant fighting and couldn't leave the house without our cats being separated at all times.</p><p>I spent hundreds of dollars on cat toys, special cat food, calming collars, and even pheromones you name it and we tried it! </p><p><strong>We were on the verge of re-homing our 3rd cat!</strong></p><p>After 1 year of trying everything we finally found a solution that worked for us. Our cats now can hangout in the same room without wanting to attack one another.</p><p>In this course I walk you through our cat story as cat owners who simply wanted our cats to get a long. I also share all the experiences we went through, the experts we learned from and how we finally resolved our cat aggression issues!</p><p>This course will help you save money and understand the best way to deal with multi cat household fights and aggression. </p><p><strong>What You Get In This Course</strong></p><ul><li>I share our story as to how my girlfriend and I brought 3 cats into our lives</li><li>The mistakes we made when we introduced our cats and how you can prevent this</li><li>How to \"Catify\" your home with perches and cat towers </li><li>An in-depth overview of all the professional cat trainers we learned from and spent hundreds of dollars working with.</li><li>Resources from our training sessions </li><li>What ultimately worked for us and helped our cats finally get a long without constant supervision.</li></ul><p><br></p>", 
    "end_date": null, 
    "title": "Training Cats To Get Along In a Multi-Cat Household", 
    "price": "20.00", 
    "instructors": "John Shea", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/621410_9260_2.jpg", 
    "course_url": "https://www.udemy.com/training-cats-to-get-along-in-a-multi-cat-household/", 
    "currency": "USD", 
    "subject_name": [
        "Pet Care & Training"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-24T15:20:05Z"
}