{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   Have you ever wanted to know for sure if the one you are dating is your true soul mate? Do you find yourself “googling” for definitive answers only to come up empty and disheartened? Have no fear because this course is designed to give you a proper and concise framework for a healthy and happy relationship.  </p>  <p style=\"\">  \t What is this Course About?  </p>  <p style=\"\">  \t This course is for people who want to ask and seek practical real world questions and advice to ask of their girlfriend/boyfriend to see if they are indeed “the one”.  </p>  <p style=\"\">  \t What am I Going to Get From This Course?  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t ·Over 30 minutes of video lecture and instruction  \t</p>  \t<p style=\"\">  \t\t ·Refined listening, courtship planning, and dating skills  \t</p>  \t<p style=\"\">  \t\t ·Key direct questions to ask anyone wanting to go beyond casual dating  \t</p>  \t<p style=\"\">  \t\t ·21 Essential Questions for Your Soul mate Worksheet  \t</p>  \t<p style=\"\">  \t\t How long will it take to complete this course?  \t</p>  \t<p style=\"\">  \t\t This course will take approximately 45 minutes to complete.  \t</p>  \t<p style=\"\">  \t\t Why take this Course?  \t</p>  </ul>  <p style=\"\">  \t This course is designed to teach you  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t ·How to ask the meaningful open ended questions related to the person’s character, interests, goals, and true values.  \t</p>  \t<p style=\"\">  \t\t ·This course will train you to ask the right questions to find the right one for them at the right moment in their lives. After all if you don’t know what to ask, you will never know because it has been said that “from out of the mouth, the heart speaks”.  \t</p>  \t<p style=\"\">  \t\t ·This course will train your ears and mind to go deeper during your dating/courtship experience to find the best soul mate for you in every way- mentally, physically, spiritually, and emotionally.  \t</p>  </ul>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "1001 Questions Before I Do- Finding your Soulmate Part I", 
    "price": "20.00", 
    "instructors": "Anthony Chandler", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/208118_b5e9_2.jpg", 
    "course_url": "https://www.udemy.com/1001-questions-before-i-do-finding-your-soulmate-part-i/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-30T16:36:40Z"
}