{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Do you yearn for more closeness in your relationship?</li><li>Has your marriage lost some of its spark?</li><li>Could your communication skills use some help?</li><li>Are you worried that you are inadvertently harming your love life?</li></ul><p>Help is on the way!</p><p>In the 21-Day Relationship Boot Camp, you will learn about how to deal with all of these all of these issues and more. Taught by Dr. Patricia Thompson, an award-winning psychologist, life coach, and author, this course breaks down scientific research into practical lessons that you and your partner can use to strengthen your relationship and experience more fulfillment.</p><p><strong>Who is the Course For?</strong></p><p>The course is for anyone in a relationship, whether it is long-term (or headed there)  or a marriage. If both you and your partner want to take part, that is great; however, even if just one of you is taking the course, your relationship is likely to improve, because as you change, so will your relationship.</p><p>If you are not currently in a relationship, you will likely benefit from the course too, as you will learn all about the foundations of a healthy relationship. You will be able to reflect on past relationships to see why they may not have worked out, and put yourself to be in a better position for your next relationship.</p><p><strong>How Does the Course Work?</strong></p><p>Each day, you will watch a video lecture in which a research-based relationship tip is explained. Then, over the next 24 hours, you will complete a homework assignment in the companion workbook that you will download as part of the course materials. These assignments encourage you to self-reflect, experiment with new relationship behaviors, and deepen your insights about you and your partner. The course materials also include downloadable audio exercises, a link to a relationship quiz, and recommended reading (for you over-achievers).</p><p><strong>You deserve to have a more fulfilling love life. Take this course and improve your relationship - starting today!</strong></p>", 
    "end_date": null, 
    "title": "21 Day Relationship Boot Camp", 
    "price": "40.00", 
    "instructors": "Patricia Thompson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518140_ac19_3.jpg", 
    "course_url": "https://www.udemy.com/21-day-relationship-boot-camp/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T15:39:04Z"
}