{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Relationships are a vital part of our life!  However, Relationships are one of the most difficult things to master for most people.  People often fail to realize that they have to keep working on their relationship forever, to keep it strong and Healthy.</p>\n\n<p>This class if for anyone in a relationship or that one day wants to be in a relationship, and wants it to last a lifetime.  </p>\n\n<p>This course has 3 main sections which focus on keeping the excitement alive, speaking the correct words to each other, and letting go of the need to be right.  In just around an hour of your time you will gain some lifelong lessons to support your relationship forever.  </p>\n\n<p>There isn't a finish line in our relationship to cross where everything turns magical.  The fairy tale that most people seek in a relationship is a process that takes team work and dedication.  My mission in this course if to start you down that path to having a relationship that others are envious of.  </p>\n\n<p>The tips your receive from this class can transform your relationship and start it on the path to not just surviving but to thriving.  These tips can be used over and over again and can even be put into place in all your relationships.  Relationships with your kids, your co-workers, and even your friendships will blossom as you use these tactics.</p>\n\n<p>One hour of your time as we mentioned above is all it takes for you to acquire the knowledge that many have struggled with for years.  With so many relationships failing now-a-days you need this course on your side so that you have the tools with you at all times to take a good relationships and make it a great one.  </p>\n\n<p>I am not only teaching these ways to improve your relationship but I have lived them.  I have put them into place in my relationship with great success.  Now you can benefit from my experience and my hope for you is that you have the amazing relationship that I have with my amazing partner.  </p>", 
    "end_date": null, 
    "title": "3 Ways To Improve Any Relationship", 
    "price": 0, 
    "instructors": "Dr. Rob Alex", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655108_eae2_2.jpg", 
    "course_url": "https://www.udemy.com/improveyourrelationship/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T00:41:19Z"
}