{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Almost every man faces this situation in his life, when he falls for a wrong woman. And with time the situation only gets worse. The woman keeps on using the man solely for her own personal benefits and man in-spite of clearly seeing all this keeps on hoping that someday the situation will get better and she will engage herself more in this so-called relationship. But alas, that day hardly comes. As usual at the end the woman moves on and all you are left with is anger and remorse that you wasted your precious time and money at someone who wasn't worthy enough for that. </p><p>This is where our course come, which consciously makes you aware of all those situation which otherwise would have gone unnoticed. This one hour course is designed to be less time consuming, so that you reap maximum benefit.</p><p> This useful course consists 14 Major Sign which can be widely detected in lots of women and can be seen without much effort. Being common, these signs are quite hard even for a woman to hide or alter.  Another 25 Minor Sign are subtle in nature and takes some effort to notice. They might not be as prevalent as the majors one but surely will come in handy when you need to put her through the series of verification routine.</p><p>Together all these 39 Signs will give you a complete picture of any women who is in your life and will help you to tackle this serious problem. After all it's all up to you whether you still want her to be in your life or you wanna move on, in search of someone better.</p><p>Either way, whichever way the decision will be completely yours.</p><p>I wish you amazing time ahead.</p><p>Thanks<br> </p><p><br></p>", 
    "end_date": null, 
    "title": "39 Confirmatory Signs to Identify if She is Using You", 
    "price": 0, 
    "instructors": "Vipin Patel", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592130_1134_2.jpg", 
    "course_url": "https://www.udemy.com/39-confirmatory-signs-to-identify-if-she-is-using-you/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T19:10:31Z"
}