{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  If you have ever <strong>seen a child struggle</strong> to feel secure and wanted to help  </p>  <p>  \tor  </p>  <p>  \twished that parent teenager conversations left both of you feeling<strong> heard, understood and respected</strong>  </p>  <p>  \t  or  </p>  <p>  \t  if you have ever felt compassion at the <strong>awkward feelings</strong> and actions of a teen at puberty,  </p>  <p>  \t  then you might enjoy learning the <em>Four Parenting Pillars to Grow Great Kids</em>!  </p>  <p>  \t  This is an educational program that takes into account all types of learners: visual learners, auditory learners and kinesthetic learners.  Using video, discussion questions, audio, quizzes and application exercises, you will learn:  </p>  <ul>  \t<li>what Maria Montessori knew about child development that most parents and teachers wish they did</li>  \t<li>when development starts and stops</li>  \t<li>why acceleration phases are critical</li>  \t<li>who children look up to at what ages</li>  \t<li>how to communicate with your child and his or her friends at each age and stage</li>  \t<li>where to create opportunities for fun and love so that your days are more playful</li>  </ul>  <p>  \t  If <strong>you are a parent</strong>, you may be looking for the next step in learning how to enforce rules or being both a friend and ally to your teen. This course will help you learn skills that compliment what you have already mastered.  </p>  <p>  \t  If <strong>you are expecting</strong> your first baby, you may be wanting to keep close connection with your lover as you transition into being a good parent.  This course will help you create the ideal home environment to honor both commitments.  </p>  <p>  \t  If <strong>you are teacher</strong> who wants to connect better with students, this course will help you change thoughts and habits that may be getting in the way of you being the best teacher you can be to preschool, elementary school, high school and college students.  </p>  <p>  \t  Maybe <strong>you are a tween, teen or young adult</strong> who wants to understand why you and your parents or teachers never seem to be on the same page.  This course will help you master the steps of your own life transitions and communications so you successfully transition to being an independent adult.  </p>  <p>  \t   Dr. Lori Barr will give you the knowledge and let you practice skills that will help you <strong>become a better friend, lover and parent</strong>.  </p>  <p>  \t Who knows?  </p>  <p>  \t<em>  It could even help you communicate better with your pet!</em>  </p>", 
    "end_date": null, 
    "title": "4 Parenting Pillars To Grow Great Kids", 
    "price": "50.00", 
    "instructors": "Lori L. Barr, M. D.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/266688_91ec_2.jpg", 
    "course_url": "https://www.udemy.com/parentgreatkids/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-22T18:41:11Z"
}