{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Affair Recovery Course</p><p>Perfect for Individuals</p><p>Understand Your Emotions</p><p>Understand Your Partners Emotions</p><p>Get Advice on What You Need To Do Right Now to Cope.</p><p><strong>This course is written by Clinical Psychologist &amp; Affair Recovery Experts with over 20 years experience in affair recovery.</strong></p><p><strong><br></strong></p><blockquote><em>This course is essential reading if you are going through or have been through a relationship infidelity. Infidelity completely shatters your assumptions of the world around you - and even of yourself. You need to understand why you think the way do you, why you feel the way you do...but more importantly, you need to know what you need to do now - to change past patterns to ensure that don't reoccur in the future.</em><br><em>I wrote this course (or affair recovery content) so people just like you, get to understand the affair recovery range of emotions and feelings - so you know how to process these feelings and be able to move forward and have a normal and happy life in the future.</em><br><em>You do not have to have your partner do this course with you. You can read this information and do the work for yourself. Many times, you will find that your spouse will join you in the course once you have began. If they don't - they you know what you need to do, to have the relationship that you deserve.</em><br><em>Inside this course, you can ask questions in each section. I will answer any question you have. If you can dedicate at least 1 to 2 hours per week on your healing by reading this course and working through the content - then you have saved yourself $400 per week from seeing me in face to face therapy!  <br><br>Savannah Ellis</em></blockquote><p> <br><strong>The ULTIMATE affair recovery course, created by an affair recovery specialist!</strong><strong> </strong></p>  <p>  \t        This course is suitable for anyone who seeks to put their life back  together after an affair. The Infidelity Recovery Method was created by Clinical Psychologist, Dr Savannah Ellis, to help couples who could not afford a therapist or who lived in remote locations, and unable to access professional affair recovery advice.  </p>  <p>  \t    The Infidelity Recovery Method has been designed with the idea that you can work through these steps at home, at your own pace, and without pressure. You do not need to explain your situation to a counselor week after week or pay for weekly counseling sessions, costing thousands $.  </p>  <p>  \t<strong>You will have 3 Goals:</strong>  </p>  <p>  \t<strong>Goal One: Individual  Healing – Managing Emotions and Negative Thoughts</strong><strong></strong></p><ul><li>Discovering the Affair: How to Cope with the Initial trauma</li><li>The Four Roadblocks to Healing</li><li>A Simple 2-Step Process for uncovering unknown emotions</li><li>The 3 Steps to Clearing Your Mind and owning Your thoughts</li><li>Obsessions: What to Do When the Plague of Images Won't Go Away</li><li>Rebuilding Self-Confidence, Self- trust, and Self-Respect</li><li>Seven emotional trials the Cheater Will Face</li><li>Healthy Ways to Process Your emotions</li><li>Managing Guilt</li><li>Self-forgiveness</li><li>Coping with Loneliness</li><li>Six Critical Rules for ending an Affair</li></ul><p>  \t   \t <strong>Goal Two: Healing as a  Couple – Working Together to Identify and Resolve Key Issues. </strong></p><p>This is  where both of you will work together to identify key issues and resolve  them. The main focus of this phase is on helping you establish a healthy  way to communicate with your partner.  </p>  <p>  \t  \t <strong>Goal Three:  Negotiating a Renewed Relationship </strong></p><p>Understanding How to Build and  Sustain a New Trust Filled Partnership. This is the rebuilding phase and  it shows you how to trust each other again. As you know, trust is  essential for a good marriage. By the time you are finished with this  final phase of the program, you should be ready to move on with a new  life together.  </p>  <p><strong>Elements of this course include:</strong></p>  <ul><li>Learning to Accept the Past</li><li>The Five Myths that Surround Acceptance</li><li>Three False Forms of Acceptance: Demons that Can Hold You Back on Your Road to Healing</li><li>Opening the Heart once More</li><li>Preserving Your Renewed Relationship: Building a Fence around Your Life together</li><li>Preparing to Write Your Relationship Contract</li><li>Your New Relationship Contract</li></ul>  <p><strong><br></strong></p><p><strong>How Does An Affair Start?</strong>  </p>  <ul>  \t<li>Reasons Cheaters Cheat</li>  \t<li>10 Critical Dimensions of a Relationship: Analyzing Your own needs</li>  \t<li>Moving toward Healing: Coming into Agreement with Your Partner</li>  \t<li>My 3-Step Method for Coming into Agreement</li>  </ul>  <p><strong> Affair Recovery</strong>  </p>  <ul>  \t<li>Protecting the Relationship from Further Harm: Four Minefields to Avoid</li>  \t<li>Asking for Forgiveness: understanding Your Partner's Pain</li>  \t<li>Six Steps to Creating a Heartfelt Apology</li>  \t<li>Accepting the Past and Moving into a Brighter Future</li>  </ul>  <p><strong>Communication</strong>  </p>  <ul>  \t<li>How to talk: An 8-Step Program for Learning Better-than-ever Communication</li>  \t<li>10 Critical Conversations with Your Partner</li>  </ul>  <p><strong> Trust</strong>  </p>  <ul>  \t<li>Trust: the Foundation of Your Relationship</li>  \t<li>Five Building Blocks for a totally transparent Relationship</li>  \t<li>10 Destructive Habits that Demolish trust and tear Down Love</li>  \t<li>Six steps to resolving conflict quickly and effectively</li>  \t<li>How Growing Independently Will Help You Grow As a Couple</li>  </ul>  <p><strong>Forgive Via Acceptance</strong>  </p>  <ul>  \t<li>Learning to Accept the Past</li>  \t<li>The Five Myths that Surround Acceptance</li>  \t<li>Three False Forms of Acceptance: Demons that Can Hold You Back on Your Road to Healing</li>  \t<li>Opening the Heart once More</li></ul><p><br></p>  <p>  \t<strong>Pace</strong>: This is a self-paced course.  </p>  <p><br></p>", 
    "end_date": null, 
    "title": "Affair Recovery:Emotional Healing for Couples or Individuals", 
    "price": "25.00", 
    "instructors": "Dr. Savannah Ellis", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364878_9d95_7.jpg", 
    "course_url": "https://www.udemy.com/learn-the-infidelity-recovery-method-for-couples/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-06T23:09:39Z"
}