{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t   Happiness expert and best-selling author, Sophie Keller, takes you through her comprehensive program After Miscarriage - A Digital Program to Help You through the grieving Process. This online program helps you to stop blaming yourself or anyone else for your loss, helps you to let go of all the negative thinking about what happened and why. Helps you to release grief, anger and guilt to speed up your grieving process, helps you to focus positively on your next steps and release all fear of it ever happening again.. Participants will complete 5 powerful interactive video lessons that build on one another, a journal to fill out alongside the videos and a guided meditation designed to help you completely heal.\r\n</p>\r\n<p>\r\n\t   &ldquo;Losing a baby can be a devastating experience for anyone&rdquo; Says Sophie Keller &ldquo;It was when I lost my baby at just over 20 weeks. I felt very depressed and alone, and apart from a few books, I couldn&rsquo;t find the help I needed. And so I created the deep healing method you&rsquo;re going to find in <strong><em>After Miscarriage</em></strong> that I developed over years of study and practice in the personal development field. As a result of this process, I didn&rsquo;t bring any of the fear from my loss into my next successful pregnancy after the miscarriage and have helped hundreds of women to get over their loss and get pregnant again with this method. It really is powerful.&rdquo;\r\n</p>\r\n<p>\r\n\t This course will take you about 3 hours to complete.\r\n</p>", 
    "end_date": null, 
    "title": "After Miscarriage ", 
    "price": "50.00", 
    "instructors": "Sophie Keller", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150380_3e7f_2.jpg", 
    "course_url": "https://www.udemy.com/after-miscarriage/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-21T22:08:59Z"
}