{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>[updated November 2015 with new skills} </em>This course is for those parents and teachers who are <strong>fed up with having to continuously say NO, DON'T and STOP every day! You can use these skills for everyday problems from toddlers to teens such as:</strong></p><p>Stop\n splashing.... cheating, swearing, whining, hitting your brother, \nstealing, eating with your mouth open, leaving dirty clothes on the \nfloor, watching too much TV or too much computer. <strong>We have a skill for each and every boundary you need to put in place.</strong></p><p>Come learn alternatives that actually <strong>empower and build confidence</strong> instead of leading to anger and frustration from both you and your children.</p><p>I will take you step by step through the tried and tested skills we have developed over the last 20 years. And more importantly, I will show you how you can implement these skills straight away so you will get breakthrough after breakthrough.</p>But this course is more than that. It's about understanding the psychology of your child and bringing out the best in them, and in you. <ul><li><strong>I have included Skills Summary printouts that you can stick up around your house.</strong></li><li><strong>I have included links to online exercises where you can practice your skills. </strong></li><li><strong>I have included whole sections on TODDLERS, on MONEY MATTERS, and frequently asked questions. </strong></li></ul><p>Parenting does not have to be something you just survive.... as these skills will push you into a paradigm of <strong>THRIVE</strong>.</p><p>And you don't need to know them all... in fact... there is probably more than you will need here.... you just need 2 core skills and they will work in over 80% of your situations. </p><ul><strong></strong></ul><p>So enroll now and learn how to get rid of that guilty feeling that you may be damaging your child's well being... only because you just have not yet learned the easier alternatives.</p>", 
    "end_date": null, 
    "title": "Alternatives to saying \"No! Don't! Stop!\" without giving in", 
    "price": "45.00", 
    "instructors": "Robin Booth", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654542_bd73_4.jpg", 
    "course_url": "https://www.udemy.com/alternatives-to-saying-no-dont-or-stop-without-giving-in/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T13:36:44Z"
}