{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\">Are you a good guy who has been getting little or no results with women lately?</li>  \t<li style=\"\">Do you run out of things to say when talking to women you like?</li>  \t<li style=\"\">Do you fear being rejected if you approach attractive women?</li>  \t<li style=\"\">Do you often see women that you&#039;d like to talk to, but you stop yourself from approaching because you don&#039;t know what to say or do?</li>  \t<li style=\"\">Do you find it difficult to keep a conversation going and keep it interesting when talking to attractive women?</li>  \t<li style=\"\">Do you often wish that there was an easy way to approach and talk to women and get them to like you right away?</li>  </ul>  <p style=\"\">  \t  Then this is the course for you!  </p>  <p style=\"\">  \t  In this video course, I will share my best techniques and advice for guys who are just starting out with approaching women, or who are getting back into the dating game after a break up. Here&#039;s just some of what you will learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to overcome your fears and approach women with confidence anytime you want.</li>  \t<li style=\"\">How to talk to a woman in a way that causes her to feel sexual attraction for you and open up to the conversation. </li>  \t<li style=\"\">What to say to start conversations in different environments (e.g. in a bar, shopping mall, on Facebook, on an online dating site, etc). </li>  \t<li style=\"\">How to keep a conversation going and keep it interesting. </li>  \t<li style=\"\">How to build on a woman&#039;s attraction and interest for you by being your true self. </li>  \t<li style=\"\">How to get a woman&#039;s phone number or add her to Facebook.</li>  </ul>  <p style=\"\">  \t  As you watch this video program, you will learn many examples of what to say to women when you approach and talk to them. When you use the examples in this program, finding yourself a new girlfriend will become one of the most exciting things you ever do. Your dating life is about to go into overdrive. Try it today!  </p>", 
    "end_date": null, 
    "title": "Approaching and Talking to Women: For Beginners", 
    "price": "20.00", 
    "instructors": "Dan Bacon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/166304_ecfa_3.jpg", 
    "course_url": "https://www.udemy.com/approaching-and-talking-to-women-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-18T06:45:08Z"
}