{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tEl amor en una pareja no es tener una buena \"química\" entre los cuerpos.  </p>  <p>  \tEl amor en una pareja no es compartir gustos, ideas, creencias y valores.  </p>  <p>  \tPero si no eres capaz de crear una conexión emocional con tu pareja NO te enterarás de lo que te estás perdiendo. No serás capaz de ver la parte más dichosa, imperecedera y trascendente que tiene una relación entre dos personas. No serás capaz de conectarte con el amor.  </p>  <p>  \t  Este curso trae una moderna perspectiva diferente a la tradicional. Resultado de descubrimientos realizados por la ciencia en los últimos años, la mirada del coaching, junto con una profunda perspectiva espiritual. Porque ya no se puede negar que el amor nos une en un sentido más allá del plano físico. Reducir al amor al plano hormonal o psicológico es una visión muy limitada del fenómeno. Es por eso que hemos desarrollado una visión mucho más amplia del mismo.  </p>  <p>  \t  Destinado al público en general te traemos herramientas para que entiendas de la razón de tus resultados en el amor, y que tienes que hacer para inundar de amor tu vida.  </p>  <p>  \t  Entenderás porqué se siente tan bien. Que tiene que ver el amor con lo espiritual. Porqué solemos confundir al amor con el sufrimiento. Cómo nos comunicamos en el amor desde la neurobiología.  </p>  <p>  \t  Aprenderás donde nace el amor y cómo conectarte con él cuándo quieras.  </p>", 
    "end_date": null, 
    "title": "Aprende el Arte del Amor", 
    "price": 0, 
    "instructors": "Esteban Irigoyen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284932_352f_5.jpg", 
    "course_url": "https://www.udemy.com/que-es-el-amor/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T01:04:17Z"
}