{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>Recent feedback about this course:</strong></em></p><p><em>I love this course and so did my daughter! Miss Em was very clear and positive throughout the entire course! The visuals and recordings were perfect and her explanations were easy for my 7 year old to understand! The course was also educational which I appreciated and all of my daughter's projects came out SO cute! I will be hanging them all in her room! I can't wait to have my daughter take all of Miss Em's courses!</em><em></em><br></p><p><em>                                                                                            ~R.W.</em></p><p><strong>Are you looking for a quality Art Course for your child?</strong> </p><p>The <em>Learn How to Paint Animal Art Portraits </em>course may be just what you are looking for! Designed with beginners in mind, this course is perfect for children ages 6-10 years old. With a total of 6 fun and unique acrylic art painting projects, your child will learn the skills to create masterpieces of their own long after the course is complete.<br></p><p>Before each art lesson begins, your child will be presented with a slideshow that provides scientific facts and images about each animal. These facts and images will help your child make important connections between art and science. </p><p><strong>There are two steps in each art project:</strong></p><ul><li>Step 1: Design, Draw, and Outline Animal Portrait onto Paper</li><li>Step 2: Paint Animal Portrait</li></ul><p>The process used to teach each art project is a kid-tested, step-by-step method that will both inspire and delight your child into drawing and painting action! This process involves observing, following instructions, and creating until the student is happy with the desired outcome.</p><p>Students will learn basic acrylic painting techniques and apply these techniques to complete each project. The<em> Learn How to Paint Animal Art Portraits </em>course is designed to give children the tools they need to begin their artistic journey into self-expression, reflection, and creative thinking.</p><p><strong>Supplies and materials needed for this course:</strong></p><ul><li>heavy paper (acrylic paper works great!)</li><li>acrylic paints (various colors)</li><li>paintbrushes (small, medium, large)</li><li>pencil with eraser</li><li>paper towels</li><li>paper plates</li><li>bowl of water</li></ul><p><strong>I would love to hear from you.</strong></p><p>Please let me know if you have questions, comments, or suggestions. I will get back to you ASAP.</p><p><strong>About the Instructor:</strong></p><p>My name is Miss Em and teaching art to children is what I love to do! I pride myself on creating dynamic, meaningful, and engaging art lessons that are taught in a relaxing and joyful way. I have nearly 20 years teaching experience in the elementary classroom and in the art studio, and I feel that I have a good grasp on how to create an environment that makes children feel happy, motivated, confident, and successful.</p><p>I look forward to seeing both you and your child in this<em> Painting for Kids </em>course.</p><p><strong>Let the creative fun begin!</strong></p>", 
    "end_date": null, 
    "title": "Art for Kids: Learn How to Draw & Paint Animals in Acrylic  ", 
    "price": "25.00", 
    "instructors": "Ms. Em Winn", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630908_0e98.jpg", 
    "course_url": "https://www.udemy.com/art-for-kids-learn-how-to-draw-paint-animals-in-acrylic/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T02:43:08Z"
}