{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course you will attract your Soulmate through inner-work and STYLE.   In Part 1 you will focus on clearing the mental and spiritual barriers that have prevented you from attracting your Soulmate. </p><p>This is the deepest and most challenging part of the curriculum. You don't know what you don't know.  In this section, we tackle issues that you didn't even know were there.  This section is the most critical and necessary.  You will clear the mental and spiritual space for your Soulmate to enter.  Without this training, perhaps you may attract your Soulmate but you will not be vibrating at the appropriate level to be able to recognize him when he shows up, and or you won't have put in the self development work to be able to sustain the relationship.  Ultimately, you will be transformed into a complete and whole person that can not only ATTRACT but SUSTAIN a healthy and whole relationship with the love of your life.</p><p>During this process, keep in mind that you can be molded into the most beautiful person on the planet, but if you are ugly on the inside, you will not be able to sustain a healthy and whole relationship for any significant amount of time.</p><p>In Part 2 you learn about STYLE.   Style is an expression of self.  You will know the difference between fashion and STYLE.  This is the icing on the cake!  You did so much innner-work in Part 1, that your personal style will now become very organic and true to who you really are.  Your style will not based off of a fictitious version of yourself or even a style icon.  In this section we work together to bring out the best you through STYLE.  </p><p>Throughout this course, you are supported by the Instructor via three 45-minute Skype video conferencing calls.  You may choose, at your discretion when and how you want to utilize these calls.  It is anticipated that one of your calls will be utilized during Part 1 when dealing with your spiritual and mental baggage.  It is also HIGHLY recommended that you use 1 call to help the instructor tailor at least three ensembles that will help you attract your Soulmate. </p><p>If you are at a point in your life where you are wholly available and ready to receive that ultra special person, you are ready for this course.  </p>", 
    "end_date": null, 
    "title": "Attract Your Soulmate With Style:", 
    "price": "50.00", 
    "instructors": "Toddre' DaLaura Monier", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/568568_e838.jpg", 
    "course_url": "https://www.udemy.com/attractyoursoulmate/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T19:57:54Z"
}