{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t <strong></strong><strong>This course, by internationally acclaimed, bestselling author Max Highstein, will help you get ready for a great relationship, avoid the pitfalls of a bad one, and attract your ideal mate. It includes video, audio lectures, deep inner guided meditation processes, and written assignments. </strong>\r\n</p>\r\n<p>\r\n\t OVERVIEW\r\n</p>\r\n<p>\r\n\t When you&#039;re looking for something deep and long lasting, the clearer you are, the better your chances for attracting someone great. But there are four &quot;Relationship Killers&quot; you need to purge from your life before going any further.\r\n</p>\r\n<p>\r\n\t <strong>The Four Relationship Killers: </strong>\r\n</p>\r\n<ul>\r\n\t<li><em>Low Self Esteem</em></li>\r\n\t<li><em>Denial</em></li>\r\n\t<li><em>Fantasy Stemming from Insecurity</em></li>\r\n\t<li><em>Helplessness</em></li>\r\n</ul>\r\n<p>\r\n\t These Relationship Killers are responsible for virtually every bad relationship on the planet, and they&#039;ll set you up for a fall, time and time again.\r\n</p>\r\n<p>\r\n\t Relationship killers are actually unconscious negative ways of thinking, feeling, and behaving that we learn early in life. That&#039;s why we attract bad relationships over and over again -- our negative patterns are running, and we don&#039;t even know it! We think we&#039;re sending out a clear, positive message, but what we&#039;re actually putting out to the world is entirely different.\r\n</p>\r\n<p>\r\n\t But erasing those destructive patterns paves the way for positive, healthy, relationships that can stand the test of time. So in this course, you&#039;ll go through each of the Relationship Killers, step by step, and help you clear them out.\r\n</p>\r\n<p>\r\n\t This course works on two levels:\r\n</p>\r\n<ul>\r\n\t<li>First, in video and audio lectures you&#039;ll learn about the negative patterns that attract bad relationships. <br>\r\n\t </li>\r\n\t<li>Then, in guided inner processes (guided meditations) you&#039;ll go deep within and knock out that old programming -- and erase the Relationship Killers that keep you stuck. The guided programs are relaxing and easy to follow, and you&#039;ll benefit more each time you listen.</li>\r\n</ul>\r\n<p>\r\n\t <strong>The final lesson a terrific inner process to help you get very clear about what you&#039;re looking for, and put it out to the world in a powerful way.</strong> But first we&#039;ll do the groundwork. That&#039;s the right way to get ready for a great relationship, and attract your ideal mate.\r\n</p>", 
    "end_date": null, 
    "title": "Attracting A Great Relationship", 
    "price": "50.00", 
    "instructors": "Max Highstein", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/100172_1f43_5.jpg", 
    "course_url": "https://www.udemy.com/attracting-a-great-relationship/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-01T19:58:43Z"
}