{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course, Dating Coach and Certified NLP Practitioner, Erin Tillman, The Dating Advice Girl, gives male and female adult students of all ages, in all lifestyles and sexual orientations, tips for attracting the dating/relationship life of their dreams. In a world where singles date by default, Erin provides students with dating tips for entering into relationships consciously. </p><p>This course is ideal for anyone who feels lost, fearful, skeptical, or exhausted in the dating process and for those who are looking for guidance and encouragement for attracting like-minded partners who have similar dating/relationship goals and objectives. </p><p>This course includes easy-to-follow lectures on the following:</p><ul><li>Setting Reasonable Dating Goals &amp; Objectives</li><li>Managing Dating Expectations</li><li>Communication Tips (online and in-person)</li><li>Online Dating &amp; Dating App Tips (including profile tips and messaging tips)</li><li>First Date Tips</li><li>Avoiding the 'Friendzone'</li><li>Managing Fear &amp; Feeling More Confident in the Dating Process </li><li>and more</li></ul><p>This course also includes exercises, downloadable worksheets, and will take just under an hour to complete.<span></span><br></p><p>The course is based on Miss Tillman's in-person workshops and her book, 'The Dating Guidebook: Tips For Living a Happy and Healthy Single Life Without Losing Yourself in the Dating Process.' If you'd like to feel more empowered in the dating process, this course is for you!<br></p>", 
    "end_date": null, 
    "title": "Attract Your Ideal Dating Life: For All Lifestyles/Genders ", 
    "price": "30.00", 
    "instructors": "Erin Tillman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659528_be29_2.jpg", 
    "course_url": "https://www.udemy.com/attract-your-ideal-dating-life-for-all-lifestylesgenders/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T00:22:55Z"
}