{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Raising and caring for a child with autism spectrum disorder is hard. On top of the typical challenges of parenting, you&#039;ll also become an expert in autism research, advocacy, and therapies. The good news is, you don&#039;t have to do it alone!</p><p><strong style=\"\">Become a More Effective Parent for your Child with Autism Using Tools and Strategies from a Veteran Autism Mom</strong></p> <ul style=\"\"> <li>Recognize the signs of autism and decide whether your child should be evaluated.</li> <li>Learn what to do immediately after your child&#039;s diagnosis.</li> <li>Discover activities you can do with your child to improve their skills.</li> <li>Learn how to effectively advocate for your child in an IEP meeting.</li> </ul> <p><strong style=\"\">A Comprehensive Resource for New and Veteran Autism Parents</strong></p><p>Autism spectrum disorder doesn&#039;t just affect 1 in 68 children. It affects their parents, grandparents, teachers, and caregivers as well. Those of us who care for someone with autism are left to sort through an overwhelming mountain of information and claims before we can decide how best to help our kids.</p><p>This course is designed to help you do just that - sit down with a veteran autism mom for real-world advice and solidly researched information on autism therapies, treatments, and coping strategies you can use right now. </p><p><strong style=\"\">Content and Overview</strong></p><p>We&#039;ll start out at the very beginning, by exploring the significant signs of autism. If you&#039;ve already seen lists of developmental milestones, but didn&#039;t really know what they meant, you&#039;ll learn what autism looks like in the first section of this course.</p><p>We&#039;ll delve into the different types of therapies available to you, and I&#039;ll help you figure out which ones are right for your child. </p><p>Next, I&#039;ll help you through your first IEP meeting, and give you my best tips and strategies for dealing with the school system.</p><p>Finally, I&#039;ll help you get - and stay - organized. You have enough stress in your life without hunting for paperwork!</p>", 
    "end_date": null, 
    "title": "Autism Parents’ Starter Kit: Tips & Tools for Your 1st Year", 
    "price": "20.00", 
    "instructors": "Tricia Ballad", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439456_ccb3_3.jpg", 
    "course_url": "https://www.udemy.com/autism-parents-starter-kit/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T11:46:37Z"
}