{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tDo you have a loved one with autism?  </p>  <p>  \tDo you work with children or adults who have autism?  </p>  <p>  \tAre you studying to be a teacher for students with autism?  </p>  <p>  \tThis is a must read course for anyone who works with, or interacts with, individuals who are on the autism spectrum.  </p>  <p>  \tEven if you have autism you may find this resource useful to understand why your brain reacts to certain situations.<br style=\"\"><br style=\"\">During the course you will learn about:</p><p>* the common characteristics and features of autism<br style=\"\"></p><p>* how the brain understands the sensory information in our world around us and why people with autism may react in the way that they do<br style=\"\"><br style=\"\">* we outline why we need to be sensitive and respectful to the needs of people and families who are touched by autism<br style=\"\"><br style=\"\">* we explain the communication and motor skills challenges for people with autism and basic strategies that can be implemented to help the whole family<br style=\"\"><br style=\"\">* we talk about basic strategies that can be used in the classroom to help manage an individual&#039;s anxiety, frustration, and sensory difficulties<br style=\"\"><br style=\"\">* we explain that every individual with autism is unique, every individual with autism has the ability to learn, and every individual with autism deserves to be heard and understood</p><p>After completing this course we hope that you feel uplifted with confidence that autism is a special disorder that has unique strengths, not just weaknesses and limitations.<br style=\"\"><br style=\"\">After completing this course we hope to have modified or changed your perspective when it comes to interacting with an individual with autism.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Autism spectrum, sensory therapy, behaviour management", 
    "price": "35.00", 
    "instructors": "Robyn Papworth", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418134_1872_2.jpg", 
    "course_url": "https://www.udemy.com/what-is-autism-sensory-integration-and-behaviour-management/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T09:39:05Z"
}