{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><strong><em><em><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></em></strong><br></strong></p>\n\n<p>  \t<strong>About this Course:</strong>  </p>\n\n<ul>  \t<li><em><strong>1,000+ Students Within 1 week of Hitting the Udemy Market Place  \t</strong></em></li>  \t<li><em><strong>19 Lectures packed full of Priceless Advice  \t</strong></em></li>  \t<li><em><strong>Tons of 5-Star Reviews from very happy students in my course  \t</strong></em></li>  \t<li><em><strong>All future extra lectures and upgrades are always included for free  \t</strong></em></li>  \t<li><em><strong>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!  \t</strong></em></li>  \t<li><em><strong>Regular free surprise bonuses to increase your Knowledge of Autism even more!  \t</strong></em></li>  \t<li><em><strong>30 Day 100% Risk Free Offer!</strong></em></li>  </ul>\n\n<p><strong><em><br></em></strong></p>\n\n<p>  \t  Dear Parent,  </p>\n\n<p>  \t      Autism is a very unique developmental disorder for which there is no cure. The autism spectrum is extremely wide so the disorder can manifest itself in a variety of ways and each case will be particularly unique to the individual.  </p>\n\n<p>  \tDid You Know:  </p>\n\n<p>  \t<strong>\"1 out of every 88 children born in the USA are diagnosed with Autism.\"</strong>  </p>\n\n<p>  \t<em><strong>\"Research indicates that early identification is associated with dramatically better outcomes for individuals with autism. The earlier a child is diagnosed, the earlier the child can begin benefiting from one of the many specialized intervention approaches to treatment and education.\" - Autism Society of America</strong></em>  </p>\n\n<p>  \t<strong>Autism's Now a Worldwide Epidemic!</strong>  </p>\n\n<p>  \tDid you know that recent studies have shown there's currently what the media are referring to as a \"worldwide autism epidemic\".  </p>\n\n<p>  \tIn fact, based on official figures, more than <strong>1.5 million people are affected in the United States alone</strong>, with one in every 150 children diagnosed.  </p>\n\n<p>  \t<strong>But that's just the tip of the iceberg...</strong>  </p>\n\n<ul>  \t<li><strong>In terms of developmental disabilities, autism is the third most common (only mental retardation and cerebral palsy rank ahead of it)</strong></li>  \t<li>Families with one autistic child have a 2 to 8 percent chance of having another autistic child</li>  \t<li><strong>Autism occurs more often than childhood cancer or cystic fibrosis</strong></li>  \t<li>Boys are three or four times more likely to be diagnosed with an ASD</li>  \t<li><strong>Mental retardation is present in 75-80% of individuals with autism</strong></li>  </ul>\n\n<p>  \t<strong>Those figures should make EVERYONE take notice...</strong>  </p>\n\n<p>  \t<strong>But there is good news...</strong>  </p>\n\n<ul>  \t<li><strong>When autism is detected and treated early disruptive behaviours can be minimized and costs associated with treatments can be reduced by 66%</strong></li>  </ul>\n\n<p>  \tThis course is designed for people who are caregivers for autistic individuals( Parents and Educators) - particularly children and those that might be on the autism spectrum. This class is designed to help you understand the world of autism, spot the signs and/or symptoms of the autism spectrum so that you can help someone living with autism to live a richer life. Some basic knowledge of autism and the autistic spectrum would be helpful but is not an absolute necessity when registering for this course.  </p>\n\n<p>Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already have a Udemy course</strong> </p>\n\n<p> In this Course I will teach you just how to: </p>\n\n<p> <strong>End The Frustration That Autism Has Brought Into Your Life and Successfully Raise a Child on The Spectrum.</strong> </p>\n\n<p> \"A Comprehensive Course Revealing The Latest Autistic Discoveries\" <br></p><p>  \t  Some people on the autism spectrum are very high functioning and can communicate their needs and emotions easily, while other individuals on the autism spectrum seem to be trapped in a daydream - unable to communicate their needs and wants or emotions, effectively.  </p>\n\n<p>  \t<strong>SEE WHAT STUDENTS ARE SAYING...</strong>  </p>\n\n<p>  \t<em>\"Great for Parents New to Autism\"</em>  </p>\n\n<p>  \t<em>\"It provides a wealth of information for parents that have autistic kids. I think it lacks in discussing adults with autism and how we think on certain issues. As someone who is on the Autism Spectrum I think the course is missing some details about us. But does provide good resources for a starting point.\" <strong>Joshua Alexander</strong></em>  </p>\n\n<p>  \t<em><strong>\"</strong></em>Great course and loads of helpful information, I have an adult son with Asperger's Syndrome, a cousin with Asperger's syndrome and a teenage nephew with Asperger's syndrome, your course will be very insightful for all those first time parents of children with Autism and for psychology students, well done\" <strong>Elaine Montalto</strong>  </p>\n\n<p>  \t<em><strong>\"</strong>Positive application of knowledge on a topic that impacts so many, with utmost tact</em>  </p>\n\n<p>  \t<em>\"This lecture is broken in modules that cater to every important key point regarding the disease. It is presented in an unbiased manner, but within clinical context limits. Professor Cliette opens this discussion with the open minded attitude anyone who's cares for someone with Autism would appreciate. [He] does not condemn the members of the Autistic community, he just explains what methods work and do not, as well as how it develops, works, and medical background. I can appreciate his tactfulness conveyed throughout the course. He goes one step forward and brings about methods of adjustment publicly and educationally so it will cater to the individuals personal need. The course is extremely educational presented in an informative fashion. The quality of audio is impeccable and the resources accompanying the lecture is perfect for both auditory learners and those who must read it. It also provides a break between senses, to avoid burn out. Information provided was well presented and showed the supporting data and studies from which the information was taken from. What I loved the best was the ending, Cliette goes one step forward and provides a list of organizations where individuals who may want to do further research can go to.\" <strong>Courtney</strong></em>  </p>\n\n<p> \"Shedding New Light On Such A Complex And Puzzling Disorder!\" <br></p><p>  \t   This makes it very difficult to live and function in “normal\" society. Children with autism often have trouble distinguishing the difference between emotions and reading facial expressions. For example, someone laughing might make an autistic child smile, someone crying would elicit the same response.  </p>\n\n<p>  \t<strong>So, you've read this far! Thank you. </strong>  </p>\n\n<p>  \t  This course is designed to help individuals understand the world of autism so that they can help a child cope with this developmental disorder and achieve as much in life as possible. You will learn the skills and information necessary to help an autistic child/adult better understand the world and their place in it.  </p>\n\n<p>  \t<strong>You Will Learn All of the Following: </strong>  </p>\n\n<ul>  \t<li>You will learn About the autism spectrum and what it means to be autistic</li>  \t<li>You will learn About various therapeutic treatments and methods to help teach someone with autism how to better communicate and relate to the world</li>  \t<li>You will understand How to deal with a child's tantrums and emotional outbursts in an effective and caring way, so that the child might learn how to express themselves in a more calm and collected fashion</li>  \t<li>You will learn How to effectively express emotion and show autistic children that they are loved - without sending them into sensory overload</li>  \t<li>You will learn About all the various educational programs and schools that can help an autistic child or autistic person learn to function at their highest level in society</li>  \t<li>You will learn How to find the best doctors for someone's needs - including a pediatrician, physician, clinical psychologist, and speech therapist</li>  \t<li>You will learn How to recognize the symptoms of autism</li>  \t<li>You will learn How to establish links with communication between yourself and someone with autism</li>  \t<li>And Much Much More........</li>  </ul>\n\n<p>  \t  You will be able to provide them with security, love, and an emotional connection that they might not have had otherwise.  </p>\n\n<p>  \t  You will understand the various therapeutic treatments used to help lessen the symptoms of autism so that a child/adult can better communicate their needs both physical and emotional to their caregiver.  </p>\n\n<p>  \t<strong> As with all my courses:</strong>  </p>\n\n<ul>  \t<li>the initial low price will increase shortly - the course is currently $397, but will next increase to $497</li>  \t<li>you have unlimited lifetime access at no extra costs, ever</li>  \t<li>all future additional lectures, bonuses, etc in this course are always free</li>  \t<li>there's an unconditional, never any questions asked full 30 day money-back-in-full guarantee</li>  \t<li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li>  </ul>\n\n<p>  \t  Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...  </p>\n\n<p>  \t<strong>Scroll up and Enroll Now! </strong>  </p>\n\n<p>  \t<strong>All future updates to this course are free - you are \"locked-in\" at the current low price of $297 - but you will never pay more if you enroll today at the introductory low price.</strong>  </p>\n\n<p>  \t  And there's a 30 day absolutely no questions asked full money back guarantee - my personal promise of your happiness and satisfaction! You really cannot lose!  </p>\n\n<p>  \t<strong>Every minute you delay is actually COSTING you money ....</strong>  </p>\n\n<p>  \t  Enroll now!  </p>\n\n<p>  \t  P.S. I should also point out that it would cost you hundreds or even thousands of dollars to get these strategies through counselling. The current price was set so low to make it a total no-brainer for you. I am passionate about making these advanced productivity strategies affordable to absolutely everyone who can benefit from them.  </p>\n\n<p>  \tBONUS: Get a free PDF copy of my  Amazon Best Selling  Book<strong><em> \"Autism: Entering the Secret Universe: Understanding Autism, Autistic Children, Autistic Adults, Autism Spectrum Disorders\"</em></strong>  </p>\n\n<p>  \t  Don't forget to check out the free preview lectures to sample my course. Are you ready to learn?  </p>\n\n<p>  \t<strong>This will be a truly interactive course with additional bonus routines added , inspired by the seasons and based on feedback from students</strong>  </p>", 
    "end_date": null, 
    "title": "Autism Awareness Course for Parents - Autism Training", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/328928_bf1d_2.jpg", 
    "course_url": "https://www.udemy.com/understanding-autism/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T04:21:43Z"
}