{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Baby massage is fun and easy and a great way to bond with your baby. I&#039;m Laura Lacey, a licensed massage therapist and certified baby massage instructor. In this online class I will teach you everything you need to know to massage your baby from head to toe, as I guide you step by step through various massage techniques. Not only is baby massage a great activity for you and your little one, it has many wonderful benefits - and your baby will love being massaged!  </p>  <p style=\"\">  \t  This online baby massage class is appropriate for babies ages 6 weeks to 6 months, and is great for Moms, Dads and caregivers. Each lecture has a video that covers a specific body part or technique, so you can follow as I demonstrate with real parents and their babies.  </p>  <p style=\"\">  \t<strong style=\"\">What will you learn?</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Basic principles of baby massage and over 30 massage strokes</li>  \t<li style=\"\">The best time to massage your baby.</li>  \t<li style=\"\">How often and for how long you should massage your baby.</li>  \t<li style=\"\">When baby massage is contraindicated.</li>  \t<li style=\"\">A safe and soothing massage, fun and energizing stretches</li>  \t<li style=\"\">Techniques to address common ailments such as colic, gas, teething and congestion.</li>  </ul>", 
    "end_date": null, 
    "title": "Baby Massage - \"The Gift of Love\"", 
    "price": "50.00", 
    "instructors": "Laura Lacey", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49108_bd8a_5.jpg", 
    "course_url": "https://www.udemy.com/baby-massage-the-gift-of-loving-touch/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-09T15:44:16Z"
}