{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Quality relationships are fundamental to success at home and work but the problem is that we don't have a very good set of tools for understanding them. When things go well we use phrases like 'we just get along', or 'we just seem to click' - and when things go wrong, we say 'its just a clash' or 'she drives me mad' or 'its no good, there's no point talking to him!'.</p><p>So, what if you had a better way of making sense of things? Just like any skill you've learnt in life - it started with understanding - the notes in music, the ingredients in a recipe, the tools for DIY, the rules of the road. In this course you'll learn a brilliant way of making sense of the people situations in your life.</p><p><strong>Improve your impact and effectiveness at home and work</strong><br style=\"\"></p><p>Whether you're interested in people or just find some of them really difficult(!) - change is possible once you understand what's going on. This is true for men and women, young or old.</p> <ul> <li>Discover the three effective psychological 'states' that we all have</li> <li>Learn to read these 'states' in yourself and others</li> <li>Reduce the time you spend in the ineffective 'states'</li> <li>Understand how to better influence others<br style=\"\"><br style=\"\"> </li> </ul> <p><strong>The good news is that you already have what it takes to be successful in your relationships - it's about recognising the effective states and spending more time in them - a 10% increase could make the world of difference to you.</strong></p><p><strong>Contents and Overview</strong></p><p>Within just two videos you'll get the idea. That's how simple it is. By the end of Section One, you'll be starting to make connections to your own life.</p><p>In Section Two you'll gain insights to your success at work - what is your impact with your boss and co-workers? You'll consider the same question about home - appreciating why things work well and why at times they might be difficult. If you're getting into arguments with people, Section Two is where you'll find out why and we'll give you some proven tips for getting out of this.</p><p>The course will help you to understand both whats going on AND what you can do about it.</p><p>In Section Three you'll learn techniques to improve the following: Parenting. Teenagers. Motivating a team. Difficult conversations. Giving a presentation or public speech. Surviving a toxic workplace. Long term relationships.</p><p>The course material has been created for Udemy by a team of professional psychologists with over 20 years experience of using the model.</p><p><strong>Once you know what's going on between people - then you can do something about it. You can enjoy more successful relationships at work and home.</strong></p>", 
    "end_date": null, 
    "title": "Be More Successful in Your Relationships - at Work and Home!", 
    "price": "50.00", 
    "instructors": "Real Life Psychology", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/540232_94c6.jpg", 
    "course_url": "https://www.udemy.com/be-more-successful-in-your-relationships-at-work-and-home/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-29T13:49:51Z"
}