{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Navigating the world of youth sport can be challenging if unprepared. Otherwise great parents can end up making errors that can comprise the many benefits of being involved in sporting activities. This course aims to help you overcome this challenge with information, tools and planning.</p><p style=\"\"><em style=\"\">Become the best sport parent you can be:</em></p><ul style=\"\"><li style=\"\">Learn how to communicate effectively with your young athlete</li><li style=\"\">Discover strategies for managing your own emotions</li><li style=\"\">More clearly define your role as a sport parent</li><li style=\"\">Learn the elements of a “good push&quot;</li></ul><p style=\"\">Master your sport parenting role by utilizing information and strategies supported by recent research. Gain confidence in guiding your young athlete toward their sporting goals. Sport is an amazing training ground for important life lessons as well as physical skill development. Don&#039;t miss out on getting the most, for both of you, from your child&#039;s sport involvement.</p><p style=\"\"> If you want an overview of common sport parenting issues, with a touch on some special challenges like quitting and injuries- then this course is for you. </p><p style=\"\"><strong style=\"\">Contents and Overview</strong></p><p style=\"\">This course contains 19 lectures of mostly video and some text format. It&#039;s designed for anyone who wishes to be more effective in their sport parenting role. It is suitable for parents of small children, teens and young adults. It doesn&#039;t matter whether your child is a recreational or elite athlete, by the end of this course you will be able to better navigate the world of youth sport.</p>", 
    "end_date": null, 
    "title": "Becoming a Winning Sport Parent", 
    "price": "30.00", 
    "instructors": "April Clay", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419894_a2e3_3.jpg", 
    "course_url": "https://www.udemy.com/becoming-a-winning-sport-parent/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T05:12:09Z"
}