{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t   I want to give you a completely new approach to love and dating.  </p>  <p>  \t This course is going to help you master every aspect of romance from flirting, to seduction, to attraction, to connection.  </p>  <p>  \t Most importantly, <strong style=\"\">this course will show you exactly how to attract the perfect partner for you.</strong>  </p>  <p>  \t Want to know how?  </p>  <p>  \t It all comes down to body language. I will teach you the nonverbal science of love.  </p>  <p>  \t Here&#039;s my promise to you:  </p>  <ul style=\"\">  \t<li>When you understand the body language of dating, it will be like going on dates in high definition. You will be able to spot missed cues, see hidden emotions and know exactly how to gauge your connection. </li>  </ul>  <p>  \t Each lesson has action steps, tactical solutions and real life examples. We use every tool available to deliver the best possible course to you. We have a live audience in the sections that need it, example reality TV show clips, fascinating science and interesting challenges.  </p>  <p>  \t I can&#039;t wait to see you in the course. And, can I be corny for a moment? Please humor me and join me on this dating adventure.  </p>  <p>  \t *<em style=\"\">This course is for both men and women--in fact you will get a view into how the opposite sex approaches the dating world.</em>  </p>", 
    "end_date": null, 
    "title": "Body Language of Love and Dating", 
    "price": "50.00", 
    "instructors": "Vanessa Van Edwards, Science of People", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240170_6f33_2.jpg", 
    "course_url": "https://www.udemy.com/body-language-of-love-and-dating/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-09T17:26:30Z"
}