{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you the parent who is always playing \"bad cop\" to your spouse's \"good cop\"? You worry that all the disciplining is keeping you from building a close relationship with your kids.</p><p>Or maybe you're the fun parent – the one who horses around while the other parent gets things done. And while all the laughter is great, you wish your children would also see you as someone they could talk to about serious topics.</p><p>Or perhaps you had close connections with your children when they were younger, but as they grow, you find it harder to get past conversations about homework or chores. You'd love to find a way to connect with them on a more meaningful level.</p><p>Well, you can connect with your kids – whatever age they are – and build stronger bonds in ways that fit naturally with your busy family life. Using bucket lists as the backdrop.</p><p> In this course I cover:</p><ul><li>Methods for talking bucket list goals with your kids in age-appropriate, engaging manners</li><li>Ways to encourage collaboration writing shared bucket lists between family members</li><li>How to create a fun family night around bucket lists</li><li>Practical steps for integrating bucket list experiences and traditions into your family life</li></ul><p><strong> </strong></p><p><strong>Content Overview</strong></p><p>Geared toward parents with children of all ages, this 12-lecture course, totaling 45 minutes of video, makes understanding and using bucket lists to build a more supportive and connected environment in your home not only do-able, but fun.</p><p>Starting with methods and practices for engaging one-on-one with kids at different stages, you will learn how to bring the conversation of life goals into everyday settings. </p><p>Using these skills and interactions you will move toward bringing the entire family together to share, to dream and to make plans for experiencing those things most important to you.</p><p>Finally, you will see how to make use of family traditions and celebrations to heighten the experiences you share surrounding bucket list pursuits, adding to the positive family dynamics you have been creating.</p><p><strong>Expected Results</strong></p><p>Complete with worksheets, family time ideas and other resources, you will come away from this course with updated bucket lists for every member of your family – and a shared family bucket list to help your family make the best use of the years you have together. You will have plans on your calendar for special \"dates\" and outings, and even new traditions. </p><p>Once you take this course, the bucket lists you have written will continue providing you new, meaningful ways for spending time together.  And the bonds that you strengthen within your family through writing your lists will grow as you fulfill those lists in the months and years to come.</p>", 
    "end_date": null, 
    "title": "Build Stronger Bonds Writing Family Bucket Lists", 
    "price": "50.00", 
    "instructors": "Lara Krupicka", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569750_78f4_3.jpg", 
    "course_url": "https://www.udemy.com/bonding-through-bucket-lists/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T00:57:49Z"
}