{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    &quot;Gabriel proposes a change in the educational paradigm by focusing on students&#039; parents, suggesting a highly positive kind of involvement in the educational process, making them reflect on the nature of their beliefs, exposing and proposing positive changes to the cognitive biases, preconceptions, equivocal involvements, misinformation, and most importantly the projection of parental emotions onto their children. Ultimately, his work focuses on the often ignored - and fragile - link between the student, parent, and team of educators. Extremely useful and arising from a beautiful insight!&quot; - Dr. Isaac Joukhadar  </p>  <p style=\"\">  \t    &quot;A clear and effective work, with the goal to motivate parents and children to execute an efficient strategy of Psychopedagogy, in the search for the success of students. Considering the psychology of today&#039;s youth, this work approaches methods that enhance discipline, affection, motivation, work ethic, and a balanced equation between study and hard work.&quot; - Dr. Roseli Rodolfo  </p>  <p style=\"\">  \t        This course includes clear and concise, time-tested guidance (for busy parents) on how to help their children:  </p>  <ul style=\"\">  \t<li style=\"\">Get motivated</li>  \t<li style=\"\">Gain hope</li>  \t<li style=\"\">Become more confident</li>  \t<li style=\"\">Set their sights higher</li>  \t<li style=\"\">And do better in school as a result</li>  </ul>  <p style=\"\">  \t        Additionally, the course includes:  </p>  <ul style=\"\">  \t<li style=\"\">A system for supporting students (building and managing an academic team - even for very busy parents), including insights based on over a decade of experience in the education industry</li>  \t<li style=\"\">Straightforward suggestions taking student psychology into account</li>  \t<li style=\"\">And effective strategies for promoting success</li>  </ul>  <p style=\"\">  \t        With this new arsenal of tools, parents will be empowered to help students get inspired to pursue their dreams with confidence and motivation.  </p>", 
    "end_date": null, 
    "title": "Busy Parents: Lead Your Children To Success", 
    "price": "40.00", 
    "instructors": "Gabriel Silva", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161662_764b_5.jpg", 
    "course_url": "https://www.udemy.com/busyparents/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-11T07:49:00Z"
}