{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course focuses on the basic questions about caregiving to older adults. You will learn facts about the 65 and over population. This product is organized with Content, Objective tests, and Exercises that place you in the position of a caregiver. Animated Engagement scenarios featuring the Ayudar family illustrate the central theme of each module.</p>    <ul><li>Distinguish between <strong>myths and facts</strong> of older adults</li><li>Define <strong>successful aging</strong></li><li>Identify <strong>physical health issues</strong> in aging</li><li>Identify <strong>mental health and cognitive concerns</strong> in aging</li><li>Negotiate a <strong>balance between work and caregiving</strong></li><li>Construct a <strong>balance between caregiver stress and rewards</strong></li><li>Arrange for <strong>professional assessments and caregiver resources</strong></li><li>Identify family issues involved in consumer-directed and community-<strong>directed care</strong></li><li>Identify <strong>legal and financial planning</strong> concerns</li><li>Explore different <strong>living arrangements</strong></li></ul><p>Take this course if you desire a systematic introduction to the caregiving responsibility. Over 34.2 million adult American provide unpaid care to an adult 50 or older for an economic value north of $237 billion. </p><p><strong>If you are a caregiver</strong>, you are not alone. This course will provide you with the information you need to know the resources available to you and your care recipient. Also, learn about the health concerns that you should be concerned about as your care recipient ages.  <strong>If you are interested in gerontology</strong>, this course will get you up to date on the latest statistics and projections concerning elder care in the United States. <strong>If you are aging</strong>, you will find the outline of a road map for successful aging including social, mental, and physical exercise.</p>                  ", 
    "end_date": null, 
    "title": "Caregiving for Aging Parents: Your Stress & Quality of Life", 
    "price": "20.00", 
    "instructors": "MAWMedia Group, LLC", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707030_a462.jpg", 
    "course_url": "https://www.udemy.com/caregiving-for-aging-parents-your-stress-quality-of-life/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T16:32:12Z"
}