{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  The Patient+Family Care’s Course titled &quot;Caregiver Guide to Baby Friendly Certification&quot; walks professionals through the ten steps for successful breastfeeding outlined by UNICEF and WHO.  </p>  <p style=\"\">  \t<strong style=\"\">  This course was designed for several reasons</strong>:  </p>  <ul style=\"\">  \t<li style=\"\">Frequent requests from hospitals and nursing staff to have this course available online (as it has been offered in live presentation multiple times)</li>  \t<li style=\"\">To help participants better understand what Baby Friendly means to patients, to bedside caregivers and to organizations.</li>  \t<li style=\"\"> To fulfill the baby friendly certification education requirement of learning the global initiative of Baby Friendly Practices</li>  \t<li style=\"\">Provides caregivers with a more in-depth understanding of the importance of this initiative</li>  \t<li style=\"\">Fosters discussion and questions for the student to participate in some self reflection and additional study</li>  </ul>  <p style=\"\">  \t The course includes a pre and post assessment quiz, video didactic material, some discussion points and some entertaining media clips. It will take about one hour to complete the full course and  hopefully will foster additional education requests from Patient+Family Care.  </p>  <p style=\"\">  \t<strong style=\"\">What have others said?</strong>  </p>  <p style=\"\">  \t<em style=\"\">&quot;Sara demonstrates a passion for families and creating a positive hospital experience. The quality of the experience that families have in the period after the birth of a child can provide a supportive foundation for the family’s future. All caregivers that care for women, infant and families in the postparum period will benefit from the strategies that Sara emphasizes in the education she provides. Her style is warm and casual, peppered with personal stories of how the strategies have been effective. Sara is approachable and positive, making her presentations so enjoyable and beneficially.” ~M. Kerr, Nursing Instructor</em>  </p>  <p style=\"\">  \t<em style=\"\">“This presentation was extremely helpful! To hear Sara’s honest feedback about how she was initially apprehensive about Baby Friendly made me feel so much better! I had the same apprehension but never wanted to admit it. Sara speaks with ease and keeps students engaged and I always look forward to her presentations.” ~G. Roberts, Birthing Center RN</em>  </p>  <p style=\"\">  \t<em style=\"\">“I love that Sara’s passion for her presentations shine through while she speaks. She is knowledgeable and excited to share her experience and passion with others.” ~R. Tyler, NICU RN</em>  </p>", 
    "end_date": null, 
    "title": "Caregiver Guide to Baby Friendly Certification", 
    "price": "45.00", 
    "instructors": "Sara Mosher", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239678_44a3_4.jpg", 
    "course_url": "https://www.udemy.com/patientfamilycare_caregiver-guide-to-baby-friendly-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-08T21:52:12Z"
}