{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>+++++++++++</em><br></strong></p>\n\n<p><strong><em>Note: Over 1900 students with over 54+ Great Reviews.<strong><em>See what students are saying in the review section. </em></strong></em></strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over 21,000 happy students from 159 Countries.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong><em>The course also has a thriving Facebook networking group</em></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>+++++++++++</em><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This program is perfect for coaches, counselors, facilitators or anyone </strong>who want to give their clients the greatest gift of all—loving, fulfilling, healthy relationships! Coach both singles and couples to create enlightened relationships by offering life-changing relationship workshops. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Facilitating workshops is a great way to grow your business. </strong>People tend to buy products and service from practitioners and brands they know, like and trust. Build a relationship with your future clients through offering workshops, which demonstrate your expertise and increase the value you offer. Plus, you reach a greater number of people and can generate more revenue in a shorter period of time!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The Relationship Workshop Facilitator Certification provides a blueprint for conducting relationship workshops. </strong>You will learn powerful tools and tips for workshop structure and facilitation. You’ll also receive their Enlightened Relationship program, in its entirety, including the content, outlines and workbook material so that you can start facilitating workshops right away. The comprehensive workshop content covers all aspects vital to creating happy, fulfilling relationships, including: how to change patterns, roles, and beliefs, communication strategies that really work, the secret to speaking the languages of love, the power of forgiveness, how to create happiness, the importance of a relationship vision, and much more.</p>", 
    "end_date": null, 
    "title": "Certified Relationship Workshop Facilitator for Life Coaches", 
    "price": "30.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690016_060e.jpg", 
    "course_url": "https://www.udemy.com/certified-relationship-workshop-facilitator-for-life-coaches/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T02:10:51Z"
}