{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>OVER 500 HAPPY STUDENTS HAVE ENROLLED, AND ARE ONE STEP CLOSER TO COMMUNICATING BETTER WITH THEIR FAMILIES! FEWER SHOUTING MATCHES AND MORE FAMILY BONDING!</p><p><em><strong>\"Practical tips that I can implement today!</strong></em></p><p><em>The instructor explains clearly and covers each segment with detailed examples that I can relate and learn from. What I like most about in this course is that I learn the proper way of sending text messages even to family members and not to assume things. A powerful and thought provoking course! Thank you, Nazir!\" - KC Tan</em></p><p>========================================================================</p><p><strong>COURSE UPDATEs</strong></p><p>Gain full access to regularly updated content at ZERO additional charge after enrolling. This course will be updated with fresh information, bringing students constant value!</p><p><strong>Update 1:</strong> New Lecture Added! - We look at how to overcomecultural and language differences when communicating.</p><p><strong>Update 2:</strong> New Lecture Added! - We cover how active listening makes conversations shorter and less frustrating.</p><p>========================================================================</p><p><strong>Course Price</strong></p><p>Price will increase to $79 after next lecture is added</p><p>========================================================================</p><p>The objective of this course is to help others <strong>reduce shouting matches and improve communication between family members</strong><strong>.</strong></p><p>Most families have problems communicating with one another. This is especially true between parents and their children. <strong>This course reveals how I managed to bridge that seemingly inevitable gap, and built peaceful lines of communication with my parents, spouse, sibling and relatives.</strong></p><p>I started improving my communication skills over 17 years ago, and have been successfully interacting with my family, friends and business associates. <strong>I'm now sharing the skills that have allowed me to forge close bonds with my loved ones.</strong></p><p>I've tested different theories and know what works when it comes to communicating with my family. The information in <strong>this course covers different aspects of communication, and goes into real-life examples of what I've been through with my family.</strong></p><p>So what can you expect to learn from this course?</p><ol><li>Learn communication skills I've used to maintain a close bond with my family for over 17 years.</li><li>Find out how I not only avoided fighting with my family, but <strong>how we still meet at least once a week and grow closer every time!</strong></li><li>Learn practical tips and exercises that have allowed me to <strong>communicate peacefully and lovingly with my spouse</strong></li><li>Discover the <strong>methods I've used to calm heated arguments</strong> down, and eliminate them entirely</li><li>How I've lived in harmony with each of us having shortcomings like <strong>being short-tempered, hot-headed, introverted and even rebellious</strong></li><li><strong>How I grew close with my in-laws who don't even share the same first language!</strong></li><li>The skills I've used to turn screaming matches into peaceful discussions</li><li>and more as the course gets regular updates</li></ol><p>Remember that this course covers the <strong>tested and proven techniques I've used to maintain a close bond with my family (parents, spouse, sister and relatives) for over 17 years.</strong></p><p><strong>You will not find fluff. Only powerful substance backed up by life's experiences. </strong>I share practical stuff and real life stories.</p><p>If you're frustrated with not getting through to your family members, this course may help you find out why, and what you can do about it!</p><p>If you wish to get closer with your spouse, stop shouting matches with your parents and have a better bond with your sibling, this might be what you're looking for.</p><p>Last but not least, this course comes with a 30-day guarantee!</p><p>What this course is NOT:</p><p>I do not provide coaching on how to improve your communication with your family. I'm sharing what worked for me. I do not know your family and it would be unwise for me to try advising you in that aspect.</p><p>There are no unethical or immoral \"techniques\" taught here. Those looking for shortcuts to building a closer bond with their families will not find them here.</p><p><strong>Stop wondering if it's worth it and start doing something about your situation! Learn practical tips within minutes! What took me years to acquire is now yours to take</strong></p>", 
    "end_date": null, 
    "title": "Communicating Better as a Son, Brother and Husband", 
    "price": "20.00", 
    "instructors": "Nazir Tan Amir", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/463084_b516.jpg", 
    "course_url": "https://www.udemy.com/family-communication/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-30T15:38:40Z"
}