{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">Atraer pareja no es lo mismo que atraer la pareja correcta</em></strong>. La diferencia se encuentra en que <em style=\"\">solo con una pareja correcta podrás construir una relación plena y feliz.</em>  </p>  <p>  \t<em style=\"\"><strong style=\"\">El amor ya no es más una cuestión de suerte!</strong></em> De que si la tienes, te toca, y si no la tienes, a sufrir.  </p>  <p>  \tHoy a partir de modernos procesos de coaching <em style=\"\"><strong style=\"\">puedes aprender a reconocer cuando una persona puede ser, o no, una pareja correcta</strong></em> para ti. Aún antes de que formes pareja con ella. Imagínate todo el tiempo y sufrimiento que te puedes ahorrar de esta manera.  </p>  <p>  \tCreemos que existen principios básicos para vivir con efectividad, y que las personas solo pueden experimentar un verdadero éxito y una felicidad duradera en una pareja cuando aprenden esos principios, y los integran a su carácter básico.  </p>  <p>  \tTodos nuestros cursos y procesos de coaching fueron creados para que desarrolles tu carácter, y no que simplemente aprendas algunos trucos de magia o cosmética, para conseguir lo que hasta ahora no has podido.  </p>  <p>  \tEsta es <strong style=\"\">MI PROMESA</strong>:  </p>  <ul style=\"\">  \t<li>Te acompañaré en un proceso de coaching para singles, para que salgas de aquí sabiendo exactamente tu propósito en la búsqueda de una pareja, <strong style=\"\">aprendas a reconocer cuando una persona puede ser, o no, tu pareja correcta</strong> y sepas darte cuenta que caminos te pueden llevar a tu meta.</li>  </ul>  <p>  \tEste es un <strong style=\"\">curso online práctico</strong>. La idea es que desarrolles aquellas habilidades mentales y emocionales que te permitan atraer tu pareja correcta, y no simplemente una pareja. Por eso, se requiere de tu participación activa, dentro de algunas lecciones, de forma individual, y con otras personas. De esta manera, podrás ver como operas en tu realidad.  </p>  <p>  \t  Estoy muy entusiasmado por encontrarte dentro del curso, y comenzar juntos este fascinante y divertido viaje de aprendizaje hacia tu pareja correcta.  </p>", 
    "end_date": null, 
    "title": "Como Atraer la Pareja Correcta - Nivel 1", 
    "price": "20.00", 
    "instructors": "Esteban Irigoyen", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/411102_6b43_4.jpg", 
    "course_url": "https://www.udemy.com/como-atraer-la-pareja-correcta/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-02T16:59:30Z"
}