{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p>    <p>Learn the theory, communication techniques, and exercises you will need to transform your relationship out of conflict and frustration, and into deep understanding and connection.</p>    <p><strong>What you will Learn</strong></p>  <ul><li>A new way to communicate.</li><li>Why you were attracted to one another. And it is not for the reasons that you think.</li><li>What is really happening in your brain. Understanding this will help you find true happiness.</li><li>How your Defenses protected you in childhood, but block you from connecting in your relationship today.</li><li>Why you are having Conflict. The purpose of your Conflict. And what you need to do instead.</li><li>How to solve the Greatest Mystery of your relationship. Once you learn this, everything will begin to fall into place.</li><li><strong></strong>The things you do when you feel stressed are the things that “trigger” your partner the most. (The Turtle and Tiger Dance.)<strong></strong></li><li>How to stop blaming your partner for the pain you experienced in childhood.</li><li><strong></strong>How the Compassion Dialogue can reveal your unconscious Growth and Healing blueprint that lives in the unconscious part of your mind.<strong></strong></li></ul>                          <p><strong> </strong></p>          <p><strong>Content and Overview</strong></p>    <p>Have you ever wondered if the fights you’re having in your relationship could mean that you chose the <em>wrong</em> partner?</p>    <p>Perhaps you’ve been slipping into a HOT relationship, full of criticism and reactivity. Or maybe you’ve settled for a COLD relationship, where you live distant lives, lacking passion and intimacy.</p>    <p>Are you one of the 50 percent of Americans who are seriously thinking about divorce? If you answered YES to any of these questions, I want you to understand that breaking up is not inevitable. There is a solution.</p>    <p>In this course I’ll teach you what’s really happening in your relationship and what you can do about it. And if you are just beginning a relationship, this course will show you how to navigate through the Power Struggle when it hits during the next 2 years.</p>    <p>I’ll be teaching this course in a way that I hope you’ll find interesting. You won’t see my talking head. Instead, I’ve animated each video lesson with moving words and images. I hired a professional voiceover for the script and added music to keep you alert. I created 12 short videos (4-7 minutes) to break up the information into manageable chunks.</p>    <p>I’ve packed years of my professional experience (working with couples and presenting workshops) into each lesson. It is very important to follow these lessons in order. The material is complex so I start easy and end with a bang! You will benefit from watching these videos many times. I provide many exercises and handouts to support your work.</p>    <p>In last lesson you’ll witness a real couple using the Compassion Dialogue to unlock the mystery of a previous frustration that led to conflict. I added subtitles during the demonstration so you understand exactly where they are in the process. You can download the Compassion Dialogue script and follow along as well.</p>    <p>By the end of this course you understand your relationship journey from the moment you left the womb to your present day experiences. You will be able to identify your wounding and what you need to heal. You’ll discover what parts of yourself you gave up to survive in your family system. You’ll understand that you chose your partner specifically to teach you how to recover your Lost Parts. You’ll be able to communicate in a new way to reveal your unique relationship blueprint for growth and healing. And you will finally have a plan to divorce-proof your relationship, and give your partner the gift of forever.</p>", 
    "end_date": null, 
    "title": "Complete Relationship Bootcamp for Couples", 
    "price": "20.00", 
    "instructors": "Ralph Butcher", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690706_e492.jpg", 
    "course_url": "https://www.udemy.com/how-to-improve-your-relationship-today/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T03:03:44Z"
}