{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Este curso es para cualquier pareja que sienta que no está viviendo toda la felicidad que alguna vez soñó, o los resultados que deseaba en su relación. También es parejas que sientan que han perdido la chispa, o que no tienen la conexión que solían tener, o que podrían entenderse mejor, o que falta comprensión en la relación.  </p>  <p style=\"\">  \t            En este curso compartiremos las <strong style=\"\">claves, procesos y herramientas de coaching de pareja</strong> necesarias para que desarrolles las <strong style=\"\">habilidades </strong>necesarias para que <strong style=\"\">logres conectarte con tu pareja</strong>, posiblemente a un nivel que no hayan logrado anteriormente.  </p>  <p style=\"\">  \tEntre ellos dispondrás de:  </p>  <ul style=\"\">  \t<li style=\"\"><span style=\"\">3 evaluaciones on-line, para ver en que estado te encuentras en este momento,</span></li>  \t<li style=\"\"><span style=\"\">7 procesos de Coaching, para que puedas desarrollar habilidades de manera que logres conectarte más efectivamente con tu pareja.</span></li>  </ul>  <p style=\"\">  \t            No precisarás conocimiento, ni experiencia previa de ningún tipo.  </p>  <p style=\"\">  \t        Este es un curso práctico, a lo largo del curso te plantearemos ejercicios, evaluaciones on-line y procesos de coaching de pareja para que realicen. Es en la realización de los ejercicios donde se desarrollan las habilidades mentales y emocionales que les permitirán lograr una más efectiva conexión emocional en su relación.  </p>  <p style=\"\">  \t            Te incluimos evaluaciones on-line, además en formato de impresión, para que bajes, todos los materiales, procesos, herramientas, audios en mp3 que necesitas para el éxito en tu pareja.  </p>  <p style=\"\">  \t            Si bien el material pueden verlo en algunas horas, le facilitamos procesos como para que practiquen durante al menos 30 días, para que logren dominio de las técnicas y cambios perceptibles en la forma en que se relacionan.  </p>  <p style=\"\">  \t            En este curso te comparto las claves, procesos y herramientas que hicieron posible que hoy estemos más enamorados con mi esposa, que cuando estábamos de novios, luego de haber decidido divorciarnos. El coaching de pareja no solo logró salvar mi matrimonio, sino que permitió que aprendiéramos las habilidades para transformar nuestra relación, de ser miserable a ser inmensamente dichosa. Eso es lo que compartiremos contigo.  </p>", 
    "end_date": null, 
    "title": "Conexión Emocional con tu Pareja", 
    "price": "45.00", 
    "instructors": "Esteban Irigoyen", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281462_68a2_3.jpg", 
    "course_url": "https://www.udemy.com/conexion-emocional-con-tu-pareja/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-15T12:32:09Z"
}