{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Homework for kids is like having school, after school. It's comparable to your taking work home after an 8 hour work day, with 2-3 more hours of work to do by tomorrow. On top of that, children don't have the brain development for that level of seated focus for any given day. Kids require self-initiated movement, fun, and multi-sensory experiences. That said, <strong>there are ways to improve the homework experience, and to help your children enjoy the continued learning process,</strong> which is a welcome and achievable goal.</p><p>The homework demand is increasing every year and because of this more and more children are struggling to focus, to enjoy learning and to implement the teachings that the homework is supposed to reinforce.</p><p>This course is for parents of children of all ages who are struggling with homework, with staying focused in school and staying on top of their grades.</p><p>If your child has attention issues, acts out, in or out of school, is finding it difficult to follow your directions, then you and your family will benefit from taking this training.</p><p><strong>At the end of this training you will have:</strong></p><ul><li>Exercises for your kids to regain their focus and attention.</li></ul><ul><li>Keys to achieving positive discipline, a practice that eliminates conflict and power struggles between you and your kids.</li></ul><ul><li>Gained clarity concerning the true root cause of your child's problems and how to resolve them.</li></ul><ul><li>An assessment of your child's key areas of function and a way to ensure they perform optimally and at the appropriate level for their age / development.</li></ul><ul><li>Step-by-step tools to ending and preventing tantrums, meltdowns and power plays.</li></ul><ul><li>The most effective method to ending the negative cycle of behavior and the keys to helping your child create new, positive behaviors.</li></ul><ul><li><strong>Most importantly, you will have a child who LOVES learning, has increased curiosity to learn and actually ENJOYS homework time!</strong></li></ul>", 
    "end_date": null, 
    "title": "Conflict-Free Homework Time", 
    "price": "20.00", 
    "instructors": "Bek Wiltbank", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579396_bba6.jpg", 
    "course_url": "https://www.udemy.com/conflict-free-homework-time/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T19:56:37Z"
}