{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">When you&#039;ve just become a dad for the first time, everything is new. This course will give you a run down of what to expect when you&#039;re a new father and how to come out on top.</p><p style=\"\"><strong style=\"\">Learn From My Mistakes And Be The Best Dad And Partner You Can Be</strong></p><ul style=\"\"><li style=\"\">Learn about the emotions you will experience as a new dad,</li><li style=\"\">Why staying healthy is so important and how to manage it,</li><li style=\"\">Time management tips to help you not only spend more time with family, but on yourself too.</li></ul><div style=\"\"><strong style=\"\">My Confessions Will Guide You On The Right Path From Square One</strong></div><div style=\"\">Maybe you weren&#039;t fortunate enough to have guidance from your own father. Perhaps you want a second opinion from someone who&#039;s going through exactly what you&#039;re going through at the same time. Whatever the case, my lessons expose the truth about fatherhood for you to learn from.</div><div style=\"\">Confessions Of A New Dad details my experience as a new father, my mistakes and trials by fire along the way. I don&#039;t claim to be a perfect father, but I&#039;d like to share what I&#039;ve learnt so far with you. If you have any uncertainty about fatherhood and don&#039;t know who to turn to, let me be your guide.</div><div style=\"\"><strong style=\"\">Content and Overview</strong></div><div style=\"\">11 short and straight-forward lessons on fatherhood are in this course. No BS, no fluff. Just the truth about my experience. Us guys are renowned for not talking. It&#039;s just something we don&#039;t do. I&#039;m going to put that aside to help as many new dads as possible on their mission to be the best father and partner possible.</div><div style=\"\">This is followed by 3 quizzes (and counting) to help you consolidate your knowledge. This course is built for you guys. If there&#039;s anything else you want me to write about, let me know in the discussion section. My goal is to make it the biggest community of new dads as possible. The more new dads on the right path, the better it is for everyone.</div><div style=\"\"><strong style=\"\">Will you accept the mission?</strong></div>", 
    "end_date": null, 
    "title": "Confessions Of A New Dad", 
    "price": "35.00", 
    "instructors": "Johnson Kee", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/476528_cc75.jpg", 
    "course_url": "https://www.udemy.com/new-dad-confessions/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T22:43:45Z"
}