{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      This your <strong style=\"\">ultimate Couples Guide to discovering lasting Connection and Happiness within your relationship</strong>. During this course you will learn the tools to help you feel <strong style=\"\">SEEN, HEARD, and LOVED </strong>within your relationship.  </p>  <p>  \t<strong style=\"\">This course is for you if:</strong>  </p>  <p>  \t      You want to improve the passion and connection in your relationship.  </p>  <p>  \t      You want to learn what makes a healthy and happy relationship.  </p>  <p>  \t      You want to be SEEN, HEARD and LOVED in your relationship.  </p>  <p>  \t      You want to experience Happiness with your partner.  </p>  <p>  \t      This course is best done as a weekly activity with your partner.  Plan a time each week to listen to a lecture together and then practice the new tools during the week.  </p>  <p>  \t<strong style=\"\">You will learn:</strong>  </p>  <p>  \t      How to Become a Healthy and Happy couple  </p>  <p>  \t      The Benefits of being a Healthy and Happy couple  </p>  <p>  \t      The Art of Effective Communication  </p>  <p>  \t      How to put Forgiveness in Action in your Relationship  </p>  <p>  \tHow to create and encourage moments of Connection  </p>  <p>  \tSustain Consistent Happiness in your Relationship  </p>  <p>  \t<strong style=\"\">You will receive:</strong>  </p>  <p>  \t      Tools to assess and understand your Language of Love  </p>  <p>  \t      Tools to discover your Needs within a relationship  </p>  <p>  \t      Activities and Exercises to strengthen your Communication  </p>  <p>  \t      Activities and Exercises to discover lasting Connection and Happiness  </p>  <p>  \t      I invite you to start the journey to each other today.  Why wait?  This journey can begin today, right now.  What are you waiting for?  </p>", 
    "end_date": null, 
    "title": "Couples Guide: Connect and Be Happy in Your Relationship! ", 
    "price": "25.00", 
    "instructors": "Jennifer Sanford", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353420_011e_3.jpg", 
    "course_url": "https://www.udemy.com/couples-guide-discover-lasting-connection-and-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T00:51:43Z"
}