{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Courageous Conversation is a clear and concise 10 step process that will guide you towards conquering your fears so that you can move towards a fulfilled life. This course is Part One of a two part Series that is designed to help you move your life forward with greater confidence. </p><p>This course is led by Chris Hogan, a successful Executive Coach to business owners and senior management. He is also the Practice Group Leader for Executive Coaching in ROHEI Corporation, a leading learning and development organization. A consultant to leaders in organizations, Chris helps them develop high-trust teams with open communication that leads to clarity and innovative solutions. His work has made an impact on leaders around the world, including top executives at Yahoo, Sales Force, Zinio, among many leading organizations in the US.</p><p>Through a variety of video lectures, Chris will share both key principles and very practical examples of how to use these tools effectively to gain great clarity in your life. Watch how Chris coaches three individuals towards breakthrough by using the Courageous Conversation. </p><p>Get an exclusive look into Chris’ coaching conversations and take away impactful lessons for yourself including how to:  </p><ul><li>Communicate your thoughts and concerns effectively in 3 to 5 minutes</li><li>Step from ambiguity towards clarity  </li><li>Stop your thoughts from being hijacked by confusing perspectives and inner noises</li><li>Halt the cycle of thoughts that lead to no conclusion</li><li>Find courage to re-start dead end conversations</li><li>Move away from paralysing fears </li></ul><p>Your learning will be scaffolded by a Learning Journal which contains quick summaries of key ideas and take on Learning Challenges at the end of every learning segment to take practical steps to apply what you learnt. </p><p>By choosing to be engaged in your learning, you will benefit in the following ways: </p><ul><li>Get greater clarity of what’s going on inside of you with 10 questions of a Courageous Conversation.</li><li>Effectively and efficiently communicate your thoughts, feelings and requests in a clear 3 minute summary</li><li>Strengthen your communication style by engaging 4 Relational Fibers that are integral to having a successful relationship</li><li>Tackle the reality of your situation through unpacking the 3 Realities that govern your life</li><li>Powerfully shift your conversation dynamic towards increased connectivity with 2 Agreements</li><li>Forever change your view on your situation and relationships through embracing 1 Relational Mindset </li></ul><p>Looking forward to seeing you inside!</p>", 
    "end_date": null, 
    "title": "Courageous Conversations, Pt. 3", 
    "price": "50.00", 
    "instructors": "ROHEI Corporation, Chris Hogan, Praise Mok", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/884670_a5c2.jpg", 
    "course_url": "https://www.udemy.com/courageous-conversations-pt-3/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-21T20:46:43Z"
}