{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Dentro del grupo multidisciplinar que interviene en el control de la Enfermedad de Alzheimer, el colectivo de cuidadores es, sin duda, el que ocupa uno de los papeles más relevantes ya que contribuye a minimizar las molestias causadas en las familias, al entorno en general, y al paciente en particular, por tanto requiere de una especial atención por el enorme impacto social que supone que el cuidado del paciente sea de excelencia,  y es aquí donde se sustenta el objetivo primario de este curso.</p><p>A pesar de ser un colectivo tan valorado, actualmente su formación no está prevista en los programas de sanidad pública, la inmensa mayoría se forma sobre la marcha, sobre su propia improvisación y muchas veces condicionado por las características de la enfermedad que no permite ser prevista anticipadamente.</p><p>En este curso, conoceremos datos sobre la situación actual de la enfermedad analizando una serie de conceptos básicos. Conoceremos cuáles son las aptitudes más importantes que debe poseer un cuidador y las situaciones en las que el cuidador puede estar sufriendo una sobrecarga así como los riesgos a los que se va a enfrentar a lo largo de su actividad. </p><p>Hablaremos de situaciones cotidianas con las que debe lidiar el cuidador en relación a su familiar/paciente tales como la comunicación, el aseo, el vestuario, la alimentación, etc.  intentando dar las mayores soluciones posibles ya que muchas veces pueden llegar a ser todo un desafío. También trataremos temas de seguridad, visitas, centros de internamiento para el estadío grave, etc.</p>", 
    "end_date": null, 
    "title": "Curso de formación para cuidadores de enfermos de Alzheimer", 
    "price": "20.00", 
    "instructors": "Dra. María del Carmen Dona López", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/587598_d09e.jpg", 
    "course_url": "https://www.udemy.com/curso-de-formacion-para-cuidadores-de-enfermos-de-alzheimer/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-19T17:56:45Z"
}