{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Este es un curso dedicado principalmente a padres y educadores de niños desde el nacimiento hasta la adolescencia. Una de las principales labores que tenemos como padres, es el saber guiar a nuestros hijos hacia una vida feliz y responsable. Para ello, debemos enseñarles, desde muy temprana edad, cómo convivir en sociedad.</p><p>Todos tenemos derechos y responsabilidades. Nuestra libertad no puede ir más allá de la libertad y bienestar de los demás. Por ello, para coexistir armoniosamente en cualquier grupo social, todos debemos ajustarnos a límites y normas de convivencia básica.</p><p>Los límites enseñan a los niños cómo respetar a otros y cómo darse a respetar. Lo que no enseñemos hoy a nuestros hijos con amor, más tarde la vida se los enseñará con sufrimiento.</p><p>¿Cómo podemos establecer límites que fortalezcan el desarrollo de nuestros hijos, pero sin dañar su autoestima y su emotividad? ¿Cómo debemos aplicar estos límites de acuerdo a cada etapa de madurez de nuestros niños?</p><p>En este curso, la Dra. en psicologías humanistas, Patricia Cruz, explora estos temas con los padres de familia. El curso incluye ejercicios de concientización, en los que los padres pueden reflexionar sobre su propio estilo de paternidad y la manera como aplican - o no- los límites con sus hijos.</p><p>Con un lenguaje sencillo y directo, este curso busca orientar a los padres en una de las labores más importantes de sus vidas: la guianza de sus hijos hacia el desarrollo personal y social. </p>", 
    "end_date": null, 
    "title": "Cómo poner límites a nuestros niños sin lastimarlos", 
    "price": "20.00", 
    "instructors": "Patricia Cruz Limón", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692382_4398_2.jpg", 
    "course_url": "https://www.udemy.com/educacion-positiva/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T21:23:02Z"
}