{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><span>There are more singles than ever before in history. 43% of people over the age of 18 are single. On the flip-side, people in relationships, about 50% of them break up. </span></strong>  </p>  <p>  \t<strong><span>So why as a society are we having so much trouble creating the lasting relationships we really want?</span> </strong>  </p>  <p>  \tYou might not even realize how often relationships fail, or how difficult it can be to find that perfect someone.  </p>  <p>  \t        You may be asking yourself, &quot;Why is it that finding love and relationships can be so complicated?&quot;  </p>  <p>  \t<strong>It doesn&#039;t have to be hard. There&#039;s a secret.<br>  \t</strong>  </p>  <p>  \t        Unfortunately, there was no course in high school about love. Now is time to get the tools to better equip yourself.  </p>  <p>  \t<em><strong>How to Attract a Mind-Blowing Relationship</strong></em> will teach you how to open yourself up to greater love and attract that person and relationship you truly want.  </p>  <p>  \t        Most importantly,<em> it will help you attract the partner of your dreams and completely transform your love life.<br>  \t</em>  </p>  <p>  \t <strong>What If It Doesn&#039;t Come Naturally?</strong>  </p>  <p>  \t       You do not have to be born with a natural gift in relating to others.  In fact, the tools and skills needed to having intimate relationships can be  self-taught.  </p>  <p>  \t       This course is based on my own research (<em>from various experts and using my life as a test-kitchen</em>) on how to attract the right person and turn it into a mind-blowing relationship.  </p>  <p>  \t Between my own relationships and those of my clients and friends, I have seen it all. Every negative, self-defeating pattern and relationship failure has the potential to be overcome.  </p>  <p>  \t <strong>Dating Myths:</strong>  </p>  <ul>  \t<li><em>Dating Myth #1: I must be perfect and make all the right moves in order to get someone to like me and keep them involved.</em> It&#039;s not about &quot;making the right moves&quot;. I could teach you how to date, say the right things, and the proper &quot;rules&quot;. Instead, I want you to release these things so you can come from a natural space and your own confidence that will engage your partner and get them involved in your life in a way you haven&#039;t seen before.</li>  </ul>  <ul>  \t<li><em>Dating Myth #2: I&#039;m just not (confident enough/pretty enough/smart enough/outgoing enough) to put myself out there and date. Remember, confidence is a skill that can be learned. Don&#039;t wait until you feel like you&#039;re &quot;perfect&quot; to start dating. It will come naturally.</em></li>  </ul>  <ul>  \t<li><em>Dating Myth #3: I always attract the wrong types of people.</em> We will look at your past relationship patterns and what is really blocking love for you, so that you can confidently move forward and attract the love YOU want.</li>  </ul>  <p>  \t <strong>Why is Confidence Important?</strong>  </p>  <p>  \t       I want you to be the most confident, amazing version of yourself that you can be. When you learn to truly love yourself and hold your head up high - you can not only bring this to creating satisfying relationships but to the rest of your life. You must take responsibility for your own happiness.  </p>  <p>  \t <strong>Let me teach you how to attract a mind-blowing relationship!</strong>  </p>", 
    "end_date": null, 
    "title": "Dating: How to Attract a Mind-Blowing Relationship", 
    "price": "20.00", 
    "instructors": "Alexis Meads", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/109758_243a_14.jpg", 
    "course_url": "https://www.udemy.com/crazy-wild-love-create-a-mind-blowing-relationship/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-23T18:02:23Z"
}