{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Clutter and disorganization are the mortal enemies of any family.</strong>  As your family grows, your time decreases, and the clutter piles up.  The flow on effect from this is a house you are embarrassed of. Your children grow to accept the chaos as an inevitable part of life and create a legacy which is not something to be proud of.  Meanwhile, the state of your home continues to drive you insane!  </p>  <p>  \t          This course is designed to teach you how the problem of disorganization came to be, and how to <em style=\"\">quickly take back control</em> and <em style=\"\">declutter your home</em> <em style=\"\">without the stress</em> and headaches.<br style=\"\">  \t<br style=\"\">  \t          Declutter Now: How To Organize Your Family in 7 Days will also teach you:  </p>  <ul style=\"\">  \t<li>The 7 Types of Disorganization (including which ones your family has)</li>  \t<li>Decluttering Like A Pro: How To Identify Causes Of Guaranteed Chaos &amp; Mayhem</li>  \t<li>Why Multitasking Kills Your Attempts at Organization (and actually encourage you to become more disorganized)</li>  \t<li>The Secret To Chore Assignment For All Age Groups (You&#039;ll be surprised to find what NOT to do)</li>  \t<li>A System That Makes Kids Enjoy Sorting, Organizing and Cleaning</li>  \t<li>How To Develop Your Own House Systems That Take The Guesswork Out Of Cleaning, Storage and Decluttering Each Room</li>  \t<li>Ways To Actually Save Money And Time While Organizing Your Home</li>  \t<li>How To Get Your Family Motivated Toward Change</li>  \t<li>What To Look For With Emotional Hoarding And Handle It Once And For All</li>  \t<li>And Much More!</li>  </ul>  <p>  \t<br style=\"\">  \t<strong style=\"\">Contents and Overview</strong><br style=\"\">  \t<br style=\"\">  \t          This course was made for anyone who is sick and tired of having a messy or clutter-filled home.  The only requirement for learning how to organize your home is your desire and commitment to put these decluttering tips and skills you learn into action (Don&#039;t worry, they are small and easy to digest steps).<br style=\"\">  \t<br style=\"\">  \t          This course also shows how to begin to change your mindset and break free of old habits which have previously led to failure when attempting to declutter.  As you implement this training, your self-esteem will likely improve as you create a household you can be truly proud of, instead of surrendering to the overwhelm of clutter and disorganization.<br style=\"\">  \t<br style=\"\">  \t          Learn how to <em style=\"\">overcome the disorganization</em> which has held you back; start to easily create organizational systems with these strategies and don&#039;t let this chance for change pass you by.  </p>", 
    "end_date": null, 
    "title": "Declutter Now: How To Organize Your Family in 7 Days", 
    "price": "20.00", 
    "instructors": "Discovering How, Andrew Power", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407486_74bd_2.jpg", 
    "course_url": "https://www.udemy.com/declutter-now-how-to-organize-your-home/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T05:35:04Z"
}