{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t¿Sabes por qué es tan importante que los niños gateen cuando son pequeños? ¿De qué manera se relacionan las diferentes funciones neurológicas del ser humano? ¿Sabías que la activación física incide positivamente en el aprovechamiento escolar? ¿Habías considerado el desarrollo neuromotor y la educación física como una de las prioridades de la educación escolar? ¿O es lo primero que reduces cuando hay poco tiempo?  </p>  <p>  \tEl desarrollo neuromotor infantil se entiende como el proceso en el que el niño madura y adquiere destrezas relacionadas con el manejo de su cuerpo, el movimiento y el lenguaje.  Cada vez existen más evidencias de la importancia que este aspecto del desarrollo tiene en sí mismo y como influencia en otras áreas, por ejemplo, la cognitiva.  </p>  <p>  \tCerebro, oxigenación y movimiento tienen una estrecha y muy organizada relación.  En este curso, analizaremos diferentes etapas del desarrollo infantil, a través de un modelo preciso y estructurado de desarrollo de las habilidades humanas.  </p>  <p>  \tHablaremos de la diferencia entre las vías sensoriales y las vías motoras como conexión entre el cerebro y el medio exterior. Aprenderemos cómo la movilidad puede desarrollar la visión. Estudiaremos maneras prácticas en que es posible desarrollar la manualidad, la lateralidad y el lenguaje, y a través de ellos incluso favorecer otras funciones neurológicas, como la lectura y la escritura, impactando positivamente las actividades académicas derivadas de ellas.  </p>  <p>  \tAnalizaremos cómo es el ambiente ideal para las habilidades motoras y cómo podemos diseñar programas de desarrollo para ser implementados, en un ambiente de calidez y alegría,  en las aulas de educación inicial, preescolar y primaria baja.  </p>", 
    "end_date": null, 
    "title": "Desarollo Neuromotor Infantil", 
    "price": "50.00", 
    "instructors": "Elisa Guerra", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/206038_3104_2.jpg", 
    "course_url": "https://www.udemy.com/desarollo-neuromotor-infantil/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-27T15:21:50Z"
}