{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course takes the student on a step-by-step journey to move towards healing post-divorce. It begins with examining where you went wrong then proceeds to getting to know yourself and beginning to develop the kind of person that you would like to be going forward now that you&#039;ve been given this new start. It then proceeds to how to change your mindset about why you got a divorce and how the real answer to that question can change your feelings, your mindset, and your actions towards your ex. Next it explores the importance of giving yourself time to heal and to develop yourself. Finally it finishes with how to become a better parent, how and when to date, and how to ensure that you are putting your children first when doing so.</p><p style=\"\">Each course focuses not just on what you should be doing for each step and each lesson but why as well. What the benefits are and why not following the steps can ensure that you leave your marriage but continue to stay in limbo instead of moving towards God&#039;s plan for your life are also explored.</p><p style=\"\">The courses challenge the student to do the work, to think, and to seek God—not to just look for a quick fix or a two-step plan to healing but to appreciate the journey and the experience gained as you travel towards healing.</p><p style=\"\">The course uses references from Amanda Nicole&#039;s books <em style=\"\">From Divorce to Destiny</em> and <em style=\"\">Healing After Divorce</em>, and throughout the course, students are encouraged to refer to those two books for further study.</p>", 
    "end_date": null, 
    "title": "Divorce Recovery", 
    "price": "45.00", 
    "instructors": "Amanda Nicole", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528690_ce2c_3.jpg", 
    "course_url": "https://www.udemy.com/divorce-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T16:42:09Z"
}