{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t   As a father of twins living in a modern era, you have the ability to enable your twins to become amazing human beings who look, feel and perform with optimized bodies and minds. Unfortunately, it’s very easy to make parenting mistakes that create a host of issues in your twins, including immune system weakness, low IQ, stunted growth, obesity, depression, attention deficit disorder and other frustrating problems that parents of twins now accept as all-too-common.  </p>  <p>  \t   In this course, twin fathers and health and productivity experts Ben Greenfield and Ari Meisel give you everything you need for raising healthy and smart twins, including how both mothers and fathers should eat and exercise during a twin pregnancy, how to bulletproof your children’s immune system, twin parent sleeping tips, healthy holistic nutrition for twins, productivity and money-saving hacks, keep yourself healthy and fit while raising twins, creating socially enhanced children, and much more!  </p>  <p>  \t   The &quot;Twin Dad&#039;s Ultimate Guide To Raising Healthy &amp; Smart Twins” includes videos, audios, transcripts and bonus resources, all presented in an easy-to-understand format that allows you to easily implement everything. Whether you’re a father of twin boys, twin girls or any other combination of one or multiple children, you’ll learn with zero guesswork as Ben and Ari walk you through an exciting path of little-known and highly practical tips, tricks and secrets to raising children who grow up to be healthy, successful and happy.  </p>", 
    "end_date": null, 
    "title": "Double Dads: The Twin Dad's Ultimate Guide To Raising Health", 
    "price": "45.00", 
    "instructors": "Ari Meisel, Ben Greenfield", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240060_1951_2.jpg", 
    "course_url": "https://www.udemy.com/doubledads/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-09T14:27:34Z"
}