{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Hypnosis – <strong>Ease The Pain Of Parting Relationships Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li><b>1. </b>We learn and grow through our relationships. When a relationship fails we feel immense pain and undergo depression. Endings are sometimes unpleasant. We may become mentally disturbed and lose focus in life. For some, getting back to their normal life seems next to impossible. They continue to live in the past and constantly think about the past relationship. The relationship has ended but they are not ready to let go of the pain.<b></b></li> <li><b></b></li> <li>This video course has been designed for those who have an unfortunate ending of their relationship be it with their partner, parents, children or friends. This course aims to help you ease the pain of parting and get back to life.  <b></b></li> <li><b>2. </b><b>How Self Hypnosis Can Help?</b><b></b></li> <li>1) Self hypnosis helps you to relax and become calm<b></b></li> <li>2) Self hypnosis helps you to remove your negative and self-limiting thoughts<b></b></li> <li>3) Self hypnosis treats stress, anxiety, nervousness and depression successfully<b></b></li> <li>4) Self hypnosis helps to connect with the deep sources of power and energy within you<b></b></li> <li>5) Self hypnosis helps maintain positive attitude <b></b></li></ul><p>This course is ideal for those who have gone through a broken relationship and need positive energy and mindset to stay happy in their life and move on. Using powerful and simple self hypnosis techniques , you will be able to ease the pain of parting relationships with your friends, spouse, family etc.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English including bonus.</p>", 
    "end_date": null, 
    "title": "Ease The Pain Of Parting Relationships Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/581912_a557_2.jpg", 
    "course_url": "https://www.udemy.com/ease-the-pain-of-parting-relationships-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-13T06:41:17Z"
}