{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t     This course covers the nuts and bolts of online dating and explains how to move through the process from start to finish. By the end of the course you&#039;ll be able to engage in online dating in an effective manner. No prior knowledge of the subject is required -- all you need is a willingness to date other people and be open to forming a meaningful relationship. You&#039;ll learn how to:  </p>  <ul style=\"\">  \t<li style=\"\">Choose the best web platform for your online dating efforts.</li>  \t<li style=\"\">Create a profile and select photos that draw positive attention.</li>  \t<li style=\"\">Efficiently search for potential dates.</li>  \t<li style=\"\">Communicate with people you are interested in and with people who are interested in you.</li>  \t<li style=\"\">Go on actual dates.</li>  </ul>  <p style=\"\">  \t     The strategies you will learn are supported by scientific research and operate according to basic economic principles. Additional resources are available in supplementary materials.  </p>  <p style=\"\">  \t     The course is organized in a series of easy-to-follow video lectures that conveniently last only a few minutes each and include plenty of examples. The entire course takes a few hours to complete, but then it&#039;s up to you to apply what you&#039;ve learned -- and practice makes perfect. The instructor is available to provide feedback and advice to help you answer these questions:  </p>  <ul style=\"\">  \t<li style=\"\">What do I really want out of dating?</li>  \t<li style=\"\">What is non-negotiable for me in a relationship?</li>  \t<li style=\"\">Where can I find the people I want to connect with?</li>  \t<li style=\"\">How much time and effort am I willing and able to put into dating at any given moment?</li>  </ul>  <p style=\"\">  \t     Online dating takes a lot of patience, benefit of the doubt, and self-reflection. But the key to doing it effectively is to detach from the outcomes and try to learn what you can from the process itself. Once that happens, you’ll find it to be a remarkably rewarding experience.  </p>", 
    "end_date": null, 
    "title": "Effective Online Dating", 
    "price": "20.00", 
    "instructors": "Chad Raymond", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21816_764d_6.jpg", 
    "course_url": "https://www.udemy.com/effective-online-dating/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-26T11:39:14Z"
}