{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\">¿¿Cómo crear familia??</strong>  </p>  <p style=\"\">  \t Los hijos son se convierten en protagonista de nuestra vida y en centros esenciales de nuestro universo personal.  </p>  <p style=\"\">  \t En estos tiempos la familia se transforma y reinventa día a día. Educar a nuestras hijas e hijos es todo un reto en la nueva sociedad.  </p>  <p style=\"\">  \t Ser padre o madre es toda una aventura que una vez que empieza y no finaliza. Es aprendizaje permanente.  </p>  <p style=\"\">  \t El coaching , como arte de la pregunta, acompaña procesos de cambio y desarrollo y se convierte en una poderosa herramienta educativa.  </p>  <p style=\"\">  \t El propósito de este curso es acompañarte en un proceso de exploración y expansión de tus habilidades, herramientas, estrategias y recursos en relación con la educación en familia, y el aprendizaje de tus hijos a través del coaching.  </p>  <p style=\"\">  \t El curso está estructurado en <strong style=\"\">cinco módulos junto a una presentación</strong> general, donde encontrarás contenidos teóricos muy sencillos junto a prácticas y ejercicios basados en la <strong style=\"\">metodología del Coaching.</strong>  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">Sección 1 Presentación del curso</strong>  </p>  <p style=\"\">  \t En este video podrás encontrar todos los detalles del curso, es abierto a todo el público. ¡¡Anímate a verlo!!  </p>  <p style=\"\">  \t <strong style=\"\">Sección 2 Módulo 1: ¿Qué es educar?</strong>  </p>  <p style=\"\">  \t Comienza esta aventura crear familia a través del coaching, nuestro viaje comienza en una revisión de la panorámica actual y tradicional de la educación en familia y sobre nuestras creencias personales.  </p>  <p style=\"\">  \t <strong style=\"\">Sección 3 Módulo 2: ¿Cómo educar? Desarrollo y estilos educativos</strong>  </p>  <p style=\"\">  \t En este módulo aprenderemos sobre las fases del desarrollo infantil y distintas cuestiones sobre la educación de los hijos.  </p>  <p style=\"\">  \t <strong style=\"\">Sección 4 Módulo 3: Aproximación al coaching</strong>  </p>  <p style=\"\">  \t Nos aproximamos con esta sección al concepto de coaching.  </p>  <p style=\"\">  \t <strong style=\"\">Sección 5 Módulo 4: </strong>  </p>  <p style=\"\">  \t En esta parte del curso descubriremos algunas de las técnicas y estrategias principales del coaching.  </p>  <p style=\"\">  \t <strong style=\"\">Sección 6 Módulo 5: </strong>  </p>  <p style=\"\">  \t Finalizamos con un módulo  donde podrás desarrollar y perfeccionar tus habilidades de coaching para la familia desarrollando un plan de acción.  </p>  <p style=\"\">  \t <strong style=\"\">¿Te atreves a despertar la excelencia parental?</strong>  </p>  <p style=\"\">  \t Además de los vídeos tienes otros <strong style=\"\">materiales</strong> a tu disposición, como el temario del curso en formato PDF y cuestionarios para complementar y afianzar el aprendizaje.  </p>  <p style=\"\">  \t Para realizar el curso se recomienda dedicar <strong style=\"\">una semana</strong>, al menos, a <strong style=\"\">cada módulo</strong> que sería un tiempo adecuado para integrar el conocimiento y realizar los ejercicios, aunque tú decides cuándo y cuánto, tú conoces tu ritmo. Se sugiere dar espacio para integrar toda la información que se va a generar y que puede mover y consumir energía en ti.  </p>  <p style=\"\">  \t Si has decidido hacer este curso quizás tienes ganas de desarrollarte a nivel personal, de mejorar tus habilidades y creatividad para liderar, innovar, transformar y acompañar el aprendizaje de todos los miembros de tu familia.  </p>  <p style=\"\">  \t Gracias por tu tiempo y quedo a tu disposición, deseando ¡¡Qué consigas todo aquello que te propongas!!  </p>  <p style=\"\">  \t Julia  </p>", 
    "end_date": null, 
    "title": "El arte de Educar. Coaching para hacer familia", 
    "price": "20.00", 
    "instructors": "Julia García Escudero", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/181746_adf8_3.jpg", 
    "course_url": "https://www.udemy.com/el-arte-de-educar-coaching-para-hacer-familia/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-13T14:09:54Z"
}