{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t   ¿Quieres que tus hijos, alumnos o familiares pequeños sean felices? ¿Te gustaría dejar de sentir culpa cuando corriges a ese niño(a)? ¿Piensas que tu manera de disciplinar a tus hijos, alumnos o familiares es la más adecuada? ¿Eres de los(as) que disciplinan de la misma manera en cómo te educaron de pequeño? ¿Te ha funcionado?  </p>  <p>  \t   En muchas ocasiones el comportamiento de nuestros hijos nos irrita y es difícil no recurrir al <strong style=\"\">castigo</strong> con el deseo de vengarnos, pero es obvio que esta medida disciplinaria resulta<strong style=\"\"> ineficaz</strong> y acaba creando rebeldía. Por lo tanto, dado que los niños cuando están alterados son incapaces de razonar, es conveniente que les enseñemos a  través de técnicas adecuadas la mejor manera de comportarse.  </p>  <p>  \t   Es por eso, que en este práctico entrenamiento, podrás analizar y conocer, desde un punto de vista psicológico y experiencial, todos los componentes y elementos que forman parte de la DISCIPLINA POSITIVA, específicamente en lo que tiene que ver con el manejo de los hijos, sin importar la edad.  </p>  <p>  \t   La DISCIPLINA POSITIVA es aquella metodología que crea lazos de confianza entre padre/madre e hijo, reafirma su identidad, favorece la confianza en los niños dentro de un ambiente de respeto, honestidad, libertad y responsabilidad.  </p>  <p>  \t   Este entrenamiento se compone de 6 secciones con 25 clases, divididas en 22 videos explicativos, 1 cuestionario y 2 ejercicios, que te ayudarán a fijar mejor los contenidos y a poner en práctica de inmediato lo ya adquirido. Cabe destacar que tanto el cuestionario como los ejercicios están en un formato descargable para que puedas hacer un uso personalizado de los mismos.  </p>  <p>  \t   El Entrenamiento tiene una duración de una hora y media de contenido teórico, donde se plantean cuestionantes, ejercicios y prácticas puntuales para que los realices en el tiempo que consideres y puedas así lograr los objetivos propuestos.  </p>  <p>  \t   Las secciones que componen el curso están divididas de la siguiente manera:  </p>  <ul style=\"\">  \t<p>  \t\t   1. Introducción  \t</p>  \t<p>  \t\t   2. Disciplina Positiva  \t</p>  \t<p>  \t\t   3. Dos Caminos hacia la Disciplina  \t</p>  \t<p>  \t\t   4. Herramientas para educar a nuestros hijos con Disciplina Positiva  \t</p>  \t<p>  \t\t   5. Ejercicio 1  \t</p>  \t<p>  \t\t   6. Ejercicio 2 y cierre del curso  \t</p>  </ul>  <p>  \t   Al tomar este curso te sentirás en la plena capacidad de poder ejercer la disciplina en tu hogar de la mejor manera, lograron resultados positivos a largo plazo. Tendrás las mejores herramientas a mano y podrás utilizarlas sin sentirte culpable y sin la duda de saber si estás haciendo o no lo correcto.  </p>  <p>  \t   Bienvenida/o a este espacio de crecimiento personal, esperamos que te sea de gran provecho.  </p>  <p>  \t   Jeymi Febles - Instructora  </p>", 
    "end_date": null, 
    "title": "Entrenamiento en Disciplina Positiva para Padres", 
    "price": "20.00", 
    "instructors": "SINAPSI CDHE, Jeymi Emperatriz  Febles Jaquez, MA Robert Sasuke", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/240432_9cd8_3.jpg", 
    "course_url": "https://www.udemy.com/edisciplinappadres/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-10T01:14:19Z"
}