{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Imagine yourself giving a proper eulogy for your loved one. You relive the high lights of this person&#039;s life. You take people on a journey celebrating his/her life. And you do it with the poise and dignity that such an occasion requires.</p><p>  \t    How to Give a Eulogy  </p>  <p>  \t    In this &quot;How to Give a Eulogy&quot; course you will learn all the steps you need to take in order to deliver an effective eulogy for a departed loved one. Nobody looks forward to giving a eulogy, but it is an opportunity to spotlight what was great and what will be missed by a close family member or friend. A eulogy isn&#039;t like a typical business speech or PowerPoint presentation. However, it is still a speech with an opportunity to make either a bad impress, no impression or a positive impression and to communicate good things about the person who has just died. This course will help you prepare for the eulogy using the least amount of time and causing the least stress.  </p>  <p>  \t  TJ Walker is a widely respected presentation coach and has personally delivered eulogies.  </p><p>Enroll in this course today.</p><p>Course updated on July 29, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee.</p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe.</p><p>What others say:</p><p>“TJ Walker&#039;s single-minded devotion to presentation has made him the #1 expert for executives seeking guidance on speaking to the public and media.&quot; <em style=\"\">Bob Bowdon, Anchor/Reporter, Bloomberg Television</em></p><p>“TJ Walker is the leading media trainer in the world.&quot; <em style=\"\">Stu Miller, Viacom News Producer</em></p><p>(TJ Walker&#039;s Media Training Worldwide) “The world&#039;s leading presentation and media training firm.&quot;<em style=\"\">Gregg Jarrett, Fox News Channel Anchor</em></p>", 
    "end_date": null, 
    "title": "Eulogy: You Can Give a Great Eulogy For Your Loved One ", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/344328_dde0_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-give-a-eulogy/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-14T18:18:42Z"
}