{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">Over a 1,000 students</strong> globally have taken this online dating course </em>  </p>  <p>  \t<strong style=\"\">__________________________________________________________________________<br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\"><em style=\"\">Course Continuously Updated - Most recent update 2/13/2015<br style=\"\">  \t</em></strong>  </p>  <p>  \t<strong style=\"\">__________________________________________________________________________</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">Let&#039;s get you out there on fun quality dates with the type of person you are looking for!</strong>  </p>  <p>  \t                                    Start succeeding at online dating, without putting in additional time, spending more money and by decreasing your frustration.  </p>  <p>  \t<strong style=\"\">It&#039;s time to stop the online dating roller-coaster! </strong>  </p>  <p>  \t                              This  online dating course will lead you one strategic step at a time through the  digital dating maze saving you from the pitfalls and frustrations many  digital daters experience.  </p>  <p>  \t<strong style=\"\">You Will Learn</strong>  </p>  <ol style=\"\">  \t<li style=\"\">How to write an attention grabbing online dating profile</li>  \t<li style=\"\">The 10 Keys to choosing an online dating profile picture</li>  \t<li style=\"\">The 3 profile pictures every digital dater must have</li>  \t<li style=\"\">How to properly send and respond to an &quot;I&#039;m interested message&quot;</li>  \t<li style=\"\">How to politely let someone know you are not interested</li>  \t<li style=\"\">How to use my secret phrase that keeps you off the hamster wheel of endless communications</li>  \t<li style=\"\">The 4 steps to move from online to offline and going out on dates</li>  \t<li style=\"\">The 5 safety tips every online dater should follow</li>  \t<li style=\"\">An overview of online dating site or app </li>  </ol>  <p>  \t<strong style=\"\"> </strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\">The Goal of This Online Dating Course</strong></strong>  </p>  <p>  \t<strong style=\"\"><strong style=\"\"> </strong></strong>The goal of this online dating course is to not only teach you how to  succeed at digital dating but to also help you with understanding the  process and managing your expectations so you can have fun along the  way. When you apply what I teach, you will see an increase in the  quality of the dates you are going on as well as starting to meet more  and more people that you are attracted to and that are best suited for  you.  </p>  <p>  \t<strong style=\"\">You no longer have to go it alone! </strong>  </p>  <p>  \t                              At No Additional Cost You Gain Access to:  </p>  <ol style=\"\">  \t<li style=\"\">Having me review your online dating profile</li>  \t<li style=\"\">Having me review your online dating profile pictures</li>  \t<li style=\"\">Asking me questions you have while applying the strategies taught in this course</li>  \t<li style=\"\">The discussion board where you can interact not only with me but other students who have taken this course</li>  </ol>  <p>  \t<strong style=\"\"><strong style=\"\"><strong style=\"\"><strong style=\"\">One final very important point</strong></strong></strong></strong>  </p>  <p>  \t                              This course teaches you strategies that can be applied to all the various online/digital dating sites. Each dating sites has it&#039;s one interface and process and students may need to modify a strategy to adapt to any limitation a site may have. The great news is you don&#039;t have to do that alone. You can use the discussion forum with the course or message me privately anytime to ask for help.  </p>  <p>  \t<strong style=\"\">So what are you waiting for? <em style=\"\">Click the &#039;take this course&#039; button, top right, now!</em></strong><br style=\"\">  \t<strong style=\"\"><strong style=\"\"><strong style=\"\"><strong style=\"\"></strong></strong></strong></strong>  </p>  <ul style=\"\">  \t<strong style=\"\"><strong style=\"\"></strong></strong>  </ul>", 
    "end_date": null, 
    "title": "Find Love Online: Dating Strategies for Online Dating", 
    "price": "45.00", 
    "instructors": "Kimberly Koehler", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/110377_8e2e_14.jpg", 
    "course_url": "https://www.udemy.com/onlinedatinghowto/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-25T01:42:05Z"
}