{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong>**This class offers 2 contact hours and 0.2 CEUs for nurses, doulas, childbirth educators, and nurse midwives!**</strong><br><strong></strong></p><p><strong>\"Failure to Progress\" is the number one cause of C-sections among women giving birth for the first time. <br>  \t </strong>  </p>  <p>  \t <strong>Failure to progress</strong> is a subjective diagnosis <strong>based on Friedman's Curve</strong>-- a graph that shows how fast women should dilate during labor. Although most healthcare providers still use Friedman's Curve to dictate how they manage a woman's labor, this curve was published in 1954 and has since become completely <strong>obsolete</strong>. If more healthcare providers got rid of Friedman's Curve and learned the new, evidence-based definitions of normal and abnormal labor, we would see a drastic decrease in the overall C-section rate.  </p>  <p>  \t          You have the chance to take a class from <strong>Rebecca Dekker, the PhD-prepared founder of Evidence Based Birth, </strong>and learn <strong>the facts</strong> about Failure to Progress and Friedman's Curve.  </p>  <p>  \t           By taking this class, you will gain <strong>non-biased information about failure to progress, failed inductions, and how to prevent slow progress in labor </strong>.  </p>  <p>  \t       In this class you will learn:  </p>  <ul>  \t<li>Why is failure to progress such a big problem? </li>  \t<li>What is the history of Friedman's Curve? </li>  \t<li>What is the normal length of labor in modern women? </li>  \t<li>Can long labors lead to health problems?</li>  \t<li>What are the new, evidence-based definitions of labor arrest and failed induction?</li>  \t<li>How can we help prevent women from having long labors in the first place?</li>  </ul>  <p>  \t<strong>Because the class is made up of short videos, you can take the class at your own pace.</strong>  </p>  <p>  \t   The class also includes:  </p>  <ul>  \t<li>Printable handouts for you to keep</li>  \t<li>MP3 audio files you can download</li>  \t<li>Video voice-overs that you can download to view offline</li>  \t<li>An interview with a woman who gave birth during Dr. Friedman's time</li>  \t<li>A quiz to check your knowledge</li>  \t<li>Three wrap-up case studies (scenarios) so you can pull everything together</li>  \t<li>A chance for you to ask Rebecca questions </li>  </ul>  <p>  \t<strong>Should you take this class?</strong>  </p>  <p>  \t          If you are a doula, childbirth educator, nurse, nurse-midwife, midwife, physician, or highly motivated parent and you want to learn <strong>in-depth facts</strong> about Friedman's Curve and Failure to Progress, then this class is for you!  </p>  <p>  \t <strong>Can I earn continuing education hours?</strong>  </p>  <p>  \t          Yes!! Rebecca has been approved as a continuing education provider by the Kentucky Board of Nursing. This means you <strong>can earn a certificate for 1.8 nursing contact hours once you complete the course</strong>. Nursing contact hours can also be applied to most doula, childbirth education, and some midwifery certifications. <em>Note:  Check with your certifying organization to ensure they accept nursing  contact hours. </em></p><p>This course has also been <strong>approved for 0.2 ACNM CEUs by the American College of Nurse Midwives! </strong><br></p>  <p>  \t <strong>When does the class start?</strong>  </p>  <p>  \t          Since the class is online, you can start anytime! And purchase of the course gives you <strong>lifetime access</strong>  to the class and any updates. This means you will have plenty of time  to complete the class at your leisure. And you can relax knowing that  you’ll always be able to come back to the class if you want to refresh  your memory.  </p>  <p>  \t<strong>Is there a money back guarantee?</strong>  </p>  <p>  \t           Yes, you are provided with a 30-day money back guarantee.  </p>  <p>  \t<strong>How much does the class cost?</strong>  </p>  <p>  \t           The class is just $49 for 2 hours of video content and all of  your class materials– including videos, audio files, handouts, 3 wrap-up case studies, and a certificate for contact hours. You will also have the  chance to join the closed Evidence Based Birth Classroom group and ask questions of the founder of Evidence Based Birth.  </p>", 
    "end_date": null, 
    "title": "Friedman's Curve and Failure to Progress", 
    "price": "50.00", 
    "instructors": "Rebecca  Dekker, PhD, RN, APRN", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/110370_6fe7_6.jpg", 
    "course_url": "https://www.udemy.com/friedmans-curve-and-failure-to-progress/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-25T01:26:24Z"
}