{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Is your child unmotivated to study?</p>    <p>Is your child lacking self-confidence?</p>    <p>Is your child falling behind or failing in school?</p>    <p>Is your boy playing computer games like there is no tomorrow?</p>    <p>Is your girl spending way too much time on Facebook, Youtube, or her phone?</p>    <p>Do you feel guilty because you have not spent enough time with your kids?</p>    <p>Do you feel something is seriously missing in your relationships at home?</p>    <p>Are you having problems communicating with your kids?</p>    <p>Every time you try to teach them something or show them your good intentions, they think you are nagging or coercing them?</p>    <p><em>Why is parenting so difficult?</em></p>    <p>I’ve seen it all over the last 12 years - the headache, heartache, disappointment, disillusionment, agony, misery and pain – and yes finally, the <strong>hope, love, renewal, reconnection, joy, peace, and harmony</strong>.</p>    <p>I’ve seen children failing in school become top students.</p>    <p>I’ve seen rebellious teens become respectful and responsible.</p>    <p>I’ve seen over-critical and judgmental parents become nurturing and encouraging.</p>    <p>I’ve seen families which were falling apart become cohesive and united teams.</p>    <p>These positive results and powerful transformations are what fuel my passion to help many more parents like you – every day.</p>    <p>That’s why <strong>FUNtastic Parenting is for you</strong>.</p>    <p>Please remember that <strong>YOU are the special someone who can truly shape and mould your child’s destiny</strong>.</p>    <p>If an under-achieving kid like me was able to get respectable results and remarkable achievements, any kid can do that. Or better!</p>    <p>But it requires parents to be the very best parent they know they can be.</p>    <ul><li>learn effective parenting skills</li><li>develop a positive mind-set</li><li>become an all-round better person.</li></ul>        <p><br></p><p>After all, you are the best role model for your children. Whether you know it or not, whether you like it or not, your child learns by copying your behaviours and language.<br></p>    <p>Therefore, during the formative years, when you <strong>build a strong foundation</strong> in your child’s <strong>positive self-esteem</strong>, <strong>healthy family communications</strong>, and <strong>loving relationships</strong>, you will not only <strong>avoid many common problems associated with dealing with teens in later years</strong> but you will also <strong>enjoy the journey of parenting heartily</strong>.</p>    <p>By investing a small amount of time and energy (and money) in learning parenting skills, you will raise confident, successful and happy children.</p>    <p>But only if you APPLY the newly acquired skills to get the results.</p>  <p><strong><em></em></strong></p>  <p>In the construction of a building or skyscraper, which part of the structure is the most critical? Foundation. Without a solid and strong foundation to build on, no structure can stand up for very long.</p>    <p>Likewise, in the development of a child to adulthood, the foundation is the most critical developmental process too.</p>    <p>To help you build this “strong foundation” during these formative years, I have put together the ground-breaking, comprehensive <strong>FUNtastic© Parenting Program</strong>, which has been 12 years in the making.</p>    <p>Absolutely no fluff or filler. Everything you need is in here with no extra padding. The powerful strategies are <strong>time-tested</strong> and readily actionable.</p>    <p>4 audios and a comprehensive workbook in each module will help you formulate<strong> a game plan to start getting results that you desire and deserve</strong>.</p>    <p>Over the last 12 years it’s been my absolute pleasure and privilege to work hands-on helping parents with a myriad of issues and problems– coaching, counselling them – I make sure <strong>the tools and techniques REALLY WORK!</strong></p>  <hr>", 
    "end_date": null, 
    "title": "FUNtastic Parenting Programme ", 
    "price": "20.00", 
    "instructors": "Alan Yip", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/759496_378c.jpg", 
    "course_url": "https://www.udemy.com/funtastic-parenting-programme/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-11T10:48:46Z"
}