{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        This course is an online version of a women’s workshop that has been successfully running for over 10 years.  It is designed to be fun, educational, discrete and above all classy!  </p>  <p>  \t        My passion lies in transforming  relationships for the better and reigniting that spark that you once had as a couple. Created by everyday women with families, jobs and responsibilities, this course is practical and easy to follow.  </p>  <p>  \t         Although the subject matter is predominantly about sex, we receive amazing feedback from students on how the course has transformed their relationship with their partner and even saved marriages in some cases.  </p>  <p>  \t        We have nothing but positive feedback on how this course makes a difference in peoples lives and we would like to make a difference for you too.  </p>  <p>  \t        Join now and see how we can transform your relationship too. Who knows you may even have a little fun in the process :)  </p>  <p>  \t     Course Modules:  </p>  <p>  \t  There are 6 modules that are designed to be completed over a 6 week period. There is weekly homework (don&#039;t worry it is fun ) that must be completed. The course is presented in a series of short videos and assigments are completed by downloading the assigment sheets in PDF format.  </p>  <p>  \t    Module 1: One of the keys to great sex is killer confidence! In this module we’ll start by looking introspectively at ourselves and as well as looking past the cellulite, wrinkles, varicose veins and what not. It’s all about learning to see and love yourself the way he does – focussing on what you do with your body rather than what you see in the mirror. to ultimately unlock the rocking goddess within!  </p>  <p>  \t    Module 2: The second secret to having great sex is to really learn to understand his needs. Men are wired in a completely different way than women, and often it’s because we treat them the way we want to be treated ourselves, that both are left unsatisfied. In this chapter we’ll be taking an in-depth look at what makes hubby tick and how you can go about making him the happiest man alive. Remember: Great sex starts with selflessness.  </p>  <p>  \t    Module 3: A relationship is the very foundation on which a good sex life is built. Without it, sex is nothing more than an empty, meaningless, unsatisfying and lustful act. In this module, we’ll be putting everything you’ve learned in the first two modules into a single melting pot, to truly understand what it takes to make a relationship work and ultimately explore the unique connection between You &amp; Him.  </p>  <p>  \t    Module 4: The foundation has been laid which means it’s time to get cosy between the sheets! In this module we’ll be discussing probably one of the most important aspects of great sex: Foreplay, before we finally broach the topic of Sex in full colour. Normal sex, oral sex, hand stimulation – things are about to get hot, so pour yourself a tall glass of ice water and get comfortable.  </p>  <p>  \t    Module 5: Tools and toys is a topic that most women shy away from but one that can markedly build excitement and exhilaration in the bedroom. Spoiler alert: This module will introduce you to a number of ways to turn everyday household items into feisty bedroom aids that will make you go nuts and leave him panting for more.  </p>  <p>  \t    Module 6: This module is all about exploring and having fun together as a couple. If you liked the homework sheets up to now, you’ll love what we have in store this time around! Prepare to learn a host of titillating love games, seduction techniques and dares. We’ll also be looking at aphrodisiacs – the commonly known aphrodisiacs and the aphrodisiacs you didn’t even know were aphrodisiacs! Buckle your seatbelts, ladies and gents, because you’re in the fast lane now.  </p>  <p>  \t    Bonus Material: Other than the fabulous content and information provided in the 6 modules above, you will receive bonus information on boudoir photo shoots, a talk from Pastor Christian McCabe where touch on the spiritual side of sex plus more tips and advice. We will add more material as the course grows.  </p>", 
    "end_date": null, 
    "title": "G-school: Improve your relationship and sex life", 
    "price": "35.00", 
    "instructors": "Claire Minnaar, Jeanne Keyser", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/47695_954e_4.jpg", 
    "course_url": "https://www.udemy.com/g-school/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-28T12:16:32Z"
}