{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Is it normal for a child to read the entire Harry Potter series before second grade?  To know every detail about every type of dinosaur?  To burst into tears because something is too cute to bear?  To continually ask why and what if questions?  To interject obscure facts and use big words at the most surprising times?  To refuse to do something for reasons unbeknownst to you?  To be more drawn to older kids and adults than age peers?  </p><p>For a gifted child, yes!  In this course, participants will delve deep into the needs and nature of gifted children, gain strategies to handle those intensities and issues that can get in the way of success and happiness, learn advocacy skills/tactics and determine an educational pathway that will be more likely to foster growth and a continued passion for learning and life.  </p><p>Parenting a gifted child is a unique journey that can sometimes be completely bewildering and overwhelming.  This course serves as a basic roadmap to help you better understand your child and choose the routes that will further cultivate his or her potential and joy.  </p><p>Divided into six sections - What is Gifted?, Intensity &amp; Asynchrony, Perfectionism, Motivation &amp; Mindset, and Pathways - this course contains video content from myself and outside sources, readings and resources for further learning, as well as suggestions for further research, reflection and tasks to try.  It is suitable for parents and anyone working with gifted children.</p>", 
    "end_date": null, 
    "title": "Gifted & Talented 101", 
    "price": "20.00", 
    "instructors": "Penelope Heinigk", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/689878_b408_5.jpg", 
    "course_url": "https://www.udemy.com/gifted-talented-101/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-05T21:35:56Z"
}