{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em><em>[updated November 2015 with new skills</em>] </em><strong>Have you ever wished for that secret formula for getting your children to say please and be polite? You probably don't believe there is one!</strong>  </p>  <p>  \t<strong><em>Watch the PROMO video to see parents share their success stories, don't just take my word for it!</em><br>  \t</strong>  </p>  <p>  \t          How do some parents just seem to do things right and have amazingly polite children?  </p>  <p>  \t          How do you get your children to say please and be polite in such a way that <em><strong>demonstrates</strong></em> <strong><em>YOU being polite</em></strong> and respectful while <strong>teaching </strong>them?  </p>  <p>  \t          Or do you end up resorting to threats, bribes and frustrated 'angry-eyes'?  </p>  <p>  \t          And now those secrets and that step by step plan is revealed in this <em><strong>one easy to follow course</strong></em>!  </p>  <p>  \t          This course was <strong>filmed live</strong> while I taught other parents these skills. You will see that I haven't just <em>'Googled'</em> someone else's theory, scripted it carefully and read it on a teleprompter.... when it's live you get to see it as it is. And most importantly, you will see <strong><em>whether I really know what I am talking about</em></strong> .... or not..  </p>  <p>  \t          I will share with you how to <strong>accelerate their learning</strong>, how to handle some for the curve balls your children may throw back at you, and take you on a journey in <strong>understanding the science</strong> behind why this works so well.  </p>  <p>  \t          If you want to <strong>respectfully get your child to say PLEASE and be POLITE</strong>, then you need to add these emotionally intelligent skills to your skill set.  </p>  <p>  \t          Simply watch and listen to the secrets that have transformed ordinary parents into empowered mom's and dad's who are getting great POLITE results every day!  </p>  <p>  \t<strong>No shortcuts, no 'wishy washy' unproven skills, no nonsense.</strong>  </p>  <p>  \t          Just simple, proven and incredibly effective steps to everyone feeling respected and empowered.  </p>  <p>  \t<strong>As a school principal I trained </strong>all my teachers in these skills and our school was known in South Africa for the respectful and polite children!  </p>  <p>  \t          _____________________________________________________________  </p>  <p>  \t<em>Give yourself a special treat and find out what EVERY parent out there wants to know! </em>  </p>  <p>  \t          Every moment you <strong>delay just reinforces your children's impolite habits</strong> and makes them more difficult to change later on.  </p>  <p>  \t          Imagine how much more successful your children will be in being respectful and polite?  </p>  <p>  \t          All future updates to this course are free - you are \"locked-in\" at the current low price of $89 - but you will never pay more if you <strong>enrol today at the introductory price</strong>.  </p>  <p>  \t<strong>And there's a 30 day absolutely no questions asked full money back guarantee - if you don't get a breakthrough or don't find value, then I didn't do my job in supporting you right! This is my personal promise to you and your children! You really cannot lose!</strong>  </p>  <p>  \t          In fact I am so confident in what I teach that within the first 20 minutes you will learn the sentence and skill that will make you wish you had done this course years ago!  </p>", 
    "end_date": null, 
    "title": "Good manners for kids: Get them to say PLEASE and be POLITE", 
    "price": "45.00", 
    "instructors": "Robin Booth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384730_be7f_7.jpg", 
    "course_url": "https://www.udemy.com/good-manners-for-kids-get-them-to-say-please-and-be-polite/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T09:27:19Z"
}