{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course, I am going to introduce you to several PROVEN steps to take your success with women to a new, un-dreamed of level… but first, let me ask you a few questions:</p><p>Are you frustrated with the results of your dating life? </p><p>Do you find it difficult attracting and keeping the hot girls you desire?</p><p>Are you interested in learning more about human attraction on a primal level?</p><p>Well lucky for you, you are not alone. There are many men looking for women seduction techniques that want to become truly badass with hot women. But, the issue is that there are very few resources that can provide attraction and seduction techniques that are easily applicable with practical life on the market.</p><p>Bottom line is… NOT knowing how to attract women effectively feels bad. It actually sucks. It leaves you feeling like you have no power in your life and it creates an underlying “distraction\" that overwhelms everything else....</p><p>But on the other hand… KNOWING how to attract women feels GOOD. It feels good to not have to constantly buy her things to keep her interested, simply because we have been taught to do so for women over the years… and it feels good not have to lie to her in hopes that she'll like you in return….</p><p>By taking this course, you will be able to flirt with, attract, date, and hookup with any girl you want to. Yes, ANY girl. You will develop the skills of some of the best gurus in the industry that I have mastered over the years also with an edge of my own PROVEN results. I have successfully used these skills on thousands of women around the world with consistent results.  </p><p><strong>What Are The Requirements?</strong></p><ul><li><span></span>Be open minded to new ideas and techniques</li><li>Study and Implement the methods being Introduced</li><li>Take physical notes at least once to improve comprehension</li></ul><strong></strong><strong>What Am I Going To Get From This Course?</strong><ul><li><span></span>Over xx lectures and over xx hours of content!</li><li>A detailed breakdown of what attraction actually is</li><li>The truth about attracting anyone</li><li>Flirting secrets, the competition dosen't want you to know</li><li>How to become the guy that every girl wants</li><li>Methods that will eliminate approach anxiety PERMANENTLY</li><li>How to POWERFULLY connect with anyone, building lasting relationships</li><li>Learn tested methods of naturally Creating Love</li><li>Understanding Proper Methods of escalating</li><li>Gain perspective on attracting women by being yourself</li><li>Understanding confidence, its purpose, and how to obtain it naturally</li><li>A deep understanding of the psychology behind attraction(desire)</li><li>Cut your learning curve in half!</li><li>Guaranteed kiss close techniques</li><li>Stealthy methods of seducing women POWERFULLY</li><li>eye contact and body language tweaks for becoming attractive</li><li>How to \"Blow Her Mind\"</li><li>Plus much much more...</li></ul><strong></strong><strong>What Is The Target Audience?</strong><ul><li>Single men interested in a more dynamic and interesting dating life</li><li>Individuals who have been \"out of the game\" for a while</li><li>Men who are socially awkward and want to instantly change their results</li><li>People interested in becoming more interesting to everyone</li><li>Those interested in improving skills, making it easier to attract someone you like</li></ul>", 
    "end_date": null, 
    "title": "Hacking Dating, Attraction, and Badass Seduction Techniques", 
    "price": "30.00", 
    "instructors": "Sheldon Hylton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/497020_4768.jpg", 
    "course_url": "https://www.udemy.com/hacking-dating-attraction-and-badass-seduction-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-08T18:38:58Z"
}