{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Have you tried online dating and were not happy with the results?<br>  \t</strong><strong>Are you single but don&#039;t have the time or patience to meet people the traditional way?</strong>  </p>  <p>  \t                        Take this super fun course and learn how you can maximize your chances of finding the best possible partner within just 60 days.  </p>  <p>  \t <strong>What will you learn?</strong>  </p>  <p>  \t                         In this course Miguel will teach you all the details of his unique and super effective approach to online dating so you can too finally find the perfect partner.  </p>  <p>  \t                         You will learn great techniques like:  </p>  <ul>  \t<li>How to create a killer dating profile (photos, description, and catch lines)</li>  \t<li>How to find and attract the best possible candidates online</li>  \t<li>How to interpret online profiles to weed out posers and weirdos</li>  \t<li>How to create a self promotional video to maximize responses</li>  \t<li>How to effectively manage all your dates</li>  \t<li>How to become more confident dating offline</li>  \t<li>How to get the most out of your dates</li>  \t<li>How to choose the best times and places to go on dates</li>  \t<li>How to eliminate your fear of rejection online and offline</li>  \t<li>How to avoid the most common mistakes when going a date</li>  \t<li>How to use your logical mind to avoid falling for the wrong guy or girl</li>  \t<li>How to know when it is OK to have sex with a date</li>  \t<li>How to apply the principles of seduction to attract The One</li>  \t<li>How to be sure you have found The One or to keep looking</li>  </ul>  <p>  \t                         Miguel will share many more fun anecdotes and tricks that will help you become super successful in your online dating adventure!  </p>  <p>  \t<strong>Who is this course for?</strong>  </p>  <p>  \t  The course is mostly designed for single men between 25 and 35 years old (or older who haven&#039;t had a lot of dating experience):  </p>  <p>  \t  &ndash; Who are looking for a serious relationship<br>  \t  &ndash; Who are willing to step out of their confort zone and go on many dates<br>  \t&ndash; Who are goal oriented and enjoy methodical approaches to achieve success<br>  \t&ndash; Who prefer using logic and reason to make decisions rather than emotions<br>  \t&ndash; Who are willing to devote at least 2 months to finding a great woman.  </p>  <p>  \t <strong>Why should I listen to Miguel Hernandez?</strong>  </p>  <p>  \t                         Back in 2008 Miguel was single again. Like many busy professionals he did not have the time or patience to go out and meet girls the traditonal way so he tried dating online.<br>  \t                         Miguel developed a system that allowed him to meet 20 wonderful women in only two months.<br>  \t                         One of them eventually became his wife which you will get to meet at the end of this course (ohh.. happy ending).  </p>", 
    "end_date": null, 
    "title": "Hacking Online Dating", 
    "price": "20.00", 
    "instructors": "Miguel Hernandez", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8774_c61a_4.jpg", 
    "course_url": "https://www.udemy.com/hacking-online-dating/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-27T15:50:19Z"
}