{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><p>Are you single and questioning if you’ll ever find true  love? Have you recently gotten divorced, broken up, or lost a partner and are  wondering about new love? Are you in an intimate relationship that’s lost its  luster? Whether you’re looking for a change in your relationship status or in  your relationship itself, this heartfelt Finding True Love- Relationships Advice: Happily  Ever After seminar takes an honest look at what it takes to openly give and  receive love and how to make love last.</p><p></p><p><strong style=\"\">Featuring:</strong></p><p>    </p><ul style=\"\"><li>Arielle Ford, author of <em style=\"\">The Soulmate Secret</em> and <em style=\"\">Wabi Sabi Love</em>, reveals  must-do strategies to attract your life partner or lovingly transform the  relationship you have now.<br style=\"\"></li><li>Pamela Sullivan, licensed Marriage and Family Therapist for over 25  years and happily married for 39 years, shares insights of how to create and  grow relationships based on mutual pleasure and respect.<br style=\"\"></li><li>Darlene and Lance Meltzer, high school sweethearts and married 29 years,  offer advice for making intimate partnership last for the long haul.<br style=\"\"></li><li>Laurie shares strategies for understanding the  opposite sex, tips for singles seeking partners, and how to clear the barriers  that prevent us from finding and rekindling true love.</li></ul><p></p><p><strong style=\"\">NOTE:&nbsp;</strong>This seminar is the last of 6 in Laurie Gardner&#039;s Courageous U series, &quot;Big Shell or Bust: Making and Managing Change.&quot;&nbsp;Enroll in each seminar separately or enjoy the whole series.&nbsp;</p><p>Also note that this seminar was originally offered as a live teleseminar. Udemy participants who have questions should type them on Udemy rather than following the instructions for phone Q &amp; A.</p><p></p><p></p><p><strong style=\"\">What people are saying about “Finding True Love- Relationships Advice Happily Ever After&quot;</strong>:</p><p></p><em style=\"\">“This seminar confirmed for me what I had been feeling about my recent relationship choices and where to go from here.&quot; - S.H., Portland</em><p></p><div style=\"\"><em style=\"\"><em style=\"\"><em style=\"\"><em style=\"\">“Incredibly helpful and inspiring : ) “&nbsp;</em>- J.B., Los Angeles</em></em></em><br style=\"\">  <p></p><p></p></div>  ", 
    "end_date": null, 
    "title": "Happily Ever After", 
    "price": 0, 
    "instructors": "Laurie Gardner", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40629_2b0c_12.jpg", 
    "course_url": "https://www.udemy.com/happily-ever-after/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-08T03:21:37Z"
}