{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Start</strong> the new school year <strong>in a new way</strong>! Show your child <strong>you are here for him/her</strong> and you are prepared to carry his/her burden of school together. Not to give some silly suggestions or orders but just to <strong>share your own experiences, desires, falls</strong>. You will be amazed how <strong>it works!</strong> This course help you to make this way <strong>smooth and full of joy</strong>.</p><p>Read the reviews of this <strong>highly ranked course</strong>!</p><p>What fathers say about this course: <em>\"Having small children I enjoyed the course very much. We want to be good parents and help our children in their teenage years. We want to be able to help them in the future. The course gives us concrete ideas of how to build our relationships and helps us learn how to listen to our children.\"</em> MP</p><p>Many of us have <strong>teenage children at home</strong>. Our cute babies become young adult and decisions about their future career take place. <strong>We want the best for them</strong> but how to recognize <strong>what is the right way?</strong> And what about if they don't want to communicate with us about their desires?May we recognize what kind of job is good for our children just according to their attitude to learning? I believe so. And <strong>I will show you how in this course</strong>. </p><p><strong>Six lectures</strong> in <strong>free preview</strong> mode! The <strong>whole first section is totally free</strong> that you have plenty of time to feel the essence of the course and decide if it is worth your money.</p><p>--- </p><p>You'll find the <strong>deepness of your teenage</strong> child during this course you didn't know about before. <strong>You'll be amazed how gladly your son/daughter will communicate with you</strong> about his/her school. Just <strong>follow the pattern</strong> described in this course. It is more than just self-paced study method, the source of good valuable information and suggestions. It is the <strong>way that leads to life-changing experiences!</strong> <strong>Just jump in</strong>, and the results surprise you.</p><p>--- </p><p>This course consists of <strong>22 lectures</strong> and 20 more as podcast. You find <strong></strong>four lectures as introduction to <strong>live online chats</strong>. I have <strong>removed</strong> live chat from the course and dramatically decreased the course price to make this course available for a much wider range of fathers! You can use these lectures for the inspiration of talks about your child with your wife or friends.  </p><p>The course is designed for <strong>12 sessions you should spend with your child</strong>. You have <strong>one week for each session</strong> of length approximately a <strong>one hour</strong>. So whole course should be finished in three months. You find a short introduction to each session in appropriate course lecture. The introduction explains what, why and how you should share with your child in this time. </p><p><strong>What you get from this course</strong> are: </p><ul><li>New kind of relationship with your child. </li><li>Understanding to school attitudes of your son/daughter. </li><li>Recognizing the particular skills of your son/daughter.</li><li>Shape of the dream job of your child.</li><li>The priorities and goals leading to dream job.</li><li>New study routines established by your child.</li></ul><p><strong>Subscribing</strong> this course, you also support project \"School Can Be Fun\". Other courses are being developed and some of them will be free. So participating <strong>you do something for you</strong>, for <strong>your family</strong> and also <strong>for others</strong>!</p><p>This course is the third one in a project entitled \"School Can Be Fun\". You might consider taking also the first two just for inspiration: “Improve Your Study Skills – Ace Exams\", “Boost Your Study Skills, Learn Deeper Learning Fast\". Or it might be a good gift for your child. You can also find many other tips to help study more effectively on the project's Facebook, Twitter, and YouTube pages. </p><p>And remember, this course comes with a <strong>30-day money back guarantee</strong>. If you do not find it helpful, then you can request a refund. There's nothing to lose! </p>", 
    "end_date": null, 
    "title": "Help Your Son/Daughter to Enjoy School More.", 
    "price": "20.00", 
    "instructors": "Vít Skála, Ph.D.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/444278_dae0.jpg", 
    "course_url": "https://www.udemy.com/motivate-teenager-effective-study/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-10T22:49:04Z"
}