{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"Good course. I thoroughly enjoyed Teresa Trower's style of teaching. A lot of interesting information. 5 Stars Recommended.\"  </strong>Nadeem Paash</em></p><p><em class=\"redactor-inline-converted\">Are you divorced, divorcing, or planning a divorce?</em></p><p><em class=\"redactor-inline-converted\">Are you concerned about  possible negative effects on your child?</em></p><p><em>Do you wish there was a roadmap to help you empower your children?</em><br></p><p>This course is designed for you if you are either divorced, planning to divorce, or simply want to empower your child to deal with the changes that face divorced families.</p><p>As a Licensed Mental Health Counselor and former Elementary school Guidance Counselor, I've seen firsthand what helps, as well as what hurts kids when it comes to divorce. Because I know you want the absolute best for your children, I want to share this information.</p>\n\n\n\n<p> By following the simple rules offered in this course, your child's self esteem will not only remain intact, but continue to grow.  Divorce doesn't have to be a devastating event for your child. Yes, there are changes to adapt to, but I know what's really important to you, as a parent, is your child's confidence, happiness, and ultimate success.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>After completing the course, you will:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>1) know the behaviors that are most damaging to your child.</p>\n\n\n\n\n\n\n\n\n\n<p>2) understand the benefits of getting along with your ex.</p>\n\n\n\n\n\n\n\n\n\n<p>3) have the tools to prevent or reduce your child's anxiety.</p>\n\n\n\n\n\n\n\n\n\n<p>4) appreciate the enormity of your impact as your child's primary role model.</p>\n\n\n\n\n\n\n\n\n\n<p>5) know what to share with your child as well as what not to share.</p>\n\n\n\n\n\n\n\n\n\n<p>6) learn how to best handle dating and re-marriage with your child. </p>\n\n\n\n\n\n\n\n\n\n<p>8) know whether your child is an introvert or an extrovert and how to manage his or her individual  needs.</p>\n\n\n\n\n\n\n\n\n\n<p>9) be aware of the values you wish to pass on to your child.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">By taking this course, you'll have the skills and knowledge to foster high self- esteem in your child, as well as the peace of mind that comes with knowing you're taking positive action in the your child's best interest.</strong><br></p>\n\n\n\n\n\n\n\n<p> The course consists of 8 short animated videos with a brief quiz after each video. The video content takes 33 minutes to complete. The only materials necessary will be a desktop or laptop computer.<br></p>\n\n\n\n\n\n<p>Enroll today and benefit from the Udemy 30 day money back guarantee.<br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Helping Your Child Get Through Your Divorce Successfully.", 
    "price": "20.00", 
    "instructors": "Teresa Trower", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635100_1c30_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-empower-your-child-when-youre-divorced/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T18:10:01Z"
}