{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>    Do you wonder what future awaits our children with the current global economic crisis?  </strong>  </p>  <p>  \t            I do. And I wonder if there is something I can do differently as a parent to equip my daughters with the skills required to survive and thrive in an economy where most of the jobs that will be available to them when they leave school might not even exist yet.  </p>  <p>  \t    We are on economic quicksand, the dream of the corner office and the gold watch and the pension are gone.  </p>  <p>  \t    We need to move quickly and smartly, we need to adapt to the change that is being forced onto us.  </p>  <p>  \t<strong>Ready or not, the “<em>connection age</em>” is here and the rules have changed.  </strong>  </p>  <p>  \t            If your child is old enough to be in school, he or she is old enough to start learning how to be a successful entrepreneur.  </p>  <p>  \t    Teaching your child how to implement good business skills and creativity will be immeasurably valuable skills for the future.  </p>  <p>  \t<em>Of course, not all children will be interested in entrepreneurship, but giving your child the opportunity to discover the world of business early in life is a wise and lasting gift.  </em>  </p>  <p>  \t            Entrepreneurs are not born, they are made. The key skills can and should be taught.  </p>  <p>  \t    We need to teach our children to care enough about their dreams to develop the judgment, skills and attitudes to make them come true.  </p>  <p>  \t<strong>        Give it a try. Your child’s future depends on it!  </strong>  </p>", 
    "end_date": null, 
    "title": "How to teach your child to think like an ENTREPRENEUR", 
    "price": "20.00", 
    "instructors": "Tanya Haffern", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285410_c29d_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-teach-your-child-to-think-like-an-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T18:51:29Z"
}