{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is for singles who want to find a long time love. I teach which photos, headlines and profile descriptions win the attraction of women, no matter your age, look, race, income, height, weight. </p><p style=\"\">You will learn within a day how to position yourself online so that you have success with women on day 1 and you will learn when are the most singles are online to search for their partner and much more.</p><p style=\"\">I teach by video and and by written material.</p><p style=\"\">Within 2 weeks you will find a new love online.</p><p style=\"\">It is very common to get per day 5 messages from women who want to meet you in real life when you apply what you learn in my online dating course.</p><p style=\"\">You will also learn which sites have the most adorable women who do not only have an online profile but also are looking on a daily basis for their dream match. You will know also which sites to avoid in the online dating field, because some sites have fake profiles and only want your money.</p><p style=\"\">Once you picked your favourite women out of the many messages you will receive online, it is time to date offline. Also this topic is covered in my course, because here starts the strategic action. You will learn that you can choose between many options (women) and to make sure she is the right one you are looking for. </p><p style=\"\">In general: if you are looking for fast online dating success, then this is the course which will make you and your future dream woman happy for a lifetime. </p><p style=\"\"></p>", 
    "end_date": null, 
    "title": "How to sucessfully date online and offline", 
    "price": "20.00", 
    "instructors": "Soeren Gelder", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546810_edb0.jpg", 
    "course_url": "https://www.udemy.com/forgetyourdatinglife/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T15:41:35Z"
}