{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Choosing a name for your baby can be a daunting task. There are personal preferences to sort out, there is family and friends, who provide (un)wanted advice, to reckon with and last but not least the choice is so wide that sometimes one has difficulty to pick because one wants them all. This course aims to overcome this challenge, by introducing handy tips and resources to make the whole process easier and faster.</p><p><strong style=\"\">Master the Art of Picking a Name for Your Baby in this Comprehensive Course</strong></p><ul style=\"\"><li> Family and Family Tree, Traditions and Trends</li></ul><ul style=\"\"><li> Initials, Partners, Overkill</li></ul> <ul style=\"\"><li> Subsequent Babies and Twins</li></ul>  <ul style=\"\"><li>     Unusual, Unique Baby Names</li></ul>  <ul style=\"\"><li>     Names to Definitely Avoid</li></ul>  <ul style=\"\"><li> Other Tips, Tricks and Handy Tests</li></ul>  <ul style=\"\"><li> Fun Facts</li></ul><p><strong style=\"\">Mastering the Art of Picking a Name for Your Baby</strong></p><p style=\"\">Broken down, this course is all about how to make it easier for you to choose a name for your little one that you will like. You will also learn how to argument, in case somebody feels the need to advise you about the proper name for your baby and why you should choose their suggestion over yours. The principal tips of the course have been tried and tested not only by myself (although we made the very final selection on route to maternity hospital) but also by other expectant mammmas and their partners. </p><p style=\"\">This course is perfect for anyone who seeks to learn something new about the process of naming, about names and their origins and what naming conventions are used in some parts of the world like e.g. Italy.</p><p><strong style=\"\">Contents and Overview</strong></p><p>This course contains 15 lectures and over 45 minutes of content. It&#039;s designed for anyone, regardless of experience level, who wishes to learn about names and selecting appropriate baby names in particular.</p><p>Starting with basic tips regarding how to name a baby, this course then covers the &quot;rules&quot; applying to family traditions, partners, initials. Further on the students will learn how to name their subsequent babies or twins and what types of names to definitely avoid for their baby.</p><p style=\"\">Also included are fun fact lessons and extra materials, such as handouts, mp3 files of the course to listen to, and software to use with the course.<br style=\"\"><strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "How To Name Your Baby?", 
    "price": "20.00", 
    "instructors": "Blanka Salkova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/438890_44bf_2.jpg", 
    "course_url": "https://www.udemy.com/baby-names-101/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-04T19:59:38Z"
}