{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is a bullying prevention guide for parents and caregivers.  You will learn why bullying is such a widespread problem and the ways in which children, parents and communities can all be part of the solution.  </p>  <p><strong>Learn How to Help Kids Who Are Bullied, Kids Who Bully, and Kids Who Witness Bullying</strong></p>    <ul><li>Bullying is a serious problem that is not going to go away on its own</li><li>No one deserves to be bullied and it must be stopped</li><li>Bullying is a learned behavior</li><li>All kids involved in bullying need help</li><li>Parents and caregivers can make a difference as soon as they know what to do</li></ul>          <p><strong>Bullying is an  anti-social problem and it needs a social solution</strong></p>  <p>At some point in their lives almost all of us are involved in bullying in some way or another.  Being bullied as an adult is horrible, but even more excruciating is the pain we feel when a child we know is being mistreated by their peers and we don’t know how to help.  </p>  <p>Bullying is aggressive behavior that involves a pattern of repeated unwanted, negative actions in which there is a power imbalance and usually more than one perpetrator.  In order to stop this pattern, it is crucial to understand all parties involved and to help each make smart decisions about how to respond.</p>  <p>There is no job more crucial than protecting our children from physical and emotional harm.  I have designed this course as a way to share what I have learned, both as a parent and a professional so that we can stay as informed as possible about what our children need from us in order to socially thrive.  </p>  <p><strong>Course Overview</strong></p>  <p>This bullying prevention course is divided into three sections.  In the first section you will learn the basics about what bullying is, how it impacts our children and the three main roles kids play.</p>  <p>In the second section we look in more depth at each of the three roles; kids who are bullied, kids who bully, and kids who witness bullying.  You will learn what to say and what not to say to kids who are in each of these situations.</p>  <p>In the third section we look at prevention strategies to implement on a regular basis with all kids.  HINT:  This is done without using the word “bullying”.</p>  <p>By the end of this course you will be able to approach the children under your care with confidence and knowledge.    When children understand that they deserve dignity and respect, they will be better able to know their own self-worth as well as how to treat others with kindness. </p>  <p>I hope you will join our class! </p>", 
    "end_date": null, 
    "title": "How to Prevent Bullying (Without Using the Word Bullying)", 
    "price": "20.00", 
    "instructors": "Laura Silverstein, LCSW", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712670_1922_3.jpg", 
    "course_url": "https://www.udemy.com/bullying-prevention-begins-in-the-home/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-01T20:32:54Z"
}