{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You didn't get married to settle for average. You wanted excitement. You wanted adventure. You wanted romance and sex to be fun, fulfilling and thrilling. You wanted to experience something greater than you could just on your own.</p><p>Somewhere along the way though, the realities of life set in. Work responsibilities. Financial pressures. Raising children. Maybe a health issue or two. It all took a toll on your marriage and maybe today, you feel stuck or hopeless.</p><p>The good news is that you don't have to stay where you are! Feelings of love and excitement can be rekindled. These 7 choices will set your relationship on a new course toward intoxicating. It's never too late. You can begin experiencing an intoxicating marriage right now.</p><p>Over these 11 video sessions, you will learn how to:</p><ul><li>involve God in your marriage and why it's critically important</li><li>communicate effectively in ways to be understood and reduce conflicts</li><li>understand how negative emotions effect your marriage and what to do about them</li><li>understand and meet each others greatest needs</li><li>have a mutually satisfying and exciting sex life</li></ul><p>In addition to the video sessions, you'll also receive:</p><ul><li>the eBook, \"I Believe God: a 40-day adventure\"</li><li>the eBook, \"The Marriage Experiment: a 30-day intimate adventure\"</li><li>worksheets and other content to strengthen your spiritual, emotional and sexual bond</li></ul><p>You can complete this course in a few days and begin experiencing an intoxicating marriage. Why wait any longer to begin creating the kind of marriage you've always wanted?</p>", 
    "end_date": null, 
    "title": "How to Have an Intoxicating Marriage", 
    "price": "20.00", 
    "instructors": "Gregg Stutts", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/513708_37a7_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-have-an-intoxicating-marriage/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-28T14:58:44Z"
}