{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You are the very best person to support &amp; guide your child on this subject; better than school teachers; better than their friends and better than anything that they might find on the internet.<br></p><p>With this in mind - do not leave your child's drug &amp; alcohol education to chance! This type of instruction - on key life skills - takes time and care and can be embedded within your parenting.</p><p><strong>How to Talk to Your Teen about Drugs </strong></p><ul><li><strong>GET CLEAR</strong> about the role you play in shaping your child's future life choices.</li><li><strong>GET CONFIDENT</strong> to address this issues by planning &amp; then sharing your key messages.</li><li><strong>GET TOOLS</strong> &amp; resources that will support you to connect, guide &amp; protect your child.</li></ul><p><br><strong> How to Talk to Your Teen about Drugs   </strong></p><p>This course has been specifically designed and tailored with parents and carers in mind. It offers you step-by-step guidance to put you in a position of being able to talk to your child about issues that they will be talking about with their peers. Use this course to get in on that conversation. Share your morals and your values - allow your child the opportunity to benefit from your wisdom. </p><p>'Drugs' is one of the taboo subjects that parents avoid talking about with their children. This course supports you to address this subject without it simply being a list of things that your child should not do. You will be supported on how to engage them in conversation and how to positively challenge their thinking.    </p><p>Follow the course guidance and have a far better chance of protecting your child from risk. Through your conversations your relationship will improve as your child will begin to view you as somebody that they can trust and turn to for advice; somebody who will not panic at the mention of the 'drug' word and somebody who can talk sensibly and rationally - giving sound advice. </p><p>Drugs education at school certainly has it's place but research shows that your input, when you do it right, will be far more effective than anything that the school curriculum can offer. Your input into these informative adolescent years are crucial.</p><p><strong>Contents &amp; Overview </strong>  </p><p>This course contains 11 lectures and over an hours worth of content. The real value that you will get out of this course will come from using the Parent &amp; Teen Relationship Toolkit which offers over 50 pages of activities for you and your child to complete. </p><p>The toolkit is broken down into three parts. </p><p><strong>Part 1</strong> is where you work alone - refining the key messages that you want to share with your child based on the knowledge you gain from the lectures and your own life experience and wisdom.</p><p><strong>Part 2 </strong>is about getting confident - understanding how to best deliver your message based on the 'Starburst 5-Step Process'. You will learn how to challenge your child's thinking and belief systems should you need to and how best to engage them in open conversation.</p><p><strong>Part 3</strong> is for you to then begin working with your child. There are a range of activities that you can engage them in. From the activities your child will have enough information to make their own informed life-choices. </p><p>This course has been designed to support you and your child to develop and strengthen the relationship that you have together; both gaining in trust and respect for each other.<br></p><p>Ultimately, this course will give you peace of mind that you have been proactive in the fight to protect your child from modern-day teen risks.</p>", 
    "end_date": null, 
    "title": "How to Talk to Teens & Pre-Teenagers About Drugs", 
    "price": "50.00", 
    "instructors": "Anika Vassell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586652_8e39_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-talk-to-your-teen-about-drugs/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T18:48:38Z"
}