{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Did you know that today, over 50% of marriages and relationships fail?</strong>  </p>  <p>  \t  That is a staggering number!<strong> </strong>  </p>  <p>  \t<strong></strong>Why is it that relationships have to be so hard?  </p>  <p>  \t  Do you want to reignite the love, passion and romance in your relationship for deep, long-lasting fulfillment?  </p>  <p>  \t<strong>It&#039;s time to get the tools to better equip yourself.</strong>  </p>  <p>  \t<em>Most importantly, it will help you to have deeper, long-lasting fulfillment in your relationships.</em>  </p>  <p>  \t<strong>What If It Doesn&#039;t Come Naturally?</strong>  </p>  <p>  \t  The tools and skills you need to transform your relationship don&#039;t need to come naturally, they CAN be learned.  </p>  <p>  \t  My research is based on my own life, those of my clients and countless books by experts on creating deep and passionate relationships.  </p>  <p>  \t  I have literally seen miracles happen to turn marriages and relationships around and have helped hundreds of people all over the world do the same!  </p>  <p>  \t<strong>Relationship Myths:</strong>  </p>  <ul>  \t<li><em><strong></strong>Relationship Myth #1: I&#039;m just not any good at relationships. </em>With a little effort, desire and determination you CAN learn to be great at relationships and turn your relationship around into one that is the happiest, most healthy and loving you&#039;ve ever been in.</li>  </ul>  <ul>  \t<li><em>Relationship Myth #2: If the passion in my relationship has died, the relationship must not be working anymore.</em> It is natural after a few years that the intense feeling of your relationship may fade. This is okay - I will show you ways to re-ignite the passion and romance in your relationship.</li>  </ul>  <ul>  \t<li>Relationship Myth #3: <em>There are patterns in my relationship that simply cannot be overcome. </em>Miracles happen! Anything can change and be overcome, but it has to start with YOU. I have seen marriages go from the brink of collapse to revitalized and fresh.</li>  </ul>  <p>  \t<strong>Why Are Relationships So Important?</strong>  </p>  <p>  \t  It is important that we understand how to improve our relationships because they are literally the emotional cornerstone of our lives, bringing us happiness, love and fulfillment. Unfortunately, only 50% of relationships make it. In my practice as a Life CoachI have more people write into me about relationship struggles than anything else! Therefore I have made it my personal mission to help others transform their relationships.  </p>  <p>  \t<strong>Join me in How to Reignite the Love in Your Relationship!</strong>  </p>", 
    "end_date": null, 
    "title": "How to Create a Happier Relationship in 5 Easy Steps", 
    "price": "20.00", 
    "instructors": "Alexis Meads", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259688_8e44_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-reignite-the-love-in-your-relationship/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-11T14:01:54Z"
}