{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>“This course is not sponsored by or affiliated with Udemy, Inc.” A relationship help class to revitalize your marriage or relationship right into hot monogamy. Find your soul mate in your very own home. This class is designed for a couple to experience together. You will learn <strong>effective communication</strong>,<strong> fair fighting</strong>, and how to <strong>deepen your emotional intimacy</strong>. Your relationship will revitalize into <strong>HOT monogamy</strong>. Find your soul mate in your very own home with this relationship help course. <strong>Get the love you deserve.</strong></p>\n\n<p>If we ignore pleasure, we are not fully developed emotionally. Pleasure is a wonderful ingredient in a healthy relationship. Today we sometimes get the message, “men give pleasure and women receive.\" Some men don't give themselves permission to receive pleasure. When they do, their <strong>relationship deepens </strong>and becomes more intimate and solid. </p>\n\n<p><strong><em>Pleasure makes us whole. </em></strong></p>\n\n<p><strong>Some relationship help enhancement exercises in this class:</strong><br></p>\n\n<p>1. Talking, <strong>sharing from the heart,</strong> and even working through issues together can <strong>increase our emotional intimacy</strong>.</p>\n\n<p>2. Breathe together: Take time to BE together. Notice each other's breath. Close out the hectic/everyday world and just be with each other. </p>\n\n<p>3. Heart salute: Sharing what pleases <em>you</em> about your partner.</p>\n\n<p>4. Four hour pleasure homework: THE BEST PART.</p>\n\n<p>Let's go see………….</p>", 
    "end_date": null, 
    "title": "How to Create Your Soul Mate w Your Current Partner, couples", 
    "price": "30.00", 
    "instructors": "Yvonne Sinclair M.A., LMFT", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518128_1520_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-soul-mate-with-your-current-partner-discover-joy/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T15:30:04Z"
}