{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>How to overcome relationship turmoil and get your life back</strong></p>      <p>Welcome to the Relationship course where you will learn all you need to know to develop great relationships, romantic ones, with people, with yourself and even with things. </p>    <p>My name is Flavio Souza-Campos; I will be your instructor.</p>    <p>Do you know a person who cannot get along with someone else but at the same time can’t let them go? </p>    <p>We think of couples in these cases, but it happens to anyone: parent/child, siblings, co-workers, neighbors, friends, anyone who inhabits the Earth.  </p>    <p>We call this “relationship turmoil”, and relationship turmoil has been associated with anything from decreased productivity and financial distress to poor health and early death. Just watch to movie <u>War of the Roses</u> to know what we mean. </p>    <p>For almost 20 years we have helped people in relationship turmoil. We offer a unique way of solving this problem. We start with the idea that there are no true “relationship problems”, there are personal problems that affect relationships. Not all personal problems make a relationship difficult or nearly impossible. Usually the culprit is one personal difficulty, the effects of which on the relationship the participants remain unaware, leading to a lifetime of suffering.</p>    <p>In this course I present a series of in depth discussions informed by over 31000 therapeutic sessions with over 7000 clients. As you listen to these discussions you will ask yourself “how could this apply to me?”</p>    <p>The course will take you into a deep introspection of your own life, so that you can identify the aspects of your person that make your relationships difficult. You will then learn how to change yourself.</p>    <p>I begun developing this methodology in the late 90’s, and by 1998 published a paper on this topic and later presented this material in several conferences to other therapists. The use of these techniques has generated much happiness to many people; it will do the same for you. </p>    <p>This course is presented in a unique way: just you and I, looking at one another. Experience as a therapist suggests that eye contact and lack of distractions generates maximum benefit to you. </p>    <p>There are no requirements to enroll, other than an open mind, a loving heart and a sincere desire to be a better person. Mastering the concepts presented however, may require patience. Of course I will be available to help in case you need… just send a message!    </p>    <p>Fell free to look through the course description and preview some classes.</p>    <p>Signing up is easy; udemy offers lifetime access to the course, free updates and new materials as they become available.</p>    <p>The fee is refundable, so you have nothing to loose. </p>    Just click on the green button on your top right and let’s begin; Congratulations!", 
    "end_date": null, 
    "title": "How to have awesome relationships while keeping your dignity", 
    "price": "30.00", 
    "instructors": "Flavio Souza-Campos, Ph.D.", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756640_ebc1_2.jpg", 
    "course_url": "https://www.udemy.com/healrelationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T01:47:57Z"
}