{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learning how to attract a higher quality woman or even keeping the one you have happy can be a real pain for men. This course is the simplest solution to being alone, striking out with women, and knowing exactly how to create powerful bonds with great women. </p><p>In this course you'll learn how to build <strong>Compound Attraction with almost any woman.</strong> So, if you'd like to:</p><ul><li>Increase your success with women, transcend your looks, finances or current dating circumstances... </li><li>Quickly learn how to create Gravitas without using pick up techniques</li><li>Create uncontrollable attraction that continues to grow stronger</li><li>Become the full package man that women swoon for</li></ul><p>Lessons are all taught on HD video with bonus audio MP3. Everything will be<strong> fun, simple and straight to the point. </strong>This course will take you two to three weeks to complete, however, you'll have continued access for life so you can revisit specific subjects, lessons and modules as you need.</p><p>Over 40 mind blowing lectures and tools you can start using today with no fluff and no confusion. Becoming the legendary man that high quality women are looking for has never been more important. If you're looking to turn your dating or relationship life around, this is the safest place to learn the nuts and bolts of how to Make Your Move!</p><p><br></p>", 
    "end_date": null, 
    "title": "How To Create Compound Attraction With Almost Any Woman!", 
    "price": "20.00", 
    "instructors": "Corey Teramana", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/602968_a5a2_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-compound-attraction-with-almost-any-woman/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T02:36:36Z"
}