{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  Raising Children can be tough, but it doesn’t have to be tragic. In this course we will explore the parenting strategies of the parents of one of the greatest men to have ever lived, Moses. We’ll discover principles and actions we can take away fir immediate practice in parenting.  </p>  <p style=\"\">  \t<strong style=\"\">Put Your Faith to Work While Parenting Your Children.</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t  ·Learn what Moses’ parents did to protect their child  \t</p>  \t<p style=\"\">  \t\t  ·See how God blessed and helped them raise their child  \t</p>  \t<p style=\"\">  \t\t  ·Make these lessons practical  - worksheets included with most lectures  \t</p>  </ul>  <p style=\"\">  \t<strong style=\"\">Trust God’s promise for success in Biblical child raising.</strong>  </p>  <p style=\"\">  \t  The post Joseph years in Egypt were difficult ones for the Jewish people. The work was tough, the government was harsh and raising children well was perhaps more difficult than any other time in history. But Amram and Jochebed successfully raised three children. One of them was destined to lead Israel from slavery.  </p>  <p style=\"\">  \t  The Biblical accounts of the Old Testament are intended for more than our intellectual advancement. God recorded and preserved them so that we may learn from them to be better persons, parents and followers of the Lord.  </p>  <p style=\"\">  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p style=\"\">  \t  This course includes approximately 30 minutes of lectures. You will find helpful worksheets to aide you in brainstorming how to make the lessons of Moses’ parents personal and practical.  </p>  <p style=\"\">  \t  You will gain insights for personal growth in your parenting skills and relationships with your children. You will learn to practice your faith despite difficult and heartbreaking circumstances. You will find inspiration to begin parenting purposefully early in your children’s lives. You will also learn to faithfully prepare you children and yourself for that day when they are to be released to accomplish God’s plan for them.  </p>", 
    "end_date": null, 
    "title": "How to Parent by Faith; Moses' parents show you how.", 
    "price": "20.00", 
    "instructors": "Marvin McKenzie", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/364124_63f5_3.jpg", 
    "course_url": "https://www.udemy.com/a-parents-faith-parenting-in-difficult-circumstances/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-05T18:04:26Z"
}