{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tWhile we are under parental care we are driven to learn behaviours  that give us the best chance of survival. It’s a very primitive drive  based on the caveman days where if our parents didn’t bond with us we  would die.  </p>  <p style=\"\">  \tThese days it’s more complex of course.  </p>  <p style=\"\">  \tAs a  therapist and a person who experienced an abusive childhood, I am very  aware how easy it is to screw up our kids – without even trying! I  certainly know that I was very worried about the effect my upbringing  would have when I had to be a parent myself. <br style=\"\">  \t<br style=\"\">  \tThere is no right  or wrong answer to parenting. We all do our best. It&#039;s just that  sometimes we aren&#039;t aware of the consequences of what we do.<br style=\"\">  \t<br style=\"\">  \tThrough my role as a Cognitive Hypnotherapist I get to see the consequences. <br style=\"\">  \t<br style=\"\">  \tIn  this course what I have tried to do is give you some simple and  practical techniques to bring up your kids in a way that makes them  resilient enough to cope with whatever life throws at them <br style=\"\">  \t<br style=\"\">  \tWhat I  hope is that through these techniques you can do as much as possible to  stop your kids ending up on a couch to seek help from someone like me  one day!  </p>", 
    "end_date": null, 
    "title": "How to avoid screwing up your kids", 
    "price": "45.00", 
    "instructors": "Dawn Walton", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74586_a148_6.jpg", 
    "course_url": "https://www.udemy.com/resilient-parenting/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T17:15:53Z"
}