{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"Since starting the course I can't tell you how many times my children just listen to me without resistance\"</em> - A parent testimonial</p><p><em>And now with English subtitles (Close Captions). This course is used in over 280 schools in South Africa and as part of the teacher training programes!</em></p><em></em>  <p>  \t<strong>Have you ever wondered if there is a secret formula for getting your children to listen and cooperate with you? </strong>  </p>  <p>  \t<em>From a parent who has just finished the course:\"Hi Robin, so far I've been using the first skill with tremendous success. It's kinda ridiculous! :-)\"</em>  </p>  <p>  \t                How do some parents just make it look easy and their children are still so happy and cooperative?  </p>  <p>  \t                      How about knowing the formula that will save you up to and over 80 minutes of time per day, each and every day? (no tricks, no bribes, no threats, no hitting)  </p>  <p>  \t                      And now those secrets and that step by step formula are revealed in one easy to follow course!  </p>  <p>  \t                      If you want to be respectfully in charge and not just HOPE your children will change, if you want to consciously know how to unlock those power struggles and get that smile on their face, then this course is for you!  </p>  <p>  \t                      Simply watch and listen to the secrets that have transformed ordinary parents into empowered mom's and dad's who are getting great results every day!  </p>  <p>  \t<strong>No shortcuts, no 'wishy washy' unproven skills, no nonsense.</strong>  </p>  <p>  \t                      Just simple, proven and incredibly effective steps to boundaries, success and a smile back on YOUR face!  </p>  <p>  \t                      _____________________________________________________________  </p>  <p>  \t<em>Give yourself a fresh start by enrolling in this life-changing course now.</em>  </p>  <p>  \t                      Every moment you delay, not only do you lose out, but so does the future success of your child.  </p>  <p>  \t                      All future updates to this course are free - you are \"locked-in\" at the current low price of $89- but you will never pay more if you <strong>enrol today at the introductory price</strong>.  </p>  <p>  \t<strong>And there's a 30 day absolutely no questions asked full money back guarantee - if you don't get a breakthrough or don't find value, then I didn't do my job in supporting you right! This is my personal promise to you and your children! You really cannot lose!</strong>  </p>  <p>  \t                      In fact I am so confident that in what I teach that within the first 20 minutes you will learn a skill that will save you 20 minutes of time per day, everyday.  </p>", 
    "end_date": null, 
    "title": "How to get your kids to cooperate-even if they don't want to", 
    "price": "45.00", 
    "instructors": "Robin Booth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319042_97b9_7.jpg", 
    "course_url": "https://www.udemy.com/the-top-skills-to-get-your-children-to-listen-and-cooperate/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T18:48:00Z"
}