{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    This is a Gift from Me to You...  </p>  <p>  \t<strong style=\"\">  You can see all the complete lectures without cost as preview, all of them has free access.  </strong>  </p>  <p>  \t    I made this course for you, and I want you to see it without any cost.  </p>  <p>  \t    If you find this course valuable you can purchase it. That will be your gift to Me, and it will help me to keep developing more courses for you!. Adding a review will help also!  </p>  <p>  \t<strong style=\"\">  Please let me know your comments and How I can improve this course for you!  </strong>  </p>  <p>  \t    Enjoy it!  </p>  <p>  \t    Manuel.  </p>  <p>  \t    ----------------------------  </p>  <p>  \t        The Self Esteem has a huge impact in the future of our chidren. We all desire happiness for our children. In order to get that, they need our help todevelop TODAY a healthy self esteem.  </p>  <p>  \t            On this course you will learn:  </p>  <ul style=\"\">  \t<li>Why is so important the self esteem in your children, since it can be the difference between a happy and successful life for your children and something completely different.</li>  \t<li>What are the effects of the low self esteem in your children, and how this could cause even bigger problems when  the children becomes adult.</li>  \t<li>How to detect low self esteem situations in our children, to react and help them to solve it.</li>  \t<li>I´m adding more than 10 techniques that you can use to help your children to have a healthy and strong self esteem.</li>  \t<li>Each technique is followed by a very short and easy test, to reinforce the lecture.</li>  </ul>  <p>  \t            You can be the difference in the life of your children, we can, and we most learn how to help our children to be happy, succesful and achieve their goals... and dreams  </p>", 
    "end_date": null, 
    "title": "How to Improve the Self Esteem of your Children", 
    "price": "20.00", 
    "instructors": "I.E. Manuel Echeverría", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198944_a857_8.jpg", 
    "course_url": "https://www.udemy.com/how-to-increase-your-childs-self-esteem/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T20:26:09Z"
}