{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Hello and thank you for considering this course. Obviously if you've come this far, you are trusting me to deliver some real ways to heal your broken heart.</p>\n\n<p>First of all I thought I'd tell you a little more about me. My name is Paula Moore (aka The Posture Doctor). Right off the bat, let me say I'm not a psychotherapist or counselor and I don't claim to be offering any psychological assessment or advise. This course does not take the place of therapy, so if you think you need help just surviving at this point, you may need to see your doctor for a referral.</p>\n\n\n\n<p>All that being said, I am a healthcare practitioner and happen to be very experienced in healing broken hearts, because I've been in love 9 times! I'm exhausted just thinking about all of days I've spent crying over the years. </p>\n\n<p>Up until a few years ago, I thought I was really lousy at<br>relationships and commitment, until one day on a course about commitment, I realized it wasn't that I couldn't commit, it was that I was so committed; I couldn't leave, even when I knew it was time to go.</p>\n\n\n\n\n\n\n\n<p>Anyway, the upside of being in love 9 times, is that I've created a sort of science out of healing a broken heart. My last relationship was quite wonderful – we were just in different life places. My journey after this most recent breakup has been so profoundly healing, that I just had to<br>share what helped me get to such a wonderful place, in the hopes that you too can heal your own broken heart and prepare for and invite the next love of your life, into a healthy, open place.</p>\n\n\n\n\n\n\n\n<p>The course is set up like a survival guide of sorts and it will take you through 27 real ways to heal your broken heart. The lectures come in audio, ebook, animation and video format and include tips, suggested behaviours and tasks, things to avoid and exercises and projects for you to take on. This is not a passive course. If you simply want to listen and not do much, this isn't the course for you.</p>\n\n\n\n\n\n\n\n<p>If you really want to start feeling better, you should be prepared to commit to the course for one full month. The first month post breakup is the hardest. It's a time when we all need support. If you take on all the exercises and truly engage in the work, you will begin to heal and come out the other side happier and healthier.</p>\n\n\n\n\n\n\n\n<p>I hope you'll share some of your journey with me and the other students on the course, by opening up conversations and posting questions and comments as you work through the lectures. I'd love this to be a safe place where we all heal our broken hearts together and discover new found happiness and joy and perhaps even love again.</p><p>I invite you now to join me – go ahead and click on the green button that says: <strong>Take This Course</strong>.  I look forward to supporting you!</p>\n\n\n\n<p>Dr Paula x</p>\n\n\n\n\n\n\n\n", 
    "end_date": null, 
    "title": "How To Breakup Survival Guide", 
    "price": "20.00", 
    "instructors": "Dr Paula Moore", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735966_69d4_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-breakup-survival-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T19:56:24Z"
}