{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\n</p><p style=\"\">Here is the\nsituation:  You are at work and only two\nthings have been checked off your long to do list.  The phone rings and your heart ramps up when\nyou see your child’s school number on the caller id.  You almost can’t hear over your heartbeat,\nuntil the speaker says “she’s okay, but we’re having a problem.”</p><p>\n\n</p><p style=\"\">Perhaps, you\nknow this scenario.  You know how painful\nand upsetting it can be when your child causes problems and you only want peace.    You know that sinking feeling, when you can’t\nfigure out how to help them.  This course\nis designed to help parents be what their children need to live their best\nlife.  </p><p>\n\n</p><p style=\"\">In the first\npart of How to Help Your Children Succeed, you will learn what motivates and\ndrives your child’s behavior.   We will\nlearn how to use this information to address behavior issues with our\nchildren.   Creating positive behaviors while avoiding contributing\nto negative ones, will also be covered.     This course will also explain the difference\nbetween punishment and discipline and how to change our thinking in order to\nchange their behavior.  You will also\nlearn the power of vision and how to use vision to direct your parenting.  </p><p>\n\n</p><p style=\"\">We will\ncover several tools that have been proven to help children manage their\nbehavior, feel responsible, and capable. \nEven if you familiar with these tools, you will have a chance to examine\nif you are efficient with them and learn about pitfalls.  </p><p>\n\n</p><p style=\"\">As parents\nyou have a lot to do and you may be tempted to downplay the importance of\ntaking care of yourself.   We will learn\nthe art of self-preservation and develop a plan to care for ourselves as we care\nof our families.  </p><p>\n\n</p>", 
    "end_date": null, 
    "title": "How to Help Your Child Succeed", 
    "price": "20.00", 
    "instructors": "Nichole Gause", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655546_08c6_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-help-your-child-succeed/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T13:56:52Z"
}