{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Let me be the Guide to Your Amazing Birth Experience</strong><br></p>\n\n<p>Why do this course? The results speak for themselves from hospitals, midwives, mothers and fathers &amp; I invite you to read the testimonials and birth stories. Happy clients, both parents, teachers and midwives are the true testament to how well Hypnobirthing works.</p>\n\n\n\n<p>Katharine Graves, founder of KG Hypnobirthing and the Hypnobirthing Association has developed and adapted the course over the years in response to client feedback and the needs of mothers and babies. Her outstanding knowledge and skills have resulted in KG Hypnobirthing, a comprehensive, in-depth antenatal course being accepted as the premier course for professionals and parents alike.<br><br><strong>Benefits of KG Hypnobirthing for Your Baby and You</strong><br></p>\n\n\n\n\n\n<ul><li>You are likely to experience a more comfortable and sometimes pain free birth.</li><li>Your baby will arrive to a serene and relaxed environment, alert and ready to bond with you as nature intended.</li><li>Length of labour is often much shorter with Hypnobirthing births.</li><li>Less drugs and medical intervention are used in Hypnobirthing births allowing your baby to develop naturally and easily after they arrive.</li><li>Mums often bounce back quicker after a Hypnobirthing birth as the physical impact of giving birth is reduced.</li><li>Your birth partner will learn how to support you and have a central and active role in the birth. A truly shared and loving experience.</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This program is for you if…</strong></p>\n\n\n\n\n\n<p>…you’re having difficulty believing in yourself and your ability to give birth<br>…you’d like to know exactly what to do before you give birth to prepare for a straight forward (or other type) and safe birth meaning happy mummy, daddy and baby<br>…you have fears and worries around the giving birth<br>…you’re not sure what to do to cope with labour pains<br>...you'd like your partner to support you, but you are not sure how to get him/her on board</p>\n\n\n\n\n\n<p>The benefits to you are obvious, but the long term benefits to your baby cannot be over-estimated. I repeatedly get wonderful birth stories of Hypnobirthing babies being calm, content and sleeping really well. They seem to thrive better. It may seem miraculous but this is how Hypnobirthing is designed to be.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Join me today!</strong><br><em></em></p>", 
    "end_date": null, 
    "title": "Hypnobirthing: Your Guide to a Positive Birth Experience!", 
    "price": "20.00", 
    "instructors": "Susanne Grant", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/580546_16f7_5.jpg", 
    "course_url": "https://www.udemy.com/hypnobirthing-your-guide-to-an-amazing-birth-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T21:15:02Z"
}