{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Hypnosis- Sexual Fulfillment For Females Using Self Hypnosis' By Pradeep Aggarwal , you will learn that-</p><ul><li>The sexual fulfillment of women is vital for harmony in love relationships. Many females suffer from the sexual frustration and dissatisfaction. This course is designed to help female overcome the problem of sexual dissatisfaction and frustration using Self Hypnosis, Imagery and Affirmations.</li><li><strong>Causes of Sexual Dissatisfaction in Female:</strong></li> <li>Sexual frustration in female can be due to:</li> <li>Not having a partner with whom she can express herself sexually,</li> <li>Having a partner who is not satisfying her sexual needs,</li> <li>Or some psychological reasons like guilt, depression, stress, frustration, anxiety, self consciousness, fear of sex etc. <br> </li><li>It is important to reflect on what might be causing this frustration in your life and take steps to help you (and your partner) feel better.</li><li>This course if for everyone who are facing problems in their sex life due to the above reasons and want to overcome it using powerful self hypnosis techniques and positive affirmations.</li></ul><div>You will also learn more about your conscious and sub conscious mind and the myths and perceptions surrounding self hypnosis.</div><p>By the end of the course you will be able to overcome all these problems and enjoy a healthy sex life and a happy married life.</p><p>This course is ideal for women who want to increase their desire for sex and also lead a happy married life.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English and a bonus e-book on positive affirmations.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Sexual Fulfillment For Females Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611484_479a.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-sexual-fulfillment-for-females-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-14T08:44:40Z"
}