{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"></em></p>\n\n<p><em>Your daughter has a brain tumour.</em><strong><em></em></strong>\n</p>\n\n\n\n\n\n\n\n\n\n<p>That life altering event is a key reason why this program was born. We offer skills to help the whole family or group.  Each of  you and all of you can use them to deal with life's toughest issues.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>The program offers insights into what we all all experience.  </strong>You'll learn</p>\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>The process as we experience life's losses and griefs</li><li>Discover 3 Key States that build our health and happiness</li><li>Understand how 3 Key States can block us from health and happiness</li><li>Eight skills in video to help you shift from being in a bad state to a better state </li><li>Two text based skills to assist you further deepen your ability to thrive </li><li>A common language approach so that ages 3 - 103 can connect, engage and share a  little more of their personal journey.</li><li>Word Puzzles to help you remember and practice what you've learned</li><li>Five Audio stories to assist you practise the skills</li><li>One Audio skill building Relaxation exercise in audio format <ol><li>One in male voice</li><li>One in female voice   </li></ol></li></ol>\n\n\n\n\n\n\n\n\n\n\n\n<p>This family student and school friendly program was born out of the frustration of me not being able to find any skill based program during those large issues in my family. Oh and yes, me then 7 year old daughter and I have both done very well since that very stressful time.</p>\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>\"Don't forget to use the audios; they are a big part of the success of the program.\"5 stories to choose from</li><li>Each one helps you practice key skills to assist you deepen your capacity to thrive</li><li>The chair exercise is here twice; once in male voice and once in female voice.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>P.S. </strong>I'm sorry to tell you that your primary cancer has spread and it is in four locations! I've had my own 7 year battle with two bouts of cancer and a failed medical procedure that meant an emergency surgery with a rush trip to the OR at midnight.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So, I've lived this from several  perspectives. As a father, a spouse, a son and a brother. I've always been astounded at the lack of basic Situational Mental Heath programming available in North America.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>I've also found this program very useful to help me better manage the two chronic illnesses  life has challenged me with. Doctors tell me my body age is at least 12 years less than my chronological age. I am quite certain that is in part due to the use of these skills impacting my mind and body health.  I wish you and yours all the very best on your journey.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>SAFETY Notice:</strong>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Don't use the audio's while operating any type of moving or stationary device with moving parts. The audio stories are designed to build skill while relaxing you. WE don't want you falling asleep while driving or operating machinery.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>HOWEVER:</strong> Three parents have written and told me to remind each of you that if you're using one of the audio programs they are very effective.  <strong>EXCEPT</strong> they adult in charge fell sleep, their older kids feel asleep, but their youngest at 4 years old did not. Two hours later the parent woke up and the four year old had the run of the house. So, we designed them to help you practise key skills that include relaxation, mindfulness and meditation. We know they work well as you keep telling us. Thank  you. Just ensure if you're using them with little kids that they'll be safe if you fall asleep and they don't. Enjoy! </p>\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Imagine Yourself What to do when adversity strikes", 
    "price": "40.00", 
    "instructors": "Michael Ballard, Michael Ballard", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847448_c60c_3.jpg", 
    "course_url": "https://www.udemy.com/imaginey/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-12T19:14:40Z"
}