{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I want you to <strong style=\"\">significantly improve or heal your personal or professional relations</strong>, especially with those who really matter!<br style=\"\"></p><p>Either you want to be a better spouse, son or daughter, a better parent, boss, colleague or friend, <strong style=\"\">this course will help you to connect, understand better and be understood by the people who matter to you</strong>. And especially <strong style=\"\">heal past wounds or solve those conflicts</strong> that put your relationships at risk.  </p><p>This course is <strong style=\"\">not just a set of behaviour tips</strong>, although it does give tips, but aims for developing a mental attitude, or a <strong style=\"\">D</strong><strong style=\"\">ialogic Posture</strong> as we call it! And with it, you&#039;ll connect with people in a <strong style=\"\">very sincere, natural and charismatic</strong><strong style=\"\"> way</strong> that lowers defences, gets them to listen to you and avoid unnecessary conflicts. <br style=\"\"></p><p>The lectures and exercises will help you <strong style=\"\">develop your listening and voicing capacities</strong>. Basically you&#039;ll be able to understand what&#039;s beneath people&#039;s lines and behaviours. And learn how to speak your truth, especially in difficult conversations.</p><p>Also, there is a section entirely dedicated to personal issues - you&#039;ll be able to become more conscious of the traps and triggers that your ego play on you which doesn&#039;t allow you to be <strong style=\"\">&quot;the best version of yourself&quot;</strong>. This is what we call dealing with self-image issues.</p><p>At last, you will <strong style=\"\">be able to deal with ANY EMOTIONAL SUFFERING</strong> by understanding the concept of emptiness or vacuity. </p><p><strong style=\"\">I have condensed a great part of my life&#039;s work in this</strong> course in the form of animated video lectures. The exercises proposed here are used by myself with executives from major companies and governments. So I really hope you can get the best out of this experience! </p><p>And just in case you don&#039;t get satisfied by this, you get a 30 Day Money Back Guarantee!</p><p>I&#039;ll see you in the course! Thank you!</p>", 
    "end_date": null, 
    "title": "Improve your relationships & resolve conflicts with Dialogue", 
    "price": "25.00", 
    "instructors": "Cesar Matsumoto", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/422714_bfa5_6.jpg", 
    "course_url": "https://www.udemy.com/improve-your-relations-with-dialogue/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-15T20:52:58Z"
}