{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Put the books down and stop googling to solve your baby's sleep problems...this is way easier.</p><p>This course is for the exhausted parents out there that desperately want their baby to take longer naps. </p><p>In this course you will become empowered and knowledgeable to get naps on track.</p><p>What if I told you that there are ways that you can:</p>\n\n<ul><li>Put your baby down at a certain time (that is right for your child) and they will fall asleep? </li><li>Use natural, gentle ways to time and schedule naps? And I’ll teach you how. </li><li>Avoid “sleep training” your baby to get sleep on the right path?</li></ul><p>In this course you will have lifetime access to quick and easy trainings, printables and worksheets - so by the end of going through the course you will be able to get longer naps with less stress.<br></p><p>Sound too good to be true? Nope, it's not! <em>A LOVE NOTE </em>from Helen after she went through the course.  </p>\n\n<p>BEFORE</p>\n\n<p><em class=\"redactor-inline-converted\">It felt like every day was different</em>, I didn't have any idea when Abigail would nap. And, I had a feeling that her naps (or lack of them sometimes!) were impacting on her mood, but I had no idea what would help. I'd googled and googled, but still felt completely unsure about what I should doing at 3 months old... should I just forget about it or would that let bad habits develop? I had a hell of a lot of questions, but couldn't find any answers!!!</p>\n\n<p>AFTER</p>\n\n<p>It was great to understand more about daytime napping needs at different ages, and have some loose guidance on the timing and quality of sleep to aim for at different times of day. Abby is still napping and feeding on demand, but my awareness of her tiredness cues mean that we have a loose schedule, which helps me to make sure she is getting the rest she needs each day, and I can plan activities at times that are best for her. Her mood has improved and now a majority of the time she is a really happy baby. <em class=\"redactor-inline-converted\">I feel so much more confident in encouraging her to nap when she's tired. </em>I feel a bit more relaxed knowing I'm doing my best for her, and happier having a rough idea when she might nap each day. I love the idea of trying to put her down in her crib for daytime sleep as being practice... it takes so much pressure off and I no longer feel like I'm failing because she loves to sleep in my arms during the day.</p>\n\n<p>This course is for you if you baby needs better sleep <em class=\"redactor-inline-converted\">but you haven't got a clue where to start.</em></p><p><br></p>", 
    "end_date": null, 
    "title": "Improve Your Baby's Naps (without sleep training)", 
    "price": "30.00", 
    "instructors": "Susie Parker", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786166_5dda_2.jpg", 
    "course_url": "https://www.udemy.com/improve-naps/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T14:07:56Z"
}