{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    <em>[updated November 2015 with new skills</em>] You've heard of these right? <strong>Star charts  -  Reward Charts  -  Chore charts  -  Incentive Charts</strong>  </p>  <p>  \t  But I don't want to use bribes, payments or prizes as incentives....As a child, my parents and school teachers used them on me - but they didn't work. <strong>WHY NOT?</strong>  </p>  <p>  \t  When I became a parent, I used traditional star charts on Cailin... .. but then that model stopped working as well: <strong>WHY DID THEY STOP WORKING?</strong>  </p>  <p>  \t<em>_______________________________________________________________</em>  </p>  <p>  \t    So for the last 15 years as a school principal and parent, I figured out why these traditional  models don't work for long, and then designed and invented some <strong>totally  new ones as I found out how to really inspire and motivate a child,  instead of bribe them.</strong>  </p>  <p>  \t<strong></strong>  </p>  <ol>  \t<li>The <strong>observational </strong>model <em>(use it even if your child doesn't want to participate)<br>  \t</em></li>  \t<li>The <strong>goal </strong>model (powerfully move into celebrating an achieved end goal)</li>  \t<li>The <strong>perseverance </strong>model <em>(how to keep them persevering, in spite of how difficult things get - prevents them from just giving up)</em></li>  \t<li>The <strong>consistency </strong>model <em>(keeps the new behaviour going till it becomes a habit)</em></li>  \t<li>The <strong>process </strong>model<em> (how to build strategic thinking and task completion)</em></li>  \t<li>The <strong>gamification </strong>model <em>(how to make a star chart like a board game with mystery levels and game rules)</em></li>  </ol>  <p>  \t<em>_______________________________________________________________</em>  </p>  <p>  \t<em>I am now known as the parenting coach and teacher who can get a child to do whatever is needed to be done! And these techniques are now used in schools and homes around the world. </em>  </p>  <p>  \t<em>My experience as a school principal and parenting expert have really paid off ... and those techniques I used that worked are now revealed here for the very first time. You wont find this material any where else (unless someone has copied my work)<br>  \t</em>  </p>  <p>  \t      _______________________________________________________________  </p>  <p>  \t        So, I know these charts work - <em>I even show you our past examples, and have even filmed me starting new ones with Cailin. </em>  </p>  <p>  \t        Every single technique which I reveal in this course is easy to <strong>put into place in minutes </strong>- and can give you <strong>instant returns</strong>.  </p>  <p>  \t        Nothing is kept secret - I reveal all I know ... and as I test even more things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>  <p>  \t        As well as the Udemy 30 day guarantee, you have my personal promise that you will be wowed and delighted by what you'll learn in the next 2 hours ... and <strong>you'll be kicking yourself if you already have given up on the power of Star or Behaviour Charts</strong>.  </p>  <p>  \t<strong>Every minute you delay is actually COSTING you more time and effort as you keep complaining in not getting the results you need from your child ....</strong>  </p>  <p>  \t<em>Enrol now! and discover guaranteed solutions that work!</em>  </p>", 
    "end_date": null, 
    "title": "Improve your kid's behavior-newly invented star chart models", 
    "price": "45.00", 
    "instructors": "Robin Booth", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/384734_5bfd_3.jpg", 
    "course_url": "https://www.udemy.com/improve-your-kids-behavior-newly-invented-star-chart-models/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T09:39:54Z"
}