{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Este é um curso rápido, de cerca de uma hora, de introdução ao tema da segurança <em>online </em>de crianças e jovens.</strong></p><p><strong>Na sua fase de pré-lançamento, este curso registou o interesse de mais de 400 pessoas, tendo-se inscrito mais de 250:</strong></p><ul><li>Pais e encarregados de educação, tios e avós;</li><li>Educadores de infância;</li></ul><ul><li>Professores dos vários níveis de ensino - do 1º ciclo ao ensino superior, passando pelo ensino profissional e vocacional;</li></ul><ul><li>Professores bibliotecários;</li></ul><ul><li>Formadores;</li></ul><ul><li>Educadores de centros de acolhimento;</li></ul><ul><li>Monitores de ATL/OTL;</li></ul><ul><li>Membros de forças de segurança;</li></ul><ul><li>Profissionais de saúde (enfermeiros, pediatras, hebiatras)</li></ul><ul><li>Psicólogos</li></ul><ul><li>Informáticos</li></ul><ul><li>Especialistas em <em>e-learning</em></li></ul><ul><li>E outros...</li></ul><p><strong>Neste curso aprenderá uma metodologia para prevenir e intervir em qualquer problema no domínio da segurança <em>online </em>de crianças e jovens, caso ele surja.</strong></p><p><strong>Para tal, aprenderá:</strong></p><ul><li>   Quais as principais <strong>oportunidades</strong> de que crianças e jovens poderão beneficiar com o acesso e o uso da Internet;</li></ul><ul><li>   Quais as principais categorias de <strong>riscos</strong> a que poderão estar expostas<em></em> na Internet;</li></ul><ul><li>   Quais os <strong>erros mais comuns</strong> que os adultos cometem ao tentar proteger as crianças desses riscos;</li></ul><ul><li>   Quais as <strong>soluções</strong> disponíveis para promover a segurança <em>online </em>de crianças e jovens.</li></ul><p><strong>Como resultado, após fazer este curso sentir-se-á mais confiante e capacitado/a para:</strong></p><ul><li>   <strong>Minimizar os riscos</strong> a que crianças e jovens podem estar expostos na Internet;</li></ul><ul><li>Ajudar crianças e jovens a <strong>maximizar os benefícios</strong> das oportunidades que a Internet tem para lhes oferecer.</li></ul><p> O curso inclui <strong>micro-lições vídeo, actividades, fichas de trabalho e recursos adicionais</strong> que ajudarão a minimizar os riscos e a maximizar os benefícios da Internet para crianças e jovens. Além disso, disporá também da oportunidade de interagir comigo e com outros participantes, no curso e num <strong>grupo exclusivo no Facebook</strong>, beneficiando assim da minha experiência de 13 anos a promover a segurança online de crianças e jovens.</p>", 
    "end_date": null, 
    "title": "Iniciação à Segurança de Crianças e Jovens na Internet", 
    "price": "20.00", 
    "instructors": "Tito De Morais", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/519302_0581_4.jpg", 
    "course_url": "https://www.udemy.com/iniciacao-a-seguranca-de-criancas-e-jovens-na-internet/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-03T17:08:48Z"
}