{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>On a professional level, employers continually note interpersonal skills and communication skills as the top two most desirable skills in their workers. This course on social intelligence will strengthen both of those areas for you, making you a more desirable worker whether you work for a company or for yourself.</p><p>On a personal and professional level, relationships dominate our lives. Many of us in fact rarely find alone time, instead nearly constantly finding ourselves in the company of others. This is part of the human experience! And a social beings, we need others for our own well-being.</p><p>Human relationships are an integral part of our existence. We have them at work, home, and in every other environment we find ourselves in -- religious gatherings, the gym, school, and every place else. But relationships with others are not always easy. Worse, when our important relationships are stressed, our lives are stressed as well. But when they're working wonderfully, we fly through life with lightness and smiles!  </p><p><strong>I want to help you make all of your relationships work wonderfully! I want to help you improve your social intelligence! This is the purpose of this course! </strong></p><p><strong>The tools in this course will help you </strong></p><ul><li><strong>increase your social intelligence</strong></li><li><strong>improve your self-awareness in your interpersonal communications</strong></li><li><strong>develop your interpersonal skills</strong></li><li><strong>have more and better friendships</strong></li><li><strong>increase your popularity in all of your environments</strong></li><li><strong>have better work relationships and better possibilities for professional growth</strong></li><li><strong>increase your income</strong></li><li><strong>improve others' perceptions of you</strong></li><li><strong>improve your communication skills</strong></li></ul><p><strong>All of this is in addition to the benefits you'll receive from a happier, easier, more peaceful <em>intimate relationship</em> as well.</strong></p><p><strong>When you understand the mechanisms that go into relationships, you can better navigate all of your relationships and be better perceived by others, leading to unlimited possibilities!</strong></p>  <p>  \t                          Better communication within our relationships can make all the difference in how satisfying our relationships are for us and for the other person. <strong>We can actually observe the tension dissipating from our relationships through practicing well-informed and appropriate relationship communication.</strong> Developing these skills is easy with the right insight.  </p>  <p>  \t                  In information-packed, easy-to-understand lectures, this course addresses each communication component that we all use every day. We examine communication aspects such as listening, nonverbal communication, and emotions. We break down each of those components into individual sub-parts, generating greater understanding of the complex communication mechanisms that we all take for granted in all of our daily interactions. Isolating each sub-part permits us to recognize precisely where we can change and improve to achieve happier, more fulfilling relationships of all types. By the end of this course, you'll be able to manage your relationships more intentionally, reduce stress within them, and observe as all of your relationships take a turn for the better. Your overall quality of life will improve as a result!  </p>  <p>  \t                          Lectures, note sheets, assignments, and quizzes all coalesce to construct a very rich course aimed to generate greater awareness of communication within relationships. Based on a very popular university course, grounded in research in the field, and taught by a seasoned instructor, this course is a must-have for anyone who isn't 100% confident that their communication is top-notch or who wants their interpersonal interactions -- and all of their relationships -- to be better. Armed with the information provided in this course,<strong> the rest of your life can bring you greater popularity, an increased ability to get what you want out of your interactions, and a lot more harmony and satisfaction within your relationships.</strong>  </p>  <p>  \t<strong>Invest in your social intelligence and your relationships and lead a richer, more fulfilling life! </strong></p><p><strong>Enroll now and start improving your relationships -- and your life -- today!!  </strong>  </p>", 
    "end_date": null, 
    "title": "Interpersonal  Communication: Increase Social Intelligence", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff, PhD", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343598_02e8.jpg", 
    "course_url": "https://www.udemy.com/get-happier-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T20:33:11Z"
}