{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Every time our children use the internet they have access to every person and thing that the adult world has to offer. Parents can be that barrier between our children and the potential risks the cyber world has to offer.  </p>  <p>  \t    This course will not only outline the dangers and responsibilities that exist online but will change your perspective and provide you with strategies that will assist you in dramatically reducing the cyber risks your child may face. I will empower you by giving you simple tools and strategies to help protect your children and keep them safe in their digital environment.  </p>  <p>  \t    This course will enable you to promote the healthy use of technology within your family.  </p>  <p>  \t    The online world holds many great opportunities for our children, however, we know this is coupled with risks and responsibilities. These risks can fall into a number of categories:  </p>  <ul>  \t<li><strong>technology becoming an obsession </strong></li>  </ul>  <p>  \t<em>is your child spending an unhealthy amount of time online?</em>  </p>  <ul>  \t<li><strong>cyber bullying </strong></li>  </ul>  <p>  \t<em>is your child being harassed online or being sent abusive messages. 68% of teens agree that cyber bullying is a serious problem.</em>  </p>  <ul>  \t<li><strong>poor online choices</strong></li>  </ul>  <p>  \t<em>making poor choices online can have big repercussions in the real world through examples such as sexting and deformation</em>  </p>  <ul>  \t<li><strong>online identity theft</strong></li>  </ul>  <p>  \t<em>it has been reported that this is currently the fastest growing crime movement in the world </em>  </p>  <ul>  \t<li><strong>online child sex offenders</strong></li>  </ul>  <p>  \t<em>adult users attempting to cause your children physical and psychological harm</em>  </p>  <p>  \t    In this course we will give real life examples and cases based on each of these six risks. Whether you are parent, carer, grandparent, uncle or aunty or teacher this course will give you the simple tools to manage these risks.  </p>", 
    "end_date": null, 
    "title": "Keep your children safe online", 
    "price": "35.00", 
    "instructors": "Brett Lee", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/318552_98c3_2.jpg", 
    "course_url": "https://www.udemy.com/internet-safety-cyberbullying-course-for-parents/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-13T02:47:38Z"
}