{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p class=\"p1\"><p>Anyone who has begun\r\nto explore the idea that thoughts mold reality inevitably are introduced to the\r\nLaw of Attraction. Using the law of attraction makes sense since this\r\nconcept holds that your life experience reflects back to you whatever it is\r\nyou’ve been thinking. Unfortunately, getting beyond that point and truly\r\nunderstanding what it means to create your own reality can be… well,\r\noverwhelming and confusing.</p>\r\n\r\n<p><em>What exactly is the Law of Attraction?</em></p>\r\n\r\n<p><em>Why is it that my thoughts affect my reality?</em></p>\r\n\r\n<p><em>How can I find my soulmate?</em></p>\r\n\r\n<p><em>How can I get the body I prefer?</em></p>\r\n\r\n<p><em>How does death fit into the Law of Attraction?</em></p>\r\n\r\n<p>The aim of\r\nthis course is to provide you with a foundational understanding of the Law of\r\nAttraction and using the Law of Attraction so that the answers to these\r\nquestions and others become clearer to you. By following this course you\r\nwill learn Law of Attraction tips and you will be shown that the solutions to\r\nlife’s problems are not as unattainable as they might seem.</p>\r\n\r\n<p>Embedded within the\r\nprinciple of the Law of Attraction is the knowledge that you are figuratively\r\nand literally the center of the universe. This course attempts to show you\r\nthat this is true as well as how to use that understanding to achieve the life\r\nof your dreams by using the Law of Attractions - because you deserve it.</p>\r\n\r\n<p>*****</p>\r\n\r\n<p><strong>Intended Audience</strong>: This course will benefit anyone\r\nseeking a general understanding of the Law of Attraction and using the Law of\r\nAttraction to a wide range of subjects.</p>\r\n\r\n<p><strong>Requirements:</strong> 1 Pencil and Paper.&nbsp;</p>&lt;/p&gt;\r\n\r\n<p class=\"p1\"></p>\r\n\r\n<p><strong>Included:</strong></p><ul><li><span>21 Videos\r\ncovering various subjects and Law of Attraction tips</span><br></li>\r\n\t<li>3 Exercises (1 perception exercise, 1 expectation exercise, 1 activity exercise)</li>\r\n\t<li>16 Affirmations</li>\r\n\t<li>Media Recommendation List (books, documentaries, audio ressources).</li>\r\n</ul>\r\n<p class=\"p1\"></p>\r\n", 
    "end_date": null, 
    "title": "Law of Attraction", 
    "price": "30.00", 
    "instructors": "Hartman Twins", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17740_c28e_4.jpg", 
    "course_url": "https://www.udemy.com/law-of-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-14T21:09:27Z"
}