{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you love being a parent but hate yelling, power-struggles and fighting with your children? Has your child been diagnosed with, or threatened to be diagnosed with, ADD/ADHD, ODD or anxiety? </p><p style=\"\">If you&#039;re tired of being a worn out, stressed out, beaten down mom or dad, today&#039;s the day for you to begin the transformation to change that forever! If you love your children but hate the yelling, disciplinary bad guy part of being a parent, you&#039;re in for a treat! </p><p style=\"\">My husband Thomas and I are known for helping parents reduce explosive behavior with their kids. In fact, we even help children completely reverse the symptoms of ADHD and ODD, terrible twos, and teenage rebellious behavior altogether. </p><p><span class=\"s1\"><strong style=\"\">Astonishing New Empowering Methods to Gain Cooperation with Children and Teenagers! </strong></span></p><p style=\"\">If you like transcripts, if you like audio or video, whatever your learning style, we&#039;ve got it a ton available for you. Thomas and I will hold your hand in this virtual journey, and walk you step-by-step through 12 modules. You&#039;ll be able to learn all of the great strategies that will transform your children and home in bite-sized pieces. There are 60 short videos, 12 study guides, 12 chapters, and three short audios for each module. </p><p style=\"\">Imagine if you had your environment at home transformed to the positive pictures we&#039;ve talked about. You wake up one day and you have the confidence to do the right things for your children. As you lay your head on the pillow, you look into your wife&#039;s or husband&#039;s eyes and he or she asks &quot;How was your day?&quot; and you say … “I did it honey. I had a peaceful, quiet, happy day with the kids - ALL DAY!&quot; </p><p style=\"\">And you lie down on the pillow and gently fall asleep, knowing that your life is never going to be the same again. When you register today, you have the ability to get started, right away! </p><p>Whether you&#039;re new to online courses or an experienced professional, we will show you exactly how to make your way easily through our system. We love systems. We love elegant simplicity. We love being able to show you how to do one thing that gets big results fast. <br style=\"\"></p><p style=\"\">You&#039;ll finally be able to discover and articulate the exact words that clearly communicate your desires with your children in a way that will empower them to choose cooperation and you get to be their hero. Isn&#039;t that really what you desire deep down as a parent? You know what you want as a parent. Whether you&#039;re crystal clear with your expectations, or you&#039;re just discovering the need to have them drawn out, we&#039;re excited for you to get started right away.</p><p style=\"\">If you focus on one module every week, you&#039;ll complete the course in 12 short weeks but you&#039;ll have access to all material forever, or until you don&#039;t need us anymore! </p><p><strong style=\"\">Money Back Guarantee</strong></p><p><em style=\"\">The course comes with an unconditional, Udemy backed, 30 day money-back guarantee. It is also my personal promise to you that you will get great value from the course and succeed.<br style=\"\"></em></p>", 
    "end_date": null, 
    "title": "Learn To Speak Kid", 
    "price": "20.00", 
    "instructors": "Bonnie & Thomas Liotta", 
    "commitment": "23.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455456_e9ee_4.jpg", 
    "course_url": "https://www.udemy.com/betterparenting/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T04:51:56Z"
}