{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          If you want to set your kids on their path to financial freedom; if you want to experience the satisfaction of having <strong style=\"\">kids </strong>who <strong style=\"\">can successfully budget their own spending and saving </strong>and<strong style=\"\"> cope</strong> better with the demands of the adult world; if you want your kids to <strong style=\"\">stop costing you a fortune</strong>; …then this might be the most important course you'll ever attend. Welcome to <em style=\"\">' How to Raise Money Wise Kids'.</em>  </p>  <p style=\"\">  \t      Your instructor for this course is Dr. Sharon Malan. Sharon has been involved in the educational field for more than 24 years. Her work during this time has included various forms of parent teacher counselling, lecturing, teaching and community training.  </p>  <p style=\"\">  \t          She has been a university lecturer for many years in the faculty of Educational Psychology at the University of Stellenbosch. She is currently also the marketing director of a successful educational company. She holds a PhD in Educational Psychology and Specialised Education. She has two daughters, two sons, a 'hubby', one lazy cat and a few hyperactive dogs. She enjoys writing, listening to good music, walking, exercising and talking, of course.  </p>  <p style=\"\">  \t<strong style=\"\">So, what is this course all about?</strong>  </p>  <p style=\"\">  \t          The purpose of this course is to provide you with 6 practical, easy steps to help you teach your kids (ranging from 4 to 21 years) all the basics they'll need to know about money and how to manage it wisely.  </p>  <p style=\"\">  \t<strong style=\"\">What makes this course unique?</strong>  </p>  <p style=\"\">  \t<strong style=\"\">One:</strong> It explains to you step-by-step how to take into account your kids' personality types before teaching them about money. Failing to do this, might have dire consequences. Kids differ, and because they differ they need to be taught differently. If you don't teach your kids differently you're going to struggle applying even the best ideas you can find on this topic.  </p>  <p style=\"\">  \t<strong style=\"\">Two:</strong> It explains financial information in a straightforward, practical way making it easily understandable for parents and kids who are not well versed in the topic of money management.  </p>  <p style=\"\">  \t<strong style=\"\">Three:</strong> It takes into consideration the different ages and developmental stages of kids before embarking upon teaching them important money management skills.  </p>  <p style=\"\">  \t<strong style=\"\">Four:</strong> It makes the learning process fun, Fun and much more FUN. Alfred Mercier said it best - <em style=\"\">\"What we learn with pleasure we never forget.\"</em>  </p>  <p style=\"\">  \t<strong style=\"\">Five:</strong> It is a valuable resource that you can refer to over and over again as your kids' needs begin to change once they get older.  </p>  <p style=\"\">  \t<strong style=\"\">Six:</strong> It contains the most essential lessons kids need to learn about money in one handy guide, thereby making the learning process as powerful and time-efficient as possible.  </p>  <p style=\"\">  \t<strong style=\"\">Seven:</strong>  It provides you with lots of practical ready-to-use age appropriate activities, tips and ideas to improve your kids' money sense and help them develop good spending and saving habits for life.  </p>  <p style=\"\">  \t<strong style=\"\">Eight:</strong>  It guides you to inspire your kids to stay committed and disciplined and to follow through with their financial plans in a way that does not compromise their moral values.  </p>  <p style=\"\">  \t<strong style=\"\">Nine:</strong> It provides practical ways to overcome any financial obstacles your kids may encounter.  </p>  <p style=\"\">  \t<strong style=\"\">Ten:</strong> It shows you exactly how to start your kids financial education at a tender age (from 4 years), because the earlier you start, the easier it gets!  </p>  <p style=\"\">  \t      As a <strong style=\"\">special gift</strong>, Sharon has also made available to all enrolled students, free of charge, her <strong style=\"\">best-selling eBook </strong><em style=\"\"><strong style=\"\">'How to Raise Money Wise Kids'.</strong></em>  </p>  <p style=\"\">  \t<strong style=\"\">Hope to see you soon!</strong>  </p>", 
    "end_date": null, 
    "title": "Learn Ways to Teach Your Children How To Be Financially Wise", 
    "price": "25.00", 
    "instructors": "MindMekka ®", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421916_4b79_5.jpg", 
    "course_url": "https://www.udemy.com/learn-ways-to-teach-your-children-how-to-be-financially-wise/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T17:07:17Z"
}