{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The first five years matter and last a lifetime. The development of our brain determines who we become and how we behave. By the time a child is three years old, 90% of their brain has developed, and it is now understood that early experiences have a greater influence on development than heredity. Not only that, the literacy skills of a child at age 4 to 5 are a good indication of academic success in primary or elementary school.</p><p>This course contains the \"<strong>Read Before School</strong>\" reading program - a proven phonics program that has been designed to help parents teach their 0 to 6 years olds, to Learn to Read. In this course I provide the tools and knowledge to help you implement fun and creative learning in your home environment, helping you to unlock your infant, toddler or pre-k / preschooler's potential in a number of areas. </p><p>I designed this course for my own children, who were able both able to read before they started school. One was reading chapter books independently at age 3, the other was reading simple texts at age 4. Each child is different, and in this course, I help you to teach your child at his or her own individual pace. </p><p>Each step of the program includes an instructional video, along with a video of parent and child demonstrating fun and engaging activities and learning games. Phonics worksheets, flashcards, educational games and wall charts are included as PDFs. All you need to do is download the PDFs, print them off, and immediately start the activity with your child! These practical literacy activities will help your child develop excellent reading and spelling skills, to speak well and be a good listener.</p><p><strong>Read Before School Feature List: </strong></p><ul><li>Covers the topics of letter recognition, phonics, blending, reading short vowel words, reading simple sentences</li><li>Instructional videos explaining the how and why </li><li>Practical videos demonstrating more than 30 games and activities designed to implement and reinforce learning</li><li>Printable flashcards, preschool / kindergarten worksheets, educational games and wall charts provided </li><li>Phonemic awareness activities, reading comprehension strategies, teaching strategies</li></ul><ul><li>Fully customisable:the program can be implemented at a pace suitable for each individual child</li><li>Can be started at any age, depending on the individual child's readiness; whether that be 5 months or 5 years</li><li>Research based, proven techniques – children as young as 2 can learn to read</li></ul><p>If you have a baby, toddler or pre-schooler and want to understand what it takes to give children a solid foundation in the first 5 years of life, then this course is for you. If you want to learn how to use fun activities and develop a love of reading and a passion for learning in your child, then this course is for you. You will have lifetime access to this living, evolving course. </p><p><strong>So what are you waiting for? Get it now and put your child on the path to reaching his or her full potential, in the most important years of their development. </strong></p><p>****************************</p><p><em>Disclaimer: The key message of this course for parents is to include children in everyday, nurturing life, where they are loved, talked with, played with and are well nourished; where they can socialize and explore and are kept safe. The course provides instruction in skill areas which can be applied during the early childhood years. In the course, I provide guidance to parents to check their child's readiness to engage in the activities and monitor the child's interest and engagement. Each child learns at their own individual pace. Some children may learn to read at 2, others at 5, and others later. Your level of success, and you child's level of success in attaining results from using our products and information depends on the time you devote to the program, ideas and techniques used and various skills, as well as your child's innate potential. Since the factors differ among each individual, we cannot guarantee your child's success. Many factors will be important in determining your child's actual learning outcomes and we make no guarantees that you will achieve results similar to ours or anyone else's. In fact, we make no guarantees that you will achieve any results from the ideas and techniques contained on our website or in our products. To the extent that we included any case studies or testimonials on this site or in our advertising materials, you can assume that none of these stories represent the \"average\" or \"typical\" customer experience. As with any product or service, some people will purchase our products and never actually use them - therefore you should assume that you will obtain no results from this program. </em></p><p><em>Despite making no guarantees that our product will make any particular result for you, you are still entitled to utilize our return policy according to the conditions stated within, if you are not completely satisfied. Please refer to the Terms and Conditions of this site for further information. </em></p>", 
    "end_date": null, 
    "title": "Learn to Read baby to preschool. Kids as young as 2 can read", 
    "price": "20.00", 
    "instructors": "Prue Madden", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582626_be2b.jpg", 
    "course_url": "https://www.udemy.com/learn-to-read-phonics-baby-toddler-preschool/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T01:46:14Z"
}