{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>- Updated September, 2015 -</strong></p><p><strong>Over 800 Students!</strong></p><p><strong>Free 30 Day Money Back Guarantee! </strong></p><p>Talking to your kids about alcohol can be a scary and intimidating task. So intimidating that many parents often avoid it! The amount of teens and college students that engage in high risk drinking behavior (binge drinking) is nearly 60%. This increases the potential to suffer serious negative consequences. Parents are their number one source for trusted information. This course brings the lessons learned from years of research and presents it in a practical way that parents can easily listen, learn and then apply.<br></p><p><strong>Evidence Based Approach to Talking to Your Teens About Alcohol.</strong> </p><p>The transition from high school to college provides parents with an excellent time to talk about drinking with their son/daughter.</p><p>Research suggests that discussions prior to starting college lead to lower drinking rates during their first year of college.</p><p>Talking with your son/daughter lowers the risk that they will suffer negative consequences from drinking.</p><p><strong>Learn How to Talk to Your Teen About Alcohol.</strong></p><p>Alcohol is the most misused and misunderstood drug in our society. Even though teens and college students are under the legal drinking age, it is important to remember that alcohol is the most widely used drug by this age group. The negative consequences are many and can be fatal. Higher instances of attacks, sexual assault, serious injuries, driving under the influence and fatalities are all directly associated with teen and college drinking. </p><p>YOU CAN MAKE A DIFFERENCE. Parents are the number one source for important information and influence their children well beyond their early ages. By mastering the evidence based and proven methods of talking to your teen about alcohol you can positively influence their drinking behavior. They will make better choices and regulate their own behavior. Your influence can directly affect their behavior towards drinking and lower their risk for alcohol related consequences. </p><p>Listening</p><p>Understanding</p><p>Empathy</p><p>Talking</p><p><strong>Contents and Overview</strong></p><p>This course contains 30 minutes of lectures and content. It is designed for any parents of teens and college aged kids. It is designed for any parent regardless of your experience or educational background who wishes to improve their communication with their teen. It is for any parent that has a desire to lower their teens risk for suffering negative consequences related to drinking. Even if your teen doesn't drink, this course will arm you with the skills needed to help support your teen as they face peer pressure to drink.</p><p>In this course you will learn the different parenting styles. You will learn which parenting styles have been proven to be most effective at reducing high risk drinking behavior.</p><p>You'll understand the changes teens are facing and discover the proven ways to begin a dialogue with your teen about alcohol. You'll receive a list of the do's and don't of talking to your teen about alcohol. </p><p>We will address the common assumptions parents make that have a negative effect on their communication with their teen. </p><p>By the end of this course you will have the proven skills that will help you lower your teen's risk of alcohol related negative consequences. You'll know how to start a conversation and keep that conversation going!</p><p>You will receive bonus materials that reinforce the concepts you've learned and new updated lectures as more research comes out.</p><p>These lectures you will be able to listen, learn and apply! </p>", 
    "end_date": null, 
    "title": "Learn How to Talk To Your Teen About Alcohol", 
    "price": "20.00", 
    "instructors": "Dave Closson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/583880_f67a_2.jpg", 
    "course_url": "https://www.udemy.com/lean-how-to-talk-to-your-teen-about-alcohol/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-15T15:59:14Z"
}