{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p>You are about to discover how to have a much better Work Life Balance. Learn why a balanced life is a personal decision only you can make. Do you long to have a higher quality family life? Then this is the course for you!</p><p>You will learn how to bring your work skills, organization skills, negotiation skills, delegation skills etc into balancing your life.</p><p>You will discover how to get rid of the guilt you feel about not spending too much time with the family. Once you learn to let go, then only can you move forward.</p><p>Discover why having a support network is critical to your Work Life balance and how you can go about creating your own support network.</p><p>You will learn how to set limits and boundaries. Take control of your life and learn to say no - too many people will try and take up your time so the key is to know what is acceptable to you, and what isn't!</p><p>Learn to make time for yourself, Sharpen the saw and start getting more focused. Start saving time by getting organized. Store your keys, glasses, wallet, purse etc in one spot so you don't have to look for them all the time! Having them in one place will save you hundreds of hours over your life!</p><p>Once you master some of these basics, you will have ample quality family time. Your family will love you for being able to spend more time with them and you will be able to build long term bonds with your family.</p><p>Take this course today and start having a better Work Life Balance!</p>", 
    "end_date": null, 
    "title": "LIVE: The Art of Balancing Work Life and Family Life", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691784_7366_2.jpg", 
    "course_url": "https://www.udemy.com/organize/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T06:09:05Z"
}