{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you've been frustrated or disappointed in relationship, or struggled to find how to communicate your relationship needs and sexual desires, this course will give you the specific vocabulary for honoring and empowering all aspects of your love life.</p><p>You will learn how to use basic astrology to enhance your ability to navigate all relationships present and future, while understanding patterns of attraction, challenge, and reactivity from past partnerships. You will go beyond simplistic Sun signs and specifically discover the power of Venus and Mars—the astrological symbols of the Divine Feminine and Masculine—which describe your relationship values, as well as your needs for affection, intimacy, pleasure, and passion. You will learn how to express these energies superconsciously, while avoiding their shadowy pitfalls.</p><p>A highly detailed keynote presentation, mindmaps, and PDFS with keywords, love styles, and turn-on's for each sign of the zodiac is systematically presented, as well as exercises to help you realize and clarify patterns in your relationships.  </p><p>Of all the material I present in my coaching, in my books, and my workshops, the insights from Venus-Mars—your version of the God and Goddess—is the most helpful and powerful, and easily applied on a practical level.</p><p>When I learned how to apply astrological wisdom into my love life, I experienced a total revelation and a healing, so much so that it made me want to become an astrologer. My goal is that this course will gift you your own epiphanies and that you will implement them for successful, blissful, and deliciously sexy relationships.  &lt;3</p>", 
    "end_date": null, 
    "title": "Love, Sex, and Relationship Success with Astrology", 
    "price": "40.00", 
    "instructors": "VerDarLuz CelestiOwl", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765020_b7c2.jpg", 
    "course_url": "https://www.udemy.com/love-sex-and-relationship-success-with-astrology/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T02:42:55Z"
}