{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>This course is a community of over 1600 happy and satisfied students! Join now to transform yourself and be the best version of yourself in 21 days! Moreover after completing the course, you will be able to find and keep happiness in your life, as well as finally finding the \"One\"!!! </strong>Course updated as of 21.11.2015</p><p>What this course covers:</p><ul><li><strong>Orientation</strong>: what kind of man are you looking for and why- a tutorial to make you admit to yourself what it is you want, what you deserve and how to get it</li><li><strong>Personal transformation</strong>: You re not going to learn how to be a perfect fit for any man, you will be taught how to be the best version of yourself, simply by outlining your best features (in and out), and become irresistible for any man!</li><li><strong>Attracting what you re dreaming of</strong>: What kind of man do you need next to you? Someone to rely on or a person to share your passion for life? Someone to conquer the world with? How to find and maintain a relationship with this very alpha male!</li><li><strong>How to make the passion last indefinitely</strong>: offering what he needs by satisfying your own needs, it can be magic! </li></ul>  <p>  \t<strong>**************************</strong>  </p>  <p>  \t<strong><em>What students say about this course:</em></strong>  </p>  <p>  \t<em>Liya B: I like the fact that you had 'from 0 to hero' approach and spoke about nutritions and detoxification. Recommend!</em>  </p>  <p>  \t<em>Joe P: First, Elena is an excellent instructor and the videos are of high quality. Second, I was really intrigued by the title and was pleasantly surprised at how much extra value there is in this course. There is so much more information in this course than just finding a Valentine. Third, with Valentines Day right around the corner I could not be happier I found this course when I did. I highly recommend this course to anyone seeking Love, Dating, and to have healthier relationships overall. A+!</em>  </p>  <p>  \t          #########################  </p>  <p>  \t                      Dating might not always lead to success in <strong>personal life</strong>. Nowadays the real meaning of finding someone special to stick with seems to be lost. Most of the people just date because of loneliness or to maintain a casual relationship. Is this what you want? <strong>Or do you want to find a person special enough to feel butterflies in your stomach every time you see him?</strong> Where is this guy? Love comes when we stop searching. Be the best version of your self and when you least expect it, the man of  your dreams will come. I ll show you how!  </p>", 
    "end_date": null, 
    "title": "Love and Dating for Women: Find your Valentine in 21 days!", 
    "price": "20.00", 
    "instructors": "Elena Seranova", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373198_97db_7.jpg", 
    "course_url": "https://www.udemy.com/find-your-valentine-in-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-18T10:50:26Z"
}