{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p>\n\n<p>Though attracting love can feel frustrating, it doesn’t have to be at all!  Attracting and maintaining a fulfilling relationship is something anyone can do when the right thoughts and expectations are focused on and projected. This course will help you release negative thoughts and expectations about love <em class=\"redactor-inline-converted\">and</em> help you harness the power of your consciousness so you can become a magnet for your dream relationship through the Law of Attraction. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Masterfully Apply the Law of Attraction to Your Love Life</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>\n<li>Learn how the Law of Attraction actually works from start to finish (and prepare to have your mind blown!).</li>\n<li>Identify what’s been causing the problems your current love life, and transform it quickly and easily.</li>\n<li>Learn dozens of easy processes to feel better about love and relationships<em class=\"redactor-inline-converted\"> and </em>improve your confidence. </li>\n<li>Practice thoughts and behaviors that align you with love and personal fulfillment.</li>\n<li>Identify signs of success, and respond appropriately to them!</li>\n</ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Learn About Love Attraction From A LOA Expert</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Andrea Schulman, I am a Law of Attraction coach and educator and I was nominated for the LOA Leader Award in 2015. I work one-on-one with Law of Attraction students around the globe. My advice on love and the Law of Attraction has reached millions, and has been published on some of the world's biggest consciousness websites and magazines, including Heart Centered Rebalancing, Simple Reminders, Conscious Life News, Expanded Consciousness, Spirit Science and OMTimes Magazine.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Contents and Overview</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course contains over 39 lectures, 3.5 hours of video content and a wide variety of tools and resources to enhance your learning experience and practice your new attraction skills and techniques.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>It’s important to understand that love attraction is a process. Often, people jump right in and try to “attract” love without taking some of the necessary first steps.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>So to begin this course, we will go over the process of the Law of Attraction to ensure you understand fully how it works and have some manifestation experience <em class=\"redactor-inline-converted\">before</em> we tackle love attraction. Even if you are an experienced student of the Law of Attraction, I highly recommend completing these sections of the course.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>After we have thoroughly examined the Law of Attraction, we will turn to the topic of your love life and uncover any limiting beliefs or behaviors you’ve been projecting. <em>Transforming your limiting beliefs and behaviors is the most important work of the course and should be fully completed before moving on to later sections.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Next, it will be time to set your intention and get you into alignment with love. We will discuss some important points on attraction that are often neglected, including the process of detachment and the role of self-love. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Finally, at the end of the course we will discuss signs of success, and offer you some tools to help you respond to potential mates as they are attracted to you.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of this course, you will have established a healthy new paradigm for love and relationships. You will also have achieved greater levels of confidence, self-love, happiness and well-being.  Finally, you will feel better about relationships and experience a positive transformation in your love life and in the types of partners you attract.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Love Magnet: Snag the Ideal Mate With the Law of Attraction", 
    "price": "50.00", 
    "instructors": "Andrea Schulman", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/693506_7c06_2.jpg", 
    "course_url": "https://www.udemy.com/love-magnet-snag-the-ideal-mate-with-the-law-of-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-09T22:41:23Z"
}