{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\">  \t<p>  \t\tOne of the hardest things about being in a relationship is fighting. When you fight with your partner, nothing gets resolved and with irreconcilable differences the primary reason for most divorces, fighting can be fatal to an otherwise happy marriage. It doesn’t have to be this way.  \t</p>  \t<p>  \t\t<strong style=\"\">Learn how to stop fighting and save your relationship by negotiating instead</strong>  \t</p>  \t<ul style=\"\">  \t\t<p>  \t\t\t·Learn the difference between fighting and negotiating  \t\t</p>  \t\t<p>  \t\t\t·Discover the 8 Rules of fighting  \t\t</p>  \t\t<p>  \t\t\t·Master the 4 steps of a negotiation  \t\t</p>  \t</ul>  \t<p>  \t\t<strong style=\"\">Develop the skills and mindset of happy couples</strong>  \t</p>  \t<p>  \t\tCouples who stand the test of time all know resolve their differences in a way that is constructive and respectful to their partner. This course will help you be one of those couples. We’ll look at fighting, what it is and why it is so hurtful and give you the rules you need to follow to ensure an argument doesn’t turn into World War 3.  \t</p>  \t<p>  \t\tThen, we’ll look at negotiating, how is it different to fighting, the steps you need to follow to negotiate effectively and how you can use this with your kids. We’ll even give you a special bonus module that will help you to be assertive.  \t</p>  \t<p>  \t\tThis course was recorded live at our two workshop “The Relationship Toolbox” and was among the most popular topics of the whole 2 days. The 21 lectures in this course will help you to learn how to control your emotions, communicate effectively with your partner and resolve your differences. Upon completion, you’ll have all the tools you need to reduce the amount and intensity of your fights.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Make Love Not War", 
    "price": "20.00", 
    "instructors": "Rodney Owen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315596_2d66_2.jpg", 
    "course_url": "https://www.udemy.com/make-love-not-war/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T06:23:59Z"
}