{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome to “Master Paul Melella&#039;s Bully Proof Progam&quot;!</p><p>This course will help you and your child become Bullyproof!.</p><p><em style=\"\">Are you a parent that has a child that is a victim of bullying? </em></p><p><em style=\"\">Are you a victim of bullying?</em></p><p><em style=\"\">Are you aware that nearly one in three children will be bullied in a year?</em></p><p><em style=\"\">Are you concerned that your child may be the one bullying others?</em></p><p>Well, if you answered <em style=\"\">YES</em> to any of the above questions this is the course for you!</p><p>As a Taekwondo practitioner for over 30 years and teaching for the majority of that time, I love teaching about Bullying. My name is Master Paul Melella. Not being the biggest kid in the block, I personally have been bullied as a child.  My parents enrolled me in the Martial Arts and I learned the skills to stand up to the bully.  In fact, I am happy he bullied because now he is one of my best friends.  Well, I never stopped training in the Martial Arts and I&#039;ve had my own martial arts school for over two decades and have helped both adults and children reach their full potential in and out of their training. I&#039;m extremely passionate about making sure that every child I work with develops the confidence and skills to become bullyproof!</p><p>By the end of this course you&#039;ll definitely know how to handle a bully! In this program we&#039;ll break down exactly what to do if a bully is bothering you or your child.</p><p>This course will take your confidence to a whole new level. Guaranteed!</p><p>Content and Overview</p><p>First thing you need to know is that there is no &quot;FLUFF&quot; here! We get right to the point! All video&#039;s are high def and professionally produced to help you become &quot;Bullyproof&quot; before you know it.</p><p>By the end of this course you&#039;ll learn how to successfully know:</p><ul style=\"\"><li>What bullying is</li><li>What constitutes a bully</li><li>Why people bully</li></ul><p>More importantly, parents will help their children to learn the skills to:</p><ul style=\"\"><li>keep bullies at bay</li><li>not let what a bullies do or say effect how they feel</li><li>de-escalate a confrontation without any use of physical force</li><li>develop long lasting mind muscle exercises for confidence that lasts a lifetime</li></ul><p>This program was filmed as a live Bullyproof seminar where Master Melella was presenting in one of his martial arts schools.  Throughout the program, there will be an extra re-cap where Master Melella gives specific action plans on ways that parents could and should practice with their children.  As with any online program, what you put into the program is what you get out of it.  Put some effort into &quot;Master Paul Melella&#039;s Bullyproof Progam&quot; and watch your children develop the confidence to not only be bullyproof, but to accomplish anything they set out to do in life.</p><p>All the lessons in this on-line program are instructed by Master Paul Melella. Master Melella is an avid Martial Arts practitioner and instructor, an outdoor enthusiast, author, co-author and entrepreneur. All HD videos were filmed and edited by Offir Kilion. Mr. Kilion is a graphic artist, photographer and videographer. In addition, he owns and operates a successful graphic design company that offers the finest services available.</p><p>Together, they teamed up to bring an array of online programs to students all over the world.</p><p>OK. Enough talk and it&#039;s time for action!</p><p>Register today and let&#039;s get you to and your child to be “Bullyproof&quot;!</p>", 
    "end_date": null, 
    "title": "Master Paul Melella's Bully Proof Program", 
    "price": "40.00", 
    "instructors": "Inspired Online Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495984_8ff5_4.jpg", 
    "course_url": "https://www.udemy.com/bullyproof/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T14:57:12Z"
}