{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Update:</strong></p>\n\n<p><em>LATEST: Course Updated For June 2016 </em>OVER 740+ SATISFIED STUDENTS HAVE ALREADY ENROLLED IN THIS COURSE!<br></p>\n\n\n\n<p><strong>...................................................</strong></p>\n\n\n\n<p>It is a logical fact, that men who are have control over their dating life are happier.  You can make life much more fulfilling and satisfying, just by knowing that you have the ability to attract beautiful women into your life. This course aims to overcome this challenge that many men face, by introducing an set of strategies that are trial-and-tested to bring you success with women, from the comfort of  your own home.</p>\n\n\n\n<p><strong>Master the Art of Attraction and Online Pickup.</strong></p>\n\n\n\n<ul><li>Copy-&amp;-Paste, playful and flirty conversation starters to get her reply to you.</li><li>After she is hooked, learn how to continue the conversation and intrigue her. </li><li>How to get her from online to meeting up for a date and make her like you even more.</li><li>Kiss closing strategies that remove all risk of failure.</li></ul>\n\n\n\n<p><strong>Learn to Attract Women by Example (Trial and Tested Scripts)</strong></p>\n\n\n\n<p>Knowing how to attract women at will, will not only make you happier and a more confident person, but will also help you to choose you go on multiple dates, increase your social circle, get invited to parties and help you select your life partner(s). </p>\n\n\n\n<p>At the end of your training you will not only be dating more women a week than you have in a year, you’ll also have the real world experience, confidence and intuition to succeed in any social interaction going forward.</p>\n\n\n\n<p><strong>Contents and Overview</strong><strong></strong><br></p>\n\n\n\n<p>This course is a step-by-step guide for beginners on how to\ngo from meeting girls on facebook to dating the girl or girls you think best suits\nyou.</p>\n\n\n\n<p> There are lots of concepts that I discuss in this course such as beeﬁng up\nyour proﬁle to demonstrating higher value, opening flirty and playful messages, how to continue the conversation\nonce the girl replies as well as how to get her number for the meet up. You\nwill get included my many (top secret) actual, unedited conversational thread\nexamples that you can copy-and-paste based on what level of the conversation\nyou're at with the girl/s. </p>\n\n\n\n<p>At the point which you and her have a good connection, I show you how to get her number so you can call her as well set up the first date. I provide almost a whole section on how to speak to her on the phone so you create a good first impression. </p>\n\n\n\n<p>What to do when you first meet up with her, whether she has brought her friends with or not. When the time is right, I show you how to see if she is ready to be kissed and how to go about kissing her, using the kiss test.</p>\n\n\n\n<p>When you’re done with this course, you’ll have the skills, knowledge and first hand experience open any girl on facebook and never run out of things to say, as well as to get her feeling attracted to you. You'll feel so powerful being able to attract women without even leaving your chair. <br></p>\n\n\n\n<p>&gt; These Strategies and underlying principles will work for any online dating or social networking sites such as facebook, tinder, okcupid, match dot com etc.<br></p>\n\n\n\n<p><em>Note:  This is a risk free purchase with Udemy’s 30 day money back guarantee. Just imagine what life would be like if within 30 days you had the confidence, skills and guts to attract girls that you desire. </em></p>\n\n\n\n<p><em>This course will also increase $10 every month due to preserving these technique to the few who take action. So it is best get this course while the price is still low.</em></p>\n\n\n\n<p>---------------------------------------------------------------------------------</p>\n\n\n\n<p><br></p>\n\n\n\n<p><em></em></p>\n\n\n\n<p><em></em><br></p>", 
    "end_date": null, 
    "title": "Master Online Dating and  Attract Women within 2 Months", 
    "price": "20.00", 
    "instructors": "Ritesh Kanjee", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567988_3744_8.jpg", 
    "course_url": "https://www.udemy.com/how-i-used-copy-and-paste-lines-to-attract-women-on-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T06:14:46Z"
}