{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        You will be taken through the journey of divorce, from the shock of finding out your wife wants it over, to asking if she is sure about the decision to end the marriage. Then you will be given ideas on how to avoid the worst affects of each stage during the divorce process.  </p>  <p>  \t      You will find out why working through counseling is worth it for you, your kids and, even if you do not think it is worth it now, your ex partner.  </p>  <p>  \t  You will be shown why mediation needs to be taken seriously and why using legal systems to fix personal conflicts is the worst path ever.  </p>  <p>  \t  Understand why best method for negotiating your way through a divorce is compromise and not aiming for the perfect division of anything.  </p>  <p>  \t        Find out simple yet effective ways to stay sane while you ride the roller coaster that is divorce.  </p>  <p>  \t        Through eight lectures ranging from five minutes to twelve minutes, I will provide tips and hints on what to expect during a divorce and how you can find your own path through it. All the while, reducing the mistakes that will embarrass you later and hurt your kids and tips on how to forgive yourself for the mistakes.  </p>  <p>  \t      There are also more than six PDF ebooks that go through each video in more detail while sharing how I worked my way through the process as an example of how to, and how not to, survive the transition to a new life.  </p>", 
    "end_date": null, 
    "title": "Men verse Divorce", 
    "price": "20.00", 
    "instructors": "Rodney Goodall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385490_b8e6_3.jpg", 
    "course_url": "https://www.udemy.com/men-verse-divorce/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T08:11:37Z"
}