{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you want to:</strong><br></p><ul><li>reduce your stress in parenting, </li><li>improve your relationship with your child, </li><li>parent more effectively and be kinder and less reactive in your family or </li><li>help your children's development unfold naturally and with ease? </li><li>enjoy being with your children and have them enjoy being with you?</li></ul><p><strong><br></strong></p><p><strong>Then you are not alone - and you are in the right place</strong></p><p><strong><br></strong></p><p><strong>You will also learn how to:</strong></p><ul><li>take better care of yourself</li><li>develop more empathy and compassion for yourself and your child</li><li>tolerate difficult emotions in yourself and your child better</li><li>become more accepting of yourself and your child</li><li>resolve conflict better with your child</li><li>develop a stronger bond and relationship with your child</li></ul><p><strong><br></strong></p><p><strong>Emotions can help us or hurt us:</strong></p><p>They hurt us when they are in the drivers seat and we are at their mercy. That's can so easily happen in parenting - when one action or comment from our child can mean we lose our cool  have an angry outburst and undo all the good work and connection we have had. This  breaks the trust we shared and undermines our children's well-being.</p><p><strong><em></em>Parenting is not easy</strong></p><p><strong></strong>Despite the fact that I love my children, I would say it is the hardest job I have ever done. I'm not going to tell you how to do it - there are thousands of books you can buy that will do that.</p><p> I want to equip you with the skills and resources that you need to thrive - and that you need to connect wholeheartedly with your child, managing your emotions and helping them to manage theirs. That's what this online parenting course is all about.</p><p>I want to give you the information you need to develop the kind of relationship you want to have, to communicate as the kind of loving parent you are and to raise happy, confident, kind and caring children. </p><p><strong>Who is this Parenting Program for?</strong></p><p>This course is for any <strong>parent or parent-to-be</strong> who wants to feel confident that they are meeting their children's  psychological needs and resourcing themselves to best do that - read on......</p><p><strong>Inside this online parenting course you will find:</strong><br></p><ol><li>Short and practical skill development exercises</li><li>Research based recommendations</li><li>Video lectures</li><li>Downloadable resources for ongoing use</li><li>A friendly discussion board and qualified instructor support to answer all your questions</li></ol><p><strong>My promise to you? </strong></p><p>That if you master these skills, you will be the best parent your children could hope for.</p><p>In this parenting course I ask that you use these principles as your guide as we go through the course together:</p><ol><li>honour your own experience - trust your inner wisdom</li><li>not judge your thoughts and feelings as right or wrong - be curious about them and listen deeply</li><li>be patient - that this will unfold and you will slow down to allow yourself to connect to these skills and practices</li><li>bring some lightness and even playfulness to the table - parenting can feel heavy and intense and a little humour can be a  marvellous antidote</li></ol><p><strong>Mindfulness and Self Compassion are perhaps the most profoundly supportive parenting resources available. </strong></p><p><strong></strong>They brought me back from the brink of exhaustion, depletion and depression and restored my enjoyment of parenting again. My relationship with my husband and children  became far more loving and connected and our happiness and well-being flourished.</p><p><strong>Responsive Parenting is what delivers optimal outcomes for children and that is why it is researched and recommended by the World Health Organisation, Harvard, Yale, Stanford and so many other powerhouses of child development research</strong></p><p>And the good news it is available to you no matter what your personal philosophy of parenting might be.  In this course you will learn what <strong>Mindful and Responsive Parenting</strong> is and practice the fundamental skills that make it possible.</p><p><strong>Join us.</strong></p>", 
    "end_date": null, 
    "title": "Mindful & Responsive Parenting: Communication That Works", 
    "price": "45.00", 
    "instructors": "Kellie Edwards", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596578_796d_4.jpg", 
    "course_url": "https://www.udemy.com/mindful-and-responsive-parenting-calm-connected-children/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T09:01:22Z"
}