{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will teach mothers how to feel connected content and calm on their motherhood journey. Motherhood is a roller coaster of emotion filled with moments of bliss but also moments of intense frustration. Mothers are dis-connected, over-whelmed, stressed and often exhausted. This course is about how to practise mindfulness. Mindfulness creates self-awareness and allows mothers to re-connect.</p><p><strong>What’s included?</strong><br></p><ul><li>Video’s and practical tips</li><li>One moment meditations</li><li>5 minute guided meditations </li><li>Beautiful mindfulness journal</li><li>Printable posters and positive affirmations</li></ul><ul><li>Stress management</li><li>Mothering in the moment</li><li>Mindful parenting</li><li>Learning to let go</li><li>Learn at your own pace</li></ul><p><strong><br></strong></p><p><strong>What will you learn?</strong></p><ul><li>Relates to the practice of mindfulness so you learn to let go of what doesn’t serve you, be present, speak your truth and live with an open heart and mind.</li><li>Teaches you how to re-connect back to you, let go of mummy guilt, practise self care, gratitude and how to turn mundane tasks into magical mindful meditations.</li><li>Provides numerous tools and ideas to effectively manage stress and get more energy.</li><li>Teaches how to raise kids mindfully including affirmations and meditations for kids.</li><li>Includes downloadable 40 page mindfulness journal and access to our online “connected family” community.</li></ul><p><strong><br></strong></p><p><strong>How is the course structured?</strong></p><p>The content is made up of short lecture video’s, one mindful moment activity cards, downloadable posters including positive affirmations, tips and a mindfulness journal. The journal allows you to write record their experiences on their journey and encourages time to reflect each month. Mothers are busy and time poor so the activity cards encourage mothers to find their mindful moment each day. In time these moments start to happen automatically and there are also guided mediations that last up to 5 minutes.</p><p><strong>How will you benefit?</strong><br></p><p>This course will teach you how to be a mindful mother so you feel more joy and less frustration. This is your guide to being a content, calm and more compassionate mother. You can reduce the stress of motherhood by connecting with yourself and your child in just one mindful moment a day.</p><p>The course is designed for you to do at your own pace in your own time. This course is based on the content of the award winning book “Mother Om” written by yoga and mindfulness teacher Leonie Percy.<br></p>", 
    "end_date": null, 
    "title": "Mindfulness for Mothers with Mother Om", 
    "price": "50.00", 
    "instructors": "Leonie Percy", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341086_b5a1_3.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-with-mother-om/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T04:20:10Z"
}