{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Mind Power Techniques To Improve Your Relationships</strong>' By Pradeep Aggarwal , you will learn -</p><p>How mind power techniques can help you improve your relationships effectively. Learn why problems happen in most of the relationships and how you can solve or overcome those problems easily using mind power techniques.</p><p>In this lesson you will learn how mind power techniques to improve your relationship by altering your own state of mind, by changing the feelings of resentment, if any and how to influence the person to respond to your behavior accordingly.</p><p>Anger, resentment, misunderstanding, holding grudges etc. create negative feelings, behavior and mind set, which eventually affect the relationships. In this lesson you will learn a powerful visualization exercise to send love and spread the warm, friendly and positive feelings towards you.</p><p><span></span>In this lesson you will learn a wonderful exercise for promoting communication in any relationship. This is a very powerful exercise to promote and enhance communication using the mind power techniques.</p><p><span></span>This course is for those who want to improve their relationships with their family, friends , work colleagues and spouses and live in peace and happiness throughout their life.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 10 lectures in English including a bonus e-book.</p>", 
    "end_date": null, 
    "title": "Mind Power Techniques To Improve Your Relationships", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653248_1223.jpg", 
    "course_url": "https://www.udemy.com/mind-power-techniques-to-improve-your-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T09:43:58Z"
}