{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        The ULTIMATE Relationship Success Course!       Welcome to Movie Therapy!  </p>  <p style=\"\">  \t             Movie therapy combines the fun of watching movies with improving the emotional bond you have with your partner. Best still, is that you get to do this all from the privacy of your own home.  </p>  <p style=\"\">  \t        Movies affect us powerfully because the synergistic impact of music, dialogue, lighting, camera angles and sound effects enables a film to bypass our ordinary defensive censors. They draw us into the viewing experience and at the same time - often more easily than in real life - afford a unique opportunity to retain a perspective outside the experience, the observer&#039;s view. This course will teach you how to express your feelings and views on what you have seen to your best friend, and partner.  </p>  <p style=\"\">  \t        Movie Therapy is drawing increased interest amongst therapists, as it uses the impact of movies to help clients change negative beliefs, manage destructive emotions, develop self-esteem, discover forgotten strengths and grow in the face of a loss or disappointment. The latest research on using Movie therapy for couple therapy is amazing!  </p>  <p style=\"\">  \t           &quot;A new study finds that watching and discussing movies about relationships is as effective in lowering divorce rates as other, more intensive early marriage counseling programs.&quot;  </p>  <p style=\"\">  \t            Discussing six movies about relationships over a 6-week Date Night strategy could cut the three-year divorce rate for newlyweds in half, researchers report. The study, involving 174 couples, is the first long-term investigation to compare different types of early marriage intervention programs.  </p>  <p style=\"\">  \t           The findings show that an inexpensive, fun, and relatively simple movie-and-talk approach can be just as effective as other more intensive therapist-led methods—reducing the divorce or separation rate from 24 to 11 percent after three years. Discussing relationship movies, it turns outs, was just as effective as more intensive skills-building programs. The results suggest that many couples already possess relationship skills, they just need reminders to put these into practice.  </p>  <p style=\"\">  \t      The insights and principles you’ll grow to understand in this MOVIE THERAPY COURSE will empower you to create a more POSITIVE and PASSIONATE relationship in the most important areas of your life, for the rest of your life!  </p>  <p style=\"\">  \t    Matt and Kellie Butler  of Ashtabula, Ohio, have been married for 16 years and also feel the  movie intervention has helped their relationship. So far they have  watched “Love and Other Drugs” and “She’s Having a Baby.”  </p>  <p style=\"\">  \t    “It’s kind of  powerful,” Mr. Butler said. “It’s like watching a role play in a therapy session, but it’s a movie so it’s less threatening and  more entertaining.”  </p>  <p style=\"\">  \t    Mr. Butler said that  even though he and his wife have a strong bond, long-married couples  sometimes forget to talk about their relationship. “We’ve been married  16 years, but it’s not something you sit down and have a conversation  about,” he said. “When you watch the movie, it focuses your conversation  on your relationship.”  </p>  <p style=\"\">  \t      The Movie Therapy course is lead by Dr. Savannah Ellis, Clinical Psychologist, Founder of the Infidelity Recovery Institute, and author of four relationship books.  </p>  <p style=\"\">  \t<strong style=\"\">Frank Pittman, MD says.....</strong><em style=\"\">&quot;Everything  we need to know about  marriage can be found at the movies: explore  meaning, expectations,  love, insanity, brain chemistry, secrets, lies,  deal breakers – even  clues about how to get it right.&quot;</em>  </p>  <p style=\"\">  \t      See you on the inside!  </p>", 
    "end_date": null, 
    "title": "Movie Therapy. The Counseling Alternative. ", 
    "price": "25.00", 
    "instructors": "Dr. Savannah Ellis", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366270_95d3_7.jpg", 
    "course_url": "https://www.udemy.com/the-movie-therapy-course/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T10:20:28Z"
}