{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t     &ldquo;Neonatal Abstinence Syndrome&rdquo; is a course for You, if you want to find out more about condition that newborn babies may develop after being exposed to opioid substances or drugs during pregnancy.\r\n</p>\r\n<p>\r\n\t<br>\r\n\t        In my experience greater knowledge decreases anxiety among parents and that by itself helps them cope with emotions during difficult times when their baby has to stay in the hospital and is being treated for Neonatal Abstinence Syndrome.\r\n</p>\r\n<p>\r\n\t<br>\r\n\t<strong>Contents:</strong> First I will define all important terms. Then, I will talk about addiction during pregnancy and treatment options available to mothers and why it is important that they get treatment. After introducing that initial knowledge, we will concentrate on a newborn baby. I will explain what are signs and symptoms that occur in neonatal abstinence syndrome. I will talk about evaluation and treatment options for babies with NAS and their developmental outcomes after they go home. Suggestions will be given: how to react and care for a baby during the time when they go through withdrawal symptoms. Finely, I will talk about social and legal issues associated with addiction disease during pregnancy and neonatal abstinence syndrome.\r\n</p>\r\n<p>\r\n\t<br>\r\n\t        During the course my goal is to present this difficult and emotional topic in a simple but thorough way. I am confident that if you put some effort into understanding NAS disease, you will be able to provide better care for your child or support your family member during these difficult times.\r\n</p>\r\n<p>\r\n\t<br>\r\n\t        This course contains mostly video slide lectures, most sections have a printable hand-out with important information from the lectures. Finely, there are few optional quizzes where you will be able to test your knowledge.\r\n</p>\r\n<p>\r\n\t<br>\r\n\t        The most important <strong>advantage of this course</strong> is that I will be available to answer all questions you may have during you learning journey. You will have access to questions board where you can ask for clarification on topics taught in the course.<br>\r\n\t <br>\r\n\t<strong>     Disclaimer:</strong> This course has only educational purpose and does not establish doctor-patient relationship. If you are a current or prospective patient of my practice please contact me and I will provide to you content of this course free of charge. However, I will not be able to refund you if you have already purchased this course.\r\n</p>", 
    "end_date": null, 
    "title": "Neonatal Abstinence Syndrome", 
    "price": "50.00", 
    "instructors": "Michal Wisniewski MD, MHPE", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/142132_d389_4.jpg", 
    "course_url": "https://www.udemy.com/neonatal-abstinence-syndrome/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-05T01:42:23Z"
}