{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>&lt;&gt;&lt;&gt;&lt;&gt; Ultimate Dating Bootcamp: Find success in love &amp; dating &lt;&gt;&lt;&gt;&lt;&gt;</strong></p>\n\n<p>Wait a second! Or two! Are you having trouble sending messages to women online? Having trouble getting women to message you back? If so, look no further. To create this course I created a few fake profiles and tested out what works and does not work, including revising and posting my own profile until I was able to get an amazing total of over 415 women to like me in less then two months!</p>\n\n\n\n\n\n\n\n<p>Want to get those kinds of results or better? If so, take this course and learn how to create a profile that works, send messages that get answers, and get actual dates. If you find this course not helpful, you can get a refund within 30 days. So test drive the course and if you dislike it you can get a full refund. Should you choose to stay, you will get discount offers to my best selling courses emailed you directly from Udemy. Do not waste another second. A hot date is right around the corner. </p>\n\n\n\n\n\n\n\n<p>Sounds good, but you are not yet sold? First, this course includes lots of new and fresh content that I was able to discover and share with you! I have combined some of the best content from all my best selling online courses and created this dating master course giving you an unfair advantage over any other man who is trying to get a date online.</p>\n\n\n\n\n\n\n\n<p>Wait, are you siting at home alone and reading this? Did you give up hope having a beautiful wife you deserve to be dating? Fear not, the Alpha male no longer has the upper hand in online dating. Now, all you need is your keyboard and this course to take you to the next level. Why be alone when you can have her to enjoy activities together. </p>\n\n\n\n\n\n\n\n<p>I've been dating online for a long time. Since I work online, the best place for me to meet someone new is online. I have tried about everything so you do have to: from cheesy openers, pictures that just do not work until I was able to master the ultimate guide to picking up women online. </p>\n\n\n\n\n\n\n\n<p>This course is designed to include my latest research, tests and knowledge, all designed to take your online dating to the next level.</p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Online Dating Bootcamp: Find success in love & dating", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697388_21df_2.jpg", 
    "course_url": "https://www.udemy.com/datingbootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T19:05:22Z"
}