{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\n\t<strong>  Open Your Heart After A Disagreement</strong> does exactly what it says it does. It teaches you a process you can use any time you have a fight, argument or disagreement with another person - whether at home or at work.\n</p>\n<p>\n\t  When you do this process you end up being able to let go of the fight quickly so you can connect with the other person again, even if you feel they have done something wrong towards you.\n</p>\n<p>\n\t  You will discover how to open your heart and feel love and kindness again, releasing anger, bitterness, hurt, disappointment and other negative feelings towards them.\n</p>\n<p>\n\t<strong>Why take this course?</strong>\n</p>\n<p>\n\tIf you would like to be able to connect more deeply with people.\n</p>\n<p>\n\tIf you want to let go of hurt and pain in any of your relationships.\n</p>\n<p>\n\tIf it help you to be able to work more harmoniously with other people.\n</p>\n<p>\n\t  Many disagreements carry on silently long after they take place. You may continue to have negative feelings towards the other person or find it hard to be fully open with them. You may react by withholding your love and affection, or by being less cooperative.\n</p>\n<p>\n\t  This can build up over time to create tension and unhappiness, which gradually damages the relationship. You are then more likely to fight or disagree and the situation may get worse and worse.\n</p>\n<p>\n\t  This all changes when you learn an effective process for healing the relationship. Instead of arguments hurting you both they can become opportunities for growth and development.\n</p>\n<p>\n\t  Your love in personal relationships will increase and deepen if you use this process every time you fight. And at work you will create more and more harmonious relationships with your colleagues (and a much more enjoyable workplace) if you have the skills to grow from the inevitable disagreements that take place from time to time.\n</p>\n<p>\n\t<strong>How long does it take?</strong>\n</p>\n<p>\n\t  It will take you a bit more than one hour when you first do it. Once you have mastered the process you will be able to do it in 5 to 10 minutes in most situations.\n</p>\n<p>\n\t  You can do the entire course in one sitting, or break it up if you prefer.\n</p>\n<p>\n\t<strong>What's included?</strong>\n</p>\n<p>\n\t  There are 8 videos, between 4 and 13 minutes long and a workbook. The videos explain the 5 key steps you need to take the transform the situation, with lots of examples.\n</p>\n<p>\n\t  For each step you will need to take some notes or do a short exercise to make sure you apply the process personally.You can use the course workbook or your own notebook for taking notes. If you don't like writing you can speak out loud into a recording device (eg on your mobile or computer), or even just speak out loud (make sure you are somewhere no one can hear you).\n</p>", 
    "end_date": null, 
    "title": "Open Your Heart After A Disagreement", 
    "price": "25.00", 
    "instructors": "Sarah McCrum", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173080_d23b.jpg", 
    "course_url": "https://www.udemy.com/open-your-heart-after-a-disagreement/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-26T03:20:42Z"
}