{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t     All parents need a little advise and directive occasionally.   This is a course that covers the very basics of parenting and allows parents to come up with their own balance to parenting based on the concepts that are learned. This is an introductory course to parenting, which is instructed in a simple lecture format that average parents and newcomers to parenting can comprehend and cover in a short period of time.  </p>  <p>  \t     The parenting styles that will be covered in this course are based on research by clinical and developmental psychologist, Diana Baumrind, currently at the Institute of Human Development, University of California, Berkeley.  This course is also a good source for students interested in brushing up on the general parenting styles that she identified.  </p>  <p>  \t    This is a self paced course that anyone can fit into their busy schedule (as parents often juggle a lot).  The course materials contain 14 lectures, which include an introductory lecture, 6 lectures on the traditional parenting styles, lectures on effective parenting, fostering self esteem, positive discipline, and a conclusion.  </p>  <p>  \t    Take this course to quickly identify parenting styles, including positive guidance techniques that help children develop positive self-concepts, self-management, and responsibility.  </p>", 
    "end_date": null, 
    "title": "Outcome of Parenting Styles and Positive Parenting Skills", 
    "price": "20.00", 
    "instructors": "S. Mahmud, MA, PPS", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160444_0c91_3.jpg", 
    "course_url": "https://www.udemy.com/outcome-of-parenting-styles-and-positive-parenting-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T04:31:18Z"
}