{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t<a href=\"javascript:void(0)\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\"></a>\r\n</p>\r\n<p>\r\n\t   I know it&#039;s a challenge to think about actually getting a handle on jealousy and anger and fear and insecurity, but wouldn&#039;t it be nice to?\r\n</p>\r\n<p>\r\n\t   Well, now you can!\r\n</p>\r\n<p>\r\n\t   Overcoming Jealousy is a nine part series that will support anyone who wants to develop new responses to jealousy. Jealousy has long been accepted in this culture as a normal way of responding to feeling upset about the actions of another. Whether you are in a monogamous relationship, an open relationship, or still looking, jealousy can still become an issue.\r\n</p>\r\n<p>\r\n\t   Jealousy is not cute and affectionate, it actually destroys relationships. Now is your time to develop new responses to this emotion.\r\n</p>\r\n<p>\r\n\t   Overcoming Jealousy will take you on a nine step journey to healing. Jealousy brings out two other emotions, fear and anger. These emotions are usually the result or response to feeling jealous. This nine step system provides practical tools as well as heartfelt lessons about how it&#039;s important to cultivate peace and joy, rather than anger and fear. You will be easily guided to replace your prior responses to jealousy with quick and easy tips, practices, processes and meditations.\r\n</p>\r\n<p>\r\n\t   This kit includes 11 video lectures and 1 audio affirmation meditation download.  You will discover:\r\n</p>\r\n<ol>\r\n\t<li>How to affirm your truth when jealousy strikes</li>\r\n\t<li>How to commit to changing your jealousy habits</li>\r\n\t<li>Controlling your destiny and getting what you want in life.</li>\r\n\t<li>Pushing past the fear and doing something new</li>\r\n\t<li>Seeing the light at the end of the tunnel</li>\r\n\t<li>Dissecting jealousy, what is it exactly?</li>\r\n\t<li>Controlling Your Destiny</li>\r\n\t<li>Finding Peace Within</li>\r\n\t<li>Tools on letting go of the emotions that are toxic to the body.</li>\r\n</ol>\r\n<p>\r\n\t   Jealousy is actually not a negative emotion, it&#039;s there for a reason - usually it&#039;s informing you that there is something more you want, need or desire that you are simply not asking for or expecting. Usually jealousy shows us what we want, but we feel disempowered to reach for it. Jealousy can be utilized as a positive emotion if we would just decide that we will no longer respond to it with anger and fear. It&#039;s time to shift our responses.\r\n</p>\r\n<p>\r\n\t   Enjoy over 4.5 hours of instruction and meditative exercises as well as practical tools.\r\n</p>\r\n<p>\r\n\t   Enjoy and Good Luck!\r\n</p>", 
    "end_date": null, 
    "title": "Overcoming Jealousy", 
    "price": "50.00", 
    "instructors": "Carl Stevens", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/147898_e751_2.jpg", 
    "course_url": "https://www.udemy.com/overcoming-jealousy/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-16T16:38:31Z"
}