{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you have trouble finding <strong class=\"redactor-inline-converted\">the time</strong> to spend with your kids?   Do you want to <strong class=\"redactor-inline-converted\">experience </strong>the satisfaction of supplementing your kids' education? Do you want your kids to be <strong class=\"redactor-inline-converted\">prepared f</strong>or grades K-20?   <strong class=\"redactor-inline-converted\">If you said \"yes\"</strong> to any of the questions above, it would be <strong class=\"redactor-inline-converted\">critica</strong>l for you to be a part of the demonstrations and lectures that this course will provide.</p>\n\n<p><strong class=\"redactor-inline-converted\">Welcome to 'Getting Parents and their Kids on the Same Page'.</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">So, what is this course all about?</strong> </p>\n\n\n\n<p>Through animation and presentation software, this course will concentrate on methods for developing needed tools for kids' study through demonstrations. Children everywhere need sound training in the reading, writing, and arithmetic areas, but the training needs to be given in creative and interesting ways so that the children will want to learn. Some people may think that it is impossible to plan innovative programs with a small amount of money, but there are vast resources available from existing materials at little or no expense. Although most parents have talked to, traveled with, and tinkered around their young kids, they have not stopped to formalize these three T's into a teaching method. This method is needed because children spend such a large proportion of their time in the home or around parents. Here the formalized Three T's method becomes an informal way to enhance any formal educational system. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What makes this course unique?</strong> The course will help guide busy parents in creating a supplemental home-based educational program to build-up their kids' key cognitive strategies and higher-order thinking. In developing this program, parents will be shown how their every-day interaction with their kids can help prepare them for real-world experiences in life and higher education through the following that will be defined more in this course:</p>\n\n\n\n<ul><li>Parents talk to their kids and try to make them learn new words and concepts. </li> <li>Parents buy and play with toys to encourage their young children to tinker.</li> <li>Parents travel with their kids through parks and pointing out flowers and squirrels. </li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p><p><strong class=\"redactor-inline-converted\">Looking forward to working with you </strong>in this course by getting you and your kids on the same page.</p>\n\n<p><strong><br></strong></p><p><strong>Lecture Notes are available</strong> from Amazon under the title,  Getting Parents and their Kids on the Same Page</p>", 
    "end_date": null, 
    "title": "Parenting: Getting Parents and their Kids on the Same Page", 
    "price": "20.00", 
    "instructors": "Lorette Weldon", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455948_251b_3.jpg", 
    "course_url": "https://www.udemy.com/getting-parents-and-their-kids-on-the-same-page/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T17:44:09Z"
}