{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Stop, Drop or Roll </em></strong></p><p><strong><em>A positive parenting Course on Discipline </em></strong></p><p>Do you feel discouraged, frustrated or even embarrased with your child's behavior? </p><p>Are you wondering how to lovingly correct your child? </p><p>Do you want to avoid the empty promises, threats and nagging? </p><p>In this course you will know how to put out negative, behavioral fires with empowerment for you and your child.</p><p>As a mom of 6 children ages 7-17 years old, Tricia has hands on experience with all things parenting.</p><p>Helping your child know how to navigate through life is a big job and with Tricia's courses you can have the confidence you need to parent empowered and to encourage your child's individuality and empowerment. </p><p>Your child's behavior is one of those issues that can leave you feeling overwhelmed,  discouraged, sometimes even embarrassed or worse yet like you are FAILING. So many parents focus on the outward behavior of the child and when their child is displaying behavior that is\"unacceptable\" to either the parents, friends or family the parent tries to control this behavior or simply feels defeated and gives up.</p><p> Our job as parents should be to help our child embrace their individuality and grow up to be a independent, healthy contributor to their community. This happens by helping your child internalize and take responsibility for their choices and giving them the opportunity to express themselves while gently guiding them to learn from decisions they make.</p><p> Tricia's course focuses on respect and responsibility as well as a laying a foundation  for an unconditional loving relationship that will last into adulthood.  </p><p><br></p><p><strong>Introducing: </strong></p><p><strong>Stop, Drop or Roll: Putting out the Behavior Fires</strong></p><p><strong>A positive parenting course to Discipline</strong></p><p>You will have a positive approach to discipline and know how to apply a proven system to deal with outward behavior while focusing on helping your child learn how to be respectful and empowered. </p><p><strong>You will discover: </strong></p><p><strong>Module 1: 7 Discipline keys to putting out behavior fires</strong></p><p><strong>Module 2: 4 Problematic approaches to discipline that hurt you and your child</strong></p><p><strong>Module 3: Discipline method for positive parenting</strong></p><p><strong>Module 4: Putting Stop, Drop or Roll to the test </strong></p><p>Parenting is a big job to say the least.   Tricia's discipline course will help you put out behavior fires while still helping Helping your child learn how to be a confident, empowered and respectful to you and others. </p><p><strong><em>Discover a discipline method that will help you and your child be empowered. </em></strong></p><p><strong><em></em></strong></p><p><strong><em>Enroll now! </em></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Parenting with Empowerment: Discipline Course", 
    "price": "20.00", 
    "instructors": "Tricia Dunn", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680714_85af_5.jpg", 
    "course_url": "https://www.udemy.com/parenting-with-empowerment-discipline-course/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T17:51:01Z"
}