{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Hear from world renown Parenting experts Tara Brach, Rick Hanson, Christine Carter, Barbara Fredrickson, Sarah Napthali - and more</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Testimonials:</strong></p>\n\n\n\n<p>\"<em>Life Changing.</em><em> It's rare to come across a program that you can instantly apply in your life and have it make such an impact.\"</em></p>\n\n\n\n<p>  \t\"<em>Just wanting to express my utmost gratitude for your amazing program. I honestly feel like this is a life changing experience for me.</em>\"  </p>\n\n\n\n<p>  \t“<em>Thank you for the gift of this skill. My whole family thanks you!\"</em></p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">The factor that probably has the highest effect on outcomes for children is the level of well being and functioning of their mother. If you care about children, take good care of mothers.\"  </strong>Rick Hanson  </p>\n\n\n\n<p>  \t        Your happiness as a mother affects your children's happiness too. Taking care of yourself is the best gift you can give your child – and yourself!  </p>\n\n<p>Parenting is possibly the most demanding job you will ever have. Some people joke that it is the only place you can experience heaven and hell at the same time. And yet it also has the potential to be the most fulfilling thing we will ever do.</p>\n\n\n\n<p>  \t        Mindfulness4Mothers is not another set of instructions on how to be a perfect parent. Far from it. It is expert self care for any stage of motherhood.</p>\n\n\n\n<p>  \t        PART ONE:  </p>\n\n\n\n<p>  \t        Hear the experts discuss how mindfulness, self compassion and positive psychology can help you deal with the overwhelming demands of parenting on your time and sanity! They share insights and practices for:  </p>\n\n\n\n<p>&gt; responding to emotional eruptions from your children,  </p>\n\n\n\n<p>&gt; stress and anxiety  </p>\n\n\n\n<p>&gt; building trust in your in-built parenting wisdom and </p>\n\n<p>&gt; creating a lasting relationship with your child</p>\n\n\n\n<p>  \t  Hear how prioritising your own self care will benefit your well-being, your relationships and the joy and connection you share with your children.  </p>\n\n\n\n<p>  \t        PART TWO:  </p>\n\n\n\n<p>  \t        Download six practical guided mindfulness exercises for ongoing use to support your self care as a parent.</p>\n\n\n\n<p>  \t  Practices range from “in the moment and quick fixes\" to longer practices for rest and renewal that will resource you for the marathon of motherhood.  </p>\n\n\n\n<p>  \t  You also receive a complimentary workbook to help you track your progress and reflections as you become a more mindful mother. This includes quick tips to help those of you who want to establish a mindfulness practice for the first time – or who want some extra guidance on how to set yourself up for the greatest gain from your time.  </p>\n\n\n\n<p>  \t  </p>\n\n\n\n<p><strong>  \t        Say goodbye to exhaustion, overwhelm and self doubt &amp; become the best version of yourself again: the kind of parent your child needs! Develop trust in your in-built parenting wisdom and create a lasting relationship with your child.</strong></p>\n\n<p>Give yourself the gift of peace. Sign up and start taking care of the most important person in your child's life. You!  </p>", 
    "end_date": null, 
    "title": "Parenting with Tara Brach, Rick Hanson Mindfulness 4 Mothers", 
    "price": "50.00", 
    "instructors": "Kellie Edwards", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417142_7f76_15.jpg", 
    "course_url": "https://www.udemy.com/mindfulness4mothers-a-parenting-life-raft-for-mothers/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-09T09:34:28Z"
}