{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The most valuable asset you have as a parent is your calm presence. This two-part course includes evidence-based strategies from western psychology and ancient wisdom from yoga, and mindful self-care practices that integrate both. This course is designed for parents, or anyone interested in learning more about mindful parenting.</p><p style=\"\">Core teachings include these foundational topics:</p><ul style=\"\"><li style=\"\">Model a calm and clear presence</li><li style=\"\">Create a loving space for self-care</li></ul><p style=\"\">You will connect to your innate wisdom, cultivate mindfulness, and build your life force through the following:</p><ul style=\"\"><li style=\"\">Restorative postures</li><li style=\"\">Self-care practices</li><li style=\"\">Meditation</li><li style=\"\">Stories to inspire</li><li style=\"\">Questions for self-reflection</li></ul><p style=\"\">Plus, you&#039;ll learn active listening techniques essential for healthy family communication.</p><p style=\"\">What you&#039;ll need:</p><ul style=\"\"><li style=\"\">a clear quiet space in your home where you can relax and turn inward</li><li style=\"\">a chair, bolster or cushion, and 1-2 blankets</li><li style=\"\">a partner or friend to join you in the partner exercises</li></ul>In total, the class will take you approximately 4 hours to complete.<p style=\"\"></p><p style=\"\">Recent Testimonials:</p><p style=\"\"><em style=\"\">&quot;These may be the most useful and affirming two hours you can spend as a parent. It is the ultimate gift in self-care that in turn becomes a great gift to your child. The concepts and video demonstrations, the poses and the stories, weave a tapestry of that “loving space&quot; from which we can be our best self in the service of our children and our parenting partners. For the clinician, it provides an accessible set of ideas and strategies for helping the stressed parents we serve. A fantastic resource.&quot;</em></p><p style=\"\"><em style=\"\">&quot;Luci Hackbert, PhD has done what she does best and created a thoughtful, gentle and clear guide to anyone on the path of parenting. The power of her work lies in her unwavering support of parents and their inner lives. Luci empowers us to show up for ourselves so we can embody the responsibility and joy of raising our children.&quot;</em></p>", 
    "end_date": null, 
    "title": "Parenting with Awareness: Mindfulness for parents!", 
    "price": "50.00", 
    "instructors": "Lucianne Hackbert, PhD", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517558_e0e9.jpg", 
    "course_url": "https://www.udemy.com/parenting-with-awareness/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T23:18:13Z"
}