{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This brand new Udemy course shows you step by step how we were able to get our child into one of the top 20 highest paid careers in America. Our child was in the top 2% of the entire country in Academic scores.</p><p>This class is for beginner to\nadvanced.<br></p>    <p>Stop worrying about your child’s future and take charge by taking this course!</p>    <p>Come with us on a 20 year journey of achieving financial independence for our children. Our years of experiments have REALLY paid off.</p>    <p>My wife and I are asked on a regular basis <em>“how did you do that”? “You must have been lucky”, “They wrote a check to the Alumni”, “Someone in their family must be a doctor”.</em> The list goes on. </p>  <p>I am here to tell you, it’s not about luck or writing a check. It’s about working together as a finely tuned MACHINE!</p>    <p>Not only did our child graduate Honors College, she was offered 4 medical schools to choose from.</p>    <p>Learn how 100% of our child’s Pre-Med tuition for was FREE. – No loans to pay back! </p>    <p>The class is MOBILE ready for ON-THE-GO. </p>  <p>Perfect for those in between times. The course knows where you last left off last.</p>    <p>As well as the Udemy 30 day money back simple guarantee, you have my personal promise that you will be delighted in what I will show you. You will kicking yourself that you haven’t started doing these things!</p>    <p>Every minute you delay is costing your CHILD’S FUTURE…</p>  <p>Enroll now!</p>    <p>I go over all the successful tricks from infant to late teens. All the things we did.</p>    <p>Any family can break the chain like we have.</p>    <p>Nothing is kept secret – I reveal everything we have done. </p>    <p>You will have a lifetime access to the course and be updated on NEW lectures.</p>", 
    "end_date": null, 
    "title": "Parenting: 100+ Ways To Get Your Child A 4.0 GPA", 
    "price": "20.00", 
    "instructors": "Craig McMahon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/756108_568e.jpg", 
    "course_url": "https://www.udemy.com/parents-see-how-i-raised-my-child-to-become-a-doctor/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T16:20:09Z"
}