{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>                                Parenting with Empowerment Coaching Program </em></strong></p><p>In a team sport it is the captain and the teammates that win the game!</p>    <p>Sure, Coaches give the team strategies and give helpful plays in practice, and yet, it is the team that needs to be committed to using what is learned and practiced if they are to be successful in the game season. </p>    <p>So it is with parenting, you and your spouse/ partner are the captains in your family.  You have all the skills needed to be successful and this Coaching Program will assist you in developing the best strategies, exercises, and practice to a successful game.   </p>    <p>By developing your own game plan you will remove frustration and doubt which will result in your confidence to reach your ultimate goal of parenting empowered helping  your child become an independent and confident adult. </p>    <p>The purpose of this parenting program is to assist YOU in writing your own game plan.  Congratulations on taking the first steps toward success!</p>    <p><strong>This Course at a glance: </strong></p><ul><li><span></span>4 high quality video modules with assignments </li><li>How to have a solid parenting foundation </li><li>The 4 P's of Parenting, a proven system to positive parenting</li><li>How to know what area to address first with confidence and empowerment</li></ul><p>All you need is a notebook and pen, access to a reliable internet! </p><p><strong><em>                                                             Enroll today! </em></strong></p><p><strong><br></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Parenting with Empowerment Coaching Program", 
    "price": "20.00", 
    "instructors": "Tricia Dunn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680034_31a1_2.jpg", 
    "course_url": "https://www.udemy.com/parenting-with-empowerment-coaching-program/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T23:50:18Z"
}