{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The objective of this course is to <strong>involve a child in activities</strong> which will present information for the <strong>child's use in the future.</strong> Most parents are busy with chores at home, work for a job, and other life activities. They believe he or she has little time to dedicate to a child. <strong>T</strong><strong>his course reveals how your family can bridge the gap of time and build peaceful lines of communication through talking, tinkering, and traveling between each other. </strong></p><p>This communication method is called the Three T's (Talking, Tinkering, and Traveling) and it is a great way to strengthen your relationship with your family and strengthen your own mind when studying for projects or classes. Let me explain.</p><p>When I first started teaching, I had two complaints. The students would often say that they did not know what the assignment was and they did not know what to do once they knew the assignment. My complaint was that they loved to use their cell phones, tablets, and laptops in class. They were clever in keeping them out of the teacher's eyesight until you would hear buzzing from the vibrations of ringing or Windows‐opening music coming from their desks. I immediately had this epiphany. Why not use their beloved technology to solve their complaining.</p><p>I would refer the students to their phones, tablets, and laptops in class. Technology became the students' classmates who could look up a word they were stuck on during an in‐class reading. Students stopped asking what that word meant and begin to ask for more examples of the usage of that word. They started e-mailing me before, during, and after class. I realized that the students wanted me to talk to them, after class, more about the subject that we discussed in class during a time when they were free to pay attention more. <strong>They wanted to be able to rewind what I said. The students wanted me to travel wherever they were going after class so that they could continue the lecture.  </strong>When they felt ready, they wanted to be able to tinker with some ideas that I shared with them in the lecture through automatically graded exercises. This prompted me to go a step further and <strong>create my avatar teaching assistant</strong>.</p><p>The classroom was no longer one‐sided with me talking and the students taking notes. The three of us were having a conversation—my avatar teaching assistant, the students, and myself.</p><p>This method also had an<strong> </strong><strong>impact on their kids at home who would be watching their parents studying using my avatar teaching assistant.</strong></p><p>My students are busy parents <strong>who think they hardly</strong> have time for their kids. This course is based on a teaching method that allows them to work with their children as they study for my college courses. </p><p><strong>In this course, the avatar teaching assistant </strong>takes on the form of the Rivers Family. I have used the Rivers' story in past college courses to help my students get acclimated in working on different types of projects with their kids and relating those projects to their studying. I created a case study, found in my book, <strong>Finding Perpetual Harmony</strong>. The Rivers family is busy with regular daily life activities. After reading along with a video of the Rivers' story, the students get to apply, how the Rivers solved family problems, to their own family dilemmas. My students found it refreshing to actually watch a cartoon taking place in a setting and environment with people they would love to be living next to so this course allows you and your family to participate in the life of the Rivers family. See if you agree or not agree with how they solve their problems. What would your family do in their place?</p><p><strong>So, in this course,</strong> I have allowed the Rivers family to become the main focus in showing you how to strengthen your relationships with your children by showing examples of how the Rivers family Talks, Tinkers, and Travels to gain new knowledge and understanding of life and the world outside <em>Wine Dance County</em>.</p><p><strong>After each section of this course, the family is quizzed on what they learned and how it can apply to their own lives.</strong></p><p>So, come to<em> Wine Dance County</em> and learn how to have a stronger relationship with your family today with Milisho, Gabriel, and Kara Rivers.</p>", 
    "end_date": null, 
    "title": "Parenting Relationships through Three T's", 
    "price": "20.00", 
    "instructors": "Lorette Weldon", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/517458_e7e6_2.jpg", 
    "course_url": "https://www.udemy.com/parenting-relationships-through-three-ts/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-01T20:49:38Z"
}