{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Parenting with Empowerment: Positive Potty Training Course</em></strong></p><ul><li><strong>Do you feel ready to potty train your toddler but don't know where to start? Are you wondering how to know if your little one is big enough to start the potty train?<br></strong></li><li><strong>Do you want to avoid the frustration, uncertainties and mess that you have heard other parents warn you about?<br></strong></li><li><strong>Do you want to provide your child with a empowering, successful potty training experience?<br></strong></li><li><strong>Are you dreading and overwhelmed with the task of potty </strong><strong>training?</strong></li></ul><p><span></span></p><p>My friend Natalie was felt this way too! She questioned the readiness of her son, she felt uneasy deciding the best approach to use for potty training. I mean, from potty chairs for her boy to sit on, to getting him to the potty on time... the whole ordeal was overwhelming!</p><p>She tried her best. She told him he was a big boy and he was going to start potty training, only to find out he wasn't ready ... or was he? Her son was confused and left feeling a lack of confidence and soon Natalie gave up\" He's just not ready\"! she said.</p><p>Natalie followed the principles in this course and soon soon understood how to know if her son was ready. She had the tools to create her own potty training plan for her and her son. In a short time, she and her son had the confidence to successful in potty training.</p><p>Most importantly Natalie's son was able to take one of the first most important steps to empowered independence.</p><p>Introducing...</p><p><strong>Parenting with Empowerment: </strong></p><p><strong><em>Positive Potty Training</em></strong></p><p>In this course, you will know how to set up a solid foundation for success for you and your child. You have the basic facts and knowledge to know if you and your child are ready to begin. You will have a step by step process to create your own plan for potty training. This course also covers night time potty training and how to deal with regressions and challenges. This course is delivered in high quality video lectures and includes a success chart and a certificate of success. </p><p><strong><em>You will discover:</em></strong> </p><p><strong>Module 1: How to set a solid foundation for potty training success</strong></p><p><strong>Module 2: The basics to getting started</strong></p><p><strong>Module 3:The importance of teaching Hygiene and personal responsibility</strong></p><p><strong>Module 4: How to have night time success</strong></p><p><strong>module 5: What to do with regressions and troubleshooting tips</strong></p><p>Potty training is as can be as simple as 1. 2. ...well, 1 and 2!</p><p><strong>Enroll now for you and your child's potty training </strong><strong>success!</strong></p>", 
    "end_date": null, 
    "title": "Parenting with Empowerment:  Potty Training with Success", 
    "price": "20.00", 
    "instructors": "Tricia Dunn", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680682_8a81_3.jpg", 
    "course_url": "https://www.udemy.com/positive-potty-training/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T17:21:10Z"
}