{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Parenting is one of the most demanding yet fulfilling experiences one can have. From a baby, a toddler, a first grader, to a teenager, parents are constantly kept on their feet to raise good and happy children.  </p>  <p style=\"\">  \t      With gamification, combining research from game design, behavior science, and motivational theories, learners get access to a powerful tool that makes parenting playful and fun, yet very effective. Children raised in such ways will become more empowered, socially apt, confident, and empathic.  </p>  <p style=\"\">  \t      This course will walk learners through the science behind children&#039;s reactions and motivations, showcase many practical examples, introduce tools that parents can apply for different situation in their interaction with children of any age.  </p>  <p style=\"\">  \t  This course is for parents, educators, and caretakers, who want to apply a scientific, yet fun way of empowering children. Learners should show curiosity for new methods for upbringing, have empathy for children, and be willing to question their own conventional wisdom.  </p>  <p style=\"\">  \t  At the end of the course parents will have a tool set that allows to empower their children in a fun and effective way.  </p>", 
    "end_date": null, 
    "title": "Parenting with Gamification - Raising Empowered Children", 
    "price": "20.00", 
    "instructors": "Mario Herger", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/414716_c095_5.jpg", 
    "course_url": "https://www.udemy.com/parenting-with-gamification-raising-empowered-children/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T03:28:37Z"
}