{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Are you single and struggling to attract the right man?</li></ul><p>or </p><ul><li>Are you in a relationship that is drowning or on the brink of break ups/divorce?</li></ul><p>or</p><ul><li> Are you sexually frustrated? Just had a baby or never had an orgasm?</li></ul><p><strong><br></strong></p><p><strong>If you say YES to any of the above, we invite you to explore &amp; get involved in our REAL, RAW, AUTHENTIC &amp; BLUNT conversations where we discuss &amp; share openly about some of the sensitive &amp; hot topics most people don't dare to talk about. Most importantly, we share with you the shit that works!</strong><strong></strong></p><p><br></p><p>Hi my name is Jane Nguyen, Author, Speaker &amp; Dating Coach &amp; Relationship Mentor from Honeymoon Forever.<br></p><p>Hi my name is Melina MacDonald, Intimate Product &amp; Lifestyle Educator from Taboo Intimacy &amp; Love Indulgence.</p><p>We are here today to share with you our amazing program called Love, Sex &amp; Relationships.</p><p>Let's get real here, relationship skills or mindsets are not something we learn at schools. Yet, they are (as we believe) amongst the most important skill sets to have. Most of us have learnt about relationships through our parents and I must admit, some parents are not the best models when it comes to relationships. Because of that, most of us dabble in dating, relationships &amp; intimacy.</p><p>In Australia alone, more than 40% of marriages end in divorce, while in the US, it is over 50%.</p><p>These figures are staggering &amp; scary!!!!</p><p>So the question is: Given that the odds are so high, why are we still taking the risk?</p><p>It makes complete sense that we need to get educated on relationships. </p><p>So this is where we come in….</p><p>Our program “Love, Sex &amp; Relationships” is designed to give you lots of great insights into dating, relationships &amp; intimacy. This is where we unveil the curtain behind the secrets of great sex &amp; relationships, how to attract the right partner, demystify some common myths &amp; mistakes that most people don't know about.</p><p>Some of the hot topics include:<br></p><ul><li>Cheating</li><li>Bad boys</li><li>How to get your needs met and how to get your partner's desires satisfied.</li><li>Sexual Empowerment</li><li>Myths about orgasm</li><li>How to have better &amp; more amazing sex life</li><li>Blow jobs</li><li>Emotional Incest</li></ul><p>And much more…</p><p>What also makes the program unique and different is that these are simple, easy to apply strategies that WORK!!! <br></p><p>We have combined our experience &amp; expertise to share with you the best that we have learned over the years to figure our the codes to amazing relationships.<br>We have done the leg work for you…sharing with you only those we have tested &amp; applied in our lives and from our clients that we have worked with.<br><br>In this program, we also include Info sheets &amp; exercise sheets for each video, which means you can apply straight away what you have learned.</p><p>This program allows you to do it in the comfort of your own home, when it fits you &amp; your schedule.</p><p><br></p><p><strong>Partnered with 100% Money Back Guarantee, join Mel and Jane and other learners in learning how to build stronger, healthier and more fulfilling relationships and dating life. </strong></p><p><strong>ROCK YOUR BODY AND CONFIDENCE!</strong><strong></strong></p><p><strong>ROCK YOUR LOVE &amp; DATING!</strong></p><p><strong>ROCK IT IN THE BEDROOM!!!</strong></p><p><strong>BE THE ENVY OF EVERYONE AROUND YOU!</strong></p><p><strong>Join us down the rabbit hole and your life will never be the same again!</strong></p><p><br></p><p><br></p><br>", 
    "end_date": null, 
    "title": "Passionate Relationship & Hotter Sex Life in 30 days", 
    "price": "50.00", 
    "instructors": "Mel & Jane", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606606_e101_3.jpg", 
    "course_url": "https://www.udemy.com/love-sex-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T02:44:49Z"
}