{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            This was the training you should have had in elementary school about &#039;playing well with others&#039;.  </p>  <p>  \t                I&#039;ve lost marriages, business deals, and friends because of not having the skills that I needed to express clearly what I wanted from others.  </p>  <p>  \t                Even worse, I lost some opportunities before they ever began. Does this sound familiar?  </p>  <p>  \t<strong style=\"\">              This course is guaranteed to maximize the chances of you getting what you want in any interaction with others.  </strong>  </p>  <p>  \t                It brings communication and relating down to the <strong style=\"\">very basics</strong>.  </p>  <p>  \t      1. What do I want?  </p>  <p>  \t  The key to knowing what you want is to be in connection with your &#039;feelings&#039;. Unfortunately, our feelings are repressed from a very early age. This course helps you get in touch with them (through a simple daily practice), so that you can know exactly what it is you want. (Curing: &quot;I don&#039;t know what I want&quot;-itis)  </p>  <p>  \t      2. How can I ask for it? (Easily and without fear)  </p>  <p>  \t  We are trained from childhood NOT to directly ask for what we want. &quot;Why are you so selfish?&quot; &quot;Don&#039;t you see we aren&#039;t made out of money?&quot; Yada yada yada.  </p>  <p>  \t  What results? We seldom ask directly for what we want. And what happens then? We don&#039;t get it, of course! So we result to subterfuge. This course heals that process.  </p>  <p>  \t      3. And how can I easily help others move from a &#039;No!&#039; to a &#039;Yes!&quot;?  </p>  <p>  \t  Through showing empathy with the other person, helping them get what they want...just giving naturally, you encourage others to give back to you. I show you in this course how to drop the negative emotion connected with the past and simply, deeply connect to your communication partner. This dramatically increases the chances of you getting what you want.  </p>  <p>  \t                                A relationship is a continuous flow of <strong style=\"\">actions</strong> back and forth between two people. It can only thrive as long as there is <strong style=\"\">mutual benefit</strong>.  </p>  <p>  \t                                          Through the presentation and included worksheets, discover a process as natural as breathing for getting your needs met.  </p>  <p>  \t                                          If you have ever found yourself &#039;giving without getting&#039; in a relationship, not knowing what you want or how to get it, or been labeled &#039;codependent&#039;, this course will help you know exactly what you want and communicate to get it.  </p>  <p>  \t    One participant writes:  </p>  <p style=\"\">  \t    “I went into the course work thinking it would simply enhance my communication skills and improve my relationships.  ... The exercises helped me see how much my needs were not getting met.  </p>  <p style=\"\">  \t    “Now I experience a growing ease in knowing what my needs are and have effective strategies for asking that those needs be met.&quot;, Sunny, 44 from California.  </p>  <p style=\"\">  \t    What are you waiting for? Start today!  </p>  <p>  \t                                    30-Day no-questions-asked Money-Back Guarantee  </p>", 
    "end_date": null, 
    "title": "Perfect Relating: 3 Easy Steps to Get what You Want", 
    "price": "25.00", 
    "instructors": "Ryan Orrock", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/212892_cf95_5.jpg", 
    "course_url": "https://www.udemy.com/get-what-you-want-in-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-08T07:14:04Z"
}