{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In our modern world change is coming faster than ever. Skills and knowledge that once lasted centuries and decades is now often obsolete within a few years. Our children need the skillset of the 21st century that allows them to adapt to the change and create the change and lead happier lives.</p><p>In this course I teach what the factors are that help children become and stay creative. Creativity can be taught, practiced, and turned into a habit. I start with explaining related concepts terminology such as curiosity, asking questions, boredom, or failure and what&#039;s their role for creativity.</p><p>I introduce multiple techniques and practices, talk about common pitfalls, show results of studies that tested and experimented with conditions to increase (or decrease) creativity.</p><p>One part of the course describes the basics for creativity, including curiosity, boredom, mindset, and failure. In the main part I walk you through what creativity is, how it is measured, what influences it, and what are good practices and tools to foster creativity.</p><p>Each course lecture comes as a video and the majority of them also has some supporting slides.</p><p>If you want to prepare your child or children to be creative and take control of their professional and private lives, and if yo have not been happy with the way traditional schools are teaching, then this course is for you.</p>", 
    "end_date": null, 
    "title": "Raising Curious & Creative Children with Gamification", 
    "price": "30.00", 
    "instructors": "Mario Herger", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/439310_ce62.jpg", 
    "course_url": "https://www.udemy.com/raising-curious-creative-children-with-gamification/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-05T07:47:41Z"
}