{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t    The &quot;<em><strong>Rebel&#039;s Guide to Better Sex</strong></em>&quot; offers you over 2 hours of training via 7 video lectures.\r\n</p>\r\n<p>\r\n\t<strong>The instructor <a href=\"http://jenspringer.com/whos-jen-springer/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">Jen Springer,</a> who is very direct and instructs with dry humor and dirty wit.  <em>Could it be any other way growing up in Chicago?</em></strong> If you love a little bit of raw and sexual puns, you will enjoy Jen&#039;s teaching style.\r\n</p>\r\n<p>\r\n\t <br>\r\n\t <strong>There are no pornographic photos or nude images in this course, but words like &quot;crap, ass, boner, vagina, genitals, penis, and orgasm&quot; are used.</strong>  So if you&#039;re not an uptight student, you&#039;ll have a good time learning in this informative course.\r\n</p>\r\n<p>\r\n\t <strong>Specifically detailed are over 30 ways that you can improve your love  life:</strong> 10 for men, 10 for women, and 10 for couples. Jen also throws in a few bonuses that spiff up your sexual Kung Fu by giving your the beginner steps to improving your sexual fitness.\r\n</p>\r\n<p>\r\n\t <strong>The course focuses on ways you can improve your mojo using food, lifestyle, and other easy non-prescriptive solutions.</strong>  No matter what your age is, you will get something from this information that will make you feel more alive, think clearer, and <em>probably chasing your partner around the house to get some boom-chicky-bow-bow on a more frequent basis.</em>\r\n</p>\r\n<p>\r\n\t <strong>An educational, fun, and flirty good time!</strong>\r\n</p>", 
    "end_date": null, 
    "title": "Rebel's Guide to Better Sex", 
    "price": "20.00", 
    "instructors": "Jen Springer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88426_6915_5.jpg", 
    "course_url": "https://www.udemy.com/rebels-guide-to-better-sex/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-05T02:26:24Z"
}