{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\">Updates:</strong>  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\"><em><em><strong class=\"redactor-inline-converted\"><em><strong class=\"redactor-inline-converted\"><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></em></strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Join Over 500+ Other Women Who are Enrolled in this Course</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">WARNING : </strong><em>By Taking this Course , you will learn not only how to attract a man, but how to keep him enamored with you, overcome the pitfalls big and small in a relationship, and to keep that relationship strong for years to come.</em>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">The goal of this Course is not to change you.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<em>It is not to make you into another woman. The goal of this course is to strip away the barriers holding you back, open up so he can experience your true personality, and then create a strong, lasting love that continues to attract him, no matter how long you are together.</em>  </p>\n\n\n\n\n\n\n\n<p>  \t                    Ever been dumped or ended a relationship yourself? Of course you have (unless you married your first-grade boyfriend, in which case, you can stop reading right now). And no matter how much of a \"not so  nice person\" he was—or how precipitously you'd fallen out of love with him—there's no way to avoid a couple of emotional bruises.  </p>\n\n\n\n\n\n\n\n<p> Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong class=\"redactor-inline-converted\">at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong class=\"redactor-inline-converted\">you'll be kicking yourself if you already have a Udemy course</strong> and have been missing out on a chance to FIND Mr. Right.</p>\n\n\n\n\n\n\n\n<p>  \t                    By taking this course, you set yourself up for success when you finally meet Mr. Right so that you can start a relationship, be truly happy, and live the love filled life you've always dreamed of. The goal is of this course is not to change you, The goal is to strip away the barriers holding you back( Cheaters, Liars, Guys with Commitment issues), open up so he can experience your true personality, and then create a strong, lasting love that continues to attract him, no matter how long you are together.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Consider this your dating playbook - survive the first date and make sure there's a second one .</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<em>So, you've read this far! Thank you. </em>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">By Enrolling in this course, you set yourself up for success when you finally meet Mr. Right so that you can start a relationship, be truly happy, and live the life you've always dreamed of. </strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Here is a Sample what you Will Discover in this Course.......</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li>How to make a man head over heels for you, practically begging you to go out with him.</li>  \t<li>How to build a foundation of trust and communication, while keeping your man interested for the rest of your life.</li>  \t<li>How deal with cheating in Your relationship.</li>  \t<li>How to inject energy and spice into your love life, whether you've been together for 4 months or 4 years.</li>  \t<li>How to Attract a Boyfriend.</li>  \t<li>Learn how to get your boyfriend to propose.</li>  \t<li>Discover how to manage dating someone that has Commitment issues.</li>  \t<li>Learn the Secrets to Getting Your Ex Back.</li>  \t<li>Online Dating Success Secrets that Lead to Fulfilling relationships</li>  \t<li>Plus Much Much More!!</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">    This is All Practical \"</strong><em>No-Nonsense Relationship and Dating Advice</em><strong class=\"redactor-inline-converted\">\"  No Fluff No Fantasy.</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\"> As with all my courses:</strong>  </p>\n\n\n\n\n\n\n\n<ul>  \t<li><strong>The initial low price will increase shortly - the course is currently $45, but will next increase to $499</strong></li>  \t<li>you have unlimited lifetime access at no extra costs, ever</li>  \t<li>all future additional lectures, bonuses, etc in this course are always free</li>  \t<li>there's an unconditional, never any questions asked full 30 day money back in full guarantee</li>  \t<li>my help is always available to you if you get stuck or have a question - my support is legendary in Udemy  \t</li>  </ul>\n\n\n\n\n\n\n\n<p>  \t          Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, you lose out. Simple as that.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Click the \"Take This Course\" button, on the top right because every hour you delay is Lost Time that you could be spending in a Fulfilling Relationship...</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Scroll up and Enroll Now! </strong>  </p>", 
    "end_date": null, 
    "title": "Relationship SECRETS for Women in their 20s - Find LOVE FAST", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336286_aa83_3.jpg", 
    "course_url": "https://www.udemy.com/relationship-and-dating-advice-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T04:42:24Z"
}