{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            JOIN Over 1,000 Students who have already benefited from this course!  </p>  <hr style=\"\">  <p>  \t            This course was created to stop the long hard search in finding the right person.  </p>  <p>  \t            In my 30&#039;s, I was still single and struggled through relationships that were not going anywhere.  </p>  <p>  \t            Being the determined person that I am, I figured it out. I learned how to turn my life around, get the guy I wanted and was married in 6 months! To my surprise what I did is what a lot of my married friends also used to find their partner.  </p>  <p>  \t            However, the learning process doesn&#039;t stop once you married. You will also learn how to keep your marriage a success.  </p>  <p>  \t            In this course, I am sharing everything that I discovered before and during my marriage with you.  </p>  <hr style=\"\">  <p>  \t            This course will show you how to:  </p>  <ul style=\"\">  \t<li>Attract the right partner for you.</li>  \t<li>Build your confidence.</li>  \t<li>Help you have the relationship you want without wasting      time.</li>  \t<li>Be a great partner and feed your relationship.</li>  \t<li>How to get you in a successful marriage.</li>  </ul>  <p>  \t<em style=\"\">Course Updated on: September 23, 2014</em>  </p>  <hr style=\"\">  <p>  \t            Have confidence and get your sexy back!  </p>  <p>  \t            Know the key words to say!  </p>  <p>  \t            Know the RIGHT actions to take.  </p>  <p>  \t            Know how to filter the men you date for the #1.  </p>  <p>  \t            Have a successful marriage in 6 months or less!  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Bonus!</strong>  </p>  <p>  \t            Talk to me privately one on one at any time during this course. You are not alone. I answer questions right away so there is little room for failure.  </p>  <hr style=\"\">  <p>  \t            Access to this course is unlimited and I am always adding new updated material.  </p>  <p>  \t            Take action now!  </p>  <hr style=\"\">", 
    "end_date": null, 
    "title": "Relationship to Marriage Success - How to Get a Commitment", 
    "price": "50.00", 
    "instructors": "Jessica Brown", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/139212_5aa8_7.jpg", 
    "course_url": "https://www.udemy.com/love-in-30-days/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-29T17:11:54Z"
}