{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>It’s happening again. That horrible feeling that your relationship is not what you thought it would be, or worse yet, coming apart. Whether you keep getting into heated arguments, or you have started living parallel, disconnected lives, you know you can’t go on like this forever.</p><p>I'm Kathleen Mates-Youngman M.A., Licensed Marriage and Family Therapist / Amazon Best-selling author / National Speaker.  I specialize in Couples Therapy, and am passionate about helping couples strengthen their relationship.  Everyday, couples come through my office, some feeling only mildly disconnected, some suffering from painful relationship injuries, and others on the verge of divorce. Regardless of the issues, they all benefit greatly from not only the therapeutic process, but from education and guidance about the most important traits for having a successful, connected, and resilient relationship.</p><p>I created \"Relationship Rescue:10 Steps Before Calling A Therapist,\" for all couples, healthy or struggling, to have an opportunity to learn and practice these essential, foundational, traits on their own. For some, this may be all they need to get back on track, and for others it will give them a head start before starting work with a couples therapist.</p>    <p>With \"Relationship Rescue: 10 steps before calling a Therapist,\" I will walk you through 10 lessons that will - if you listen with your heart and start to apply them – begin to immediately alleviate your concerns and help you feel more connected. Just by simply watching the introduction you will begin to be able to entertain the possibility that you really can be happier and healthier.<br></p>    <p> Listen, I want you to know, studies show that on average, couples struggle with relationship issues for 7 years before they finally seek therapy. Let me ask you this, would you let yourself endure any illness for 7 years without medical care?  So, why would you let yourself suffer with a broken heart or a lonely relationship for longer than 7 minutes!</p>    <p> If you see the sense in this, take just a few minutes now to review the lesson titles. I’ve made this course simple, yet deep and powerful. So, if you accept this mission, don’t waste another day, month or year!  Just click on the first lecture, take a deep breath, and give it a chance!</p>    <p><strong>What you can expect:</strong></p>    <p>As you go through this course, you can expect to learn, one by one, the most important traits of a great relationship. You will learn skills such as; the art of healthy communication, how to conflict without chaos, how to have healthy boundaries, respect, romance, and intimacy, and how to define, prevent and repair from infidelity. </p><p>The lectures are about 10 minutes long, and you can watch all 10  at one time, but I suggest you watch one a day or week so that you can really process the information.  At the end of each lecture I have included a downloadable resource that offers a few intentions to practice, followed by several questions to ask each other about the topic. By having this conversation you will learn more about yourself, each other, and how to make your relationship all that you want it to be!</p>    <p>The really great thing is that you have these short lectures in your library forever, to refer to whenever you need a <em>relationship tune-up! </em>So give each other a hug, click on lecture 1, and be open to learning and growing together!</p>", 
    "end_date": null, 
    "title": "Relationship Rescue: 10 Steps Before Calling A Therapist!", 
    "price": "30.00", 
    "instructors": "Kathleen Mates-Youngman", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/755634_377c.jpg", 
    "course_url": "https://www.udemy.com/relationship-rescue-10-steps-before-calling-a-therapist/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-08T05:08:52Z"
}