{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><br>What’s the secret to having great relationships?<br></strong><span>It’s simple really.&nbsp;</span></p><p>Most people look at the other person – whether that be a life partner, relative, friend, colleague, etc. – and they think, “If only this person would change, our relationship would be awesome.”</p><p>But the secret to having great relationships has nothing to do with changing the other person. The<span>&nbsp;secret is basically this...&nbsp;<em>be the change you wish to see when you’re with the other person</em>.</span></p><p>(Yes, we know, we stole that one right out of Gandhi’s playbook. To paraphrase another great thinker, Isaac Newton, we gladly acknowledge that we’re standing on the shoulders of giants!)</p><p><span><br></span></p><p><span><strong>Choose “Easy”</strong><br></span><span>Changing the other person? That’s really hard work and not much in your control. Some would say it’s pretty impossible.&nbsp;</span></p><p>Changing yourself so that you attract the response and the relationships you want? That’s much easier. And we’re all for choosing easy!</p><p>This course guides you along the easier path because it’s about what YOU can do to be awesome in your relationships.&nbsp;</p><p>We&#039;ve taken knowledge that has been accumulated by great minds over eons of observing human interactions and condensed it all into several essential principles that you can implement using minimum willpower through the 13x4 System.</p><p><span><br></span></p><p><span><strong>Here’s what you can expect to get from this course:</strong></span></p><p></p><ul><li><span>Increase your awareness of how to be great in your relationships with profoundly easy-to-use thought &amp; action algorithms.</span></li></ul><ul><li><span>Create a vision for each of your most important relationships and imagine best possible outcomes for the challenging ones.</span></li></ul><ul><li><span>Increase your ability to communicate effectively, including becoming a better listener.</span></li></ul><ul><li><span>Use the 13x4 System to put your relationship improvement plan on auto-pilot. &nbsp;You will have to do the work, but it will take minimum will.</span></li></ul><p></p><p></p><p>Join us to learn and apply the wisdom of some of the greatest minds in the field of self-development to improve, nurture and develop mutually-beneficial and loving relationships with friends, family and professional colleagues. They’ll love you for it!</p><p>_______________________________________________________________________</p><p><strong>Feedback about the simplicity and usefulness of the 13x4 System:</strong></p><p><span>***** This 13x4 is a roadmap that breaks a big concept down to small, doable pieces… &nbsp;A lot of people have theory, but not everyone can show you how to actually do something and how to do it your own way.</span></p><p><span>*****</span><span>&nbsp;Simplicity indeed, just notice what you would have done: &nbsp;A very well presented method for improving your situation, self and finances or business. &nbsp;It gives a methodology that can be used by anyone to improve their situation now with minimal effort. &nbsp;It shows/proves that you are not the sum of your past, but the limitless possibilities of your future.</span></p><p><span>*****</span><span>&nbsp;Amazing mind mastery that is simple and fun to apply: &nbsp;The 13 x 4 tool is a practical and simple tool that is applicable to anyone who wants to master a number of things (in this case 13) in a manageable way by focusing on each area for a week. Tom Cassidy and Angela Loeb explain this in a very clear and natural way that keeps you interested and amused!&nbsp;</span></p><p><span>*****</span><span>&nbsp;Useful Tool! Highly Recommended: &nbsp;Thanks!!</span></p><p><span>*****</span><span>&nbsp;Simple concept, great speaker:The concept 13x4 is very simple. I will review my goals and fit them in this format. &nbsp;<br><br></span></p><p></p>  ", 
    "end_date": null, 
    "title": "Relationship Mind Mastery: The Essentials", 
    "price": "30.00", 
    "instructors": "Angela R Loeb, Tom Cassidy", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62396_31be_15.jpg", 
    "course_url": "https://www.udemy.com/rmm-the-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T15:36:53Z"
}