{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5 style=\"\">What You Will Learn in Relationship University?</h5>  <p style=\"\">  \tRelationship University is unlike any other online course in the relationship and dating space.  RU is intense and engaging.  You will have more than just videos to learn from...you will also have assessments and writing assignments that draw you deeper into the learning experience. This is not a hobby course but rather a course for those serious about improving the overall quality of their life and the overall quality of their next relationship.  If you are looking to get the most from your education then this course should be on your top priority list.  </p>  <p style=\"\">  \t  This ecourse is designed specifically for those who are ready to grow and are serious about succeeding in their next relationship.  Contrary to popular belief, relationships often end when an individuals personal problems become the main focus and main distraction of the relationship.  Relationships are robbed when an individual struggles to become their true selves.  When this happens, the relationship is short changed and limited to the limitations that each person puts on themselves.  Your relationship will reflect back to you the condition of your heart.  How you choose to accept your reflection will determine the condition of the relationship.  <strong style=\"\">This is what Relationship University is all about...improving the reflection that you see when you stare into the mirror.</strong>  </p>  <p style=\"\">  \t   Some topics include: dealing with past baggage, healing from the past, financial wellness, career expectations, marriage role definition, family origins, family expectations, 5 love languages, conflict resolution…etc. After completing this course, each participant will then be eligible to be part of our exclusive dating pool where only those who have gone through the intense coaching or personal coaching can be a part of. That way you know that the person that you connect with has already gone through the same quality of coaching and training that you have gone through.  </p>", 
    "end_date": null, 
    "title": "Relationship University", 
    "price": "35.00", 
    "instructors": "David Taylor", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/172238_8374_6.jpg", 
    "course_url": "https://www.udemy.com/relationshipuniversity/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-24T17:38:18Z"
}