{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>***Updated For <em>June </em>2016***</strong></em><br><strong> <strong></strong></strong></p>\n\n<p><strong>Imagine being able to find out exactly who your perfect match would be with 100% certainty! <br></strong></p>\n\n\n\n\n\n<p>Yes! It is possible! <br></p>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><strong></strong>Whether you are a man or a woman, if you are looking to create and foster long lasting relationships then this course was made for you. I have absolutely no doubt that this course will help you find true love. <strong><br> </strong></p>\n\n\n\n\n\n<p><strong>Guarantee: \nBy the end of this course you will be able to have the knowledge and \nskills to find and attract your perfect partner who compliments \nyour personality and brings out the best in you.</strong><br></p>\n\n\n\n\n\n<p><strong>Why does Relationship Alchemy Work?</strong><br>During the course you will create your very own relationship profile which consists of 4 parts:</p>\n\n\n\n\n\n<p>1.) The first part is understanding your attachment style which is the most important element to a successful relationship. </p>\n\n\n\n\n\n<p>2.) Next, I will cover the concept of energy matching and why you and your partner NEED to have matching energy. </p>\n\n\n\n\n\n<p>3.) Then, I will talk about Philosophers &amp; Presenters and why that's the secret to creating deep long lasting relationships. </p>\n\n\n\n\n\n<p>4.) Lastly, I will cover Divergent &amp; Convergent thinking which will enable you to avoid conflict in a relationship.</p>\n\n\n\n\n\n<p>Eric will then cover the mindset and the actions that you need to take for you to attract your perfect match! </p>\n\n\n\n\n\n<p>As you can see, this course has been designed to make it simple and clear on how you can find and attract your perfect match. You will be left speechless on the effectiveness of Relationship Alchemy!<br></p>\n\n\n\n\n\n<p><strong>Why did I create Relationship Alchemy?</strong><br>For me this course\nis more than just about finding and attracting your perfect match. It is about giving\nyou the power and belief to know that it is possible to find somebody perfect for you. There\nare literally thousands of people out there that would be a perfect match for\nyou and you just need to know who they are and how you can attract them. This\ncourse serves a higher purpose than just finding love, it is about changing the\nmind-set of the world so that not just you but everybody will be able to know\nhow they can find true, lasting love.</p>\n\n\n\n\n\n<p><strong>Awesome Bonuses!</strong><br>For joining Relationship Alchemy you will also receive these two awesome bonuses! <br><strong>Bonus #1:</strong> The Attachment Style Quiz which will enable you to find your own attachment style.<br><strong>Bonus #2:</strong> Philosophers &amp; Presenters which will allow you find out which type you are. <br></p>\n\n\n\n\n\n<p><strong> Zero Risk </strong><br>There is a 30 day money back guarantee so you literally have no risk in taking this course. Seriously, the 30 refund is even automatic so there is no hassle on your end. If this course sounds like it is for you then give it a go. </p>\n\n\n\n\n\n<p><em> \"We can not solve our problems with the same level of thinking that created them” </em>- Albert Einstein</p>\n\n\n\n\n\n<p>I will see you inside if you are ready to finally find your perfect match!<br><strong>Ben</strong><br></p>", 
    "end_date": null, 
    "title": "Relationship Alchemy: Find & Attract Your Perfect Match", 
    "price": "25.00", 
    "instructors": "Benjamin Hero, Digi Strats", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495506_e8a1_5.jpg", 
    "course_url": "https://www.udemy.com/relationship-alchemy-love-dating-match-partner-couples-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-06T23:10:31Z"
}