{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t This course is a 25 minute distillation of all of the essential information from The 5 Love Languages by Dr Gary Chapman as well as our experiences (as a group of psychologists) about how to best put the skills into practice to revive your relationship. We really pride ourselves on how short this course is because we have taken out all the fluff and concentrated only on key information that is required for you to create changes in your love life.  </p>  <p style=\"\">  \t       This course is designed for people who don&#039;t have time to go through seven hours of video content on how to fix themselves and their partner. There are plenty of great courses for that already. This course is about 5 things that you can do that have already been tested and shown to help take your relationship from 20% or 40% full back to 100% full like when you were dating. Ok, maybe not like that, but at least to make some real improvements. How do we know this? Because all the strategies in this course are based on ones that have already been tested out by the decades of research put in by Dr. Gary Chapman, who is an expert in healthy and successful romantic relationships.  </p>  <p style=\"\">  \t       We are a group of psychologists in Australia who have a decent amount of experience in helping couples to resolve conflict and develop intimacy. We have had a lot of success in helping couples using The 5 Love Languages and this course is derived from our experiences of how to get the most out of the book and make the best possible changes in the shortest amount of time. We are in a hurry. No one should have to spend years in therapy to figure out what can take less than an hour a week to do.  </p>  <p style=\"\">  \t       This course is designed to be done at the rate of one module a week over 5 weeks. Have a look at the modules below. The first one is a bit longer but most of them are super quick. Each one focuses on a certain love language. A love language is basically the style of love that makes someone feel the most loved.  </p>  <p style=\"\">  \t       What Dr Chapman has found is that not everyone speaks the same love language. One person&#039;s love language might be words of affirmation, which is about telling your partner what you love about them or what they do. You might praise your partner all the time but still find that he or she doesn&#039;t really respond much. Their love language could be any of the other four. This course is about how to identify which love language he or she speaks by learning and then trying out one language per week over five weeks. It won&#039;t take you long and once you find the language that really let&#039;s your partner feel loved, you&#039;ll be set up for life.  </p>  <p style=\"\">  \t  _______________________________________________________________________  </p>  <p style=\"\">  \t  Note: This course represents the trainers&#039; experience with the The 5 Love Languages® methodology, and that they are not trained by, associated or affiliated with Gary Chapman.  </p>", 
    "end_date": null, 
    "title": "Revive Your Relationship in 10 Minutes a Week", 
    "price": "50.00", 
    "instructors": "Dr Jay Spence", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124820_521e_2.jpg", 
    "course_url": "https://www.udemy.com/revive-your-relationship-in-10-minutes-a-week/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-24T22:25:23Z"
}