{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Now you may be thinking, “Appreciating men?  No thanks, not at the moment!”  But I assure you, personal power and influence are the outcome, here!</p>\n\n<p>There is a big difference between finding a date and finding a life partner… and after you find him, knowing how to navigate conflict, build intimacy, and cheat-proof your bond.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You know how to make them listen in the boardroom… but what about at home?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Have you had trouble in your relationships with men?  Have you ever felt dismissed, disregarded, dis-empowered?  Do you feel frustrated because you can’t find, hold-on to and enjoy relationships?  AND did you know that your primary relationship affects your respect and your career path? And the divorce rate is now 58%.  I can show you how to impact the odds.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t     This program is about teaching you how to have a great relationship with a man.  Yet the results are far-reaching and can help women save marriages, climb the career ladder, be happier, healthier, and be more dynamic leaders.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t <strong>By becoming the Sassy Woman defined in this program… </strong>You immediately increase your happiness... You receive more understanding than ever before... You have healthy conflict which deepens your relationships… You have higher expectations met, and clearer boundaries respected… You have more support for your career, your life goals, your endeavors in the world.  </p>", 
    "end_date": null, 
    "title": "Sassy Woman's Guide to Appreciating Men", 
    "price": "50.00", 
    "instructors": "Gladys Marie Clancy", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/179028_63cf_5.jpg", 
    "course_url": "https://www.udemy.com/sassywomansguide/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-08T15:48:39Z"
}