{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><br></p><p><span style=\"\"><span style=\"\"><span style=\"\"><strong>START TODAY and get the RELATIONSHIP that YOU want even if you have been struggling for years to find your match.</strong></span></span></span></p><p><span style=\"\"><span style=\"\">Answer these questions to find out whether you need to learn the Level 4 Relationship Philosophy and apply it in your life...</span></span></p><p><span style=\"\"><span style=\"\"><em>Do you find that it's hard to understand whether someone is right for you?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Do you find that you are in and out of relationships and never really feel a strong connection with anyone you meet?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Are you unhappy in your current relationship or marriage and want to learn how to make your relationship spectacular?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Are you single and struggling to find the right person for you and to build an amazing relationship?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Have you ever been in a relationship where you felt that you couldn't be completely yourself?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Have you ever felt that some days you want to stay away from your partner in order to hang out with your friends?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Have you ever felt that you can't get full understanding and support regarding some parts of your life in your relationship?</em></span></span></p><p><span style=\"\"><span style=\"\"><em>Do you feel that you cannot talk to you partner about everything you do or desire to do in your life?</em></span></span></p><p><span style=\"\"><em><span style=\"\"><span style=\"\">If you answered “Yes\" to even 1 of these questions you would definitely benefit from learning and applying the Level 4 Relationship Philosophy in your life.</span></span></em></span></p><p><span style=\"\"><span style=\"\">It's OK, I understand.</span></span></p><p><span style=\"\"><span style=\"\">Relationships can often times be so difficult. And it's not your fault.</span></span></p><p><span style=\"\"><span style=\"\">We've all heard many statistics on relationships and why it's so hard to find the right person:</span></span></p><ul><li><span style=\"\"><span style=\"\">50% of all first marriages, 70% of second marriages, 90% of subsequent marriages will end up in divorce.</span></span></li><li><span style=\"\"><span style=\"\">Interestingly the numbers also show that only 80% of people who are married or separated, even believed to begin with, that marriage is supposed to be for life.</span></span></li><li><span style=\"\"><span style=\"\">The average life span of a live-in relationship is about three years.</span></span></li></ul><p><span style=\"\"><span style=\"\">It seems that much of the time, we are all very pessimistic about relationships that we are in or that we anticipate being in.</span></span></p><p><span style=\"\"><span style=\"\">Why is this? It's usually because of our past experiences or what we are learning from those around us.</span></span></p><p><span style=\"\"><span style=\"\"><strong>FIND YOUR PERFECT MATCH even if you've never been in successful </strong></span><span style=\"\"><strong>relationships before!</strong></span></span></p><p><span style=\"\"><span style=\"\">The good news is that ALL of this can be completely learned!! That is what the Level 4 Relationship Philosophy will teach you.</span></span></p><p><span style=\"\"><span style=\"\">The Level 4 Relationship Philosophy is the secret to finding the right person for you and creating an amazing relationship.</span></span></p><p><span style=\"\"><span style=\"\">I've shared this relationship philosophy with thousands of people really trying to solve their relationship problems. After every conversation the thing that I realized is even though every situation was very unique, 100% of people were able to tremendously benefit from applying the Level 4 Relationship Philosophy in their lives.</span></span></p><p><span style=\"\"><span style=\"\">For those that were in relationships, they would learn everything that it takes to determine whether they are with the right person and also how to then create the spectacular relationship they desire. Also for people that were single, they would completely understand what it takes to find the right person for them and to learn exactly why they were not able to do that in the past.</span></span></p><p><span style=\"\"><span style=\"\"><em>The Level 4 Relationship Philosophy will help you create an amazing relationship regardless of whether you want to get married or just want to create amazing dating relationships. This Philosophy works for any type of relationship, heterosexual, homosexual, polyamorous, etc. It works because it helps you examine yourself and exactly what you are looking for in a relationship. It's completely about what YOU want and helping you find someone who is perfect for you, and to help you build a spectacular relationship.</em></span></span></p><p><span style=\"\"><span style=\"\">It helps you understand whether you are with the right person for you and how you can find the right person and have an ideal relationship, how to become closest friends with your partner and keep this happiness for the rest of your life.</span></span></p><p><span style=\"\"><span style=\"\">You want to spend your life with the right person where you make each other happy every day, right?</span></span></p><p><span style=\"\"><span style=\"\">This will require deeper knowledge and skills that you have to learn and apply in your life and how you interact with potential partners so that you can reach relationship harmony.</span></span></p><p><span style=\"\"><span style=\"\">If knowing how to find the right person for you and to have an amazing relationship is important to you…</span></span></p><p><span style=\"\"><span style=\"\"><strong>Click the “Take this Course\" button and start learning the Level 4 relationship philosophy </strong></span><span style=\"\"><strong>NOW!</strong></span></span></p><ul><li><em>The comprehensive Level 4 Relationship Philosophy training program which covers everything you need to know about how to find the right person, understand whether you are with the right person and how to build an amazing relationship with that person</em></li></ul><ul><li><em>Includes 5 video modules covering the Level 4 Philosophy</em></li></ul><ul><li><em>5 Pre-worksheet Review Videos to help you further understand important concepts</em></li></ul><ul><li><em>5 worksheets to help you think about your current and prospective relationships and to integrate all the of the things that you learn into your life</em></li></ul><ul></ul>", 
    "end_date": null, 
    "title": "Secret to Meet your Match and have an Amazing Relationship!", 
    "price": "20.00", 
    "instructors": "MeetMeonLevelFour Relationship Training", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598012_3892.jpg", 
    "course_url": "https://www.udemy.com/meet-me-on-level-4/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T07:59:02Z"
}