{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Every year thousands of parents are considering Homeschooling for the first time</strong>. They admit they would like to be educated in detail before they make such an important decision. “I am unhappy with my child's current educational program and I think Homeschooling may be an option.\" Does this sound familiar? You are not alone.  </p>\n\n<p>Here's what students are saying about the course:</p>\n\n<p>\"This course is a great resource for planning, preparing, and beginning your home school journey. She gave so many tips that I would've never thought of on my own.\" -<em><strong>Katie C.</strong> </em></p>\n\n<p>\"We've been looking for a baseline of how to homeschool our struggling teenager, and this class has DEFINITELY gave us hope and understanding of what to expect. We were very impressed with how mom included her daughter to interact with the course.\" <em>-<strong>Nicky M. </strong></em></p>\n\n<p>-----------------------------------------------------------------------------------</p>\n\n<p>Welcome to: Secrets of a Homeschool Mom: Tips, Tools and Techniques</p>\n\n<p>Instructor E.B. Joseph is going to show you step by step the work that is involved in Homeschooling. This class covers: Very important first steps, homeschooling is not cheap, easy teaching approaches, ways to teach that stick, rough days and focus training. Her focus is on helping you gain insight and a clear picture especially for elementary and middle school children in the United States.<strong> </strong>She has been a Homeschool Mom for three years of an elementary age child in the United States.</p>\n\n<p>She admits the scariest part of being a Homeschool parent is not what curriculum to purchase but how to step into the role of a teacher. She and her daughter will demonstrate the teaching methods which helped to increase test scores by 50%. Her motto is “Homeschooling is not work, it's an adventure.\" This self-paced class is taught with video animation and demonstrations.</p>\n\n<p><strong>Enroll Today! To start learning Tips, Tools and Techniques</strong></p>\n\n<p>Course Updated: June 2016</p>", 
    "end_date": null, 
    "title": "Secrets of a Homeschool Mom: Tips, Tools and Techniques", 
    "price": "20.00", 
    "instructors": "Ericka Bellamy Joseph", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/391140_2f53_4.jpg", 
    "course_url": "https://www.udemy.com/plan2win_homeschool/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-11T13:42:44Z"
}