{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      This course covers both male and female sex ED.  </p>  <p>  \t<strong style=\"\">How long will it take to complete this course?</strong>  </p>  <p>  \t              55 minutes of lectures and hours of activities and journal writings.<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\">What is this course about?</strong>  </p>  <p>  \t                 In this course your child will 1) become aware of one&#039;s positive qualities; 2) identify things about  oneself that can be changed; 3) identify potential work skills and  strengths, 4) understand the meaning of values; 5) identify personal, family,  religious, and cultural values; 6) explore where values come from; 7)  discover which values are most important personally; 8) examine the  relationship between values and behavior; 9) practice communicating  values to others; 10) practice accepting the values of others, 11) learn which behaviors can enhance or destroy a relationship; 12)  understand the nature of family relationships and what influences them;  13) identify qualities that develop and define friendship and romantic  relationships; 14) define sexuality as more than genital sexual activity; 15) learn what  human sexuality is and how it affects our behavior; 16) become more  comfortable talking and asking questions about sexuality; 17) review how  male and female bodies develop and change during puberty; 18) discuss how  feelings and relationships change during sexual development; 19) review  how human reproduction occurs; 20) review and dispel myths about sexual  activity and reproduction; 21) learn how to care for sexual and  reproductive organs;22) learn about sexual orientation, 23) learn what stereotypes, prejudice, and discrimination mean; 24)  examine stereotypes about gender and learn how stereotyping affects  relationships; 25) learn about, meet, and develop empathy for a variety of people; 26) identify sexual behaviors that put one at risk for pregnancy and  sexually transmitted diseases, including HIV/AIDS; 27) correct  misinformation about unprotected sexual intercourse and its  consequences; 28) learn basic facts about STD/HIV infection; 29) identify  contraceptive methods that reduce the risk of pregnancy and STD/HIV  infection; and 30) develop increased understanding of and compassion for  people with AIDS.  </p>  <p>  \t<strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Sex Education For Teens and Parents", 
    "price": "20.00", 
    "instructors": "Mrs. Cherokee Rainbow Lewis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/269358_2e22_5.jpg", 
    "course_url": "https://www.udemy.com/sex-ed-for-teens/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-27T03:22:51Z"
}