{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t         Hace más de veinte años que trabajo como psicólogo y una de las áreas en las que me formé es la de <em style=\"\">Sexualidad</em>. En mi recorrido me ha tocado trabajar en Salud púbica, y en docencia de Post Grado y he podido apreciar la poca información disponible que hay cuando se trata de hablar de sexo, género y sexualidad. Quizás por ser temas de la vida cotidiana, muchos crean que los comprenden porque &quot;asumen&quot; que es como ellos lo viven/sienten; pero basta profundizar un poco para darse cuenta de que a veces confundimos las propias experiencias, los mitos y las suposiciones con el conocimiento.  </p>  <p>  \t         En este curso veremos estos conceptos en profundidad, aprenderemos a diferenciar unos de otros y a comprender las diferencias entre sexo, género, orientación sexual, identidad de género, y otros términos que definen las diversas identidades.  </p>  <p>  \t         Se trata de un <strong style=\"\">Curso introductorio-Intermedio </strong>ya que no se trabajarán casos clínicos y cuyo objetivo es nada más (y nada menos) que proveer información y facilitar la reflexión. Iremos profundamente a los conceptos a fin de que puedan quedar claros.  </p>  <p>  \t         Se trata de diez clases que el alumno podrá ir haciendo a su tiempo, ya que <strong style=\"\">son muchos conceptos nuevos</strong>, y no es recomendable hacer el curso completo de una sola vez pues perderán mucha información.  </p>  <p>  \t        Con más de dos horas de material de curso y links a otras dos horas de material complementario. PDF que podrán bajar para continuar mirándolo aún sin conexión.  </p>  <p>  \t<strong style=\"\"></strong>  </p>  <p>  \t<strong style=\"\"> <strong style=\"\">Contenidos</strong></strong>  </p>  <ol style=\"\">  \t<li><strong style=\"\">Sexo</strong>; (dos clases) (sexo genetico, hormonal, gonadal, anatomico, fenotipico, de asignación, legal, de crianza).</li>  \t<li><strong style=\"\">Género;</strong> (dos clases) Características del mismo, relación con el sexo.</li>  \t<li><strong style=\"\">Sistema Sexo - Género:</strong> Cracterísticas, alcances en la cultura, lenguaje, androcentrismo, patriarcado, relaciones, opresión de género.</li>  \t<li><strong style=\"\">Rol de género:</strong> Relación del género con la cultura, categorías de género, invisibilización.</li>  \t<li><strong style=\"\">Identidad de género:</strong> Cisgeneridad. Transgeneridad. Tipos de transgéneros; travestis transexuales. Confusiones frecuentes. Crossdressers; transformistas; Drag queens, androginia.</li>  \t<li><strong style=\"\">Orientación sexual: </strong>Sexualidades: Heterosexualidad, homosexualidad, gays, lesbianas, bisexualidad, asexualidad, pansexualidad.</li>  \t<li><strong style=\"\">Sexualidad</strong>: Qué abarca; seducción, erotismo, genitalidad, el sexo, el género y sexualidad, los afectos: la relación con el otro, la intimidad.</li>  </ol>", 
    "end_date": null, 
    "title": "Sexo, Género y Sexualidad", 
    "price": "20.00", 
    "instructors": "Guillermo Leone", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211720_1e12_3.jpg", 
    "course_url": "https://www.udemy.com/sexo-genero-y-sexualidad/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-06T16:55:30Z"
}