{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Are you a single woman that is struggling to attract the right man into your life?</li><li>Do you feel like you have lots to offer but keep having unsuccessful relationship with the wrong guy?</li><li>Do you struggle to get a guy to commit?</li><li>Are you sick and tired of feeling lonely and unsuccessful in love?</li></ul><p><strong>If you say YES to any of the above, we invite you to explore &amp; get involved in our REAL, RAW, AUTHENTIC conversations in this course - which teaches the modern women how to attract the MAN that they truly deserve.</strong><strong></strong></p><p>What we commonly see is the pool of beautiful, amazing and successful women struggling to attract a man that can love, accept and support them to be all that they can be, to have the love and passion they truly deserve. </p><p>Hi my name is Jane Nguyen, Author, Speaker &amp; Dating Coach &amp; Relationship Mentor from Honeymoon Forever.<br></p><p>Hi my name is Melina Macdonald, Intimate Product &amp; Lifestyle Educator from Taboo Intimacy &amp; Love Indulgence.</p><p>With us is our guest speaker - Patty-Ann Waho, Sexuality &amp; Sensuality Expert from Inner Sparks System</p><p>We are here today to share with you our amazing program called <strong>\"The Ultimate Dating Guide For The Modern Women\"</strong></p><p>Our program <strong>\"The Ultimate Dating Guide For The Modern Women\"</strong> is designed to give you lots of great insights into successful dating. </p><p>Some of the hot topics that we cover include:<br></p><ul><li>The types of guys to date &amp; those to avoid</li><li>Why do you attract bad boys and unsuccessful relationship?</li><li>Attraction strategies for instant and deep connection</li><li>How to let go of your ex and past emotional baggage</li><li>Dressing tips for dating success</li></ul><p>And much more…</p><p>What also makes the program unique and different is that these are simple, easy to apply strategies that WORK!!! <br></p><p>We have combined our experience &amp; expertise to share with you the best that we have learned over the years to figure our the codes to successful dating.</p><p>We have done the leg work for you…sharing with you only those we have tested &amp; applied in our lives and from our clients that we have worked with.<br></p><p>This program allows you to do it in the comfort of your own home, when it fits you &amp; your schedule.</p><p><strong>Partnered with 100% Money Back Guarantee, join Melina, Jane and Patty in learning how to attract the right guy in less than 21 days!</strong></p>", 
    "end_date": null, 
    "title": "Single ladies - How to attract the man you truly desire", 
    "price": "50.00", 
    "instructors": "Melina & Jane .", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/673124_bc6b_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-attract-your-true-love-in-less-than-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-18T09:20:08Z"
}