{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Half the proceeds of course sales are donated to the Charity Stand Against Violence.</strong><br style=\"\">  \t<br style=\"\">  \t      Teachers, Parents, Teens and Young Adults need to know the facts about street violence.<strong style=\"\"> Ideal for PSHE lessons.</strong>  </p>  <p>  \t<strong style=\"\">Contains graphic images of a violent attack. </strong>  </p>  <p>  \t                                The media focus on knives and guns but the research proves that:<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">  85% of injuries come from punches, kicks and head-butts.<br style=\"\">  \t                                        50% of incidents occur within 50 metres of licensed premises.<br style=\"\">  \t                                        Victims are selected on weakness in their body language.</strong><br style=\"\">  </p>  <p>  \t                                      In this course you will learn how to:  </p>  <p>  \t                                                            - <strong style=\"\">protect against head injury<br style=\"\">  \t                                                            - project a confident profile on the street<br style=\"\">  \t                                                            - talk about how alcohol changes some people</strong>  </p>  <p>  \t                                      We back up all our material with research from experts including the University of Wales, Harvard Medical School, the Mayo Clinic, the Sorensen Self-Esteem Test and the self defence skills of a leading martial artist.  </p>  <p>  \t                              We also take a look at dealing with knives and assault on females (which usually takes place at home and by friends) but these skills do require expert assistance.<br style=\"\">  \t<br style=\"\">  \t                                      This course will give you <strong style=\"\">peace of mind</strong> knowing you did your best to keep <strong style=\"\">informed and safe.   The course summary is FREE to view.</strong>  </p>", 
    "end_date": null, 
    "title": "Stand Against Violence - Street Safety for Young Adults.", 
    "price": 0, 
    "instructors": "Peter Urey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/302192_66d8_13.jpg", 
    "course_url": "https://www.udemy.com/street-safety-for-parents-of-teens-young-adults/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-17T16:29:27Z"
}