{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course will teach you how to overcome the chaotic morning routine that many parents experience with pre-school and school age children.  You will learn ways to engage your children so that everyone leaves the house feeling happy and connected.</p><p style=\"\"><strong>Learn the skills needed to accomplish all you need to do during busy mornings while still maintaining a joyful connection with your child!</strong></p><ul><li>Incorporate brain science into your connections with your child resulting in more compliance and connection with you</li><li>Learn how attachment with your child can be maintained even during the frenzied pace of getting ready for work and school</li><li>Learn how vital attunement is to the emotional wellbeing of your children</li><li>Learn how valuable a manageable routine is for getting everyone out the door in a timely and contented manner</li><li>Learn practical strategies for designing a simple morning routine that works for parents and children</li></ul><p style=\"\"><strong>Develop</strong> <strong>a Superparent perspective that helps you overcome developmental obstacles that look like non-compliance in your children when you are pressured for time!</strong></p><p style=\"\">Mornings can be challenging times for busy parents who are attempting to get everyone ready and out the door in a timely fashion.  Happily, there are amazing brain research outcomes that provide clues about how to be true superparents. Not just getting great outcomes in our children (skill development), but also fantastic in-comes—a sense of connection, belonging, calm and resiliency.  A manageable place to start being a super-parent is during the morning routine.  Learn to avoid the crazy and chaotic, so that you and your children don't leave the house irritated, angry and disconnected from each other.  </p><p style=\"\"> Mornings in our modern, Western world tend to be harried. If you are working set of parents, a single working parent, or a parent who may not have a paid job but still need kids out the door in a timely manner, you understand the challenge! </p><p style=\"\"> The most basic need for children is nurture.  Nurture is rooted in attachment, belonging, love, connection and affection.  I noticed in my own life that when I was more focused on tasks (like getting myself ready for work and my kids set for school), the concept of nurture escaped my reality.  However, when I incorporated concepts from brain science into our morning routine we were able to accomplish more faster, without the behavioral challenges and relational disruption.</p><p style=\"\"> Once I experienced the amazing in-come of intentional nurture with my children, I became a true believer and practitioner of a new way of superparenting. I started digging into the literature on brain development in children.  I uncovered how nurturing <em>relationship</em> has an unparalleled positive impact on regulating the nervous system and bringing harmony, compliance and deep abiding connection. This resulted in joy, peace and contentment—a great way to send my kids off to school. </p><p style=\"\">As a licensed helping professional I began teaching these concepts to teachers, counselors, social workers and other helpers.  Those who used these concepts found an exciting new path for addressing common adult-child challenges that look like non-compliance.  By re-framing acting-out behaviors from a brain science perspective, interventions changed and so did relationships.</p><p style=\"\">In this course you will learn what brain science teaches us about strategies that address common childhood behavior. Up-to-date literature will be discussed in order to root this course in solid practice.  Rather than seeing everything from an old-school behaviorist lens that often disrupts relationships, you will learn to use strategies that build attachment, help you reach your goal of getting out the door on time and feel good about your relationship with your child.</p><p style=\"\">This course will include video lecture format, PDF handouts, information slides and quizzes in order to relay and cement concpepts about attachment, attunement, and positive parent-child connection.  You will learn how to build a manageable morning routine that results in everyone feeling good about their relationship while still accomplishing required tasks before leaving for the day.  While these strategies are taught with the morning routine in mind, they can be used throughout the parent-child relationship and throughout the day.</p>", 
    "end_date": null, 
    "title": "Superparent 101: Mastering the Morning Routine", 
    "price": "20.00", 
    "instructors": "Coralee Nelson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/567854_2b68_3.jpg", 
    "course_url": "https://www.udemy.com/superparent-101-mastering-the-morning-routine/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-29T00:59:44Z"
}