{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Help your child develop strong reading and writing skills. <em>Teach Your Child to Read and Write </em><em></em>includes over 20 video lessons covering all aspects of early literacy. You will learn:</p><ul><li>What your child is expected to learn at school.</li><li>How these skills and concepts will impact your child's future academic success.</li><li>Simple and fun ways to support your child's learning at home.</li></ul><p><strong>Help your child become a great reader and writer.</strong></p><p>Many parents think teaching the alphabet, reading bedtime stories and providing their child with opportunities to read is enough to ensure their child becomes a great reader and writer. There is so much more you need to do! After taking this class, you will know how to help your young child build a foundation for success.</p><p>Helping your children at home is critical. More than 40 years of research has proven that the most accurate predictor of a child's achievement in school is not income, the quality of the school they attend, social status or even teacher quality. It is how much family's support learning at home, set realistic and high expectations, and become involved at school and in the community.</p><p>After taking this class you will be able to help your child:</p><ul><li>Build a strong foundation of literacy skills.</li><li>Begin to learn the writing process.</li><li>Develop a love or reading.</li></ul><p>Your instructor for this class is National Board Certified Teacher and Bluegrass Learning Senior Education Specialist Bobbie Noall. Bobbie has more than 15 years of classroom teaching experience and currently works full-time as a district response to intervention teacher for a public school district, specializing in literacy support for struggling students.</p><p>The class is presented using parent friendly language, without difficult technical terms. It is designed for busy parents and is also beneficial for anyone who spends time with early elementary school age children. Childcare workers and teachers who may want a refresher on effective literacy instruction would also benefit from the lessons.</p>", 
    "end_date": null, 
    "title": "Teach your Child to Read and Write", 
    "price": "25.00", 
    "instructors": "Bluegrass Learning Services", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529548_f7fa_2.jpg", 
    "course_url": "https://www.udemy.com/teach-your-child-to-read-and-write/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T15:04:02Z"
}