{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>There are basic concepts to raising a child that every parent should understand, yet few actually do. This course captures these hidden basic concepts and teaches you how to think with them so you can build a very special relationship with your child.</p><p>If you don&#039;t understand these basics your influence with your child will decrease and the other influences in society become more prominent. Why do so many children end up having such troubled lives? Look around at the influences that will pull your child one way or another. You can show your child a better way to live by the quality of your relationship that you learn how to create in this course.</p><p>You will find this a life changing experience. Once you have mastered these basic concepts you will become a master artist of parenting. If you find this course doesn&#039;t change not only your life but the life of your children, simply ask for a full refund – no questions asked. There is probably nothing in your life more important than successfully raising your children to be the individuals you hope and dream they will become. Here is that special knowledge that you need to create that relationship?</p><p>Bernard Percy has flown over two million miles internationally delivering courses like this. He has authored or co-authored 8 books on parenting and education and he and his wife raised three daughters who are their masterpieces.</p><p>When you are done you will wonder how any parent can operate without this knowledge that opens the door to a better home and life for parents and their children. Normally this course is $199 for this internationally recognized parenting enlightener. For a limited time we have made it $29. This price changes on July 1 2015 at 3 PM PST.</p>", 
    "end_date": null, 
    "title": "Ten Lessons Every Parent Must Know to Avoid Disaster", 
    "price": "20.00", 
    "instructors": "Bernard Percy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/486974_3d6f_2.jpg", 
    "course_url": "https://www.udemy.com/bring-out-the-best-in-your-child/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-26T20:41:59Z"
}