{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>This course is for:</strong></p><ul><li>shy or under-confident individuals who want to drastically improve their skills of social interaction,</li><li><span></span>introverts who are keen to improve their people skills and learn how to be totally memorable,</li><li>already sociable individuals who want to learn how to be utterly magnetic.</li></ul><strong>By the end of this course, you'll be able to: </strong><ul><li>Interact socially in a very highly confident manner,</li><li>Increase your confidence and self-esteem in leaps and bounds,</li><li>Magnetically attract the people you want into your life,</li><li>Create the most incredible rapport with others using special body language techniques,</li><li>Practise the secrets of highly charismatic people that will enable you to be the most memorable person in the room,</li><li>Make the best first impressions possible!</li></ul><strong>What will I get from this course?</strong>  <ul><li>21 videos and audio lectures, cheat sheets, magnetic tips and over 3 hours of content.</li><li>The expertise of a teacher and life coach with over 21 years experience in social interaction, group leadership and client transformation.</li><li>Quick and easy techniques to practice and implement straight away that will give you amazing confidence and ultimate rapport with others. </li></ul><strong>What are the course requirements?   </strong><strong></strong><ul><li>An Intermediate level of English</li><li>A keenness to connect with the right kind of people and revolutionise your social interactions!</li></ul><strong></strong>", 
    "end_date": null, 
    "title": "The Art of Social Magnetism", 
    "price": "50.00", 
    "instructors": "Angie Campbell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/539342_4130_2.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-social-magnetism/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-28T16:47:19Z"
}