{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Men, do you <strong>wonder what to do</strong> after a break up? Do you feel like the world has ended and there is no hope? Do you see no hope for the future? Doe <strong>your heart </strong>tell you there's no point trying any more?</p><p>We are here to tell you <strong>the world has not come to an end.</strong></p><p>This is one of the most difficult times any man ever faces. There’s this misconception that only a woman's heart breaks after a breakup, while the man continues without even shedding one tear. But <strong>men are human</strong>, too. We deal with our emotions in different ways from women, but this doesn’t mean we’re not devastated after a breakup. Men are good at covering up their feelings. Hiding in a cave. Isolating themselves. Men don’t want the world to know about how seriously heartbroken they feel.<span></span></p><p>So, if your emotions are all over the place,  understand that's normal! It's perfectly understandable if you are angry, sad, depressed, disappointed,<span> anxious and constantly swing between all these strong emotions. <br></span></p><p>There is a process everyone goes through when a relationship ends. Yes, some people <strong>go through it quicker and easier</strong> than others. </p><p>But if you don't go through the healing process, if you insist on carrying your scars from one failed relationship to the next, you will never <strong>fulfill your mission in life.</strong></p><p>In this deep, heart-centered course, Serge and Scott walk beside you. <strong>You are not alone</strong>. No matter how much it can feel that way. When you look around, they are there to support you, to listen to you, to <strong>assist you through the healing process.</strong></p><p>In this course, you will:</p><ul><li><strong>Learn about the grieving process and how to use it to heal your heart</strong></li><li>Discover the most common self-destructive behaviors</li><li><strong>Learn how to cope with those behaviors</strong></li><li>Become more self-aware</li><li><strong>Learn</strong><strong> to get back on track</strong></li><li>And most importantly, how to find love again.</li></ul><p>Full of insights and practical exercises, <strong>The Men's Break Up Recovery Course</strong><span> will speed you on your way to a more fulfilling relationship with yourself and the future woman of your dreams.</span></p><p><strong>Join us today. Enroll now!</strong></p>", 
    "end_date": null, 
    "title": "The Men's Break Up Recovery Course ", 
    "price": "20.00", 
    "instructors": "Serge Lenbet, Scott Paton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589208_c565_3.jpg", 
    "course_url": "https://www.udemy.com/mensbreakupcoach/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T08:02:34Z"
}