{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The Dad's Edge is dedicated to the \"Everyday Dad.\"  This course is specifically for Dads (or Moms) who ultimately want to be the best version of themselves.  The Journey of \"Dadhood\" can be extremely rewarding.  However, it can be humbling and daunting.</p><p style=\"\"><strong>Within 40 minutes The Dad's Edge will help you:</strong></p><ol><li> Discover Unlimited Patience (Even on your worst day)</li><li> Uncover your Personal Mission, Core values, and Legacy</li><li> Learn 3 Simple and Fundamental Ways to Connect with your Kids</li><li> Uncover 3 Easy Ways to Connect with your Spouse (Even with a Busy Schedule)</li><li> Discover 2 Obvious Ways to Improve Relationships Outside of the Immediate Family</li><li>Obtain Ultimate Work/Life Balance No Matter How Busy You Are</li><li> Make your \"Dad Journey\" unforgettable</li></ol><div><br></div><div><strong>FREE BONUSES!</strong></div><p style=\"\">1.  <strong>\"The Dad Edge\" has a 30-Day Money Back Guarantee</strong>.  So, if you feel it didn't help, by all means let me know and you will get a full refund.</p><p style=\"\">2.  I've included a guide so you can follow along if you want to take notes.  Some Dads are not takers and some aren't.  However, it is there if you like.</p><p style=\"\">3.  You are a busy Dad on the Go!  So, <strong>I have included all the audio MP3 files so you can download them for free to any mobile device and listen on the go!  </strong></p><p style=\"\">From One Dad to Another,</p><p style=\"\">Thank you!</p><p style=\"\">Larry Hagner</p><p style=\"\">Speaker, Author, and Coach</p>", 
    "end_date": null, 
    "title": "The Dad Edge:  6 Strategies to Empower your Journey", 
    "price": "20.00", 
    "instructors": "Larry Hagner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/534410_454f_3.jpg", 
    "course_url": "https://www.udemy.com/the-dads-edge-6-critical-strategies-for-empowering-dads/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-22T19:16:46Z"
}