{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tIn this course we will discuss many techniques that can be used to develop stronger, more intimate and fulfilling relationships. Each technique is based heavily on either scientifically proven methods or strategies that have been wildly successful in practise.  </p>  <p style=\"\">  \tYou don&#039;t need to know anything specific to begin, all key terms and concepts are explained clearly and simply so you can focus your energy on implementing the skills into your relationship and enjoying the results.  </p>  <p style=\"\">  \tIt is a mix of video tutorials and written resources that will explain in depth each idea and the practical steps required to implement them, including activities as well as informational content. You will also have access to the community of like minded individuals seeking to improve their relationship and unlimited email communication with Belle, the instructor.  </p>  <p style=\"\">  \tThe course is self paced and you may progress through it in any order, although it is ordered in a practical way to allow a natural progression of skills. There are distinct sections addressing key areas of relationship turmoil, so you can skip to the sections most relevant to you at any time.  </p>  <p style=\"\">  \tWe look forward to assisting you to develop the skills and knowledge that will take your relationship from where it is (anywhere from terrible to good) all the way to endless romance, deep love and real belonging.  </p>", 
    "end_date": null, 
    "title": "The Science of Lasting Love", 
    "price": "20.00", 
    "instructors": "Belle Chinchen", 
    "commitment": "15 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396262_2b8e.jpg", 
    "course_url": "https://www.udemy.com/the-science-of-love/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-17T03:10:48Z"
}