{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>“I don’t feel you love me”</p><p>“You’re always too tired to...”</p><p>“Look at us, 2 strangers in a house”</p><p>“You don’t care about me”</p><p>“You’re always busy”</p><p>“You always leave the dirty dishes in the sink!”</p><p>“I’m not attractive anymore”</p><p>“You never have time for me!”</p><p>“There’s so much distance between us”</p><p>Do these words seem familiar? Maybe they’ve been said to you, or exchanged between people around you .. or maybe... even said out loud... by you?? Whatever the case, fast bind, fast find, don’t you agree? So why not avoid the scenario entirely? Stay with me to find out how ;)</p><p>The journey you’re about to embark on is filled with great treasures and a few traps. Be an explorer and learn how to speak the languages of love and improve the relationship with your spouse.</p><p>Why should you become a student?</p><ul><li>to <strong>learn the 5 dialects people express love through</strong> from practical stories and real world scenarios</li><li>.. that will help you improve (and even repair) your relationships</li><li>to <strong>learn</strong> <strong>why people act the way they do</strong> in order to be a better partner, leader, employee and even sales rep (yes, you’ll find this course to be applicable in other fields of communication)</li><li>to <strong>understand your spouse at a deep level</strong>, what he/she wants from you, how he/she thinks and</li><li>… how to use that knowledge to <strong>build a meaningful relationship</strong> that lasts a lifetime</li></ul><p><strong>More about the trainer</strong><br></p><p>Hi, my name is Bogdan Vaida and my mission for the duration of this course is to provide you with a <strong>unique perspective into relationships and how human beings interact</strong>. I’m going to offer you an insight into how love is expressed in different and wonderful ways and also warn you of the <strong>danger of not understanding how you are being loved by your partner</strong>. And we’ll build that insight into a powerful flame that will enlighten you into the dynamic field of human interaction.</p><p>I’m an experiential trainer with a long history in online education. My motto is: “<em>I teach students how to become their own teachers!</em>” and I live by it. In my courses, I create the conditions for students to learn by themselves. With over 6000 satisfied students and hundreds of 5-star reviews, I believe that you can get more from this course than from any other online.</p><p>And I truly believe that by better understanding yourself and others you can increase the quality of your life and experience it in a more fulfilling way.</p><p><strong>After going through this course you will look at the world in a totally different light</strong></p><p>This course contains an extremely rich, detailed and comprehensive content that catches your attention for more than one hour and keeps you watching thanks to its interactive format and weekly assignments for each typology. And that's not all! The course comes with an all-encompassing workbook, so that you will have everything you need and truly BE empowered in unlocking the 5 dialects of love.</p><p>Become a better you.. a super you!</p><p>.. by gaining deep insight into how and why you and your peers think, feel and act in romantic situations.</p><p>You can have a closer, more connected, more intimate and passionate relationship if you'll just open yourself to some new ideas. Start learning today, before the course’s price increases and I’ll see you on the other side.</p><p><strong>WARNING:</strong> Don’t lose this opportunity! This course covers diverse areas such as <strong>leadership, employment, sales, social skills, persuasion and self-knowledge</strong>.</p><p>\n\n\n\n\n\n\n\n\n\n\n<br><strong>PS:</strong> To fully benefit from the course you must practice the assignments in the second part of the material. Only after going through this part of the content,  will you fully realize the benefits of the course and the reason why it was delivered the way it was.<br></p>", 
    "end_date": null, 
    "title": "The Languages of Love", 
    "price": "20.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661346_5107_5.jpg", 
    "course_url": "https://www.udemy.com/the-5-love-languages/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T18:35:26Z"
}