{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">The Baby Sleep Solution will quickly teach you the techniques you need to be able to help your baby to sleep through the night every night.</strong><br style=\"\">  \t<br style=\"\">  \t            Unlike a baby sleep book that will take hours to read several hundred pages, the Baby Sleep Solution will only take you <strong style=\"\">35 minutes</strong> to watch, and you can even do this while you feed your baby.<br style=\"\">  \t<br style=\"\">  \t            Also, most baby sleep books provide only one method to solve baby sleep problems... But of course, no two babies are exactly the same. No two babies suffer from the exact same sleep problem and what works for one... may not work for another.<br style=\"\">  \t<br style=\"\">  \t            Therefore, in the Baby Sleep Solution, you are provided with 23 Techniques to determine which one works best for your baby&#039;s sleep discomforts.<br style=\"\">  \t<br style=\"\">  \t            There are 18 Quick Baby Sleep Training Techniques - many of which you could easily put into action today and which have the potential to solve your baby&#039;s sleep problem within days, often the very same night. <strong style=\"\">Many parents have found that just a few of the quick techniques have been all they&#039;ve needed to get their baby sleeping through the night.</strong><br style=\"\">  \t<br style=\"\">  \t            However, there are also 5 Major Techniques provided - where any one of them can be the solution to your baby&#039;s sleep problems.<br style=\"\">  \t<br style=\"\">  \t            The Baby Sleep Solution will help you with... Newborn sleep problems, baby sleeping issues, toddler sleep training and more...<br style=\"\">  </p>  <p style=\"\">  \t  Emails from happy parents who have used The Baby Sleep Solution...  </p>  <p style=\"\">  \t  “<em style=\"\">It took our daughter one night to learn that she could settle herself to sleep after the usual routine. It took a little longer for her to get used to not having a feed at night, but she was sleeping through by the third night. Bliss! (Although she sometimes still wakes up in the small hours and sings and babbles to herself she no longer cries for a feed.) Thank you so much!</em>”<br style=\"\">  \t<em style=\"\">With best wishes,<br style=\"\">  \t  Jo</em><br style=\"\">  \t<br style=\"\">  \t  “<em style=\"\">Chris, I am astonished at how quickly and easily your tips on good sleep have worked. After just one week of implementing a new routine by myself and my partner, our 9 mth old daughter, Francesca now goes directly to sleep after her 6pm bath and bottle and is not waking until 5.30am for her morning bottle.<br style=\"\">  \t<br style=\"\">  \t  Prior to following your suggestions, she was not going to bed until 9pm, waking again at approx 2am and would not go back to sleep without a couple of ounces of milk and then after we had to wake her in the morning to get her ready for nursery she often refused her morning bottle.<br style=\"\">  \t<br style=\"\">  \t  Thankyou for helping us, Francesca has been a true delight since she was born, and your help has put the icing on the cake.”<br style=\"\">  \t<br style=\"\">  \t  Kindest Regards,<br style=\"\">  \t  Liz</em>  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">BONUS: Does your baby wake up in the night and can&#039;t (or won&#039;t) go back to sleep?</strong>  If so, then you&#039;ll love this extra 12 minutes of audio that is added to  this 2014 update of The Baby Sleep Solution. It gives you the specific  techniques you need to quickly train your baby to go back to sleep on  his or her own, without crying and without waking you!  </p>  <p style=\"\">  </p>", 
    "end_date": null, 
    "title": "The Baby Sleep Solution - The Fast Answer for Tired Parents", 
    "price": "20.00", 
    "instructors": "Chris Towland", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/291136_bf49_3.jpg", 
    "course_url": "https://www.udemy.com/baby-sleep-solution/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-31T11:59:37Z"
}