{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The <strong style=\"\">Ultimate Relationship Resolution program</strong> is comprised of five audios that will give you the tools on how to work through the most pressing issues that couples face-<em style=\"\">communication, anger, money, physical and emotional intimacy. </em>Each audio is 30-45 minutes and includes a visualization, psycho-education, tips, techniques, effective strategies and exercises to learn how to work though five of the most common issues that plague couples. The course will take you approximately 3 hours to complete. You will also receive home work assignments that will take time as you grow more aware and gain insights into yourself and your partner. You will learn how to communicate more effectively, manage your anger, resolve money conflicts and have breakthroughs in physical and emotional intimacy with your partner. </p><p style=\"\">It is the cliffs notes version of every relationship book and seminar rolled into one quick-start program that will restore intimacy, strengthen your bond, and help you live a happy, fulfilling life together.</p><p style=\"\">From the comfort of your home, car or out exercising, you can use the program to make immediate and positive changes in your relationship. Through this self- help program you learn how to effectively manage and navigate the five most common issues that arise in relationships: <em style=\"\">communication, anger, money, physical and emotional intimacy</em>. <em style=\"\">These issues are at the core of every unhappy relationship.</em></p><p style=\"\"><strong style=\"\">How the Program works:</strong> You will instantly receive access to 5 digital audios and visual downloads. The program includes both audio and video powerpoint so you can listen and follow the information at the same time. You will also receive bonus question and answer video&#039;s at the end of every audio.  <em style=\"\"><strong style=\"\">Listen, learn and transform your relationship.</strong></em></p><p style=\"\"><em style=\"\"><strong style=\"\"></strong></em><strong style=\"\">The digital audios and visual downloads include:</strong></p><p style=\"\"><em style=\"\">AUDIO #1 - <strong style=\"\">Strategies on Communicating Effectively with your Partner</strong><strong style=\"\">Learn 4 proven techniques to build a solid communication foundation with your partner.</strong>When you process these techniques you will feel closer to your partner, prevent arguments, feel validated and confident that you can work through every day stressors. Greater closeness to your partner transforms your relationship into friendship creating a true partner to walk through life together.</em></p><p style=\"\">AUDIO #2 - <strong style=\"\">Strategies to Resolve Money Conflicts with your Partner</strong><strong style=\"\">Overcome your and your partner&#039;s money issues to create financial harmony and security.</strong>When you work through financial tension you can develop the trust need to feel safe and more secure with your partner. Through understanding, and acceptance of your partner&#039;s different spending style and habits, you can communicate better in order to make financial decisions together.</p><p style=\"\">AUDIO #3 - <strong style=\"\">Strategies in Managing Anger in your Relationship</strong><strong style=\"\">Eliminate angry outbursts in your relationship and manage conflict through in a productive and relaxed manner.</strong>Instead of having heated arguments, you could find win-win solutions that could bring out the best in both of you. You could have calm discussions about your problems and concerns and then come to successful compromises. You can talk through issues as you develop empathy with your partner and are able to hear and validate each other&#039;s point of view. As a result, you and your partner can overcome the hurt and pain that can be associated with anger and create a path for healthy communication.</p><p style=\"\">AUDIO #4 - <strong style=\"\">Breakthroughs in Physical Intimacy in your Relationship</strong><strong style=\"\">Rekindle the romance and deepen intimacy in your relationship.</strong>When you and your partner are able to revive physical intimacy, you can enjoy the passion and affection that builds the most loving relationships. Your needs will be met as you learn how to respond to your partner&#039;s needs as well. You will learn how to nurture the physical part of your relationship. Imagine yourself being physically intimate and feeling more connected and satisfied with your partner. This will help to deepen your bond allowing you to better work through life challenges together.</p><p style=\"\">AUDIO #5 - <strong style=\"\">Develop Emotional Intimacy in Your Relationship</strong><strong style=\"\">Achieve the rich fulfilling experience of emotional intimacy and create an enduring bond.</strong>You will develop strategies and achieve breakthroughs in supporting one another. By offering support and showing that you care, you and your partner will learn how to understand your differences and be able to satisfy each other&#039;s deepest emotional needs. This makes it possible for you and your partner to resolve past issues through better communication, which will allow more appreciation and in many cases romantic love returns to the relationship.</p><p style=\"\"><strong style=\"\">This Program is Unique</strong></p><p style=\"\"><strong style=\"\"></strong>The Ultimate Relationship Resolution Program is unlike millions of books and relationship programs and doesn&#039;t only focus on one strategy or give a general overview of problems. In this program, we delve into specific issues that plague relationships, and provide step-by-step actions and relationship advice you can use right away to work through your problems and open the path to love &amp; happiness.</p><p style=\"\">As a licensed professional with over 18 years of experience working with couples in the most difficult situations, I know how to guide you to create the relationship you desire.</p><p style=\"\">Most programs cover theory while neglecting to provide practical strategies on how to improve your relationship. I give you practical tools and applicable advice that you can put into action right away with your partner. The program is user friendly, with clear cut strategies that can work immediately in your relationship. Backed up by relationship research from the top experts in the field, you receive guidance and learn proven techniques through case studies that are brought to life so you can see how these strategies work when they are put into action.</p><p style=\"\">The Ultimate Relationship Resolution Program Includes: <strong style=\"\">5 audio visual lessons delivered immediately upon your purchase and a</strong><strong style=\"\"> Free Bonus Consultation with me: </strong></p><p style=\"\"><strong style=\"\">Private Coaching Session: </strong>You will also get a bonus free question and answer support session with licensed professional, Rachel Moheban-Wachtel. Even though you may not want or need time with a therapist, this session is designed to focus on answering questions and gives you an opportunity to figure out how best to implement the strategies and techniques from the program.</p><p style=\"\">I want to offer support and make sure I can help you take action and assist you with your next steps. My aim is to guide you so you can enjoy the countless benefits that come from a healthy relationship.</p><p style=\"\">The <strong style=\"\">Ultimate Relationship Resolution P</strong><strong style=\"\">rogram </strong>is not for couples that are in crisis. It is a program that is designed for people who want to be in a relationship, in the process of getting married or into a long-term relationship, or currently in a relationship or marriage. This program is for individuals and/or couples who can&#039;t find the time to go to counseling as they are juggling long work hours, shuttling kids to lessons and leading very busy lifestyles. You can download these recordings and listen to them at home, during your commute, or anytime that is convenient for you.</p><p style=\"\">Anyone who is interested in creating a healthy happy fulfilling relationship should listen to the <strong style=\"\">Ultimate Relationship Resolution Program.</strong></p>", 
    "end_date": null, 
    "title": "The Ultimate Relationship Resolution Program", 
    "price": "25.00", 
    "instructors": "Rachel Moheban Wachtel", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445800_6389_3.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-relationship-resolution-program/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T14:15:35Z"
}