{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   &ldquo;All men are dogs.&rdquo; &ldquo;All the good men are already taken and if they are not taken they are gay.&rdquo; These are the words of women who gave-up on finding Mr. Right because they were hurt or abuse by Mr. Right Now. So, if you&#039;re like most women you&#039;re on a quest to find Mr. Right. Giving up on having a good man in your life is the same as telling Mr. Right Now that he was right. Mr. Right now wants you to give up, because he already stop believing or never believed in Miss Right or Mrs. Right.  </p>  <p style=\"\">  \t   Finding Mr. Right is not easy, yet it is not impossible. On the contrary, I strongly believe that there is a Mr. Right for every woman who has a desire to find the love of her life, this includes single mothers. Trust me I know what I am talking about. When I met my Mr. Right I was a divorcee single mother of two, and he did not only love be but he also loves kids. Dreams do come true!  </p>  <p style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t <strong style=\"\">There&#039;s someone out in the world ready to love you unconditionally.</strong><strong style=\"\"></strong>He knows you are not perfect, he knows you have a past, he knows you want to be love, he knows you want to feel safe in this crazy world, he knows how to help you be better than you already are. So, don&#039;t give up on having Mr. Right in your life.  </p>  <p style=\"\">  \t   I know what I am saying, I dated many Mr. Wrongs, and several Mr. Right Now and today I am enjoying a happy life with Mr. Right. So if you are single, divorced or widowed and want a good man in your life, what do you do next? Don&#039;t settle for less when you can have the best.  </p>", 
    "end_date": null, 
    "title": "The WOMAN MEN Want: Searching For Mr. Right", 
    "price": "30.00", 
    "instructors": "Sandra Graves", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145312_85da_5.jpg", 
    "course_url": "https://www.udemy.com/where-is-my-mr-right/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-10T20:28:02Z"
}