{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You were born to be great, to succeed, and your relationship / marriage life to be happy, secure and satisfying. If you don't feel like that right now, you are one decision away from getting back on track ...</p><p>The Answer – Literal Steps to Your Relationship Bliss is designed to help the most amount of people most effectively in their relationships, and that includes you!</p><p><strong>Here's how it works.</strong></p><p>Just as there is only ONE heart that keeps our blood flowing, ONE rudder that steers every ship, ONE switch that powers your whole house…</p><p>…there is also just ONE catalyst that feeds, nourishes and keeps every relationship / marriage alive and juicy. Without it, all relationships are at risk of withering and dying. Fortunately, the answer to your relationship success is simple and it lies in learning how to identify this ONE catalyst and how to activate it directly into your life. This ONE catalyst which has been lost in modern culture has been found again in The Answer – Literal Steps to Your Relationship Bliss.</p><p>This ground-breaking course gets right down to the naked truth about the psychology of how humans relate successfully. Unlike any other course of its kind, <strong>The Answer</strong> leads you via literal simple steps to the ONE simple root of which all successful relationships are founded upon. Soon, this root can be activated in your relationship, and like a catalyst, the many issues and problems will start to fall into alignment.</p><p><strong>Everything in this course is centred around this ONE catalyst. Here are some of the effects that are caused when you activate it in your relationship:</strong></p> <ul> <li>You start to feel known and understood again. </li><li>You start to feel deeply loved consciously and subconsciously. </li><li>You start to see each other in a different way like windscreen wipers clearing the windscreen. </li><li>Your deep inner feelings for each other start to change like ice beginning to melt. </li><li>Your attraction and awareness for each other starts to change. </li><li>Like oil to a car engine, your communication will start to run smoothly. </li><li>You start to feel loved again which causes you to fall back in love with your partner. </li><li>You will begin to realise that someone in your life has purposefully made plans to benefit and bless you like no other person, and.....these plans are being carried out.... by your partner!</li></ul> <p><strong>Here's how the course is laid out: </strong> </p><p>We start with a passionate critique of the relationship culture in the 21st Century and what it would take to change the course of society. This leads us to looking at why this course had to be radically different to any others to succeed long term.</p><p>Then we look at preparation questions and answers which will reveal the ONE catalyst and show how it can work its transforming miracle in your relationship.</p><p>Now we take the first eleven literal steps which identify precisely what the catalyst is for your relationship. This includes the steps to apply it to your life immediately and most crucially, the simple plan how to ensure it becomes a lifestyle habit as effortlessly as possible.</p><p>After that we take six literal steps which reveal precisely what weakens and could eventually destroy the catalyst working in your relationship. Then again, and most importantly, you are led through the simple plan to eliminate those things and to ensure this direction becomes a lifestyle habit as easily as possible.</p><p>Finally, four literal steps which implement the simple plan to maintain your happy, successful, loving, secure, sexually satisfying relationship for ever. This course is a lifetime investment.</p><p><strong>This course can add priceless value, stability, and meaning to your life if …</strong></p> <ul> <li>You are currently in a relationship or marriage and desire to vastly increase your happiness, security and satisfaction. </li><li>You are struggling in your relationship or marriage or considering separation or divorce. </li><li>Only you want the relationship to work, your partner has given up.   </li><li>You are single and you want the knowledge and expertise needed to gain a wonderful future relationship.</li></ul><p> <strong>What am I going to get from this course?</strong></p><p>The course includes over 3 hours of class lecture video content, as well as exercises and resource material on how to practically apply the ONE catalyst to your relationship<strong>. </strong>The resource material is downloadable to be a practical tool that can be used at your convenience. The class is delivered in easy to follow video modules, and also includes lecture descriptions you can read plus PDF charts so you can go at whatever speed you prefer.</p><p>I'm really excited to be delivering this course to you and hearing how this ONE catalyst is giving you hope and a vision for your relationship. I know what it feels like to be paralysed in a marriage without a way forward and there is nothing worse. Knowing you have a clear plan which addresses your relationship needs can make each day so much lighter and brighter.</p><p>Most of all, please engage with the discussion section of this course. I'd love to be able to chat with you, get building new relationships and certainly answering any questions that you may have.  </p><p>Talk soon</p><p>John</p><p>Results Relationship Coach</p>", 
    "end_date": null, 
    "title": "The Answer - Literal Steps to Your Relationship Bliss", 
    "price": "30.00", 
    "instructors": "John D Spinks", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253136_50b9_3.jpg", 
    "course_url": "https://www.udemy.com/the-answer-literal-steps-to-your-relationship-bliss/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-30T12:27:31Z"
}