{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Latest course update was April 2016</strong></p><p><strong>Over 1,200 students in enrolled in this course currently!!</strong></p>\n\n<p>Are you having trouble with the dating game. Are you unsure of how to ask a person out on a date, where to take them, or how to seduce them. If so don't where your not alone. I too had my fair share of problems with the dating game. And If I were to be honest with you, I would have to say that I was absolutely terrible at attracting someone that I liked and getting them to like me.</p>\n\n<p>In fact there are more people than you who have trouble with dating. Who all share the same problem of not knowing the dating game. As humans with like to connect and interact with the oppose sex, it is a part of who we are as a species. However if your terrible at the game, you probably fill like your missing out on one of the best parts of being alive. Trust me I understand these feelings all to well and that's why I created my udemy course.</p>\n\n<p>In my course I talk about some key points that you need to know when it comes to attracting someone that you like. I also give you some tips on asking a person out on a date, places to take them, and things to talk about so that your never in over your head. My course makes the dating life so easy to understand that even a complete newbie can succeed at the dating game.</p>\n\n<p>How many people have come into your life that you were attract too, and wanted to engage in a relationship with but didn't. Because you didn't know what to do or how to go about it. If your sick and tired of not getting the people you want, if want to start turning things around and start attracting people you want then enroll in my course and learn how. </p>\n\n<p><strong>Udemy has a 30 day money back guarantee </strong>so there is no risk to you.\nIf you’re not fully satisfied with the course, simply ask udemy for a refund\nand you'll get your money back no questions asked.</p>", 
    "end_date": null, 
    "title": "The manual to dating and attracting someone you like!", 
    "price": 0, 
    "instructors": "Justin McDonald", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664916_7454_4.jpg", 
    "course_url": "https://www.udemy.com/the-manual-to-attracting-someone-that-you-like-and-date/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T17:53:05Z"
}