{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5 style=\"\">SUCCESS BLUEPRINT</h5>  <p style=\"\">  \t    PARENTS and TEACHERS! This simple and easy-to-read BLUEPRINT will  show you HOW to IMPLEMENT the TOP 10 SECRETS of SUCCESS that anyone ages 13 and up must understand TO EXCEL  in this NEW ECONOMY!  </p>  <p style=\"\">  \t    START NOW and Create A Blueprint for a REWARDING Life with <strong style=\"\"><em style=\"\">The Secret For Teens Revealed</em></strong> Video and PDF Course.  </p>  <h5 style=\"\">Learn HOW to LIVE with NO REGRETS…</h5>  <ul style=\"\">  \t<li style=\"\">Improved relationships, confidence and self-esteem.</li>  \t<li style=\"\">A better attitude to self-motivate your strategies and plans for the future.</li>  \t<li style=\"\">Time management, resulting in better grades, productivity and overall happiness.</li>  \t<li style=\"\">Prepare your OWN Future.</li>  </ul>  <p style=\"\">  \t<a href=\"http://achieveit360.com/sftr-book/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><img alt=\"physical-book\" src=\"http://achieveit360.com/v2/wp-content/uploads/physical-book1.png\" height=\"94\" width=\"94\" style=\"max-width:100%;\"></a><a href=\"http://achieveit360.com/v2/sftr-book-and-dvd/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\"><img alt=\"dvd\" src=\"http://achieveit360.com/v2/wp-content/uploads/dvd.png\" height=\"94\" width=\"94\" style=\"max-width:100%;\"></a>  </p>  <h5 style=\"\">Product Description</h5>  <h5 style=\"\"> The Secret for Teens Revealed Online Program</h5>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">Parents and Teachers-</em></strong>  </p>  <p style=\"\">  \t    For parents and teachers, this powerful methodology has been proven  to work within teaching environments and leadership programs. If you  have been using a Character Education Program to support your student’s  growth, The Secret for Teens Revealed Curriculum will compliment your  current program as it focuses on creating change from within. Where else  can you find a program that supports young people to make the changes  necessary for success in their future?  </p>  <p style=\"\">  \t<strong style=\"\">As a leader and mentor this curriculum will offer you a blueprint to inspire young people to make better decisions</strong>,  improve their critical thinking and higher order thinking skills,  setting them up for success in their personal and business lives. Your  role as a leader and support will impact the lives of others using these  results driven tools provided in this powerful book.  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">For students-</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\">Have you ever wondered why some people achieve great things?</strong>  Do you think that these winners must be more talented, than the rest of  us, or more well-connected? The Secret for Teens Revealed will teach  you some fundamental strategies for success that will show you very  clearly that the ONLY thing that separates the SUCCESSFUL people from  everyone else is that they have learned how to bridge the gap between  setting goals and achieving them. They have developed ways of behaving  and thinking that enable them to achieve their goals. We will show YOU  how to become a winner and achieve marked success in all areas of your  life.  </p>  <p style=\"\">  \t<strong style=\"\">THE PROGRAM WILL TEACH YOU-</strong>  </p>  <p style=\"\">  \t    PART 1- Part 1 focuses on <a href=\"http://en.wikipedia.org/wiki/Theory_of_multiple_intelligences\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Howard Gardner’s Multiple Intelligence Theory</a>,  teaching the reader which learning style they predominantly use, where  their strengths are and consequently, which learning styles need more  focus. This information is crucial for students to skillfully plot their  path toward achievement as well as a successful future.  </p>  <p style=\"\">  \t    PART 2- 10 Lessons that will change your life FOREVER once you can master these concepts.  </p>  <p style=\"\">  \t<strong style=\"\">Lesson One</strong>: Why is a winning attitude so important for a rewarding life?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Two</strong>: What is your mind and how does it control your destiny?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Three</strong>: How will the laws of the universe change your life immediately?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Four</strong>: How does goal setting and persistence set you apart from all others?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Five</strong>: How can the confidence formula and body image give you predictable results for success?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Six</strong>: Why will responsibility shape your future?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Seven</strong>: How can you turn your life around by blasting through things that make you nervous?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Eight</strong>: How do self-motivation and your values help you live a decent life of integrity?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Nine</strong>: How can you let your courage emerge from within and rocket your life?  </p>  <p style=\"\">  \t<strong style=\"\">Lesson Ten</strong>: What difference will you make in your lifetime?  </p>  <p style=\"\">  \t<strong style=\"\">PART 3- Put it All Together to make a sound PLAN for how you will make a difference with your life</strong>.  You will know the importance of a good attitude, how to use your mind  to create and how to use the natural laws of the universe to work for  you, instead of against you. You will have narrowed down 25 mini goals  that you will work on to help get you to that one BIG DREAM that you  have. You will know how to use persistence, self-confidence and  self-motivation to propel you forward. You will recognize that in order  to make changes in your life, you must learn to change old habits or  paradigms and that will really make you feel uncomfortable. But, in  order to achieve your goals, and do things differently, you will need to  BLAST through your terror barriers and enter a world where you have  never been before. This is where TRUE creation occurs. Once you have  learned to move past all of your fears, and are BOLDLY moving in the  direction of your dreams, you will notice that things will start to  happen. People will be drawn to what you are doing, and you will start  making connections to help you. Step by step, you will begin to CREATE  your DREAMS and you will never look back.  </p>  <p style=\"\">  \t    There is a <strong style=\"\">5 step Approach</strong> to Each Lesson to help students <strong style=\"\">LEARN</strong>, <strong style=\"\">RETAIN</strong> and then <strong style=\"\">APPLY</strong>  this new information-  </p>  <ol style=\"\">  \t<li style=\"\">Pre-test</li>  \t<li style=\"\">Think About This!</li>  \t<li style=\"\">Lesson</li>  \t<li style=\"\">Review</li>  \t<li style=\"\">Extension Exercise</li>  </ol>", 
    "end_date": null, 
    "title": "The Secret for Teens Revealed; A 10 Step Blueprint", 
    "price": "30.00", 
    "instructors": "Andrea Samadi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224248_fe10_8.jpg", 
    "course_url": "https://www.udemy.com/the-secret-for-teens-revealed-a-10-step-success-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T18:00:34Z"
}