{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Domestic abuse</strong> knows no barriers of age, religion, culture or gender; although the vast majority of victims are women.  Be it Emotional Abuse, Physical Abuse, Financial Abuse, Sexual Abuse or Neglect, etc. this course unravels the dangers of abusive relationships and lays out a step-by-step plan to successfully put it behind you.</p><p>This course will take you from feeling devalued, disrespected, frustrated, confused, mentally tired or stressed, isolated, alone and in fear in an unhealthy relationship to being empowered, knowledgeable, confident, motivated, gaining mental and physical freedom, supported and flourishing in your new life.</p><p>I have personally been there, I experienced it and want to share the wealth of knowledge and information with you on how you too can survive and thrive.  Why? <em>Freedom</em><em>! </em>I want you to be Abuse-Free and live the FULFILLING life you were born to!  </p><p>Take the steps today to see SMILES and HAPPINESS instead of tears caused by a toxic relationship and an abusive partner.  Put yourself on the road to self-love, mental clarity and reclaiming your power.</p><p>As your instructor I will share insights and expertise from over two decades of personal experience, research and training in relationship dynamics.</p><p><strong>Students will learn</strong> a number of key lessons including: spotting abuse, planning your exit, raising finance, successfully leaving your abuser once and for all and keys to never getting into another abusive relationship.</p><p>This 5 hours plus course is structured into 10 segments broken down into individual lectures, each in Power Point slides and videos, plus downloadable course material, tasks and insightful information. Each lecture has simple action steps and quizzes to reinforce your learning. </p><p>This course is suitable for men and women 16 years plus; or younger individuals who are in an abusive marriage and want to leave their abusive spouse.</p>", 
    "end_date": null, 
    "title": "Time To Go: How To Safely Leave An Abusive Relationship ", 
    "price": "45.00", 
    "instructors": "Norva Semoy Abiona", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/552738_7cff_2.jpg", 
    "course_url": "https://www.udemy.com/time-to-go-how-to-safely-leave-an-abusive-relationship/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-12T20:22:31Z"
}