{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Der Tinder Dating Kurs ist fuer alle Singles und Fremdgeher/Seitenspringer, die ueber Tinder erfolgreich die Liebe des Lebens finden wollen und/oder einfach nur haeufig daten wollen und \"mehere Eisen im Feuer\" haben wollen:).</p><p><br></p><p><em>Der Kurs ist fuer Maenner.</em><br></p><p><br></p><p><strong>Sie lernen die exakte Psychologie, wie Sie Frau dazu bringen, dass diese Sie hinterherjagt, anstatt, dass Sie die Frau jagen. Sie werden hier zum Objekt der Begierde anstatt anderes herum. Lernen Sie, wie ich es innerhalb von 4 Monaten schaffte, mir mehr als 140 potentielle Partnerkontakte (Frauen) in meine App zu bringen, die ich jederzeit anschreiben kann und Sie es, nachdem Sie den Kurs getaetigt haben, es ebenso mir gleichtun koennen, mit dem gleichen Erfolg. Beweis liefere ich per Screenshots im Kurs, bei dem Sie meine Konakte und Texte, inklusive Frauenfotos- und profilen sehen werden. Wieso? Darum:</strong></p><p><strong>Es ist die richtige angewandte Psychologie, die jede Frau aus rein genetischen wissenschaftlich begruendeten Gruenden dazu bewegen wird mit Ihnen und nicht mit anderen Maennern ein Date haben zu wollen.</strong></p><p><strong>Und diese Psychlogie und die Kunst des richtigen \"textens\" (schreiben) lernen Sie hier.</strong></p><p>Der Kurs dauert rund 1h und wird per Video-Lektionen gelehrt, so dass Sie das gesprochene Wort ebenso groesstenteils mitlesen koennen.<br></p><p>Sie sollten den Kurs nehmen, wenn Sie endlich das Singledasein beenden wollen und viele Dates haben wollen oder nur ein richtiges Date finden wollen und daraus Ihre grosse Liebe wird.</p>", 
    "end_date": null, 
    "title": "Tinder Dating Paradies App (5/10 Matches pro Tag)", 
    "price": "20.00", 
    "instructors": "Soeren Gelder", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/792108_dad5.jpg", 
    "course_url": "https://www.udemy.com/tinder-dating-paradies-app-510-matches-pro-tag/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-14T07:45:51Z"
}