{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course explains the complexities of abusive relationships and the pervasiveness of abuse as a global epidemic.  Whether abuse is physical, verbal, psychological, or financial -- and regardless of the gender of the abuser or target -- this course is aimed at reducing intimate partner abuse through education and empowerment.</p><p style=\"\">The instructor shares unique insights to the burning question:  \"Why don't victims leave?\"  Students will comprehend how an abuser's tactics and a target's vulnerabilities creates a powerful bond that is dysfunctional and can be difficult to escape.</p><p style=\"\"> This course also sheds light on the fact that targeted individuals are often robust and successful prior to this relationship, yet become  systemically weakened over time.  Topics such as abuse by proxy, alienation from one's children, and the shift from physical abuse to more sophisticated types of abuse is taught, as well.</p><p style=\"\">Lastly, the instructor illustrates the personality structure of both abusers and targets, and the type of mate an abuser is apt to choose.  Students will learn practical advice for avoiding potential abusers, determining whether their partner can change, and supporting loved ones who may be in abusive relationships at present.</p><p style=\"\">Through PowerPoint slides and accompanying lecture, the instructor shares her insights and clinical expertise from her research into abusive relationships and her nearly two decades of experience as a psychotherapist.</p><p style=\"\">This 75-minute course is structured into six segments and is appropriate for men and women age 16+.</p>", 
    "end_date": null, 
    "title": "Understanding Abusive Relationships", 
    "price": "20.00", 
    "instructors": "Amanda Somberg, MFT", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/551204_ad44_4.jpg", 
    "course_url": "https://www.udemy.com/understanding-abusive-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T18:00:31Z"
}