{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong>Are you raising a child with Asperger's syndrome?</strong></li><li><strong>Do you feel frustrated/ angry/ lonely/ emotionally and physically exhausted?</strong></li><li><strong>Instead, do you want to feel optimistic, loved and full of energy?</strong></li></ul><p><strong><br></strong></p><p><strong>Course contents</strong><br></p><p><strong>100% satisfaction rate from current students!</strong></p><p>Raising a child with a different wiring in his/her brain than your own can be a tiring and sometimes a very frustrating process which makes you wonder if you are good enough to take up this challenge.</p><p>Well, this course is designed to prove to yourself that you are even better! It contains 16 short lectures which cover the main challenges - confusion, anger, guilt, exhaustion, loneliness- neurotypical parents usually face when raising their aspie(s) and how to overcome these by doing simple exercises every day.</p><p>The exercises are derived from my 20 yrs experience in people development, coaching, NLP and meditation which I have used with my clients and my own self-discovering journey of being a parent.</p><p>Parenting is an on-going process; so this course will be updated with any new insights/information/exercises as time passes by. </p><p><strong><br></strong></p><p><strong><br></strong></p><p><strong>Questions &amp; Answer Session</strong></p><p>I'd love to hear from you! </p><p>You are welcome to send me a personal message or start a discussion with questions, issues etc.</p><p>Let's connect to travel this road together. You aren't alone!</p><p>Enroll now!</p><p><strong>Remember: You have a 30-day money back guarantee without asking you any questions!</strong></p>", 
    "end_date": null, 
    "title": "Wellness Tips for Parents of children with Asperger's", 
    "price": "20.00", 
    "instructors": "Marina Prifti", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/492514_c9b4_3.jpg", 
    "course_url": "https://www.udemy.com/be-happier-while-raising-a-child-with-aspergers-syndrome/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-03T13:31:28Z"
}