{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>T</strong>HIS COURSE IS FOR MEN who wants to know how to meet women. It's for men who wants to date and attract their dream woman. For men who wants to know how to go up to any woman and start a conversation. This course is for men who wants to know how to take a woman back home.</p><p><br></p><p><strong>T</strong>his course will make it clear how to meet women anywhere, even if you are not tall, rich or great looking. </p><p><br></p><p><strong>I</strong>f you have a problem meeting women then you need to join this course and get it fixed. It is essential to your lifestyle that you fix this.</p><p><br></p><p><strong>Y</strong>ou will learn exactly what words to use to start conversations. You will learn where to take women on dates that are both fun and don't cost that much. You will learn how to create attraction and get physical with women. <br></p><p><br></p><p><strong>A</strong>t the end of this course you will be able to go up to any woman and start a conversation. You will be able to attract and get phone-numbers and email addresses of beautiful women within minutes of meeting them. You will learn secrets most men will never know about women and dating.</p><p><br></p><p><strong>I</strong> will show you using videos (with good audio quality). It is 6 main steps and 3 bonus videos. You will be able to finish the full course within 1 hour. However, this is a course you can come back to again and again. And for questions and challenges with meeting women just post in the dash-board (included when joining) and I will try to help.</p><p><br></p><p><em>There's also a 100% money-back guarantee, that means if for any reason you are not satisfied you have 30 days to get all the money back. No question asked!</em> </p>", 
    "end_date": null, 
    "title": "What Every Man Should Know To Be Succesful With Women", 
    "price": 0, 
    "instructors": "Simon Berg", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698272_911c_3.jpg", 
    "course_url": "https://www.udemy.com/datingsuccess/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T15:59:24Z"
}