{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This program consists of video lectures and handouts designed to help you learn how to get bullies to leave you alone using behavioral science techniques.</p>\n\n<p>There is more to the technique of how to get bullies to stop than just ignore them and they will go away. Lots more.  What you don’t know and what isn’t being taught is causing us to fail. This program is designed to help you understand what exactly has to happen to get a bully to stop by sharing what all science tells us needs to happen to stop unwanted behavior, like bullying.  <br></p>\n\n\n\n\n\n\n\n<p>This course will:</p>\n\n\n\n\n\n<ul><li>Fill in those gaps in your knowledge by teaching you what you didn’t know you needed to know</li><li>Explain the science of how exactly behaviors are stopped.</li><li>Explain how you can use this information to train bullies to stop </li><li>Provide real life examples of how exactly this works and more importantly why it works.  </li></ul>\n\n\n\n\n\n\n\n<p>The course takes approximately 40 minutes to complete and includes downloadable documentation logs and a flow chart for how to stop bullying in different situations. </p>\n\n\n\n\n\n\n\n<p>If you are being bullied or have been bullied or worry about someone who is being bullied or might be bullied, this course can help you.  It will help explain why what you were taught didn’t work and how to fix it so that you can prevail over your bully and get them to stop, all while maintaining your values and ideals as an ethical human being.</p>\n\n\n\n\n\n\n\n<p><strong>Science. Because it works. </strong></p>", 
    "end_date": null, 
    "title": "Why Bullies Bully and How to Get Them to Stop", 
    "price": 0, 
    "instructors": "Jennifer Hancock", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/808472_dc38_2.jpg", 
    "course_url": "https://www.udemy.com/stopbullyingwithscience/", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-30T19:51:30Z"
}