{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><span></span>Повелительница пяти стихий – королева мужских сердец.Вы узнаете о том, какие стихии использовали древние китайские мудрецы и как эти стихии связаны с любовными отношениями и с женской и мужской сексуальностью.<br></li><li>Загадки женской энергетики.Мы поговорим о женской физиологии и анатомии в представлении последователей даосской науки. Вы узнаете про «волшебные» отверстия и «магические» точки, которые могут дать женщине удивительную силу и сделать её неподражаемой возлюбленной. Кроме того, вы узнаете, как защититься от нежелательных информационно-энергетических вторжений, которые могут возникнуть в процессе общения с мужчинами.</li></ul><ul><li>Кто вреднее: муж или любовник? Нам предстоит обсудить сложную и щекотливую тему полигамии. Многомужество и многожёнство, супружеские измены и секс «для здоровья». Все эти неоднозначные темы будут освещены с точки зрения даосской науки.</li></ul><ul><li>Тайны мужской физиологии.Вы узнаете секреты мужчин, которые должна знать каждая женщина, чтобы стать воплощением мужской мечты. В этой части мы коснёмся темы «грамотных» прикосновений и затронем тему энергетического взаимодействия женщины и мужчины во время эротических ласк. Следует отметить, что некоторые особенности физиологии неизвестны даже самим мужчинам, а потому владение этими тайнами даёт женщинам грандиозное преимущество – возможность управлять мужскими оргазмами.</li></ul><ul><li>Знаменитые даосские сакральные техники энергетического слияния с мужчиной.Речь пойдёт о двух техниках, которые могут свести с ума любого самого искушённого мужчину. Одна из них может быть использована во время интимного контакта, другая станет инструментом поддержания энергетической связи, если любимый мужчина находится в отдалении – техника дистанционного эротического контакта.</li></ul>", 
    "end_date": null, 
    "title": "Даосские практики любви - для счастливой пары", 
    "price": "50.00", 
    "instructors": "Лиза Питеркина", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/737704_0f7d.jpg", 
    "course_url": "https://www.udemy.com/dao-piterkina/", 
    "currency": "USD", 
    "subject_name": [
        "Parenting & Relationships"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-22T10:10:41Z"
}