{"selfpaced": false, "topic_name": ["Bioinformatics"], "description": "\n\n                    \n                    \n                    This free online course aims to raise awareness amongst healthcare professionals of the role of Clinical Bioinformatics  and Genomics in healthcare today. We will illustrate how the discipline of Clinical Bioinformatics provides an important bridge between the cutting edge science and the delivery of genomic medicine in clinical practice. By understanding the role of a Clinical Bioinformatician it will become clear how integral they are to ensuring the beneficial opportunities of genomic medicine are fully realised in patient care.\n\nDiscover the potential of Clinical Bioinformatics\n\nThis is an exciting time. We are now beginning to sequence whole genomes in the clinic, the most personal information we can have on a patient. We can start to see how genome variants might impact on health and we can direct really precise medicine to individual patients. This is not without its challenges. The genome is a huge amount of information. Identifying the causative variant (the part in the genome that can cause a change in health) is like looking for a needle in a haystack. But what does this phrase actually mean? This course will take you into the world of a Clinical Bioinformatician and show you what they do behind the scenes when finding that needle in the genomic data. It will also show you what happens next and the important contribution Clinical Bioinformatician’s make to the patient’s journey.\n\nExplore the methods of Clinical Bioinformatics\n\nClinical Bioinformatics involves tools and technologies which require a certain set of skills and expertise. Using next generation sequencing techniques and data analysis allows the bioinformatician to filter and classify the information from the human genome. The course will bring these methods and processes to life using case studies, interviews with bioinformaticians and a host of activities to help you understand the basics of Clinical Bioinformatics.\n\nInvestigate the role of Clinical Bioinformatics in healthcare\n\nThe role of clinical bioinformatics can be seen as providing a link between computer science and biology and so involves tools and technologies which require specific skills and expertise. Using Next Generation Sequencing (NGS) techniques and data analysis bioinformaticians and clinical scientists can identify, filter and classify variants found in the human genome linked with genetic disease.  This course will bring these methods and processes to life using case studies, interviews with bioinformaticians and a host of activities to help you understand the role and its importance in genomic healthcare. You will also be able to see the benefits and the challenges to clinical bioinformatics in regards to wider ethical issues like those relating to data management - we’ll be asking questions about how patient data is stored and who has access to it.\n\nContinuing Professional Development\n\nOn this course you there is an opportunity to purchase to purchase a Statement of Participation that will provide both a physical and digital record of your participation. You might find this useful for demonstrating evidence of informal Continuing Professional Development (CPD), commitment to your career, or of your awareness of the issues in a particular subject.\n\n\n                                    ", "end_date": "2016-07-11T00:00:00Z", "title": "Clinical Bioinformatics: Unlocking Genomics in Healthcare", "price": 0, "instructors": "Ang Davies", "institution_name": ["Manchester University"], "commitment": "2 hours", "subject_name": ["Computer Science"], "course_url": "http://www.futurelearn.com/courses/bioinformatics?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}