{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    This course explores how to use LibGDX to build 2D games that run anywhere, from web browsers to mobile devices. We start with simple drawings, and then turn to simple animations, physics, and user input handling. Finally, we create a full game, called Icicles, where icicles rain down from the top of the screen, and the player must dodge them using the arrow keys or by tilting their phone.Why Take This Course?You already know that making and playing games is the most fun you can have with a computer, but if you need more convincing, you should know that over the last decade, mobile gaming has grown into a huge market. It's full of opportunities for independent game developers, or for people looking to join established gaming studios. \n\nIf you want the skills to turn your game ideas into reality, or get ready to jump into professional game development, this is the course for you.\n\n                                            Syllabus\n                        ### Level 1-1: Intro to Cross Platform Game Development\n\nLearn how LibGDX allows you write a game once, then deploy to to both Android and iOS devices, as well as desktop computers and web browsers. Also explore the functionality that the LibGDX game framework provides.\n\n### Level 1-2: Intro to LibGDX\n\nImport and your first LibGDX project, run it on your computer and Android device, and learn the basic structure of a LibGDX game.\n\n### Level 1-3: Drawing\n\nUse the LibGDX ShapeRenderer object to draw some simple shapes (and some not-so-simple fractals).\n\n### Level 1-4: Cameras and Viewports\n\nUse a camera to focus the player's field of view on a portion of a larger game world, and learn to use viewports to simplify camera management.\n\n### Level 1-5: Movement\n\nCreate simple animations and physics effects by updating the game world over time. Also learn to break up a complex game into separate screens.\n\n### Level 1-6: User Input\n\nHandle key presses, touches, and accelerometer input.\n\n### Level 1-7: Growing Icicles\n\nCreate the core of Icicles, including player controls.\n\n### Level 1-8: Polishing Icicles\n\nAdd scoring, a head-up display, and a difficulty select screen.\n                                    ", 
    "end_date": "2015-12-18T00:00:00Z", 
    "title": "2D Game Development with libGDX", 
    "price": 0, 
    "instructors": "Jeremy Silver and Peter Heinrich", 
    "institution_name": [
        "Amazon"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/2d-game-development-with-libgdx--ud405?utm_medium=referral&utm_campaign=api", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-10-23T00:00:00Z"
}