{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Ubiquitous Computing is just a fancy phrase for technology that's accessible to the user at any time wherever they happen to be while staying relevant and unobtrusive. Until recently, reaching your user in all these new places often meant you had to build your own hardware, libraries, and infrastructure. Now you can take advantage of Google platforms to extend your app without having to reinvent the wheel.\n\nThe material in this course will give you the conceptual knowledge and expertise to extend your app with Android Wear, Google Cast, Android TV, and Android Auto.Why Take This Course?People no longer need to sit at a desk to experience technology. Our apps must be extended to be useful in all the contexts our users are now expecting. Take this course to learn the design paradigms and technical essentials of bringing your app to your user wherever and whenever they want or need it.\n\n                                            Syllabus\n                        ### Introduction \nOverview of the course structure and goals, and introduction to the sample app. \n\n### Wearables \n#### Part 1: Notification Sync\n#### Part 2: Watch App\n#### Part 3: Watch Face \nHow to design and extend wearable apps, and build a watch face for the Sunshine app. \n#### Wearables Project\nDesign and extend the Sunshine app for a wearable device. \n\n### Living Room \n#### Part 1: Google Cast for Chromecast and TV\n#### Part 2: Going Deeper with Android TV \n#### Part 3: Gaming with Android TV \nOverview of Android TV platform, and Google Cast for Chromecast and TV. \n\n### Auto  \n#### Part 1 - Messaging App\n#### Part 2 - Media App\nExtend and test your apps for Auto.\n                                    ", 
    "end_date": "2015-06-08T00:00:00Z", 
    "title": "Android Ubiquitous Computing", 
    "price": 0, 
    "instructors": "James Williams, Joshua Gordon, Wayne Piekarski and Timothy Jordan", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/android-ubiquitous-computing--ud875?utm_medium=referral&utm_campaign=api", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-05-11T00:00:00Z"
}