{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Extending your app to Android Wear smart watches allows you to reach your users wherever and whenever they'd want or need your app. As you'll learn in this course, you can take your existing Android development experience and apply it to developing for Android Wear. This course will take you through getting started, application structure, and information sharing between the wearable and the companion phone or the cloud. We'll also give you the knowledge necessary for designing great user experiences for wearables including how to take advantage of the always-on display of Android Wear devices.\n\nThis course is part of the Ubiquitous Computing series. Designed as standalone short courses, you can take any course on its own, or take them all!\n\n* **Android Wear Development** [this course]\n* Android TV and Google Cast Development\n* Android Auto DevelopmentWhy Take This Course?If you're already an Android developer, you're only a few steps away from being able to use your existing development experience to reach your users wherever or whenever they want or need your app. Take this course to learn how easy it is to extend your existing app to Android Wear smart watches.\n\n                                            Syllabus\n                        ### Introduction \nOverview of the course structure and goals, and introduction to the sample app. \n\n### Wearables \n#### Part 1: Notification Sync\n#### Part 2: Watch App\n#### Part 3: Watch Face \nHow to design and extend wearable apps, and build a watch face for the Sunshine app. \n#### Wearables Project\nDesign and extend the Sunshine app for a wearable device.\n                                    ", 
    "end_date": "2015-09-10T00:00:00Z", 
    "title": "Android Wear Development", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/android-wear-development--ud875A?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-08-27T00:00:00Z"
}