{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    This project covers the very basics of Android development. We will build a simple app that will serve up some fun facts when you tap on a button. We introduce the Java programming language, a tool for Android development called Android Studio, and some very basic concepts of the Android Software Development Kit, or SDK. By the end you will have a good idea of how a basic app works, and you will be armed with the knowledge to start building more.\r\n \r\nWhat you'll learn\r\n\r\nAndroid Studio\r\nUsing an emulator or device\r\nJava basics\r\nScreen layouts\r\nAndroid Views and Activities\r\n\n\n                                            Syllabus\n                        Getting Started with Android \r\nMaking an Android app is easier than you think, and we'll show you how! Learn how to set up and use a few free tools to make a simple Fun Facts app that you can test on your computer. You don't even need an Android phone!\r\nCreating the Screen Layout\r\nBefore we start writing any code, let's create the simple screen layout we will use to display our fun facts.\r\nBasic Android Programming\r\nAndroid apps are typically written in a programming language called Java. Let's take a deeper look at the Java concepts we need to make our button do something.\r\nCoding the Fun Facts\r\nEverything is set for us to add the fun facts to our app. In this stage we'll update the button to pick a new fact and change the color.\r\nImproving Our Code\r\nIn this stage we will take a moment to \"refactor\" our code, which means we'll change a few things and organize it a little better without changing how it works. Then we'll add a new class to help us change the background color for each fact.\r\nTesting and Debugging\r\nWe can't always see what's going on behind the scenes of our app, so in this stage we'll learn how to use a few tools to monitor how the Fun Facts app is working and to troubleshoot problems. We'll also see how to run it on a real phone.\n                                    ", 
    "end_date": null, 
    "title": "Build a Simple Android App", 
    "price": 25.0, 
    "instructors": "", 
    "institution_name": [], 
    "commitment": "4-5 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "http://treehouse.7eer.net/c/259799/289770/3944", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Treehouse"
    ], 
    "start_date": "2016-06-07T00:00:00Z"
}