{
    "selfpaced": false, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    This course will teach you how to create mobile apps for Android, iOS and Windows Phone. No prerequisite in coding knowledge is required.\n\nIn progressive steps, we will first learn how to create a simple and useful app: your own curriculum vitae.\nWe will discover how to test the app on phones, and how to distribute it on the Play Store, Apple's App Store and the Windows Store.\n\nLater in the course, we will also cover the basics of coding, because it will enable us to create richer apps with more functions: storing text and data on the phone, connecting to the Internet, and other useful features.\n\nThis course is created to make you able to create your own apps, fully functional and for all major mobile platforms. This is useful if you have a business project which involves launching an app, or to get acquainted with mobile technologies in an easy and hands-on manner.\n\n                                            Syllabus\n                        1. Installation of useful tools for the courseWelcome to CODAPPS! Let's install some tools, then create our 1st project and preview our app.2. How to add text, pics, links and extra screens to your appWe will learn the essential steps of creating an app: how to put stuff on a screen!3. Designing your appHere we learn how to control and change the appearance of our app to design exactly what we want4. Testing your app on a phone / distributing it on a storeIt gets real: in this module, we learn how to install your app on your phone, and how to put it on the app stores of Apple, Google (Android) and Windows. Your app is about to become available to billions of users!5. Initiation to coding to create an amazing appIn this module you will learn the basics of coding in 3 short videos and their pdfs6. Creating successfull apps: ROAR like a LIONWe will build ROAR: it's like Twitter, but with a lion instead of a bird. In just 2 videos.7. Creating successful apps: receive ROARS and add useful functions to your appHere we learn how receive information from the Internet and use it in our app, and how to add a couple of functions to make our app more powerful8. Wrap up and next stepsThis is the final module of the course, we leave you with good pieces of advice to continue advancing your projects\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "CODAPPS: Coding mobile apps for entrepreneurs", 
    "price": 0, 
    "instructors": "Clement Levallois", 
    "institution_name": [
        "EMLYON Business School"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/codapps", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}