{
    "selfpaced": false, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Bem vindo ao quarto curso do Programa de Cursos Integrados de desenvolvimento iOS da UNICAMP!\n\nAlguma vez você já imaginou criar o seu próprio jogo para iPhone e iPad? ou aumentar o engajamento dos usuários de algum aplicativo seu, transformando-o numa espécie de jogo onde os usuários podem competir entre si para ganhar pontos e prêmios?\n\nNeste curso você irá conhecer os princípios de desenvolvimento de jogos, o SpriteKit - framework de criação de jogos 2D da Apple e o GameCenter - rede social de jogos da Apple. As ferramentas de Game Design que serão trabalhadas neste curso também serão úteis para incrementar aplicativos que não são jogos com mecânicas que permitirão aumentar o engajamento dos usuários de seu aplicativo (gamificação).\n\nEste curso é composto por várias videoaulas passo a passo, para você que tem pouca experiência com programação de jogos, ou já é um programador experiente mas não nunca fez um jogo iOS, acompanhar as aulas e evoluir no seu próprio ritmo.\n\nConcluindo esse curso, você será capaz de desenvolver um jogo para iPhone e iPad, e usar o GameCenter para aumentar a competição entre os jogadores, ou gamificar e engajar os usuários de um aplicativo que não é jogo.\n\nO que você está esperando? Junte-se a milhares de outros usuários e comece já a desenvolver seus próprios jogos para iPhone e iPad e disponibilizá-los para milhões de usuários e jogadores ao redor do mundo!\n\n                                            Syllabus\n                        Bem vindo!E aí, pessoal! Tudo bem? Sejam bem vindos ao curso \"Como criar jogos 2D para iPhone e iPad\". Neste curso você conhecerá o framework SpriteKit e o GameKit para incluir o GameCenter nos seus jogos ou aplicativos. No final do curso você será capaz de criar um jogo para iPhone e iPad e também de gamificar um aplicativo. Bons estudos!Introdução ao SpriteKitE aí, pessoal! Tudo bem? Neste módulo, você vai conhecer o framework SpriteKit, utilizado para criar jogos 2D para iOS. Se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Criando um jogo simples com o SpriteKitE aí, pessoal! Tudo bem? Temos um módulo empolgante pela frente! Você irá desenvolver seu primeiro jogo de iPhone completo! Você vai aprender passo a passo a como desenvolver um jogo simples chamado Alien Escape. O jogador terá que desviar de inimigos e coletar moedas. Lembrando sempre que se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Tópicos avançados SpriteKitE aí, pessoal! Tudo bem? Neste módulo, você vai conhecer alguns tópicos avançados do Sprite Kit. Lembrando que se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Bons estudos!Outros tópicos avançados SpriteKitE aí, pessoal! Tudo bem? Neste módulo, você vai conhecer outros tópicos mais avançados do Sprite Kit, para aprimorar ainda mais seu jogo! Lembrando que se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Bons estudos!Tópico extra: GameCenterE aí, pessoal! Tudo bem? Neste módulo extra, você vai ver como adicionar o GameCenter em um jogo ou aplicativo e verá também algumas técnicas de Gamificação. Este módulo é extra pois para adicionar o GameCenter é necessário ser um membro do Programa de Desenvolvedores Apple, que custa 99 dólares por ano. Assista para aprender como é o processo, ou se você é um membro, pratique adicionando em algum jogo que fizemos neste curso. Bons estudos!Desenvolvendo seu próprio jogoE aí, pessoal! Tudo bem? Parabéns pelo seu empenho e esforço até aqui! Chegou a hora de fazer seu trabalho prático final. O trabalho é opcional e o tema é livre. Utilize todos os conhecimentos adquiridos neste curso. Estamos curiosos pra ver o que você será capaz de criar! Bom trabalho!\n                                    ", 
    "end_date": "2016-07-11T00:00:00Z", 
    "title": "Como criar jogos 2D para iPhone e iPad", 
    "price": 0, 
    "instructors": "Eduardo Galembeck and Rodrigo Dias Takase", 
    "institution_name": [
        "Universidade Estadual de Campinas"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/ios-jogos", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}