{
    "selfpaced": false, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Bem vindo ao segundo curso de desenvolvimento de aplicativos para iPhone e iPad.\nQuer fazer um aplicativo que navegue por múltiplas telas? Que apresente dados em tabelas? Que aceite diferentes gestos na tela? Ou quem sabe um aplicativo com diversos conteúdos em uma única tela com barra de rolagem?\nSe você respondeu \"sim\" para alguma dessas perguntas, esse é o curso ideal para você!\n\nNeste curso você vai criar um aplicativo capaz de navegar por múltiplas telas, verá como mostrar dados para o usuário através de tabelas e telas com rolagem, além de ver aqueles elementos comuns em diversos aplicativos de iPhone e iPad, como botões, controles, contadores e outros.\n\nEste curso é composto por várias videoaulas passo a passo, para você que tem pouca experiência com programação, ou já é um programador experiente mas não conhece o Swift ou nunca fez um aplicativo iOS, acompanhar as aulas e evoluir no seu próprio ritmo.\n\nConcluindo esse curso, você será capaz de desenvolver mais do que um simples aplicativo iPhone, podendo criar um aplicativo sobre o tema que desejar, quando desejar!\n\nO que você está esperando? Junte-se a milhares de outros usuários e desenvolva o seu próprio aplicativo!\n\n                                            Syllabus\n                        Bem vindo!E aí pessoal, tudo bem? Sejam bem vindos ao curso “Como criar aplicativos com múltiplas telas para iPhone e iPad”. Neste curso você conhecerá formas de adicionar diversas telas em um aplicativo, algumas das principais formas de apresentar e capturar dados assim como permitir que um mesmo aplicativo possa funcionar em iPhones e iPads. No final do curso você será capaz de criar aplicativos de diversas telas para iPhone e iPad. Bons estudos!Criando aplicativos de múltiplas telasE aí pessoal, tudo bem? Neste módulo, você vai conhecer diversas formas de adicionar mais telas ao seu aplicativo. Além disso, também vai conhecer ferramentas para permitir o desenvolvimento para iPhone e iPad simultaneamente! Se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Criando aplicativos com entradas de dadosE aí pessoal, tudo bem? Neste módulo, você vai conhecer como adicionar elementos que permitam capturar dados o usuário que usa o aplicativo. Verá como capturar dados de toques na tela, gestos e chamar o teclado virtual para o usuário digitar informações. Se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Apresentando dados no aplicativoE aí pessoal, tudo bem? Neste módulo, você vai conhecer os principais elementos do xCode para apresentar informações na tela. Verá como utilizar tabelas, coleções barra de rolagem e, inclusive, como salvar informações mesmo quando o aplicativo é encerrado. Se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Criando elementos de interface em um aplicativoE aí pessoal, tudo bem? Neste módulo, você vai conhecer alguns novos elementos de interface de um aplicativo, como slider, switch, segmented control e stepper. Você vai aprender também como usar diferentes fontes e conhecerá um pouco melhor como funciona um View Controller. Se você tiver alguma dificuldade nas tarefas, peça ajuda no Fórum de Discussões (e se você terminar primeiro que os outros colegas, espero que você passe pelo fórum para ajudá-los também). Assista as videoaulas e pratique. Pause o vídeo sempre que precisar para poder copiar, digitar o código e ver funcionando no seu próprio Mac. Bons estudos!Desenvolvendo seu próprio aplicativo de múltiplas telasE aí, pessoal, tudo bem? Parabéns pelo seu empenho e esforço até aqui! Chegou a hora de fazer seu trabalho prático final. Você irá transformar uma idéia em aplicativo! O tema é livre. Pense em algum problema cotidiano e crie um aplicativo que oferece uma solução simples. Utilize todos os conhecimentos adquiridos neste curso. Estamos curiosos pra ver o que você será capaz de criar! Bom trabalho!\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Como criar aplicativos com múltiplas telas para iPhone e iPad", 
    "price": 0, 
    "instructors": "Eduardo Galembeck and Danilo Marshall", 
    "institution_name": [
        "Universidade Estadual de Campinas"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/multiplas-telas-iphone", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}