{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Vitally important for building the best possible mobile app, the Location and Context API allows your Android app behavior to change based on location. \n\nIn this course, you’ll learn how to implement this with the Fused Location Provider, which gives you much more than simple GPS. You’ll also learn about Activity recognition, which allows you to tailor your app to what the user is doing. Finally, you’ll learn about Geofencing, and how location services work alongside geofences to allow you to build apps that could be used for augmented reality!\n\n**This course is part of the Google Play Services series, which features a  variety of different Google APIs. Designed as standalone short courses, you can take any course on its own, or take them all!**\n\n* **Google Location Services on Android** [this course] \n* Google Analytics for Android\n* App Monetization with Display Advertising \n* Add Google Maps to your Android AppWhy Take This Course?If you want to be a professional Android developer, it's essential that you tailor your app to fit your user's location and context in order to built the best possible mobile experience. You will learn these skills in this course, using Google's Location and Context API.\n\n                                            Syllabus\n                        ### Introduction\nOverview of Google Play services and an introduction to the goals and structure of this series.\n\n### Lesson 1 - Getting Started\nLearn about Location Services and Fused Location Provider, then create an app to get the current location. \n\n### Lesson 2 - Going Deeper\nLearn about continuous updates to your app, and then extend this to understand different user activities.\n\n### Lesson 3 - Advanced Topics: Geofencing \nLearn about geofencing, how it works, and how to build and monitor them.\n\n### Capstone Project (2 Stages) \n\n*This project assumes that you have completed Developing Android Apps,  Advanced Android App Development and  at least one other Google Play Services course, in addition to this course.*\n\nDesign, then build, your own Android app.\n                                    ", 
    "end_date": "2015-06-24T00:00:00Z", 
    "title": "Google Location Services on Android", 
    "price": 0, 
    "instructors": "Laurence Moroney and Jocelyn Becker", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/google-location-services-on-android--ud876-1?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-06-10T00:00:00Z"
}