{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Where in the world are people using your app? Which activities do they use most? How do they navigate through your app? Take this course to learn how to add code to your mobile app to send usage data to Google Analytics, and get answers to questions like these.\n\nThis course also covers how to use Google Tag Manager to send updated information to your app without needing to redeploy the APK, and to manage all your Google Analytics tags.\n\n**This course is part of the Google Play Services series, which features a  variety of different Google APIs. Designed as standalone short courses, you can take any course on its own, or take them all!**\n\n\n* Google Location Services on Android \n* **Google Analytics for Android** [this course]\n* App Monetization with Display Advertising \n* Add Google Maps to your Android AppWhy Take This Course?If you want to be a professional Android developer, it's critical to understand who your users are, where they are, and how they're using your app. To do this, you need to know how to access and manage your app's analytics. \n\nTake this course to learn how to use Google Analytics in your apps, and how to use Tag Manager to send updated information to your app and manage your Google Analytics tags.\n\n                                            Syllabus\n                        ### Introduction\nOverview of Google Play services and an introduction to the goals and structure of this series.\n\n### Lesson 1 - Getting Started with Analytics\nGet a Google Analytics account ID, and update your app to track all screen views. \n\n### Lesson 2 - Beyond Auto Activity Tracking\nSend tracking data for events, and track how your users move through the shopping process.\n\n### Lesson 3 - Intro to Tag Manager \nUse Tag Manager to update values in your app without having to redeploy any code. Cool, huh?\n\n### Lesson 4 - Integrating Google Analytics and Tag Manager \nUse Tag Manager to organize the Analytics tags in your app.\n\n### Capstone Project (2 Stages) \n\n*This project assumes that you have completed Developing Android Apps,  Advanced Android App Development and  Google Play Services: Location and Context, in addition to this course.*\n\nDesign, then build, your own Android app.\n                                    ", 
    "end_date": "2015-06-24T00:00:00Z", 
    "title": "Google Analytics for Android", 
    "price": 0, 
    "instructors": "Laurence Moroney and Jocelyn Becker", 
    "institution_name": [
        "Google"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/google-analytics-for-android--ud876-2?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-06-10T00:00:00Z"
}