{
    "selfpaced": true, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Many times your apps need to run lengthy operations in the background, like downloading data, but you don't want these operations to interfere with your UI.\n\nApple's GCD (long form: Grand Central Dispatch) framework allows you to create asynchronous apps for iOS, ensuring smooth a smooth user experience in situations like the one mentioned above.Why Take This Course?Almsot all Apps consume data from web services, and therefore must use background threads for these lengthy operations.\n\nEven though we provide a black box solution for concurrency in the iOS Networking with Swift course, it is important that you understand how concurrency works in iOS. \n\nThis knowledge is vital to deliver Apps that won't be rejected from the App Store and also provide a great user experience.\n\nOn top of that, GCD is a frequent topic in iOS job interviews.\n\n                                            Syllabus\n                        ###Lesson 1: Closures Reloaded\n\nIn this chapter we will revisit the concept of closures in Swift. We need to learn a few properties of closures that we bypassed in [Swift Syntax](https://www.udacity.com/courses/ud902). These are vital when dealing with GCD.\n\nYou will put you new knowledge of closures to test in several playgrounds. By the end of this lesson you will be able to drop things like, \"Closures are first class types that capture their lexical environment\" in casual conversations and impress fellow nerds. Even better: you will actually know what the heck you're talking about!\n\n###Lesson 2: Grand Central Dispatch\n\nHere you meet our main antagonist: Apple's open source library *Grand Central Dispatch*. \n\nGCD is an enormous library, so we will concentrate on its core features: how it allows you to send tasks to the background and (equally important) to the foreground.\n\nWhen you finish this lesson you will have a sound knowledge of how and what you can send to the background and what must always run in the foreground.\n\n###Lesson 3: Sample App\n\n```Talk is cheap. Show me the code! -- Linus Torvalds.```\n\nIn this chapter you will create a simple App that downloads huge images (the easiest way to block the UI). You will apply your newly acquired knowledge to send this network lengthy task to the background in 2 different ways.\n\nBy the end of this lesson you will know how to run closures in the background, design methods that take a completion closure and understand the code in the *black box* in the Networking course.\n                                    ", 
    "end_date": "2016-03-02T00:00:00Z", 
    "title": "Grand Central Dispatch (GCD)", 
    "price": 0, 
    "instructors": "Fernando Rodríguez", 
    "institution_name": [], 
    "commitment": "6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.udacity.com/course/grand-central-dispatch-gcd--ud576?utm_medium=referral&utm_campaign=api", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2016-02-17T00:00:00Z"
}