{
    "selfpaced": false, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    En este curso construirás aplicaciones que logren interactuar con el hardware del dispositivo, con el propósito de crear aplicaciones más interesantes, atractivas y útiles.\n\nEl hardware del dispositivo incluye aditamentos como bocinas, GPS, acelerómetro, cámara, etc., por lo que las aplicaciones pueden interactuar con este hardware para reproducir música, conocer la posición del dispositivo en el Globo Terráqueo, conocer la aceleración a la que está sujeto el dispositivo debido al movimiento que se realiza con él, o agregar fotografías del usuario a sus aplicaciones.\n\n                                            Syllabus\n                        Creando mejores Apps¡Hola a todos! Este módulo establece algunas características que debe cumplir una app exitosa, con base en el análisis de algunas apps de ejemplo. También revisa la importancia del trabajo en equipo para el desarrollo de una buena aplicación.Como siempre, si tienes duda en un Quiz o Actividad, debes de escribir en el foro de discusión para pedir ayuda. (Y, si terminas temprano, espero que vayas a esta sección para ayudar al resto de tus compañeros.) Vayamos a revisar el material preparado para esta semana, suerte.Media¡Hola a todos! Este módulo trata del proceso para agregar media a una aplicación. Particularmente, se incluye la reproducción de sonido y video. Como siempre, si tienes duda en un Quiz o Actividad, debes de escribir en el foro de discusión para pedir ayuda. (Y, si terminas temprano, espero que vayas a esta sección para ayudar al resto de tus compañeros). Vayamos a revisar el material preparado para esta semana, suerte.Movimiento¡Hola a todos! Este módulo utiliza el acelerómetro para obtener datos del movimiento del dispositivo, los cuales se usan para lanzar algunas acciones en la aplicación. Particularmente, se logran detectar sacudidas, un gesto muy común para lanzar acciones. Esto se hace por medio de lecturas del acelerómetro y, alternativamente, como un gesto.Como siempre, si tienes duda en un Quiz o Actividad, debes de escribir en el foro de discusión para pedir ayuda. (Y, si terminas temprano, espero que vayas a esta sección para ayudar al resto de tus compañeros.) Vamos a revisar el material preparado para esta semana, suerte.Localización¡Hola a todos! Este módulo utiliza los diferentes medios de posicionamiento (e.g. GPS) que tiene el dispositivo para establecer las coordenadas esféricas del mismo en el Globo Terráqueo. También lee valores de la brújula para conocer la orientación del dispositivo con respecto al norte, tanto geográfico como magnético. \nLa aplicación realizará ciertas acciones dependiendo de los valores obtenidos por estos sensores. \n\nComo siempre, si tienes duda en un Quiz o Actividad, debes de escribir en el foro de discusión para pedir ayuda. (Y, si terminas temprano, espero que vayas a esta sección para ayudar al resto de tus compañeros.) Vayamos a revisar el material preparado para esta semana, suerte.Fotos¡Hola a todos! Este módulo agregar fotos del usuario a las aplicaciones. Dichas fotos provienen de alguna de las dos fuentes principales del dispositivo, la cámara o el álbum de fotos. También se usa la cámara para crear aplicaciones de realidad aumentada. Como siempre, si tienes duda en un Quiz o Actividad, debes de escribir en el foro de discusión para pedir ayuda. (Y, si terminas temprano, espero que vayas a esta sección para ayudar al resto de tus compañeros.) Vayamos a revisar el material preparado para esta semana, suerte.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Interactuando con el hardware del dispositivo iOS", 
    "price": 0, 
    "instructors": "Dr. David Alejandro Escárcega Centeno, Dr. José Martín Molina Espinosa, Dr. Víctor Manuel de la Cueva Hernández and Dr. Rafael Lozano Espinosa", 
    "institution_name": [
        "Tecnológico de Monterrey"
    ], 
    "commitment": "", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.coursera.org/learn/hardware-ios", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}