{
    "selfpaced": false, 
    "topic_name": [
        "Mobile Development"
    ], 
    "description": "\n\n                    \n                    \n                    Smartphones, tablettes, ces appareils ultra-portables sont désormais omniprésents dans notre vie quotidienne. Il y a des applications pour presque tout : retoucher ses photos, réserver une place de cinéma, réviser le code de la route, choisir une recette de cuisine ou trouver les restaurants les plus proches.\r\nDerrière ces applications il y a un savoir-faire spécifique à la programmation sur plateformes mobiles. En effet, contrairement aux ordinateurs classiques, les contraintes imposées par les caractéristiques ces terminaux font que certains «gestes simples» pour l'utilisateur, comme faire dérouler une liste de données, impliquent en réalité des mécanismes plus complexes.\r\nCe MOOC de 6 semaines est le premier d'une série de deux MOOCs consacrés à la programmation sur iPhone et iPad. Il se concentre sur le développement d'applications «mono-vues» et présente en détail les principes d'une interaction réussie de vos applications avec ses utilisateurs. Nous avons également décidé de prendre en compte les dernières nouveautés introduites dans iOS. Ainsi, ce MOOC fera la part égale entre Objective-C, le langage «traditionnel» de développement sur cette plateforme, et le tout nouveau langage Swift (annoncé en Juin 2014 à la WWWDC et stabilisé en septembre 2014 avec la sortie officielle d'iOS 8). Un parallèle avec la problématique du développement de systèmes embarqués est également fait.\r\nCette nouvelle série de MOOCs tient également compte des nombreux retours de l'édition d'Avril 2014 également présentée sur FUN.\r\nSi vous suivez attentivement ce cours et réalisez les exercices proposés, vous devriez être autonomes dans la réalisation d'application pour l'écosystème iOS. Vous serez aussi capables de travailler non seulement dans l'environnement de développement d'Apple mais aussi dans des environnements similaires.\r\nLes exercices sont réalisés avec iOS8 publié en septembre 2014. Nous recommandons donc l'usage de Xcode 6.01 ou ultérieur (accès gratuit sur le site d'Apple).\r\nÀ QUI S'ADRESSE CE COURS ?\r\nCe cours s'adresse aux personnes compétentes en programmation et possédant de bonnes notions sur l'utilisation des langages objets (Objective C, C++, Java, Ada), des langages procéduraux (C) ainsi que des principes de base en système d'exploitation (interruptions, notion d'événement, etc).\r\nPRÉ-REQUIS\r\nLes prérequis sont un niveau de connaissances équivalent à celui d'une licence en informatique. Si, avant de suivre cet enseignement, vous souhaitez revoir certaines notions de programmation, vous pouvez consulter les références présentées ci-après (que vous devriez trouver en bibliothèque):\r\n\r\nLangage C:B. Kernighan &amp; D. Ritchie, Le langage C norme ANSI (traduction), DUNODen ligne - C code reference\r\nLangage C++:S. Meyer, Effective C++, 3rd Edition: 55 Specific Ways to Improve Your Programs and Designs, Addison–Wesley, 2005en ligne - Programmation C++ (débutant)\r\nLangage Objective C:J. DeVoe, Objective C, Wileyen ligne - Programming with Objective-C\r\nLangage Java:K. Arnold, J. Gosling, D. Holmes, The Java Programming Language, 4th Edition, Addison-Wesley Professionalen ligne - Apprendre Java - Cours et exercices\r\n\n\n                                    ", 
    "end_date": "2015-03-17T00:00:00Z", 
    "title": "Programmation sur iPhone et iPad (partie I)", 
    "price": 0, 
    "instructors": "Étienne Renault and Fabrice Kordon", 
    "institution_name": [
        "Université Pierre et Marie CURIE"
    ], 
    "commitment": "5-6 hours", 
    "subject_name": [
        "Programming"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/UPMC/18001S02/Trimestre_1_2015/about", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2015-02-03T00:00:00Z"
}