{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Our political debates, newspaper headlines, and internet comments are all too often stripped of nuance and a sense of shared humanity.  Too many public conversations are stuck in polarized language of confrontation and certainty.  We need new ways to foster dialogue with people across lines of religion, politics, ethnicity, and experience.</p>\n\n<p>Since 2001 Krista Tippett has hosted conversations on the big questions of meaning for On Being, a radio program and podcast distributed to 400 public radio stations across the country.  A Peabody Award-winning broadcaster and author of the recently published Becoming Wise: An Inquiry into the Mystery and Art of Living, she models a conversational style that elicits wisdom and cultivates generous listening.  In 2014, she received the National Humanities Medal at the White House.  Her conversation partners have ranged from clergy to social activists to poets and civil rights leaders.  </p>\n\n\n\n<p>In this breakthrough course, she challenges each of us to\nslow down and to listen. To embrace ambiguity. To find the difficult moments\nwhere real wisdom lies. This is a different kind of course, a master's take on\nreaching a deeper level of understanding. There are no quick answers here, no\nsimple exercises. Instead, Krista will open your\neyes (and ears) to a different way of engaging in the important conversations\nthat can change everything.<br></p>\n\n\n\n<p>You'll learn about her practices for becoming a generous listener and gain lessons from some of the most skillful conversationalists of our time.  Krista will teach you how to identify “bad” or confrontational questions and move to a style of inquiry that elicits more wisdom.  She’ll uncover why moving towards “common ground” or “getting on the same page” should not actually be the goal of most conversations, and help you shift from caring only about issues to caring about the people you are conversing with.  You’ll leave the course with an understanding of how you can approach your next conversation with a renewed sense of wonder and humility, rather than certainty or absolutism.  Her collected wisdom will galvanize anyone looking to spark meaningful dialogue across lines of difference in the service of social change.</p>", 
    "end_date": null, 
    "title": "+Acumen Presents: Krista Tippett on the Art of Conversation", 
    "price": "40.00", 
    "instructors": "+Acumen Courses, Krista Tippett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814168_c998_4.jpg", 
    "course_url": "https://www.udemy.com/krista-tippett-on-the-art-of-conversation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T05:28:40Z"
}