{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> This section is called <strong style=\"\">Looking in the Rear View Mirror</strong> and it is the nineth of ten sections. By now we&#039;ve learned quite a bit about ourselves and how we were impacted by the world around us and those with whom we engaged. Now we&#039;re ready to hold a different stance – how we impact the world by our very existence. When we hold certain beliefs, assumptions and create new patterns, our external environment reflects our internal landscape. When we look into a rear view mirror, we see who&#039;s following us, where we&#039;ve come from and what we&#039;re leaving behind. It&#039;s important to keep an eye out so that we can use our past as an indicator of how we want to proceed in the future, make minor adjustments and steer ourselves toward a desired course. Progress is about noticing where you&#039;ve been, realizing the changes that have taken place and focusing on where you want to go next. In the SCIENCE track, we&#039;ll look at the concept of FEEDBACK LOOPS and the data points that are available to us at any given moment. In the PSYCHOLOGY track, we explore BUTTERFLY EFFECT, the sense of separation, loneliness and the collective unconscious. And in the SPIRITUALITY track we delve into manifesting your reality through something called creational authority with yourself, others and the world around you. </p>", 
    "end_date": null, 
    "title": "10 Steps to an AwesomeSauce You! (Step 9)", 
    "price": 0, 
    "instructors": "Rajkumari Neogy", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/232479_b665_6.jpg", 
    "course_url": "https://www.udemy.com/10-steps-to-an-awesomesauce-you-step-9/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T02:24:29Z"
}