{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  This section is called The Beginning and it is the first of ten sections. In this section, we start by understanding how we arrived to exactly the point at which we&#039;re standing. This is about looking at patterns, assumptions and beliefs. Most importantly, those patterns, assumptions and beliefs that no longer serve us. In fact, I would wager to say that they are outdated. In the SCIENCE lens we look at the TRIUNE brain, the reptilian, the limbic and the mammalian brain to get a grasp on how they work together or give rise to conflict. And we briefly touch on unconscious bias so you can understand where your assumptions are coming from. For the PSYCHOLOGY lens, we explore our family of origin, the feelings of belonging, or lack thereof, what happens when we feel that we don&#039;t belong to our family and the judgments that arise in those circumstances. And with the SPIRITUALITY lens, we take a look at what has been passed down from our parents, our grandparents, their parents etc. We call these unconscious contracts – loyalties that have been passed down trans-generationally. This helps to quickly spotlight where issues of money or love relationships are being blocked in your life. As for exercises, there is a different exercise for each track. Take a deep breath, take your time and take good care of yourself as you embark on this journey of designing a new you!  </p>", 
    "end_date": null, 
    "title": "10 Steps to an AwesomeSauce You! (Step 1)", 
    "price": 0, 
    "instructors": "Rajkumari Neogy", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224552_d2d9_8.jpg", 
    "course_url": "https://www.udemy.com/12-steps-to-an-awesomesauce-you-step-1/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-20T22:58:48Z"
}