{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   This section is called Finding Bottom and it is the third of ten sections. Mandela is known for saying the following: “I have walked that long road to freedom. I have tried not to falter; I have made missteps along the way. But I have discovered the secret that after climbing a great hill, one only finds that there are many more hills to climb. I have taken a moment here to rest, to steal a view of the glorious vista that surrounds me, to look back on the distance I have come. But I can only rest for a moment, for with freedom come responsibilities, and I dare not linger, for my long walk is not ended.&quot; This is important quote for this section because we each must be willing to enter the valleys, the darkness and venture into places that seem scary. It&#039;s only on the way up, toward that peak that one begins to see the value in being in the valley. So this section is about finding your bottom, your current pain point in your life. Examining where your blocked or stuck. In the Science track, we&#039;ll delve into the Fight/Flight/Freeze syndrome and see how this may impact your everyday experiences. In the Psychology track we&#039;ll look at the core rights developed by Wilhelm Reich and how this may be impacting your relationships with friends, family and co-workers. And in the Spirituality track, we&#039;ll dive into the hero&#039;s journey and the dark night of the soul and see where there might be resonance if your life. Each track has a different exercise.  </p>", 
    "end_date": null, 
    "title": "10 Steps to an AwesomeSauce You! (Step 3)", 
    "price": 0, 
    "instructors": "Rajkumari Neogy", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/232418_6cc9_7.jpg", 
    "course_url": "https://www.udemy.com/12-steps-to-an-awesomesauce-you-step-3/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-29T00:39:29Z"
}