{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">In this course you will learn to:</strong></p><p>Reduce Stress</p><p>Increase Happiness</p><p>Live with Purpose</p><p>Live with Meaning</p><p>Re-prioritize Your Life Around What Matters</p><p>Achieve Your Dreams</p><p>Through my work as a <strong style=\"\">master teacher, entrepreneur, traveler, and spiritual seeker</strong> I have gained many insights into human nature. In this course we will learn proven psychological techniques and modes of thinking that are <strong style=\"\">guaranteed to improve your life.</strong></p><p>Drawing on the most effective teachings of philosophers, prophets, teachers, and leaders throughout history as well as my experience putting these ideas into practice, we will explore and learn <strong style=\"\">how to stop worrying, improve our effectiveness</strong> in whatever endeavor we choose, and<strong style=\"\"> live with new meaning and love.</strong></p><p>The things you will learn in this course work, it&#039;s as simple as that. In addition to my experience, and the words of the greatest teachers in history, we will also draw on modern research that points in the same direction as current and past teachers regarding how to live our lives, what is truly important, and why <strong style=\"\">NOW is always the best time</strong> to take action regardless of our current circumstances.</p><p>With a master&#039;s degree in teaching, minor degree in History, and a voracious reader who has consumed hundreds of books on history, philosophy, literature, and spirituality, I lay out for you the <strong style=\"\">MOST IMPORTANT things that I have learned</strong> throughout my life as a seeker. </p><p>Many people who know me tell me that I am one of the happiest people they know. In this course, I will tell you <strong style=\"\">WHY</strong>.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "10 Ways to Improve Your Life RIGHT NOW", 
    "price": "20.00", 
    "instructors": "Greg Vanderford", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442998_ffa2_4.jpg", 
    "course_url": "https://www.udemy.com/reduce-stress-increase-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T19:23:57Z"
}