{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is about creating success, by identifying and utilizing everyday opportunities. Opportunities are truly gifts that we often neglect or pass by. I don&#039;t want you to look back on your life, and recall lost opportunities that could have radically changed your life. Opportunities have a short shelf life, you have to take advantage of them quickly. Each of you have ability and the potential for greatness, but this ability is of little account without the opportunity to pursuit it. The 10 Ways to Create an Opportunity based life is like laying a firm foundation to build something wonderful upon. Each suggestion is based on my life experiences as a teacher, founder of several businesses, CEO of Educational Software Company for 18 years, Core Energy Coach, husband, father, and grandfather. Every one of these roles I have played in life has had problems. Each problem had a hidden opportunity awaiting me. If I was fearless and approached the problem seeking to discover the opportunity, the opportunity was so potential powerful that it literally dwarfed the problem. </p><p>Where do you put your focus; on the problems of yesterday or tomorrow, or the opportunities right within your grasp today? This training program is part of the “Shifting Problems into Power&quot; training. In the past this program has only been utilized to assist my personal coaching clients. Look for this program in the near future. Never underestimate the power of one simple opportunity. Small opportunities lay the foundation for greatness in the lives of those willing to take risk. Missed opportunities are often the most expensive mistakes we every make. Today is an opportunity to move forward in life, learn to be fearless and take risk. There is an opportunity waiting for you, it will change your life forever. </p>", 
    "end_date": null, 
    "title": "10 Ways to Create an Opportunity Rich Life", 
    "price": 0, 
    "instructors": "Michael Reeves", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521628_cd91_6.jpg", 
    "course_url": "https://www.udemy.com/opportunitybasedlife/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-05T23:08:01Z"
}