{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">An invitation to turn your life around.</p><p style=\"\"><em style=\"\">If it feels like you</em><em style=\"\">&#039;</em><em style=\"\">re not living the life you want, chances are you have some deep subconscious blocks sabotaging your potential happiness and success.</em></p><p style=\"\">Say goodbye to 99% of your energy blocks and start enjoying life. </p><p style=\"\">Discover how to raise your vibrational frequency and experience abundance, happiness and success across all areas of your life.</p><p style=\"\"><em style=\"\">Sound too good to be true?</em></p><p style=\"\">Let me share the truth.</p><p style=\"\">Energy blocks are subtle. That&#039;s why even though they&#039;re widespread in society today, very few people are aware of them.</p><p style=\"\">And they silently rob you of your vital energy force.</p><p style=\"\">You begin to leak energy without realizing it.</p><p style=\"\">And life becomes exhausting.</p><p style=\"\">You may not realize it but these blocks are robbing you of your energy, working against you and your dreams.</p><p style=\"\">And over the years they become hardwired into your body, your thoughts and your emotions.</p><p style=\"\">Reality sets in.</p><p style=\"\">You begin to believe that life works out for other people but not you and you start to lose sight of your dreams.</p><p style=\"\">BUT…</p><p style=\"\">it doesn&#039;t have to be this way.</p><p style=\"\"><strong style=\"\">YOU CAN discover how to raise your energy and get rid of the stuff that is holding you back and preventing you from tuning into your heart to live a life of abundance.</strong></p><p style=\"\">This is NOT a lecture based program this is a TOOLKIT giving you practical tools to unblock your energy and heal your life.</p><p style=\"\">•Cleanse your energy field for a better quality of life</p><p style=\"\">•Learn how to boost your energy</p><p style=\"\">•Experience the one minute energy tools which will easily fit into your day</p><p style=\"\">•Break free of your energy blocks and raise your vibration</p><p style=\"\">•Enjoy the energy cleansing meditations which are vibrationally aligned to reduce stress, activate and recharge your energy</p><p style=\"\">•Break free of limiting beliefs and discover better health</p><p style=\"\">•Ground your emotions and experience more joy</p><p style=\"\">•Generate unshakeable self confidence and reclaim your inner power</p><p style=\"\">•Over come fear and heal your wounds</p><p style=\"\">•Learn to let go of negativity</p><p style=\"\">•Clarify your purpose and learn to trust your intuition</p><p style=\"\">•Empower your soul and live a resonant life</p><p style=\"\"><strong style=\"\">Improve the quality of your energy and the quality of your life</strong></p><p style=\"\">There are valuable and practical tools inside for the beginner, intermediate and advanced traveler on this road of life.</p><p style=\"\">Over the years I&#039;ve developed dozens of energy tools that can easily and quickly spark profound changes in your energy field.</p><p style=\"\">No experience and virtually no effort is required on your part.</p><p style=\"\">Please bear in mind these are advanced tools originally designed for use exclusively with my private clients, which means you won&#039;t find them anywhere else.</p><p style=\"\">Best of all, once you learn these tools you&#039;ll be able to practice them by yourself for the rest of your life and use them whenever you need an energy boost.</p><p style=\"\">As a Master Coach and Energy Healer Jayne understands the power of energy within many different contexts from life and relationships to leadership and business. When you take this course you will receive privileged access to Jayne&#039;s unique energy tools.</p><p style=\"\"><strong style=\"\">Content and Overview</strong></p><p style=\"\">Whether you already have a knowledge of energy or just simply an idea that there is more to life to be explored, you&#039;ll find value in this practical, hands on energy toolkit.</p><p style=\"\"><strong style=\"\">In the introduction</strong> Jayne dives straight into defining the road ahead to prepare your body, mind and soul and you will begin to practice raising your frequency with some high level energy tools.</p><p style=\"\"><strong style=\"\">Days 1-3 </strong>gives you the tools to supercharge your finances, enjoy better health and break free of limiting beliefs.</p><p style=\"\"><strong style=\"\">Days 4-6 </strong>Invites you to reconnect with your emotions, giving you tools for emotional intelligence, experiencing joy and moving your love life in the right direction..</p><p style=\"\"><strong style=\"\">Days 7-9 </strong>provides tools to protect your energy boundaries, build your confidence and eliminate clutter.</p><p style=\"\"><strong style=\"\">Days 10-12 </strong>is about healing your wounds, giving you vital tools to open your heart, overcome fear and love unconditionally.</p><p style=\"\"><strong style=\"\">Days 13-15 </strong>empowers you with tools to speak your truth, let go of negativity and listen more deeply to life.</p><p style=\"\"><strong style=\"\">Days 16-18 </strong>give you the tools to live your purpose, trust your intuition and reclaim your inner power.</p><p style=\"\"><strong style=\"\">Days 19-21 </strong>raises your vibrations with tools to empower your soul, connect to the divine and live in resonance.</p><p style=\"\">Imagine in just <strong style=\"\">21 days </strong>you could be living, breathing and walking with lighter energy, free of all your blocks, feeling more confident, more positive and increasingly abundant in all areas of your life.</p><p style=\"\">This toolkit will help you to make cleansing your energy a powerful daily ritual. In just a few minutes each day you can learn a new tool, connect with the world around you, recharge your energy and strengthen your body.</p>", 
    "end_date": null, 
    "title": "21 Day Energy Cleanse", 
    "price": "30.00", 
    "instructors": "Jayne Warrilow", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/520662_3946_2.jpg", 
    "course_url": "https://www.udemy.com/21-day-energy-cleanse/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-04T19:13:30Z"
}