{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>+++++++++++<br></em></p>\n\n<p><strong><em>Note: This course was just recently launched and already has over 3200 students with great reviews! </em><br></strong></p>\n\n<p><strong><em>We are one of the top Udemy Instructors in the Personal Development Field. our courses have been taken by over  21,000 happy students from 155 Countries.</em></strong><br></p>\n\n<p><strong><em>We have a thriving community in the course and we are actively involved and answer questions within 24h.</em></strong></p>\n\n<p><em>+++++++++++</em></p>\n\n<p>Do you want to be happier, feel more gratitude, be more confident and create a successful, satisfying life. But, you seem to hold yourself back because:</p>\n\n<p>Change feels like a daunting task</p>\n\n<p>You don’t know where to start</p>\n\n<p>You figure it is probably too complicated </p>\n\n<p>How would you find the time?                                                                          </p>\n\n<p>But, what if I told you that you can make massive changes to your reality, your state of mind, and your experience of life in less than 7 minutes a day for only 21 days?</p>\n\n<p>I bet you would probably think that its B.S.</p>\n\n<p>And, if you did, you’d be absolutely right! It is your Belief System (B.S.) that creates your life. This belief system creates thought patterns and habits that impact every part of your life. </p>\n\n<p>Have you ever noticed that there are people that are always happy or things seem to go right for them even when things are not going right?   </p>\n\n<p>Many studies show that it is not your environment that determines how successful or happy you are or how great your relationships are. It truly comes down to one thing—your state of mind. People with the right state of mind live longer, have better and longer lasting intimate and social relationships, get promoted more often, earn more, and, more importantly, experience more happiness. </p>\n\n<p>So how can I be one of these people?</p>\n\n<p>The first step is to realize that you can control your state of mind and emotions. With the right tools, techniques, and questions you can feel happy, confident, grateful or at peace<em> no matter what</em> is going on around you.</p>\n\n<p>This course will walk you through daily activities to help you condition your mind and body using NLP (neural linguistic programming) and psychology. Through repetitive anchoring of positive emotions, you will be able to quickly and easily evoke a state of confidence, happiness, joy, and gratitude. Through daily questions designed to rewire your conscious and unconscious mind, you will be able to change patterns, see life from a different perspective, and create habits that will help you create a truly life. </p>\n\n<p>So, if you are ready to change your life in just 7 minutes a day, then we look forward to seeing you in the course! </p>\n\n<p><strong>What will I learn in this course?</strong></p>\n\n<p>Gain control over your thoughts, focus and emotional state (Stop letting your thoughts control you)</p>\n\n<p>Learn how to easily choose an optimistic, positive attitude (Stop negative thinking and bad moods in their tracks)</p>\n\n<p>Learn how to create the emotions you want (Stop feeling out of control emotionally)</p>\n\n<p>Gain the ability to see the blessings, even in the curses (Stop feeling like a victim of life)</p>\n\n<p><strong>What will the outcomes be?</strong></p>\n\n<p>Feel greater confidence and gratitude</p>\n\n<p>Feel happier throughout your day</p>\n\n<p>Feel in control of your thoughts and emotions</p>\n\n<p>Feel eagerness and positive expectancy about life</p>\n\n<p>Develop a daily habit of choosing your focus and emotional state</p>\n\n<p>Develop the state of mind required to succeed in life</p>", 
    "end_date": null, 
    "title": "21 Days to an Empowered State of Mind ", 
    "price": "20.00", 
    "instructors": "Joeel & Natalie Rivera", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697440_1912.jpg", 
    "course_url": "https://www.udemy.com/21-days-to-an-empowered-state-of-mind/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T19:31:53Z"
}