{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Εδραίωσε την Αφθονία στην καθημερινότητά σου.<br></strong></p><p>Tο πρόγραμμα <em>\"22 ημέρες για την Εδραίωση της Αφθονίας\"</em> έχει σχεδιαστεί από την επιστημονική ομάδα της Expansion Method, για να καταφέρεις να αδρανοποιήσεις τις παλιές, κακές συνήθειες (πεποιθήσεις) και να βάλεις στην θέση τους νέες, καλές και λειτουργικές.<br></p><p>Το πρόγραμμα παρέχει όλα τα εργαλεία που χρειάζεσαι για να μεγιστοποιήσεις τα αποτελέσματα της Expanson Method. </p><p>Στόχος μας είναι να καταφέρεις να δημιουργήσεις μια νέα συναισθηματική δόνηση που θα επιτρέπει να ζήσεις ευτυχισμένα και σου δείξει τι ακριβώς πρέπει να ξέρεις για να επιτύχεις μια κατάσταση διαρκής Αφθονίας.<br></p><p>Στο τέλος του προγράμματος θα έχεις:</p><ul><li>Εδραιώσει την αίσθηση της Αφθονίας στην ζωή σου. </li><li>Χωρίς κόπο και προσπάθεια θα δεις την ψυχολογία σου να έχει βελτιωθεί, </li><li>Να νιώθεις ξεκούραση και ολοκλήρωση </li><li>αλλά και να γνωρίσεις μυστικά που μεταμορφώνουν το πνεύμα σου από την θεωρία της Expansion Method. </li></ul><p>Πληροφορίες που θα διευρύνουν το πνεύμα σου και θα σε βοηθήσουν να σκέφτεσαι θετικά και αισιόδοξα!</p><p><em>Το ειδικό 22ήμερο μεταμορφωτικό αυτό πρόγραμμα της Expansion Method προορίζεται για όλους όσοι έχουν ολοκληρώσει τον πρώτο κύκλο συνεδριών με τον Πιστοποιημένο Σύμβουλό τους και έχουν μόλις απελευθερώσει τα πρώτα τοξικά τους συναισθήματα! </em></p><p><em>Μπορείτε να το παρακολουθήσουν όμως και όλοι όσοι ενδιαφέρονται να βελτιώσουν την ζωή και τα συναισθήματά τους. </em><br></p><p><br></p>", 
    "end_date": null, 
    "title": "22 ημέρες μετά την Expansion Method ", 
    "price": "50.00", 
    "instructors": "Argyris Stravelakis, Expansion Team, Angeliki G. Arvaniti", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684804_ed24.jpg", 
    "course_url": "https://www.udemy.com/22days-first-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-30T10:04:50Z"
}