{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Learn simple ideas from the world&#039;s smartest people to completely transform every area of your life.</strong></p><p style=\"\">Ralph Waldo Emerson said everyone should make their own bible. This course is the bible I wish I had 10 years ago. It&#039;s what I wish I was taught in school before learning to read.</p><p style=\"\">And now you can learn directly from some of the most successful and influential people, both alive and from the past, and use their ideas to guide your life.</p><p style=\"\">************************************</p><p style=\"\">About this course:</p><ul style=\"\"><li style=\"\">Almost everything in here are direct ideas from everyone from Buddha to Charles Darwin to Larry King</li><li style=\"\">Lessons from Aristotle, Buddha, Roger Federer, Ralph Waldo Emerson, Lao Tzu, Charles Darwin, Warren Buffett, Larry King and more...</li><li style=\"\">Full, free lifetime access</li><li style=\"\">Many lectures to be added soon, and you get access free</li></ul><p style=\"\">Here&#039;s what you&#039;ll learn inside:</p><ol style=\"\"><li style=\"\">The 4 areas to prioritize if you want to experience maximum fulfillment</li><li style=\"\">Aristotle&#039;s key to achieving all your goals</li><li style=\"\">The Buddha&#039;s key to making the most out of life</li><li style=\"\">Roger Federer and Ralph Waldo Emerson on maximum positivity and happiness</li><li style=\"\">Lao Tzu, the father of Taoism, on letting things go that hold you back</li><li style=\"\">Charles Darwin, who popularized evolution theory, on optimum health</li><li style=\"\">Warren Buffett, the most successful investor of the 20th century, on living your dreams</li><li style=\"\">Larry King&#039;s lesson on deep and lasting relationships</li></ol><p style=\"\">Ultimately, it&#039;s important to have your own bible. My goal in this course is to share with you some ideas I think can guide you to the correct action, guide you to happiness and guide you to success throughout life.</p><p style=\"\">To start learning now, just click the &quot;take this course&quot; button. </p><p style=\"\">I look forward to taking this journey together.</p><p style=\"\">Brandon</p>", 
    "end_date": null, 
    "title": "27 Life-Changing Lessons from the World's Smartest People", 
    "price": "20.00", 
    "instructors": "Brandon Hakim", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473006_99c5_7.jpg", 
    "course_url": "https://www.udemy.com/7-life-changing-ideas-from-the-worlds-smartest-people/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T18:34:44Z"
}