{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a great course for anyone who has ever felt that they were not succinctly working in their purpose. Understanding the difference between doing something you are skilled at and doing something you were \"created to do\" is pivotal in maximizing your personal success.<br></p><p>This short course will help you uncover your true purpose and put you on path towards producing, profiting and prospering in your purpose!.</p><p>If you have gotten this far you may be on the edge and debating if you should take this class. Let me help you with your decision.... <strong>YES!!!</strong></p><p>So many times, we know that we are not doing what we should be doing, but taking the steps needed to get started is the hardest part. But think about what you already have. If you don't take this step, and things remain the same, will you be happy with your decision?</p><p>On the other hand, let's say you sign up, start the course and get more revelation and insight about how to do the things that call out to you, but you never have been able to \"Take Action\" to getting them done. How happy will you be that you actually got started?</p><p>The cost of this class is an investment into how you live for the rest of your life. It may be large for some and small for others. Question, can you name what you did with this same amount this time last year? How did you benefit from where you spent it? If you have already gotten charged up from the other videos, this course is a game changer.</p><p><strong>Invest in Taking Action towards Producing and Prospering in your Purpose!</strong></p><p>-MJ</p>", 
    "end_date": null, 
    "title": "3 Keys to Discover Your Purpose Today! ", 
    "price": "20.00", 
    "instructors": "Michelle Price-Johnson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/688458_7cce_5.jpg", 
    "course_url": "https://www.udemy.com/3-keys-to-unlocking-your-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-03T22:49:29Z"
}