{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\"></strong><strong style=\"\">Hello, my name is Victor Pride.</strong></p><p style=\"\"><strong style=\"\"></strong>I am the proprietor of Bold and Determined - the Website for Winners (tm).</p><p style=\"\">I have put together a checklist of what I believe are the 12 most important habits of a successful and proud man.</p><p style=\"\">I live my life by these habits and I want to share them with you.</p><p style=\"\">But I don&#039;t just want to share them with you, I want you to follow the steps and feel the passion, energy and fire that I feel every day.</p><p style=\"\">These habits are about developing and maintaining discipline.</p><p style=\"\">Self Discipline is the defining trait of man.</p><p style=\"\">With the 30 Days of Discipline mental and physical bootcamp you too can develop discipline and pride.</p><p style=\"\"><strong style=\"\"></strong> It is a bootcamp that you put yourself through. A way to discipline yourself, a way to tame those bad habits and institute new, Ass-kicking habits.  To get the full benefit of the program requires work on your part.  The only way you will succeed is to follow the instructions and <strong style=\"\">MAKE THE DECISION</strong> to go through with it. Decide to never quit.  It won&#039;t be easy, but when you emerge 30 days later you will be amazed at the energy, creativity and vitality you will feel.  You can become as you wish to be, it requires only a change of mindset, a smidgen of self-discipline and some will-power.</p>  <strong style=\"\">30 Days of Discipline is designed to help increase feelings of: </strong>   <ul style=\"\"><li style=\"\">Energy</li><li style=\"\">Vitality</li><li style=\"\">Creativity</li></ul>   <ul style=\"\"><li style=\"\">Strength</li><li style=\"\">Confidence</li><li style=\"\">Self Discipline</li></ul>  <ul style=\"\"><li style=\"\">Self Determination</li><li style=\"\">Pride</li><li style=\"\">Accomplishment</li></ul> <strong style=\"\">Here is what </strong>some of the guys who went through the <strong style=\"\">30 Days of Discipline</strong> program are saying… <em style=\"\">&quot;It may just be that the purpose of your life is to become a Man. When you meet death or God and you are asked what you did with your short time on Earth, you can say “I became a Man&quot;. When all other males around you gave up their manhood, when your whole society conspired to ruin you, when circumstances worked against you, at least you can stand firm and say “I became a Man despite it all&quot;. You&#039;re not a Man because you do what a Man does, but you can&#039;t be a Man without doing what a Man does. The place to start, is 30 days of discipline. I started it over 4 months ago and it has helped me immensely in my entrepreneurial activities, to become more decisive and of course, the foundation of all achievement, it has helped me with my discipline.&quot;</em> - Russ<p style=\"\"><em style=\"\">&quot;Thanks for the kick in the ass Victor. 30 days is already changing my life.&quot;</em> - Seth </p><p style=\"\"><em style=\"\"> </em><em style=\"\">&quot;Cheers for the checklist Victor, working well so far here in the UK.&quot; </em>- Chris&quot;</p><p style=\"\"><em style=\"\">Am one week into the 30 days of discipline and feeling marvelous. Late middle-aged, successful career, good marriage; children out and successful, starting to gain some weight and boredom approaches. Needed and found the challenge with excellent results. No more 4-Hour Body b.s. with “slow carbs&quot;. Should have found and started 30 Days of Discipline long ago. Almost forgot what it was like to feel like an 18 year old paratrooper again. Oh, and others have noticed too. No prisoners today!&quot;</em> - Oyaji   </p><p style=\"\"><em style=\"\">I just completed 30 days of discipline and let me tell you this program is pure gold. These 30 days has taught me one of the most important lessons in my life, HAVE A PURPOSE AND QUIT MAKING EXCUSES. Have a goal each and every day and do what it takes to achieve that goal. That&#039;s why I&#039;ll continue to use each habit inside 30 days of discipline. These habits have taught me how to apply the lesson I mentioned above, stop making excuses and start achieving... Guess what, my numbers went up in the gym as well. I hit PR&#039;s...Bottom line is stop making excuses and keep moving forward. Thank you for this invaluable lesson and advice with 30 days of discipline.</em> - Steve </p><p style=\"\"><em style=\"\"> &quot;...Not even 24 hours later I feel like I&#039;m kicking ass. This is a pivotal moment in my life. I can FEEL it. Finding this program, which really feels more like a lifestyle, and INSTANTLY implementing the principles – has already begun the re-wiring process...&quot;</em> - Corry  </p><p style=\"\"><strong style=\"\">TAKE ACTION TODAY!</strong> Get Your Access to <strong style=\"\">30 Days of Discipline</strong> program now… </p><ul style=\"\"><li style=\"\">Change your mindset and your habits to increase your productivity</li><li style=\"\">Change your thought process, change your life</li><li style=\"\">Be a winner</li><li style=\"\">Remember, no one gives a damn about what you <em style=\"\">think </em>or what you<em style=\"\"> say</em>. It&#039;s about how you conduct yourself. It&#039;s your <strong style=\"\">ACTIONS</strong> that matter.</li></ul> <em style=\"\"> <strong style=\"\">What&#039;s Inside?</strong></em><ul style=\"\"><li style=\"\">Your guide to instilling and implementing the 12 ass-kicking habits that turn boys into men.</li></ul><ul style=\"\"><li style=\"\">12 Chapters each going over the new habit and why the habit is important to implement.</li><li style=\"\">An Excel Worksheet to help you stay accountability through the challenge</li></ul><ul style=\"\"><li style=\"\">12 Videos discussing each habit, each discusses how and why you want to suck it up and push through this challenge. </li></ul>   <strong style=\"\"><em style=\"\"></em></strong>", 
    "end_date": null, 
    "title": "30 Days Of Discipline - 30 Day Challenge For Men", 
    "price": "20.00", 
    "instructors": "Victor Pride, John Shea", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508810_bbe9_2.jpg", 
    "course_url": "https://www.udemy.com/30-days-of-discipline/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-22T11:14:59Z"
}