{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Scientific evidence shows that there is a strong correlation between nature and health.</strong>  </p>  <p style=\"\">  \t              Scientific research shows many benefits of adopting a more  eco-friendly  lifestyle that is in touch with Nature. It may sound  obvious to some of  you, but research in recent years proves it: time in  natural  environments improves both physical and mental health.  </p>  <p style=\"\">  \t<strong style=\"\">In this 30 days to Go Green course I included all the things I  have  learned on my quest to a Greener, happier and healthier life. As a   witness to my own journey towards change, I am convinced that this   holistic approach to Going Green is truly life changing.</strong>  </p>  <p style=\"\">  \t            We all care about the environment. We want to make it better, but  it’s so hard to know where to start. At the same time we all want a  happy and healthy life. We are looking for ways to slow down and take a  break from our hectic lives, to enjoy the present moment and to truly  connect with our family and friends.  </p>  <p style=\"\">  \t              These days we hear so much about saving  the planet, going Green, and being eco-friendly. But how can we realize  our true goals of getting back in touch with nature, living a healthy  lifestyle that doesn’t harm the Earth and becoming conscious, caring,  happy individuals?  </p>  <p style=\"\">  \t              Seeing yourself as part of an eco-system where every living thing  depends on the wellbeing of each other will change your life. Being  conscious and mindful of each decision you make and every action you  take means you are living in the moment, not just for yourself, but for  your friends, family and your entire extended ecosystem, which includes  everything on Earth. Yes, we are small, but what we do matters — most of  all to those in our inner circle, but to a smaller degree our actions  ripple throughout the whole world.  </p>  <p style=\"\">  \t              And we can waste less. We can live more  naturally, more cleanly, more selflessly and more in touch with Nature.  This is what I am doing every day and so can you! 30 days to Go Green  will start you on the path towards a happy and healthy lifestyle  motivated by love, caring and understanding. Does that sound like  something you’d be into?  </p>  <p style=\"\">  \t<strong style=\"\">Whether you are a college graduate, a  high school student, a mother of four or a busy businessman, this course will help you to become happier and healthier while reducing  your carbon footprint at the same time. I have written and designed this course to provide you with the right knowledge, techniques and advice  to be able to put what you are learning directly into practice.  </strong>  </p>", 
    "end_date": null, 
    "title": "30 Days to Go Green: Transform your life, health & happiness", 
    "price": "20.00", 
    "instructors": "Murielle U", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/314202_61f2.jpg", 
    "course_url": "https://www.udemy.com/30-days-to-go-green/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-06T10:36:43Z"
}