{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">*The course price increase each day until it reaches regular price*</strong></p><p style=\"\"><strong style=\"\">What will this course do for you?</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>You CAN change your life in one month!  </p>  <p style=\"\">  \t              Spend <strong style=\"\">30 days</strong>, one day at a time, doing the exercises and activities in this course and you will find your mind, body and spirit refreshed, renewed and strengthened.  </p>  <p style=\"\">  \t<strong style=\"\">What  value is  this course adding to your life?</strong>  </p>  <p style=\"\">  \t        This course is giving you information, instruction, techniques and skills that will empower you to significantly transform your life in only four weeks.  </p>  <p style=\"\">You can choose to change your life. And because you will have lifetime access, you can transform your personal life through habits of excellence. In that same time we will journey together through best practices that empower your professional success.  </p>  <p style=\"\">  \tYour personal and professional relationships will improve. Your professional efficiency, effectiveness and results will deepen, expand and increase.  </p>  <p style=\"\">  \t<strong style=\"\">What specific life areas will be addressed?</strong>  </p>  <p style=\"\">  \t      This personal transformation course will cover the mind, body and spirit. It has inspiration and motivation as well as practical activities for integrating them into your life. It is a holistic approach to creating excellence.  </p>  <p style=\"\">  \t  Do each step, each day, while continuing with the steps of  the previous days and adding the new step for that day, your life will dramatically change and improve in 30 days.  </p>  <p style=\"\">  \t  If TRANSFORMATION is your goal, this is your course!  </p>  <p style=\"\">  \t<strong style=\"\">Materials:</strong>  </p>  <p style=\"\">  \t        For this course you will want to get  </p>  <ul style=\"\">  \t<li style=\"\">some 3-hole punched loose paper</li>  \t<li style=\"\">a 3-ring folder (not necessarily a binder, just something for up to 20 pages)</li>  \t<li style=\"\">pens/pencil</li>  \t<li style=\"\">scissors</li>  \t<li style=\"\">1-2 sheets of posterboard</li>  \t<li style=\"\">a few markers</li>  \t<li style=\"\">a glue stick</li>  \t<li style=\"\">old/favorite magazines</li>  \t<li style=\"\">a journal of your liking</li>  </ul>", 
    "end_date": null, 
    "title": "30 Ways to Transform Your Life", 
    "price": "50.00", 
    "instructors": "Barrett Clemmensen Powell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/412270_b237_2.jpg", 
    "course_url": "https://www.udemy.com/30-steps-to-excellence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-03T14:49:52Z"
}