{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Master the skills of a balanced life so that you can develop and <em style=\"\">sustain</em> positive self-transformation.  </p>  <p>  \t  You have within you all you need to ignite your success and passion for life. But you may be missing the most effective skills for managing your 5 most essential resources: money, relationships, energy, time, and the ability to switch hats (roles in your life).  </p>  <p>  \t<strong style=\"\">Develop Proven Skills to Manage Your Most Precious Resources</strong>  </p>  <p>  \t  Once you have learned and implemented the <em style=\"\">360 Degrees of Success</em> skills you will keep your success and satisfaction growing for years, even decades to come.  </p>  <p>  \t  I am convinced, because I’ve seen it happen so many times, that if you bring the<em style=\"\"> 360 Degrees of Success </em>into action each and every day, you will  </p>  <ul style=\"\">  \t<li style=\"\">reignite your passion for life</li>  \t<li style=\"\">accelerate your success</li>  \t<li style=\"\">perform at your highest potential</li>  \t<li style=\"\">shift from average to exceptional </li>  \t<li style=\"\">take good care of yourself</li>  \t<li style=\"\">become instrumental in helping others along the way </li>  \t<li style=\"\">have a huge smile on your face! </li>  </ul>  <p>  \t  This course is built on the 5 essential components we simply cannot do without:  </p>  <ul style=\"\">  \t<li style=\"\">Money</li>  \t<li style=\"\">Relationships</li>  \t<li style=\"\">Energy</li>  \t<li style=\"\">Time</li>  \t<li style=\"\">Wisdom of Switching Hats</li>  </ul>  <p>  \t  When you have a relationship with <strong style=\"\">money</strong>, you have more of it in your life. As in any relationship, with money there’s give and take. In this first module, you will deepen your relationship with money by entering that give and take flow.  </p>  <p>  \t  People need other people to create success, joy and fulfillment. That is why we naturally want to connect in <strong style=\"\">relationships</strong>. In this module you will learn how to recognize which one of the five phases any relationship is in, so you can more easily nurture it or move it to the next phase, if appropriate.  </p>  <p>  \t<strong style=\"\">Energy</strong> is not only a tool for getting things done; it is also a magnetic force that draws people towards you. In this module you will learn how to shift your mindset and perform tasks that energize rather than drain you.  </p>  <p>  \t  When you feel stressed and overwhelmed, you might think, I don’t have enough <strong style=\"\">time</strong>. In this module you’ll learn how to arrest the time thieves and apply time systems that shift your life from overwhelmed and stressed out to easily managed and happy.  </p>  <p>  \t  Doing what you love may make you happy while you’re doing it, but what about the rest of the time? In this module you will learn how to love whatever you do simply by <strong style=\"\">changing hats</strong>.  </p>  <p>  \t  Just imagine what it will be like when you stop chasing silver bullet solutions and instead use these tools to sustain a continuous positive self-transformation.  </p>", 
    "end_date": null, 
    "title": "360 Degrees of Success", 
    "price": "30.00", 
    "instructors": "Ana Weber", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388082_6732.jpg", 
    "course_url": "https://www.udemy.com/360-degrees-of-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T23:44:20Z"
}