{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><p>To make a successful career shift - and, really, to get  anything you want in life - you need a good plan, flexibility and strong focus.  It also takes persistence and fortitude to stay on task in spite of possible  distractions and the “dead ends” or “set backs” which occasionally crop up  along the way.</p>    <p>Using  selected material from the “Go For It!” Module of their popular program,  &quot;The Career Finder Method,&quot; Jay Markunas and Angela Loëb help you get  focused, set goals, keep your momentum and get results.</p>    <p>The  purpose of this “Career Finder: How to Find the Right Career” course is to give  some valuable tips while introducing a few of the concepts for a successful  career change. For the more comprehensive course, please check out the complete  Career Finder program, which comes with 3 hours of video, a 65-page guide and  an online DISC assessment, at www.GreatOccupations.com .</p>    <p>Note: This program was originally recorded on June 22, 2010</p>    <p><strong>About the  Instructors: </strong></p>    <p>Angela Loëb and Jay Markunas have successfully advised professionals  on career management and transition strategies for a combined 40 years.  Together they inform, inspire and engage audiences with their unique approach  of balancing the positive and the practical.</p>    <p>____________________________________________ </p>    <p><strong>Feedback from clients  about Jay&#039;s approach to career transition: </strong></p>    <p>“Jay provides a good balance of practical advice and  positive encouragement.” – M.G., Austin, TX </p>    <p>“You gave me a jump start after I have been bogged down by  doubts and insecurities.” – C.L., Austin, TX </p>  <p>“Even if you are aware of the wide range of strategies he  shares, you’ll come away with more information making it very worthwhile,  especially for the short amount of time invested.” – C.S., Austin, TX </p>    <p>“I wanted to let you know that I accepted a job with NI last  week. I’m excited about the opportunity…. it’s a great role. Thanks for your  help.” – J.L., Austin, TX </p>    <p><strong>Feedback from clients  about Angela&#039;s approach to career transition: </strong></p>    <p>“Angela provided me with career transition consulting and my  only regret was not finding her sooner! From the help re-writing my resume, to  the worksheets that helped me to understand my key competencies (very useful  for competency-based interviews), to understanding the importance of networking  and LinkedIn. Every piece of information and advice Angela gave me was  incredibly helpful and definitely got me out of my job search rut. In addition,  her upbeat and positive attitude made it an all around pleasant experience  working with her. Angela is the ultimate expert at what she does.” Top  qualities: Great Results, Expert, High Integrity – Jamelyn Hart, Austin, TX </p>    <p>“Angela helped me get a clearer direction in my career path.  In our meeting Angela assisted me in narrowing down my fields of interest,  suggested some organizations to research, and helped direct me in my action  plan. She provided me with several worksheets that were key in revamping my  resume. Angela&#039;s career coaching has been invaluable to me, and I see a light  at the end of the tunnel now thanks to her!” Top qualities: Personable, Expert,  Creative – Debbie Lester, Austin, TX</p>    <p>Take  this Career Finder course now and learn how to find the right career with 4  proven principles.&nbsp;</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "4 Proven Principles For Creating A Life Worth Living", 
    "price": "20.00", 
    "instructors": "Angela R Loeb, Jay Markunas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28504_40cc_2.jpg", 
    "course_url": "https://www.udemy.com/creating-a-life-worth-living/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-03T01:22:05Z"
}