{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>40 Days to Balance and Peace</strong></em> is a six part video series conducted by executive coach <em>Shivani Gupta.</em> It identifies your top values, strengths and weaknesses and teaches you how to obtain success and balance in work and life. </p><p>Over a six week / 40 day period you will identify your top three values and how they can be employed to gain greater success at work and at home. </p><p>The course follows six core modules. You will be asked to identify the key areas that apply to your life, taught how to employ the skills needed to obtain balance and finish each week with a guided meditation by Shivani. </p><p>The modules are as follows:</p><p><strong>Identifying your top 3 values:</strong> You will learn what values are most important to you in amongst work, family, physical health, relationships, education, wealth and spiritual beliefs. Defining the three areas that you are most passionate about and how you can master them. Over the 40 days you will learn how to employ the skills you need to master your top three over the next 12 months. </p><p><strong>Locus of control:</strong> In week 2, you will learn how to define what you can control and how to let go of what you can't. You will eradicate blame and understand why you react to things in certain ways. You will learn how to become the hero of your own life and not wait for someone else to fulfil your needs. </p><p><strong>Defining success on your terms:</strong> You will be asked to define success and visualise what it looks like on your terms. Success differs for each individual, and it's important that it is aligned with your top 3 values and not the values of those around you. Shivani will also teach you how to employ the Gratitude Effect; If you are grateful for what you have, you in turn get more of it. Employing this skill will positively impact your relationships with colleagues, friends and family.</p><p><strong>Learning to say no:</strong> In week 4 you will recognise the importance of being able to say no to others as well as yourself. Saying no will allow you to do more of what you love to do, and eradicate resentment towards others.</p><p><strong>Forgiveness:</strong> Week 5 will focus on the importance of forgiveness and moving forward. You will be asked to list past grudges and identify current resentment towards people in your life. You will be asked the question, '<em>What makes me react the way I do, to the people that I need to forgive?</em>' - In doing so, you will learn how to own those personality traits, and react in a way that is kinder to yourself. You will also learn how to let go of someone that comes from a different value set, as their top three values may not align with yours.</p><p><strong>Putting yourself first:</strong> Your final module stresses the importance of not compromising your wellbeing in order to please others. It focuses on cultivating self love and recognisng it's importance; before teaching others to love you, you have to accept and love yourself first. Shivani will guide you through her process to self love, based on her best selling book <em>'I Love Myself'. </em>Your guided meditation will have you visualising yourself as a small child with no inhibitions, rightfully returning mind and soul to that self love that you once had.</p><p>The course can be completed at any time, with short videos that give you the tools master balance and peace in the areas most important to you. You will also learn how to create a vision board, to bring your new defined goals to life over the next 12 months. Moving forward, 40 days to balance and peace will establish your core values, cultivate and promote self love and create a clear and concise vision for your version of success. If this sounds like something you would like to create in your life, please join Shivani on a life changing and affirming 40 days to Balance and Peace.Key Terminology: Values, goals, vision, vision board, self love, saying no, success, family, relationships, work, work life balance, forgiveness, control, personality traits, gratitude, determination, acceptance, Demartini, education, health, meditation, Shivani Gupta, executive coaching, coaching, small business, leaders, passionate people.</p><p></p>", 
    "end_date": null, 
    "title": "40 Days to Balance and Peace", 
    "price": "20.00", 
    "instructors": "Shivani Gupta", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487198_b4e3.jpg", 
    "course_url": "https://www.udemy.com/40-days-to-balance-and-peace/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T03:27:00Z"
}