{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is for those of you who want Jedi-like skills so you can accomplish more in less time, and to be able to do with ease, flow, and fun. You tend to achieve things using effort and struggle, and just want to be able to accomplish things easier and faster. You can look at this as one deep, giant mind-hack. You&#039;ll be surprised at how effortless and enjoyable you can make your journey through life. It&#039;s time to let go of the old paradigm of struggling and efforting in order to get what you want.</p><p style=\"\">Then there are those of you who have been discovering just how powerful your minds are. You&#039;ve had many realizations, but are finding that it ain&#039;t always easy to apply these new insights. You find yourself still thinking and experiencing just about the same as before.  This course is a way for you to be able to apply what you will learn and EXPERIENCE the benefits of this transformation. This is what this course is designed to do: it is a step-by-step mind training program where I hand hold you through the process of integrating and habitualizing these insights. When you leave this course you&#039;ll have these new, more empowering habits already running in you.</p><p style=\"\">Lastly, this is for you who are looking for a deep identity level change, and want to take your lives and your experiences to the next level. You&#039;re at a point where you have a growing desire to explode into life - to create, to enjoy, to be free, to love, to experience, to inspire, to be you. In this course we go deep into topics of consciousness and how you are creating your experience moment by moment. When uncovering certain aspects of your own consciousness, this unlocks new perceptual worlds and new potentials. Remember, it is the <strong style=\"\">EXPERIENCE</strong> you&#039;re after, not just intellectual candy.</p>", 
    "end_date": null, 
    "title": "5 Jedi Mind Hacks: A Step By Step Mind Training Course", 
    "price": "20.00", 
    "instructors": "Michellion Narksusook", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592286_884e.jpg", 
    "course_url": "https://www.udemy.com/5-jedi-mind-hacks-a-step-by-step-mind-training-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T22:08:02Z"
}