{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t       In this course you will begin creating your own life blueprint of a more fulfilling life that feels right to you. There is also a bonus section created to inspire you to enjoy your life and live it to the fullest.  </p>  <p>  \t<strong>Begin creating the life that you want by using the 5 step R-E-N-E-W method.</strong>  </p>  <ul>  \t<li>Find your      individualized order of importance for the components of your life</li>  \t<li>Create the      vision for the life that you want</li>  \t<li>Recognize how      your beliefs affect the results that you have in life</li>  \t<li>Create specific steps toward your goal</li>  \t<li>Create a plan to overcome the obstacles that have been preventing you      from achieving your goals</li>  \t<li>Learn how      to adjust your steps if necessary</li>  \t<li>And      more...</li>  </ul>  <p>  \t<strong>Move away from feeling that something is missing from your life toward feeling very fulfilled in your life.</strong>  </p>  <p>  \t    There are so many reports of people feeling unhappy with their lives. There are large numbers of dissatisfaction with jobs and careers. Divorce rates are very high indicating that relationships are no longer fulfilling. As a Certified Professional life coach, knowing that there is so much dissatisfaction in people&#039;s lives is very discouraging. This course is designed to assist you in becoming purposeful in creating what you want in the area of life that you choose. You will be guided through 5 specific steps to assist you to focus on how to make the changes that you want.  </p>  <p>  \t    Content and Overview  </p>  <p>  \t    I designed this course to be easily understood so that anyone can begin to make changes in their lives. It consists of 2 sections and 11 lectures including the Bonus section and comes complete with a downloadable workbook so that you can easily follow along with each lecture. You will walk away with a blueprint to re-create or transform the area of your life that you choose.  </p>  <p>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "5 Steps to Create the Life You Want", 
    "price": "20.00", 
    "instructors": "Michele Spearman", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/326730_e188_3.jpg", 
    "course_url": "https://www.udemy.com/5-steps-to-create-the-life-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-24T23:15:40Z"
}