{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"> Success is easier when you know where you are going.</strong>  </p>  <p style=\"\">  \t We believe that everybody has it within them to achieve greatness and be successful. We have the Power to Choose the way we want to live our lives. Our CHOICES enable us to CREATE the reality of our Visions. By engaging in positive and creative thinking we are able shape the roadmap that can lead us to the life that we want. This course provides you with a practical framework for creative and innovative thinking to help you move from where you are to where you want to be.  </p>  <p style=\"\">  \t 7 Steps: Vision to Action online coaching is designed to provide you with a sounding board to get your ideas out, a system of accountability and a practical plan to achieving your dreams no matter how big or small. In fact the bigger your dream the better.  </p>  <p style=\"\">  \t The course is broken into 7 Steps, each one is sequential and allows you to piece together a workable plan to turn your vision into reality. Within each step there are a number of exercises that you are required to complete before moving to the next step. This course is accompanied with a downloadable Journey Map for you to complete all the exercises. The course has been structured with a motivational coaching style with one goal in mind – move you from vision to action!  </p>  <p style=\"\">  \t All successful people have personal development gurus and coaches pushing them to achieve peak performance and challenging their creative thinking abilities. This course is no different! 7 Steps: Vision to Action coaching is an affordable, no non-sense coaching course for the people that want their lives to work. This course is for the people that are motivated to make their lives work, it’s aimed at the people that know there is more to life than what they currently have. If you want more from life this course is for you. If you want to change your circumstances and create the opportunities that will enable you to live the life of your dreams this course is for you. Most of the exercises will take at least 30 minutes to 1 hour to complete (variable from person to person).  </p>  <p style=\"\">  \t This course is not for the feint hearted. It requires you to invest time into creating your own journey map to success and follow up your plan with ACTION!  </p>  <p style=\"\">  \t “Every great business was once an idea, every man was once a baby and every pro was once an amateur. We shouldn’t wait for perfection to start something new, we should start and work towards perfection.” ~ Terry Igharoro  </p>  <p style=\"\">  \t Are you living the life of your dreams already?  </p>  <p style=\"\">  \t Do you know where you want to go?  </p>  <p style=\"\">  \t Do you have a practical and workable plan to get there?  </p>  <p style=\"\">  \t 7 Steps: Vision to Action will help you move from where you are to where you want to be and help you discover how to turn your vision into reality.  </p>", 
    "end_date": null, 
    "title": "7 Steps: Vision to Action", 
    "price": "35.00", 
    "instructors": "Terry Igharoro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42138_3e3a_5.jpg", 
    "course_url": "https://www.udemy.com/7-steps-vision-to-action/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-17T23:13:15Z"
}