{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tThe renowned artist Michelangelo.  </p>  <p style=\"\">  \tThe corporate mogul Martha Stewart.  </p>  <p style=\"\">  \tWhat do a historical figure and a contemporary entrepreneur have in common?  </p>  <p style=\"\">  \tEssentially, they attained their success by following the Timeless Success Principles. Specifically, 8 Success Principles.  </p>  <p style=\"\">  \tEduLifeVantage brings you 8 Timeless Success Principles, a series of Lectures aimed to grant you the same - or perhaps even greater - success that such personalities have enjoyed over the years, simply by learning and applying the Principles.  </p>  <p style=\"\">  \t“The Power Of Passion” explores the first Principle: Passion. Passion is crucial because it begins your rewarding journey to success.  </p>  <p style=\"\">  \tOnce you have passion, “The Work Of Love” lays the foundation to work towards the finale of success. We will look at how to work smart and achieve more at the same time.  </p>  <p style=\"\">  \t“Focus And Move Mountains” will explore the facets of focus, which is necessary for positive results to be seen.  </p>  <p style=\"\">  \tMeanwhile, it is important to “Push Yourself” to accomplish the goals and milestones, and this can be carried out with discipline and persistence.  </p>  <p style=\"\">  \t“Life-Changing Ideas” looks at how creativity can be used to transform the passion into profits and success.  </p>  <p style=\"\">  \tAfter success is achieved, it does not stop there. It is imperative to always “Improve And Excel”, the main reason being the advent of new technology and services etc. Otherwise your work – or business – risks becoming stagnant.  </p>  <p style=\"\">  \t“Serve The World” is another vital attribute to cultivate. In fact, some successful people get rich by serving others!  </p>  <p style=\"\">  \tNow, it&#039;s important to remember that the most successful people in the world didn&#039;t achieve their success the first time they set out to make a name for themselves.  </p>  <p style=\"\">  \tIn fact, many failed time and time again before emerging triumphant over adversity.  </p>  <p style=\"\">  \tIt&#039;s alright to stumble and fall. What matters at the end of the day is how you pick yourself up and dust yourself off before trying again. &quot;Persist And Succeed!&quot; will provide you the exact strategies that help you do just that.  </p>  <p style=\"\">  \tIt may be easy to learn about these 8 Principles here, but it takes much more effort and the determination to put all these into action. But you will know it’s worth it when you finally realize the dream you always desired!  </p>", 
    "end_date": null, 
    "title": "8 Timeless Success Principles", 
    "price": "35.00", 
    "instructors": "Edu Life Vantage", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/352630_33a4_5.jpg", 
    "course_url": "https://www.udemy.com/8-timeless-success-principles/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-21T05:27:09Z"
}