{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>Do you want to make powerful resolutions for 2015 and actually make them happen? Do you make resolutions and never follow through? Or, do you make them and wish they were stronger?</span>  </p>  <p>  \tMost people are psychologically programmed to fail with their New Year&#039;s resolutions. And unfortunately, those failing programs do drift over &quot;a little bit&quot; for some to &quot;a lot&quot; for others into all success planning.  </p>  <p>  \tThis is about a &quot;New Year&#039;s Revolution&quot; where you will turn normal goal setting behavior into an unstoppable Goal Keeping Mind Set program for you, your life, and teach it to your loved ones and your business! You will come out of this course knowing how truly powerful and capable you really are! You will KNOW the Nine Steps to consciously design and create a compelling and commanding life!  </p>  <p>  \tThis is unlike any goal setting or New Year’s resolution course you have seen before. You will be examining your current psychology in a practical and common sense way to see where you struggle and keeping goals. You’ll experience cutting edge neuroscience on how our minds work, while learning tools to change the way you think. The nine step process is a proven framework for achieving goals, and you will never set goals the same way again. Model the strategies of the most successful people in the world use to create success in any area of your life (health, money, love, etc.).  </p>  <p>  \tJoin William Sumner (author, internationally sought-after speaker, and recognized leadership expert in coaching technologies) as he introduces you to The Inevitable You® coaching system which has helped thousands make transformations in their personal and business lives.  </p>", 
    "end_date": null, 
    "title": "9 Step Process for Successful Goal Setting", 
    "price": "50.00", 
    "instructors": "William Sumner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375870_0cf1_2.jpg", 
    "course_url": "https://www.udemy.com/new-year-revolution/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T21:39:04Z"
}