{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> Hi, I'm about to show you...<br><br>How to become as successful as the millionaires, inventors and achievers of our world.<br></p><p><strong>With no fluff.</strong> </p><p>and a powerful blueprint.</p><p>You may not understand how that's possible right now, but in a few short weeks, and with a little dedication, you will have all the tools to transform yourself into anything you desire.</p><p>You don't have to be an incredibly intelligent.</p><p>You don't have to be loaded with money.</p><p>You don't have to be multi-talented. </p><p>Far from it. <br><br>No matter what condition you are in and  no matter what you are experiencing.<br></p><p><strong>You are capable of learning and developing the skill-set to revolutionize your whole life.</strong><br><br>There is one caveat though. You have to desire the change, you have to put in the time, daily, to reflect and practice. </p><p>That's it. A small amount of time daily, and you can make your dreams a reality.<br><br>I've spent the last two and a half years researching and dedicating myself to discovering what helps people rise so quickly and effectively. I was not content with the stories of people who 'just got lucky'. I desired to get to the bottom of this mystery that made certain people successful with ease. </p><p><strong>Finally, I'm ready to share what I've discovered with you. </strong><br><br>What I've discovered is woven into an easy to understand structure that will seamlessly be imprinted into your mind for use at any time, any where. </p><p>Through the fields of Philosophy, Psychology, Biology and Physics, I will be taking you on a journey of discovering your incredible potential.  </p><p>Even after creating the video series of 22 core lectures, I desired to give you more bang for your buck, so I've included specially written articles, unique to this course, for you as well. I wanted you to comprehend this information on as many levels as possible. Further, I've provided guided meditations and exercises for each week.  </p><p>Through the four chapters, each a week long, you will build a foundation for happiness, growth and success.<br><br>This information will work for you; it has worked for every individual who has risen to incredible heights. </p><p>All you need to do is begin.</p><p><em>Are you ready?</em><br><br></p>", 
    "end_date": null, 
    "title": "A Foundation for Growth, Happiness and Success", 
    "price": "20.00", 
    "instructors": "Mustansir Ameerali", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/596424_20d8.jpg", 
    "course_url": "https://www.udemy.com/a-foundation-for-growth-happiness-and-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-29T01:52:21Z"
}