{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><b>Está cansado de fracassar?</b></p><p>Não é incomum nos dias de hoje ver pessoas frustradas. Por mais que lutem, simplesmente não conseguem concretizar os seus objectivos. Se você continua a batalhar e simplesmente não consegue obter os resultados esperados, não está sozinho.</p><p><b>São milhares de ideias e sonhos que todos os dias ficam arrumados numa gaveta.</b></p><p>O sucesso chega a muitas pessoas sem esforço. Mas então o que é que as pessoas de sucesso sabem que a maioria das pessoas desconhece? Se procura este conhecimento, chegou ao local certo.</p><p>No curso “A Matriz do Sucesso\" aprenderá o passo-a-passo necessário para que possa transformar por completo a sua vida. Foi esta mesma fórmula que me permitiu somar muitas vitórias ao longo da minha vida no campo pessoal e profissional.</p><p><b>Se procura concretizar todos os seus sonhos, neste poderoso curso encontrará todas as ferramentas necessárias para despertar o guerreiro que existe dentro de si.</b></p><p>Comece com uma ideia e termine com algo real, este é o meu compromisso para consigo!</p><p>No curso encontrará aulas em vídeo, apresentações, áudios, documentos e exercícios vários que facilitarão a aprendizagem. Trata-se de um curso semelhante a um programa de desenvolvimento humano e que poderá ver e rever sempre que desejar.</p><p><strong>Está preparado para começar a sua escalada do sucesso e romper todos os seus limites?</strong></p>", 
    "end_date": null, 
    "title": "A Matriz do Sucesso", 
    "price": "50.00", 
    "instructors": "Luis Alves", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389978_dd9c_5.jpg", 
    "course_url": "https://www.udemy.com/amatrizdosucesso/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T01:11:07Z"
}