{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>QUESTION: Are You Closer To Living Your Dream Than You Were One Year Ago?</strong></p><p>We all claim we want to be successful. </p><p>But then weeks, months, even years go by, and we have nothing to show for it.</p><p>It DOESN'T have to be that way. </p><p>Because if you apply certain principles -- the same principles some of the world's smartest people have used -- you can achieve almost anything you want.</p><p>In this course, I'm going to share with you 8 ideas on achieving your dreams from some of those people, taken from my course 27 Life-Changing Lessons From The World's Smartest People. If you take these ideas and apply them, I think you'll make more progress toward your goals this year than you have ever before.</p><p>Here's what you'll learn inside:</p><ul><li>The difference between a goal and a <em>purpose </em>(and why the key to doing something BIG is having a purpose) [Lecture 2]</li></ul><ul><li>Why most people never get what they want...and how changing how you think can prevent the same thing from happening to you [Lecture 3]</li></ul><ul><li>What a single line in the bible can teach you about getting everything you want [Lecture 4]</li></ul><ul><li>How to \"Go Inside\" and find out what to do next to make massive progress [Lecture 5]</li></ul><ul><li>Why you should use the \"dark emotions\" to drive you to success [Lecture 6]</li></ul><ul><li>How to make achieving your goals automatic [Lecture 7]</li></ul><ul><li>What you NEED to remember to take loads of pressure \"off your back\" and enjoy the journey [Lecture 8]</li></ul><ul><li>And...how to use everything we've talked about STEP BY STEP to start making measurable progress toward your goals</li></ul><p>To start learning now, just click the \"Start Learning Now\" button.</p><p>See you inside,</p><p>Brandon</p>", 
    "end_date": null, 
    "title": "A Mini Course on Achieving Your Dreams", 
    "price": 0, 
    "instructors": "Brandon Hakim", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600402_4cac_3.jpg", 
    "course_url": "https://www.udemy.com/achieving-your-dreams/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T13:52:36Z"
}