{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Master the 5 Mindsets of Success is a succinct but power-packed course that reveals the hidden beliefs that are undermining the achievements you desperately seek. Learning and practicing these 5 Mindsets  to your life, will transform the way you think and live. This course is specifically designed for students, like you, who recognize that \"changing how they think\" is the key to achieving their dreams. Each of the lectures come with a thorough outline and engaging assignments, that will challenge even the most accomplished person to rethink how they think and take their business, relationships, networth and health to the next level. </p><p>Each \"Mindset\" is a brief lecture explaining how the way we think hinders progress, why it needs to changed and how to change it. At the conclusion of each lesson, there are several pointed questions geared toward challenging the student to dig deeper. Lastly, there are \"positive \"confessions\" or \"affirmations\" that need to be repeated \"out loud\" several times a day. So, if you want to \"blow your mind\" and begin transforming your life, this course is for you. It's short, just over an hour, but will challenge you think differently. As the old adage reminds us, \"as a he thinks in his heart, so is he...\" (Proverbs 23:7).</p>", 
    "end_date": null, 
    "title": "Achieve Your Dreams: Master the 5 Mindsets of Success", 
    "price": "35.00", 
    "instructors": "Jeffery A. Williams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576988_63e7_3.jpg", 
    "course_url": "https://www.udemy.com/master-the-5-mindsets-of-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T00:27:12Z"
}