{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong>  What others are saying about the course:  </strong>  </p>  <p>  \t <em>&quot;What a wonderful course. I found the instructor taking me back through different stages of my life and focusing in on key factors is essential in moving forward. Choices we make based on our mindset affect everything. Therefore, focusing more on the aspects that lead to growth and positive action is the way to go!! I also like how he was in a relaxed environment while delivering the message. It created the scene for letting go and charting a new beginning. I would definitely recommend this course to friends.&quot;</em>  </p>  <p>  \t <em>The title of this course,&quot;Achieve a Growth Mindset Today&quot; spoke directly to the course in life that I find myself. Looking to learn and apply clear and simple techniques to enhance living and learning on a daily basis. Aaron Howell has put together a description and guide to getting it all together to have a healthy, satisfying and productive day by applying simple proven practices in the form of routines. He made it clear to me that simple routines become habits that make for successful days. He presents it like he is walking the talk with solid confidence and assurance. His suggestions for morning and evening routines has better defined what I am doing now to get ready for a new day and close out an accomplished one. I Recommend this course to anyone who wants to get more organized and productive.</em>  </p>  <p>  \t             &quot;Achieve a Growth Mindset Today&quot; is a course designed for those looking to make a change. Whether you&#039;re somebody looking for a career change, one with anxiety and/or depression seeking relief, or you&#039;re just ready for a total personal transformation, this course was designed for you.  </p>  <p>  \t         It&#039;s a course designed to reshape the way you see the world. After 21 lectures, you will be able to formulate daily habits that you can sustain around your lifestyle. These habits are the same ones successful people like Oprah Winfrey, Walt Disney, and Albert Einstein have all used. They will allow you to communicate with your subconscious daily so as to move it into alignment with your conscious mind and body. This alignment is only the beginning of the transformation for your life. The more you practice alignment by upholding the abundance mindset, the more you&#039;ll recognize the amount of possibility and control you have over your own life. Life will cease to pass you by, and you&#039;ll be able to live it each and every day.  </p>  <p>  \t         You&#039;ll get to know who the real &quot;you&quot; is. Once you&#039;re able to locate your true being within, you&#039;ll be able to form a path that will lead you to your most desired destination in life.  </p>  <p>  \t         You will also learn to exchange negative habits for more beneficial ones.  </p>  <p>  \t         You&#039;ll also learn about resilience and how imperative it is to not lose focus of the goals you have placed before you. You will make setbacks a thing of the past by controlling the responses you have towards it.  </p>  <p>  \t         And finally, by committing to this course, you might also discover some of the more hidden talents and benefits of your character within.  </p>  <p>  \t         I&#039;ll be here every step of the way to ensure you have a great course experience. Any questions and support needed will be answered promptly.  </p>  <p>  \t         So please, join me today as we embark on this journey of inner discovery that lies at your doorstep. I look forward to seeing you in the digital classroom.  </p>", 
    "end_date": null, 
    "title": "Achieve a Growth Mindset Today", 
    "price": "20.00", 
    "instructors": "Aaron Howell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/252642_fb8b_2.jpg", 
    "course_url": "https://www.udemy.com/reshape-your-mind-change-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-29T14:48:46Z"
}