{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t   This course delivers a very simple 5-stage process to help you set and achieve goals.  We will help you to change your mindset, to begin believing that you are capable and deserve to live a dream lifestyle.  We&#039;ll teach you to take time to congratulate yourself for every success and how to stay motivate during the journey.  </p>  <p>  \t  It&#039;s all video, during the learning phase, with just a little bit of written work for you to do yourself.  This isn&#039;t a get rich quick program, but it is a get rich program!  </p>  <p>  \t  You might be surprised what &quot;Get Rich&quot; means to you by the time you&#039;ve gone through the program.  If you&#039;ve spent all your time believing that money is going to make everything OK, then you might just have been focussing on the wrong thing all this time!  </p>  <p>  \t  So, take this course and learn that your dream life might be something quite different.  When you find it, the money you need will come along.  And money might just take on a whole different meaning, when you&#039;re living your dream life!  </p>  <p>  \t<strong>   Who is this course for?:</strong>  </p>  <ul>  \t<li>So, if you have tried to set goals before and failed, we&#039;ll help you to stay on track.</li>  \t<li>If you&#039;ve never tried goal-setting before, we&#039;ll help you get started.</li>  \t<li>This course is for all those of you who feel you have more to give in this life.</li>  \t<li>This course is for all those of you who want to get more our of life.</li>  \t<li>This is for those of you who really want to <strong>LIVE LIFE!</strong></li>  </ul>  <p>  \t<strong>How long is the course?</strong>  </p>  <ul>  \t<li><strong>The course is less than 50 minutes long!</strong></li>  </ul>  <p>  \t  I find it easy to get distracted, so I need everything in short, bite-size pieces!  That&#039;s exactly what this course gives you.  </p>  <p>  \t<strong>How is the course structured?</strong>  </p>  <ul>  \t<li>Again, I find that I an&#039;t concentrate if I have to read lots of material, so this course is ALL VIDEO!</li>  \t<li>Of course, there are some exercises and a few templates to fill in that will take you a little longer, but I hope they&#039;ll be fun and so the time just won&#039;t matter!</li>  </ul>  <p>  \t<strong>So, why take this course?</strong>  </p>  <ul>  \t<li>Well, this course is  for anyone that struggles to stay committed to a long-term project, but really wants to break out of the cycle of &#039;work - to - live, live - to -work&#039;.</li>  \t<li>This course can help those of you who aren&#039;t always very structured</li>  \t<li>This is a course for those of you who want to get a dream life, but just aren&#039;t sure exactly how to get started!</li>  </ul>", 
    "end_date": null, 
    "title": "Achieve Your Goals - Achieve Your Dreams!", 
    "price": "20.00", 
    "instructors": "Graham Wadsworth", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353852_3d40_7.jpg", 
    "course_url": "https://www.udemy.com/achieve-your-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T16:11:13Z"
}