{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">You may have been trying for a really long time to find the place within where miracles become an everyday occurrence so you can step into your greatest potential and access all of your longest held dreams, desires, and wishes.</p><p style=\"\">I have learned through over 20 years of research, study, and practice how to turn my life into a life where miracles surround me every day. I have learned how to tap into my own inner abundance to create what I call Miracle Consciousness.</p><p style=\"\">I would love to share with you what I have learned so you can turn your life into one that generates miracles everyday.</p><p style=\"\">In this course you will learn how to activate your Miracle Consciousness in an easy to follow step-by-step process. Once you understand how to embody your own Miracle Consciousness, you will never look outside of yourself again to bring anything into your life.</p><p style=\"\"> You will manifest things with ease and grace and be living a joyful life always.</p><p style=\"\"><br></p> <p style=\"\"><strong>“You Have the Power to Tap Into Your Inner Reserves of Abundance\"</strong></p><p style=\"\"><strong><br></strong></p><p style=\"\">This course is taught in an easy to understand step-by-step video format that will guide you to the place within that all your miracles stem from.</p><p style=\"\"><br></p><p style=\"\"><span><strong>“Create a Magical Life with Ease\"</strong></span><br></p><ul><li>Manifest things you have been wanting for a really long time</li><li>Step into your greatest potential</li><li>Live in freedom, passion, happiness, and joy everyday</li><li>Tap into your inner abundance</li><li>Make your outer life reflect your new inner state</li><li>Continue building the energy of your creation</li><li>Magnetize with your heart energy</li><li>Move through uncomfortable emotions with ease</li><li>Have an inner foundation on which you can always rely</li></ul><p style=\"\"><br></p>", 
    "end_date": null, 
    "title": "Activate Your Miracle Consciousness", 
    "price": "20.00", 
    "instructors": "Angelica King", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594212_2bf2_5.jpg", 
    "course_url": "https://www.udemy.com/activate-your-miracle-consciousness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T17:38:22Z"
}