{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Why does the Addiction Freedom program work?</p><p>If you have failed at rehab, cold turkey and 12 steps, what now?</p><p>I’m Wendi Friesen and for years I have had amazing success with \naddicts who are struggling. For over 15 years I have worked with clients\n using methods that change the way people think and create power and \nconfidence in being the person they want to be.</p><p>I know about addiction personally. My son, who is now 25, has been an\n opiate addict for years. He has been in and out of jail and rehab and \nas a result I have learned first hand why most drug, alcohol, gambling \nand other addiction programs simply don’t work.</p><p>Drug and Alcohol rehabs have an amazingly low success rate, less than\n 10%! They are expensive and are failing our addicts. It is not really \ntheir fault. They are using the only method they have in most cases. \nThey drive you to AA meetings, feed you substandard food and make you \nspend hours reading the Big Book. AA was created in the 1930′s. Most \nrehab methods are using the 12 step program created by AA and even \nthough they know it is not working, they have virtually no other \nalternatives. We are living in a time where there are many discoveries \nabout how the brain works and the amazing transformational methods of \nhelping people to focus and direct their mind to have the feelings and \nthoughts they want. It is a shame that this is not the FIRST course of \ntreatment for addiction.</p><p>Hypnosis and NLP are very powerful and effective for many issues, if \nused properly. As an addict, you must change the way your brain is \nreacting and responding to your environment, your compulsive thoughts, \nthe triggers, the emotional pain, the stress and so many life events. If\n you don’t change the way your brain responds, you are going to continue\n to have the same struggles with addiction even years after being clean.</p><p>This is a science based approach to completely change<em> the way the brain responds</em> to addiction triggers.</p><p>When you release the subconscious responses, the brain changes the way it reacts and suddenly you realize that <em>you are </em>in control.</p><p>Are you ready to quit drinking without 12 steps? </p><p> Are you struggling \nwith Drug Addiction? </p><p>Are you clean and sober, but still scared of \nrelapse? </p><p>Never Relapse Again! The results are simply amazing!<br></p>", 
    "end_date": null, 
    "title": "Addiction Freedom- Never Relapse Again", 
    "price": "20.00", 
    "instructors": "Wendi Friesen", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/694294_439e_2.jpg", 
    "course_url": "https://www.udemy.com/addiction-freedom-wendi/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-10T20:40:04Z"
}