{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Did you know that anger causes high blood pressure and potential heart issues?</strong>  </p>  <p>  \t<strong style=\"\">Want a simple way to dump the anger and become more healthy?</strong>  </p>  <p>  \t  For as long as I could remember I was an angry person who blamed everyone else for my misfortune. My health suffered and my relationships hit an all time low.  </p>  <p>  \t  My anger over the years was like drinking poison and expecting everyone else to die. I was sabotaging myself and all because I felt that I was in the wrong and needed to punish myself.  </p>  <p>  \t  If this sounds like you, this course will give you the tolls to overcome anger issues.  </p>  <p>  \t  10 years ago I discovered EFT Tapping, a simple method of tapping acupuncture points around the body and I found instant relief from my negative emotions naturally.  </p>  <p>  \t  During this video course I will teach students how to use this technique to take control of their anger and release the root causes. Each video on this course demonstrates how to use the EFT Tapping and all you have to do is follow along with me, it couldn&#039;t be simpler!  </p>  <p>  \t  Step by step I will show you have to change your thoughts so you can break free from anger and resentment forever.  </p>  <p>  \t  This means you will naturally become more confident in yourself and become a lot calmer in yourself, more chilled with life. Your personal relations will also benefit as you start to see yourself and others differently.  </p>  <p>  \t  This course is not designed to replace any medical treatment and always consult with your doctor if you have any concerns.  </p>  <p>  \t  So who&#039;s in control... you are your anger?  </p>  <p>  \t<strong style=\"\">Join today and I will show you how to release anger and become more confident in yourself. Hit that button you&#039;ll be glad you did!</strong>  </p>", 
    "end_date": null, 
    "title": "Anger Management: Identify & Release Root Causes Of Rage", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/338542_11d3_7.jpg", 
    "course_url": "https://www.udemy.com/how-i-dumped-anger-resentment-easily-and-how-you-can-too/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-07T15:25:33Z"
}