{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>After <strong style=\"\">watching the promo video</strong>, you will learn that this course will help you to <strong style=\"\">pinpoint your challenge areas in your cycle of anger</strong> and through the information shared, you will be able to develop a plan for SUCCESS. </p><p>Starting with a complete overview of the all-new Emotional Cycle®, this 8-part system goes through each part in-depth and it shows you exactly what happens from the onset of your anger all the way through until the cycle repeats itself. This section <em style=\"\">alone</em> will give you everything that you need to <strong style=\"\">start overcoming your anger</strong> and stop the cycle from happening completely!</p><p>But, it doesn&#039;t stop there. This section concludes with tasks that are designed to help you identify where you have challenges within your cycle, why you have those challenges, and the types of physical and emotional experiences that you have as a result of your anger.</p><p>Section two teaches you about<strong style=\"\"> why change is hard </strong>and it begins with an explanation about the constant struggle that happens between your mind and your emotions. When your emotions and your mind are not working in tandem, it&#039;s generally your emotions that are in control of your decisions and unfortunately, they are what lead you through the emotional cycle. This section will teach you how to get your thinking, your emotions, and your environment in line with each other because together, those three aspects will maximize your success.</p><p>The final section for this course gives you the <strong style=\"\">steps for an action plan</strong>. The plan is purposefully designed to be simple and easy to implement. Just keep in mind that real change takes consistency and practice. If you take the time to put the plan in place and you consistently work on the plan, then this system will work for you!</p>", 
    "end_date": null, 
    "title": "Anger Management Basics-The Cycle The Change The Action Plan", 
    "price": "35.00", 
    "instructors": "Temeca Richardson, Ed.D.", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585962_8ee4_2.jpg", 
    "course_url": "https://www.udemy.com/angermanagementsystem/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T01:34:06Z"
}