{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course you will learn how to use Animal Reiki; a simple, non-invasive alternative therapy to help animals balance on physical, mental/emotional, and energetic levels.</p>\n\n<p><strong class=\"redactor-inline-converted\">Learn how to connect with animals so that you can help them to heal.</strong></p>\n\n\n\n<p>Learn how to perform Reiki on all animals of all sizes</p>\n\n\n\n<p>Learn how to perform Reiki on yourself</p>\n\n\n\n<p>Create a mental space where you can access your intuition and communicate with animals</p>\n\n\n\n<p>Receive distance attunements to align you to Reiki energy</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Use Reiki to improve your life and the lives of animals</strong></p>\n\n\n\n<p>Reiki is an alternative therapy that originated in Japan in the late 1800's and is performed in private practices and hospitals around the world. It is easy to learn and non-invasive and creates balance so that healing can occur on all levels as determined by the body and mind of the recipient.</p>\n\n\n\n<p>Animals are very sensitive to energy and love receiving Reiki energy. You can perform effective Reiki sessions with animals using hands on methods or from a distance. This non-invasive therapy makes it ideal for working with all kinds of animals, from domestic pets to wildlife.</p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>This course will benefit you if you are new to Reiki or an experienced practitioner wanting to learn about working with animals. This course has 30 lectures including handouts and learning activities.</p>\n\n<p>You  will be introduced to Reiki and the history of it's founders. You will learn how you can perform Reiki sessions on yourself with a focus on healing and balancing. You will learn about the sacred Reiki symbols and how to use them in your sessions. You will be guided as you create a mental healing space where you can perform distance Reiki sessions on animals as well as communicate with them. This mental Reiki room can also be helpful for creating a stronger connection with your intuition and assist you when communicating with animals.</p>\n\n<p>You will learn how to conduct Animal Reiki sessions from start to finish on various animals in various locations. You will learn how to perform hands-on Animal Reiki sessions as well as how to perform Reiki with an animal from short and long distances.</p>\n\n<p>You will receive various handouts including client waivers and intake forms that you can use with your clients as well as a traditional Animal Reiki Practitioner certificate that you can use for display purposes.</p>\n\n<p>In this course, you will schedule your distance attunement ceremony with a Certified Reiki Master (Lisa Powers) and receive the 5 attunements to align you with Reiki energy so that you can perform effective sessions on yourself and animals.</p>\n\n<p>Reiki can be a powerful tool to heighten self-awareness as well as healing. You will learn how you can use this amazing practice to help yourself and the lives of animals.</p><p><strong>Important Note:</strong></p>\n\n\n\n<p>Students who wish to receive certification in this course will receive attunements to Levels I, II which will require that they provide personal information (name, email) when they schedule these attunements. Note: information provided is confidential and only used for the purpose of the attunement ceremony.</p><p><br></p>", 
    "end_date": null, 
    "title": "Animal Reiki Practitioner Certification", 
    "price": "20.00", 
    "instructors": "Lisa Powers", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790970_e1b1_2.jpg", 
    "course_url": "https://www.udemy.com/animal-reiki-certification/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-13T00:01:28Z"
}