{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Is Anxiety stealing your peace? You deserve to be peaceful and happy! The aim of the course is to provide you with <strong>expert knowledge to help you understand what anxiety is, why you experience it and how you can beat it once and for all</strong>. This is done through the use of written, audio and video presentations and experiential exercises. The desired outcome is that you will finish this course feeling more in control of your anxiety and with a wealth of techniques to make sure you can keep your anxiety at bay well into the future.</p>\n\n<p>The techniques I will teach you have <strong>empirically proven effectiveness for overcoming anxiety</strong>. That means that everything in this course has been tried and tested with people suffering distress from their anxiety and has helped them to regain control and peace.</p>\n\n<p>This online self help course can be taken at your own pace and you can revisit the material as many times as you feel necessary. You can follow the lectures at times that are most convenient for you and do this in the comfort of your own home or wherever you feel most comfortable. It is an affordable and discreet way to get the help and happiness you deserve and need. </p>\n\n<p>The course designer, Dr Sonia Greenidge, is a Chartered Counselling Psychologist with years of experience of working with clients from all walks of life. This has provided her with deep insight and a practical view of the problems people are facing in contemporary times.<br></p>", 
    "end_date": null, 
    "title": "Anxiety: Beat It and Regain Peace", 
    "price": "40.00", 
    "instructors": "Dr Sonia Greenidge", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622650_be75_6.jpg", 
    "course_url": "https://www.udemy.com/beat-anxiety-and-regain-your-peace/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T23:50:34Z"
}