{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">¿Conoces El Secreto, la Ley de la Atracción o las Leyes Espirituales del Éxito? <strong style=\"\">Todas ellas se basan en un mismo principio</strong> que ha sido explicado de diferentes maneras. Esa es <strong style=\"\">la Magia</strong> de la Vida.</p><p style=\"\">Si hay cosas que no suceden como te gustaría, este curso te ayuda a averiguar por qué y cómo reorientarlo.</p><p style=\"\"><strong style=\"\">¡Aprende a hacer que las cosas sucedan</strong><strong style=\"\">!</strong></p><p style=\"\">De manera práctica, real. Basado en mi propia experiencia sobre lo que funciona y lo que no y en cómo estoy creando yo mi vida desde esa Magia.</p><p style=\"\">El curso de Introducción a la Magia es un proceso de auto-reconocimiento donde descubrirás qué implicación tienes en lo que ocurre a tu alrededor y cómo puedes influir en ello.</p><p style=\"\">Somos seres mágicos por naturaleza. Seres creadores. En este curso aprenderás a reconocer <strong style=\"\">desde dónde</strong> creas, <strong style=\"\">cómo</strong> lo haces y a <strong style=\"\">elegir</strong> de nuevo conscientemente.</p><p style=\"\">¿Conoces El Secreto o la Ley de la Atracción? Pues se basan en los principios de la Magia, que son los que rigen este Universo. ¿Quieres aprender a crear tu realidad conscientemente y de forma práctica? ¡Entonces esté es tu curso!</p><p style=\"\">Bienvenido/a a la Escuela de Magia del Bosque de Xana.</p><p style=\"\"><strong style=\"\">La Escuela de Magia</strong></p><p style=\"\">El objetivo principal de la Escuela de Magia es que te reconozcas como el Creador, la Creadora que eres.</p><p style=\"\">Este reconocimiento es un proceso personal que comienza en un punto diferente para cada persona.</p><p style=\"\">Según nuestra educación, creencias, experiencias y forma de ser, creamos un camino diferente, pero sobre las mismas bases.</p><p style=\"\">En este taller de Introducción a la Magia hacemos un repaso de todas esas bases, desde la práctica, y empiezas a reconocerte como Mago/a y todo lo que puedes hacer.</p><p style=\"\">1. El Juego Consciente</p><ul style=\"\"><li style=\"\">Realidad y Magia</li><li style=\"\">Creencias generales y personales</li><li style=\"\">Traspasar los límites</li></ul><p style=\"\">2. Mundo Mágico</p><ul style=\"\"><li style=\"\">Mundo Mágico</li><li style=\"\">Mi Personaje Mágico</li><li style=\"\">Creación Consciente</li></ul><p style=\"\">3. Arte y Expresión</p><ul style=\"\"><li style=\"\">Expresión de tu Ser Mágico</li><li style=\"\">Materialización</li></ul>", 
    "end_date": null, 
    "title": "Aprovecha la Magia de tu Vida y Haz que las Cosas Sucedan", 
    "price": "50.00", 
    "instructors": "Margarita Álvarez", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/447730_b214.jpg", 
    "course_url": "https://www.udemy.com/introduccion-a-la-magia/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-15T08:38:03Z"
}