{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Assertive People:</strong></p>  <p>  \t                                  Assertive people ask for what they want and don't cower in the face of opposition, yet don't offend others. They stand up for themselves and their own fairly and adequately, yet don't  dominate all of their interactions. They are not doormats, nor do they run over others. They think for themselves and possess confidence in their own opinions and perspectives, while respecting those of others as equally valid and valuable. They're not necessarily stubborn; they just don't cave in to pressure. They respect others and others' rights to their opinions while holding firm with their own. Assertive people understand that they are neither more nor less important than other people, and this mindset guides their interactions.  </p>  <p>  \t                                  Assertiveness is a component of communication competence -- the ability to communicate appropriately and effectively for a given situation. Thus, developing assertiveness also helps develop communication competence, and helps make you a better communicator overall.  </p><p>Causes of non-assertiveness</p><p>Social science says that your communication disposition, as either aggressive, passive, or assertive, is either a function of your DNA (nature) or your environment (nurture), or a combination of the two. In other words, this remains a bit of a mystery. So, <em>why</em> we are passive, aggressive, or assertive is not the focus of this course. In fact, we don't discuss that at all. Instead, we simply look at what communication behaviors demonstrate assertiveness, and contrast those with behaviors that demonstrate passiveness and aggressiveness.</p>  <p>  \t<strong>This Course:</strong>  </p>  <p>  \t                                  This course, grounded in communication research, presents definitions and characteristics of assertiveness along with many tips for developing assertive communication skills. Succinct lectures provide you with a lot of high quality information quickly and clearly, without droning on in repetition, respecting your time and allowing you to move quickly through the material. Sample phrases for each cluster of characteristics are offered for students to adopt and adapt as they wish in developing their own assertive communication skills. Nonverbal communication cues are discussed individually, allowing the student to focus on one specific component at a time in developing these skills. Lessons break down assertive communication into individual parts, allowing the student to more deeply understand the underlying mechanisms of what makes communication assertive and how to achieve that for him/herself. Quizzes reinforce the ability to identify assertive communication. Links to assertiveness quizzes in the Introduction allow you to ascertain the primary type of communicator you are, and help you decide whether this course is for you.  </p>  <p>  \t                          This course is intended for all passive communicators and all aggressive communicators who want to cross over into the more socially appropriate assertive communication style. Lectures include discussions of concepts as well as actual phrases you can draw from in developing your own assertive communication style. The course will take just a short time to complete, but I recommend you incorporate the tips and characteristics slowly enough to adequately internalize them. This isn't a course only in knowledge, but in altering your mindset and the way you approach situations. These aren't changes that can occur overnight.  </p>  <p>  \t<strong>Develop your own assertiveness</strong>  </p>  <p>  \t                                  Learn to assert yourself to achieve your dreams and your desires. Understand the differences between assertive communication, passive communication, and aggressive communication, and the impressions these various types of communication leave on others. Mold your communication into assertiveness with clear presentations of assertiveness characteristics, and a toolbox of ready phrases for you to use as you like in developing and practicing assertive communication. Develop your assertiveness skills and progress toward communication competence.  </p>  <p>  \t<strong>Don't delay! Start becoming more assertive today!</strong>  </p>", 
    "end_date": null, 
    "title": "Assertiveness Training: Gain Respect and Personal Power", 
    "price": "20.00", 
    "instructors": "Dr. Michele Poff, PhD", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368516_8c2d_3.jpg", 
    "course_url": "https://www.udemy.com/assertiveness-training/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T01:24:11Z"
}