{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is all about understanding cosmobiology -  a form of astrology.</p>\n\n<p>It will take you through the basics of understanding how to read the planets and astrological charts and symbols so that you can take more control over your life by understanding your own world from an astrological perspective - or help others to understand theirs.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>This course is ideal for anyone who wishes to learn how to read and interpret astrology.</p>\n\n\n\n\n\n<p>This course is delivered in the form of over 60 tutorial videos and more than 15 downloadable handouts that reference the meaning of different astrological and planetary symbols.</p>\n\n\n\n\n\n<p><strong>In this course you will learn:</strong></p>\n\n\n\n\n\n<ul><li>How to read and interpret the basic symbols, signs and meanings of astrology and the planets to better understand ourselves, our lives, our experiences and what our future may hold</li><li>Learn the basic terminology, charts and graphs used to read astrology</li><li>The basic concept the underpins the Cosmobiology approach to astrology</li><li>How to understand the narrative of who we are and the value of being able to build on our strengths and eliminate our weaknesses</li><li>The ability to be able to predict a few simple events in our life by identifying pivitol moments.</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n<p>This course is estimated to take approximately 2 hours to complete, but may take longer depending on how much time you wish to take on working through your handouts.</p>\n\n\n\n\n\n<p>Glorija has been a respected cosmobiologist for over 20 years and in this course she will use case studies and celebrities as examples to help you learn what she does best.</p>", 
    "end_date": null, 
    "title": "Astrology: An Introduction to Cosmobiology", 
    "price": "50.00", 
    "instructors": "Glorija Lawrence", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/784706_2161_2.jpg", 
    "course_url": "https://www.udemy.com/cosmobiology/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-07T06:40:00Z"
}