{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Astrology is one of the oldest activities mankind started to study in order to be able to explain some things better,</strong><strong> to understand different events in his life and ultimatly to know himself better.</strong>It's a complex and magical pseudoscience which unfortunately has been way to much denaturated by amateurs and in the last decades by newspapers, websites, TV channels, magazines and so on!</p><p><strong><em>Astrology goes much further than what you see in the daily horoscope and practicly most of the times has nothing to do with what actually happens in someone's life.</em></strong> At most, what you see in these daily horoscopes is a vague general tendency for a certain group of people represented by a zodical sign, but as I stated before, it has almost nothing to do with what actually happens.</p><p><strong>There are numerous elements, calculations and interpretations that need to be made</strong> in order to be able to figure out different things in someone's life.</p><p><strong><em>This course is adressed to all people that want to start a journey in the wonderful world of REAL ASTROLOGY and to learn the basic elements like:</em></strong></p><ul><li><strong><em>the zodiacal signs, </em></strong></li><li><strong><em>the planets, </em></strong></li><li><strong><em>the astrological houses, </em></strong></li><li><strong><em>the aspects, </em></strong></li><li><strong><em>the astral theme </em></strong></li><li><strong><em>working tehniques</em></strong></li></ul><p><strong><em></em></strong></p><p><strong><em> so that You can be able to practice and read someone's Natal Chart and Astral Theme.</em></strong></p><p><strong><em>________________________________________________________________________</em></strong></p><p><strong><em>The course was deisgned by MINERVA, an world renouned astrologer from Romania, that studies astrology for more than 25 years now, has numerous courses and classes on the subject, including MEDICAL ASTROLOGY, and also more than 5 BEST SELLING BOOKS published.</em></strong></p><p><strong><em>She is also invited in numerous TV shows and to write articles for famous publications in the domain and she has a different and unique professional approach towards astrology.</em></strong></p><p><strong><em>________________________________________________________________________</em></strong></p><p><strong><em>So, if you want to get to know those around you better, to know yourself better and to have a clearer understanding of why things are happening the way are happening around us, than this course is for you!</em></strong></p><p><strong>Press the \"Take this Course\" button right now to join us and we will see you on the inside to start your journey in the world of Astrology!</strong></p><p><strong>________________________________________________________________________</strong></p><p><strong>PS: Don't worry, you have a 30 day money back guarantee, so if there is something you don't like or you feel that you didn't learn anything useful, you can always have your money back. No risks involved for you whatsoever!</strong></p>", 
    "end_date": null, 
    "title": "Astrology - The Step-by-Step Beginner's Course", 
    "price": "20.00", 
    "instructors": "Dima Gabriela", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725844_cf59.jpg", 
    "course_url": "https://www.udemy.com/astrology-the-step-by-step-beginners-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T17:33:15Z"
}