{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course Titled </p><p><strong>Astral travel for a Hypnotic Adventure beyond the body</strong></p><p><strong><em>All Files and videos are downloadable for easier access</em></strong></p><p>How would you like to travel anywhere you wanted to without leaving the comfort of your own home and experience astral travel.</p><p>Astral travel is usually only something you can experience by practising mediation for years but now with this course and using hypnosis you can be guided on a hypnotic adventure beyond your body and beyond everyday reality.</p><p>When you move your awareness beyond your body you are still always connected to your body by a golden energy chord as it is your awareness that travels on this hypnotic adventure.</p><p>Imagine being able to float and move through walls fly and visit any land, town or country any time you wish.</p><p>Astral travel will give you a real experience of being a spiritual being having a human experience as you move to a different realm  of existence and discovery.</p><p><em><strong>What I will teach you in this course</strong></em></p><p><em>1. You will begin by creating an image in your mind of what you want so that you will know where you are going and what it may be like to astral travel.</em></p><p><em>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</em></p><p><em>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</em></p><p><em>4. Learn how you naturally resist changes even changes that can be very good for you</em></p><p><em>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</em></p><p><em>6. Learn who can and cannot be hypnotized</em></p><p><em>7. Learn how you can feel amazing any time you want to</em></p><p><em>8. Astral travel for a Hypnotic Adventure beyond the body bonus section</em></p><p><em>Angel Meditation MP3 Download</em></p><p><em>Energy Protective Bubble MP3 Download</em></p><p><em>How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from feeling great </em></p><p><em><strong>All Files and videos are downloadable for easier access</strong></em></p>", 
    "end_date": null, 
    "title": "Astral travel for a Hypnotic Adventure beyond the body", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/425328_3890.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-astral-travel-hypnotic-adventure/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-17T21:27:11Z"
}