{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course, which is taught by Jack Kornfield, a renowned Buddhist teacher and author, dives deep into Buddhist psychology so you can attain a true sense of peace and joy in your life.</p><p>Modern neuroscience has already demonstrated the immense benefits that you can derive from a consistent meditation practice. </p>\n<p>This course will show you how to use the Buddha’s meditations to awaken a loving, joyful, and compassionate heart.</p><p>Jack Kornfield combines the best of Buddhist psychology with scientific and practical information, stories, exercises, and teachings to show you how you can keep your heart open, particularly during difficult times.</p><p><strong>Awaken Your Heart with Buddhist Meditative Practices</strong></p><ul><li>Learn Various Buddhist Practices to Awaken the Heart and Mind</li><li>Shift from Negative Thoughts to Joy and Compassion</li><li>Understand the Physical, Emotional, and Spiritual Benefits of Meditation</li></ul><p><br><strong>Create a Balanced, Compassionate, and Joyful Life Using Buddha’s Teachings</strong></p><p>The lessons in this course are designed to bring ancient Buddhist teachings into the modern world.</p><p>You’ll learn practices and techniques that will help you befriend and forgive yourself, as well as others, so you can become more compassionate.</p><p>Jack Kornfield will also show you how to invoke healing and the art of transforming so you can remove sorrows from your life and awaken to courage and joy.</p><p>As you explore and implement these teachings, you’ll experience the clinical and personal benefits of a steady meditation practice that has been helping people for centuries.</p><p><strong>Contents and Overview</strong></p><p>This course contains a total of 3 sessions.</p><p>In the first session, you’ll explore common problems faced by all people, such as self-hate and judgment of others, so you can begin to transform suffering into joy. </p>\n<p>You’ll learn how a trained mind can heal you, and how the Buddhist model of awakening can replace fear, anxiety, and aggression.</p><p>After tackling the essentials of healthy living, you’ll master a loving-kindness meditation to facilitate healing on an emotional and physical level.</p><p>In session 2, you’ll dive into lessons on how to be more present in every moment, and the importance of respecting yourself and others.</p><p>To put what you’re learning into practice, you’ll move through a guided practice involving breathing with a partner. This powerful, transformative technique can be done on your own as well, and it will help you operate in a state of presence as you begin to train your mind.</p><p>Session 3 presents the Brahmaviharas, which are the Buddhist virtues of compassion, equanimity, joy, and loving-kindness.</p><p>Jack then shares how he was able to work with individuals who had experienced serious emotional, physical, mental, and sexual trauma. By following his example, you'll shift into a positive state of being while expanding your tolerance for others.</p><p>By the time you complete this course, you’ll have a thorough understanding of what you can do to transform your mind, heart, and life, and you’ll begin to feel increasingly positive the more you practice what you learn.</p>After experiencing a variety of meditative Buddhist practices, you’ll be able to nurture your spiritual growth and move into a more compassionate and loving state of being.", 
    "end_date": null, 
    "title": "Awakening a Joyful Heart with Meditation by Jack Kornfield", 
    "price": "50.00", 
    "instructors": "Sounds True, Jack Kornfield", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757550_50d1.jpg", 
    "course_url": "https://www.udemy.com/jack-kornfield/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T19:56:01Z"
}