{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is a complete practical and actionable blueprint to changing any bad habit or implementing any great habit. You'll be learning and using scientific proven methods to make the changes, and most important make them <strong>STICK</strong><strong>!</strong><br></p><p><strong>Master your Bad Habits Instead of them Mastering you, and Build Great Habits that will be your Success Cathedrals Foundations.</strong></p><ul><li>Learn the Essential Theory behind habits</li><li>Annihilate any limiting belief </li><li>Using Awareness to drastically analyze and understand your bad habit</li><li>Destroy any bad habit and changing it with a greater habit</li><li>Much More!</li></ul><p><strong>Just in case your wondering and have this question: why are habits so important?</strong></p><p>Well this could be answered with a great quote:\" We are what we repeatedly do, excellence,then is not an act but a habit\" -Aristotle. Habits seem to be the foundation for everything. You see success has always been in the grasp of the minority ever since ancient times, its something that <strong>all people want, but not all get</strong>. In this course I want to share with you the core foundation to success which is... Obviously the daily behaviors you do everyday i.e. your habits. Think about a goal or a dream as a Ferrari, we all want one, but if that  Ferrari did not have wheels well i think it would be pointless to want it. The goal is the Ferrari and the habits are the wheels. They are what make the Ferrari run in the first place.</p><p>Why are habits so important? They are the daily things and foundations, meaning that without a solid foundation a skyscraper falls, a cathedral never holds and probably the 7 wonders of the world wouldn't be standing right now. Success isn't about the big things once in a while rather the small consisten things you do that determine to make you or brake you in this chosen path. You can chose success and engineer the path to it by just strategically using great habits to your favor and annihilating does bad ones that hinder you.</p><p>We all have are bad habits but as the great peter Druker would say in Managing Oneself: \"you must remedy your bad habits\"</p><p><strong>Know that you know and have decided to change your life I would like to invite you to embark on this journey with us together. Go ahead and enroll, we are very excited to seeing you on the other side!</strong></p><p><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Bad Habits Hacks for Success and Great Habits that Stick", 
    "price": "50.00", 
    "instructors": "Hector I. Mercado Colon", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/738872_eb5e_4.jpg", 
    "course_url": "https://www.udemy.com/habit-mastery-actionable-ways-to-changing-any-bad-habit/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-23T13:28:49Z"
}