{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Be Nice and Grow famous is a course about doing things differently its aimed directly at those who would like to transform their lives: </p><ul style=\"\"><li style=\"\">It&#039;s for you if you are currently in a 9-5 with no reasonable light, prospects or well-deserved recognition at the end of the tunnel.</li><li style=\"\">It&#039;s for you if you are in a dead end job with no hope or passion.</li><li style=\"\">It&#039;s for you if you don&#039;t have money or a budget to start a transformational project.</li><li style=\"\">It&#039;s for you if you need a step by step “how to” and a guide to transform your working life</li><li style=\"\">It&#039;s for you if you need the instruction manual to transform.</li><li style=\"\">It&#039;s for you if you want to get into action, but are just not sure where to start or how to get there.</li><li style=\"\">It&#039;s for you if you know that there has got to be something better or a mission purely for you to accomplish</li></ul><p style=\"\">This course is for you and it&#039;s a little bit different…</p><p style=\"\">…It&#039;s different because its not a theoretical thesis of what could be. But it&#039;s a step by step list of actions, techniques and tools you can use to carry out a successful project and raise your profile, abilities, credibility at the same time.</p><p style=\"\">The course is delivered with simple video slides with each lecture bring backed up with lecture notes pdfs. </p><p style=\"\">As an added bonus there is a downloadable document including all the matrixes, templates and action lists referred to in the course</p>", 
    "end_date": null, 
    "title": "Be  Nice and Grow Famous", 
    "price": "20.00", 
    "instructors": "Jeff Smith", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/456076_847e_3.jpg", 
    "course_url": "https://www.udemy.com/be-nice-and-grow-famous/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T20:16:34Z"
}