{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">There&#039;s a field around you, the <strong style=\"\">AURA</strong>.  That field speaks volumes about you.  In this course we are going to explore the mysteries of the Aura including:</p><ul style=\"\"><li style=\"\">Where does it come from and how is it generated</li><li style=\"\">What is it made of</li><li style=\"\">What information does it hold about you</li><li style=\"\">What influences it, strengthens and weakens it</li><li style=\"\">The psychology of the Aura including Energy Vampirism </li><li style=\"\">The New Science (Spiritual Science) and how it relates to the Aura</li></ul><p style=\"\"><strong style=\"\">I will teach you the fine art of sensing and interpreting the subtle energies of the Aura and Chakras.  </strong></p><p style=\"\">This fascinating course is facilitated through video, audio and text.  It is highly interactive.  Included are assignments to help you perfect your Aura reading skills as well as some downloadable resources for you to keep.</p><p style=\"\">In this course I am sharing with you over 20+ years of my experience as a Reiki Master and aura reading and scientific research.  This course will help you understand the Aura, consciousness and self awareness.  You will be able to understand yourself and others on a deeper level not to mention the effects of energy games.</p><p style=\"\">If your just interested in the aura, consciousness and energy work <em style=\"\">OR</em> if you are a seasoned Holistic Practitioner this course if a <strong style=\"\">MUST</strong> for you!</p>", 
    "end_date": null, 
    "title": "Become a Aura Reader", 
    "price": "20.00", 
    "instructors": "Karen Hayhurst", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538294_480d_6.jpg", 
    "course_url": "https://www.udemy.com/become-a-aura-reader/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T22:04:01Z"
}