{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Description</strong></p><p>Reiki Healing Level I is a simple, safe, and effective healing technique that anyone can learn and practice.</p><p>This course will teach you how to give Reiki healing to yourself and others.</p><p>This course includes 10 video lectures, a Reiki Manual (pdf format) to print off, 2 bonus meditations, quizzes, practical worksheets and once you have been attuned to Reiki and completed this course you will receive a Reiki I Certificate.</p><p><strong>These are the amazing benefits of Reiki I:</strong></p><p>*  Can help you to de-stress and promote relaxation and a clear mind<br>*  Can help in reducing anxiety and depression by lifting your mood and emotions<br>*  Can assist with pain reduction in your body<br>*  Easy to use on children to help them relax and be calm<br>*  Easy to use on your pets to alleviate aliments <br>*  Can use on plants to help them grow and thrive<br>*  Can greatly assist with your spiritual growth and connection to self</p><p><strong>During this course, you will learn:</strong></p><p>*  All about Reiki and it's history<br>*  Grounding and protecting techniques<br>*  About the 7 major chakras - their functions/colours<br>*  Self healing positions<br>*  Reiki healing positions to assist you in healing others<br>*  All about Reiki Attunements</p><p><strong>Requirements of this course are:</strong></p><p><strong>*  </strong>A desire to learn all about Reiki <br>*  A commitment to healing yourself<br>*  A massage table if you intend on healing others</p><p><strong>The Target Audience of this Course:</strong></p><p>*  This course is designed for the complete beginner to someone who has knowledge of holistic therapies.  </p><p>*  It is aimed at anyone wanting to better their lives and heal parts of themselves that need healing.</p><p><br></p>", 
    "end_date": null, 
    "title": "Become a Certified Reiki I Practitioner", 
    "price": "20.00", 
    "instructors": "Danielle Rossetti", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601018_e04e_4.jpg", 
    "course_url": "https://www.udemy.com/reiki-i-distant-healing-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T02:32:00Z"
}