{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You don’t have to be good looking. You don’t have to be articulate. You don’t have to have money.\n\n  </p>\n\n<p>This course will show you how to gain the attention of others through treating them as they would like to be treated. There is no magic formula, no hidden system that will make you well liked, put you in high regard, make others feel at ease when they are in your company.\n\n  </p>\n\n\n\n<p>Today it is becoming increasingly necessary to learn English etiquette and good manners as global movement increases. This course is based on traditional values that have lead civilisation through several centuries, from the medieval days of sword carrying knights when shaking hands was a sure sign of meeting peacefully: swords were worn on the left hip and withdrawn with the right hand, by shaking hands using the right hand it was a sign of meeting in peace and putting trust in the other person (the fact that both might be hiding a knife in their left hand as a precaution was another matter!!).\n\n  </p>\n\n\n\n<p>We have all be subjected to rudeness at some time and are aware how this makes us feel not only about the situation but also about the other person whom we may feel is ignorant and selfish. This course will ensure that people do not feel this about you. \n\n  </p>\n\n\n\n<p>It is a fact that Schools for Etiquette are spring up across the world, all based on English traditions and students are drawn from all walks of live from students looking for international jobs, through to business people who need to work both in their own country or globally using internationally accepted etiquette and right up to princesses in India who want to know that they are entertaining correctly (heard on a recent BBC programme).\n\n  </p>\n\n\n\n<p>This course is a basic etiquette course that covers general situations but will give a really good grounding on how to behave in most situations. We shall be improving the course and adding new sections in an ongoing way and you will have life-long access and will be advised when changes and additions are made.\n\n  </p>\n\n\n\n<p>Mike Leahy was brought up in a time when etiquette was paramount. His family were frequent entertainers and often had stock-brokers, judges and clergymen to dinner. Their dinner parties were renowned and held in the large dining room with a roaring log fire in the winter.\n\n  </p>\n\n\n\n<p>This course will make others sit up and listen to you. Make others want you to be around. Make others have real respect for you.</p>\n\n<p><br> </p>", 
    "end_date": null, 
    "title": "Become a Magnet and Attract others", 
    "price": "20.00", 
    "instructors": "Mike Leahy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725668_be07.jpg", 
    "course_url": "https://www.udemy.com/modern-manners-maketh-man-and-woman/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T15:04:55Z"
}