{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course titled &quot; Become More Confident At Workplace Now With NLP Techniques &quot; by Pradeep Aggarwal teaches you many powerful and simple NLP and self hypnosis techniques for relaxation, stress management at workplace , not letting negativity affect your confidence and morale at workplace , removing work related fears etc. </p><p style=\"\">People who are working in a corporate whether big or small usually deal with a lot of stress and anxiety and fear of getting promoted or losing the job. Their confidence also gets affected by any negative comment by their colleague, subordinate or boss . This course is ideal for those working in a company and looking to overcome all the above mentioned issues</p><p style=\"\">This course has 6 lectures and more than 30 minutes of content </p><p style=\"\">This course includes-</p><ul style=\"\"><li style=\"\">-Introduction </li> <li style=\"\">-Relaxation Technique To Curb Work Related Stress And Tension</li> <li style=\"\">-NLP Technique To Not Let Negative Comments Affect Your Work</li> <li style=\"\">-Anchoring Technique To Gain More Confidence At Your Workplace</li> <li style=\"\">-Protecting Yourself Against De-motivating Comments Using An Imaginary Bubble</li> <li style=\"\">-Summary Of The Course</li></ul>", 
    "end_date": null, 
    "title": "Become More Confident At Workplace Now With NLP Techniques", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/485398_2e79.jpg", 
    "course_url": "https://www.udemy.com/become-more-confident-at-workplace-now-with-nlp-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-24T17:04:52Z"
}