{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Experience for yourself the idea of being a single cell in the heart of God.  </p>\n\n<p>This course reaches into the unknowable in an attempt to bring light to potentially the greatest love story the earth has ever known.  It is our hope it will inspire you receiving your soul's gift for you.  The ultimate gift of who you are to humanity.  </p>\n\n<p>It was in \"The Inner Reaches of Outer Space\" that Joseph Campbell asked the question: “What is the new mythology to be, the mythology of this unified earth as one harmonious whole?” In this 21st century, such a mythology is needed more than ever. What better mythical element could we find than the ancient concept of the <em>hieros gamos</em>, the sacred joining between god and goddess, the concept of a Sacred Marriage.</p>\n\n<p>We need a new metaphor or myth that can bring us all together in a state of cooperation rather than one of competition. We need a metaphor or myth that embraces diversity.  A marriage of the masculine and feminine elements into an integrated whole.</p>\n\n\n\n<p>That concept of marriage brings us to a meaningful metaphor for our current time, a metaphor which has been literalized in such works as Dan Brown’s \"The DaVinci Code,\" the idea of a marriage between Jesus of Nazareth and Mary Magdalene. This concept appeared in the 1970’s, in a non-fiction book written by Michael Baigent, Richard Leigh, and Henry Lincoln called \"Holy Blood, Holy Grail.\" While the book was a bestseller, it did not create any great stir, certainly not when compared to that of Brown’s work of fiction. </p>\n\n\n\n<p>It is not really important which side one is on, or whether the story might or might not be literally true. What is very important is its appearance, today, and its relevance to that need for a new myth.  In our personal research one such hieros gamos story inspires us.</p>\n\n<p>Through mystic Yael Powell, the one we know as Jesus (Jeshua) brings to humanity the truth of his life on Earth with Mary Magdalene. With deeply personal experiences never before unveiled, this story presents the ultimate model for the highest possible Twin Flame Love.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Jeshua shares with us his feelings from the very elevated viewpoint natural to him, as his life on Earth unfolds. Narrated in the first person with chapters by Mary Magdalene as well, Jeshua chronicles in detail his childhood, his passionate Love and marriage to Mary Magdalene and their travels and mission of anchoring Twin Flame Love on Earth. This story brings the awakening of the Feminine Christ for this Age. This is the Christ story as never before presented -- a deeply personal, heart-warming sharing of the highest resonance that rings true.  And, If we are blessed in this calling by the Grace of God. Then you will experience the ring of its truth for yourself in this course as well.  In Jeshua's words...</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>\"I am the one whom you know as Jeshua or Jesus. I come to you to share with you the story of my life on Earth and of my Love with my beloved Mary who was also known as the Magdalene. In the turning of this Age and the opening of the world to a greater Love, it is time for the remembrance of who you are. That is why I come.....\" Jeshua ben Joseph<br></p>", 
    "end_date": null, 
    "title": "Beyond Mortal Boundaries, Truth is Your Twin Flames Love...", 
    "price": "25.00", 
    "instructors": "Andrine & Timothy \"Atmadev\"", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840246_61b9_4.jpg", 
    "course_url": "https://www.udemy.com/twin-flames-love/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T09:27:27Z"
}