{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This unique course is taught by world-renowned Zen and Buddhist master, Thich Nhat Hanh. You’ll also be exposed to teachings by two of his senior Dharma instructors, Sister Lang Nghiem and Brother Phap Hai.<br> <br>As you move through the lectures, you’ll go on a journey that will allow you to deepen and expand your mindfulness practice. This will ultimately help you attain peace and balance in your life and relationships.<br> <br>You’ll broaden not only your understanding of mindfulness, but also your training in this important practice so you can truly embrace everything that the present moment has to offer.  <br> <br><strong class=\"redactor-inline-converted\">Deepen Your Daily Mindfulness Practice for Greater Peace<br> </strong></p>\n\n<ul><li>Learn How Mindfulness Can Enhance Your Relationships\n</li><li>Change the Way You Speak, Listen, &amp; Behave to Bring About Peace\n</li><li>Expand Your Compassion and Love for Yourself &amp; Others\n</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br>Find Balance Within Yourself and Spread Compassion to Others</strong><br>This course is designed for those who already have a foundation in mindfulness, as it will help you further hone in on your connection with your inner Self and those around you.  <br> <br>As part of your training, you’ll complete exercises and meditations in addition to listening to the lectures.<br> <br>These include journal entries to track your experience, as well as open-ended questions and those that ask you to reflect upon what you’re learning and experiencing.<br> <br><strong>Contents and Overview<br></strong>This course begins by delving into mindfulness in relationships so you can use every relationship as a means to explore compassion in deep and meaningful ways.</p>\n\n<p>You’ll uncover the ways in which you’ve been hurt by loved ones, and how your actions have hurt them. This will lead you to the concept of interbeing so you can see others for who they really are, and you’ll develop an understanding that you’re connected to everyone. </p>\n\n<p>As you deepen your mindfulness practice, you’ll uncover how to look beyond notions that create suffering. As a result, you’ll liberate yourself from seeing the world as being separate from you, and you’ll recognize that everything is part of a greater whole.</p>\n\n<p>Finally, you’ll discover that what you do, say, and consume can have consequences for loved ones and yourself. Ultimately, you’ll develop behaviors that promote peace and compassion for all.</p>\n\n<p>By accessing the Four Nutriments, an important Buddhist teaching, you’ll even start to explore the richness of life through mindfulness and the Three Doors of Liberation.</p>\n\n<p>Once you complete this course, you’ll have the tools to fully understand how mindfulness can improve your life in many ways, from your connection to your inner Self, to your relationships with others.</p>\n\n<p>You’ll have the ability to bring about positive changes in the way you speak and behave daily, thereby enhancing peace and compassion everywhere you go.</p><p>  \t</p><p>  </p>", 
    "end_date": null, 
    "title": "Body and Mind are One by Thích Nhất Hạnh, Part 2", 
    "price": "50.00", 
    "instructors": "Sounds True, Thích Nhất Hạnh", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796130_d707_3.jpg", 
    "course_url": "https://www.udemy.com/body-and-mind-are-one-by-thich-nhat-hanh-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T18:58:00Z"
}