{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Take Your Personal Development To The Next Level With This Breakthrough Self-Help Process. </strong></p><p>In less than 60 minutes you will have the single most powerful, SuperFast and direct self-help personal development system. By discovering this process and using it daily you will be able to remove self-doubt, fears, anxieties and phobias and change how you react to people who ordinarily challenge you. You'll become more confident, more compassionate, more accepting and <strong>ALL</strong> naturally. You Will start to Feel You Can do anything. This is a HUGE shift in a short space of time. How Do I Know? I've followed this and so have many others before you. </p><p>To my knowledge there isn't anything else out there like this. This starts where everything else leaves you. <strong>Brene' Brown (I love Brene') </strong>speaks of Vulnerability but how do you really achieve that? You Will Discover How to <strong>Remove Shame for Good.</strong></p><p><strong>Bruce Lee</strong> was the earliest influence on me and these words changed my life. <strong>\"The Ultimate Knowedge is Self-Knowledge\"</strong>. I would now go a touch further and say <strong>Self-Liberation</strong><strong> is</strong>.  To Know How To Free Yourself From Your Emotional Constraints that limit where you go in life. To have the courage to express yourself honestly and remove the deep feelings we all have. Asking ourselves - \"Am I Good Enough &amp; Worthy\"?!</p><ul><li>To Have 'No Limitation' as Limitiation! </li><li>Willing is Not Enough, We Must Do! </li><li>Knowledge is Not Enough, We Must Apply! </li></ul><p>Does this describe you or who you strive to be? Do you want to BE MORE but feel you have invisible shackles holding you back? Or do you just want to feel happier and remove anxiety and stress from your daily without needing a masters degree?</p><p>There is nothing truer - the only change ever needed is on the inside! I want to be the best I can be and this has accelerated my results. In 3 months it's achieved more than 9 years and $1000's in therapy! If you are like me then I urge you the most....take this course and come with me. </p>", 
    "end_date": null, 
    "title": "Boxes Begone - R.E.A.L. Self-Mastery SuperFast", 
    "price": "50.00", 
    "instructors": "Jay Roberts", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546764_3a57_2.jpg", 
    "course_url": "https://www.udemy.com/boxes-begone-real-self-mastery-superfast/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T14:56:35Z"
}