{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\">Bring Sustainable Happiness to Life!</em> <strong class=\"redactor-inline-converted\">takes you on a journey to discover how you can bring sustainable happiness into your life, how to change patterns and habits that are not beneficial to you, and how to make daily choices that bring greater well-being to your world</strong>. A combination of<em><strong> 40 lectures</strong></em> and more than <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">15 learning applications</em></strong> will bring new insights about how your happiness and well-being are intertwined with other people and our natural environment. Taught by Dr. Catherine O’Brien, professor and author of <em class=\"redactor-inline-converted\">Education for Sustainable Happiness and Well-Being</em>.\n\n  </p>\n\n\n\n<p>Many courses about happiness focus on individual happiness, but there is so much more to happiness. It’s about you, your family, friends, neighbors, co-workers and countless other interconnections. Every day, you are making choices that contribute to (or detract from) your happiness and well-being. We will explore how these choices can lead to greater happiness and well-being for you, for others, and create healthy, livable communities. Sustainable happiness is about sustaining your happiness but it is also about happiness that contributes to the well-being of others and nature. \n\n  </p>\n\n\n\n\n\n<p>If you are interested in increasing your life satisfaction, gaining more control over your life choices, being more mindful, and broadening your understanding of happiness and well-being then you will enjoy this course. You will have the greatest benefit from the course if you complete the learning applications that are designed to deepen your learning.</p>", 
    "end_date": null, 
    "title": "Bring Sustainable Happiness to Life!", 
    "price": "50.00", 
    "instructors": "Dr. Catherine O'Brien", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/806444_6fde.jpg", 
    "course_url": "https://www.udemy.com/bring-sustainable-happiness-to-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-28T19:02:52Z"
}