{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><br></p>\n\n<p><strong>If you're like the thousands I've spoken to over the years, you're probably an extremely hard worker-but you aren't satisfied with the results. You may have tried goal-setting exercises, workshops, or courses and left feeling inspired and excited, but ultimately didn't meet the goals you wanted to reach.</strong></p>\n\n<p><strong>While it may seem odd to think, but this course isn't designed to \"teach\" you anything. This course has a far more important goal. My objective is to inspire you to actually change your behavior and then provide you with proven tactics, systems, and templates to make sure it happens.</strong></p>\n\n<p><strong>In this course, you'll find detailed answers to the following questions:</strong></p>\n\n<ol><li>Why is it so important to reconsider your definition of success prior to setting any goal?</li><li>How should you define success?</li><li>How can I develop goals that I will actually achieve?</li><li>What are the best strategies to stay focused and maintain momentum while working towards my goal?</li></ol>\n\n<p>Each of these answers is supported by a workbook that will guide you through a set of simple exercises designed to get your mind in the right place. These exercises build upon one another to ensure that you aren't just motivated - you've actually made measurable progress!</p>\n\n<p><em><strong>I've taught this course to more than 1,000 students over the last 5 years and every time I've offered the exact same guarantee- If for any reason this course doesn't change the way you think about life AND inspire you change your behavior, I will refund your money- no questions asked.</strong></em></p>\n\n<p><strong>What previous students are saying...</strong></p>\n\n<p><em>\"This course helped shape my attention to my work and my life\nin a way that not only defined my goals but kept me moving towards them\n(consciously and unconsciously) until I had accomplished them all.</em><em>\"</em></p>\n\n<p><em>\"Attending this course is like going to a revival, it reminds\nyou of why you started your business, brings clarity to your work and leaves\nyou with renewed energy and enthusiasm to move your business forward.\"</em></p>\n\n<p><em>\"'Build Your Future' allows people to stop and focus on the WHY rather than the HOW, which is the fuel that we all need to succeed.\"</em></p>\n\n<p><em>\"“'Build Your Future' gets you focused on what’s most important — the key goals for both you personally and for your business.  There’s so much going on every day that it’s tough to pay attention, and this course cuts through the clutter to keep things in perspective.”</em></p>\n\n<p><em></em></p>", 
    "end_date": null, 
    "title": "Build Your Future", 
    "price": "35.00", 
    "instructors": "CJ McClanahan", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757600_0a07_4.jpg", 
    "course_url": "https://www.udemy.com/thrivemap/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-09T20:31:36Z"
}