{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The <strong class=\"redactor-inline-converted\">Business Tough: How to Develop Tenacity &amp; Resilience for Entrepreneurs</strong> Course will show you the building blocks of Tenacity &amp; Resilience you will need to build your business  - whether you are a new entrepreneur, or are still looking to build your own business, or an experienced entrepreneur  and want to refresh your business toughness this course is for you.</p><p><strong><em>\"I love the winner/loser thoughts...It's so real and close to everyone's life. Great class, I recommend.\"</em></strong><br></p>\n\n<p><strong class=\"redactor-inline-converted\">Learn everything you need to power-charge yourself and your business.</strong></p>\n\n<ul><li>Understanding motivation:      Getting it and keeping it!</li><li>Success Personally Traits: Why      they are important, have you got them, and if not how do you get them?</li><li>Identifying Winner/Loser dialogues      – The importance of self-talk and knowing who’s holding the ‘microphone’      in your subconscious. </li><li>The importance of creative      thinking, and the step-by-step process of solving the daily problems faced      by entrepreneurs.</li><li>Understanding your learning      style, and how it drives your success in business.</li><li>How to develop a positive      self-image and the effect on your long-term success.</li><li>Developing a ‘Can Do’      approach in all interactions.</li><li>The effects of positive and      negative behaviour on your business.</li><li>The importance of clear and      defined goals.</li><li>How to ensure continuing      business success.</li></ul>\n\n<p>The above is just a sample of what you will learn.</p>\n\n<p><strong class=\"redactor-inline-converted\">After completing this course you will be able to:</strong> </p>\n\n<ul><li>Understand better how you ‘tick’      and take positive action to drive your business forward.</li><li>Develop the building blocks      of tenacity and resilience and so take challenges in your stride.</li><li>Become the successful person      you know you are!</li></ul>\n\n<p>This course is the sum of my  experience as a successful salesperson, manager and entrepreneur crammed into one simple and practical guide - it includes all the tools you'll need to boost your business success to the next level.</p>\n\n<p>I have used and continue to use to this day the techniques and strategies taught in this course - simply because they work.</p>\n\n<p>You will have immediate lifetime access to the all the course materials, plus any bonus material and updates in the future.</p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Q: Is it really possible to learn the skills needed face the daily challenges of being an entrepreneur?</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">A: Absolutely! It's all about knowledge and putting it into practice - by the end of this course you will have the knowledge and the confidence to boost your  success to the next level and become the great entrepreneur you have always wanted to be in the process.</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">***And remember, Udemy offer a 30 day money back guarantee, so if you decide the course is not for you - you have nothing to lose! But still can make use of all the new skills you have learned.***</strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Join this simple, fun, guaranteed and action packed course today!</em></strong></p>", 
    "end_date": null, 
    "title": "Business Tough: Unleash your Inner Success!", 
    "price": "20.00", 
    "instructors": "Stephen Atkinson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777636_d7c5.jpg", 
    "course_url": "https://www.udemy.com/business-tough/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T11:23:06Z"
}