{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>BUSINESS COACHING FOR SUCCESS</strong></p><p>Business Coaching, or 'mentoring' can have dramatic effects on both commercial success and personal happiness. It incorporates life coaching, office relationship management, confidence skills for presenting, and career goals formation, to name just a few.</p><p>In this course you'll learn how to coach people for success - whether you're looking to provide business coaching as a manager to your team, or to run business coaching sessions as a stand alone career. </p><p>I'm John Chisholm and I work full time running business coaching workshops. I help individuals and businesses to do more and achieve more. Get more work done in a hectic lifestyle, be a better boss / employee, tighten up business plans, focus career goals, and motivate teams. I want to teach you how to pass these skills on to others, and that's why I've built this course.</p><p>Helping people through business coaching gives my career meaning and purpose, and I want to help you achieve that same feeling. I continue to hone my skills by using business coaching to help people to give their best, care more, lead people, be more organised, be less stressed, make the right career choices... you get the idea.</p><p><br></p><p><strong>In this business coaching course you'll learn how to:</strong></p><ul><li>Built rapport and trust with your coachee</li><li>Use business coaching to help workplace teams succeed</li><li>Balance the coaching relationship to keep this appropriate but honest</li><li>Learn business coaching models such as GROW and SMART</li><li>Discover the most common business coaching mistakes to avoid</li><li>Prepare effectively for your business coaching sessions</li><li>Unlock what business coaching IS and what it ISN'T by breaking common misconceptions</li><li>Learn practical applications to help your coachee develop</li></ul><p><strong>Using business coaching all workplace obstacles can be addressed including:</strong></p><ul><li>Business change e.g., business growth; downsizing; acquisition and mergers</li><li>Personal effectiveness e.g., resilience; decision making; planning</li><li>Career development e.g., preparation for senior roles; career change</li><li>Confidence e.g., chairing meetings; high value presentations</li><li>Work / Life balance e.g., stress reduction; spiritual growth</li><li>Self-awareness e.g., motivation; communication; control</li><li>Outplacement coaching</li></ul><p><strong>Testimonials from my clients:</strong></p><p><em>“John is a very engaging trainer, delivers his training courses with enthusiasm, and communicates his learning points clearly and in ways which are meaningful with lots of practical examples and participation to motivate learners. He is also innovative, knowledgeable and flexible in his approach, delighting delegates with his quick humour and positive attitude.”</em></p><p><em><strong>Jan Lewis, IT Director</strong></em></p><p><em>“John is an excellent communicator and our delegate groups love working with him. He consistently achieves very high feedback scores, and we know we can rely on him absolutely to do a first class job.”</em></p><p><strong><em>Jeremy Hamilton, Company Director</em></strong></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Business Coaching for Success", 
    "price": "20.00", 
    "instructors": "John Chisholm, Louise Croft", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/613818_6bd7.jpg", 
    "course_url": "https://www.udemy.com/business-life-coaching/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T15:20:54Z"
}