{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Your Chakras are the energy centers of your body, mind and soul. You can't see electricity and chances are you can't see your Chakras, bun we know the power of electricity. We don't always understand our own power system.</p><p><strong>Chakra healing and clearing </strong>is like changing the oil in your car, washing the sheets of your bed. If you don't look after your car, what happens? it breaks down. When those warm sheets come out of the dryer, what do you feel? That tonight, you are going to sleep in a nice, warm, comfortable bed.<br></p><p><strong>Clearing your Chakras</strong> is like that. Every day, we are bombarded with tragedies on the nightly news  Our boss or co-workers upset us. That car cuts us off. We walk in an electromagnetic soup that our ancestors couldn't dream of. Our food and drink choices aren't <strong>the best</strong>. All the trappings of modern life pollute <strong>our subtle energies</strong>.</p><p>We end up tired, depressed, obese, angry and lost.</p><p>When you regularly clean your Chakras, you start <strong>reversing decades of abuse</strong> and begin tuning your body so it is a <strong>Lamborghini</strong>, instead of a 1960 Valiant, that hasn't had an oil change in 6 decades.</p><p>In this course, Jon will walk you through three sets of Chakra Healing exercises. </p><p><strong>There are Seven Chakras:</strong></p><ol><li>Crown</li><li>Eye</li><li>Throat</li><li>Heart</li><li>Solar</li><li>Sacral</li><li>Base</li></ol><p><strong>The exercises take short minutes and almost immediately</strong>, <strong>you will feel the blocked energies start to move in your body.</strong> Your friends and family will be asking you what you are doing as they will see the difference in you.  </p><p>As you grow in knowledge and expertise through daily practice, you will tune into your body and start knowing which clearing and healing exercises you need right now.</p><p><em>Be one of the first in the world to get lifetime access when you take this course today! You can count on me to answer every single discussion you post in the course and to do my best to help you to get through the challenges you are facing today in keeping your Chakras happily humming when you take this course today!</em><span><em></em><br></span></p>", 
    "end_date": null, 
    "title": "Chakra Healing", 
    "price": "40.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641670_a745.jpg", 
    "course_url": "https://www.udemy.com/chakra-healing-clearing-for-better-energy-thinking-joy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T19:03:50Z"
}