{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Course updated September 5th, 2014. Over 1,200 students!</strong>  </p>  <p style=\"\">  \t<strong style=\"\">--------------------------------------------------------------------------------------------------------</strong>  </p>  <p style=\"\">  \t<strong style=\"\">People always say to me “I have this drained feeling. </strong>Like everything is out of alignment and life is dragging me down…”  </p>  <p style=\"\">  \t<strong style=\"\">What if </strong>I could teach you the fundamentals of a spiritual knowledge thousands of years old? A system of balance and vitality that can make you feel better than you’ve ever felt before.  </p>  <p style=\"\">  \t<strong style=\"\">What if </strong>I can show you how to unlock the secrets of managing your spiritual energy to heal your body and mind?  </p>  <p style=\"\">  \t                                                  Maybe you have experienced a taste of the benefits of yoga or meditation, and would like to intensify your practices by adding spiritual energy to the mix.  </p>  <p style=\"\">  \t                                                  The ancient system of Chakras are <em style=\"\">directly</em> responsible for your vitality, your emotions, your ability to connect with others, and everything else about your current state of being.  </p>  <p style=\"\">  \t<strong style=\"\">      As an expert of spiritual and healing work for over 20 years, and author of 9 books on the topic</strong>, it is my goal to teach you about these hidden influencers of your wellbeing. To allow you to begin to leverage them to lead a more prosperous life!  </p>  <p style=\"\">  \t                                                  Don’t underestimate the power of these forces.  </p>  <p style=\"\">  \t<strong style=\"\">Managing Chakras can have immediate benefits like:</strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t<strong style=\"\">·Predicting and healing mental and physical illnesses</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">·Allowing you to lose weight without dieting</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">·Combating specific diseases of the body and mind, such as depression, migraines, inflammation</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">·Improving your relationships and emotional fortitude</strong>  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\">·Helping you get in touch with your inner self, your creativity, and your true meaningful calling</strong>  \t</p>  </ul>  <p style=\"\">  \t                                                  This course gives you a crash course Chakras, and I hope that it serves you.  </p>  <p style=\"\">  \t                                          See what others are saying...  </p>  <p style=\"\">  \t<em style=\"\">&quot;This course offers clear, concise insight into how the chakra system works...</em><em style=\"\">Chakras Explained will help you better understand the intangible energy system that affects both your physical and emotional health.&quot;</em> - Christy  </p>  <p style=\"\">  \t<em style=\"\">&quot;The instructor is very calm, he doesn&#039;t pose himself as a guru and he presents the subjects in a simple, easy to follow way. He gave me a lot of information, links and lectures. That&#039;s what I call a great course!&quot; </em>- Ivan  </p>  <p style=\"\">  \t<em style=\"\">&quot;I loved this course. Looking forward for your upcoming courses.&quot; </em>- Syed  </p>  <p style=\"\">  \t<strong style=\"\">Join today</strong> and let’s get started restoring balance to your life.  </p>", 
    "end_date": null, 
    "title": "Chakras Explained: Optimize the Body's Energy and Health", 
    "price": "20.00", 
    "instructors": "Robert Jirda", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259014_5c58_5.jpg", 
    "course_url": "https://www.udemy.com/chakras-explained/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T14:05:43Z"
}