{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\"></em></strong><strong style=\"\"><em style=\"\">Course developed:  March 2015</em></strong></p><p><strong style=\"\"><em style=\"\">Bonus Lecture added:  April 2015</em></strong><br style=\"\"></p><p><strong style=\"\"><em style=\"\">----------------------------------------------------------------------------------------------------------------------------</em></strong></p><p><strong style=\"\"></strong>Perhaps you feel like there is more to life but not sure what. You would like to find a way that enriches you physically and emotionally, and gives more purpose and meaning to your life. Maybe you&#039;ve thought about wanting to make a difference but see the overwhelming number of issues in our world and think why bother? Is it worth my time and energy?</p><p>In this course you will discover just how beneficial it is to you and extremely worthwhile of your time and effort. Not only that but this world needs you to - you are a unique expression on this earth – and you need to for yourself. It doesn&#039;t matter your age, your income level, your status, your abilities or disabilities –<strong style=\"\"> everyone can make a difference and as a result have better health, more happiness, and greater meaning and purpose</strong>.</p><p>By learning how making a difference is beneficial to you, you will not only be inspired to take action but also be able to inspire others with what you learn.<em style=\"\"><br style=\"\"></em></p><p>You will also learn some surprising facts from research. For example, if volunteering is your way of making a difference, how many hours do you need to volunteer to see the physical and emotional benefits? Are there times when making a difference is detrimental to your well-being? </p><p>We&#039;ll also look at some examples of ordinary people involved with making a difference. There are also exercises to personalize your learning and put what you learn into practice!</p><p>Click the &quot;take this course&quot; button, top right, now ... <em style=\"\">every hour you delay is an hour where you could have more happiness, better health, sense of meaning and purpose...</em><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Change the World, Change Your Life", 
    "price": "20.00", 
    "instructors": "Merna Schmidt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/440718_714c_4.jpg", 
    "course_url": "https://www.udemy.com/have-more-happiness-health-and-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-06T21:39:17Z"
}