{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>“Your body is an intelligent organism!”</strong> Learn how you can tap into that wisdom contained within your body through the lens of the Vedic Frameworks. And then apply that learning to embody it into your muscle memory.</p>  <p><strong>Learn to connect to the essence of who you are. Elevate your daily practice and ritual and coach yourself to think and act in congruence with your inner being.</strong></p>  <ul><li>Discover your inner relationship with the elements.</li><li>Connect with your inner being and essence.</li><li>Learn to show up in PRESENCE.</li><li>Perceive the interactions of cycles of human experience.</li><li>Integrate a holistic approach with your clients.</li><li>Deepen your coaching practice.</li><li>Strengthen your emotional foundations.</li></ul>              <p><strong>Discover a framework for transformation</strong></p>  <p>I want to offer you a framework, a new perspective of timeless, human wisdom through the Vedic Frameworks. This perspective may help to incorporate several concepts that you have come across in your quest for personal transformation and development. </p>  <p>The underlying concept is that of movement; movement through actions, movement through thoughts and the resultant expression of that movement. </p>  <p>On this planet, at this time, we were gifted with a body. That is our PRESENCE. How can we relate to presence? Are we aware of our presence? How can we shift?</p>  <p><strong>Course Contents And Overview</strong></p>  <p>This course contains over 30 lectures and 6+ hours of content! It is designed for you if you are curious about learning to coach yourself and others from the deep, inner wisdom of the human body.</p>  <p>I strongly believe in 3 key ideas: <strong>#1) Education</strong> - learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.</p>  <p>Every section in this course is connected and invites you to embody the learning. Wrapping up each section are “Reflections and Enquiry” to help you notice what shows up in your body.</p>  <p>The more you can practice and apply what you learn in the sections determines the results you'll get.</p>  <p><strong>Section #1 –</strong> “Introduction To Vedic Sciences” – We begin this course with an invocation for learning to help us set the stage for the unfoldment within. Then we move to inquiry about “learning” itself and identify the Vedic Frameworks in play. </p>  <p><strong>Section #2 –</strong> “Guṇas, Bhūtas &amp; Kośas” – These are the more subtle Vedic Frameworks and concepts. You are much, much more than a “9-holed bag of skin!” You are a divine being on an Earthly experience J Discover the indriyas, the organs of action and wisdom that every human being is gifted with. Learn key ideas about ritual and the sacredness of taking action. How do you connect with “ritual?”</p>  <p><strong>Section #3 – </strong>“Guided Meditations and Visualizations” We get into the \"good stuff\" of guided meditations here. Follow along with the 10-15 minute guided meditations and allow yourself to notice. Take conscious control of your awareness and learn to dive within.</p>  <p><strong>Section #4 –</strong> “Resources &amp; Supplementary Materials - Suggested Books, Worksheets, Vocabulary” – Plenty of bonus material here including Sanskrit vocabulary and several suggested books to deepend and enhance your learning. </p>  <p><strong>Course Bonuses!</strong></p>  <p>I am including audio (MP3) versions of the course as a bonus to help you along your inner journey. Listen to the course while walking, or having a cup of tea. Meditations are a separate audio that you can listen at your own pace and leisure.</p>  <p><strong>Take Action &amp; Enroll</strong></p>  <p>Click \"Take This Course\" now and make the commitment to jump straight into “Coaching From The Body” for yourself. I know the Vedic Frameworks created shifts within me and resulted in a rewarding personal and professional life.</p>  <p>See you on the inside and check out the preview videos to see what you'll be getting!</p>  <p>Wishing you much success in your journeys,</p>  <p>Thushyanthan</p>", 
    "end_date": null, 
    "title": "Coaching From The Body - Vedic Framework For Transformation", 
    "price": "40.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383706_a0c1_2.jpg", 
    "course_url": "https://www.udemy.com/your-body-is-your-teacher-learning-from-the-vedic-sciences/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-03T02:58:12Z"
}