{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Avez-vous de grandes ambitions?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Vous rêvez depuis longtemps de réussir et d’atteindre le succès, mais après chaque année qui passe, vous réalisez que vous n’avez toujours pas fait de progrès?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Vous avez une idée de projet, mais vous ne savez pas comment la matérialiser?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Vous pensez ne pas avoir assez de moyens ni de ressources pour le faire?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Vous avez un rêve mais il vous paraît si grand et si loin que vous doutez qu’il puisse se réaliser un jour? </strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Vous vous sentez trop âgé, trop jeune, ou trop démoralisé, pour oser vous lancer dans une nouvelle aventure?</strong></p>\n\n<p>Si vous avez répondu OUI à une des questions précédentes alors vous êtes tombé sur la bonne page, au bon moment.<br>Dans cette formation, vous allez découvrir comment transformer radicalement votre vie selon vos propres ressources, même si vous croyez ne pas avoir suffisamment de compétences, de moyens ou de chance pour réussir.<br>Je vous dévoilerai la Méthode qui vous permettra de relever le défi, de libérer le potentiel qui est en vous et de commencer dés demain à vivre la vie que vous voulez vivre selon vos propres termes.</p>\n\n<p>Il s’agit d’une immense découverte, alors continuez à lire, parce que dans quelques instants <strong class=\"redactor-inline-converted\">vous allez être capable de vous libérer de toutes vos craintes et vos limites, et vous allez enfin pouvoir vivre comme vous le méritez, peu importe où vous en êtes dans votre vie.</strong></p>\n\n<p>Comment?.... Suivez-moi, Je vous montre.<br></p>\n\n<p>Qui suis-je?</p>\n\n<p>Mon nom est Hind, et il y a quelques années j’avais les mêmes croyances que vous, et peut-être aussi les mêmes envies; Changer ma situation.<br>Je suis arrivée à un moment dans ma vie où le cycle boulot-métro-dodo m’apportait plus de problème de santé que d’argent. <br>Mon travail ne me passionnait pas, alors je me demandais quel intérêt de vivre si on est incapables de faire ce qui nous passionne vraiment. <br>J’avais beaucoup d’idées mais pas assez de compétences, de temps ou de moyens pour les mettre en pratique. <br>Et je n’étais pas la seule. La plupart des gens se plaignent de leur manque de temps, de compétences ou d’argent pour justifier la vie médiocre qu’ils ont décidé de vivre. <br>Ils attendent que le bon moment arrive pour changer et enfin planifier un nouveau projet, et ce moment-là n’arrive peut-être jamais. <br>Alors, un jour j’avais décidé de ne plus faire partie de ces gens là, et vous non plus vous n’en ferez plus partie à partir d’aujourd’hui. </p><p><strong class=\"redactor-inline-converted\">Comme on dit: si le chemin sur lequel vous vous trouvez ne vous plaît pas, il faudra en construire un autre. </strong></p><p>Depuis le temps, j’ai commencé à faire des recherches sur certaines personnes qui ont réussi à réaliser leur rêves et à atteindre le succès. </p><p>Je voulais absolument connaître le secret de leur réussite, alors j’ai commencé à lire et à écouter l’expérience de chacun.  <br>Malgré leur différence, j’ai découvert qu’ils sont la preuve vivante de notre pouvoir de choisir. Même s’ils étaient trop jeunes, ou trop vieux, ou trop pauvres, ou trop timides, ou trop faibles pour commencer une nouvelle page blanche ou redémarrer une nouvelle carrière ou lancer une nouvelle affaire ou apprendre une nouvelle technique, ils ont quand même réussi à démarrer une nouvelle vie à partir de rien, zéro, nada. </p><p>Grâce à leur pouvoir de décision, leur persévérance et leur détermination à vouloir créer un changement. </p><p>Chacun de nous a sa propre définition du succès, et nous avons tous au moins une personne qu’on admire et qui personnifie notre définition du succès. <br>Peut être quelqu’un qui a réussi à gagner 5 millions d’euros en seulement 6 mois dans le secteur immobilier. Ou peut-être c’est cette femme qui vient tout juste d’être nommée à la tête d’une grande compagnie. Ou bien c’est quelqu’un qui travaille peu et profite plus de la vie. </p><p>Alors vous vous demandez: qu’est-ce qu’ils ont bien pu faire pour réussir, et pourquoi je ne peut pas en faire autant et atteindre le même succès?<br>La bonne nouvelle c’est qu’il n’y a aucune raison qui vous empêche de réussir comme eux. Par contre <strong class=\"redactor-inline-converted\">il est fort probable qu’à cause de quelques mauvaises habitudes vous n’arrivez pas à progresser dans la bonne voie. </strong>En voici trois qui s'avèrent être les plus communes et les plus dangereuses :</p><p><strong class=\"redactor-inline-converted\">1- Avoir des croyances autodestructrices</strong><br>Comme disait Napoléon Hill: “Tout ce que le mental de l’Homme peut concevoir et croire, il peut le réaliser”.  Et c’est vrai. <br>Alors les gens qui réussissent, au lieu de se dire “je ne peux pas” ou bien “c’est trop risqué si j’essaye”, il développe un état d’esprit en adoptant l’attitude du “Oui je peux”. Ces gens là restent concentrés sur leurs objectifs et établissent un système qui leur permettra de les atteindre.<br><strong class=\"redactor-inline-converted\">2- Manquer d’autodiscipline</strong><br>Tous les hommes et femmes à succès sont ceux qui travaillent presque tout le temps sur les tâches de grande valeur et qui sont importantes pour leur projets, ils évitent de gaspiller leur précieuse source en des activités de faible valeur. <br><strong class=\"redactor-inline-converted\">3- Essayer de réinventer la roue</strong><br>Seuls les actions produisent des résultats. Tous ces modèles à succès ont suivi d’autres modèles à leur tour. Ils ont copié leur méthode et l’ont répété encore et encore.<br>Maintenant je vous pose la question: </p>\n\n<p>Vous laissez-vous dominer par une de ces mauvaises habitudes? </p>\n\n<p><strong class=\"redactor-inline-converted\">Voulez-vous savoir comment les éviter et les remplacer par de bonnes habitudes?</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">C’est simple<br>Grâce à la Méthode A.G.I.R.</strong><br><strong class=\"redactor-inline-converted\">Une formation complète qui vous montre étape par étape comment planifier votre vie, définir vos vrais objectifs, les atteindre et enfin réaliser vos rêves.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Avec la Méthode A.G.I.R</strong> vos croyances autodestructrices n’auront plus de place dans votre esprit, parce que <strong class=\"redactor-inline-converted\">vous apprendrez à développer une pensée positive envers votre avenir et à créer une image qui représente la vrai réussite pour vous.</strong> Vous serez en mesure d’établir votre propre système qui garantira votre succès et vous croirez fermement en votre capacité de l’atteindre.</p>\n\n<p><strong class=\"redactor-inline-converted\">Avec la Méthode A.G.I.R</strong> la discipline fera parti de vos objectifs. <strong class=\"redactor-inline-converted\">Vous serez en mesure de rédiger vos objectifs à court et à long termes, de les classer par priorité et de définir les bonnes étapes pour les atteindre.</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Avec la Méthode A.G.I.R</strong> <strong class=\"redactor-inline-converted\">votre avenir ne sera pas planifier par quelqu’un d’autre, sinon par vous même.</strong> Vous vous poserez les bonnes questions auxquelles vous apporterez les bonnes réponses qui à leur tour vous indiqueront le modèle de réussite qui vous inspire le plus et que vous serez en mesure de suivre et de copier.</p>\n\n<p><strong class=\"redactor-inline-converted\">Votre vie a du sens quand vous lui donner du sens. Quand vous définissez ce qui est important pour vous.</strong></p>\n\n<p>Avec la Méthode A.G.I.R vous apprendrez à définir vos valeurs bien avant d’établir un plan d’action pour démarrer vos projets. Parce que c’est en fonction de vos valeurs que vous réussirez à créer votre propre chemin du succès et à bien gérer votre temps afin d’obtenir des résultats impressionnants. </p>\n\n<p><strong class=\"redactor-inline-converted\">Il ne s’agit pas là d’une méthode miracle. <br>C’est un système qui demande du travail sérieux, de la détermination et de la persistance de votre part. </strong></p>\n\n<p>Vouloir ne suffit pas !<br>Vouloir une chose est simplement le début du chemin. <br>Il ne suffit pas de vous répéter à la longueur de journée que vous voulez ceci ou cela, ni même de vous imaginer en possession de la chose en question pour que celle-ci débarque dans votre salon.</p>\n\n<p>Si vous voulez quelque chose, vous devez faire dans le concret des actions pour l’obtenir.<br>Votre grande volonté accompagnée de courage, de persévérance et d’action vous permettront de réaliser vos rêves et de profiter de  la capacité que vous avez pour vivre la vie selon vos propres aspirations.</p>\n\n<p>Alors qu'attendez-vous?</p><p>Il y a 3 types de personnes dans ce monde: </p><ul><li>ceux qui font bouger les choses</li><li>ceux qui regardent les choses bouger </li><li>et ceux qui se demandent ce qui s’est passé.</li></ul><p>Alors quel type de personne vous voulez être?<br>Passez à l’action maintenant, accédez au cours, et retrouvez moi de l’autre côté. </p><p><strong>Faites parti des gens qui font bouger les choses.</strong></p><p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Comment planifier votre vie pour le succès", 
    "price": "25.00", 
    "instructors": "Hind Slaoui", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/809712_8071_2.jpg", 
    "course_url": "https://www.udemy.com/comment-realiser-votre-reve-cette-annee-malgre-les-obstacles/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T03:33:58Z"
}