{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you find yourself having to handle difficult people in your life?</p>\n\n<p>Building solid, long-lasting relationships is something you have longed for far too long?</p>\n\n\n\n<p>Do you think your career progress could be affected by the way you handle conflicts?</p>\n\n\n\n<p><strong>This course is just what you need in order to manage the conflicts in your life by gaining a new insight and balance in your relationships.</strong></p>\n\n\n\n<ul><li>How do you communicate with others?</li></ul>\n\n<ul><li>What generates a conflict?</li></ul>\n\n<ul><li>How can you „see a conflict coming”?</li></ul>\n\n<ul><li>What do you do in a conflictual relationship?</li></ul><p><br><strong></strong></p><p><strong>Take your insight and communication skills to a whole new level</strong></p>\n\n\n\n<p>Communication with others seems to be one of the greatest challanges anyone in today’s society comes to face. Whether in the domestic, professional or social realm, whether formal or informal, you need to communicate, as one thing is for sure: <strong>you can not, not communicate.</strong></p>\n\n\n\n<p>And if you were to choose between a conflict and a balanced, genuine interaction with another person, what would you choose?</p>\n\n\n\n<p>I have structured this course based on my experience with people just like you, willing to improve their relationships and experience more of the joy and success life has to offer.</p>\n\n\n\n<p>As you have lifetime access to this course, you can come back to the lectures at any time. I have designed this  format  especially to offer you the best learning experience by combining video, audio, transcripts, written lectures and exercises and I intend to update it regularly.</p>\n\n\n\n<p>The Guided Meditation included as Bonus will help you change one limiting belief at a time, and thus gaining more flexibility, greater adaptability and insight for excellent communication.</p>", 
    "end_date": null, 
    "title": "Conflict Management: Find Resolution, Balance & New Insight", 
    "price": "30.00", 
    "instructors": "Alina Margineanu", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813332_4f33_2.jpg", 
    "course_url": "https://www.udemy.com/conflict-management-find-resolution-ballance-new-insight/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T09:43:33Z"
}