{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">What is the course about? </strong></p><p style=\"\">Breaking free from labels that restrict gay men form fulfilling their potential, the fear of not being good enough, overcoming limiting beliefs and self doubt and transforming the lives of gay men so they take actions with confidence and self belief in themselves. </p><p style=\"\"><strong style=\"\">What kind of materials are included?</strong></p><ul style=\"\"><li style=\"\">Daily videos</li><li style=\"\">Programme Manual</li><li style=\"\">Weekly Evaluations of Progress</li><li style=\"\">Tools and Activities to help you gain trust and faith in you and your choices in all areas of your life - relationships, career, sexuality, finance, health and well being</li></ul><p style=\"\"><strong style=\"\">How is the course structured? </strong></p><p style=\"\">This Udemy based programme takes place over 28 days with daily videos and focused confidence boosting activities using a programme manual. </p><p style=\"\"><strong style=\"\">Why take this course?</strong></p><p style=\"\">This course is for you if any of the following challenges you can relate to: </p><li style=\"\"> you struggle to accept or &#039;be yourself&#039; </li><li style=\"\"> you doubt yourself and choices you make </li><li style=\"\"> life is a conveyor belt of drink, drug and sex fuelled encounters that leave you less and less satisfied</li><li style=\"\"> being gay isn&#039;t all its cracked up to be</li><li style=\"\"> hanging onto your stories and fears prevents you from making changes</li><li style=\"\"> others seem to make your decisions for you </li><li style=\"\"> what others think of you matters far too much</li><li style=\"\"> you feel alone in a crowded room</li><li style=\"\"> you want to take control of your life... then It&#039;s time to Unlock Your Power!</li><span style=\"\"></span><p style=\"\">Life isn&#039;t too short, its too long to be struggling and feel that you aren&#039;t living the life you want to, and deserve, to be living.</p><p style=\"\">By examining, reflecting, engaging and exploring ways of realising your power through letting go of old defeatist conditioning, overcoming personal sabotage techniques, shifting perceptions and expectations, creating new empowering patterns of living and breaking free from the labels you have grown up with you&#039;ll gain trust, faith, self respect and confidence in themselves and their decisions. Its about taking control rather than being controlled. </p><p style=\"\">When you unlock your power your increase your self-worth and live a life that positively and permanently makes your life happier and more fulfilling to you, those around you and the rest of the planet.</p><p style=\"\"><strong style=\"\">What do I need before I begin?</strong></p><ul style=\"\"><li style=\"\">A &#039;can do&#039; attitude with the commitment to see the course through to the end</li><li style=\"\">Online access to Udemy and appropriate playback facilities to watch the lectures on your PC or mobile device</li><li style=\"\">PDF viewer software for the instruction manual (we recommend Adobe Reader)</li><li style=\"\">Allocated time to watch tutorial videos and complete the manual activities.</li></ul>", 
    "end_date": null, 
    "title": "Confidence & Super-Success for Gay Men", 
    "price": "50.00", 
    "instructors": "Martin Feaver", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/521908_391d_3.jpg", 
    "course_url": "https://www.udemy.com/gay-confidence-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-06T12:20:57Z"
}