{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  </p>  <p style=\" text-align:justify;\">  \t<span style=\"\">Se entiende por grafología a la ciencia que tiene como objetivo el estudio del carácter, temperamento y personalidad mediante el análisis e interpretación del conjunto de<span style=\"\"></span>aspectos de movimiento, espacio, forma en la escritura manuscrita.</span>  </p>  <p style=\"\">  \t  </p>  <p style=\" text-align:justify;\">  \tLa grafología es una rama derivada de la <span style=\"\"> </span>psicología la cual ayuda a<span style=\"\"></span>describir <span style=\"\"> </span>la personalidad de un individuo. Mediante el examen de la escritura manuscrita determina características generales del carácter, conducta, la naturaleza de las emociones, <span style=\"\"> </span>tipo de inteligencia y aptitudes profesionales del individuo en cuestión.<span style=\"\"></span>  </p>  <p style=\"\">  \t  </p>  <p style=\" text-align:justify;\">  \tEl estudio grafológico es aplicable a prácticamente todas las personas sin importar su condición social, académica, género, edad, etc. De igual modo la grafología disfruta de grandes beneficios significativos al ser <span style=\"\">un instrumento neutro, no tensional y difícilmente manipulable, es decir, no somete a la presión y/o tensión <span style=\"\"> </span>característica que cualquier otra prueba psicotécnica puede crear en un individuo. Al no generar tensión, el sujeto no generará defensas psicológicas al aplicar el instrumento grafológico. </span>  </p>  <p style=\"\">  \t  </p>", 
    "end_date": null, 
    "title": "Conoce La Verdadera Personalidad, A Través De La Grafología", 
    "price": "50.00", 
    "instructors": "Investigacion y  Estudio Empresariales", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/394458_aa25.jpg", 
    "course_url": "https://www.udemy.com/grafologia/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T23:36:12Z"
}