{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Este es un curso en el que se muestran técnicas de voz, respiración, postura corporal y lenguaje corporal con el objetivo de controlar la timidez y poder expresarnos incluso en momentos de crisis o a la hora de enfrentarnos a exposiciones orales. Es un curso en el que se da mucha información y conocimientos pero que termina llevando toda práctica a 4 técnicas esenciales para poder aplicarlas con facilidad y resultados óptimos e inmediatos. Tanto si lo que te interesa es que no te domine la timidez, poder hablar corréctamente y sin trabas, o conocer técnicas para hablar en público, o incluso aprender el significado del lenguaje corporal y de la voz de los demás y de ti mismo, este curso te encantará. El curso está compuesto por vídeos explicativos, documentos de texto, enlaces a artículos externos y ejemplos variados. Además puedes dejar comentarios a la instructora para cualquier duda. El curso tiene una duración de más de 2.5 horas, aunque no es conveniente realizarlo de un tirón puesto que hay ejercicios que necesitan de práctica para poder avanzar. De todas formas es un curso \"de cabecera\" al que siempre podrás volver para reforzar conocimientos o ampliarlos. El curso está organizado en un sentido lógico de progresión para el alumno, siempre anteponiendo una amplia explicación e información detallada de los ejercicios que va poner en práctica. Dentro de la parte práctica del curso hay ejercicios que constituyen un entrenamiento diario para el alumno y otros ejercicios se realizarán sólo de vez en cuando a modo de chequeo personal. Es por estos últimos ejercicios por los que resulta interesante volver al curso de vez en cuando una vez realizado el curso por completo. Siempre resulta útil saber algo más sobre nosotros mismos, practicar la objetividad con nosotros y con los demás, ver más allá de la \"simple vista\", hay muchos detalles de la vida que se nos pasan por alto pero que nuestro instinto insiste en señalar. Saber que no somos los únicos que estamos asustados, que tenemos miedo de fallar, descubrir que si tropezamos no se hunde el mundo, nos ayuda a liberarnos y a empezar a vivir felices.  Esa es la puerta que abre este curso.</p>", 
    "end_date": null, 
    "title": "Controla tu timidez y exprésate sin miedo", 
    "price": "40.00", 
    "instructors": "Sofia Herrera de Alvaro", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675750_6d4f.jpg", 
    "course_url": "https://www.udemy.com/controla-timidez-expresate-sin-miedo/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-20T16:46:51Z"
}