{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><em style=\"\">Can i show you</em>, the easiest way to <strong style=\"\">hypnotize a subject </strong>and transform the way they think ?...... </p><p style=\"\">And show you a simple format, so <strong style=\"\">you know what to do and say</strong> at every step of the way ?</p><p style=\"\">Interested in hypnotherapy ? Interested in how to <strong style=\"\">only use language</strong> to have a subject enter a hypnotic trance ?</p><p style=\"\">You now have at your finger tips, a powerful and basic format to follow to achieve this. Follow the simple 10 step process, and watch as your subjects, slip into a pleasant hypnotic trance with you at the wheel. </p><p style=\"\"><strong style=\"\">At each step along</strong> the way you will be instructed in the principles that will allow you to alter the state of your clients mind.</p><p style=\"\"><strong style=\"\">You will be introduced to </strong></p><ol style=\"\"><li style=\"\">The ultimate 10 step process for all hypnosis </li><li style=\"\">The step by step model, that a professional therapist will follow, but taught in a basic structure</li><li style=\"\"><strong style=\"\">The easy to follow</strong> flow method, to make your interactions seamless and transformational.</li><li style=\"\">Trouble shooting methods to overcome external problems </li><li style=\"\">The exact process of the mind through a hypnotic trance</li><li style=\"\">How to set the perfect context for trance to occur</li></ol><p style=\"\">This format can be utilized under any circumstances and with any subject , even if they have not been hypnotized before. </p><p style=\"\">By following this step by step formula you will find your self integrating your new skill set quickly and with a professional twist to it. <strong style=\"\">You will shock your subjects </strong>as they go into trance easily, and will have no idea that you are a novice therapist. Your new skill set will shine with a smooth and expert approach every time </p>", 
    "end_date": null, 
    "title": "Conversational Hypnosis Success Formula For Beginners", 
    "price": "20.00", 
    "instructors": "Scott Jansen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467024_5ad8_2.jpg", 
    "course_url": "https://www.udemy.com/conversational-hypnotherapy-basic-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-03T23:42:41Z"
}