{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p> Au sein de ce cours, nous allons examiner systématiquement <strong>les principes essentielles </strong>sur lesquels reposent la kinésiologie. Cette démarche va permettre au débutant de se faire une idée générale de l'étendu de cette discipline. Il va lui donner <strong>des fondements solides</strong>, et les outils pour une compréhension des principes et des techniques utilisées, qu'ils soient simples ou complexes.<br> <br> Quelque soit votre niveau dans cette discipline, vous allez pouvoir tirer un bénéfice de cet enseignement: que vous soyez débutant, amateur ou même professionnel. </p> <br> Oui, <strong>ce cours s'adresse aussi aux professionnels</strong> de la kinésiologie car chaque principe est exposé ici dans sa plus grande globalité. Je prend aussi en compte l'avis des meilleurs experts concernant les disciplines dont la kinésiologie s'inspire pour créer les procédures de guérison. Il existe de par le monde, des hommes et des femmes extraordinaires, dont l'objectif est d'aider à l'amélioration de la condition humaine, et, la kinésiologie, par sa vocation universaliste et humaniste prend en compte leurs enseignements.<br> <br> <u>Une seule condition vous sera nécessaire pour participer à ce cours: c'est l'ouverture d'esprit.</u> De nombreux éléments que vous allez voir et entendre dans ce cours seront nouveaux pour vous. Donnez vous la permission de les examiner sans préjugé, de les comprendre, de les ressentir, et de vous faire une opinion personnelle. Si vous vous permettez cette liberté de pensée, vous aurez tout à prendre de ce cours.", 
    "end_date": null, 
    "title": "Cours d'initiation à la kinésiologie appliquée moderne", 
    "price": "50.00", 
    "instructors": "Ephraim Soltani", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595742_cb86_5.jpg", 
    "course_url": "https://www.udemy.com/apprendre-la-kinesiologie/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-28T08:10:00Z"
}