{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "\r\n<p>CPD Made Easy provides a unique resource to all organisations and individuals, and is aiming to revolutionise the way training is delivered.&nbsp;<span>&nbsp;</span></p>\r\n\r\n<p><span></span>The ethos and name of CPD Made Easy was developed in response to the personal frustrations of the founder in gaining personal and professional development for himself, and more importantly for the professional members of staff within his existing business.</p>\r\n\r\n<p>In simple terms, we aim to make gaining personal and professional development “EASY” for both individuals and businesses.</p>\r\n\r\n<p>Training is difficult to implement and is expensive, but is also proven to be of vital importance to maintain efficiency and profitability, to improve morale and increase staff retention, to meet the requirements of professional organisations, and accreditations such as Investors in People, ISO9001, ISO14001, ISO18001, CHAS etc.</p>\r\n\r\n<p>All professional organisations require their members to gain a specific level of CPD within a year. This is usually gained by reading and attending seminars on professional skills. But the result of this is a lack of personal development in “soft” skills such as leadership, time management, communication, and the like.</p>\r\n\r\n<p>Research has shown that these soft skills are key to individuals improving their effectiveness.</p>\r\n\r\n<p>CPD Made Easy has been developed to provide flexible, highly effective training in<span>&nbsp; these soft skills which are provided online, on a subscription basis.</span></p>\r\n\r\n<p>The benefits of using CPD Made Easy for Individuals include improving your personal effectiveness, making you happier and reducing stress, improving your employability, and making you a better leader. It also assists you in meeting the requirements of your professional organisations.</p>\r\n\r\n<p>For organisations the benefits are demonstrating your commitment to training and staff development, staff morale and retention, and ensuring you have an effective workforce and management team.</p>\r\n\r\n<p>CPD Made Easy is committed to providing flexible training. Our delivery model is online, subscription based training which can be viewed anywhere, on a wide range of devices. In the office, in the gym, on the train – gaining your CPD hours and keeping yourself up to date has never been so easy.</p>\r\n\r\n<p>We are also committed to the quality of the training provided. Our scripts are written by experts in their fields, with contributors including lecturers from University College London and Open University, a regular on BBC Radio 2, and writers for publications including Global Business Magazine and the Financial Times. All voiceovers are recorded by professionals, in specialist high quality recording studios, and are carefully edited to ensure quality. </p>\r\n\r\n<p>Overall, CPD Made Easy is a unique new service, providing a range of training and development, on an affordable subscription based model. The training is in formats which are on demand and can be viewed on a range of devices, in the office or any other location to suit our users requirements. The training is high quality, with professional script writers and voice over recordists. The business model is flexibility, providing various subscription packages to suit all requirements.</p>\r\n\r\n<p>We aim to revolutionise training and development, and hope you will join us soon!</p>\r\n", 
    "end_date": null, 
    "title": "CPD Made Easy - Personal & Professional Development", 
    "price": "30.00", 
    "instructors": "John Cook", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20018_7d77_6.jpg", 
    "course_url": "https://www.udemy.com/cpd-made-easy-personal-professional-development/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-24T10:16:59Z"
}