{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Dynamic change in business is exacerbating the natural tendency to focus on what we fear. This unconscious reaction is literally paralyzing people from being change adaptive. If this is critical for you, then it has never been more important to your personal development to utilize Creating a Mindset for Change with Seeing Red Cars.</p><p>Here's the premise: You buy a red car and what do you notice? You notice more red cars, right? You notice more red cars because that is what you are focused on. The same concept applies to you. You get more of whatever you focus on. Seeing Red Cars takes this basic concept and adapts it to help you apply your focus to any initiative. It acts like a catalyst for change. </p><p>This change management course is a methodology that will help you focus on positive outcomes and stay relevant. The process discovers why we focus on what we fear and how we can move that focus away from fear to create real change. Most change management courses only address the need to change the system, but Seeing Red Cars focuses on creating a mindset for a positive future. </p><p>There is over 25 minutes of video that takes you through the methodology along with a toolkit to track your progress. It is like having a private coach, Laura Goodrich coaching you through the strategies you need to create an environment of positive change, both personally and professionally.</p>", 
    "end_date": null, 
    "title": "Creating a Mindset for Change/Seeing Red Cars, Starter Offer", 
    "price": "40.00", 
    "instructors": "Laura Goodrich", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578108_abb1_3.jpg", 
    "course_url": "https://www.udemy.com/creating-a-mindset-for-changeseeing-red-cars-starter-offer/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T15:23:01Z"
}