{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn strategies for setting goals that maximize your chance of success. Through goal setting you can create a life where you are more satisfied on a daily basis. </p><p><strong>Design goals that help you create a life of contentment and fulfillment.</strong><br></p><ul><li>Learn the importance of goal setting</li><li>Discover how to set powerful goals</li><li>Uncover easy tips to maximize your chance of success</li></ul><p><strong>Achieve Your Vision of Life</strong></p><p>Many people go through the motions of life without really knowing where they're headed. They float through, doing what they think they <em>should</em> do, and never getting any closer to where they want to be. You don't have to live life this way. Through goal setting in a way that is powerful and that sets you up for success, you can make a change and move toward your vision of truly living life.</p><p><strong>Content and Overview</strong><br></p><p>This course is suitable for beginners who are looking to make a change. Through 33 lectures presented in video and Powerpoint format, you will learn why goal setting is important, how identifying your personal values can help set you up for successful goal setting, how to identify powerful goals to set for yourself, techniques to increase your chance of success, and tips for putting it all into action.</p><p>Throughout the course, you will find downloadable materials in PDF format that help you create a personalized goal setting plan. You will also find quizzes to help test your knowledge and make sure you are retaining the information. At the conclusion of the course, you will find a downloadable PDF that incorporates all of the course material so you can create your own road map to success.</p><p>When you complete this course, you will have a working knowledge of the goal setting process and be able to create your own goals that are powerful and that set you up for success.</p>", 
    "end_date": null, 
    "title": "Create Powerful Goals", 
    "price": "45.00", 
    "instructors": "Alexis Aiger", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739678_4610_2.jpg", 
    "course_url": "https://www.udemy.com/create-powerful-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T07:00:51Z"
}