{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We all want to live a life of meaning, joy, and fulfillment. But let’s be honest… it’s not easy! </p>\n\n<p><strong class=\"redactor-inline-converted\">Finding our passions, defining our purpose, and balancing all the many aspects of a complete and rich life… this stuff takes work!</strong></p>\n\n\n\n<p>In this course, the product of over 2 decades of university-level work and thousands of lives changed, we’re going to give you the strategies, tools, and frameworks to create the meaningful life of your dreams. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Fortunately, there are powerful, hands-on exercises you can do to discover your life's purpose and achieve your dreams</strong><br></p>\n\n\n\n\n\n\n\n<p>This isn’t some fluffy course about motivation and inspiration. It’s an intensive, step-by-step action plan to help you...</p>\n\n\n\n\n\n\n\n<ul><li>Build the foundation of a happy and meaningful life\n</li><li>Understand the science of happiness and how to apply it\n</li><li>Discover the purpose and mission of your life - and pursue them!\n</li><li>Create wellness and balance in all 8 of life’s core elements\n</li><li>Develop the wisdom and self knowledge to be your true self\n</li><li>Understand the role of change and harness it to propel yourself forward\n</li><li>Reframe negativity and obstacles to avoid getting “stuck”\n</li><li>Develop powerful and effective goals to help accomplish your dreams\n</li><li>Uncover your core values and learn how to live them to the fullest\n</li><li>Map out and design your life for meaning and happiness - deliberately\n</li><li>Build the powerful support system and the nurturing environment that helps you achieve greatness\n</li><li>...and much, much more!\n</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n<p><strong>For the first time ever, you can Create a Meaningful Life in the comfort of your own home!</strong></p>\n\n\n\n<p>Join top-rated university professor Linda Levine and Jonathan Levi, one of Udemy's all-time bestselling instructors, in this first-of-its kind online course.</p>\n\n\n\n<p>Throughout the course, we’ll use the same hands-on techniques and exercises used by the world’s top life coaches and university professors alike to help you define and attain a truly meaningful life. </p>\n\n\n\n<p><strong>You'll learn about powerful, life-changing tools such as...</strong><br></p>\n\n\n\n<ul><li>The Wheel of Life</li><li>Personal Mission Statements</li><li>Core Values</li><li>Cognitive Reframing</li><li>SMART Goals</li><li>Life Dashboards</li><li>Vision Boards</li><li>Happiness Habits</li><li>and many other techniques for increasing happiness and fulfillment!</li></ul>\n\n\n\n\n\n\n\n<p><strong>It’s going to take hard work - and we’re going to push you out of your comfort zone…</strong></p>\n\n\n\n\n\n\n\n<p>But through this course, we’re going to get there together.</p>\n\n\n\n\n\n\n\n<p>Whether you’re mostly satisfied with your life, or deeply in need of a change, this course is guaranteed to improve your life in measurable and remarkable ways.</p>\n\n\n\n\n\n\n\n<p>We can’t wait to see what you’re able to achieve - but as you’ll learn - designing the life of your dreams is about taking action…</p>\n\n\n\n\n\n\n\n<p>So click “Enroll Now” and join us on this incredible journey, so that you, too, can Create a Meaningful Life.</p>", 
    "end_date": null, 
    "title": "Creating a Meaningful Life & Developing Habits of Happiness", 
    "price": "25.00", 
    "instructors": "Jonathan Levi, Linda Levine, M.Ed", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802642_f560_2.jpg", 
    "course_url": "https://www.udemy.com/creating-a-meaningful-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-24T07:01:58Z"
}