{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    This course takes the unexpected element out of your eureka moment and creates a situation – an environment – where the moment occurs as part of the process. The exercises recreate the circumstances necessary for having a flash of insight.  </p>  <p style=\"\">  \tThe material is based on the author&#039;s book and workbook, both of which are included free in PDF form with this course (a $27 value). It is an online version of his live seminar that hundreds have attended.  </p>  <p style=\"\">  \t    The lessons will give you insight, clarity, and direction. You will come away with a deeper sense of who you are, where you are going, and what you need to do to get there.  </p>  <p style=\"\">  \t    Included with the course is a copy of the newest edition of the Eureka Workbook in PDF form. This workbook is produced for use in lives seminars and has been completely redesigned as a companion to online learning. Its exercises, reflection questions, and personal Eureka statement are also included as standalone documents.  </p>  <p style=\"\">  \t    The course can be completed over a weekend.  </p>  <p style=\"\">  \t     You should take this course if you have ever felt that you were stuck in one way or another. Is there one situation, relationship, or circumstance that isn’t exactly what you want but you aren’t sure what else you might do? Perhaps you want transformation, but don’t want whole life turned upside down. You jut want more from life and more congruency between who you are on the inside and what you do on the outside. You are just the kind of person who can benefit from this book.  </p>", 
    "end_date": null, 
    "title": "Create your own Eureka moment", 
    "price": "20.00", 
    "instructors": "Neal Nybo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289312_5e88_8.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-eureka-moment/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T05:22:52Z"
}