{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>If you're facing some kind of personal crisis</strong>, this course will lead you through you with the specific lessons you need to learn to completely turn things around. </p><p>No matter what your age, you can suddenly find yourself facing a period of significant, internal conflict that may have you either frozen with uncertainty or firing off in all kinds of random directions in a desperate attempt to find a life worth living.<em></em></p><p>Call it an <strong>identity crisis</strong>, a <strong>midlife crisis</strong>, or a <strong>quarter-life crisis</strong>; such times are likely leave you questioning not only what on earth you're supposed to do next, but even <em><strong>who you really are</strong></em>.</p><p><i><span>Ros, said <em>\"VERY</em></span></i> <em>effective! Incredibly simple and very powerful. Awesome!\"</em></p><p>On this course you will discover the <strong>7 Steps to Ending your Mid Life Crisis or Identity Crisis:</strong></p><ol><li>Diagnose exactly what's going on in your situation</li><li>Get clear on the unique PURPOSE of your life </li><li>Identify the driving NEEDS that steer your every decision</li><li>Reveal the HIDDEN BELIEFS keeping you trapped </li><li>Discover the THREE pillars of your unique personal IDENTITY </li><li>Define your true GENIUS</li></ol><p></p><p>The course provides you with </p><ul><li>Nearly 2 hours of easy to follow video instruction</li><li>Printable worksheets</li></ul><p></p><p><strong>Prefer to stay shallow?</strong></p><p>A new sports car, new relationship (with someone much younger, of course) or quitting it all for a life on a tropical island will not address the the key issue: YOU. </p><p>You see, you can't pour a ton of PLEASURE into a hole that demands PURPOSE and expects things to get better – any more than you can satisfy a need for OXYGEN by eating more food. </p><p>So, invest in something that will enable you to unearth what really matters - the root issues that you can no longer ignore.</p><p>------</p><p><strong>See what others have said about Pad's coaching:</strong></p><p><em>“Ultimately, Pad's [personal coaching] program gave me a clear direction of where I would take my career and I was able to up my market value, role and pay. If I had not done the coaching, I'd still be unhappy in a role that didn't suit my skills and I would never have realised how to use my strengths in the business world.\"  </em><strong>Jennifer C. </strong>San Francisco</p><p><em>\"Pad's a very good speaker; animated, enthusiastic. He connects well with people…a nice, relaxed pace so you could follow easily. He has lots of penetrating insights. Now I have the tools to know what to do and – as opposed to before when I was just floundering.\"</em><strong>Martin D</strong> – General Practitioner. UK</p><p><em>\"Before I was frequently feeling quite overwhelmed – and the feeling of empowerment and confidence that has given me I can't fully put into words.</em><em>\"You've unearthed some core issues that have been negatively affecting my life and have brought me to a totally new place. I can feel the change in my mind and body. I literally feel like a new man – I feel whole in a way I haven't felt for...well, ages!\" </em><strong>Hardy S - </strong>Corporate Manager</p>", 
    "end_date": null, 
    "title": "Crisis Resolution - Finding Purpose, Direction & Fulfillment", 
    "price": "20.00", 
    "instructors": "Pad .", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453738_2c36_3.jpg", 
    "course_url": "https://www.udemy.com/midlife-crisis-resolution/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-22T10:34:34Z"
}