{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>Supercharge Your Critical Thinking!</strong></em></p><p>This is a complete basic course on PRACTICAL critical thinking, problem solving and decision making. </p><p>The course is for anyone who wants to improve his or her ability to think more efficiently.</p><p>It teaches how to organize your thinking so you can make confident decisions, set and achieve goals and lead a purpose driven life.</p><p>For anyone who already has some of these skills, this course acts as a refresher and provides new and unique ways of viewing the world and how to make your mark.</p><p>The course was created to fill a gap that many schools leave when teaching the higher order thinking skills.</p><p>The concepts are straight forward, however they take time, concentration and diligence to master, just like anything worthwhile.</p><p>The basic course (excluding BONUS Exercises) is designed to take 30 minutes or less a day for 21 days.  However, depending on your knowledge and experience it may take more or less time.</p><p>The course includes:</p><ul><li><em><strong>High impact videos</strong></em> to explain the subject matter.  Concepts are explained, an example of people history who mastered these skills are studied; and tools, techniques and methodologies are explored. </li><li><em><strong>Detailed Documents</strong></em> cover the subject matter in depth and help you internalize it further.</li><li><em><strong>Intermittent Quizzes</strong></em> are provided to help strengthen your knowledge further.</li><em><strong></strong></em><li><em><strong>BONUS Exercises</strong></em> are provided to build your practical critical thinking , decision making, and problem solving skills further.<br><br>If you need this course please sign up now.  You have nothing to lose.  There is a 30 day money back guarantee!</li></ul><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Critical Thinking in Action", 
    "price": "30.00", 
    "instructors": "Chuck Clayton", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600894_603a_4.jpg", 
    "course_url": "https://www.udemy.com/supercharge-your-critical-thinking/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T22:30:39Z"
}