{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>Este es un Curso que Autoprotección Personal que te enseñara a <strong>evitar, prevenir, identificar, analizar, mentalizarte para el posible enfrentamiento y enfrentarte</strong> a posibles situaciones potencialmente peligrosa para tu integridad física o incluso tu vida.</li><li>¿Quién no conoce a nadie que le han robado el bolso, la cartera, etc o incluso lo ha sufrido en su propia persona?</li><li>Este Curso <strong>no es un curso de defensa personal,</strong> es un curso enfocado a <strong>cambiar tus hábitos de vida</strong>, los que te hacen vulnerable, por otros que aumentarán exponencialmente tu seguridad en detrimento de la vulnerabilidad, para evitar y prevenir dichas situaciones.</li><li>Este curso te enseñara, porque puedes ser o te puedes convertir en <strong>objetivo</strong> de una de estas situaciones, y como evitarlo.</li><li>Si la situación es insalvable, porque no se ha podido evitar o prevenir, este curso te enseñara a como <strong>prepararte mentalmente para el posible enfrentamiento, y las técnicas de artes marciales </strong>más apropiadas para <strong>resolver</strong> cada enfrentamiento, seleccionadas de Boxeo, Judo, Aikido, Brazilian Jiu-jitsu, Kung-fu, Sayoc kali y Kobudo.</li><li>¡Saca lo mejor de tí!, pasea tranquilo por la calle, <strong>sabiendo que estas preparado para enfrentarte</strong> a cualquier situación de la vida cotidiana.</li></ul>", 
    "end_date": null, 
    "title": "Curso de Autoprotección: Disfruta de tu vida sin límites", 
    "price": "20.00", 
    "instructors": "Jose González", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723040_f8f7_2.jpg", 
    "course_url": "https://www.udemy.com/curso-de-autoproteccion-disfruta-de-tu-vida-sin-limites/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T19:08:35Z"
}