{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>¿Desea mejorar tu capacidad de amar?  </p><p>¿Fortalecer esa capacidad podría mejorar tus relaciones con tu familia, tus colegas y las demás personas con quienes relacionas?</p><p>Algunos autores afirman que al fin de la vida, estaremos llamadas a responder la pregunta: ¿Cuánto has amado?  Si te tocara responder esta pregunta ahora, ¿estarías satisfecha con tu respuesta?</p><p>Este curso, que consiste en 21 lecturas, incluyendo 15 videos, describe prácticas sencillas pero eficaces que te ayudarán a fortalecer esta importante capacidad.</p><p>El curso comienza explorando la \"naturaleza del amor\", analizando su efecto tanto en el bienestar físico como emocional, y su aporte a los trabajos en grupo y a la sociedad en general.  A la vez, presenta descripciones de varios autores que llevan a la conclusión que el amor no es simplemente un sentimiento que nos ocurre, sino una capacidad que podemos desarrollar conscientemente. Al terminar esta sección podrás explicar claramente tu comprensión de lo que es el amor y las razones que deseas aumentar esta capacidad.</p><p>Luego, el curso analiza la relación entre los pensamientos y las acciones, llevando a la conclusión que para actuar con amor, hay que comenzar por llenar los pensamientos del amor.  Continúa presentando varias prácticas que fortalecen los pensamientos de amor, seguido por prácticas que motivan las acciones de amor.  Al terminar esta secciones tendrás una caja de herramientas prácticas que puedes utilizar tanto para desarrollar esta capacidad.</p><p>Ya que una cosa es saber y otra, actuar, la próxima sección explora algunos de los obstáculos que a menudo surgen al tratar de desarrollar el hábito de utilizar las prácticas.  A la vez, da sugerencias prácticas de cómo enfrentarlos. Conociendo estas estrategias, no te desanimarás si te surgen algunos de estos obstáculos, ya que sabrás cómo enfrentarlos.</p><p>El curso termina presentando tres ámbitos en que estamos desafiados a desarrollar el amor, invitándote a escoger uno de ellos para concentrar tus esfuerzos iniciales, definiendo acciones específicas que vas a tomar.</p><p>Si haces el esfuerzo de poner en práctica aún algunas de las prácticas incluidas en este curso, te sorprenderás agradablemente al observar cómo avanzas en la capacidad de brindar amor a las personas que te rodean.</p>", 
    "end_date": null, 
    "title": "Cómo Fortalecer Tu Capacidad de Dar Amor", 
    "price": "20.00", 
    "instructors": "Juanita Hernandez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442214_8b18_4.jpg", 
    "course_url": "https://www.udemy.com/como-fortalecer-tu-capacidad-de-dar-amor/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-08T21:38:52Z"
}