{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Ayudar a otros a desarrollar nuevas destrezas es una actividad en que todos participamos de una manera u otra.  Los padres de familia orientan y guían a sus hijos.  En el trabajo orientamos  a nuestros  colegas.  Los maestros, animadores, tutores y coordinadores en los programas del Instituto Bahá'í acompañan a sus participantes en el desarrollo de cualidades espirituales y destrezas del servicio.  </p><p>Este curso mejorará tu desempeño de esta importante capacidad.</p><p><strong>Desarrolla Actitudes y Destrezas  para Dar un Acompañamiento Eficaz</strong></p><ul><li>Analiza tus actitudes</li><li>Da felicitaciones que motivan el esfuerzo</li><li>Trabaja hombro-a-hombro, dando guía y sugerencias positivas</li></ul><p><strong>Fortalece Esta Capacidad del Liderazgo Moral que Mejora las Relaciones Humanas</strong></p><p>La capacidad de dar aliento es una de las 18 capacidades del liderazgo moral que cualquier persona pueda ejercer para aportar a la unidad y el progreso de su familia, equipo, u organización.  </p><p>La capacidad de dar aliento tiene una doble función.  Aporta a mejorar las relaciones humanas entre los miembros del grupo y a desarrollar las capacidades de sus miembros.</p><p>Al finalizar el curso podrás ejercer conscientemente esta capacidad, aumentando la unidad entre los miembros de tu grupo y su capacidad de aportar a las metas y propósito de la organización.</p><p><strong>¿Qué voy a aprender en este curso?</strong></p><p>•\tDistinguir entre una actitud de escasez y una actitud de abundancia y su influencia en las acciones</p><p>•\tAnalizar el impacto de una actitud de aceptación</p><p>•\tEjercer el poder de las expectativas positivas</p><p>•\tFelicitar de manera que motiva a otros a esforzarse más</p><p>•\tGuiar a personas que están aprendiendo destrezas nuevas</p><p>•\tAcompañar a otros con una mirada apreciativa</p><p><strong>¿A quién está dirigido?</strong></p><p>• Toda persona en una posición de guiar, educar o supervisar a otros.</p><p>•\tPersonas comprometidas con practicar el “liderazgo moral\" en su vida</p>", 
    "end_date": null, 
    "title": "Cómo Alentar y Acompañar a Otros, Potenciando su Capacidad", 
    "price": "20.00", 
    "instructors": "Juanita Hernandez", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585436_ab76_2.jpg", 
    "course_url": "https://www.udemy.com/como-alentar-y-acompanar-a-otros-potenciando-su-capacidad/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T14:35:22Z"
}