{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>El taller en línea <em>Cómo Vencer la Timidez y la Fobia Social en 14 Días</em> es un plan completo de ejercicios que te permitirá sentirte más cómodo en toda clase de situaciones sociales y te ayudará a resolver de una vez por todas el problema de la timidez y de la fobia social.</p><p><strong>Aprende a Tener Mayor Seguridad en Ti Mismo a Través de la Ingeniería Hipnótica</strong></p><ul><li>Siéntete más seguro en toda clase de situaciones sociales</li><li>Conviértete en una persona más comunicativa</li><li>Desarrolla tu seguridad y confianza en ti mismo</li><li>Aprende a dirigir tus emociones</li><li>Realiza ejercicios simples durante 14 días y obtén resultados sorprendentes</li></ul><p><strong>A través de actividades muy sencillas que realizarás durante 2 semanas (y que te tomarán en promedio media hora al día), vas a reprogramar tu mente inconsciente de manera definitiva.</strong></p><p>¿Alguna vez has dejado pasar una oportunidad porque tenías miedo de lo que pensarían de tí o porque te pone nervioso hacerte notar? ¿La fobia social te domina y te limita?</p><p>Yo sé lo frustrante que puede ser, porque yo también lo viví. Y tardé varios años antes de encontrar una solución a este problema...</p><p>¿Alguna vez has pasado días (o semanas, o meses) armándote de valor para poder hablar con alguien o para poder decir algo o pedir algo o dar tu opinión respecto a algo importante?</p><p>¿Te sientes invisible? ¿Te gustaría ser más sociable?</p><p>Piénsalo: ¿qué tanto has perdido, cuánto te ha costado y de qué maneras te limita la timidez? ¿Cómo sería tu vida si tuvieras mayor seguridad y confianza en tí mismo, si tuvieras una más alta autoestima y fueras más social?</p><p>Para poder completar este taller y acabar con la fobia social, necesitas de 14 días y alrededor de 30 minutos al día, nada más. Eso sí, ES MUY IMPORTANTE QUE HAGAS TODOS LOS EJERCICIOS.</p><p>Cada día, recibirás una pequeña explicación del proceso para que entiendas como va sucediendo el cambio y tendrás que hacer algunos ejercicios. Empezaremos algunas \"meditaciones\" y movimientos físicos (sí, te enseñaré como puedes mover tu cuerpo para desarrollar tu seguridad y autoestima) para enseñarte a manejar tus emociones y una vez que tengas las bases, usaremos algunos ejercicios de interactuar con otras personas para poner en práctica tus nuevas habilidades. Además, escucharás unas grabaciones hipnóticas en diferentes puntos del proceso que te ayudarán a hacer más fácil la reprogramación de tu inconsciente.</p><p>Al invertir este tiempo en la transformación de tu mente, vas a obtener resultados permanentes porque no sólo te voy a decir como dejar de sentir fobia social sino que además te voy a guiar a través del proceso que te permitirá re-programar tu mente para que, de manera automática e inconsciente, tengas seguridad y confianza en tí mismo, de manera natural porque utilizaremos los mecanismos mentales que ya existen y que ya funcionan en tí. Además, descubrirás que obtendrás resultados muy rápidamente pero también notarás que incluso después de terminar el taller, tu seguridad y tu confianza en ti mismo así como tu autoestima y tu capacidad para relacionarte con los demás, seguirán creciendo y creciendo, exponencialmente (como una bolita de nieve que empieza a rodar por el lado de una montaña y se transforma en una avalancha)...<br></p><p>Si quieres tener mayor seguridad y confianza en tí mismo, vas a sentirte feliz de haber participado en este taller porque utiliza varias formas de hipnosis para reprogramar tu mente y obtener resultados rápidos y duraderos, lo que significa que en sólo dos semanas puedes comprobar por ti mismo la eficacia de este método que diseñé con base en mi experiencia ayudando a vencer la timidez y la ansiedad social a través de mi sitio web y mi canal de YouTube, además de en persona, tanto a amigos como a clientes.</p><p>Esta es una guía práctica que te dirá cómo hacer para, en sólo dos semanas, acabar por completo con la fobia social, la timidez y la inseguridad o incertidumbre que puedes tener respecto a ti mismo.</p><p>Así que si prefieres seguirte sintiendo nervioso en situaciones sociales y no decir lo que piensas, si te gusta tener miedo a hablar delante de un grupo de personas o sentir que tus piernas tiemblan y tu lengua se atora al hablar con una persona atractiva, si estás contento dudando de ti mismo y sintiendo inseguridad porque te gusta tu fobia social, entonces no te inscribas en este taller y no mires atentamente los videos del curso y no hagas todos los ejercicios en orden y no escuches las grabaciones hipnóticas que se incluyen con este curso porque si lo haces, no vas a poder recuperar tu timidez ni aunque así lo quieras.</p><p>Inscríbete ahora y comprueba por tí mismo lo divertida y productiva que es la vida cuando eres libre de las \"fobias sociales\" y recuerda que, gracias a udemy te ofrezco una garantía total de 30 días lo que significa que tienes amplio tiempo para probar y comprobar por tí mismo la eficacia de este taller y el valor de esta inversión que cambiará tu vida para siempre.</p><p>¿Estás listo?</p>", 
    "end_date": null, 
    "title": "Cómo Vencer la Timidez y la Fobia Social en 14 Días", 
    "price": "40.00", 
    "instructors": "Rogelio Consejo", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707214_2a25_2.jpg", 
    "course_url": "https://www.udemy.com/pierde-la-fobia-social-y-la-timidez-en-dos-semanas/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-26T21:35:32Z"
}