{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Todo momento en la vida es un buen momento para buscar un cambio. Estás listo para lograrlo?</p><p>Si estás leyendo esto al final de un año, tienes la energía para crear un nuevo año basado en tus nuevas resoluciones lo antes posible, y además lograrlo.</p><p>Si estás leyendo esto en otra fecha del año, debes saber que la determinación es la clave, la guía y lo que nos ayuda a que las cosas ocurran, sin importar la fecha del año cuando estamos listos para subirnos al siguiente nivel en nuestra vida.</p><p>La vida es un camino que hay que recorrer, lleno de lecciones y experiencias; de cada una de ellas aprendemos, crecemos y evolucionamos</p><p>Sin embargo, a veces no es así como sucede. Por qué ocurre de esta manera?</p><p>Porque todo en la vida es un proceso que no ocurre de la noche a la mañana!</p><p>Es cuando tomamos la decisión de dar un paso hacia atrás de donde nos encontramos, y respiramos profundamente que tenemos la fuerza de emprenderlo y vemos más claramente, de diferente manera y desde otra perspectiva.</p><p>Entonces, con coraje suficiente comenzamos a procesar cada episodio y se van abriendo delante de nuestros ojos, y entendemos lo sucedido. Somo ahora capaces de soltar, sin juicios ni implicaciones emocionales, la pesada carga que ya no necesitamos cargar en la mochila al caminar el camino de nuestra vida.</p><p>Al terminar el proceso, comprendemos la lección y ocurre un cambio en nuestra mente al caminar más livianos nuestra vida, disfrutándola de una nueva manera.</p><p>No todas las personas son conscientes del \"propósito de su vida\", lleva tiempo el, descubrir dentro de nosotros mismos la información que nos permite verbalizarlo y volverlo una frase. Todos poseemos una visión, una misión y una pasión; cuando somos capaces de integrarlas podemos ver la figura frente a nuestros ojos sin esfuerzo: allí está nuestro propósito! Nunca más caminaremos a ciegas hacia nuestra meta.</p><p>Desde ahora estaremos alertas de las opciones de las que podemos elegir para lograr el éxito que vinimos a experimentar, viviendo nuestra preciada vida.</p><p>Debemos tomar la decisión que nos llevará a revelar \"el mapa del tesoro del destino de nuestra vida\". Nadie lo puede hacer por nosotros.</p><p>Estás listo para comenzar a andar por el fantástico camino que te lleva a vivir tu vida con propósito?</p><p>Si la respuesta es SI, sígueme ya que nunca lamentarás haberlo hecho y lo que vas a descubrir será de mucho valor en tu vida.</p><p>Qué dice la gente sobre mí y mi trabajo?</p><p><strong style=\"\">Astrid Denise Morgan – Lima - Perú :</strong></p><p>I met Esther many years ago, when our children were studying at the Franco Boliviano \" Alcide D'orbigny\" School. She struck me as a dynamic, positive, outgoing entrepreneur; in other words a modern woman with many interests and new, innovative ideas, who put them into practice very successfully. At the time, she produced spices and also tutored primary, middle school, high school, and University students in math, science, physics and chemistry. Whenever someone asked for a good tutor, the answer inevitably was:\" Call Esther Iberkleid, she's the best.\"I was able to ascertain this a few years later, when my eldest child needed one. I obviously called Esther, and she proved to be all that was said about her and more. She helped my daughter to organize herself, acquire better study habits, enhanced her capabilities, learn the subject matter well, and as if that weren't enough, Esther gave her self esteem a great big boost. My daughter was able to clarify all her doubts and started looking at school with more confidence and self assurance, both gained during her tutoring. As a former teacher, I consider this to be a great asset in a tutor. I have seen many students who loose their confidence when they move into higher grades. It is not that they don't study, or don't know the subject matter; it is mainly that they loose faith in themselves due to various reasons. Subjects get tougher, they go into their teens and feel more vulnerable and are under the constant criticism of their peers, some even have teachers whom they fail to understand; or who undermine them. This causes children to lower their grades, and as they do so they start believing they aren't capable enough, which in turn makes them lower their grades even more. Esther is a teacher/tutor, who not only knows the subject she teaches well and is constantly learning more about it; but she is always improving herself in order to find additional ways to impart her lessons, making them interesting and effective. More importantly, she cares and helps students realize that they are capable of facing, and succeeding in any challenge they face.I admire Esther greatly. She has strength, is always positive, and will go out and do everything she needs to do, to reach her goal. It was only four years ago, that she told me about her new enterprise over a cup of coffee, and now the results are amazing! She is doing something she loves, is happy and is very successful at it. This is what we would all want to achieve in life, isn't it? ... and it is the reason why I feel that she is such a great role model. As a teacher, as a client, and as a parent I would highly recommend Esther. She is excellent at what she does, always seeking to be the best, and is always well informed on new trends, changes or improvements there are in her field. I am convinced that whatever Esther begins, or whichever goals she sets for herself, she will always reach them and be the best at what she does.</p><p>---------------------------------------------------------------------------------------------</p><strong style=\"\">Wendy Howard - Small Business Expert, helping Coaches, Trainers, Consultants to grow profitable businesses</strong><p>Esther has the most amazing energy which she brings to all of her work and clients. Her knowledge and experience is very in depth and she has a true gift of connecting and helping people - quite literally change their lives. She has a number of diverse programs and offers many tools for business and life directional changes. I would recommend anyone who wants to make positive change and have a wealthier life to work with Esther. Great person, great passion, great business!</p><p>---------------------------------------------------------------------------------------------</p><strong style=\"\">Sandy Hargrave, MA - Global Distributor at LifeVantage</strong><p>Esther has a passion for helping people to become all that they can be that is powerful beyond belief! She certainly works wonders with all of her clients. She is a masterful coach and teacher and amazing to watch. I have had the honor and privilege of working with Esther as a client, a coach and as a business partner. If you'd like to find your true purpose by finding the missing link to your wealthy, worthy life, then don't wait another minute. Let Dr. Esther be your guide. Sandy Hargrave, MACEO, Cruising Through Life - Seminars at Sea</p><p>---------------------------------------------------------------------------------------------</p><strong style=\"\">Arthur Partridge </strong>Specialist Practitioner of Neuro Hypnotic Repatterning at AyPeeCo<p>Esther is an extremely enthusiastic 'Well Being Coach'. As a coach, she sets high standards for herself and her clients and motivates them towards their dreams. She is never without energy and compassion and her attitude allows her clients to aspire even when they may not have the energy. She is never disappointed and is a true stand for both her clients and colleagues and achieves extraordinary results</p><p>---------------------------------------------------------------------------------------------</p>Elizabeth M. Lengyel - Career Strategist. Radio Host. Faculty, Conestoga College.<p>Esther is a beam of white light. Highly intuitive. Energetic. A tremendous capacity to excel in connecting others to their gifts and passions. A wise counsel with collective experience and knowledge to boost success.</p>", 
    "end_date": null, 
    "title": "Cómo planificar un año memorable en cualquier momento ", 
    "price": "50.00", 
    "instructors": "Esther  Coronel de Iberkleid", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588792_eef0_3.jpg", 
    "course_url": "https://www.udemy.com/como-planificar-un-anio-memorable-en-cualquier-momento/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T20:24:27Z"
}