{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Daily Magic - Bringe Magie in deinen Tag!  </strong>  </p>  <p style=\"\">  \t    Du hast ein tolles Buch über Transformation gelesen oder ein spannendes Seminar besucht und bist hochmotiviert, das Gelesene und Gelernte in die Tat umzusetzen. Bald merkst du jedoch, dass die Motivation nachlässt, weil die eine tägliche Praxis nicht immer in den Alltag integrierbar ist. Sie nimmt zu viel Zeit (und Energie) in Anspruch.  </p>  <p style=\"\">  \t                    An diesem Punkt setzen die Daily Magic Aktionen an:  </p>  <p style=\"\">  \t                    Sie machen den Transfer alltagstauglich.  </p>  <p style=\"\">  \t                    Und sind so effizient, dass du mit ca. fünf Minuten pro Tag hinkommst.  </p>  <p style=\"\">  \t                    Fünf Minuten pro Tag hat jeder übrig.  </p>  <p style=\"\">  \t                    Darüber hinaus lernst du auf einfache und spielerische Weise Highlights der Transformation kennen, die du gleich anwenden kannst, um dein Leben schöner, lebendiger und erfolgreicher zu gestalten!  </p>  <p style=\"\">  \t                    Jede Aktion wird mindestens 28 Tage lang durchgeführt. Alles, was du mindestens 28 Tage lang täglich wiederholst, wird zur Gewohnheit. Ausschlaggebend hierfür ist nicht die Dauer, sondern die Regelmäßigkeit der Anwendung.  </p>  <p style=\"\">  \t                    Deine Vorteile sind:  </p>  <ol style=\"\">  \t<li style=\"\">Du investierst nur fünf Minuten pro Tag. </li>  \t<li style=\"\">Die Aktionen sind einfach und mühelos durchzuführen.  </li>  \t<li style=\"\">Sie machen Spaß und bringen dich in eine gute Stimmung.</li>  \t<li style=\"\">Die Daily Magic Praktiken sind hocheffizient.</li>  \t<li style=\"\">Dein gesamtes Leben profitiert davon!  </li>  </ol>  <ul style=\"\">  </ul>  <p style=\"\">  \t                    Die Techniken sind so einfach, dass du sie beim Lesen und gleichzeitigem Ausprobieren erlernen kannst.  </p>  <p style=\"\">  \t                    Entdecke, was du mit fünf Minuten pro Tag an 28 Tagen bewirken kannst. Du wirst überrascht sein!  </p>  <p style=\"\">  \t<strong style=\"\">Daily Magic 01 - Dankbarkeit</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Bei der ersten Aktion geht es darum bewusst Dankbarkeit zu empfinden. </strong>  </p>  <p style=\"\">  \t      Wenn es nur eine Sache gäbe, die ich dir zum Praktizieren ans Herz legen könnte, dann wäre es die Dankbarkeit.  </p>  <p style=\"\">  \t      Dankbarkeit ist DER absolute Allrounder.  </p>  <p style=\"\">  \t      Dankbarkeit  </p>  <ul style=\"\">  \t<li style=\"\">    macht glücklich!  </li>  </ul>  <ul style=\"\">  \t<li style=\"\">    lässt dich auf andere Gedanken kommen. Du findest auf einmal Lösungen für deine Probleme, die du vorher nicht gesehen hast!  </li>  </ul>  <ul style=\"\">  \t<li style=\"\">    erhöht deine Energie. Mit mehr Energie kannst du deine Ziele leichter und schneller erreichen. Du manifestierst auch besser und schneller!  </li>  </ul>  <ul style=\"\">  \t<li style=\"\">    führt zu einem besseren und zufriedeneren Körpergefühl. Dein Aussehen als auch deine Ausstrahlung werden es dir danken!  </li>  </ul>", 
    "end_date": null, 
    "title": "Daily Magic 01 - Dankbarkeit", 
    "price": "30.00", 
    "instructors": "Mircea Ighisan", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/279376_a0cc_2.jpg", 
    "course_url": "https://www.udemy.com/daily-magic-01-dankbarkeit/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-12T11:30:01Z"
}