{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Collapse anchoring is a great technique for eliminating minor negative states. </p><p>Can you imagine if you could get rid of that nagging irritation that is constantly there?<br style=\"\">Imagine if frustration was a thing of the past !</p><p>Everybody has experienced these minor negative states before, and in varying contexts. <br style=\"\">Collapse anchoring is the technique for getting rid of them once and for all. </p><p>In this course, expert NLP trainer Matt Barnett describes the process of collapse anchoring a fabulous and powerful technique for eliminating minor negative states that are &#039;always present&#039; <br style=\"\">The course is comprised of slides and audio as well as video of Matt Barnett talking about the process and demonstrating aspects of it. <br style=\"\">Included in the course is a Script to assist you in using the technique with other people and reference is made to how to use the technique with yourself as well. </p><p>The course is structured in such a way as to layer and represent key information so that it is easily absorbed. </p><p>You can take this course and you may find that you could go through the entire course in a day and by studying this course, you will learn another way to take control of your thinking and your life and of course you will learn a great skill for helping other people as well. Which is always a good thing. </p><p><br style=\"\"></p><p><br style=\"\"></p><p><br style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Demolish Negative States Instantly - Collapse Anchors NLP", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/366922_7d2b_5.jpg", 
    "course_url": "https://www.udemy.com/demolish-negative-states-instantly-collapse-anchors-nlp/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-09T22:50:23Z"
}