{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Success doesn&#039;t happen by accident, it&#039;s intentional. </strong> <br style=\"\">This course will teach you to create intentional goals that set you up for success and significance. <br style=\"\"></p><p style=\"\"><strong style=\"\">Design Your Life</strong> - the blueprint to successful goals was created by three people that were tired of the same old goal setting process.  We had tried some of the biggest and best programs out there, but they all had two things in common.</p><p style=\"\">1. They didn&#039;t teach us HOW to execute.  All the information in the world won&#039;t help us if we don&#039;t know how to strategically apply it to our everyday lives.</p><p style=\"\">2. They weren&#039;t sustaining.  They got us excited and motivated for awhile, but that didn&#039;t last long. Pretty soon it was back to reality and we were struggling to stay on track towards achieving our goals.</p><p style=\"\">So we decided to put our noggins together and come up with our own system... and what do you know, we did it!</p><p style=\"\">All three of us have used this system over the last year to accomplish more than we ever have in any prior year.  No joke, this has been absolutely amazing.  We knew that if it was working for us, then it would work for others as well.  That means you!  And you... and you... and all of you.  </p><p style=\"\"><strong style=\"\">In this course you will have:</strong><br style=\"\">- 21 HD videos lectures<br style=\"\">- 21 Downloadable mp3 files for each lecture<br style=\"\">- 13 worksheets <br style=\"\"></p><p style=\"\"><strong style=\"\">You will learn to:</strong><br style=\"\">- Create goals that actually matter and will move you closer to the life you desire<br style=\"\">- Implement the habits and routines that you need to achieve those goals<br style=\"\">- Find the right partners that will encourage and support your success<br style=\"\">- And so much more...</p><p style=\"\">It&#039;s time to punch procrastination in the face.  It&#039;s time to take control of your life.  It&#039;s time to design the future you want.  It&#039;s time to create BIG goals and to ACHIEVE them.  </p><p style=\"\">We are not just instructors in this course, we are your partners.  </p>", 
    "end_date": null, 
    "title": "Design Your Life: Blueprint to Successful Goals", 
    "price": "20.00", 
    "instructors": "The Change Element, Tim Bartlett, Steven Ma", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603428_d9eb.jpg", 
    "course_url": "https://www.udemy.com/purposeful-goal-setting-turn-your-dreams-into-reality/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T17:03:04Z"
}