{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Does your life revolve around your loved one’s addiction? </strong> Are you ready to shift your focus to yourself? Detachment 101 is designed to bring awareness to the codependent tendencies that are holding you back and provide tools to begin emotionally detaching yourself from the addict in your life. </p><p><strong>The best way to support the addict in your life is to start taking care of yourself.</strong> What’s the hardest part of self-care? Getting started.  As a codependent, we are engrained with the idea that it is our job to be the caretaker, the fixer, the protector. </p><p>By being all of these things though, our dreams and true purpose gets left behind. Detachment can be overwhelming and scary. This course is meant to ease you into <strong>your transformational journey.</strong></p><p>We will begin the course talking about typical codependent behaviors, which will allow the student to gain some self-awareness about where they are now. We will then expand on a few core tools for detachment including self-reflection and care, effective communication and boundaries and releasing control. </p><p>The course will end with <strong>a personalized action plan</strong> for students to use to implement the strategies and processes more effectively.</p><p>We will cover:</p><ul>\n<li>Codependent tendencies</li><li>Self-awareness</li><li>Journaling</li><li>Effective Tools</li><li>Effective communication</li><li>Boundaries</li><li>And much more...</li></ul>", 
    "end_date": null, 
    "title": "Detachment - Learn How to Find Peace of Mind", 
    "price": "20.00", 
    "instructors": "Scott Paton, Clare Ng", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793128_7b0b_2.jpg", 
    "course_url": "https://www.udemy.com/detachment/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T02:09:05Z"
}