{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  This course has been developed from the feedback from <a href=\"https://www.udemy.com/detox-your-entire-life/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Detox Your Entire Life, Simply</a>  </p>  <p style=\"\">  \t  In this course, I will go into some of the subjects covered in Pt I, however in more detail. The topics range from exercise and physical wellness, decluttering, the law of attraction and manifestation, dealing with loneliness, becoming a powerful creator and getting what you ask for, and last but not least, how to listen to your own intuition.  </p>  <p style=\"\">  \tEverything about this program is meant to be experiential; which means the intention is for you to take what learn, put it into practice, and see and feel the difference. I do my best to use visuals, and there is a downloadable resource guide as a companion for the video material.  </p>  <p style=\"\">  \tThe videos have been created so that each day, you watch a video. This program should take you about a month to complete it in its entirety, little by little each day. For those who are keeners, you can probably get through this material in about a week! Either way is fine, the choice is up to you.  </p>  <p style=\"\">  \tWith the amount of stress and confusion in this world, literally ANYONE and everyone can benefit from this program. Most people will find there are 1 - 3 key segments that really to speak to you, and that is intended; they should be the areas that you focus on immediately.  </p>  <p style=\"\">  \tI LOVE teaching, so I do my best to answer any questions in our forum within 48 hours (usually better!) I am here to help you reclaim more freedom, happiness and health in your life.  </p>  <p style=\"\">  \t<a href=\"https://www.udemy.com/detox-your-entire-life/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\"></a>  </p>  <p style=\"\">  \t<a href=\"https://www.udemy.com/detox-your-entire-life/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\"></a>  </p>", 
    "end_date": null, 
    "title": "Detox Your Life, Pt II", 
    "price": "25.00", 
    "instructors": "Tash Jefferies", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/97942_8683_4.jpg", 
    "course_url": "https://www.udemy.com/detox-life-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-26T17:56:28Z"
}