{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong><em>   LATEST: Course Updated Again On 1st of June 2016</em></strong></p>\n\n<p>  \t<em><em><strong>OVER 1,678 SUCCESSFUL STUDENTS HAVE TAKEN THIS 5-STAR COURSE</strong></em></em>  </p>\n\n<hr>\n\n<p>  \t                                  If you want to know:  </p>\n\n<ul>  \t<li>How your own personality sabotages your productivity and the achievement of your goals</li>  \t<li>The psychology of success: what is that specific trait that makes you different from successful people</li>  \t<li>Techniques through which you can align your 'mood' to work with your goals, in order to quickly achieve them</li>  \t<li>How to act better, faster and smarter when you need to</li>  \t<li>Techniques to motivate each type of personality</li>  </ul>\n\n<p>  \t                                  Then keep reading, because this course will change your life  </p>\n\n<p>  \t<strong>Solid ground for your personal development</strong>  </p>\n\n<p>  \t                                  This course is based on the MBTI Test (Myers-Briggs Type Indicator), the most thoroughly researched and validated personality test in the world, with applications in:  </p>\n\n<ul>  \t<li>Personal development</li>  \t<li>Organizational development</li>  \t<li>Consultancy and conflict mitigation</li>  \t<li>Individual coaching</li>  \t<li>Leadership skills and team development</li>  \t<li>Individual and family counseling</li>  </ul>\n\n<p>  \t                                  Using the results of this test ('your diagnosis'), this course will offer all you need so that you can develop your personality to its maximum potential!  </p>\n\n<p>  \t                                  I could tell you that:  </p>\n\n<ul>  \t<li>You will improve your relationships (you will better understand your parents, know why your best friends are always late or why they keep disappointing you and you will learn how to deal with and how to fix these types of situations)</li>  \t<li>You will thrive professionally (you will learn how to speak with your employer so that he will appreciate your work and how to handle uncooperative coworkers)</li>  \t<li>You will become a great communicator (you will always make a good impression and you will be able to communicate with people from all walks of life)</li>  \t<li>You will be able to grow personally (know yourself better, understand what triggers your actions, be aware of your weaknesses and how to correct them)</li>  \t<li>You will learn how to 'rid' yourself of your personality type in order to become a balanced person and to be happy with yourself</li>  </ul>\n\n<p>  \t<em>And I wouldn't be far from the truth.</em>  </p>\n\n<p>  \t<em>This course will teach you clairvoyance skills.<br>  \t                                   You will understand the internal reasoning behind your actions and those of the people around you and you will receive the tools needed to consolidate your personality and your social relationships.</em>  </p>\n\n<p>  \t                                  This training will help you:  </p>\n\n<ul>  \t<li>Better develop your relationships</li>  \t<li>Make profitable choices for your career</li>  \t<li>Stimulate your creativity</li>  \t<li>Increase your performance</li>  \t<li>Grow personally</li>  </ul>\n\n<p>  \t<strong>CONTENT</strong>  </p>\n\n<p>  \t<strong>1. Identify your MBTI pattern once and for all</strong>  </p>\n\n<p>  \t                                  Here I will present each type of personality, with relevant examples and detailed explanations so that you can know for sure what type of personality you have. At the end of this module you will identify your MBTI pattern once and for all. On your way toward personal development, you will know your qualities and your flaws and focus on what you need in order to achieve excellence.  </p>\n\n<p>  \t<strong>2. Understand the personality of others (+ 4 practical exercises) </strong>  </p>\n\n<p>  \t                                  In this module, for 4 days, you will receive exercises that will help you develop the skills you need to be able to tell the type of personality of those that you interact with. After these 4 days you will be able to guess the personality of others in the first few minutes of interaction. After only 5 minutes spent in someone's company, you will be able to figure out if they're a dreamer or an achiever, if they like to meet new people or if they like to read, how to determine them to act and what makes them tick. You will learn how to talk to your boss if you want to ask for a pay raise, as well as how to mediate conflicts and improve your relationship with those around you. You will be able to understand their needs and even speak their own language.  </p>\n\n<p>  \t<strong>3. Causes of stress</strong>  </p>\n\n<p>  \t                                  Each type of personality has certain stressful situations that it must deal with. In this module you will learn how to manage your stressful experiences. <br>  \t                                   Are you stressed at work? <br>  \t                                   Are imminent conflicts a constant source of frustration? <br>  \t                                   Do you need solutions to reduce emotional tension?<br>  \t                                    Read this module carefully!  </p>\n\n<p>  \t<strong>4. How to change your personality type (+ 4 practical exercises)</strong>  </p>\n\n<p>  \t                                  In this module you will learn the answer to the question: 'How do I change my personality type?'. You will learn applicable techniques from my experience as well as from actual studies put forth by famous psychologists. The subject of this chapter will have a profound impact on your personal development. For 4 days you will see things from the perspective of other personality types, understand them better and identify their strong points as well as their weak ones.  </p>\n\n<p>  \t<strong>5. Communication channels between personality types</strong>  </p>\n\n<p>  \t                                  How can a person who cannot see the forest for the trees communicate with a person who cannot see the trees for the forest? Can introverts have extrovert partners? What is the importance of emotions when making decisions in your love life, as well as in your social and professional life? After this chapter you will become a full-fledged linguist. A linguist of personality types. You will be able to communicate with any type of personality, motivate those close to you to help you achieve your goals and you will master the 'foreign language' of the opposite sex.  </p>\n\n<p>  \t<strong>6. Your personal development plan</strong>  </p>\n\n<p>  \t                                  'Your personality plan' is the highlight of this course.<br>  \t                                   This plan will permanently accompany you throughout your life. With its help, you will succeed, step by step, to correct your flaws and develop your skills. By following it, you will be personally, professionally and socially successful. This plan is necessary for any person who wishes to build the foundation of a successful personality.  </p>\n\n<p>  \t<strong>7. Other resources (deepen your studies)</strong>  </p>\n\n<p>  \t                                  According to the feedback that I will receive during the training, I will add tools to help you reach your full potential as well as other materials on themes that my students ask for!  </p>\n\n<p>  \t<strong>Bonuses</strong>  </p>\n\n<p>  \t<strong>1. Plan of action and homework for each material</strong>  </p>\n\n<p>  \t                                  Homework is practical and you will be doing it in your day to day interactions. By doing it you will develop a sixth sense. A sense that will allow you to communicate at a completely different level professionally, as well as socially.<br>  \t                                   This training is based on a new concept that is very popular all around the world.<br>  \t                                   You will not have to study any theory or do any theoretical homework. In every material, I have included written exercises, as well as practical exercises that will develop skills needed in real life.  </p>\n\n<p>  \t<strong>2. I personally guarantee that you will be satisfied by this course. If not, I will give you your money back</strong>  </p>\n\n<p>  \t                                  Because I believe in this product, if you are not satisfied, I will give you your money back and you can also keep all the materials that you received up to that point.<br>  \t                                   During the first two weeks after you have made the payment, you can stop taking the course and receive your money back just by sending me an e-mail.  </p>\n\n<p>  \t<strong>3. Interactivity and materials tailored after your needs</strong>  </p>\n\n<p>  \t                                  Seeing the answers to my surveys, I learned that my students need to communicate with their trainer. Therefore, in this course I have taken interactivity to a completely different level!  </p>\n\n<p>  \t                                  Apart from communicating privately and answering all of your questions, I have built this course so that I can provide new materials based on the needs of my students. In other words, apart from what I promised to offer in the course, I will add materials based on your questions!  </p>\n\n<p>  \t<strong> About Vaida Bogdan</strong>  </p>\n\n<p>  \t                                  Personal development trainer with more than 5 years experience in the field (has held training sessions in organizations such as Business Administration College, Toastmasters, Avantaj la start, Zenf, Jobshop, Economia de la A la NOI L.S.F.E.E., Impulsul, FiiLiber, BEST, OSUT)  </p>\n\n<p>  \t<strong>  Founder of the following projects:</strong>  </p>\n\n<p>  \t              Online Personality Tests DOT org is a website dedicated to personal development based on your personality type. It will help you discover your type, make decisions in life based on your strong points, as well as help you understand the people you interact with.  </p>\n\n<p>  \t                                   Numer of active members participating in this project (when this course was released): 9600  </p>\n\n<p>  \t                                  Teste Psihologice DOT net is the Romanian version of Online Personality Tests.  </p>\n\n<p>  \t              Câștigă Timp DOT ro is the first Romanian website dedicated to personal productivity. It offers materials on productivity, efficiency, motivation and concentration.  </p>\n\n<p>  \t                                   Numer of active members participating in this project (when this course was released): 8300.  </p>\n\n<p>  \t              CursulOnline DOT Castigatimp DOT ro - The first online time management course in Romania! This training is the result of 11 months of work, during which I brought my live courses (time management courses held at dozens of companies and hundreds of events) to the online environment.  </p>\n\n<p>  \t              Motivatie DOT Castigatimp DOT ro - The main purpose of the Secrets of Motivation training is to make you an achiever, a person who can be self-motivated for long periods of time. I have brought to the online environment a training that I have been holding at different events for the past 3 years and that has had great success.  </p>\n\n<p>  \t<strong>  Here is how you can participate in this training</strong>  </p>\n\n<p>  \t<strong>First of all, I want to tell you that this is an ADVANCED course that you can take for the price of a beginner's course!</strong>  </p>\n\n<p>  \t<strong>Why?</strong>  </p>\n\n<p>  \t                                  I started this training program with a group of 20 participants in the online Castiga Timp course, participants that have been part of the first series of videos and exercises. Their feedback has helped me create this course, according to their needs.  </p>\n\n<p>  \t                                  Next year I'm planning to release the course at full price, which will probably be 150$.  </p>\n\n<p>  \t                                  Right now you can get the full course for under 100$, way less than the final price!  </p>\n\n<p>  \t                                  I'm doing this for one specific reason.  </p>\n\n<p>  \t                                  The content of the present course is 80% the same with the one that will be released next year, but I plan to add some more materials based on the needs of my students. This means that I will create the materials that you want! (and you will have access to them)  </p>\n\n<p>  \t                                  So besides the price cut, you will receive, as a bonus, materials based on your questions and on the problems that you are confronted with!  </p>\n\n<p>  \t                                  Moreover, Udemy offers you a 100% money-back guarantee.<br>  \t                                   You will get all your money back if you are not satisfied.<br>  \t                                   Basically, there's no risk for you!  </p>\n\n<p>  \t<strong>Take this course now!</strong>  </p>", 
    "end_date": null, 
    "title": "Develop your Social Intelligence", 
    "price": "30.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/95676_ca4a_11.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-personality/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-22T12:55:25Z"
}