{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Welcome To Develop A Winners Mindset - The Power of Positive Thinking! </strong></p>\n\n<p><strong>⇉ Watch the promo video</strong> to see How You Can Develop A Winners Mindset</p>\n\n\n\n<p><strong>⇉ Join Over 100,000+ </strong><strong>Students</strong> Who Have Enrolled In My Udemy Courses This Year!<br></p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews</strong> Shows Students Who Enrolling Are Getting Real Results!<br></p>\n\n\n\n\n\n<p><em>\"The course is straight to point as promised. Nice course to boost your zeal for success.\"</em></p>\n\n<p><em>-</em><em>Veera Venkata Durga Prasad Chimmili</em></p>\n\n\n\n<p><strong>⇉ This Course is Built For Speed! Start Getting Results In Less Than 1 Hour! </strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>In This Course You Will Learn All About:</strong></p>\n\n\n\n<ol><li><strong>The Power of Positive Thinking and How To Develop A Winners Mindset! <br></strong></li></ol>\n\n\n\n<p>Thinking positive and developing a winning mindset is a skill and can be developed. Having the ability to stay positive and develop a winning mindset will help you achieve success in every area of your life! Since Mark and I have developed these skill-sets our lives have truly transformed for the better. We have amazing relationships, love our families, schools, businesses, and are achieving amazing results in our own personal lives. You can have all of this and so much more be developing these two skill-sets. </p>\n\n\n\n<p><strong>You Will Also Learn How:</strong></p>\n\n\n\n<ul><li>How Positive Thinking is only Half of the equation</li><li>How to become the best version of yourself</li><li>How to begin taking the necessary actions to change your life forever</li><li>Start getting amazing results in your life</li><li>So much more! </li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards <strong>Developing A Winners Mindset and a Positive Attitude! </strong></p>\n\n\n\n<p>When I learn something new, I add it to the course - at no additional cost to you! This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p>In addition to the <strong>Udemy 30-day money back guarantee</strong>, you have my personal guarantee that you will love what you learn in this course.</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em class=\"redactor-inline-converted\">What I can't do in this Course..</em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">I can't guarantee your success – this course does take work on your part. But You Can Do It!</em> </p>\n\n\n\n<p><em class=\"redactor-inline-converted\">I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em class=\"redactor-inline-converted\">__________________________________________________________________________</em></p>\n\n\n\n<p><strong>This course will not remain this price forever! It's time to take action!</strong></p>\n\n\n\n<p>Click the <strong>\"take this course\" </strong>button at the top right now!</p>\n\n\n\n<p>...<em class=\"redactor-inline-converted\">every hour you delay is costing you money</em>...</p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p>Sincerely,</p>\n\n\n\n<p><strong>Joe Parys &amp; Marc Guberti</strong></p>", 
    "end_date": null, 
    "title": "Develop A Winners Mindset - The Power of Positive Thinking", 
    "price": "20.00", 
    "instructors": "Joe Parys, Marc Guberti", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/651372_ef8d_2.jpg", 
    "course_url": "https://www.udemy.com/powerofpositivethinking/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T16:08:40Z"
}