{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>&#039;Each person&#039;s greatest room for growth is in the areas of his or her greatest strength.&#039; – Donald Clifton</p><p>This course distills research from psychology and neuroscience from all over the world into lessons and steps that you can take to discover and use your strengths.</p><p><strong style=\"\">Find out what your strengths are and start using them in your life</strong></p><ul style=\"\"><li>Learn how to work with strengths</li><li>Spot your strengths and the strengths of others</li><li>Understand your character strengths</li><li>Learn how to handle weaknesses</li><li>Put your strengths into action</li></ul><p><strong style=\"\"></strong></p><p><strong style=\"\">Start using your strengths and see your world differently</strong></p><p>Using your strengths is like putting on a different pair of glasses. You can look at your entire life from the perspective of strengths – the possibilities are endless. It&#039;s an easy approach that doesn&#039;t require you to practice for years and years to see results. You can start using your strengths right away and it won&#039;t be long until you see a difference. And there are many ways you can benefit from it. Scientists are continuously finding new benefits. Using your strengths will eventually leave you happier and less stressed, increase your self-esteem and give you energy and vitality.</p><p>One more thing: You have a totally unconditional money back guarantee. It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free.</p><p><em style=\"\">Click the &quot;Take This Course&quot; button now and enroll!</em></p>", 
    "end_date": null, 
    "title": "Discover Your Strengths", 
    "price": "25.00", 
    "instructors": "Manuel Kraus", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325054_bc28.jpg", 
    "course_url": "https://www.udemy.com/discover-strengths/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T18:35:34Z"
}