{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>This is a big moment for you: You will be discovering and uncovering your Purpose on planet Earth - adding certainty and clear direction in every thing you do. Knowing this information will empower you at home, at work, and – especially – inside yourself. See below how top successful business moguls and celebrities are guided daily by their Purpose Statements (same as a Mission Statement). </em>-Anthony Dallmann-Jones PhD, your instructor.<br></p><p><strong>Develop the Compass for Your Life, Showing You the Way in Every Decision and Problem You Face From This Moment On.</strong></p><p>Building out your Purpose will change everything in a rapid and positive way:</p><ul><li>You will definitely be more cool and confident</li><li>You will have a template for success you can use in your personal and work life</li><li>Your self-esteem will be positive and action-oriented, manifesting your Purpose daily</li><li>Decision-making will be exponentially easier</li><li>Say good-bye to anxiety over that constant question, ‘What do I do next?</li><li>Problem-solving will be a positive experience rather than a confusing one</li><li>You will grow from your mistakes - positive outcomes every time</li><li>Many of your stressful situations will disappear forever</li><li></li></ul><p><strong>A Powerful Mind Laser for Cutting an Empowering Swath Through Your Personal and Business Life</strong></p><p><strong>Overview</strong></p><p>Denise Morrison, the very successful CEO of Campbell Soup Co. admits it took her long time to craft her personal mission statement because she did not have a template that worked for her. Oprah Winfrey claims her mission statement is responsible for her being where she is today, one of the wealthiest women in the world. Every major corporation on the stock market has a strong statement of purpose. So, why shouldn’t you? By knowing your Purpose you remove one very large block to your growing success!</p><p><strong>Purpose is not a gimmick. </strong>It’s not simply the flavor of the month. It’s the key ingredient behind every business and personal decision you make. If you flounder more than you think you should this is the reason: You NEED a Purpose that is clearly stated.</p><p><strong>Take a look at companies that are operating on purpose. </strong>Examples of successful purposeful driven companies include Walmart, Virgin and BMW. These companies have weathered the past recession better than most. That’s because decisions are made based on purpose. For example, every decision Southwest Airlines, one of the most successful of all the airlines, makes is based on whether or not the outcome is in alignment with their purpose.</p><p>What gives people the edge? A clear sense of direction! It is estimated that 99% of the population on Planet Earth has no personal Purpose Statement, no Mission. That would explain a lot, wouldn't it? Why? Because a clear Purpose improves your strategic alignment of <em>what and why</em> with expenditure of your two most valuable resources: <strong><em>Time and Money</em></strong>. A Purpose brings clarity and confidence and exponentially increases positive results when spending these two important resources.</p><p>In conducting a meta-analysis of 49,928 business units across 192 organizations representing 49 different industries in 34 countries, Gallup scientists discovered that in business a strong mission promotes brand differentiation, consumer passion, and brand engagement. Unfortunately, only about 40% of employees know what their company stands for and what makes its brand different from its competitors'. “This lack of brand awareness is not a marketing problem; it is a mission-driven leadership and management problem,” states the Gallup research. And it is a huge problem called <em>failure.</em></p><p>Acceleration in your success all begins with a personal Purpose Statement! It is those unique individuals with a clear sense of mission that succeed well in business and in life. No matter what profession, job, or situation in which you find yourself, progress will occur much faster with a laser-like clarity oft Purpose.</p><p><strong>Specifically how does a Purpose or Mission Statement help you?</strong></p><p>Frankly said, discovering your Purpose will change everything in a fast and positive way. It provides you with a confidence in your daily personal and business life and a clarity in your deliberate actions. It is quite obvious that knowing your Purpose will increase your self-esteem. You will KNOW why you are here on Earth, and that adds an element of determination that carries you past failures and mistakes that always happen to successful people.</p><p>The Discover Your Purpose process provides you with a template you can use over and over again in your personal and professional life. It will remove much of the angst that comes from making tough decisions and problems, because problems quickly become the best thing that happened to you because you have a crystal clear flashlight beam to help you work through them and grow stronger.</p><p>Sir Richard Branson states, “<em>My success in my personal and career lives is because of my statement of purpose that I developed long ago.</em>”</p><p>Isn’t it time you got ON PURPOSE?</p><p><br></p>", 
    "end_date": null, 
    "title": "Discover Your Purpose - In 30 Minutes!", 
    "price": "20.00", 
    "instructors": "Dr. Anthony Dallmann-Jones", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/671682_03f9_2.jpg", 
    "course_url": "https://www.udemy.com/discover-your-purpose-in-30-minutes/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T21:55:22Z"
}