{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t            There are many books, articles, and courses about how to improve business communication, relationships, productivity, employee performance, resolve conflict in the workplace, and more. This course offers a unique perspective and powerful teaching for managers, team leaders, entrepreneurs, employees, vendors, and more: everyone and everything has a soul, and when we apply the power of soul, every aspect of business and finances can flourish.  </p>  <p>  \t            Master Mirva Inkeri presents soul wisdom, knowledge, and highly effective practical techniques for business and finances that require no special skill set, yet produce results that are powerful and long-lasting.  </p>  <p>  \t            E-learners will learn the Four Power Techniques and how to apply them, how to promote teamwork and improve relationships through soul conferencing and Forgiveness Practice, creating a peaceful and harmonious workplace, simple techniques and practices for leading effective meetings, resolving conflict, removing blockages with projects in order to meet deadlines, and much more.  </p>  <p>  \t            Anyone can benefit from the profound wisdom and practices presented in this inspiring e-learning course as the principles can be applied in business, personal relationships, and more. Learners can pace themselves through a series of 48 short videos which total 6 hours. Handouts are included for key concepts and practices.  </p>  <p>  \t            This course is taught by Master Mirva Inkeri, Worldwide Representative, Divine Channel, and Disciple of Dr. and Master Zhi Gang Sha. Master Mirva is an exceptional teacher, soul healer, and soul communicator.  </p>  <p>  \t            Master Mirva was born in Finland and lived in England, Canada, and Germany. Her work history is mainly in the corporate arena, where she worked for over 15 years in global multinational organizations. She is also an accredited Executive Coach and an administrator of personality assessment tools such as Q12 and Myer&#039;s Briggs Type Indicator.  </p>  <h4></h4>  <p>  \t            With a professional background in leadership development, Master Mirva uses Soul Power techniques to offer life guidance for career choices and challenges at work. Master Mirva dedicates her life to assisting others in awakening the power of their soul.  </p>", 
    "end_date": null, 
    "title": "Divine Healing Hands Transform Daily Business and Finances", 
    "price": "30.00", 
    "instructors": "Zhi Gang Sha, Mirva  Inkeri", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321316_b68a_6.jpg", 
    "course_url": "https://www.udemy.com/dhh-transform-business-finance/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-17T04:52:41Z"
}