{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">At Last! Interpret Your Dreams Without a Dream Dictionary!</strong></p><p>Introducing the First Comprehensive Dream Interpretation Video Course Online!</p><p>I Interpret a Dream in Less Than 5 Minutes. These Video Lessons Show You How I Do It…</p><p>This dream interpretation course includes:</p> <ul style=\"\"><li>12 Short, fun video lessons with spiritual teacher, Brandy Price </li> <li>3 Easy Ways to Interpret Your Dreams</li> <li>The Simple Dream Interpretation Process that Always Works</li> <li>Real academic information and techniques from the classic dream interpreters</li> <li>Academic theories behind dream symbols in easy-to-understand language</li> <li>Video course on Numerology</li> <li>Video course on Color Theory</li> <li>Video Course on the characters that show up in your dreams</li> <li>Spiritual gifts revealed in your dreams</li> <li>The universal language of dreams, and much more!</li> <li>A simple and efficient way to interpret your dreams quickly and effectively</li></ul> <p>You won&#039;t need that useless dream dictionary or to pay a spiritual advisor for your dream interpretations. There is nothing to read – it is all taught with images and your instructor presenting the material. There is nothing else out there that is like this – you can find parts of this information in academic courses on the subject and through classic books on the subject. This is a 100% unique content video series.</p><p>A Dream Interpretation Course You Will Love!</p>", 
    "end_date": null, 
    "title": "Dream Interpretation Made Simple: Symbols & Techniques", 
    "price": "25.00", 
    "instructors": "Brandy Price", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/586698_d67c_2.jpg", 
    "course_url": "https://www.udemy.com/dream-interpretation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-18T20:01:41Z"
}