{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You're about to start on an exciting adventure in self-discovery. Through the combination of video interviews with long-time researchers and instructors, and downloadable Word documents composing a helpful Workbook and Supplemental Articles, you'll be taken through a comprehensive course in remembering past lives and understanding their impact on your present life and relationships.</p><p> Edgar Cayce's discourses have with numerous ways to remember past lives. In the upcoming sessions you'll see how memory of another life can come through self-analysis, dreams, reflection, <i>deja vu</i>, spontaneous recall, and you'll see how past-life clues are all around you. You'll begin to recognize influences and identify patterns in your daily activities. And, you'll learn how meditation can be used to enhance recall.</p><p> Your course experience will be most valuable if you follow the instructions as they're given and complete the worksheets in the order presented in this workbook.</p><p>This course includes a video interview with the grandson of Edgar Cayce and current president of the Edgar Cayce Foundation, Charles Thomas Cayce, PhD, as well as video interviews with authors and instructors who have years of experience with reincarnation and its influence on your present life.</p>", 
    "end_date": null, 
    "title": "Edgar Cayce on Past Lives and How They Affect You Today", 
    "price": "30.00", 
    "instructors": "Edgar Cayce's A.R.E., Lynn Sparrow Christy, Kevin J. Todeschi, Charles Thomas Cayce, John Van Auken", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/592998_d6af_3.jpg", 
    "course_url": "https://www.udemy.com/edgar-cayce-on-past-lives-and-how-they-affect-you-today/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T15:11:11Z"
}