{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">* Mar 12, 2015.  </strong><span style=\"\"></span><strong style=\"\">Major enhancements including:</strong><br style=\"\"></p><ul style=\"\"><li style=\"\"><strong style=\"\">Inserted visuals, g</strong><strong style=\"\">raphics and text</strong></li><li style=\"\"><strong style=\"\">9 quizes</strong></li><li style=\"\"><strong style=\"\">Bonus Lectures</strong></li></ul><p><strong style=\"\">Thank you for the feedback and reviews!</strong></p><p><strong style=\"\"><br style=\"\"></strong></p><p><strong style=\"\">  \tWelcome to EFT Mastery: Be Your Own Trauma Therapist!  </strong></p>  <p>  \t              This course teaches EFT and associated trauma resolution techniques to people who wish to resolve their own trauma.  This course goes deep into the subject matter, far beyond the basics.</p><p> The sum of these techniques are useful and effective for working through specific traumas such as:  </p>  <ul style=\"\">  \t<li style=\"\">Phobias</li>  \t<li style=\"\">PTSD (Post Traumatic Stress Disorder)</li>  \t<li style=\"\">Abuse, etc... </li>  \t<li style=\"\">Too strong emotions that are inappropriate for the circumstances</li>  </ul>  <p>  \t<strong style=\"\">*</strong> This course is not a substitute for appropriate professional care.  </p>  <p>This introduction to Emotional Freedom Technique quickly proceeds beyond the basics into the advanced usages.  Though EFT can be used by trauma therapists for the resolution of trauma, this course is designed for people that will be tapping on themselves.<br style=\"\"></p>  <p>  \t                  We will cover the basic recipe, the setup phrase, the SUDs rating, the tapping points, and how to find deeper aspects, to take the EFT practitioner to the deeper levels of emotional freedom.  Also included are numerous techniques that are used in various other trauma resolution modalities.  </p>  <p>  \t              Considered essential, there are exercises included that will guide you to apply EFT and what you have learned in the course.  Doing these exercises will have a definite impact on experienced levels of trauma.  </p>  <p>  \t                  The course will take about an hour and a half and will leave the student with sufficient understanding to begin engaging in the practice of eliminating unwanted fears and emotions.  </p>", 
    "end_date": null, 
    "title": "EFT Mastery - Be Your Own Trauma Therapist", 
    "price": "45.00", 
    "instructors": "Mark Johnson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320672_f10d_3.jpg", 
    "course_url": "https://www.udemy.com/eft-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T06:34:01Z"
}