{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>¡Hola!</p><p>Me da mucho gusto poder compartir contigo este programa. Ya sea que quieras encontrar una relación para ti, que quieras mejorar la relación que ya tienes, o bien, si la relación que tenías terminó, con este programa lograrás llenarte de creencias positivas acerca de tus relaciones y tendrás la seguridad de que mereces amar y ser amado, que hay suficiente amor para todos.</p><p>    El amor y nuestras relaciones son dos de los aspectos más importantes de nuestra existencia. Yo creo que en los últimos momentos de nuestra vida, no vamos a recordar los días que pasamos en la oficina, ni la lista de nuestros pendientes, más bien, vamos a pensar en los momentos en que pasamos con nuestros seres queridos y en esos momentos en que nos sentimos realmente amados o cuando fuimos capaces de amar plenamente. <br></p><p>El amor es uno de los ingredientes de una vida completa, plena y feliz.<span><br></span></p><p>Puedes lograr mucho más en una hora trabajando en cambiar tus creencias que en meses de esfuerzos, luchando en contra de ellas.  <br></p><p>   Te recomendamos que utilices tu programa dos veces al día por al menos 30 días seguidos. Este lapso es ideal para nutrir tu mente con nuevos conocimientos.</p><p>   Es mí deseo sincero que este programa te ayude a obtener lo que deseas, que logres llenar tu vida de armonía y que la disfrutes plenamente. Esta vida es tu única oportunidad, ¡aprovéchala!.</p>", 
    "end_date": null, 
    "title": "El Amor sí es para mí", 
    "price": "20.00", 
    "instructors": "Anand Dílvar, Ma. Prem Devayana", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648966_afd3.jpg", 
    "course_url": "https://www.udemy.com/el-amor-si-es-para-mi/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T16:24:00Z"
}