{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In the current world many women struggle to access their natural feminine essence due to an over-cultivation of their masculine energy.  One of the reasons is the number of demands being placed on us.  Sound familiar?<br></p>\n\n<p>Throughout my research I have discovered there are three main impacts that effect women who primarily reside in their masculine energy.  These are:</p>\n\n\n\n\n\n<ol><li>Deterioration of health</li><li>Loss of intimacy in their relationships</li><li>Disconnection from self</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Five years ago I was working in the masculine driven corporate world, suffering from chronic fatigue, as well as undergoing operations and procedures which had me in and out of hospital. My relationship with my (then) fiancé lacked the juicy, deliciousness that we all crave in our intimate relationships, because my masculine energy was running the show!  I simply did not know how to drop into my feminine essence at home or with my partner. It was these circumstances that lead me on a journey of self discovery. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So what’s the solution? Learning to embody and harness your inherent and natural feminine essence, at a deeply profound level, will completely change your relationship with the masculine, and how you navigate and create your life.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course defines exactly what true feminine essence is, and what masculine energy is, so you will be able to differentiate between the two and learn how to achieve a healthy balance of these two energies within ourselves.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course also provides practical exercises and tools which will assist in this deepening process, so that you are able to create increased polarity and intimacy with the masculine.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>In section 3 we uncover the seven key tools in the  manifestation process – after-all love and abundance are the same energy!</p>\n\n\n\n<p>In this journey together, we are also going to explore a much needed leadership shift; the feminine’s vital role in developing heart-centered, service based leadership; and will explore the next stages of evolution for both the feminine and the masculine.</p>\n\n\n\n<p>The course is structured with informative videos and practical exercises. It also provides some great download tools which can be used in your daily life. You can take this course at your own pace and revisit lectures as and when you need to.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is designed for any woman wanting to explore their innate feminine essence at a much deeper level, and who have a desire to create profound, richer and more fulfilling intimate relationships.   </p>\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  <br></p>", 
    "end_date": null, 
    "title": "Embodying Your Feminine Essence", 
    "price": "25.00", 
    "instructors": "Sarah McGahan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702600_7a39_7.jpg", 
    "course_url": "https://www.udemy.com/embodying-your-feminine-essence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T04:21:10Z"
}