{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t This course, the equivalent of a full day&#039;s continuous professional development, offers insights into the significance of emotions and the need to be able to handle them skilfully and sensitively - our own emotions and other people&#039;s. Dr Neil Thompson guides you through some important aspects of developing emotional competence.  </p>  <p style=\"\">  \t The workplace can be be a very emotionally challenging place, encompassing both our own feelings and those of the people we work with (clients, patients, service users, customers, colleagues, managers and other stakeholders). There are no easy answers to dealing with these challenges, but this course can provide a foundation of understanding that should make you better equipped to respond positively and constructively to the emotional demands of your working life.  </p>  <p style=\"\">  \tIt should help to promote emotional resilience and equip you to fend off stress, anxiety and depression, all of which can arise if emotional challenges are not handled effectively.  </p>  <p style=\"\">  \t The course is divided into six lessons, preceded by a short introductory video and followed by a concluding video and certificate of completion. The course is flexible, in so far as you can proceed through it at your own pace and at times to suit you and your schedule. However, it is best followed in a linear fashion - that is, not beginning Lesson One until after you have watched the introductory video and not beginning Lesson Two until you have completed Lesson One, and so on.  </p>  <p style=\"\">  \t You will need to download the <em style=\"\">Module Companion E-book </em>from the main page of the course and print it out so that you can use it for: (i) making notes as you proceed through the course; (ii) completing the exercises; and (iii) having a record of your learning for future reference (and possibly for your employers if they have paid for this course on your behalf). Please make sure you have a printed copy of the <em style=\"\">Module Companion </em>available before you begin Lesson One.  </p>  <p style=\"\">  \t We hope you will find this course helpful and will benefit from the insights offered. Dealing with emotions can be very demanding, but also very rewarding.  </p>  <p style=\"\">  \t The next two steps you need to take are to watch the introductory video (accessible from the main course page) and download and print out your <em style=\"\">Module Companion </em>(also accessible from the main course page) - it doesn&#039;t matter in which order you do them, but you will need to do both before beginning Lesson One.  </p>  <p style=\"\">  \t Good luck with your studies!  </p>", 
    "end_date": null, 
    "title": "Emotional Competence ", 
    "price": "35.00", 
    "instructors": "Neil Thompson", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/209348_f9c8_3.jpg", 
    "course_url": "https://www.udemy.com/emotional-competence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-02T12:48:40Z"
}