{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course I will guide you through an EFT ( Emotional Freedom Technique ) session for eliminating bad feelings from your life. So what is a bad feeling it is how your organs in your body react to negative thinking or thoughts about what you have experienced in the past, what you may be experiencing in the present or some experience you think may happen in the future.</p>\n\n<p>These are the bad feelings that stop you doing many things in your life and these bad feelings have many labels such as anxiety, fear, phobia, lack of self esteem this is only a small amount of the many labels that can be also called a bad feeling.</p>\n\n\n\n<p>EFT is also sometimes called the tapping therapy or energy psychology because we are tapping with our finger tips on the bodies energy channels called meridians those self same channels are used by acupuncturists, however I will be teaching you how to stimulate those energy channels with your finger tips.</p>\n\n\n\n<p>By you experiencing how easy it is to reduce or eliminate bad feelings you will get a rush of excitement because you will realize the full potential of your how great your life can be by learning how to apply this wonderfully simple technique.</p>\n\n\n\n<p>Learn</p>\n\n\n\n<ul><li>what is EFT and how it works</li><li>Where Are the EFT Points and proof they exist</li><li>A brief History of how EFT began</li><li>I guide you through a full EFT session for eliminating bad feelings</li><li>I teach you how to trigger a great feeling anytime</li><li>Program your mind with a hypnosis session for feeling happier in life</li></ul>\n\n<p><br></p>\n\n<p><strong>EFT Course BONUS Download Section </strong><br></p>\n\n<ol><li><strong>Part 1 EFT instructions &amp; Disclaimer . mp3</strong></li><li><strong> Part 2 Breathing Exercise . mp3</strong></li><li><strong> Part 3 negative emotions session . mp3</strong></li><li><strong> Part 4 mopping up section . mp3</strong></li><li><strong> emotional-first-aid on tap .pdf</strong></li></ol>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Emotional Mastery with EFT Stop feeling Bad Fast", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/735604_2944_2.jpg", 
    "course_url": "https://www.udemy.com/emotional-mastery-with-eft/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-20T15:45:44Z"
}