{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><h5><span>Empieza por ti&nbsp;</span><br></h5><p>Los resultados de \"Empezar por ti\" no sólo los vas a notar tú, ya que cuando tú cambias, tu alrededor también cambia. Con este doble sentido de “empezar por ti” es como queremos trabajar a lo largo de este taller online. Está pensado para que puedas hacerlo en la comodidad de tu casa y en los horarios que tú prefieras. En este taller vas a observar tus emociones, tu forma de comunicarte, tu cuerpo, la gente que te rodea, tu entorno más cercano y en definitiva, el mundo en el que vives. Cada día te propondremos poner el foco en un aspecto distinto de ti con la intención de que te conozcas mucho mejor y de que ¡te quieras! mucho más de lo que te quieres hoy y que además ¡te diviertas haciendo las actividades propuestas! Nuestra intención es que puedas cambiar el observador que estás siendo a día de hoy.<br></p><p>\"No es que la realidad nos transforme, sino que la lente con la que vemos el mundo, transforma nuestra realidad\".</p><p><br></p><p></p><h5>¿CUÁNTO DURA EL TALLER?</h5><p></p><p>Hay dos formas de hacer este taller. La primera es haciendo los ejercicios durante 2 días cada semana, 4 semanas. Por ejemplo, los martes y jueves de cada semana (creemos que esta es la forma más potente) pero si no te encaja con tus horarios también puedes ir haciendo a medida que encuentres esos ratos para ti mismo y para trabajar en el taller. Lo dejamos a tu gusto porque al final,&nbsp;<strong>el compromiso de este taller es contigo mismo.</strong></p><p><strong><br></strong></p><h5>¿CUÁNTO RATO ACONSEJÁIS DEDICAR CADA DÍA?</h5><p>Este taller está diseñado para que cada día de trabajo tengas entre 2 y 3 horas de dedicación. Cada día trabajaremos un punto y cada día será distinto de los demás pero con mucha relación entre sí. Esas 2-3 horas de trabajo no son frente al ordenador, muchos de los ejercicios que proponemos son para realizar mientras llevas a cabo tareas cotidianas, estudios, trabajo, lo que sea que tengas que hacer a lo largo del día, así es más fácil de combinar con tus actividades normales.</p><h5><br></h5><h5>¿TENDRÉ ALGÚN TIPO DE APOYO?</h5><p>Por supuesto tendrás apoyo continuo. Podrás contactar con nosotros mediante email (<a href=\"mailto:info@coaching12.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">info@coaching12.com</a>) en cualquier momento y resolveremos tus dudas lo antes posible. También te ofrecemos la posibilidad de que cada día nos envíes los reportes de tu actividad y podamos contestarte el mismo día en caso de que veamos que no has entendido alguna cosa o que estás enfocando mal el ejercicio, si todo está correcto, te contestaremos al finalizar el taller (cuando nosotros hayamos recibido los 7 reportes respectivos) enviándote un feedback personalizado.</p><p><br></p><h5>¿QUÉ ES UN FEEDBACK PERSONALIZADO?</h5><p>¡Buena pregunta! El feedback es información que viene de vuelta hacia ti. Nosotros leeremos tus reportes, todo lo que nos escribas acerca de las experiencias que hayas vivido haciendo los ejercicios propuestos en el taller y al finalizarlo, cuando hayamos leído los 7 reportes respectivos a los 7 días, elaboraremos un informe con las cosas que creamos que te puedan ayudar. Con propuestas para continuar expandiéndote, con nuestra visión de lo que nos hayas escrito, con los puntos fuertes que detectemos en ti, con los puntos donde estás perdiendo mucha energía, etc... Algunos ejercicios del taller tienen la segunda parte en el feedback que te enviaremos también. El feedback será una visión distinta a la que tienes tú mismo. Más constructiva, más enfocada, más objetiva. En definitiva, será información útil y positiva para ti.</p><p><br></p><h5>CALENDARIO PARA LA ORGANIZACIÓN DE 1 MES</h5><p></p><p>Lo primero que recibirás al apuntarte al taller es un calendario con todas las actividades que te hemos preparado y de cuánto rato te van a ocupar cada una, es orientativo para que veas el tiempo que tendrás que dedicar a cada día del taller. Aunque aconsejamos que sean 4 semanas consecutivas, no es imprescindible que sean en el orden que te proponemos. Si alguna actividad la prefieres para otra semana, o al revés, puedes cambiarlo por otro y adaptarlo a como mejor te vaya.</p><p>Si piensas que no tienes tiempo de hacerlo hazte la siguiente pregunta ¿A qué voy a dedicarle estas horas?</p><p></p><p><br></p><p></p><h5>¿HAY CADUCIDAD PARA RECIBIR EL FEEDBACK?</h5><p></p><p>Sí, hay una fecha límite y es a los 6 meses de haberlo comprado. Consideramos que es un plazo bueno para que desde el día que lo compras, tengas tiempo de organizarte, pensar en qué día empiezas, hacer el taller y que aun tener algunos meses de margen por lo que pudiera pasar. De todas formas, este límite es para ayudarte con el compromiso. No nos gustaría que compraras el taller y éste quedara en el olvido. De esta forma sabes que si lo compras y lo quieres aprovechar bien de verdad, no te queda otra opción ¡que hacerlo! Aun así esto no quiere decir que pasados los seis meses ya no haya nada que hacer. Siempre puedes escribirnos a nuestro correo&nbsp;<a href=\"mailto:info@coaching12.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">info@coaching12.com</a>, explicarnos tu situación y buscaremos juntos una solución.</p><p><br></p><h5>¿TIENES ALGUNA DUDA MÁS?</h5><p><a href=\"http://www.coaching12.com/contacto\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">¡Escríbenos un mensaje a info@coaching12.com y te responderemos encantados!</a></p>\r\n", 
    "end_date": null, 
    "title": "Empieza por ti", 
    "price": "40.00", 
    "instructors": "Carol Branca, Albert Ureña Martínez", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/70824_f2c0_7.jpg", 
    "course_url": "https://www.udemy.com/empieza-por-ti/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-28T20:21:14Z"
}