{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">NLP - Neuro Linguistic Programming can be thought of as a &#039;manual for the mind&#039; it related to the processes and language that we use to communicate with the unconscious mind to deliver our results. In business, in our personal life, relationships, in fact in any context. <br style=\"\">When we are born we are set free in the world to figure out this &#039;thing called life&#039;. <strong style=\"\">Imagine, how it would be if you could learn how to operate at your peak and be the best version of yourself through learning some proven skills.</strong> AND imagine how much time you will save on your way to success :) </p><p style=\"\">We are giving you this training at this <strong style=\"\">incredibly low investment  for a LIMITED TIME.</strong> <br style=\"\">Why? well the course is complete, but I want to make it more snazzy in the post production edit so it will be changing in looks over the next few weeks. That said its complete and ready to study ! AND I would find any reviews and feedback really useful at this moment in time. SO, bag yourself a deal before the price goes up ! <br style=\"\"><br style=\"\"><strong style=\"\">Welcome to quite possibly the most comprehensive  Introduction to NLP training &#039;out there&#039; .</strong>  </p><ul style=\"\">  \t<li>Put simply, begin to learn what NLP is and what it does.</li>  \t<li>See if NLP will be able to help you become more successful in life</li>  \t<li>Do you just need a little more direction in your life? <br style=\"\">  \t<em style=\"\">Then this course will help to show you the tools you need to get it.</em></li>  \t<li>Do you want to take control of you life ? <br style=\"\">  \t<em style=\"\">See how NLP can help you do that.</em></li>  \t<li>Are you fed up with treading water?<br style=\"\">  \t<em style=\"\"> Learn the skills of the worlds greatest achievers</em></li>  \t<li>Do you want to know if NLP is for you without committing to spending thousands on training</li>  \t<li>Are you looking for a new career of business opportunity?  <br style=\"\">  \t<em style=\"\">Then gain insight into the ultimate tools for personal development</em></li>  </ul>  <p style=\"\">So why the low price ticket ? Well apart from the reasons listed above, when you have applied some of the things you learn to your life and decide you want more of this &#039;NLP stuff&#039; we hope you will come back and continue your study with us. That&#039;s it really......simple.<br style=\"\"></p>  <p style=\"\">  \tThe content of this Introduction to NLP delivered by an expert trainer, coach and entrepreneur Matt Barnett (mABNLP)  </p>  <p style=\"\">  \tAnd if you are ready to take the Introduction to NLP Training course. The why not sign up below now and lets get the show on the rd.  </p>", 
    "end_date": null, 
    "title": "EMPOWER Your Life Now! : A comprehensive Intro to NLP ", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260650_3429_6.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-nlp/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T20:32:05Z"
}