{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t <strong style=\"\"> Who else wants to enjoy great living this summer?</strong>  </p>  <p style=\"\">  \t    Summer is the ideal time to rejoice in all the beauty and experiences life has to offer. People are naturally filled with more vitality. Opportunities for joyous experiences are plentiful and quality of life really seems to peak during these three months.  </p>  <p style=\"\">  \t     We all dream of sandy beaches, baby blue clear water and sandy beaches, late nights with cold drinks or maybe just summer romances. We seek adventure, we seek excitement but most of all we seek happiness.  </p>  <p style=\"\">  \t     So if this is the ideal time for such pursuits, why is it that we end up, most of the time, feeling disappointed or even cheated of our summer?  </p>  <p style=\"\">  \t <strong style=\"\">Fit For Summer - Balance</strong>  </p>  <p style=\"\">  \t     The truth is that we are more and more caught up in stressful lifestyles filled with vicious cycles that drive down self esteem, health and appearance while distorting our perception of reality and impeding good living.  </p>  <p style=\"\">  \t     Fit For Summer was started with the ambition of providing you with a clear path to not only looking good and achieving your fitness goals but more importantly a guide to happiness and fulfilment. The goal was to empower customers with expert information, advice and directives that they can start implementing right away to produce positive changes in their lives.  </p>  <p style=\"\">  \t  Months of research and years of experience are packed in an elegant, comprehensive yet concise package. Quality information,advice and directives are provided with the goal of being relevant, useful and valuable. There’s no need to waste time researching every topic under the sun spending months understanding how to make the first step towards improving your mind,body and lifestyle.  </p>  <p style=\"\">  \t  We want you to truly experience good living as of today.  </p>  <p style=\"\">  \t     FFS Balance aims to teach and guide you toward understanding the relationships within our bodies as well as with our environment and how these factor dictate everything from our perception of people and our moods to health and appearance.  </p>  <p style=\"\">  \t <strong style=\"\">Features </strong>  </p>  <p style=\"\">  \t<strong style=\"\">&gt; </strong>high quality valuable information and advice from world-class sources  </p>  <p style=\"\">  \t<strong style=\"\">&gt;</strong> decades of experience and research provided in a comprehensive and yet elegantly concise format  </p>  <p style=\"\">  \t<strong style=\"\">&gt;</strong> 2 hours of life changing content provided in quick and easy to learn chunks  </p>  <p style=\"\">  \t<strong style=\"\">&gt;</strong> flexible learning formats allowing you to learn anywhere and at anytime  </p>  <p style=\"\">  \t<strong style=\"\">&gt;</strong> expert guidance specifically designed to help you reach your goals faster and avoid, limit or eliminate completely some of the negative and time consuming effects involved in the trial of new things  </p>  <p style=\"\">  \t  &gt; gives you the tools to end vicious cycles that keep you from feeling fulfilled and enjoying life  </p>  <p style=\"\">  \t<strong style=\"\">Course Structure and Instructions</strong>  </p>  <p style=\"\">  \t     FFS Balance is structured so that each section provides a solid foundation for the next one. It starts with understanding energy use and needs and continues through discussing nutrition (acquiring energy), hormones (the body’s messengers), our bodies (how to shape our bodies) and we finish by discussing lifestyle (considerations, conclusions and how everything ties in). This whole structure takes you through sub-sections that vary in length but on average are 3-4 min long.  </p>  <p style=\"\">  \t     I wanted to provide you with a format that is complete and yet elegant in it’s simplicity. Some of these subjects might be quite alien to you so it is important that you don’t rush the learning process. For optimal results you should only learn a few sub-sections at a time and let their implications and teachings sink in before you proceed. At the most, one section per day should be attempted.  </p>  <p style=\"\">  \t  To assist in your learning and eliminate some of the barriers that could prevent you from putting these teaching into practice , I decided to create the whole course in 3 formats - Presentation, mp3 and Audiobook format and as a Transcript/Ebook. Like this you can learn anywhere, at anytime and in your preferred method of learning (Audio-Visual, Visual or Audio).  </p>  <p style=\"\">  \t <strong style=\"\">Guarantee</strong>  </p>  <p style=\"\">  \t     My team and I are confident that we have built a product that can help people enjoy their lives better and make this summer quite memorable. However, GPF and Udemy want to make sure that you actually get what you are looking for out of this course so because of that we provide you with an unconditional 30-day money back guarantee.  </p>", 
    "end_date": null, 
    "title": "Enjoy Your Summer, Experience Good Living ", 
    "price": "20.00", 
    "instructors": "Hank Palmer", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/245842_e1d1_3.jpg", 
    "course_url": "https://www.udemy.com/enjoy-your-summer-experience-good-living/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-18T16:22:42Z"
}