{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t  El curso es un entrenamiento para aprender e implementar en tu d&iacute;a a d&iacute;a una herramienta que funciona, el Proceso 10 + I, y que te hace sentir que eres el creador de tu vida.  </p>  <p style=\"\">  \t  El Proceso 10 + I, son diez pasos a hacer cada d&iacute;a para estar enfocado en tus objetivos e ir as&iacute; dando pasos firmes hacia adelante y hacia la consecuci&oacute;n de tus metas. Al hacer el proceso adem&aacute;s de avanzar, estar organizado, y enfocado, vas a poder entrenarte para estar emocional y f&iacute;sicamente en forma.  </p>  <p style=\"\">  \t  El curso es en video, es una clase privada para ti, para tu evoluci&oacute;n y desarrollo. En cada una de los pasos, en la parte final del v&iacute;deo lo que hago es explicarte unos ejercicios para que as&iacute; profundices en el paso y lo implementes de una manera consciente y clara.  </p>  <p style=\"\">  \t  Para completar el curso, necesitar&aacute;s aproximadamente unas 4 horas. El curso esta estructurado en 4 lecciones.  </p>  <p style=\"\">  \t  Y una 5 lecci&oacute;n con un bono extra que el audio del Proceso 10 + I para que lo puedas oir desde cualquier lugar.  </p>  <p style=\"\">  \t  Este curso, es un mecanismo para aprovechar cada minuto del d&iacute;a y dar a tu mente una planificaci&oacute;n diaria, algo vital para las personas que quieren marcar una diferencia en el mundo.  </p>", 
    "end_date": null, 
    "title": "Entrenamiento 10 + I", 
    "price": "20.00", 
    "instructors": "Majo Gómez", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112660_1ea0_8.jpg", 
    "course_url": "https://www.udemy.com/entrenamiento-10-i/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T08:58:07Z"
}