{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Vivir más tiempo en el Amor nos lleva a alejarnos del sufrimiento y vivir una vida mucho más plena. </p><p><strong>Entre el Amor y el Ego </strong>es curso teórico práctico para comprender lo más esencial del ser humano en el sentido práctico y productivo del amor más allá de las exigencias y limitaciones del ego<strong></strong></p><p><strong>¡El amor no es meramente un concepto romántico y comprenderlo nos puede llevar a disfrutar una vida plena!</strong></p><p>La mayoría de las personas no alcanzan a distinguir cuando se están relacionando a partir del amor, del ser o a partir del ego. Esto les lleva a obtener resultados no deseados en su vida y a mantener relaciones egoístas y limitadas. Aprender la diferencia y el adecuado uso de sus bases nos ayuda a construir un cambio sustancial en nuestra calidad de vida</p><p>¿Sabías que aunque el ego presume de ser poderoso y valioso en el fondo se sostiene en las inseguridades y los miedos provocando vidas no satisfechas?</p><p>Eros, Filia, Storgé y Ágape son cuatro fases del amor que puestas en práctica construyen vidas apasionadas, entregadas y compartidas.</p><p>El mundo será mucho mejor mientras más personas asumamos nuestro poder personal más allá del ego y con profundo y práctico amor.</p><p>Empodérate hacia una vida mejor desarrollando tu <strong>capacidad de obtener lo mejor de Entre el Amor y el Ego</strong>. </p><p>En este curso:</p><ul><li>Comprenderás la importancia de asumir la vida que habita tu cuerpo.</li><li>Comprenderás la diferencia entre tu esencia más pura y el ego con las máscaras que representa.</li><li>Comprenderás la diferencia de vivir desde el amor o desde las estrategias tramposas del ego que procura un bien individual.</li><li>Aprenderás a construir acciones más prácticas y amorosas buscando beneficios colectivos tanto en tu familia como en tus negocios y en el mundo en general.</li><li>Tendrás un plan de acción para aterrizar los conceptos y extraer lo mejor de ti hacia una vida más funcional emocionalmente y práctica.</li></ul><p>En pocas palabras: <strong><em>Tendrás las herramientas para construirte una vida mucho mejor de la que vives el día de hoy.</em></strong></p><p>El curso <strong>Entre el Amor y el Ego</strong> te lleva paso a paso hacia un práctico plan de acción para lograr mejoras en tu vida tanto a nivel personal, como familiar y con mejores resultados de negocios.</p><p>Asume tu <strong>poder personal</strong> y <strong>toma las riendas de tu vida</strong> hacia la <strong>vida</strong> que tú desees.</p><p>El curso incluye el cuaderno de trabajo de <strong>Entre el Amor y el Ego. </strong></p><p><strong>Y además como obsequio, el libro \"El Regalo Mágico\" escrito por Guido Rosas.</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Entre el Amor y el Ego - Logra una vida más satisfactoria", 
    "price": "40.00", 
    "instructors": "Guido Rosas", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/571856_6da7.jpg", 
    "course_url": "https://www.udemy.com/entreelamoryelego/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-02T20:46:08Z"
}