{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Si sientes que no estás teniendo éxito en tu vida. O que no estás disfrutando la vida que tanto deseas, entonces <strong>debes hacerte las siguientes preguntas</strong>:  </p>  <p>  \t  ¿Cómo puedo mejorar mi calidad de vida? ¿Cómo puedo ser exitoso/a y así diferenciarme de una persona fracasada?  </p>  <p>  \t  Y la respuesta es…  </p>  <p>  \t<strong>¡Dejar de Hacer Lo Mismo!</strong>  </p>  <p>  \t  Sí...Así es!!!  </p>  <p>  \t  Dejar de hacer lo mismo que has estado haciendo hasta ahora... Así que empieza a hacer las cosas <strong>aplicando lo que verdaderamente importa</strong>.  </p>  <p>  \t  Suena simple verdad, pero así es.  </p>  <p>  \t  ¿Y Cómo Puedes Hacer Esto Posible?  </p>  <p>  \t  Fácil, a través de una <strong>fórmula sencilla y comprobada</strong> que consta de una serie de pasos que te conducirán por el camino correcto, Y VERDADERO, hasta lograr el éxito ilimitado en tu vida.  </p>  <p>  \t  Sin embargo...Lo Cierto Es Que No Hay Fórmulas Mágicas... Lo Siento...  </p>  <p>  \t  La verdad a veces duele.  </p>  <p>  \t  De hecho, muchos se encuentran dando vueltas y vueltas en círculos, probando cosas que realmente no funcionan.  </p>  <p>  \t<strong>Y Si Esto Te Suena Familiar, Aquí viene Lo Más Importante…El Verdadero Sistema Que Sí Funciona…</strong>  </p>  <p>  \t  Por lo tanto, no desesperes. La buena noticia es que puedes cambiar tu situación, lograr la vida que tanto deseas y hacer tus sueños realidad.  </p>  <p>  \t  Te llevaré de la mano para que poco a poco vayas reprogramando tu mente subconsciente, apliques los conceptos y pongas en práctica <strong>el método que te permitirá convertirte en una persona exitosa</strong>.  </p>  <p>  \t  De hecho, <strong>cualquiera lo puede hacer</strong>. Y lo más interesante, es que la mejor manera de lograr el éxito duradero <strong>es modelar un sistema</strong> que ha funcionado, y funciona, desde mucho antes de que existiera internet.  </p>  <p>  \t  El problema es que nadie ha enseñado cómo hacerlo correctamente.  </p>  <p>  \t  Y es por ello que me he dedicado casi un año en crear un sistema de entrenamiento que en <strong>tan sólo mes y medio</strong> te enseñará  el secreto para lograr cualquier cosa que te propongas al alcance de un click ¡Garantizado!  </p>  <p>  \t  Este curso online,<strong> está basado en los muchos años de investigación, y en mi propia experiencia</strong>, en los que he invertido miles de dólares para adquirir los conocimientos y técnicas que estarán a tu disposición si tomas la decisión correcta.  </p>  <p>  \t  Dicho esto, déjame presentarte mi entrenamiento online<strong> Entrena Tu Mente Para El Éxito</strong>.  </p>  <p>  \t<strong>Entrena Tu Mente Para El Éxito</strong>, es un curso online estructurado en<strong> 6 módulos basados en una serie de vídeos</strong> que incluyen conceptos y técnicas, así como una guía de ejercicios prácticos (por cada módulo) que funcionan. Y te garantizo que te llevarán, paso a paso, hacia el tipo de resultados<strong> que siempre has querido en tu vida.</strong>  </p>  <p>  \t  Además, te ofreceré de regalo 4 maravillosos bonos como complemento:  </p>  <ul>  \t<li>Vídeo <strong>&quot;Libertad Financiera Para Principiantes&quot;</strong> (valorado en $27)</li>  \t<li>Guía <strong>&quot;Cómo Superar La Inseguridad En Sí Mismo&quot;</strong> (Valorado en $16)</li>  \t<li><strong>&quot;4 Diferentes Audios Con Afirmaciones Positivas&quot;</strong> (Valorado en $25)</li>  \t<li>Guía &quot;<strong>Los 7 Pasos Para Alcanzar El Éxito Y La Felicidad En Tu Vida</strong>&quot; (Valorado en $13)</li>  </ul>  <p>  \t  Entonces, ¿Qué estás esperando?  </p>  <p>  \t  Empieza ahora <strong>a crear la vida que tanto deseas!</strong>!  </p>", 
    "end_date": null, 
    "title": "Entrena Tu Mente Para El Éxito", 
    "price": "20.00", 
    "instructors": "Alexander  Chinea", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320196_b385_2.jpg", 
    "course_url": "https://www.udemy.com/entrena-tu-mente-para-el-exito/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T13:53:14Z"
}