{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t La Escuela de Inteligencia Emocional es un espacio de entrenamiento donde podrás desarrollar al máximo tus competencias emocionales.  </p>  <p style=\"\">  \t Dispondrás de breves lecciones teóricas pero, sobre todo, de mucha, muchísima práctica. El recurso por excelencia de la Escuela es el vídeo y recibirás feedback constante de tu trabajo.  </p>  <p style=\"\">  \tEl currículum de contenidos de esta Escuela toma como base la propuesta validada por Daniel Goleman para un trabajo exhaustivo de la inteligencia emocional. Esto te garantiza que tu aprendizaje pasará por todas las competencias emocionales que se trabajan en los programas de entrenamiento emocional más prestigiosos del mundo.  </p>  <p style=\"\">  \tEn la mayoría de los casos, estas competencias han estado ausentes en nuestra formación inicial en el sistema educativo. Y ahora, en la edad adulta, nos damos cuenta de que somos personas limitadas por nuestros miedos, inseguridades, por nuestras emociones destructivas y nuestra capacidad para tomar decisiones que nos hagan felices.  </p>  <p style=\"\">  \tPero no tienes por qué resignarte. Mereces una vida emocionalmente sana... una vida plena, y puedes conseguirlo, con las herramientas adecuadas.  </p>  <p style=\"\">  \t La Escuela se compone de una comunidad de aprendices emocionales donde intercambiarás tus avances e impresiones con personas que, al igual que tú, están dándolo todo para convertirse en ases de la inteligencia emocional.  </p>  <p style=\"\">  \t Puedes completar el curso a tu ritmo y... lo mejor de todo: es una Escuela dinámica (periódicamente iré incluyendo nuevos materiales, lecciones y entrenamientos para que actualices tus competencias y nunca dejes de mejorar).  </p>  <p style=\"\">  \tAdemás, por ser alumna/o de la Escuela de Inteligencia Emocional, pasarás a formar parte de nuestro Club de Aprendices Emocionales de forma gratuita y dispondrás de toda una serie de recursos a tu alcance para seguir aprendiendo permanentemente.  </p>  <p style=\"\">  \tSi sientes que esta Escuela puede ser el lugar para ti, ¡te doy la bienvenida a nuestra fantástica comunidad!  </p>", 
    "end_date": null, 
    "title": "Escuela de Inteligencia Emocional", 
    "price": "50.00", 
    "instructors": "Sandra Burgos, Laura Moreno", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/86798_a22e_4.jpg", 
    "course_url": "https://www.udemy.com/escueladeinteligenciaemocional/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-01T18:22:04Z"
}