{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Aprende a través del Life Coaching a reconocer talentos y recursos propios; a definir adecuadamente objetivos, y a saber establecer un plan de acción para la consecución de los mismos. Podrás gestionar tu entorno de manera efectiva gracias a la superación de pequeños retos y a un mayor autoconocimiento.</p><p><strong>Diseña tu propio plan de éxito a través de las herramientas que te proporciona el Life Coaching</strong></p><ul><li><span>Reconocerás tus talentos y recursos</span></li><li><span>Transformarás tu sueño en objetivo</span> </li><li><span>Aprenderás a gestionar tu entorno para que el entorno no te engulla día a día</span></li><li><span>Adquirirás consciencia sobre tus capacidades para emprender objetivos futuros</span></li></ul><p><br></p><p><strong><span>Conseguir un objetivo es genial pero lo es más aún descubrir que eres el tipo de persona capaz de hacerlo.</span></strong></p><p>Este curso está basado en mi propia experiencia profesional, en el desarrollo de mi propio plan de éxito y en el de mis clientes y alumnos. Utilizarás herramientas que se utilizan habitualmente en procesos de coaching además de otras creadas especialmente para que este curso tenga la efectividad que tu plan necesita.</p>Las personas que consiguen lo que se proponen son aquellas que saben definir lo que quieren, ponen todos sus recursos a su servicio y establecen un plan de acción focalizado, realista y situado en el tiempo.<p><br></p><p><strong>Contenido y estructura general del curso</strong></p><p>Este curso está estructurado en 17 lecciones que suman un total de más de dos horas de video. Con una metodología muy práctica y dinámica, utilizando tu propia creatividad así como las herramientas de coaching que he puesto a tu servicio, haremos un recorrido que va desde tu situación actual, a la visualización de la situación deseada. Nos detendremos en la identificación de tus recursos y trabajaremos con los obstáculos e impedimentos que siempre están presentes a la hora de establecer un objetivo. Podrás definir claramente qué quieres conseguir y cómo específicamente lo vas a hacer. Algunas lecciones plantean pequeños retos que mostrarán lo mejor de ti y te ayudarán a dar pequeños pasos y avanzar. Además he escogido algunas lecturas recomendadas que hará de este curso un viaje apasionante y cargado de sentido.</p><p>Este curso está pensado para dos tipos de personas; para ti si necesitas impulsar y llevar a cabo un proyecto que quizás vaya a cambiar tu vida. O si tienes una idea pero no sabes cómo estructurarla o llevarla a la práctica. O también para ti, si quieres dar un giro a tu vida, mejorando lo que ya funciona y te planteas establecer objetivos específicos para dar un impulso a tu vida personal y/o profesional.<span><br></span></p>", 
    "end_date": null, 
    "title": "Estrategias de Life Coaching que cambiarán tu vida", 
    "price": "20.00", 
    "instructors": "Paula Sopeña", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659896_e13f_4.jpg", 
    "course_url": "https://www.udemy.com/el-secreto-mejor-guardado-de-las-personas-de-exito/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T09:58:50Z"
}