{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em>Welcome to Everyday Mind Mastery, the leading personal development course on Udemy.</em>  </p>\n\n<p>  \t                  Over 75,000 students CURRENTLY enrolled!</p>\n\n\n\n<p>  \t<em>So, you might ask - what's the fuss all about?</em>  </p>\n\n\n\n<p>  \t                            Well, there are two reasons people seem to like it:  </p>\n\n\n\n<p>  \t<strong>                  1. Students who do this course end up feeling better <em>instantly</em>, and start creating change in their lives <em>instantly</em></strong>, just by applying the simplest of everyday algorithms in their everyday lives. (In 10 minutes you will know what I mean.)  </p>\n\n\n\n<p>  \t<strong>                  2. Students immediately start applying the power of one thing at a time to tackle the mastery of any goal; incrementally, marginally, successively.  </strong>  </p>\n\n\n\n<p>  \t<em>You want to become better at parenting?</em> This course can help you.  </p>\n\n\n\n<p>  \t<em>You want to become a better leader?</em> This course can help you.  </p>\n\n\n\n<p>  \t<em>You want to have a more successful business?</em> It helps with that too.  </p>\n\n\n\n<p>  \t                        Why? How? Really?  </p>\n\n\n\n<p>  \t      Yes, and it's all about making it as easy as possible, (but no easier!)  </p>\n\n\n\n<p>  \t<strong>So, do you ever ask yourself, \"I KNOW I could be doing more with my life, but HOW?\"  </strong>  </p>\n\n\n\n<p>  \t                                                      Let's face it.  You have a busy life with a zillion distractions... and this can lead to a loss of focus, and not getting what you want out of life.  </p>\n\n\n\n<p>  \t                                                      You join the gym in January but by the end of February...  </p>\n\n\n\n<p>  \t                                                      The guitar you bought is in the spare room gathering dust...  </p>\n\n\n\n<p>  \t                                                   You've got a copy of 'The 7 Habits of Highly Effective People' on your bookshelf, <strong>you</strong> <strong>know it's a great book </strong>yet you haven't opened it since 1995...  </p>\n\n\n\n<p>  \t                                                      You decided to learn French, and after 3 weeks you've not got very far and so you decide that maybe Spanish would be better...and 3 years later you're <strong>still just speaking</strong> <strong>loud English</strong> whenever you go abroad...  </p>\n\n\n\n<p>  \t                                                      Sound familiar?  You're not alone.  Most of the population is in the same boat as you.  It's pretty normal. Only a tiny percentage of the people on the planet have the self-discipline of an Olympic athlete.  </p>\n\n\n\n<p>  \t                                                   And I for one, am certainly not in that group. I don't have an iron will. <em>I don't even have a tin will.</em> My will is probably more like cardboard if I'm honest.  </p>\n\n\n\n<p>  \t                                                   Therefore the standard approach to achieving your goals just doesn't really appeal to me, since <strong>the standard approach involves</strong> <strong>ME having to change</strong>.  </p>\n\n\n\n<p>  \t<em>                                             The standard approach is basically just 'have more self-discipline', just 'get better'.  </em>  </p>\n\n\n\n<p>  \t                                                   That's why I created a different approach. One that works for me, for (almost) all of us. And I didn't even have to do that much as the great Benjamin Franklin had already done most of the work. I just added a few tweaks, made it even more accessible and added a few thought algorithms to make it even easier to implement.  </p>\n\n\n\n<p>  \t                                                 This approach is to use a system that gets the job done with minimum willpower, this approach involves <strong>not having to change</strong>.  </p>\n\n\n\n<p>  \t                                                  So, you have two options:  </p>\n\n\n\n<p>  \t                                                  1. Change  </p>\n\n\n\n<p>  \t                                                  2. Be yourself + Use a System  </p>\n\n\n\n<p>  \t<em>       Choose easy. Choose Option 2. Make the smart choice. Take the red pill.</em>  </p>\n\n\n\n<p>  \t                                                 So, instead of increasing our willpower, let's use a system that works with a minimum amount of will. We're still going to have to do the work, it's just that we won't have to use up any of our energy <strong>forcing ourselves</strong> to do the work.  </p>\n\n\n\n<p>  \t                                                 I'm not afraid of work. In fact, none of us are really afraid of work. We're afraid that we won't stick at things because that's what we've done in the past. We're afraid that if we try we might fail, and so after a while, <strong>we'd rather not try</strong>.  </p>\n\n\n\n<p>  \t                                                 We're afraid we're not good enough.  </p>\n\n\n\n<p>  \t                                                 We're afraid we don't have enough willpower.  </p>\n\n\n\n<p>  \t                                                 We're not afraid of doing the work, we're afraid that our work won't work!  </p>\n\n\n\n<p>  \t<em><strong><br>  \t</strong></em>  </p>\n\n\n\n<p>  \t<em><strong>                               So, the big question is what's going to be easier for you?</strong></em>  </p>\n\n\n\n<p>  \t                  Carrying on the same way, making resolutions, getting disappointed, giving up on yourself, starting to wonder if you're ever going to get what you want out of life?  </p>\n\n\n\n<p>  \t                                                 Or using a system that gets it done with minimum willpower.  </p>\n\n\n\n<p>  \t                  Get involved - enrol in the course and join nearly 80,000 students who are already finding that there just might be a better way...  </p>\n\n\n\n<p>  \t                                                      ________________  </p>\n\n\n\n<p>  \t                                                      Oxford Physicist, Internationally Published Author and 'Thought Engineer', Tom Cassidy, has created a system for helping people crack the deepest issues of their lives: self-worth, self-belief, goal-achieving, feeling good, achieving sustainable health and deeply fulfilling relationships.  </p>\n\n\n\n<p>  \t                                                  Tom has combined the wisdom of hundreds of years of the study of global philosophies, human effectiveness, modern findings of behavioural science, recent breakthroughs in the understanding of brain physiology and even the results of quantum mechanics into a practical system for getting things done.  </p>\n\n\n\n<p>  \t                                                  The system takes 'One thing at a time' to a new level: it's monotasking-on-steroids. And best of all, it requires the least willpower of anything you've ever tried. Other than sitting on the couch, of course!  </p>\n\n\n\n<p>  \t                        It's basically the shizzle is what I'm saying...  </p>", 
    "end_date": null, 
    "title": "Everyday Mind Mastery", 
    "price": "20.00", 
    "instructors": "Tom Cassidy, Angela R Loeb", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/17708_1ac3_3.jpg", 
    "course_url": "https://www.udemy.com/everyday-mind-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-13T22:44:32Z"
}