{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t          Facebook is the largest and most popular social network in the entire world. Facebook has became a very important part of our lives and almost everyone in the world uses Facebook to express their thoughts, feelings and to reach their fans, colleagues, family and friends. <br style=\"\">  \t    People use Facebook for different purposes, some use it for business and some use it for their personal matters of life. In this course we&#039;re going to tell you the best use of Facebook in a controlled and managed manner for your personal life to make it really amazing. Facebook is really powerful and if you&#039;re not yet a part of it then you should try it now. We will take you through the advantages of Facebook as well as the things that you shouldn&#039;t do on Facebook. We&#039;ll tell you the secrets that no one knows. This course is one and only amazing course that teaches you about Facebook for your personal life development. This course will make your life much better and full of fun if you see what we do with Facebook.  </p>  <p style=\"\">  \t<img src=\"http://s16.postimg.org/aiq9rdmol/facebook_hacking_1040cs051612.jpg\" alt=\"Facebook for Personal Life\" style=\" max-width:100%;\">  </p>  <p>  \t           Facebook is really amazing and whenever we use Facebook and talk to our friends and family our tensions and strains of life are suspended for the time being and we feel delighted. Facebook is a like a hobby that gives us pleasure. Watch this course and learn how you can use Facebook in the same way as we&#039;re doing.<br style=\"\">  </p>  <p>  \t           This course on Facebook can make  </p>  <ul style=\"\">  \t<li>Your life awesome</li>  \t<li>You the better version of you</li>  \t<li>You Richy rich</li>  \t<li>Your relationship work</li>  \t<li>Your life more memorable</li>  </ul>  <ul style=\"\">  </ul>  <img src=\"http://s16.postimg.org/6eyhqd5hx/facebook_eye_2459156b.jpg\" alt=\"Facebook for personal life\" style=\" max-width:100%;\">  <p style=\"\">  \t           Here are some of the things that you will learn in the course:  </p>  <ul style=\"\">  \t<li>n Introduction about Facebook and some important things about Facebook</li>  \t<li>Make your Facebook experience Fun</li>  \t<li>Taking care of your Privacy</li>  \t<li>Making your life Awesome with Facebook</li>  \t<li>Entertainment using Facebook</li>  </ul>  <ul style=\"\">  </ul>  <p>  \t          Main Objectives of course  </p>  <ul style=\"\">  \t<li>One should utilize the complete potential of Facebook</li>  \t<li>One should be a better version of himself by taking help of Facebook and law of attraction</li>  </ul>  <p>  \t<br style=\"\">  </p>  <p>  ", 
    "end_date": null, 
    "title": "Facebook for personal Life: Live your life with Facebook", 
    "price": "20.00", 
    "instructors": "Amit Huddar", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383004_3b8e.jpg", 
    "course_url": "https://www.udemy.com/facebook-for-personal-life-live-your-life-with-facebook/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T13:01:51Z"
}