{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This is a life and business leadership short course.  You can complete the entire course watching and listening to the video presentations in under two hours.  Then you can then think about it, review the ideas, read on your own, and even have an ongoing conversation with the instructor.  </p><p style=\"\">You are encouraged to get a friend or colleague to take the class along with you so that you can think and talk about the content and the actions suggested.  That helps you to be a super-learner and a teacher, so that you can even teach the main points to others.</p><p style=\"\">All of us will suffer in some way from the effects of fear in our life.  We procrastinate, become risk averse, and often have troubles living our lives to the fullest.  </p><p style=\"\">In this course we will learn that of the hundreds of fears and phobias that can emotionally, and even physically challenge and limit us, that there are five big fears that can build on each other and become \"killing\" obstacles to our happiness and success in life.  We will be challenged by the belief that, indeed, \"fears kills everything.\"</p><p style=\"\">We will lean what those fears and how to start to understand them and begin to limit them.  You will be asked to start to develop some beliefs and strategies for limiting the power of fear in your life.</p><p style=\"\">You will be encouraged to find that as fear is less a part of your life, that purpose, intention, and a strong sense of direction will give you the power to live with greater effectiveness, and true success in your life and business</p>", 
    "end_date": null, 
    "title": "Fear Kills Everything - Stop It From Killing Your Success!", 
    "price": "20.00", 
    "instructors": "Stan Hustad", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/498506_c551_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-have-less-fear-and-more-power-in-your-life-and-work/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-10T22:06:10Z"
}