{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Fear Mastery Conquer your limitations to life without fear In this course I am going teach you how to conquer your feelings of fear with a simple to learn and apply technique called EFT (Emotional Freedom Technique) that will offer you a simple technique to eliminate the fear of fear itself. </p>\n\n<p>You will have lots of exercises and I will be guiding you through every step of your learning experience. But not only will I be guiding you through all of the exercises but I will be talking to you about fear and where your fear comes from, what fears you are born with and where your fear started so that together we will get to the roots of your fear so that together we will conquer the fear that has been stopping you living life to your maximum.</p>\n\n\n\n<p>So that you do not have to avoid those experiences you have been avoiding in the past because of fear but only if you choose to. </p>\n\n\n\n<p>Not only that you will also be learning a technique that can be applied to every area of your life allowing you to grow as a person.</p>\n\n\n\n<p>So that by taking this course not only will you be able to conquer your fear and the fear of fear, but you will be able to make much more positive changes to your life. </p>\n\n\n\n<p>Along with this course  Fear Mastery Conquer your limitations to life without fear I have added downloadable mp3 files and pdf files and even an EBook with protocols from A to Z of issues you will be able to use EFT on. Also the great thing about taking my course and applying it for at least 21 days if you have absolutely no change you can have a full refund, as a 30 day refund policy applies to all courses on Udemy and as I am really confident that if you take the time to learn this easy technique and apply it you will notice changes in the fear you used to have in your life very quickly.  </p>\n\n\n\n<p>  \t<strong>All Videos are downloadable for easier access offline</strong>  </p>", 
    "end_date": null, 
    "title": "Fear Mastery Conquer your limitations to life without fear", 
    "price": "25.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369228_db05_2.jpg", 
    "course_url": "https://www.udemy.com/conquer-your-fear-and-live-life-to-the-maximum/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T00:25:02Z"
}