{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course you will learn how to develop a physical and energetic presence that attracts the attention you want both on a personal and professionally level. You will also feel more comfortable with your sensuality, and gratitude while receiving positive attention. This course will leave you feeling confident and feminine. </p><p style=\"\">Most importantly, you will experience more passion in your life – particularly your love life.</p><strong style=\"\">Who should take this course?</strong><p style=\"\">This course is for any woman that wants to deepen the connection she has with her feminine energy. This course is created to allow you to tap into your inner beauty, strength and vitality. You will feel empowered and confident no matter where you go.</p><p style=\"\"><strong style=\"\">Why is it important for you to take this course?</strong></p><p style=\"\">In order for you to live up to your full potential and joy life to maximum it is important to nurture the larger vision of who you are (that means both your masculine and feminine side). Unfortunately we (as women) have lost touch with our feminine side as we draw mostly on masculine energy to get things done during the day. After a while our feminine energy begins to weaken. This leaves us feeling empty, hollow and disconnected on the inside. This is why it is so crucial for you to practice and restore your feminine energy and create the perfect balance that allows for bliss and inner peace.</p><p style=\"\"><strong style=\"\">Is it hard work and time consuming?</strong></p><p style=\"\"><strong style=\"\"></strong>By making use of the easy, practical action steps you will practice tapping into your feminine energy on a daily basis. This isn&#039;t difficult and any women can do this with a little bit of dedication. All you really need is the desire to let your feminine side shine.</p><p style=\"\">Sign up today and replenish the feminine goddess within you!</p>", 
    "end_date": null, 
    "title": "Femininity: Get In Touch With Your Feminine Side", 
    "price": 0, 
    "instructors": "Larissa Swart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569950_3576.jpg", 
    "course_url": "https://www.udemy.com/femininity-get-in-touch-with-your-feminine-side/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T07:00:29Z"
}