{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Ever feel stuck in self doubt wanting another life but not finding the guts to try?</strong><br></p><p>When you feel stuck in a life where you feel you settled for less you become passive. You stop taking actions that might be seen as risky or unrealistic but which would bring you joy and you don't feel proud of yourself knowing that you haven't given your best. </p><p>In <em>Find The Courage &amp; Freedom To Get What You Want you will learn</em> how to create your own happiness even at difficult times. I will teach you to face the fear in a creative and fun way. This course is created as a starting point not to overwhelm you. And it is a very practical approach to some new changes in your life.  I developed this course to encourage you in your first steps to change your life for better. You will review who you really are; what it is that you want,  what your talents are, are you in the right job, would you like to start your own business, are you in a happy relationship and more. This course will teach you how to transform your negative thinking into positive thinking and become attractive to lovers, bosses, friends. It teaches you how to gain more confidence. </p><p>This course is full of real-life examples since I'm a next door girl who made things happen. I use practical tools that you can implement in your life. Each video is supported with a worksheet to help you with exercises.<br></p><p><strong><br></strong></p><p><strong>What does it mean to be “stuck\"?</strong><br></p><p>It's the feeling in the morning when you don't want to go to work.</p><p>It's the feeling of guilt when you go to sleep knowing you wasted another day. </p><p>It's the expectation from your parents, partners, school, friends about what you would need to do in your life in terms of a job, marriage, earning money.</p><p>It's the voice telling you that you are not good enough and you will fail.<br></p><p><strong><br></strong></p><p><strong>Are you ready to find the courage and freedom to do what you want?</strong><br></p><p>Take this course to discover the tools needed to cultivate you true inner purpose and choices that away for you. If you want concise, no time costuming elaborate on details but a straight to the point advice to take your first step, this course will help you find the courage to listen to your desire. <br></p><br>", 
    "end_date": null, 
    "title": "Find The Courage & Freedom To Get What You Want", 
    "price": "45.00", 
    "instructors": "Duda Jadrijevic", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/699254_2268.jpg", 
    "course_url": "https://www.udemy.com/kickassmuse-find-the-courage-and-freedom-to-get-what-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-16T17:23:17Z"
}