{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you've been searching for your true purpose in life, Eckhart Tolle has some straightforward advice: stop struggling. For the primary purpose of every human being is simply to be: fully engaged in this moment, and aligned with the natural flow of reality itself.</p><p>On <em style=\"\">Finding Your Life's Purpose</em>, the bestselling author of A New Earth invites you to discover the twofold intention of our human incarnation: to free yourself from the prison of “thought-based reality,\" and to express in your own way the grand vision that universal consciousness has for your life.</p><p><em style=\"\">Finding Your Life's Purpose</em> brings you into the vibrant presence of this sublime teacher, as he offers his one-of-a-kind guidance about:</p><ul style=\"\"><li>The beauty of effortless being, and how to awaken to it</li><li>Tapping the vast power and intelligence of stillness</li><li>How to embrace the space rather than the form of this moment</li><li>Unfolding your purpose through actions in alignment with the timeless present</li><li>How to see the deeper essence of another human being</li></ul><p>             <span></span></p>“You are the consciousness that illuminates the world. Know yourself as that—that's what life wants with you,\" teaches Eckhart Tolle. With this liberating session of insights and “pointers,\" you will enter this stream of luminosity, through <em style=\"\">Finding Your Life's Purpose</em>.", 
    "end_date": null, 
    "title": "Finding Your Life's Purpose by Eckhart Tolle", 
    "price": "40.00", 
    "instructors": "Eckhart Tolle, Sounds True", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/556814_93a0_5.jpg", 
    "course_url": "https://www.udemy.com/finding-your-lifes-purpose-by-eckhart-tolle/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-17T01:01:31Z"
}