{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Here,<strong> exclusively on Udemy</strong>, I'm giving you the opportunity to get the whole course at once now.</p><p>This is a <strong>STEP-BY-STEP Guide on taking control in your life by Clarifying what is it that you want and how to get there. How to HEAL Your life and start living the life that really matters and means something.</strong></p><p>In this course you will learn everything that you will ever need to know in terms of \"<strong>finding your life purpose</strong>\". It is presented in a new, different and interactive way. It is short but valuable.</p><p>Speaking of interactivity, I've included All of the <strong>Exercise files</strong>. I've also added a <strong>PDF-Gateway</strong> which you can use to get on to my email list (to stay updated all the time with the GPOB Stuff) and<strong> to download the GPOB Success Thermometer for FREE which is REQUIRED to have read</strong> (eBook).</p><p>I am extremely excited to have you on board.</p><p>Do not think too much, get on board and start learning (Taking Care of your Journey).</p><p>This course is all about YOU. I enjoyed doing it and if you like it, let me know by giving me a feedback.</p><p>As they say \"<strong>if you want to change your life - Make the first step</strong>!\". Now I'm saying to you \"If you want to change your life, make the first step!\"</p><p><strong>PDF Version</strong> of the Course is also Available to download after purchasing the \"UV Course\"</p><p>Enjoy, share and learn!<br><br>and as always...<br><br><strong>Take Care of your Journey!</strong><br><br><br><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Find your life purpose", 
    "price": "20.00", 
    "instructors": "Elvis Metodiev", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/672588_4dda_5.jpg", 
    "course_url": "https://www.udemy.com/find-your-life-purpose-the-universal-vaccine/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-17T19:52:12Z"
}