{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Perhaps the most unique course yet? What interesting skills and advice can</strong> a once factory worker, soldier, engineer, award winning dean lister, writer, designer, marketer, programmer, consultant and entrepreneur who had racked up millions... having been featured on newspapers, international TV and shot TV commercials... <strong>pass to you?</strong></p><p>Good evening, ladies and gentlemen, we are today's entertainment.</p><p>My name is Alexander SkyHeart. I am an ordinary person who does not really have any extraordinary capabilities. But when the situation arises, I do sometimes do things in an un-ordinary way.</p><p>Which some people may consider it strange.</p><p>I am a middle age adult. No longer young, not yet old enough, and still have many goals to pursue in life.</p><p>I am just a normal anonymous person, who had his fair share of experiences in life.</p><p>Everyone has their own life story and learnt different lessons. I don't know who you are and at which stage of life you are at right now.</p><p><strong>But what I do have is a very specific set of skills. Which I have taken a very long time to pick up.</strong></p><p><strong>As a soldier, engineer, award winning dean lister, writer, designer, marketer, programmer, consultant and entrepreneur who had racked up millions.</strong></p><p><strong>Having been featured on newspapers, international TV and shot TV commercials.</strong></p><p>Skills that might be able to help you in your life and career as they did for mine.</p><p>I did take the path less travelled, went through a painful but fruitful time.</p><p>I would like to share some of the things I have learnt, with you. I am here to help fill in the void where others left. Not just motivation and theories, but actionable useful skills that can get you results.</p><p>Results to get you where you want to be and do what you want to do.</p><p>Let's get yourself cosy and begin the Journey.</p><p>Enjoy the powerful visual and audio effect told in a movie style.  </p>", 
    "end_date": null, 
    "title": "FREE Unique Course : Discover Your Beast of Productivity", 
    "price": 0, 
    "instructors": "Alexander SkyHeart", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/595068_34ef_3.jpg", 
    "course_url": "https://www.udemy.com/unleashthebeast/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T15:19:42Z"
}