{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course, which is taught by Pema Chodron, a respected and popular Buddhist nun, is designed for students who wish to transform themselves for the better.<br> <br>If you’re interested in evolving into the best possible person that you can be, you’ll need to be brave enough to recognize your own negative habits. Beyond that, you’ll also need to work hard to replace those patterns with positive ones.<br> <br>Pema guides you through the process of not only reflecting upon your actions, but also the steps necessary to change.<br> <br><strong class=\"redactor-inline-converted\">Choose to Release Negative Habits and Patterns for Good<br> </strong></p>\n\n<ul><li>Recognize the Negative Behaviors That You’re Hooked To\n</li><li>Learn Mindfulness Techniques and Meditations for Inner Peace, Joy, &amp; Freedom\n</li><li>Replace Old Patterns with Positive Actions\n</li><li>Practice Lovingkindness Towards Yourself and Others\n</li></ul>\n\n<p><br><strong class=\"redactor-inline-converted\">React in a Positive Way to Welcome Joy and Freedom into Your Life</strong><br>This course will show you how to establish a lifelong practice that will allow you recognize patterns of behavior that are holding you back from joy and freedom.<br> <br>You’ll learn that you do have the freedom to choose a different path for yourself, and that you do have the ability to change, especially when you implement mindfulness techniques into your life.<br> <br>Pema Chodron will also teach you lovingkindness so you can be gentle to yourself, particularly as you move from a state of being hooked to negative habits, to a state of being free of those patterns.<br> <br><strong>Contents and Overview<br></strong>This course starts off with a discussion on the Three Difficult Practices, the first of which is noticing when you’re hooked to old patterns that are holding you back from joy.<br> <br>As you explore what it’s like being hooked (or what’s known in Tibetan Buddhism as shenpa), you’ll also learn why people become hooked in the first place.  <br> <br>You’ll begin to comprehend how to break old patterns, as well as establish a new way of reacting to situations and people in your life.  <br> <br>In order to prevent you from being too hard on yourself for any negative habits, you’ll even learn how to practice lovingkindness towards others and yourself.<br> <br>To further understand how to unhook yourself and achieve freedom and joy, you’ll explore a mindfulness-awareness practice and a meditation that you can implement into your daily life.<br> <br>Finally, you’ll discover what it really means to choose a new alternative.<br> <br>You’ll know exactly how to avoid following the same old chain reaction so you can become more positive, grounded, and light.<br> <br>Bonus material features Glenna Olmsted, and you’ll learn even more ways to apply Pema’s teachings.<br> <br>By the end of this course, you’ll be able to apply Pema’s teachings and practices with ease while creating a life filled with joy and freedom.<br> <br>You’ll know how to recognize and unhook yourself from negative patterns of behavior so you can heal yourself and help others.</p>", 
    "end_date": null, 
    "title": "Freedom to Choose Something Different by Pema Chödrön, Pt. 2", 
    "price": "50.00", 
    "instructors": "Sounds True, Pema Chödrön", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796126_8f17_2.jpg", 
    "course_url": "https://www.udemy.com/freedom-to-choose-something-different-by-pema-chodron-pt-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T18:56:34Z"
}