{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course by renowned Tibetan Buddhist teacher and writer, Pema Chodron, is designed to help you break free of old habits and negative patterns.<br> <br>These lessons will assist you in accessing your ability to make better choices in your daily life.<br> <br>You’ll understand not only what it means to be hooked to old patterns and habits, but also how you can go beyond them.<br> <br>If you’ve been struggling with reacting in less than ideal ways to various situations, whether you lash out, write nasty letters, or shut down, this course will teach you how to change those patterns and react in a more grounded, calm way.  <br> <br><strong>Recognize and Release Negative Patterns of Behavior<br> </strong></p>\n\n<ul><li>Learn How to Determine What Negative Habits You’re Hooked On\n</li><li>Replace Old Patterns with New, Positive Ways of Reacting\n</li><li>Become More Grounded, Peaceful, Free, and Joyful</li></ul>\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>Unhook Yourself from Suffering and Allow Joy to Flourish<br></strong></p>\n\n\n\n<p>As you move through this course, you’ll begin to understand why so many people suffer because of their own choices and actions.<br> <br>In addition to Buddhist philosophy, you’ll also tap into other tools that you can use daily, such as a simple meditation that anyone can do at any time.<br> <br>Pema will even guide you through the importance of finally unhooking yourself so you can begin to change and welcome more joy into your life.<br> <br><strong class=\"redactor-inline-converted\">Contents and Overview<br></strong>This course begins by diving into the Three Difficult Practices.<br> <br>You’ll notice when you get hooked, as well as how to do something different and make this exploration a way of life for continued progress.<br> <br>Before moving on, you’ll learn a basic sitting meditation to practice mindfulness-awareness. This will further assist you in understanding what you’re learning and implementing it.<br> <br>Next, you’ll be ready to hone in on the first difficult practice, which is acknowledging how you become hooked or caught in bad habits.<br> <br>You’ll also learn about a Tibetan term, shenpa, and the Eight Worldly Dharmas in order to comprehend the quality of being hooked.<br> <br>Finally, Pema will continue to explore and explain shenpa as it relates to everyday decisions and old patterns of action.<br> <br>You’ll learn how to sow positive seeds through your actions so they can bloom into future freedom and joy. In this way, you won’t be stuck in your old negative patterns of suffering any longer.  <br> <br>Bonus material is a live session with Glenna Olmstead, during which you’ll learn how to find new ways of integrating Pema’s lessons into your life.<br> <br>By the end of this course, you’ll be able to recognize when you’re hooked and why you’re hooked, but you’ll also realize that you have a choice.<br> <br>You’ll know how to stop the chain reaction of shenpa and go in a different direction towards a joyful practice that will lead you away from suffering.</p>", 
    "end_date": null, 
    "title": "Freedom to Choose Something Different by Pema Chödrön, Pt. 1", 
    "price": "50.00", 
    "instructors": "Sounds True, Pema Chödrön", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796124_1eaf.jpg", 
    "course_url": "https://www.udemy.com/freedom-to-choose-something-different-by-pema-chodron-pt-1/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T18:56:24Z"
}