{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t“<strong style=\"\">WHY</strong>&quot;? For all the actions of the human beings there is a “ <strong style=\"\">WHY</strong> “ . I will start with mine. Years ago, I started my personal development process, and for the very beginning till now I have improved some characteristics as : manners, financial education, personal style , body sculpture and others. Through my transformation, I learned an important rule, which is : by helping the others, you help yourself much more. So I created this course to help the men around the world improve themselves. This is just one rule which changed my way of thinking, but there are more in the course.  </p>  <p style=\"\"><strong style=\"\">“WHY&quot; </strong>should you buy my course? <strong style=\"\">“WHY&quot; </strong>should you trust this summary? I don&#039;t know. Maybe you will take the course and consider it is worthless, but maybe you will change your life in a massive success. In this course is my life, my experience, what I did in order to become what I a today. There are hundreds of programs for personal development, but I consider that mine is diferent, and if it worked for me, it could work for you too.</p>  <p style=\"\">  \t“<strong style=\"\">WHY</strong>&quot; are you here? Probably you want to learn something new, or you were attracted here by the course image. “<strong style=\"\">WHY</strong>&quot; should you pay 100 $ for a personal development course when you can buy another course from Udemy which presents, for example, Excel skills that can help you receive a promotion at work? An answer might be that your own education is more important for a long term result that a quick promotion.  </p>  <p style=\"\">  \t    This course provides a step by step plan for your personal development. Each video contains explanations and useful examples. For some videos I have uploaded a pdf/doc file with rules and common mistakes from that category. Also, at the end, I&#039;ve upload the written version of the course, to make sure I will make myself clear and you will understand everything I have presented, because I am not a native speaker of English, so I might have made some punctuation and spelling mistakes.</p>", 
    "end_date": null, 
    "title": "From man to gentleman", 
    "price": "50.00", 
    "instructors": "Florian Alexandru", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371656_65aa_4.jpg", 
    "course_url": "https://www.udemy.com/the-awake-dreamer-ultimate-guide-to-personal-development/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T18:25:46Z"
}