{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Fear vs Empowerment.</p><p>Definition of Self Referral VS Object Referral as described by:  - The Chopra Center -</p><p>\"Whenever you feel powerless or fearful, it’s because you are in a state of object-referral. You define yourself through objects, which include people, situations, titles, possessions, accomplishments. By their very nature, objects change, so as long as your identify is tied to objects or the opinion of others, your life will feel unstable. In object-referral, you feel good when your investments are appreciating, business is strong, or your romantic partner is happy with you. But when the market plummets, sales are down, and your relationship is challenged, you feel insecure and worried.</p><p>Self-referral, in contrast, is identifying with your inner self – the unchanging essence of your soul. In this state you have an internal sense of joy regardless of what is happening around you because you aren’t identified with transient objects or events. In self-referral, you experience your true being, which doesn’t fear any challenge, has respect for all people, and feels beneath no one. Fear drops away and there is no compulsion to control and no struggle for approval or external power. As you experience self-referral, you pierce the mask of illusion that creates separation and fragmentation and know that you are an inextricable part of the field of infinite intelligence.\"</p><p>- The Chopra Center -</p>", 
    "end_date": null, 
    "title": "From ANXIETY to EMPOWERMENT ", 
    "price": "20.00", 
    "instructors": "Marlene Prinzing, M.A.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576942_b6c1_2.jpg", 
    "course_url": "https://www.udemy.com/r-u-self-referral-or-r-u-object-referral/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T23:04:03Z"
}