{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">&lt;&gt; Guide to dating for geeks [Natural Attraction System] &lt;&gt;</strong>  </p>  <p style=\"\">  \tThe ultimate dating bootcamp for geeks. Learn how to be sexy being a geek and get lots of dates. This class will take you from a social outcast to dating geek rock star. Come and join today your other nerdy half is waiting for you. This course will teach you practical online and offline dating tips.<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<em style=\"\">   In this course you will learn the following plus more..</em><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t     *How to be attractive to women being yourself  </p>  <p style=\"\">  \t     *Online dating tips for geeks profile creation  </p>  <p style=\"\">  \t     *Learn to approach women without fear</p>  <p style=\"\">  \t     *Secret to getting the kiss on first first date  </p>  <p style=\"\">  \t<strong style=\"\">Did you know that being a geek can get women more attracted to you? The natural attraction system will teach you how to reinvent yourself and learn how to attract the opposite sex by being a geek. </strong>  </p>  <p style=\"\">  \t  By taking this class you will learn all the ways about how you can be attractive to women. How to get her to like you using pick up artist methods developed just for geeks only. Come and join the virtual bootcamp for geeks so you can master your dating life at the comfort of your home.  </p>", 
    "end_date": null, 
    "title": "Geek dating guide: Natural Attraction System Pick Up Artist", 
    "price": "20.00", 
    "instructors": "Sergey Kasimov", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148524_ddaa_36.jpg", 
    "course_url": "https://www.udemy.com/geekdating/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-17T22:38:37Z"
}