{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Gain insight into your life by learning how to read tarot cards. These 78 remarkable cards provides you immediate understanding into any situation. Once you learn the tarot, you can use it for the rest of your life.</p> <p style=\"\"><strong style=\"\">Achieve Clarity in Any Area of Your Life </strong></p><ul style=\"\"><li style=\"\">Enhance your self-awareness </li><li style=\"\">Find out the impact of certain people in your life through court cards</li><li style=\"\">Understand the difference between major and minor arcana</li><li style=\"\">Use the tarot to help others</li></ul> <p style=\"\"><strong style=\"\">Yes You Can Predict the Future</strong></p> <p style=\"\">The tarot has been around for centuries and the reason why is because it works! All types of people around the world have consulted the cards openly and discreetly for answers. The symbolic images on the cards express universal principles that can apply to anyone. </p> <p style=\"\">According to market research, tarot falls under the $2 billion dollar psychic industry that is expected to increase. So, whether you want to learn how to read the cards for fun, you can also consider learning to earn some money.</p> <p style=\"\"><strong style=\"\">I Guarantee You That Learning the Tarot is Fun! </strong></p> <p style=\"\">Designed for the curious beginner, this course is surprisingly simple yet comprehensive in the study of the tarot. In this course you learn how to read the cards to get clarity to pressing circumstances in your life and to help provide advice to others. The lectures are organized thoughtfully and beautifully for maximum engagement. Brief and bite-sized content makes learning the major concepts easy and fast. </p> <p style=\"\">The course contains over 10 lectures and 2 hours of content. It has downloadable worksheets (called &#039;To Do&#039;s) that I ask you to complete to reinforce your learning along the way. There are exercises that you&#039;ll need your cards for and I&#039;ll sample readings that I&#039;ll talk you through. Don&#039;t worry, I won&#039;t quiz you. I expect you to learn at your own pace. It&#039;s important that you learn with ease. </p> <p style=\"\">Bonus material is included if you are ready to advance in reading spreads.</p>By the end of this course, you will be able to read tarot cards for yourself and others.", 
    "end_date": null, 
    "title": "Get Answers Now: Learn to Read Tarot Cards", 
    "price": "25.00", 
    "instructors": "Tray Patterson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558310_e955_2.jpg", 
    "course_url": "https://www.udemy.com/get-answers-now-learn-to-read-tarot-cards/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-18T22:32:01Z"
}