{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Update May 2015: NEARLY 300 STUDENTS HAVE ALREADY ENROLLED IN THIS NEW COURSE!</strong></p><p><strong>*******************************************************</strong></p><p><strong></strong><strong>Welcome to Getting Unstuck!  Here, you'll learn how to effectively transform problems in your life into goals and reach success!</strong></p><p>You'll get real tools to help you build the life you deserve.  I reveal the same goal-setting model that I've used to help HUNDREDS of my therapy clients reach their goals!</p><p><strong>How do you know if this course is for you?  Well...</strong></p><ul><li>Do you feel stuck in your life? Your career? Your health? Your relationships?</li><li><span></span>Do you have a goal that you're afraid to pursue?</li><li><span></span>Do you feel out of options, ideas, and motivation for how to move forward on your goals?</li></ul><p><strong>If any of these things are true, this course is for you!   You can benefit from this course if:</strong></p><ul><li>You feel stuck in your life and need to rethink your goals</li><li>You have a new goal that you want to accomplish but don't know where to begin</li><li>Your past efforts to reach a life goal have failed</li><li>You need new motivation for moving forward and working toward a better life!</li></ul><p><strong>Throughout this course, I'll use PROVEN principles from Cognitive Behavioral Therapy (CBT) to guide you to: </strong></p><ul><li>Identify a current problem and it's impact on your life</li><li>Turn a problem into an attainable life goal</li><li>Map a solid plan for reaching a life goal and success!</li></ul><p><strong>You will come out of this course with a plan for reaching a life goal and attaining your own success!  And best of all, you can use this same model for a variety of goals you want to reach!!</strong></p><p><strong>Here's a bit about myself...your Instructor: </strong></p><ul><li>Masters in Couple &amp; Family Therapy</li><li>Ph.D. in Family Science</li><li>10 years of experience as a Psychotherapist</li><li>Owner of a private therapy practice in the Washington, D.C. metro area</li><li>Passionate about helping others realize their dreams!</li></ul><p><strong></strong></p><p><strong>BEGIN THIS COURSE NOW &amp; BEGIN BUILDING THE LIFE YOU DESERVE!</strong></p>", 
    "end_date": null, 
    "title": "Getting Unstuck: Transforming Problems into Goals + Success!", 
    "price": "30.00", 
    "instructors": "April McDowell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413870_8131_4.jpg", 
    "course_url": "https://www.udemy.com/reachinglifegoals/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T07:06:33Z"
}