{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Sick of never achieving your goals?</p><p>Always falling short? Losing motivation? Keep giving up?</p><p>If you have always wanted to know the correct step-by-step strategies to actually start achieving your goals and dreams, then this is the course for you.<br></p><p><strong>Over 4000 students can't be wrong! </strong></p><p>I teach goal setting success to people from all walks of life. </p><p>People just like you.</p><p>If you need the exact tools and strategies to start smashing your yearly targets then you need to make a change. </p>  <p>Goal setting success is a process, that once learnt, you can apply it to all areas of your life to help you achieve all the wildest dreams you've set out to complete.  </p><p>You can benefit from my 10+ years of goal setting blueprints and methods to help you smash through the barriers that are stopping you from achieving MASSIVE SUCCESS. </p><p>Let me take you by the hand and guide you through this goal setting success course so that you know <strong>EXACTLY</strong> what to do and how to do it.</p>  <p><strong>  \tIn this course you will discover -  </strong></p>  <ul>  \t<li><strong>How to aim high for all your goals so that you never come up short</strong></li>  \t<li><strong>How to use images and words to visualize your goals</strong></li>  \t<li><strong>How to make sure you always keep on track to achieving your goals</strong></li>  \t<li><strong>How to start with the end in mind and work back to the start: The best way to attack your goals</strong></li>  </ul>  <ul>  \t<li><strong>How to always stay motivated, focused and have laser vision</strong></li>  </ul>  <p><br></p><p>Too many people fall short of their potential every year.</p><p><strong>Don't be one of them.</strong></p><p>  \tFollow the steps outlined in this course and you are well on your way to goal setting success, living out your dreams and maximizing your life's potential!  </p>", 
    "end_date": null, 
    "title": "Goal Setting: My Exact Goal Setting Blueprint For Success", 
    "price": "20.00", 
    "instructors": "Adrian Landsberg", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374214_602f_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-success-how-to-achieve-goals-and-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T00:10:28Z"
}