{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>______________________________________________________________________</strong></p><p></p><p><strong>WITH OVER 75+ 5 STAR REVIEWS MY STUDENTS ARE GETTING REAL RESULTS!</strong></p><p><strong>______________________________________________________________________</strong></p>  <p>  \t<strong></strong><strong>*NEW* WATCH THE 2015</strong><strong> STUDENT SUCCESS TESTIMONIAL LECTURE FREE!</strong>  </p><p><strong>HEAR FROM REAL STUDENTS THEMSELVES AND THEIR SUCCESS STORIES!</strong><br></p>  <p>  \t<strong>______________________________________________________________________</strong>  </p>  <p><em>Please - This course is a process and you'll need to study and do as it shows in order to be successful. </em><em>If you are looking for a course to show you how to get rich please do not take this course! This is a course on goal setting. </em><em>You will achieve success and reach your goals, but only if you follow and finish the course fully!</em></p>  <p>  \t<strong>By the end of this course you will have learned how to use this top secret goal setting formula to earn more money and manifest anything your heart desires!</strong>  </p>  <p>  \t                                                            ______________________________________________________________________  </p>  <p>  \t<strong>About the course:</strong><strong></strong>  </p>  <p>  \t<strong>In June, 2010, I earned $33,000 goal setting!</strong>  </p>  <p>  \t                                                                                                                                                                                                                                                Since that experience, I have been teaching students of all ages how to achieve amazing results setting goals using a top secret formula...  </p>  <p>  \t<em>In this course, I will also show you step-by-step how to earn more money, manifest your dreams, and achieve your goals - even if you don't have any experience with goal setting! </em>  </p>  <p>  \t                                                                                                                                                                                                                                                Goal setting doesn't take any special skills…other than a willingness to understand the process and try your absolute best. I will show you that process in this course. I don't hold anything back, I show you everything step-by-step – exactly what you will need to do to get the same, if not greater results, than I did!  </p>  <p>  \t                                                                                                                                                                                                                                                When I learn something new about goal setting, I add it to the course - <strong>at no additional cost to you!</strong> This is a course that will continue to add more and more prosperity to every aspect of your life.  </p>  <p>  \t                                                                                                                                                                                                                                                In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course. You will also be able to apply this secret formula immediately to your life and start getting amazing results now!  </p>  <p>  \t<em>What I can't do in this course:</em>  </p>  <p>  \t<em>I can't guarantee your success – the use of this formula does take work on your part. But it can be done! </em>  </p>  <p>  \t<em>I am also not responsible for your actions. You are responsible for 100% of the decisions you make while using this course. </em>  </p>  <p>  \t                                                                                                                                                                                                                                                If you want to know exactly how I was able to earn $33,000, live the life of my dreams, and manifest the things I desire, you need to enroll in this course!  </p>  <p>  \t<strong>This course will not remain this price forever! It's time to take action! </strong>  </p>  <p>  \t                                                                                                                                                                                                                                                Click the \"take this course\" button, top right, now...<em><strong>every hour you delay is costing you money</strong></em><strong></strong><strong>...</strong>  </p>  <p><strong>  \t                                                                                                                                                                                                                                                See you in the course!  </strong></p>  <p><strong>  \t                                                                                                                                                                                                                                                Joe Parys</strong>  </p>", 
    "end_date": null, 
    "title": "Goal Setting Success: Formulas and Strategies That Work ", 
    "price": "20.00", 
    "instructors": "Joe Parys", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371734_7a34_4.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-formulas-and-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T20:06:27Z"
}