{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Goals are a key tool of any high achiever. Many have heard about their importance but few really know how to fully utilize them. </p><p>Whether you are new to Goal Setting or have used Goals successfully in the past, my goal is to provide you with a course that will be both comprehensive and will cover all the bases, but is still easy to implement.</p><p>You will learn not only how to write your goals that will get you great results, but also why most fall short and how to go beyond setting goals, to achieving them!</p><p>In our first section you will learn the importance and power of goals, including the four ways in which goals help you improve your performance.</p><p>In section two we will cover The Common Pitfalls of Goal Setting. Here you will learn where people go wrong with Goal Setting and how you can avoid the most common mistakes. </p><p>After we have reviewed the most common mistakes I will walk you through step by step how to write powerful goals that will bridge the gap between where you are right now and where you want to be in the future.</p><p>Our last section is the most critical and where most people go wrong. It is ok to have goals, but they only benefit you if it changes your behavior and your results. In this powerful section you will learn why setting goals and achieving goals require different skill sets. I will show you how human motivation works and help you tap into the fuel that will help you persistent until you accomplish your goals. I will also help you align your beliefs and increase your odds of overcoming the inevitable obstacles along the way.</p><p>Come with me on a journey to change your life for the better!</p>", 
    "end_date": null, 
    "title": "Goals and Goal Setting Made Easy", 
    "price": "20.00", 
    "instructors": "Josh Paulsen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/628090_49d3_2.jpg", 
    "course_url": "https://www.udemy.com/goals-and-goal-setting/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-01T16:58:59Z"
}