{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How would you like to live the life of your dreams? In order to achieve success, you must have a plan. Setting goals is not as difficult as it seems.  </p>  <p>  \t    This class will take you through a proven goal setting process. It is designed for anyone who wants to realize their dreams and live a successful life.  </p>  <p>  \t    Here is what you will learn:  </p>  <ul>  \t<li>Why you need to create goals</li>  \t<li>How to create goals</li>  \t<li>How to write a SMART goal</li>  \t<li>How to break your goals down into manageable pieces</li>  \t<li>How to manage your life so that each day you are moving closer to your goals</li>  </ul>  <p>  \t    While each lecture is short, most of the lessons have action tasks that will need to be completed. By the end of the class, you will have created a goals list and learned a method of completing a daily task list to help you attain those goals.  </p>  <p>  \t    To help you unlock your potential, you are provided a workbook in which you will complete the action tasks. You will also need a calendar that you will use exclusively for goal setting. You will begin by writing down your hopes and dreams. Then, you will move from long- and short-term goals to daily tasks. Finally, you will use the calendar to write down your goals and their deadlines. You will get to see specific examples as we walk through the goal setting process.  </p>  <p>  \t    Completing the lectures and the exercises should take you between two and three hours. You can complete this all in one day or over a few days. Just be sure to take some time each day to focus on your goals.  </p>  <p>  \t    If you have a desire to make all of your dreams come true, follow these steps and you, too, can have the life you've always wanted!  </p>", 
    "end_date": null, 
    "title": "Goal Setting: How to Achieve Goals Using a SMART Goals Plan", 
    "price": "20.00", 
    "instructors": "Michaele Downey", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/235134_357e_9.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-made-easy-start-living-the-life-of-your-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-01T18:35:58Z"
}