{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">To have a truly happy and fulfilling lifestyle we need meaning in our lives. Goals provide that meaning, and the challenge and excitement to stop you being bored, complacent and mediocre.</p><p style=\"\">This course will help you live life to its fullest potential. You&#039;ll learn to achieve inspiring bite-sized goals before preparing to take on larger more challenging, life changing goals.</p><p style=\"\"><strong style=\"\">Master a simple seven step strategy to consistently achieve your goals</strong></p><ul style=\"\"><li style=\"\">Understand why goals are linked to success and happiness </li><li style=\"\">Make the necessary changes to turn your life around </li><li style=\"\">Take practical steps to set achievable goals </li><li style=\"\">Develop skills to transform your attitude and mindset</li><li style=\"\">Implement a plan to work actively on your dream lifestyle</li></ul><p style=\"\">We all set and achieve goals every day without even noticing. But they&#039;re generally routine life or work related tasks that don&#039;t always provide the excitement you need to remain happy and fulfilled. </p><p style=\"\">Together we&#039;ll discover what really excites and inspires you. We&#039;ll look at how to set goals that are relevant to your future lifestyle. You&#039;ll discover how to achieve these goals whilst remaining motivated and craving of success!</p><p style=\"\">I&#039;ll tell you about how I faced adversity before setting out on my two year “bucket list&quot; adventure. I want to inspire you with my unique story so that you make the most of your life NOW.</p><p style=\"\"><strong style=\"\">Contents and overview</strong></p><p style=\"\">You&#039;ll advance naturally, step-by-step through this interactive course of 50 lectures. </p><p style=\"\">First we&#039;ll figure out exactly what it is you want to accomplish in your life. Then, through a series of practical learning sessions you&#039;ll tackle your own real life goals from start to finish. </p><p style=\"\">Goal completion is all about action, and action is what you&#039;ll take as you work with me. I&#039;ll be there every step of the way and you&#039;ll also be part of a supportive discussion group of other goal setters and achievers. There are plenty of extra resources to help keep you motivated.</p><p style=\"\"><strong style=\"\">By the end of this course you&#039;ll be perfectly positioned for success. You should feel confident, inspired and ready to embark on a lifetime of goal achieving adventures.</strong></p><p style=\"\"><em style=\"\">Procrastination is the number one reason why goal setters don&#039;t become goal achievers!</em></p><p style=\"\">Come on - let&#039;s have some fun and go on a really effective, inspiring, goal achieving adventure together.</p>", 
    "end_date": null, 
    "title": "Goals Achieved! Goal setting success made simple.", 
    "price": "45.00", 
    "instructors": "Ian Usher, Vanessa Anderson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/437154_0da2_4.jpg", 
    "course_url": "https://www.udemy.com/personal-goals-for-success-happiness-and-the-life-of-your-dreams/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-03T02:23:16Z"
}