{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Join over 6500+ students!!!</em></strong></p>\n\n<p><strong>Goal setting is a key skill for anyone who wants to be successful in life and turn their DREAMS into REALITY. </strong></p>\n\n\n\n\n\n<p>Unfortunately, most people do not set goals at all or if they do their goals do not follow a process and are more of a statement of a dream than an actual SMART goal that will motivate them and gives them a deadline for success. Thus they are very unlikely to succeed at what matters most to them.</p>\n\n\n\n\n\n<p><strong><em>“A goal is a dream with a deadline.”-Napoleon Hill</em></strong></p>\n\n\n\n\n\n<p>People who have well developed goals are much more likely to achieve them and reap the rewards of success both in their work life and in their personal life.</p>\n\n\n\n\n\n<p><strong>THIS COURSE WILL TEACH YOU STEP BY STEP HOW TO SET MORE EFFECTIVE GOALS USING THE PROVEN SMART PROCESS THAT CAN BE THE DIFFERENCE MAKER FOR YOU!</strong></p>\n\n\n\n\n\n<p><strong>You will learn:</strong></p>\n\n\n\n\n\n<ul><li>The benefits of goal setting and the difference between DREAMS-GOALS-REALITY.</li><li>How to set goals that can impact many areas of your life and the various roles you play both in your career and in your personal life.</li><li><strong>Step by step learning using the SMART process </strong>so at the end of the course you will have developed a goal(s) that you can take immediate action on.</li></ul>\n\n\n\n\n\n<p>That SMART can have several variations and your instructor will share all the varieties and recommend what works best and why!</p>\n\n<p><strong><em>\"Even though it may seem like a theoretical course, it is actually hands-on! Great contribution for those who look for self-improvement.\"-S. Uribe</em></strong><br></p>\n\n\n\n\n\n<p>Being great at goal setting and using the SMART process has greatly impacted my life and allowed me to be successful in many areas such as founding my own company, being a Director of Global Training &amp; Program Development for a standards organization, University Instructor, International Public Speaker, and in my personal life as a Husband, Father, Investor, and Community Leader and I want to share this skill with you so you can enjoy great success in your own life.</p>\n\n\n\n\n\n<p><strong>Get even more:</strong></p>\n\n\n\n\n\n<p>Lifetime access to the course so you get updates and new bonus lessons for FREE.</p>\n\n\n\n\n\n<p>Ask questions and <strong>I will answer them for you</strong>. Very focused on this to personalize learning. Yes, even though the course is FREE, if you have a question l will gladly answer it for you.</p>\n\n\n\n\n\n<p><strong><em>“You are never too old (or too young) to set another goal or dream another dream.”-C.S. Lewis</em></strong></p>\n\n\n\n\n\n<p>No risk to sign up and impact could be life-changing. Learn from my experience and rapidly move ahead faster with the knowledge I will share with you. Don't delay.</p>\n\n\n\n\n\n<p>Please click the <strong>Start Learning Now</strong><strong> button</strong> in the upper right corner and let's get started.</p>\n\n\n\n\n\n<p>Many thanks and I appreciate your interest and hope to see you in the course! </p>\n\n\n\n\n\n<p>-Steve Ballinger</p>", 
    "end_date": null, 
    "title": "Goal Setting The SMART Way and enjoy the life of your dreams", 
    "price": "20.00", 
    "instructors": "Steve Ballinger, MBA", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542342_7552_2.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-the-smart-way/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T16:44:17Z"
}