{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em><strong>50 Excellent reviews</strong> from super happy students</em></li><li><em><strong>Overall, Over 4000 Students </strong>Enrolled in our courses</em></li><li><em></em><em>BONUS Audios: so you can download and listen on your IPOD/MP3</em></li></ul><em></em><ul><li><em><em>25+ High Quality Videos </em></em></li><li><em><em></em></em><em><em>Action Steps Included In Every Section.</em></em></li></ul><em><strong><em><strong></strong></em></strong></em><p>If you want to learn how to set specific goals and actually achieve them this course is right for you. You are going to benefit massively by implementing the Accountability Buddy System in your life. The problem with setting UNspecific goals, and not having anybody to help you along the way usually results in a failure. If you want to achieve success in your life, career, health and wealth goals, accountability is what is going to help you.<br><br>What some students say about this course:</p><p> \"<em>Martin explains everything very clear and with <strong>a lot of passion.</strong></em> \" - Joepperd D </p><p>\"<em>Very energetic videos that are motivating by conveying your high vibe and your <strong>easy to understand, practical content</strong>. I found lots of good advice in them that I will start to implement right away. Thank you Martin</em>!\" - Gergely Horváth</p><p>\"<em>This course is filled with great tips that can help in setting and achieving goals, very practical, but if I had one tip for everyone reading this. Make sure you do it step-by-step instead of watching it through THEN attempting to implement.</em>\" - Kevin Hunter</p><p>\"<em>Overall, Martin is a <strong>very inspiring, charismatic and positive trainer</strong> who inspired me to get on the fast track to my goals!</em>\" - Diana Dimitrova<br><br></p><p>This course is about the importance of having an accountability partner. If you were wondering, an Accountability Buddy/Partner is a person who coaches another person in terms of helping the other person keep a commitment</p>You will be guided in a step-by-step fashion and in every section there will be actionable items which you can implement, so the course will require your attention and also putting the theory into practice.", 
    "end_date": null, 
    "title": "Goal Mastery. The Art of Goal Motivation & Achieving Goals.", 
    "price": "20.00", 
    "instructors": "Martin Georgiev, Edmund Piunow", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542944_3306_4.jpg", 
    "course_url": "https://www.udemy.com/goals-mastery-the-art-of-achievement-and-motivation-and-accountability/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T09:21:14Z"
}