{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>We are a PMI Registered Education Provider:</em></strong></p><ul><li><strong>Instructingcom, LLC #4082</strong></li><li><strong>The Lifelong Project; Activity ID 93015731</strong></li><li><strong>8 PDU hours</strong></li></ul><p>What would you do if you had one year to complete the largest project of your life? Where would you begin? What questions would you ask? What resources would you rely on? What processes and procedures would you want to use to ensure that your project was successful?</p>    <p>Now ask: What if you treated the next year of your life as a project?</p>    <p>A few years ago I was at the lowest point in my life: deep in debt, just out of a divorce, and a single dad. My business was failing – along with the economy – and I didn’t know how I’d ever recover from my self-created mess.</p>    <p>I needed something, anything, to back away from the edge and get my life moving in a new direction. I believed that all I had was project management. I held that assumption because I’d written five books on project management, delivered project management seminars for over a decade, and consulted for organizations across the globe.</p>    <p>So I asked: What if you treat the next year of your life as a project? It was a challenge to press on, an opportunity to learn and to grow, and a commitment to try just one more time.</p>    <p>I’m not a psychologist, a Zen guru, or some New Age zealot. I’m a man that’s learned and applied some universal truths to get what I want into and out of my life. If I can do it, you can too. Let me show you how.</p>    <p>In this hands-on course you will learn how you can treat your life as a project. You’ll create requirements, project plans, discover immediate actions to execute, identify the constraints that are anchoring your ambitions, and much, much more.</p>", 
    "end_date": null, 
    "title": "Goals: The Lifelong Project", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/619260_dd5c.jpg", 
    "course_url": "https://www.udemy.com/goals-the-lifelong-project/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T13:59:46Z"
}