{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is taught by Pema Chödrön, a renowned Tibetan Buddhist nun, teacher, and author who's been able to inspire millions of people who seek peace during trying times.</p><p>You'll gain access to a valuable meditation practice called Tonglen, which can be used to transform any kind of negativity.</p><p>This elegant yet simple Buddhist remedy for suffering has been used for 1,000 years, and you’ll learn how to apply it to your daily life so you can shift from pain to compassion.</p><p>Learn how to start using the difficulties you face in life as a means to befriend yourself, accept the past, and widen your compassion to awaken your heart.</p><p><strong>Use Tonglen Practice to Transform Suffering and Pain into Compassion and Joy</strong></p><ul><li>Understand the Four Stages of Tonglen and How to Apply it to Your Life Immediately </li><li>Dive into the Ancient Teachings of the Buddha, Atisha, and Geshe Chekawa</li><li>Practice Mindfulness and Expand Your Compassion While Transforming Pain</li></ul><p><strong>Become More Accepting of Yourself and Your Challenges</strong><br></p><p>Throughout this course, you'll be given valuable insights into how you can use Tonglen to not only recognize, but also accept, the obstacles you face.</p><p>This practice was taught by the Buddha, and it can be used to heal pain and suffering. By understanding Tonglen, you'll be able to transform the poisons in your life into medicine that you can use to enhance your life.</p><p>Most importantly, you'll learn how to use mindfulness meditation and Tonglen as a means to develop a foundation for compassion for yourself and others.  </p><p>You'll practice Tonglen's four states, which include the personal, relational, and universal, so you can integrate this practice into your everyday life and expand your compassion outwardly to the whole universe.</p><p><strong>Contents and Overview</strong></p><p>This course begins with an introduction to compassion and what it really means, before diving into Tonglen, a breathing meditation dating back to the 11th century.</p><p>You can't feel compassion towards others until you accept yourself, so you'll also learn about Maitri, which translates to \"unconditional friendship with oneself.\"  </p><p>To see yourself clearly, you need to practice mindfulness meditation, so you'll discover how to meditate while recognizing your connection with others.</p><p>In order to experience what it's like to practice mindfulness awareness, you'll move through a guided meditation with Pema.  </p><p>As you advance through the course, you'll dive deeper into Tonglen by learning about other ancient teachers, like Atisha and Geshe Chekawa. You'll know Tonglen's history so you can effectively apply it during difficult times.</p><p>The Lojong Teachings are also touched upon so you can truly train the mind to move through your suffering and use it as an opportunity to open your heart.</p><p>Before you know it, you'll be ready to learn the more complex stages of Tonglen according to Trungpa Rinpoche, including how to visualize the breath and how to practice for yourself and others.</p><p>You'll then move through a guided meditation for a family member.</p><p>Finally, you'll tackle the many techniques for applying Tonglen to your everyday life, and you'll experience a guided meditation for someone or something you love.</p><p>By the conclusion of this course, you'll have a thorough understanding of Tonglen and how to actually apply this ancient teaching to modern day life.</p><p>You'll be able to accept yourself and your human experience without clinging to your ego so you can open your heart, accept pain, and change the way you relate to others.<br></p>", 
    "end_date": null, 
    "title": "Good Medicine by Pema Chödrön", 
    "price": "40.00", 
    "instructors": "Pema Chödrön, Sounds True", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679970_eca8.jpg", 
    "course_url": "https://www.udemy.com/good-medicine-by-pema-chodron/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T22:45:19Z"
}