{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Having $100,000 before 30 is just a start but the next $100,000 gets easier. </strong></p><p style=\"\">This course will teach you how to manage your finance to get $100,000 before you reach 30 and also how to grow that $100,000 into $200,000 and more! The 1st pot of gold is always the toughest to build but I will show you how to do it. </p><p style=\"\"><strong style=\"\">How to beat the corporate ladders, investments and whatever grown-ups always talk about </strong></p><p style=\"\">I will also teach you how to beat the grown-up games like corporate ladders, investments, businesses with proven tactics on how to brand yourself, how to get promoted faster at work, and how to leave your job before you hit 30 with a passive income so that you can pursue your dreams and interests!</p><p style=\"\"><strong style=\"\">Each lesson is only the length of 1 song and you can finish this course in 1 month!</strong></p><p style=\"\">Best of all, I have tailored my course materials to be compact so that each lesson is just the length of a song. No one likes a boring lecture. The best investment and life lessons that you will ever get should be something simple and something you can use right away.</p>", 
    "end_date": null, 
    "title": "Guide to Financial Success: How to Invest Wisely While Young", 
    "price": "20.00", 
    "instructors": "Benjamin Chua", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569896_d28e_9.jpg", 
    "course_url": "https://www.udemy.com/guide-to-financial-success-how-to-invest-wisely-while-young/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-31T05:23:31Z"
}