{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em><strong>***Updated For <em>June </em>2016***</strong></em></strong></p>\n\n<p><strong>Building multiple 6-figure &amp; 7-figure businesses, having passionate relationships &amp; living with peak energy levels is impossible with \"normal habit building.\" </strong></p>\n\n\n\n\n\n<p>Over the past few years we've been fortunate to do all of the above by engineering our habit formation with secret techniques based on real science combined with real world experiences.</p>\n\n\n\n\n\n<p>Welcome to <strong>Habit Alchemy</strong> where we'll show you how to use the <strong>power of habits </strong>and the little known but extremely powerful <strong>TASC Method</strong> to live at levels of peak performance.</p>\n\n\n\n\n\n<p><strong><strong>Why should you take this course?</strong></strong></p>\n\n\n\n\n\n<blockquote> <em>\"Loved this course.  This is a science-based approach to building winning  habits to drive you to success.  Easy steps to get you on the right  path.  Definitely worth investing in.\" </em><strong> - Billy Williams (student) </strong> </blockquote>\n\n\n\n\n\n<p>Studies have shown that you're <strong>8 out of 10 times more likely to stick to your old habits than new ones</strong>. It's crushing to fail a habit such as shedding some pounds but we're going to show you a breakthrough process that builds habits without requiring 100% motivation, gruelling hard-work OR even lots of time. </p>\n\n\n\n\n\n<p>The secret is to work with your brain's psychology and to activate the 20 <strong>\"Habit Building Biases\" </strong>which will break bad habits such as procrastination and overeating and build positive ones like consistently publishing online products to escape the 9 to 5 and build a 6-figure online business. </p>\n\n\n\n\n\n<blockquote> <em>\"I love courses that help you think about the human nature and patterns  of behaviour in a fresh manner. This course will have you reflecting  deeply into habits you have and habits you want to lock in. It also has  plenty of actions you can take to reach those goals. Great actionable  information, thanks!\" </em><strong> - Alex Rodriguez (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong>Guarantee:</strong> By the end of this course you will be able to build or break any habit of your choice and lay the foundation to build a 6-figure business, have a vibrant relationship &amp; healthy lifestyle. </p>\n\n\n\n\n\n<blockquote> <em>\"I enroled in this course to improve my productivity at all levels. The  insights that I got are pretty useful so far! I particularly enjoyed the  5 first habits that give you a rock solid foundation to create a  succesful starting point in any field of your life! Thank you guys!\" </em><strong> - Elena Seranova (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong>In this course you will learn the Secret Habit-Building \"TASC Method\" including:</strong></p>\n\n\n\n\n\n<p>-The 7 simple steps to<strong> build or break any habit</strong></p>\n\n\n\n\n\n<p>-How to <strong>get instant focus by exploiting your brain</strong></p>\n\n\n\n\n\n<p>-The <strong>Super TASC Method</strong> which will allow you to <strong>build up to 10 habits simultaneously</strong></p>\n\n\n\n\n\n<p>-<strong>Real World Case Studies</strong> of how habits were used to build 6-figure &amp; 7-figure relationships, improve dating, create vibrant relationships &amp; perform at peak energy levels</p>\n\n\n\n\n\n<p>Yes, all of this is possible if you activate the power of the <strong>TASC Method</strong> because it is the only habit building method out there that activates all 20 of the <strong>\"Habit Building Biases\"</strong>.<strong></strong></p>\n\n\n\n\n\n<p>We believe in immediate application so you will build your own habits as you go through this course. This course has been specifically designed to help you build powerful habits and break negative habits.</p>\n\n\n\n\n\n<blockquote> <em>\"Great course on how to build good habits that will have a positive  impact to help you reach your goals. I really like the action steps and  resource provided to help achieve your desired goal and build a solid  foundation for success\" </em><strong> - Jerry Raphael (student) </strong> </blockquote>\n\n\n\n\n\n<p> <strong>In addition, you will receive 3 </strong><strong><strong>bonuses:</strong></strong><strong></strong></p>\n\n\n\n\n\n<p><strong>-Bonus #1:</strong> <strong>The Habit Activation Quick Start</strong>, which will allow you to immediately activate 5 of the <strong>\"Habit Building Biases\"</strong> so that you can <strong>quickly get started with your habit</strong></p>\n\n\n\n\n\n<p><strong>-Bonus #2:</strong> Our <strong>\"Fill-in-the-Blank\" TASC Method Template,</strong> which will give you a step-by-step blueprint on how to build your habits in 7 quick steps</p>\n\n\n\n\n\n<p><strong>-Bonus #3:</strong> Our <strong>exclusive VIP resource list</strong> containing all the important resources that we personally use to build habits even faster</p>\n\n\n\n\n\n<blockquote> <em>\"Benjamin is a dynamo. He is so inspirational and is a true leader and  motivator.   I have been practicing and teaching personal development since 1986 and  this was one of the best courses I have taken, and I have seen and heard  quite a bit.   The content has great flow, and is easy to follow and implement.   The action steps were/are thought provoking and empowered me to define a  plan for a few projects I am working on.   I highly recommend this course if you are looking to achieve success in  any area of your life and or career.\" </em><strong> - Tom Perkins (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong></strong> <strong>The Better Than Money Back Guarantee</strong></p>\n\n\n\n\n\n<p>Of course there is a money back guarantee and we are so confident in the TASC Method that if you are not able to build a habit after implementing everything in this course then we will personally give you<strong> double your money back</strong> out of our own pockets. It is our mission in life to help people grow and develop themselves and we know without a shadow of doubt that the <strong>TASC Method will work for you</strong>. </p>\n\n\n\n\n\n<blockquote> <em>\"I went in this course quite skeptical as I have read many books and  taken many courses on building habits but they have all been lackluster.  But I thought about giving this course a try and wow. These habit  building biases have completely change my life. It is the first time  that everything made sense.\" </em><strong> - Chole Adams (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong> </strong> <strong>**Special Udemy Bonus - 15 Minute Strategic TASC Method Consultation (Limit 50)** </strong></p>\n\n\n\n\n\n<p><strong></strong>For the first 50 people that fully complete this course we will gift them a <strong>15 minute TASC Method consultation</strong> so that you can personally ask us any questions that you may have. In addition we will mastermind the next steps for your personal transformation. We believe in your success with this course and this will ensure it!</p>\n\n\n\n\n\n<p><em>(If this hasn't been taken down then the special bonus is still available)</em></p>\n\n\n\n\n\n<blockquote> <em>\"This is a really well though out and valuable course! It really shows how being consistent leads to tangible results.\" </em><strong> - Christopher Chu (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong></strong> <strong>Special Introductory Price - Rising Soon</strong></p>\n\n\n\n\n\n<p><strong></strong>We normally charge $697 and $997 for courses like this but we like to reward people who take the initiative and take action towards changing their habits. Therefore, we shall keep this special price for the Udemy community. </p>\n\n\n\n\n\n<blockquote> <em>\"Thanks for a great course Eric and Benjamin. It will definitely improve  my habits. The presentation is enthusiastic and I learned a lot.\" </em><strong> - Thrandur Arnthorsson (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong></strong> <strong>Make The Choice &amp; Enroll Today</strong></p>\n\n\n\n\n\n<p><strong></strong>Enroll now and finally take control of your life &amp; your habits. Check out the preview videos to see what you will be getting and how Habit Alchemy &amp; the TASC Method will revolutionize your life.</p>\n\n\n\n\n\n<p>See you inside the course,</p>\n\n\n\n\n\n<p>Benjamin Hero &amp; Eric Weiss</p>", 
    "end_date": null, 
    "title": "Habit Alchemy: How I Use TASC for Business, Dating, Fitness", 
    "price": "25.00", 
    "instructors": "Benjamin Hero, Digi Strats", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/427048_6e30_8.jpg", 
    "course_url": "https://www.udemy.com/habit-alchemy-tasc-business-relationships-dating-health-fitness-energy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-19T17:31:57Z"
}