{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>START 2016 OUT RIGHT - Over 600 Students Enrolled In The First 48 Hours!</strong>  </p>  <p>  \t<strong>What if improve your career, your relationships, your health and your happiness was as easy as brushing your teeth!</strong>  </p>  <p>  \t                              Every aspect of your life is comprised of habits - your career, your relationships, and your emotional, mental and physical health. Where you are at in these areas of your life is a direct reflection of the habits you have.  </p>  <p>  \t                              If you want to improve any area of your life then you need to create new habits that are as easy as brushing your teeth to get you there. Within 30 minutes from now this course will help you do just that.  </p>  <p>  \t<strong>This Course Is<br>  \t</strong>  </p>  <ul>  \t<li>Easy to follow</li>  \t<li>Easy to implement</li>  \t<li>Delivered in power packed bite size lectures</li>  </ul>  <p>  \t<strong>What You Will Learn</strong>  </p>  <ul>  \t<li>The science of habits (in a very easy to follow lecture) </li>  \t<li>How to embrace change </li>  \t<li>How to approach motivation</li>  \t<li>How to build a stable foundation for your new habit</li>  \t<li>The 3 easy steps to creating habits that last</li>  </ul>  <p>  \t                              You will get a worksheet and together we will go step-by-step through each of the easy habit forming steps. You are encouraged to complete the easy to follow worksheet during the course so you can walk away ready to implement your new habit either today or as late as tomorrow.  </p>  <p>  \t<strong>So, what are you waiting for? Take a small and easy step to improve your life right now by registering for this course! </strong>  </p>  <p>  \t                          You'll have lifetime access to the course and it's regular updates!  </p>", 
    "end_date": null, 
    "title": "Habits: 3 Easy Steps to Creating Habits That Last", 
    "price": "35.00", 
    "instructors": "Kimberly Koehler", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/379298_1b69_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-a-habit/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-28T18:12:50Z"
}