{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  If you ever felt depressed or in doubt, or feel you deserve better, then this course can change your life forever.<br>  \t<strong></strong>  </p>  <p>  \t<strong>This course is different from other self-help courses.</strong>  </p>  <p>  \t    Instead of giving arms length lectures, it steps into the shoes of people who are not achieving their desired outcomes in life currently; who are thus disheartened - more or less; who feel like having an inner thought of giving up; who are caught in a jinx of failures or partial success and feel helpless in coming out of it; who doubt their own worth or capabilities; have their confidence shattered; or even those who have at times thought of running away, get isolated or committing suicides!  </p>  <p>  \t    This course redefines their deepest thought patterns towards success and fulfillment. So instead of giving crutches, the course automatically strengthens the legs so that one can win marathon by himself.  </p>  <p>  \t    Most other courses tend to give motivational tips and teach  some techniques. This course goes a step ahead and explains &quot;Why you  should be successful, in first place?&quot;. &quot;How does pursuit of success  relate with life and its purpose?&quot;It makes attracting success a core part of personality.  </p>  <p>  \t<strong>Our promises</strong><br>  </p>  <p>  \t    This course will open gates of success for you like never before. We promise that this course will make you enjoy life like never before. We promise that your personality will start having that X factor like never before. Your performance will improve, your doubts would melt away, your growth will speed up, you will become charismatic, you will have most amazing relationships in life, you will start attracting much more wealth and most importantly you will have happiness like never before.<strong></strong>  </p>  <p>  \t<strong>Immediate, Permanent results</strong><br>  </p>  <p>  \t    It starts working within minutes and starts performing miracles within no time! We do it in most practical way - utilizing principles of Vedas - the oldest books that also form foundation of philosophies like Zen and Yoga.  </p>  <p>  \t<strong>  Not just another self-help course  </strong>  </p>  <p>  \t      The similarities with other self-help or motivational courses end with these promises. In fact we go a step ahead and claim that this course will unleash the legend within you. It will take you to a level where you can confidently rub shoulders with the greatest legends of human history.  </p>  <p>  \t<strong>Track Record  </strong>  </p>  <p>  \t      So beyond these promises, we also deliver. We have delivered it in our own lives. We have delivered it in lives of innumerable ones. We have delivered it through positive social changes we have brought in places ridden with inequality. We have delivered it through transforming even those minds that were once contemplating suicide into success heroes.  </p>  <p>  \t<strong>Material  </strong>  </p>  <p>  \t      The course will comprise a series of lectures. New lectures will continue to be added. We will also share useful presentations, articles, documents, snippets to enrich the learning experience. There would be an active forum where students can share their experiences and thoughts, and learn from each other.  </p>  <p>  \t<br>  \t<strong></strong>  </p>  <p>  \t<strong>Select Testimonials  </strong>  </p>  <p>  \t<em>I never had a more fruitful experience ever. This course has changed the way I approach life and its challenges now.</em>  </p>  <p>  \t      - Dr Ashish Panchal, Associate Professor (NIT Surat), Gold Medalist (IIT Bombay)  </p>  <p>  \t<em>I strongly recommend this course for all who aspire to skyrocket their careers. Absolutely fantastic!</em>  </p>  <p>  \t<em>- </em>Saurav Sarda (IIM Alumnus), Principal Consultant, Avenir  </p>  <p>  \t<em>IIT taught me how to be &#039;scientific&#039;. This course taught me &#039;why&#039;. I dreamt of IIT, this course made it come true.</em>  </p>  <p>  \t<em>- </em>Sourav Khanna, AIR 5, IIT Bombay  </p>", 
    "end_date": null, 
    "title": "Hacker's secrets to get everything", 
    "price": "20.00", 
    "instructors": "Yogic Hacks", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284022_6194_14.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-everything-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-19T21:22:04Z"
}