{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Feeling stuck in life, and not knowing what to do next sucks. Especially if you are successful by society’s standards, but feel unfulfilled and unhappy on the inside.</p><p>If you yearn to travel the world, learn new languages, meet new people and go on amazing adventures, you have to learn how to set personally meaningful goals, and go after them with a laser like focus.</p><p>You need to learn how to plan your travel, manage your finances, deal with stress and anxiety when you put yourself in unusual situations, and do all this without going insane.</p><p>This course is your guide to accomplishing these personally meaningful goals, and not worry about what other people think. It took me 5 years in the school of hard knocks to learn all these lessons. But you don’t have to go through the same. I hope this course will help unleash a new you the moment you start applying the lessons I teach within.</p><p>What are the requirements?</p><ul><li>A strong desire to start living a life that is meaningful to you</li><li>Dreams of traveling the world, learning new languages, and meeting new people</li><li>Discipline to follow through on the personally meaningful goals you will set for yourself</li></ul><p>What am I going to get from this course?</p><ul><li>Clarity on the top 3 goals to focus on and how to prioritize them</li><li>Step by step roadmap on how to break down these goals into achievable chunks</li><li>Financial planning and travel hacking to make the most of your travel budget</li><li>Rapid language learning hacks and the best resources available for it</li><li>Mindfulness practices and self care tips to deal with the stress of this new energetic lifestyle</li></ul><p>What is the target audience?</p><ul><li>People who feel overwhelmed, overworked, and not living up to their full potential</li><li>Aspiring world travelers and digital nomads</li><li>People who want to learn new languages (and not just for work)</li><li>People who want to live life on their own terms and not conform to society’s expectations</li></ul>", 
    "end_date": null, 
    "title": "Hack Your Life - Step by Step Guide to Unleashing a New You", 
    "price": "30.00", 
    "instructors": "Samantha Alvarez", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515534_110f_2.jpg", 
    "course_url": "https://www.udemy.com/hackyourlife/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-30T17:27:43Z"
}