{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Millennials are different. There is a Millennial Definition, Millennial Problems, Millennial Characteristics. At least this is often read in various articles and blogs. But is this really true? We the Generation Y, are different, but not in every aspect of life. We also face certain issues and need ways to deal with them. How Millennial are you?The course is a journey through the most important topics many millennials are struggling with today. We explore problems many millennials currently face and elaborate on possible solutions you might want to apply in your personal life. The lectures are easy to follow and structured. You can find connections between them. They require your full attention since it is expected, that you sit back and take some time to think or do a little exercise. At the end you can find course material to download. If you are striving for more happiness and success in your life than the course might support you in finding these things. I do not have a perfect answer for everything but I share my personal experiences, tools and solutions with you to help you achieving more in your life. Even though the course is primarily created for millennials I personally think it offers value for other people too, because as mentioned before... millennials are different but also share personal behavior of other generations.</p><p>Take the plunge and see for yourself how millennial you are. If the tips are not helpful to you than use the 30 day money back guarantee. Love to see all of you in the fist lecture.</p>", 
    "end_date": null, 
    "title": "Happiness and Success - a How to Guide for Millennials", 
    "price": "20.00", 
    "instructors": "Daniel We", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/826932_e2fd_2.jpg", 
    "course_url": "https://www.udemy.com/happiness-and-success-a-how-to-guide-for-millenials/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-20T10:14:25Z"
}