{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>*** 60+ minutes of content offered as a bonus for limited time ***</em></strong><br><br>“<em><strong>Discover Why You Fail Making Money Online - Healthy Mindset</strong></em>\" teaches you everything you need to know about why you failing making money online and how to set up a successful mindset to make a change.<br><br>You will learn the professional tactics and techniques that I use every day in my successful internet marketing business. So you too will be able to build a successful online business and create successful products to make money . By using the mindset techniques you will learn in this course you will have the ability to change your life and start seeing success around your work.</p><p><br>These strategies can be implemented in the next couple of hours and your first results will come very soon. It's a great feeling stop failing with all that \"dirty strategies you can find everywhere and push button systems \"</p><p><em><strong><br>Let's face it: Money keeps our motivation levels up and gives us the desire to progress every single day, learning more and earning more .</strong><strong> </strong>Your online income is very important because it dictates you what you can and can't do with your life and can help you reach the day when you can sack your boss!<strong></strong></em><br><br>My <strong><em>Discover Why You Fail Making Money Online - Healthy Mindset</em></strong> will show you everything you need to know in order to stop failing over and over and understand how to set up a healthy mindset to become a making money online machine!<br></p><p><br><br><em><strong>By the end of this course you will have all the knowledge and skills necessary to launch a successful online business by having a healthy mindset that will allow you to do it</strong></em>.I really appreciate the feedback from my students me and always respond to questions.<br><br><strong><em>Click the button that says “Take This Course\" now and I'll see you on the other side.</em></strong></p>", 
    "end_date": null, 
    "title": "Healthy Mindset Techniques For Marketing", 
    "price": "20.00", 
    "instructors": "Scrembo Scrembo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624868_46bf_4.jpg", 
    "course_url": "https://www.udemy.com/healthy-mindset-techniques-for-marketing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T16:49:27Z"
}