{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Update: This course is completely updated and current through January 2015</strong>  </p>  <p>  \t              With over 400 satisfied students enrolled  </p>  <p>  \t              _______________________________________________________________________  </p>  <p>  \t              Do you find yourself getting too anxious when you think about your future?  </p>  <p>  \t              Are you often overwhelmed by everything you need to get done in your life?  </p>  <p>  \t              Do you experience headaches, tension, stress or anxiety?  </p>  <p>  \t              This course will help you to stop worrying and to start enjoying your life.  </p>  <p>  \t              Using 10 powerful strategies you will discover how to experience more joy, more clarity and more love in your life.  </p>  <p>  \t              This easy to follow blueprint will give you everything you need to start ridding your life of stress, worry and anxiety.  </p>  <p>  \t              Each strategy is packed with useful exercises that will teach you how to get out of your head and into your heart so you may experience more abundance, happiness and peace in your life.  </p>  <p>  \t                    Through applying these simple exercises you will start to discover the joy that has been missing from your life you have !  </p>  <p>  \t                              I have taught these exercises to hundreds of clients over the past 7 years who have been lost, confused and exhausted by constant worry and stress.  </p>  <p>  \t              Almost all of them have told me of miraculous transformations taking place in their lives as a result of using these simple and easy exercises.  </p>  <p>  \t                    By the end of this course you will:  </p>  <ul style=\"\">  \t<li>Understand why certain activities boost happiness, joy and personal fulfillment</li>  \t<li>Easily pick yourself up when you are feeling depressed or stressed</li>  \t<li>Experience huge positive changes in your moods, thinking and beliefs</li>  \t<li>Solve problems with a clearer mind </li>  \t<li>Have higher energy levels. </li>  \t<li>Have discovered the powerful benefits of getting out of your head and into your heart. </li>  \t<li>Experienced the peace, clarity and joy that comes from living in heart-centred place</li>  </ul>  <p>  \t              As a student you will get my help answering any questions about the course and about your experiences with stress, worrying and anxiety.  </p>  <p>  \t              You will also receive a lifetime of access to over 2 hours of lectures, guided meditations, quizzes and regular updates and bonuses added throughout the year.  </p>  <p>  \t              Take the course, study it and implement the strategies and exercises for 30 days and if you aren&#039;t happy, you are covered by a 100% &#039;no questions asked&#039; money back guarentee from Udemy. So there is absolutely no risk!  </p>  <p>  \t                    So enrol now and take a powerful step to discovering the power of joy!  </p>", 
    "end_date": null, 
    "title": "Heal Your Mind with 10 Easy Strategies", 
    "price": "20.00", 
    "instructors": "Sal Jade", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/313142_ff6e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-experience-more-joy-in-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-04T00:35:28Z"
}