{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>We are all achievers. We accomplished many goals in order to reach where we currently are. However, not everyone feels happy with their progress, and you may be one of those people. You may not be happy with your job or a relationship or something else in your life. Since we are all achievers, we have the ability to accomplish goals.</p><p>To get the results you want to see in your life, you have to go <strong>from ordinary achievement to a higher level of </strong><strong>achievement.</strong></p><p>Maybe you want to start a business on your own or be more friendly to the important people in your life. You wish the change could happen immediately, but you know it will take time to make the change happen.</p><p>Changes happen at their own paces,<strong> but by reaching a higher level of achievement, that pace gets accelerated.</strong> That higher level of achievement explains why some people can write a bestselling book in less than a month and why other people launch successful product after successful product.</p><p>It's time for you to become one of those higher achievers and get all of your goals done. If you don't, then you will continue standing face-to-face against the goals that have taken up space on your to-do list for far too long.</p><p>Reaching the higher level of achievement isn't a matter of putting in more work. Reaching the higher level of achievement--<strong>where the magic happens</strong>--is a matter of working and living smarter.</p><p>In this course, Michael and I will reveal what you need to know to become a higher achiever. You can accomplish that seemingly impossible goal twice as fast as you thought you could. You can make a full-time income by pursuing what you love. You can be a better person to the people who are important to you.</p><p><strong>But only if you are ready to take action. </strong></p><p>If you wish to pursue the path towards the higher level of achievement, then click \"Take This Course\" now.</p>", 
    "end_date": null, 
    "title": "High Performance Mastery: How To Become A Better You", 
    "price": "30.00", 
    "instructors": "Marc Guberti, Michael Guberti", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708066_c868_3.jpg", 
    "course_url": "https://www.udemy.com/high-performance-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T00:17:56Z"
}