{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><span></span></p><p><strong>How do you find your purpose and live your dreams in today's world of exponential change? </strong></p><p><strong></strong>This seems to be the question of the century and the problem that most of us face at this very moment. Frustration, stress, depression, low self-esteem, addiction problems, all of these have the same root cause - a loss of meaning in life. <strong>Is this the best we can do today?</strong></p><p>I know for sure that it’s not and I brought in this course some of the most brilliant minds in the world to show us how we can do better.</p><p><strong>You will study directly with:</strong></p><p>\t<strong>•\tGregg Braden -</strong> New York Times Bestselling Author</p><p><strong>•\tSteve Vai -</strong> Grammy award winning musician</p><p>\t<strong>•\tDr. Charles Pellerin - </strong>NASA legend, Charlie built Hubble Space Telescope</p><p>\t<strong>•\tDr. Ed Hoffman -</strong> NASA Chief Knowledge Officer, Ed developed thousands of top leaders</p><p>\t<strong>•\tPeter Vesterbacka - </strong>Peter made Angry Birds into the global brand it is today</p><p><strong>•</strong><strong> Dr. Robert Richards -</strong> Co-Founder Singularity University<br></p><p><br></p><p>Because it's never the extraordinary people who do the extraordinary. It's the ordinary people like you and me who decide to step out and take the journey. Because they complete the journey, ordinary people become extraordinary. </p><p>A few years ago I gave up on everything in life to make The Amazing You film, to empower people to make their most cherished dream a reality, even if they start with very little. In this course you also get the internationally acclaimed movie THE AMAZING YOU.</p><p><strong>Facts about THE AMAZING YOU:</strong></p><p>\t•\tUNESCO OFFICIAL SELECTION for the global youth forums, Washington 2015 </p><p>\t•\tNominated in TOP 10 MOVIES THAT CAN CHANGE THE WORLD, Los Angeles, 2014</p><p>\t•\tGLOBAL AWARD FOR EDUCATION &amp; Social Change, Los Angeles 2014</p><p>\t•\tAvailable in 19 languages (translated by volunteers)</p><p>\t•\tRequested by the audiences to be included in all schools in the US and Europe</p><p>I want you to have access to all my work. You get the movie and 60 extra videos that show you how to discover your passion and how to make it a reality. </p><p><strong>My goal with this course is to empower people to find their purpose and transform it into reality even if they start with almost nothing.</strong></p><p>JOIN this top-rated course and let’s make the journey together!</p>", 
    "end_date": null, 
    "title": "How They Did It", 
    "price": "40.00", 
    "instructors": "Dr. Dragos", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315956_9ff8_15.jpg", 
    "course_url": "https://www.udemy.com/the-amazing-you-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T17:49:53Z"
}