{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What dreams would you love to start living right now?</strong></p><p>Whether you are feeling like life is slipping by or have not followed through on your aspirations, this interactive course will inspire you to <strong>(1) Get focused (2) Take action and (3) Start to live your dream</strong>… all in less than a few hours.</p><p>Too often, the idea of big dreams and life legacies feel too huge to start, let alone finished. What do you dream of doing? Maybe for you it is writing and publishing your book, starting a new business, taking your career to the next level, replacing that dead-end job with something you feel passionate about, creating financial freedom and independence. Or maybe for you it is starting a charity, learning a new life-changing skill, becoming a philanthropist, launching a successful online business, writing a song, inventing a product or service, becoming a Udemy Instructor, move country or simply discovering what fires you up in life! </p><p>When people get inspired in life they often fail to take follow through as the chores of life gets in the way. This course will get you excited about your dreams and in only a few hours you will have started to take action. Learn with Mark Desvaux, Dream Life Coach, entrepreneur and life adventurer, who has continually proven through his own life experiences of completing everything on the list above (and more) that your dreams are possible, no matter how crazy they might seem to others. In fact, Mark believes the crazier they seem, the better! It's time to start thinking bigger than you ever imagined.</p><p>Join Mark and learn his unique \"3D Process\" - the same technique he coaches to hundreds of individual clients and personally uses. This course has ready-to-use workbooks with timed exercises to get your creative juices flowing.</p><p>Enroll now to learn how to:</p><ul><li>Create your Dream List - Step back and reconsider what gets you excited in your life</li><li>Get Focused - What to do next</li><li>Overcome Overwhelm – Break down those big actions</li><li>Make Time for really important in your life</li><li>Declaration your Dream</li><li>Take Action – Start living the dream now.</li></ul><p><em><strong>** This course is free for a limited time. Take action by enroll today! **</strong></em></p><p><strong>Join Mark now to start your adventure of a lifetime and a lifetime of adventure!</strong></p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to Ignite Your Dreams", 
    "price": 0, 
    "instructors": "Mark Desvaux", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404904_e341_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-ignite-your-dreams/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-27T01:24:26Z"
}