{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t     Every moment in life is a great moment for a change. Are you ready to go for it?  </p>  <p>  \t     If you are reading this at the end of a year, you have the energy to build your new year´s resolutions as soon as possible, and go for it.  </p>  <p>  \t     If you are reading this in another date of the year you must know that determination guides us and helps us make things happen, no matter the date of the year when we are ready to step into the next level in our own life.  </p>  <p>  \t     Life is a journey to go through, full of lessons and experiences; from each one of them we learn, we grow and we evolve.  </p>  <p>  \t     Still sometimes we don´t … Why does this happen?  </p>  <p>  \t     Because, everything in life is a process that does not happen overnight, for sure not!  </p>  <p>  \t     It is when we make the decision to step back from where we are, and we take a deep breath, that we have the strength to see clearly, in a different way from another perspective.  </p>  <p>  \t     Then, with courage, we begin to process each episode unfolding in front of our eyes, understanding what happened. We are able now, to let go with no judgment, and no emotional implication, the burden we do not need in our life backpack any more.  </p>  <p>  \t     After the process ends, we understand the lesson and shift our mind to walk lighter our life, enjoying it in a new way.  </p>  <p>  \t     Not everybody is aware about his “life purpose\", it takes time to dive inside and be able to phrase it. We all have a vision, a mission and a passion; when we are able to integrate them we can see the picture in front of our eyes with no effort: There is our purpose! We will never again walk blind to our destination.  </p>  <p>  \t     From now we become aware of the options from where to choose to achieve the success we came to experience, living our own precious life.  </p>  <p>  \t     We have to make the decision that will unfold “the map of the treasure of our life destination\". Nobody will do it for us.  </p>  <p>  \t     Are you ready to begin walking the fantastic journey leading you to live your life on purpose?  </p>  <p>  \t     If the answer is yes, follow me since you will never regret what you will discover when you take this course.  </p>  <p>  \t <strong>What do people say about me and my work?</strong><strong></strong>  </p>  <p>  \t     Astrid Denise Morgan – Lima - Perú :  </p>  <p>  \t     I met Esther many years ago, when our children were studying at the Franco Boliviano \" Alcide D'orbigny\" School. She struck me as a dynamic, positive, outgoing entrepreneur; in other words a modern woman with many interests and new, innovative ideas, who put them into practice very successfully. At the time, she produced spices and also tutored primary, middle school, high school, and University students in math, science, physics and chemistry. Whenever someone asked for a good tutor, the answer inevitably was:\" Call Esther Iberkleid, she's the best.\"  \t  \t  \t        I was able to ascertain this a few years later, when my eldest child needed one. I obviously called Esther, and she proved to be all that was said about her and more. She helped my daughter to organize herself, acquire better study habits, enhanced her capabilities, learn the subject matter well, and as if that weren't enough, Esther gave her self esteem a great big boost. My daughter was able to clarify all her doubts and started looking at school with more confidence and self assurance, both gained during her tutoring.  \t  \t        As a former teacher, I consider this to be a great asset in a tutor. I have seen many students who loose their confidence when they move into higher grades. It is not that they don't study, or don't know the subject matter; it is mainly that they loose faith in themselves due to various reasons. Subjects get tougher, they go into their teens and feel more vulnerable and are under the constant criticism of their peers, some even have teachers whom they fail to understand; or who undermine them. This causes children to lower their grades, and as they do so they start believing they aren't capable enough, which in turn makes them lower their grades even more. Esther is a teacher/tutor, who not only knows the subject she teaches well and is constantly learning more about it; but she is always improving herself in order to find additional ways to impart her lessons, making them interesting and effective. More importantly, she cares and helps students realize that they are capable of facing, and succeeding in any challenge they face.  \t  \t        I admire Esther greatly. She has strength, is always positive, and will go out and do everything she needs to do, to reach her goal. It was only four years ago, that she told me about her new enterprise over a cup of coffee, and now the results are amazing! She is doing something she loves, is happy and is very successful at it. This is what we would all want to achieve in life, isn't it? ... and it is the reason why I feel that she is such a great role model.  \t  \t        As a teacher, as a client, and as a parent I would highly recommend Esther. She is excellent at what she does, always seeking to be the best, and is always well informed on new trends, changes or improvements there are in her field. I am convinced that whatever Esther begins, or whichever goals she sets for herself, she will always reach them and be the best at what she does.  </p>  <p>  \t    ---------------------------------------------------------------------------------------------  </p>  <strong>Wendy Howard</strong><strong> - </strong>Small Business Expert, helping Coaches, Trainers, Consultants to grow profitable businesses  <p>  \t     Esther has the most amazing energy which she brings to all of her work and clients. Her knowledge and experience is very in depth and she has a true gift of connecting and helping people - quite literally change their lives.  \t  \t        She has a number of diverse programs and offers many tools for business and life directional changes. I would recommend anyone who wants to make positive change and have a wealthier life to work with Esther.  \t  \t        Great person, great passion, great business!  </p>  <p>  \t     ---------------------------------------------------------------------------------------------  </p>  <strong></strong>  <strong>Sandy Hargrave, MA</strong><strong> - </strong>Global Distributor at LifeVantage  <p>  \t     Esther has a passion for helping people to become all that they can be that is powerful beyond belief! She certainly works wonders with all of her clients. She is a masterful coach and teacher and amazing to watch. I have had the honor and privilege of working with Esther as a client, a coach and as a business partner. If you'd like to find your true purpose by finding the missing link to your wealthy, worthy life, then don't wait another minute. Let Dr. Esther be your guide.  \t        Sandy Hargrave, MA  \t        CEO, Cruising Through Life - Seminars at Sea  </p>  <p>  \t     ---------------------------------------------------------------------------------------------  </p>  <strong>Arthur Partridge [LION] @AyPee</strong>  Specialist Practitioner of Neuro Hypnotic Repatterning at AyPeeCo  <p>  \t     Esther is an extremely enthusiastic 'Well Being Coach'.  \t        As a coach, she sets high standards for herself and her clients and motivates them towards their dreams.  \t        She is never without energy and compassion and her attitude allows her clients to aspire even when they may not have the energy.  \t        She is never disappointed and is a true stand for both her clients and colleagues and achieves extraordinary results  </p>  <p>  \t     ---------------------------------------------------------------------------------------------  </p>  <strong></strong>  <strong>Elizabeth M. Lengyel</strong><strong>  - </strong>Career Strategist. Radio Host.   Faculty, Conestoga College.  <p>  \t     Esther is a beam of white light. Highly intuitive. Energetic. A tremendous capacity to excel in connecting others to their gifts and passions. A wise counsel with collective experience and knowledge to boost success.  </p>", 
    "end_date": null, 
    "title": "How to Plan a Memorable Year, no matter the date of the year", 
    "price": "50.00", 
    "instructors": "Esther  Coronel de Iberkleid", 
    "commitment": "41 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/140312_7a74_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-plan-a-memorable-year-no-matter-the-date-of-the-year/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-01T04:21:09Z"
}