{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>***Udemy has announced a new pricing structure coming this April.***</strong></p><p><strong>***Get this course for only $10 before PRICES INCREASE.***</strong><span></span></p><p>Trouble Getting Your Ex Back?</p><p><strong>\"You Can Laugh At Your Relationship Problems - Even If Things Seem Hopeless - If You Follow My Advise\"</strong></p><p>You may have never though about it like this, but there are really only a handful of things that end a relationship.</p><p><strong>Trouble is:</strong> there is so much mis-information out there on this subject. I mean no one seems able to think straight when it comes to getting an Ex-partner back. (Hey, I admit this is an emotional area).</p><p>But I'm tired of this nonsense. What I say is...</p><p><strong>Stop dreaming and start fixing your relationship- starting today, this minute.</strong></p><p>Here's some straight talk about your love life....</p><p>There are right and wrong ways to win your ex back...and there is real advice out there that will improve your chances.</p><p>Before I say any more about this program, I want to tell you what you WON'T find here.</p><p>You WON'T find...</p>-<strong>Sneaky tactics meant to somehow trick or manipulate the other person</strong> <strong>...</strong>Any advice that involves you begging and pleading<strong>... or any other unattractive, over-emotional responses</strong>...The same old nonsense.<p>But listen...just because we put so much time and effort into developing this program into <em>something that really works</em>...doesn't mean that it's going to be difficult to use.</p><p>In fact, <strong>we think the best part about this program is how easy it is to put into practice. </strong>And it turns out some people have already had some success...</p><p><strong>How To Get Your Ex Partner Back is:</strong></p><p>A Complete Recovery Series In 15 Videos [Not Available Elsewhere]</p><ul><li><strong>Video One:</strong> Intro. Stop worrying and start paying attention.</li><li><strong>Video Two:</strong> The Basics. Break-ups can happen to anyone..but some people are smarter about fixing them.</li><li><strong>Video Three:</strong> How to avoid the “Classic\" mistakes</li><li><strong>Video Four:</strong> The Number One Thing Not To Do (this may be one of the most import videos in the whole series)</li><li><strong>Video Five:</strong> What else I want you to STOP doing this minute, before you'll ever have a chance to get your ex back.</li><li><strong>Video Six:</strong> Coping with a breakup (and why it can make all the difference)</li><li><strong>Video Seven:</strong> The most common problem after a break up...and what to do about it. (almost everyone I've helped has had trouble with this)</li><li><strong>Video Eight: </strong>The vital Question to ask yourself before you start using this program.</li><li><strong>Video Nine:</strong> Why waiting is the first thing you should do (this is counter intuitive).</li><li><strong>Video Ten:</strong> An irresistible new you!</li><li><strong>Video Eleven: </strong>“Can I get my Ex back after cheating?\" (How to handle “relationship crimes\")</li><li><strong>Video Twelve:</strong> ...More on that important subject.</li><li><strong>Video Thirteen:</strong> Why your Ex may be prolonging a break-up (Hint: It can even be a good sign).</li><li><strong>Video Fourteen:</strong> Your most attractive self now.</li><li><strong>Video Fifteen:</strong> How to handle the all important face to face meeting...and what you should never do at one.</li></ul><p><strong>Here's a NO LOSE offer for you today.</strong></p><p>Have a look inside <strong>Get Your Ex Partner Back..</strong> by taking advantage of our new <em><strong>RISK-FREE</strong></em> program, this way, you are under no obligation, as this program includes: <strong>Lifetime access &amp; </strong><strong>30 day money back guarantee!</strong></p>", 
    "end_date": null, 
    "title": "How To Get Your Ex  Back Fast- Step By Step Guide", 
    "price": "20.00", 
    "instructors": "Ricardo Soto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577130_8b0e.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-your-ex-back/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T05:03:20Z"
}