{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>How to love yourself, before you can love someone else!</strong></p><p>This course is for those who not only want to fall in love, they want a strong powerful lasting love!  They want to understand what it means to 'be enough' to be 'worthy'. They want to understand and believe others who are secure, strong and loving will love them back.</p><p><strong>Love for yourself starts with mastering these 4 simple actions.</strong><br></p><ul><li>Loving yourself Physically</li><li>Loving yourself Emotionally</li><li>Loving yourself Intellectually</li><li>Loving yourself Spiritually </li></ul><p><strong>To attract a mate we project to them our best selves. If love for ourselves is poor we have little to give.  </strong></p><ul><li>Until we look inward and understand why we are worthy, why we are good enough, why we can love ourselves, we can't give a true picture to another of what we are capable of giving to them.<span></span></li><li>This course is not about changing our mindset or trying to create a new emotion.  This course will teach you concrete actionable steps you can learn which will change your mindset, change how you view yourself and will change how people view you.</li></ul><p><strong>Content and Overview</strong><br></p><p>Love is often viewed as an emotion that comes and goes and we are lucky if we find someone we 'fall' in love with and they 'fall' in love with us.</p><p>Even when this magical thing called love happens it is often misunderstood that we can somehow fall out of love and lose the 'magic' we once had.</p><p>This course is for those who refuse to leave their life up to chance.  Learning to love yourself is for those who are ready to learn the steps and will do the homework and implement these principles into their lives.</p><p>You are ready to take action to improve the health of your physical body. You are ready to bring peace to your emotions by being honest with yourself, learning to trust others and building your inner character.</p><p>You are not a victim of circumstance but are  free to choose, to create a new reality for you.  You are willing to trust your sense of right and wrong and have the ability to choose your actions.</p><p>You understand this world is a bigger than you and that we all have faith in a spiritual connection of some type.  This course utilizes the wisdom and love of the bible to guide your spiritual self.</p><p>When you love yourself you will gravitate towards others who also love themselves.  When two people fall in love who live on a solid foundation of personal love, the real magic of love will happen. Using the same principles they love themselves with, they will continue the same actions toward their partner and love flourishes and grows for a lifetime!</p><p><br></p>", 
    "end_date": null, 
    "title": "How to Love yourself before you fall in love!", 
    "price": "20.00", 
    "instructors": "Troy Beans, Eric Murillo", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/728568_943d.jpg", 
    "course_url": "https://www.udemy.com/how-to-love-yourself-before-you-fall-in-love/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-14T23:13:37Z"
}