{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Your professional success depends on your ability to think more effectively than your competitors. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">As you adopt Albert Einstein&#039;s habits for creative, logical thinking, you will increase your intellectual power and enjoy more professional achievements.</strong><br style=\"\">  </p>  <p style=\"\">  \tAlthough we often think of Albert Einstein as one of the  smartest people ever, we don&#039;t investigate what it was that made him so. People  who speak highly of him often attribute his genius to some mysterious gift.  They don&#039;t believe his smarts came from a certain attitude about learning. In reality, you can recreate some of his habits to get smarter and boost your intellectual abilities.  </p>  <p style=\"\">  \t  That&#039;s what you&#039;ll get from this course. You&#039;ll learn about  9 effective habits Einstein used to   develop the mind power that made him famous. After each video lecture where one of these habits is  presented, there&#039;s another video lecture and worksheet activities  you can complete to develop those abilities and habits in your own life.  </p>  <p style=\"\">  \t  It may not be theoretical physics you&#039;re trying to  be successful at, but whatever you aim to accomplish in your life  professionally, academically, or artistically will come much faster as you  implement Einstein&#039;s habits in your daily routine.  </p>  <strong style=\"\">WHAT YOU  WILL LEARN</strong>  <p style=\"\">  \t  In <strong style=\"\">less than  three hours</strong>, you can learn how to...  </p>  <ol style=\"\"><li style=\"\">Think more creatively and develop your own       intellectual independence.</li><li style=\"\">Focus on important problems in your work and education.</li><li style=\"\">Ignore       criticism from people who don&#039;t understand your ambition or ways of       thinking.</li><li style=\"\">Improve       your imagination and use it to be more successful.</li><li style=\"\">Design your own curriculum and teach yourself new skills.</li><li style=\"\">Determine       which professional relationships will help you achieve your goals and       which ones won&#039;t.</li><li style=\"\">Get       rid of trivial activities in your life and focus on what&#039;s worthwhile.</li></ol>  <hr style=\"\">  <strong style=\"\">OVER 6,000 STUDENTS HAVE ALREADY ENROLLED<br style=\"\">  </strong>  <p style=\"\">  \tOver <strong style=\"\">6,000</strong><strong style=\"\">+ students</strong> have already enrolled in Steve&#039;s courses! Click the <strong style=\"\">Take This  Course</strong> button to start learning like Einstein and accelerate your career!  </p>  <p style=\"\">  \tThe special,  discounted price for this course won&#039;t last long! <strong style=\"\">Enroll today!</strong>  </p>  <hr style=\"\">  <strong style=\"\">REVIEWS FOR THIS COURSE<br style=\"\">  </strong>  <p style=\"\">  \tRead  what some people have said about this course:  </p>  <ul style=\"\">  \t<li style=\"\">    Ken Kaufman, CFO of the Year &amp; Author of <em style=\"\">Impact Your Business</em> said, &quot;Success  comes to those who are willing to pay the price to learn. Notice I didn&#039;t say  anything about expensive education, but the price to learn. Learning requires  thinking, hard thinking. The principles in this course are essential for  building a successful career in this ever-changing economy. I would recommend  it to anyone who is committed to learning the right things the right way.&quot;<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">Daphny  Cross said, &quot;Mr. Churchill has nailed it. Many times we just don&#039;t see  that in order to be better qualified, we just need to think a little outside  our usual box. Sometimes we get so stuck in a rut, it never occurs to us to do  this. Clear and concise, this course will help anyone who feels they need  change in their career.&quot;<br style=\"\">  \t<br style=\"\">  \t</li>  \t<li style=\"\">Be sure to read more reviews on this course down below!</li>  </ul>  <hr style=\"\">  <strong style=\"\">BONUS   RESOURCES<br style=\"\">  </strong>  <p style=\"\">  \tIf you sign  up now, you&#039;ll also get these free resources:  </p>  <ul style=\"\">  \t<li style=\"\">3 Free Bonus Lessons:<br style=\"\">  \t<strong style=\"\">1) How You Can Learn Better<br style=\"\">  \t    2) How to Improve Your Attention Span and Concentration<br style=\"\">  \t    3) What is an Autodidact, and Why Should I Care?    </strong></li>  \t<li style=\"\">A high-resolution, printable quick reference guide listing  9 habits of Einstein&#039;s extraordinary genius.</li>  \t<li style=\"\">You can also download all the audio files for  this course to listen to while you&#039;re on-the-go.</li>  \t<li style=\"\">Get guaranteed responses (within 24 hours) from the instructor for any question or discussions you post!<br style=\"\">  \t</li>  </ul>  <hr style=\"\">  <strong style=\"\">FREE PREVIEWS<br style=\"\">  </strong>  <p style=\"\">  \tClick the Preview buttons in the course outline down below to see a free sample of the videos that will teach you how to get a better job faster.  </p>  <hr style=\"\">  <strong style=\"\">MONEY-BACK  GUARANTEE<br style=\"\">  </strong>  <p style=\"\">  \tThere&#039;s a  30-day, no questions asked, <strong style=\"\">money back guarantee</strong> for this course. If you&#039;re not  satisfied, you get all your money back, it&#039;s that easy.  </p>  <hr style=\"\">  <strong style=\"\">ENROLL NOW</strong>  <p style=\"\">  \tClick the &quot;<strong style=\"\">Take This Course</strong>&quot; button at the top of this page to start learning about Einstein&#039;s learning secrets right away.  </p>", 
    "end_date": null, 
    "title": "How to Learn Like Einstein: 9 Habits of Extraordinary Genius", 
    "price": "40.00", 
    "instructors": "Steve Churchill, Didactable Interactive", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/407442_e78f_12.jpg", 
    "course_url": "https://www.udemy.com/einstein/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-29T04:19:31Z"
}