{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">How To Start Your Day with Successfull  Morning Ritual?</strong></p><p style=\"\">Have you ever wonder how successful people be more energetic, happy and vibrant everyday?How would you like to achieve even more everyday?What if you could be even MORE productive, happy and energetic on a daily basis?</p><p style=\"\">There is a way and successful people have been utilizing it for centuries. It&#039;s called developing a <strong style=\"\">morning ritual</strong>. &quot;<strong style=\"\">We have designed this course to be easily understood by everyone.</strong>&quot;</p><p style=\"\">Creating your own morning ritual is one of the most powerful things you can do to transform your life. The purpose of incorporating a morning ritual into your life is to empower you to be at your best everyday. The way that you use your body biochemically changes how you feel. By moving your body, you begin to take on more oxygen, which gives you more energy. It also changes your emotions, as every emotion you experience is through a specific physiology. You can easily enhance your state every morning by doing this morning ritual activity.</p><p style=\"\">The course is about creating your own morning ritual. <strong style=\"\">Morning ritual</strong> is a practice that makes your starting point of the day energetic and full of positive energy. <strong style=\"\">Morning ritual is a process that had been practiced by many successful peoples in the world.</strong> Many successful icons like Robin Sharma, Drew Canole, Tony Robins, and many more. </p><p style=\"\">There is this terminology called Star, Peak and Final stages in this Morning ritual. In the starting stage, your energy level will be low and you will be emphasizing on how to wake the energy level out. In the Peak state, your energy level will start rising, and in that stage we will be utilizing the energy and changing it to a positive state. Finally, on the Final stage, your energy will be stable and you will be able to use that stable energy for your entire day.</p><p style=\"\">The course material that we have included is video. All the contents are downloadable. </p><p style=\"\">This course will only take 30 minutes to complete, you can even modify the duration of the morning ritual process according to your convenient while practicing it. </p><p style=\"\">This course is divided into 3 main section. The first section is starting, the second section is Peak, and the third section is Final. We structured this course according to the activities that are available in the ritual.</p><p style=\"\">Students should take this course because this will help you to start your day in an awesome state. Your life will be transformed into a bubble of a positive energy and know the importance of morning ritual. Students will acquire the knowledge to amplify the day. Students will also acquire the knowledge of modifying the activities according to their convenience.  Students will be inspiring the peoples around them with positive thoughts and activity</p><p style=\"\">What you do consistently everyday is what you become. Becoming who you want to be is a <strong style=\"\">PROCESS</strong>. It only happens through constant, repetitive conditioning on a daily basis. </p>", 
    "end_date": null, 
    "title": "How To Start Your Day with Successful Morning Rituals", 
    "price": "20.00", 
    "instructors": "Jonathan Leong, Loggeswaran Sinnaih", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/484160_d4e3_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-start-your-day-with-successful-morning-rituals/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-23T09:58:59Z"
}