{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong>Over 2,400 people enrolled in my courses from around the world</strong></li><li><strong>Learn from a Global Executive Coach and Trainer</strong></li><li><strong>Overall, 25+ FIVE STAR reviews from very happy students from all our courses</strong></li></ul>\n\n<p><strong><em>Course Last Updated - June 2016</em></strong></p>\n\n\n\n\n\n\n\n<p><strong>---</strong></p>\n\n\n\n\n\n\n\n<p><strong>Do you have a fear, phobia or traumatic memory holding you back from life?</strong></p>\n\n\n\n\n\n\n\n<p><strong>Are you sick of feeling scared, terrified or helpless?</strong></p>\n\n\n\n\n\n\n\n<p>Learn an accelerated technique in this course that you can use on yourself and even help others to cure any fear, phobia or traumatic memory. The worse your fear or phobia, the worse the pain of the memory, the more effective this course and the results will be.</p>\n\n\n\n\n\n\n\n<p>---</p>\n\n\n\n\n\n\n\n<p><strong>Typical and conventional methods to help people with fear and phobias take at least 6 months, often years and thousands of dollars in therapy.</strong></p>\n\n\n\n\n\n\n\n<p><strong></strong> Such methods include desensitisation and exposure therapy. This involves painfully exposing yourself directly to the cause of your fear and phobia, and at the end of it all, at most building a tolerance through desensitisation.</p>\n\n\n\n\n\n\n\n<p>This course is not about building tolerance. </p>\n\n\n\n\n\n\n\n<p>This course is about eliminating the phobia all together. In fact - the advanced technique I am sharing with you today offers immediate, direct and permanent results in 15 minutes – the rest of this course explains the hows and the whys for those of you who are interested.</p>\n\n\n\n\n\n\n\n<p>---</p>\n\n\n\n\n\n\n\n<p>Sounds too good to be true right? </p>\n\n\n\n\n\n\n\n<p><strong>The good news is this technique is easily demonstrated, anyone can do it, it doesn't take any skill and the results are immediate so it's not going to take long for you to be blown away by the results too.</strong> </p>\n\n\n\n\n\n\n\n<p>I have personally used this technique with my coaching clients, at one of the leading personal development organisations in the world, to let go of phobias of flying, heights, spiders, rats, sharks, water, dogs, home invasion as well as some really painful traumatic memories of things that have happened to my clients in the past. </p>\n\n\n\n\n\n\n\n<p>Most of the people I have used this technique with, had been carrying these phobias and these memories well over 20 years, and it worked for them in 15 minutes. </p>\n\n\n\n\n\n\n\n<p>Here is what one of these clients had to say:</p>\n\n\n\n\n\n\n\n<p><em>\"In the first session, before I even started NLP, you did a technique with me as I am scared of dogs. I was so surprised, I actually noticed it being subtle, but I was so shocked yesterday - see attached photo (I'm hugging a big giant husky). Thank you so much James, your sessions have had a big impact on me - there is certainly more good news to follow.\" </em></p>\n\n\n\n\n\n\n\n<p>Monica Zheng - Financial Accountant, Goodman Group</p>\n\n\n\n\n\n\n\n<p>---</p>\n\n\n\n\n\n\n\n<p>Whatever your fears or phobias, whatever your traumas, when you take this course, you too can experience the freedom of curing them and letting them go. </p>\n\n\n\n\n\n\n\n<p><strong>If you're ready to be done with your fear and phobia, then I encourage you to enrol now. Click the \"Take This Course\" button in the top right hand corner.</strong></p>\n\n\n\n\n\n\n\n<p>It will take 30 seconds to enrol, and then you can start learning how to cure your fear or phobia, immediately.</p>", 
    "end_date": null, 
    "title": "How to Cure any FEAR or PHOBIA - simple, fast and permanent", 
    "price": "25.00", 
    "instructors": "James Hayes", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/413719_0b87_4.jpg", 
    "course_url": "https://www.udemy.com/cureyourphobia/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-05T01:54:10Z"
}