{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5>Who Should Take This Course?</h5>  <ul style=\"\">  \t<li><strong style=\"\">This course is for any woman who wants to walk in a room and be noticed for her grace and confidence.</strong> (Give yourself permission to be a show stopper!)</li>  </ul>  <ul style=\"\">  \t<li><strong style=\"\">This course is for women who want to empower their mind, body, and spirit to live a first class life.</strong> (Go ahead be amazing!)</li>  </ul>  <ul style=\"\">  \t<li><strong style=\"\">This course is for women who want to maintain their womanly- figure in a smart, simple, and effective way.</strong> (Plus discover your own sex-appeal!)</li>  </ul>  <ul style=\"\">  \t<li><strong style=\"\">This course is for women who want to know the secrets of ageless beauty so they can shock and awe... </strong>(Keep them guessing!)<strong style=\"\"></strong></li>  </ul>  <h5>Learn  practical applications of Audrey Hepburn&#039;s timeless sensibilities and  natural, step-by-step life enhancing rituals to achieve a more vibrant  existence and ageless appearance regardless of your age. Be unforgettable!</h5>  <p>  \t<strong style=\"\">My name is Jeanne Floresca and I am an Author and  Ageless Lifestyle Wellness Coach. </strong>  </p>  <p>  \t         I have been in the health &amp; fitness industry for over 10 years helping thousands of people become healthier and happier.  </p>  <p>  \t         By  combining what I learned in the health and fitness industry with the  inspirational thoughts of Audrey Hepburn on how to be undeniably lovely,  I developed these protocols to achieve unchanging grace, confidence,  and agelessness.  </p>  <h5>What You Will Learn</h5>  <ul style=\"\">  \t<li>Tips &amp; techniques to practice ageless living so that you can increase your energy, exude joy, and look more youthful.</li>  </ul>  <ul style=\"\">  \t<li>Practical health, nutrition, and fitness tips to become more vibrant.</li>  </ul>  <ul style=\"\">  \t<li>How to embody more grace, confidence, and loveliness.</li>  </ul>  <ul style=\"\">  \t<li>How to increase your self-awareness, so you can be happier and more fulfilled.</li>  </ul>  <p>  \t   Program contains over 3.5 hours of video training, 50 lectures, and 8 fun quizzes.  </p>  <h5></h5>  <h5>Are you ready to upgrade your distinctive mojo? To be more graceful, confident, and vibrant?  Basically, be gloriously radiant ;-)</h5>  <h5></h5>  <p>  \t<strong style=\"\">A little note...<br style=\"\">  \t</strong>  </p>  <p>  \t<em style=\"\">Audrey Hepburn was and is an inspiration to the world. Her story is a powerful one and has moved me. Hopefully, it will move you as well to live your best life. </em>  </p>  <p>  \t<em style=\"\">Audrey Hepburn was graceful and gracious, but in creating this workshop and learning more about her story, I realized she had a different kind of confidence than I first assumed.</em>  </p>  <p>  \t<em style=\"\">She didn’t have that normal confidence when we think of the word ‘confident’—you know, where it describes someone who is bold and assertive. She had that understated, like a house built on bedrock – a foundation so strong – that is what her confidence was like. </em>  </p>  <p>  \t<em style=\"\">A confidence that made her feel so assured that everything was going to workout in the end. That life would be OK. That she would be OK. </em>  </p>  <p>  \t<em style=\"\">That kind of confidence is something that we all could use.</em>  </p>  <p>  \t<em style=\"\">The thing is, because she was able to have it, I know that you and I could have it. </em>  </p>  <p>  \t<em style=\"\">It is my wish that we all find a little bit of Audrey in ourselves— whether it’s her spunkiness, graciousness, her indomitable confidence, or the selfless humanitarian she became. </em>  </p>  <p>  \t<em style=\"\">I can only imagine how it would enhance our own personal story and lifestyle to uncover our grace and confidence. </em>  </p>  <p>  \t<em style=\"\">It’s the real you, it’s the real me, with just a little more je ne sais quoi… </em>  </p>  <p>  \t<em style=\"\">~Jeanne</em>  </p>", 
    "end_date": null, 
    "title": "How to Be Lovely and Ageless: Cultivate Inner & Outer Beauty", 
    "price": "20.00", 
    "instructors": "Jeanne Floresca", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/175054_0f75_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-lovely-and-ageless-jeanne-floresca/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-02T00:38:20Z"
}