{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\"><em style=\"\">DECISIONS, DECISIONS…WHAT SHOULD I DO?</em></strong>  </p>  <p>  \t  Do you sometimes struggle with making a decision and wish there was &quot;something&quot; wiser than you to help you out? Do you wonder how you should go about prioritizing all the things you need to do and what you should do first or not at all? Do you question if you&#039;re really in the right relationship and whether to continue with this person or not? What about taking that job or going back to school or going on that trip?  </p>  <p>  \t  In life we&#039;re bombarded with having to make all these decisions and choices that can have huge consequences for us. And so we often wish there was a &quot;Somebody or Something&quot; out there that could just tell us what we should do, where we should go, who we should connect with. To be guided by a higher intelligence is something we all want and need. Why? Because we want to live our best life! We don’t want to miss out in some way and find that we made the wrong choices and end up having a lot of regrets.  </p>  <p>  \t  Well guess what...we can have that kind of higher guidance to help us out!  </p>  <p>  \t<strong style=\"\"><em style=\"\">INTUITIVE GUIDANCE IS KEY TO LIFE SUCCESS!</em></strong>  </p>  <p>  \t  Throughout history people have gotten that guidance and insight, those inspirations that led to new discoveries in science and inventions, protected them from danger, led them to their soul mates, directed them to great destinies. It&#039;s the voice of intuition that people responded to, heard and acknowledged. It&#039;s part of the package in being human…a way of knowing that&#039;s available to us yet we&#039;re never taught how to use it.  </p>  <p>  \t  This course will serve you as an introduction to intuition along with guidance on how to do various exercises to access it.  </p>  <p>  \t<strong style=\"\">You’ll Learn…</strong>  </p>  <ul style=\"\">  \t<li>The four levels of reality and what intuition can access.</li>  \t<li>The two different modes of consciousness and where intuition fits in.</li>  \t<li>How we can easily contaminate intuitive guidance.</li>  \t<li>What you need to declutter from your life to let intuition in.</li>  \t<li>The different ways intuition communicates.</li>  \t<li>The state of being that is required to be receptive to intuition.</li>  \t<li>The key steps involved to access intuition.</li>  \t<li>How to get answers and guidance to various questions and decisions you need to make.</li>  \t<li>How to know what you should focus on in your life.</li>  \t<li>Why not all your feelings are intuitive and how to know the difference.</li>  \t<li>And much, much more….</li>  </ul>  <p>  \t<strong style=\"\">This is for you if…</strong>  </p>  <ul style=\"\">  \t<li>You’ve always been curious about intuition but don&#039;t really know how it works.</li>  \t<li>You&#039;ve felt as though you had intuitive skills and have wanted to develop them.</li>  \t<li>You would like to be more connected spiritually to a form of higher guidance to fulfill your life purpose.</li>  \t<li>You&#039;d like to have a number of exercises at your finger tips to help you get guidance and insight on various life situations as they come up.</li>  </ul>  <p>  \t<strong style=\"\">What you’re going to get in this course…</strong>  </p>  <ul style=\"\">  \t<li>Over two hours of videos explaining intuition, how it works, how to access it, what can sabotage you or block it, what exercises you can do and how to do them, etc.</li>  \t<li>A pdf download with over a dozen exercises to use whenever you need to access intuitive guidance.</li>  \t<li>A guided meditation that creates the right shift of consciousness to access intuition.</li>  \t<li>Bonus audio recordings of my interviews with intuition experts and best-selling authors on my former radio show.</li>  \t<li>Bonus coupon code for my other courses in the Success Through Spirit Toolkit Series.</li>  \t<li>Resource list of some of the best books on working with intuition.</li>  \t<li>Future updates on additional intuitive exercises.</li>  </ul>", 
    "end_date": null, 
    "title": "How to Use Intuition for Life Success", 
    "price": "30.00", 
    "instructors": "Linda Christensen, PhD", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/163000_eeaa_3.jpg", 
    "course_url": "https://www.udemy.com/success-through-spirit-seminars-how-to-use-intuition/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-12T19:15:25Z"
}