{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Many people want to have a successful and meaningful life, but they haven’t been taught how to create that in their own lives. Furthermore, they don’t understand the science behind our very own psychology. Imagine the ability to increase your capacity for intelligence, manage stress effortlessly, and generate new ideas without much thought. In this course, we will cover five of the biggest mindset shifts that uber-successful people have adopted in their own lives. </p>\n<p>Expect to develop a revolutionary new way of thinking, based on Integral Life Practice (ILP). ILP stands out as one of the most effective frameworks to facilitate vertical development because of its focus on human psychology.</p>\n<p>In order to create a life that you want, you must first start with the psychology of success. Imagine what it feels to have everything the way you want it. Now imagine what it might take to get there. Did you feel empowered or overwhelmed? If like most people you felt overwhelmed, this course is for you. It will help you develop inner strength and put you in the right state of mind to accomplish your biggest dreams. </p>\n<p>When you have completed the course, you will be able to design your life and recognize your own self-limiting beliefs to success improving every aspect of your life. You will also be able to blueprint how others have achieved success you admire. <br><br></p><p>In this course, we will discuss each mindset shift and why it contributes to a fulfilling, happy and meaningful life.<strong> </strong></p><p><strong>What else to expect:</strong></p><ul><li>To be mentally and psychologically challenged</li><li>High instructor availability to answer any questions you may have</li><li>New content added on a regular basis</li><li>Content stays up to date, based on new scientific research and studies</li><li>Tools and insights for personal development and authentic relationships</li></ul>", 
    "end_date": null, 
    "title": "How to Begin an Integral Life Practice (ILP)", 
    "price": 0, 
    "instructors": "David Landau", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/711450_3552_2.jpg", 
    "course_url": "https://www.udemy.com/begin-an-integral-life-practice/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-31T02:24:40Z"
}