{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h5>Master The Skill Of Goal Setting To Achieve Results Like Never Before</h5>  <p>  \t  Goals are very important part of anyone’s life. Especially if you&#039;re just starting out a new part of your life : new school, new job, new city … Then, setting the right goal and pursuing it is crucial part of your life. <br>  \t<br>  \t   People who live their life without any goals often fail to get what they have always dreamed of, without even really trying to get it. Some people have this philosophy of being contented with what they have, which is good to some extent, but it does not work for you in the long run. You always need a purpose to move on and get a better life, and this purpose is provided to you by goals. <br>  \t<br>  \t   In this whole course, I will show you the whole process of identifying goals, pursuing those goals and finally reaching them, making them part of your life. <br>  \t<br>  \t   Goals can make your life far easier and better. If you take your goals seriously, and follow the steps and strategies in this course, then I am 100 percent sure that it will not only make your life better, but it will also help you in resolving all of your problems more easily. If all of the above is not making sense to you, then you should still start this course, because in it you will come across all the details.  </p>  <h5>Wow, this is too good to be true! Will this cost me an arm?</h5>  <p>  \t  Here’s the good news, <strong>NO.</strong>I want everybody to be able to have access to these great goal setting tools .  </p>  <p>  \t  So how much will this cost you?  </p>  <p>  \t <strong> REAL WORLD VALUE = $199</strong>  </p>  <p>  \t But hey, like I said. I want EVERYBODY to be able to afford this amazing Goal Setting Course:  </p>  <p>  \t <strong>So, I’ve decided to lower the costs of this product.</strong>  </p>  <p>  \t Hence, your total investment in <strong>&quot;</strong>How To Set And Reach Any Goal You Wish&quot; Is:  </p>  <p>  \t 99$  </p>  <p>  \t BUT, I&#039;m making a special price for the first 300 early birds here :  </p>  <p>  \t  I&#039;m giving it away for the first people getting this offer, for :  </p>  <h5>$29 only (launch price)</h5>  <h5>for the <strong>first</strong> 300 fast action takers!</h5>  <p>  \t I don’t want you to miss out on this amazing opportunity! Take action before it&#039;s too late and the price goes up again!  </p>  <p>  \t P.S Remember, It’s not how much you stand to gain, but how much you stand to lose out by not taking action.  </p>  <p>  \t P.P.S If you’re sick of others telling you that you can’t succeed in your life, It’s high time you showed them who is the boss!  </p>", 
    "end_date": null, 
    "title": "How To Do More, Faster - Set And Reach Any Goal You Wish", 
    "price": "20.00", 
    "instructors": "Junior Engineer Martin Gamsby", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62493_86df_9.jpg", 
    "course_url": "https://www.udemy.com/set-and-reach-any-goal/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-27T01:09:15Z"
}