{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Ignite the fire inside.</em></strong></p><p>In this class, we will use unorthodox writing methods and thought experiments to create powerful change within ourselves. By shining a light on our own internal processes, we will discover what we want, why we're not getting it, and what we can do in our lives to produce <strong>better outcomes</strong>. Becoming a better person requires<strong> hard work</strong>—difficult emotional labor, facing our fears, and building good habits to fight our internal resistance. This course gives you the tools you need to do the work you need to become the person you want to be. Do the work, and you will have the power.</p><p><br></p><p><strong><em>Here are some of the skills you will learn in this course:</em></strong></p><p><strong>Emotional Mastery:</strong> We will learn to understand our emotions as teachers that signal us to take action. Instead of reacting unconsciously, we will create actionable plans to help us deal with our most difficult emotional states. Finally, we will learn about the physiological responses our body gives us as feedback.<br></p><p><strong>Discipline/Habit-Building:</strong> Our brain does not distinguish between good and bad habits. Therefore, it is up to us ensure that we are rewarding ourselves for productive habits and replacing destructive habits with new routines and new results.<br></p><p><strong>Visualization For Goal Attainment:</strong> In order to achieve goals, I outline a process for visualization in order to identify what we want, create a plan for getting it, and reflect/adjust as needed. You will do exercises to envision your growth in vivid detail, and accelerate your learning process.<br></p><p><strong>Communication and Persuasion:</strong> We will strengthen our powers of empathy and persuasion in order to share ourselves with others and be understood and connected. <br></p><p><br></p><p><strong><em>This course includes:</em></strong></p><ul><li>19 <strong>writing exercises that actually work</strong>. They have been carefully selected and designed to improve the quality of your life. </li><li>11 <strong>high-quality</strong>, entertaining (read: not boring), and professional video lectures.</li><li>Continuing support and updates for enrolled students.</li><li><strong>Resources</strong> for continuing education and improvement</li><li>Lifetime access and a 30-day money-back guarantee.</li></ul><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to Become a Better Person: Exercises for Personal Power", 
    "price": "50.00", 
    "instructors": "Davis Wang", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715746_084a_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-better-person/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T16:41:33Z"
}