{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The course is for anyone who wants to change something in their life. Do you want to stop smoking? Or lose weight? Or find a new partner? Do you want to start going to the gym? Learn a new language or take up a new instrument? Great! So what is stopping you?</p><p>Why do so many people SAY that they're going to do XYZ, and yet so few people start it… let alone keep it up, and make the change. What is it about human behavior and motivation that we can learn?</p><p>Maybe you've tried before – and maybe even achieved limited success? Perhaps you've stopped smoking for a while… but then had a relapse? Perhaps you lost the weight… only to put it all back on again soon after? What can you learn from that experience?</p><p>Change comes in stages. First we have to recognize that we want and need to change, then we prepare for it, then we start to do it… but crucially, we have to keep it up. And on this course, we look at ways to get motivated, and to keep that motivation going. What has worked before in the past for you? What didn't work?</p><p>There is a short handbook to fill in, for reflection and in order to help you bring about the long-lasting change that you desire.</p><p>The course will take approx 2 hours to complete. By the end, you'll have a game plan – you'll know exactly what you need to do, what to focus on and where to start.</p><p>The course is structured with videos, some outside material to motivate you and a booklet for you to fill in and reflect upon your life. This course is for people who want to experience a transformation. If there's a habit of a lifetime that you want to break, or a change you want to implement – regardless of how many times (if ever) its been attempted before – this course will help you to implement a strategy which will work.</p><p><strong>Be the person you want to be.</strong></p>", 
    "end_date": null, 
    "title": "How to Change Your Life - i.e. Lose Weight or Stop Smoking", 
    "price": "20.00", 
    "instructors": "Lisa Newton", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/589250_2dad_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-change/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-21T09:24:53Z"
}