{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    This course is for anyone who is tired of a life of compromises, beating around the bush of their own happiness and success. We live in a society with codes of what it means to be successful, of what it takes to « look » happy in appearance. Usually, you end up living the life that others expected you to live (from your parents, entourage, culture, however well-intentioned they might be). Your life is about trying to fit in. You may go to college and major in a speciality that does not suit who you are and what your dreams and desires are.  You have no true passion.  </p>  <p style=\"\">  \tUltimately, you reach a point where you feel mediocre and overall not motivated. You may even lose control of your life, be overwhelmed by bills, unsatisfied with a romantic Partner with whom you’re not happy but are afraid to let go.  You are probably hoping for a miracle ; well, this is your chance to unlock the key to true abundance and bliss.  </p>  <p style=\"\">  \t                      This course is for you, if you feel like you want to create a life that suits your own desired purpose, your life mission, even if you’re not really sure what this life mission is yet. This course is designed to help you find out that you truly are a being of abundance and that, by shifting your energies, you can attract everything you desire in your own terms.  </p>  <ul style=\"\">  \t<li style=\"\">By the end of this course, you will be able to connect to your guides, raise your intuition and receive answers to situations in life in which you need clarity, you will raise your frequencies and start attracting that which you desire instead of what you don’t want.</li>  \t<li style=\"\">You will know how to get in touch with your Money Muse and start vibrating with the flow of the law of attraction rather than going against it.</li>  \t<li style=\"\">You will understand and create through an effortless flow of asking and receiving.</li>  \t<li style=\"\">You will start to materialize abundance and prosperity.</li>  </ul>", 
    "end_date": null, 
    "title": "How to Attain a Career Doing What You Love & Being Yourself", 
    "price": "50.00", 
    "instructors": "Renee Konan", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287488_17d3_3.jpg", 
    "course_url": "https://www.udemy.com/igniteyourinnerpowerandbecomeanabundancemagnet/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-25T16:12:43Z"
}