{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course has a simple, 15-sentence fill-in-the-blank style template that you can use to read your Vedic astrology birth chart. Inside this course, you will learn how the planetary energies are the “producers” of events and situations in your life. Learn the goals of these energetic forces and how they apply to you and your interpretations of the world.</p><p><strong>Discover how jyotiṣa or Vedic astrology illuminates your path of dharma in your life to help you interpret and declare satisfaction and happiness with the outcomes and results of your interactions in life.</strong></p><ul><li>Learn the foundational goals of the planetary energies</li><li>Discover the environments, rāśis or zodiacal signs, that support or hinder these planetary energies. </li><li>Understand what the material motivations of the bhavas (or houses) are trying to produce in your life.</li></ul><p><strong></strong></p><p><strong>Discover a 3-Step Framework of working with the whole human being you are by exploring the connections between Body, Emotions and Language and Jyotiṣa (Vedic Astrology)!</strong></p><p>I want to offer you a framework, a new perspective of the holistic and integrated human being that you are! This perspective may help to incorporate several concepts that you have come across in your quest for personal transformation and development.</p><p>The underlying concept is that of language and the resultant, subjective expression of emotions and movement; movement through actions, movement through thoughts and ideas. </p><p><strong>Course Contents And Overview</strong></p><p>This course contains <strong>36+ lectures and 2+ hours of content</strong>! The material in this course is what I use with my coaching clients so if you are curious about learning to coach yourself from observing your thoughts, ideas and body while exploring the interpretations of your Vedic astrology birth chart, this course is for you!</p><p>I strongly believe in 3 key ideas: <strong>#1) Education</strong> - learn about what matters to you; <strong>#2) Coaching</strong> - practice and embody that learning; and <strong>#3) Leadership</strong> - show up \"fully and in presence\" with others.</p><p>Every section in this course is connected and invites you to embody the learning. Each section has reflections and enquiry questions to help you notice what shows up for you as you to interpret your Vedic astrology birth chart.</p><p>The more you can practice and apply what you learn in the sections determines the results you'll get.</p><p><strong>Section #1</strong> – “Welcome To The Course” – As a leadership life coach, I am here to provide you with support in your learning. This course, and all my courses, have at their foundation the Ontological Coaching framework and the Vedic framework. Discover how jyotiṣa will help you to see how you “show up” in the world. There is also an invitation to join the private Facebook group called, “Life Coaching And Vedic Counseling”.</p><p><strong>Section #2 </strong>– “Identifying Vedic Frameworks To Learn What Exactly Jyotiṣa Is Revealing” – Before diving into the Basic Chart Reading Template, you are invited to learn a little more detail about the frameworks that support jyotiṣa or Vedic astrology. You will learn about karma, dharma and reincarnation and what jyotiṣa is actually illuminating for you.</p><p><strong>Section #3</strong> – “Basic Chart Reading Template &amp; Associated Keywords For Rāśis, Bhavas and Grahas” – The heart of this course is about using this very simple, fill-in-the-blank type of template and apply it to your own birth chart. If you don’t have your birth chart available, you can follow along with David Bowie’s Vedic astrology birth chart.</p><p><strong>Section #4</strong> – “Adding Nuance To Your Basic Chart Reading Template” – With these additional qualities of the grahas, rāśis and bhavas, you have more information about how you can deepen your understanding of your Vedic astrology birth chart.</p><p><strong>Section #5 </strong>– “Conclusion &amp; Next Steps” – The invitation is to continue to deepen your studies into the Vedic sciences. Revisit your birth chart from time to time with the additional keywords to add nuance and detail into your interpretations. And then notice! That’s the skill you need to practise. Notice! And then notice some more. </p><p><strong>Section #6</strong> – “BONUS Offers And Special Coupon Codes For Students” – I leave you with a special offer to work with me as a leadership life coach. Give me a shout and let’s have a conversation about what creates satisfaction in your life! Also included are coupon codes for my other courses!</p><p><strong>Course Bonuses!</strong></p><p><strong>Bonus #1</strong> – PDF Worksheet \"Rāśi Qualities\" – These are additional qualities about the rāśis which are the environments in which the grahas operate. Some rāśis  are conducive for the grahas to fulfil their goals. </p><p><strong>Bonus #2</strong> – PDF Worksheet \"[PDF] Bhava Translations\" – A 2 page PDF document which lists the translations from Vedic astrology’s most authoritative source, Bṛhat Parāśara Horā Śāstra or BHPS for short. </p><p><strong>Bonus #3</strong> – “CASE STUDY: Basic Chart Reading Template Applied To David Bowie's Birth Chart” – This video describes how to use the Basic Chart Reading Template and apply it to David Bowie’s birth chart.</p><p><strong>Bonus #4</strong> – PDF Worksheet “List Of All Keywords (+ Extras!)” – There are plenty of descriptives to apply to the grahas, rāśis and bhavas. Which ones of these jump out at you? What resonates with you?</p><p><strong>Take Action &amp; Enroll</strong></p><p><strong>Click \"Take This Course\" now </strong>and make the commitment to jump straight into “Read Your Vedic Astrology Birth Chart In 15 Easy Sentences” for yourself. You can easily use this template in less than 15 minutes to get insight into how your unique observer operates!</p><p>See you on the inside!</p><p>Wishing you much success in your journeys,<br></p>Thushyanthan", 
    "end_date": null, 
    "title": "How To Read Your Vedic Astrology Birth Chart In 15 Steps", 
    "price": "30.00", 
    "instructors": "Thushyanthan A", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625454_9b8d_4.jpg", 
    "course_url": "https://www.udemy.com/vedic-astrology-birth-chart/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T03:14:49Z"
}