{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>How to Develop Self-Discipline, Resist Temptations and Reach Your Long-Terms Goals</strong></p><p>If you want to make positive changes in your life and achieve your long-term goals, I can’t think of a better way to do it than to <strong>learn how to become more self-disciplined</strong>. </p><p>Science has figured out a lot of interesting aspects of self-discipline and willpower, but most of this knowledge is buried deep inside long and boring scientific papers.</p><p>If you’d like to benefit from these studies without actually reading them, this course is for you. </p><p>I’ve done the job for you and researched <strong>the most useful and viable scientific findings that will help you improve your self-discipline</strong>. </p><p>Here are just a couple of things you will learn from the course:<br></p><p>- what a bank robber with lemon juice on his face can teach you about self-control. The story will make you laugh out loud, but its implications will make you think twice about <strong>your ability to control your urges</strong>. <br></p><p>- how $50 chocolate bars can <strong>motivate you to keep going</strong> when faced with an overwhelming temptation to give in. <br></p><p>- why President Obama wears only gray and blue suits and what it has to do with self-control (<strong>it’s also a possible reason why the poor stay poor)</strong>. <br></p><p>- why the popular way of <strong>visualization can actually prevent you from reaching your goals</strong> and destroy your self-control (and what to do instead). <br></p><p>- what dopamine is and why it’s crucial to understand its role to <strong>break your bad habits and form good ones</strong>. <br></p><p>- <strong>practical ways to train your self-discipline</strong>. Discover some of the most important techniques to increase your self-control and become better at resisting instant gratification. <br></p><p>- <strong>why the status quo bias will threaten your goals</strong> and what to do to reduce its effect on your resolutions. <br></p><p>- <strong>why extreme diets help people achieve long-term results</strong>, and how to apply these findings in your own life. <br></p><p>- why and when <strong>indulging yourself can actually help you build your self-discipline</strong>. Yes, you can stuff yourself (from time to time) and still lose weight. <br></p><p>Instead of sharing with you the detailed \"why\" (with confusing and boring descriptions of studies), I will share with you the \"how\" – advice that will change your life if you decide to follow it. <br></p><p>You too can master the art of self-discipline and learn how to resist temptations. <strong>Your long term goals are worth it.</strong><br></p>", 
    "end_date": null, 
    "title": "How to Build Self-Discipline", 
    "price": "20.00", 
    "instructors": "Martin Meadows", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/720732_2948_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-build-self-discipline/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T13:14:12Z"
}