{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Join over 2,000 successful students from all over the world who have learned how to achieve their goals successfully!</strong>  </p>  <p>  \t<em style=\"\">LATEST: Course is up to date for January 2015.</em>  </p>  <p>  \t                Learn concrete lessons to improve confidence, eliminate fear, develop an attractive personality, generate enthusiasm and much more to achieve your goals!  </p>  <p>  \t<strong style=\"\">&quot;But, I&#039;m afraid&quot;</strong>  </p>  <p>  \t<strong style=\"\"></strong>Fear is one of the first topics covered in this course. The hardest part is STARTING ... don&#039;t let fear hold you back from changing your life!  </p>  <p>  \t                You&#039;ll learn how to gain success by following concrete lesson models.  </p>  <p>  \t                You&#039;ll learn how to help others by first helping yourself.  </p>  <p>  \t                Only after you follow the lessons outlined in this course will you start to experience the dynamic positive changes in your life.  </p>  <p>  \t                I will be here for you to answer any questions you may have along the way. This is my personal guarantee.  </p>  <p>  \t<strong style=\"\">&quot;How do I know this will work?&quot;</strong>  </p>  <p>  \t<strong style=\"\"></strong>You&#039;ll be learning methods that are decades of years old used by some of the most successful people in history (ex. Benjamin Franklin, Albert Einstein, Henry Ford, J.D. Rockefeller, etc.) and are currently being used in corporations today across the globe. The instructor of this course is an Ivy League graduate studying business and social psychology and using this course material daily in his work at IBM.  </p>  <p>  \t<strong style=\"\">&quot;Why should I listen to you?&quot;</strong>  </p>  <p>  \t                          I have been been using these techniques since 2009 and since my initial learning period, I have obtained a Masters degree from Columbia University, worked as a consultant for 3 years for IBM, earning over $80,000 annually and have started my own business, working from home in California.  </p>  <p>  \t      What worked and continues to work for me WILL work the same for you!  </p>  <p>  \t      You need no prior experience in business or psychology.  </p>  <p>  \t      Click the <strong style=\"\">&quot;Take This Course&quot;</strong> button on the top right of the screen because the sooner you get started, the sooner you&#039;ll become successful!<br style=\"\">  </p>  <p>  \t<strong style=\"\">          Scroll up and Enroll Now!  </strong>  </p>", 
    "end_date": null, 
    "title": "How to Achieve Your Goals!", 
    "price": "50.00", 
    "instructors": "Ryan M. Mancinelli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/337862_2463_3.jpg", 
    "course_url": "https://www.udemy.com/the-science-of-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-06T20:18:42Z"
}