{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Meet my friend Brandon,</p><p>Few years ago,He went to a party where many top-class people of the town were invited. </p><p>He entered into the room and looked everywhere.</p><p>He was amazed to see charismatic people having conversations.</p><p>Few people noticed him but they turned their back on him.</p><p>That was distressing for Brendon.</p><p>He realises that nobody gives him a damn.</p><p>He found some familiar faces in the crowd and they were having good times with others.</p><p>He noticed them but preferred to ignore because He had no courage to join them.</p><p>Someone came to him and asked him, \"Hi, My name is Steve. Did we meet before? How's everything?\"</p><p>He hesitantly declined with fake smile and turned away from Steve.</p><p>He was thinking, \"What's happening to people? This world is full of sick people.\"</p><p>He finally pulled out his mobile phone and started chatting with his (so-called) friends on social media.</p><p>He sat in the corner and hid from others. <br></p><p>He left the room earlier than almost anyone.</p><p>One week after, He realised he was so dumb. </p><p>He had the opportunity to meet some of the best people of the town but he wasted it.</p><p>He wished he could've tremendous time with quality people.</p><p>Few weeks ago,Brandon has been to another similar party. </p><p>This time, he confidently entered the room like a celebrity.</p><p>People suddenly paid attention to him and murmuring, \"Who is this?\"</p><p>He smiled and people including strangers smiled too.</p><p>He found some familiar faces and join the group for conversation.</p><p>The people in the group invited him to join them and everyone in the group was paying undivided attention to him.</p><p>Then, Brandon politely left the group even when people did want him to go.</p><p>He wanted to meet new people so he approached a lady he never met.</p><p>He strikes a conversation and turned the stranger into a familiar.</p><p>He found a top-class business person he never met but always wanted to meet.</p><p>He meets and greets him. He started talking and managed to schedule the meeting after 2 days. This could help him to turn his business around.</p><p>He was the life of the group.</p><p>He became memorable.</p><p>When he left the room, people said, <strong>\"Brandon is an interesting guy\"</strong></p><p>If you too want to be an interesting person and make more friends just like Brandon, I welcome you to the program of 'How to be interesting and make more friends?'</p><p>It's all possible to be meet people with confidence and impress people with your charisma and authority status.</p><p>Meet a stranger and be a  memorable friend.</p><p>Join any group conversation without feeling intimidated and become a leader of the group.</p><p>Welcome to Your social revolution.</p><p>Enrol in this program and be interesting and make more friends.</p><p>I will meet you on the other side of the registration.</p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How to be interesting and make more friends?", 
    "price": "20.00", 
    "instructors": "Mayur Bardolia", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830022_65a1.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-interesting-and-make-more-friends/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T13:52:56Z"
}