{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course I will share with you a technique to reach God-consciousness.</p><p> This was channeled from Archangel Michael.</p><p><strong>God-consciousness<br></strong></p><p>Spiritual breakthrough is about God-consciousness. The goal is to reach a level of consciousness that allows us to be as aware of God as of ourselves. Imagine being as aware of God as we are of ourselves. This is the breakthrough we seek. But it is a difficult goal to realize. </p><p>One of the greatest seekers of God-consciousness, the late Edgar Cayce teaches: \"Remember there is no shortcut to a consciousness of the God-force. It is part of your own consciousness, but it cannot be realized by the simple desire to do so. Too often there is the tendency to want it and expect it without applying spiritual truth through the medium of mental processes. This is the only way to reach the gate. There are no shortcuts in metaphysics. Life is learned within self. You don’t profess it, you learn it\".<br></p><p><strong>CLAIRVOYANCE</strong></p><p>Clairvoyant (clear vision) -- To reach into another vibrational frequency and visually perceive \"within the mind's eye\" something existing in that realm. A clairvoyant is one who receives extrasensory impressions, and symbols in the form of \"inner sight\" or mental images which are perceived without the aid of the physical eyes and beyond the limitations of ordinary time and space. These impressions are more easily perceived in an alpha state and during meditation, though many clairvoyants can obtain visual information regarding the past, present and future in a variety of environments.</p><p><strong>CLAIRAUDIENCE</strong></p><p>Clairaudience (clear audio /hearing) -- To perceive sounds or words and extrasensory noise, from sources broadcast from spiritual or ethereal realm, in the form of \"inner ear\" or mental tone which are perceived without the aid of the physical ear and beyond the limitations of ordinary time and space. These tones and vibrations are more easily perceived in an alpha state and during meditation, though many clairaudients can obtain verbal and sound-related information regarding the past, present and future in a variety of environments. Most Channelers (also known as Mediums) work with both clairvoyance and clairaudience.</p><p><strong>CLAIRSENTIENCE</strong></p><p>Clairsentience (clear sensation or feeling) - To perceive information by a \"feeling\" within the whole body, without any outer stimuli related to the feeling or information. An Empath is a person who can psychically tune in to the emotional experience of a person, place or animal. Clairempathy is a type of telepathy to sense or feel within one's self, the attitude, emotion or ailment of another person or entity. Empaths tune into the vibrations and \"feel\" the tones of the aura.</p>", 
    "end_date": null, 
    "title": "How to become clairvoyant and reach God-consciousness ", 
    "price": "20.00", 
    "instructors": "Gilad James", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684080_a3cb.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-clairvoyant/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T14:41:26Z"
}