{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Journaling is a powerful personal development tool, but it can also be hard to know where to start or how best to journal for results. <em>How to Start Journaling for Personal Growth </em>teaches you everything you need to get started with a journaling practice that will deepen your self-awareness and enhance your personal development. </p><p><strong>Start Journaling Today with This Comprehensive Course </strong><br></p><ul><li><strong>Learn everything you need to get started with journaling today</strong></li><li><strong>Discover different types of journaling to invigorate your practice</strong></li><li><strong>Identify the journaling techniques that will deepen your personal development</strong></li><li><strong>Explore your inner world through regular journaling, and find out how to revisit old entries for greater insight and awareness </strong></li><li><strong>Transform your journaling insights into real-life change</strong></li></ul><p><strong><br></strong></p><p><strong>A world of information and potential at your fingertips</strong><br></p><p>A regular journaling practice comes with many benefits, including improved physical, mental and emotional wellbeing. In a busy, hyper-connected digital world, most of us are more externally focused (and less internally connected) than ever. As a result, we can lose touch with our values, desires, emotions and needs, leaving us feeling lost, unhappy and directionless.</p><p>Journaling helps us deepen the most important relationship we'll have in our lives: our relationship with ourselves.</p><p>Starting and sticking to a regular journaling practice can be challenging. Many people know journaling will be good for them but they don't know where to begin. This course is designed to answer your biggest journaling questions, provide you with all the guidance you need to get started, and introduce you to several journaling techniques that are specifically helpful for personal development and growth.</p><p><span></span><strong></strong></p><p><strong>Course overview</strong><br></p><p><span>You'll start by learning the answer to fundamental questions like \"What is journaling?\" \"How do I journal?\" and \"How often should I do it?\" You'll also learn more about the different tools you can use and what to do if you're worried about privacy. </span>You'll discover how to make it as easy as possible to get started with your journaling through rituals and the right kind of environment.</p><p>You'll move on to cover some of the main types of journaling and learn how to use these types in your own journaling practice. Then, you'll focus specifically on journaling techniques for personal growth. You'll also have the opportunity to try these with a series of journaling challenges. </p><p>Finally, you'll discover how to return to old journaling entries and find the gold in them. As well as looking at different ways to explore your old entries, you'll learn how to take your insights off the page and into the real world. You'll also find out how to overcome some of the most common challenges journalers face before moving forward with your journaling journey.</p><p>By the end of the course, you'll have clarity around how to use journaling for personal growth, 10 techniques in your journaling toolbox, deeper self-knowledge and self-awareness, and a roadmap for turning your insights into real-life change.</p>", 
    "end_date": null, 
    "title": "How to Start Journaling for Personal Growth ", 
    "price": "30.00", 
    "instructors": "Hannah Braime", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494250_0dbb.jpg", 
    "course_url": "https://www.udemy.com/journaling-for-personal-growth/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T14:52:35Z"
}