{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>The solution lies in the development of your life skills and motivation. </strong>No amount of knowledge can propel you through your challenges if you do not have the necessary skills to assess your strengths and weaknesses, develop a vision, and implement measurable goals. You must learn the skills that will enable you to make the right choices to achieve your goals.  </p>  <p>  \t<strong>Better Life Training Playbook for Life &amp; My 100 Ways Journal Podcast will help provide you with those skills.</strong>  </p>  <p>  \t                                      Throughout my 17 year career as a professional hockey player, I benefited from having great coaches and mentors.  </p>  <p>  \t                                      Combined with my strong drive to improve my game no matter what it took my coaches and mentors were able to make me a better hockey player and a better man. In my book, 100 Ways to Become Your Personal Best, I tell my story and how I distilled those years of coaching and mentoring down to an essential list I call my 100 Ways.  </p>  <p>  \t                                      NOW let me lead you through my Better Life Training Playbook For Life System, My 100 Ways Journal &amp; Fitness Program personally designed for YOU!  </p>  <p>\"This eCourse with have you focusing on the little things &amp; details in life, business or sports so you can be on your game.</p>  <p>  \t<strong>JUST IMAGINE WHAT YOU CAN ACHIEVE BY USING THE SAME METHODS AS I LEARNED THROUGH PROFESSIONAL SPORTS AND MENTORS</strong></p>  <p>  \t          <strong>\"Online Coaching\" for accountability, podcast interviews with subject matter professionals in life, business and s</strong><strong>ports.</strong></p>  <p>  \t<strong>My story Mike Hartman 100 Ways to Become Your Personal Best!</strong></p><p><strong>Now let's create your message and story through accountability coaching!</strong></p>  <p>  \t                                      My 100 Ways Journal, coaching from our online discussion area, access to all subject matter professionals podcast in life, business and sports including the Better Life Training Play Book For Life covering the first 12 questions of The 100 My Ways Journal,online worksheets, video and podcast updated weekly.  </p>  <p><strong>BECOME YOUR PERSONAL BEST</strong>  </p>  <p>  \t                                      Mike Hartman  </p>", 
    "end_date": null, 
    "title": "How To Become Your Personal Best Blueprint System", 
    "price": 0, 
    "instructors": "Mike Hartman", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/253798_8aed_7.jpg", 
    "course_url": "https://www.udemy.com/playbook-for-life-my-100-ways-journal/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-01T14:20:50Z"
}