{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>HAve you had enough not knowing where to go, and living in the wishing mode and never getting there?</p><p>Are you at a cross road of your life and don't know where to go?</p><p>Are you unable to focus and stay with things all the way?</p><p>Do you give up easily without going all the way?</p><p>Are you planning just not those come true what you planned?</p><p>Are you ready to take responsibility in your life and look inside you to change what it needs to be changed, so you learn to focus, on super sharp level and achieve any objectives, which once evaluated will positively serve you with progress and prosperity along with the growth of society?</p><p>his course is for you . </p><p>A course of full of gemstone learnings to understand your mind right now, learn the tools to shift focus and staying with it until you reach your desired goal.</p><p>This course will help you to make goals for your life journey while learning to manage yourself - your mind on this journey.</p><p>TAke a deep breath, and lets go!!!! YOu deserve to have it all!! Right now.. lets to the necessary work together to help you get you there!</p><p>See you on the course.. I m so excited to meet you and interact with you about your course process and hearing your feedbacks and progressions:) and any comments:)</p><p>Let us connect on Facebook too fb/fajcsak</p><p>With Loving kindness</p><p>Dr Zsu</p><p><br></p>", 
    "end_date": null, 
    "title": "How to use your mind to achieve objectives in life", 
    "price": "50.00", 
    "instructors": "Dr Zsuzsanna Fajcsak", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/850332_2240.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-your-mind-to-achieve-objectives-in-life-by-drzsu/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-16T04:20:36Z"
}