{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span>This course system is for each person that want to make there life better. We all need to attain something or the other, somebody needs to turn into the President of an organization though somebody needs to have a fruitful business, may be somebody needs to try for a world visit and actually giving the best trainings to the youngsters&#039; can be an accomplishment for somebody. What I need to say is that we all have an accomplishment want however 9 out of 10 people groups&#039; are limited with constraining convictions and discover their accomplishment longing to be difficult to attain.</span>  </p>  <p>  \tWe talk a ton about negative and positive words yet this preparation project will help you to comprehend what really it implies.  Truth be told, this course system will help you to realize that our commonplace and inner thoughts are one of the most compelling motivations of our restricting convictions. For individuals like us, each fruitful individual has some unique blessing from God, however this course system will help you understand that we all people have square with qualities yet what recognizes the effective individuals is their mentality towards life and their confidence in their accomplishment wish. We all know actually, we even say this exceptionally basic line to all that &quot;nothing is impossible&quot;, then knowing this why we restrain ourselves with constraining convictions.  </p>  <p>  \tLearn this and more in this course.  </p>", 
    "end_date": null, 
    "title": "How to use positive thinking to be more successful. DEMO", 
    "price": 0, 
    "instructors": "Hallie Steveson", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/345204_e2bf_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-positive-thinking-to-be-more-successful/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-15T14:03:03Z"
}