{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Are you frustrated and feeling stuck in your current life? Do know what you need to change to start living your ideal life? Many of us know what makes us frustrated in life </em></strong><strong><em>but just get disappointed when try to make changes. </em></strong></p><p>You are not alone in this feeling, I know how you feel. I have spent more time than I would like to admit discouraged and going around in circles when I wanted to be moving forward. Then I discovered some basic principles that changed my life. I have applied the steps in this course and now instead of feeling unsatisfied and unfulfilled, I have direction and a process to follow to live my ideal life. <em><strong>I would love to help you </strong></em><em><strong>have a process to follow to help feel successful in life and doing exactly what you are here on </strong></em><em><strong>earth to do! </strong></em></p><p>There are several reasons it is challenging to make changes in our lives and one is that there is not a plan to follow. We do not come with a life manual and there are no easy buttons to push in life, however, there is a process that can guide you to your ideal life. </p><p><strong>Introducing...</strong></p><p> <strong><em>H</em></strong><strong><em>ow to Live Life to your Full Potential </em></strong></p><p><em>This program will help you gain clarity, set up a plan, and </em><em>give practical tools for you to use daily to achieve your ideal life. </em></p><p>In 4 short modules, you will discover: </p><ul><li>How to take responsibility for your current life</li><li>How to develop a vision for your ideal life</li><li>How to set up a plan to make the changes </li><li>How to start living your ideal life </li><li>How to set goals and stick with them</li><li>and more</li></ul><p><em><strong>This course is delivered in sequential videos and there are lecture assignments to reinforce each lesson. </strong></em></p><p>If you want to know how to live your life to your full potential, then this course will help you know how and get started living to the fullest! </p><p><strong>Ready to take action steps to success? </strong></p><p><strong><em>Enroll Now!</em></strong></p>", 
    "end_date": null, 
    "title": "How to Live to Your Full Potential ", 
    "price": "20.00", 
    "instructors": "Tricia Dunn", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741486_eb2a.jpg", 
    "course_url": "https://www.udemy.com/how-to-live-to-your-full-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T21:12:21Z"
}