{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>You tried so many times and so hard to find the right partner and friends?</strong><br></p><p>When you feel unsure that you're attracting the right people in your life or you're single forever then it's time to try a healthy and a new approach to become more attractive.   </p><p>In <em>How To Attract Real Love and Friends For Life</em> you will learn how to stop and reflect. This course will remind you of who you are today, to learn to accept and love yourself and build that relationship first before jumping from one relationship to another. It will teach you to revalue the needs you can't and can compromise on. You will understand how to take control over your life and who you attract in to your life. This course focuses on the qualities and behaviours you need to review in order to become attractive to others. It'ss full of real-life examples since I'm a next door girl who makes things happen. I use practical tools that you can implement in your life. Each video is supported with a worksheet to help you with exercises.</p><p><strong>What does it mean to “have the real love\"?</strong><br></p><p>It's the feeling of certainty with no doubt.</p><p>It's the feeling of expansion where you are loved for exactly who you are and not trying to please.  </p><p>It's the clarity of where you and your partner are heading and it always seems easy.</p><p>It's the flowing communication and creativity of how to spend time together.<br></p><p>It's the healthy distance to be independent in what you do and the friends you spend time with without being needy and demanding.<br></p><p><strong>Are you ready to find the real love and friends for life?</strong><br></p><p>Take this course and discover the tools needed to cultivate true loving of yourself and attracting others.<br></p>What are the requirements?<ul><li>No prerequisite knowledge is needed but an open mind and desire to change is crucial.</li></ul>What am I going to get from this course?<ul><li>Reviewing yourself with fresh eyes.</li><li>Clarity on your emotional needs. </li><li>Enjoying time on your own working on becoming more attractive and not settling for less.</li><li>Straight to the point advice how to review the potential partner.</li><li>Achieve understanding about who you attract and why.</li><li>Transform your negative and toxic thinking and behaviour.</li><li>Discover how to detect toxic people.</li><li>Learn why giving brings receiving once you attract the right people.</li><li>Develop tools essential to your transformation.</li></ul><p><span></span></p><ul><li><strong>What is the target audience?</strong></li></ul><ul><li>People looking for healthier and more fulfilling relationship with themselves.</li><li>People looking for an emotionally healthy partner and friends.</li><li>People who are open minded, open to new spiritual approaches. </li><li>People who are fed up with settling for less and looking for new approaches.</li></ul>", 
    "end_date": null, 
    "title": "How to Attract Real Love and Friends For Life", 
    "price": "45.00", 
    "instructors": "Duda Jadrijevic", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698068_a638_4.jpg", 
    "course_url": "https://www.udemy.com/kickassmuse-how-to-attract-real-love-and-friends-for-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T11:20:10Z"
}