{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<span style=\"\">How often have you heard yourself responding with YES to things that were not good for you? Things that consumed your time and energy, and sabotaged your confidence? Have you found yourself experiencing uncomfortable situations, unhealthy relationships and carrying out tasks that you weren’t supposed to simply because you didn’t quite know how to say NO? Then join this course.</span>  </p>  <p style=\"\">  \tNo is without a doubt a powerful word that can both create and destroy. Often misunderstood in its authority, energy, and usage, it is a word we can and should use to protect ourselves and to stand up for the people and values in which we believe. We are taught that YES opens a lot of doors but the truth is YES can also close doors, the doors of growth and self-development and NO has the power to create just as many, if not even more opportunities than YES. That is the essence of this book – learning how to use No while maintaining healthy relationships and keeping your confidence high.  </p>  <p style=\"\">  \tHow to Say No is a course aimed at revealing how to shift your attention from insecurity and social-related doubts to serving your own heart and wellbeing with a simple word. OK, it’s not about a simple word, but more about a complex process made easy. And this process is all about transforming yourself into a confident, generous, empathic and guilt-free person who uses the power of a negation to affirm the reality he or she wants. Give yourself this opportunity. Join now and stop wasting time and creativity in doing things you don’t like with, or for, people who don’t have your best interests at heart.  </p>", 
    "end_date": null, 
    "title": "How to Say No - Say Yes to Yourself by Saying No to Others", 
    "price": "20.00", 
    "instructors": "Inspirational Courses", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/375442_d1c9_3.jpg", 
    "course_url": "https://www.udemy.com/howtosayno/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-22T07:51:31Z"
}