{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is about having conversations with women to get them interested, engaged, and hooked on you within minutes. Many times, guys find themselves &quot;working hard&quot; to keep a conversation going, all the while losing her interest and losing their chances of seeing her again. Get the tools necessary to:</p><ul style=\"\"><li>Start a conversation to get her immediately engaged</li><li><span></span>Get her contributing at least 50% to the conversation without burning yourself out</li><li><span></span>Have her laughing and excited to be HAVING the conversation with you</li><li><span></span>Keep a conversation going without running out of things to say</li><li><span></span>Get her number WITHOUT having to ask</li><li><span></span>Get her EXCITED to give you her number and wanna see you again</li></ul><p>Watch the tutorials on how to properly engage throughout the conversation, then download the exercises at the end to practice what you learned.</p><p>This course is designed to help you learn as you go. While you can go through the entire thing within hours, it&#039;s important to continuously go out and practice each step AS you learn it before moving onto the next lesson.</p><p>This is important to take because it enables you to HAVE a conversation with women to find out if they&#039;re right for you, as opposed to learning some &quot;tricks and techniques&quot; that force you to &quot;perform right.&quot;</p><p>A lot of other courses emphasize the need to &quot;do it right&quot; and leave you under the mercy of whether or not SHE thinks you&#039;re doing a good job. This course takes all the &quot;work&quot; out of conversations and gets her WANTING TO (and WORKING to) contribute just as much as you, without having to wait to see if you did well enough by HER standards.</p><p>This course puts YOU in the driver&#039;s seat and gives you full control of finding women you want..</p>", 
    "end_date": null, 
    "title": "How To Meet Women, Get Their Numbers, and Make Them Want You", 
    "price": "20.00", 
    "instructors": "Jessica J", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436950_5220_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-meet-women/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T21:26:38Z"
}