{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course we will learn how to treat, heal and remove the 10 most common Fears.</p><p>The Fears are:</p><p><strong>01. Fear of flying</strong></p><p><strong>02. Fear of public speaking</strong></p><p><strong>03. Fear of heights</strong></p><p><strong>04. Fear of the dark</strong></p><p><strong>05. Fear of intimacy</strong></p><p><strong>06. Fear of death</strong></p><p><strong>07. Fear of failure</strong></p><p><strong>08. Fear of rejection</strong></p><p><strong>09. Fear of spiders</strong></p><p><strong>10. Fear of commitment</strong></p><p><br></p><p><strong>1. FEAR OF FLYING</strong></p><p>Flying is statistically meant to be the safest form of traveling, and yet here's this fear rated at number #1.</p><p>I guess on those few times that planes crash and people die it makes the news, and thus these fears are further fuelled. I guess, too, that you feel more in control whilst driving your car, so fear of driving is much less common even though you are far more likely to die driving to the airport than on the flight itself. Apparently. But maybe fear of confined spaces is an issue here, as is fear of heights.</p><p>Do I suffer from this fear? Yes, but only mildly. I don't enjoy flying - it is the dullest, least comfortable form of travel, to me - but I just try to distract myself with conversation, a movie or some 'yummy' airline food! (Not all at the same time, obviously!)</p><p><strong>2. FEAR OF PUBLIC SPEAKING</strong></p><p>Now this fear is much more understandable to me. This must be one of most people's deepest fears - even those who are expert public speakers (like US President Barack Obama) get nervous beforehand, I'm sure.</p><p>This fear is all about everybody taking notice of you, and listening to what YOU have to say.</p><p>This is all about not fluffing your lines.</p><p>And... this is all about something that many people fear because they just don't do it often enough.</p><p>So even though this fear is common - perhaps our greatest fear? - I am confident that the rallying cry of feel the fear and do it anyway, together with learning how to speak in public, is enough to overcome fear of public speaking.</p><p><strong>3. FEAR OF HEIGHTS</strong></p><p>As I jokingly say on my most common fears page, my fear of heights is really my fear of jumping (or maybe it's my fear of landing)! But then I probably only suffer a mild form of acrophobia - I certainly don't suffer from any nasty physical symptoms. And, really, my fear of heights is the same fear as my fear of jumping in front of an oncoming train (or lorry)...</p><p>(Is this just me, or do you suffer from a similar fear? Let me know!)</p><p>Anyway, clearly fear of heights is very common and one of the top 10 fears.</p><p><strong>4. FEAR OF THE DARK</strong></p><p>This is a fear that stems from childhood, I think, but it may last well into adulthood. This is one of the most 'irrational' of the top 10 fears and needs to be faced up to, one way or another (especially if you are an adult).</p><p>And overcoming fear of darkness starts with trying to understand what this fear is really all about. That is, answering the question, \"What is it about the dark that frightens you?\"</p><p><strong>5. FEAR OF INTIMACY</strong></p><p>This top 10 fear is summed up, beautifully, by this expression: \"Into me, see\".And I guess some of us (not just men, either) don't like the idea of people seeing into them. I think other fears - fear of rejection, fear of commitment, fear of failure - come into play, too. It's a fear of change, also. And change can be scary for all of us, at times!</p><p>Like most fears, having fear of intimacy limits us as individual human beings!</p><p><strong>6. FEAR OF DEATH</strong></p><p>Thanotophobia affects many millions around the world. It's not just about the fear of death, but the fear of dead things, or anything death-related.</p><p>Overcoming this fear is about understanding that life is a cycle that includes death (they're two sides of the same coin); it's knowing that people will not forget you; it's about being open to having this fear in the first place (perhaps by talking to a professional or to a friend).</p><p><strong>7. FEAR OF FAILURE</strong></p><p>This is another understandable item in the list of most common fears. Even 'successful' people suffer from this fear, I'm sure. And I think it fuels many of the other top 10 fears.</p><p>Again, this is fear of change and fear of what other people will think of you (fear of rejection?). And, as with overcoming most common fears, it's all about facing the fear by taking action.</p><p><strong>8. FEAR OF REJECTION</strong></p><p>Okay, this is probably my own #1 fear, that of being rejected. And I'm a bit surprised by this, I have to say, as I'm not entirely sure what 'rejection' I'm afraid of. I think it's about wanting the acceptance and love of others and making sure that you don't do anything to jeopardise that.</p><p>Maybe. I actually don't know, so need to do more on this fear. How about you?</p><p><strong>9. FEAR OF SPIDERS</strong></p><p>This is a self-explanatory fear - thankfully, one that I no longer suffer from. I spent 2 years living in Malawi, Africa and saw enough huge creepy-crawlies to finally lose my fear of Daddy Longlegs and their ilk. (I also lost my 'sweet tooth', but that's another story.)</p><p>I hate to say it, but fear of spiders is pretty much an irrational fear. And exposing yourself to this fear is what's required. So let's start now, with this image, below (yes, those 2 spiders do look a bit creepy, I admit!)...</p><p><strong>10. FEAR OF COMMITMENT</strong></p><p>Another so-called male fear, fear of commitment affects us all, I believe, at different stages of our lives. I also think - as with the other top 10 fears listed above - that we can suffer this fear in one part of our lives, and not in another. Whilst some are less keen to commit to someone in a romantic relationship. There are others who are quite happy getting married (again and again, sometimes) but would never risk doing what they loved professionally instead of earning a regular and reliable income in a dull job that is slowly 'killing' them.</p>", 
    "end_date": null, 
    "title": "How to overcome fears", 
    "price": 0, 
    "instructors": "Gilad James", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659482_7a90.jpg", 
    "course_url": "https://www.udemy.com/how-to-overcome-your-fears/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T23:18:22Z"
}