{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Do you want to communicate better with your spouse, children or friends? Have you been accused of &quot;not listening&quot; by the important people in your life? Do you want an edge over the competition in business?  </p>  <p style=\"\">  \t      Then this course is for you.  </p>  <p style=\"\">  \t      When you learn to listen well, a whole new world can open up to you...a world of deeper understanding, richer relationships, real connection, trust &amp; respect, win-win solutions, deeper sharing, increased nuance, fewer misunderstandings &amp; arguments, fewer mistakes and less rework. In short, what I like to call: More love, more peace &amp; more money.  </p>  <p style=\"\">  \t      This course walks you through a step-by-step process. You&#039;ll become a better a better listener by:  </p>  <ul style=\"\">  \t<li style=\"\">Learning more about the benefits of real listening</li>  \t<li style=\"\">Understanding our default way of listening and how that can get in our way</li>  \t<li style=\"\">Introducing five new listening skills into your life</li>  \t<li style=\"\">Practicing these skills out in your world</li>  \t<li style=\"\">Answering specific questions about your experience in the included pdf workbook/journal</li>  \t<li style=\"\">Experiencing how enhanced listening can change your life</li>  </ul>  <p style=\"\">  \t      This course is for you if you are willing to try something new, courageous enough to show up differently in the world, open to learning new things and committed enough to complete the coursework.  </p>  <p style=\"\">  \t      Expect an engaged instructor, a mix of video styles, a jargon-free course taught in plain English, three quizzes to help anchor your learning, access to a follow-along workbook/journal, information, encouragement &amp; the potential for great transformation.  </p>  <p style=\"\">  \t      You will have the flexibility to complete the course at your own pace, though it is recommended that you move through it from start to finish, without long breaks. If you are simply seeking information about how to become a better listener, you can complete the course in about 2 hours. If you want to transform yourself as a listener, that will take a greater commitment. There are eight assignments and you may take as long as you need for each one; this could be hours, days or weeks. Your choice. For maximum benefit, consider taking a week to practice each skill. In that case, the course will take about six weeks to complete. Proceed at the speed of you.  </p>", 
    "end_date": null, 
    "title": "How to Listen ", 
    "price": "20.00", 
    "instructors": "Laura Dewey M.A.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249746_f16b_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-listen-for-a-richer-life-business/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T22:01:00Z"
}