{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Your Spirit Guides, Teachers and Angels are always there to help with your path of spiritual development.</p><p>This course offers a way to help you build a life long connection, and communicate with your guides. Your Spirit Guides can and should be your friends from now till eternity. </p><p>Learn what Spirit Guides are.</p><p>Become Open to Spirit's Guidance.</p><p>Learn how Spirit Guides Communicate.</p><p>Identify which guides are communicating with you and how they can help.</p><p>Understand tools you have for communication.</p><p>Build a foundation for a long lasting connection.</p><p>Build a Foundation for Spiritual Growth</p><p>Understand that you are never truly alone. Your Spirit Guides are your own personal spiritual helpers, and can aid you in your spiritual growth. You have guides that can aid you on your path to happiness, health, and wisdom. If you but open the door, spirit is there to guide you.</p><p>You do not have to be a fully developed psychic medium to connect with spirit, your guides are your personal helpers and there whenever you seek them.</p><p>In this course you will learn the basics of spirit guides and how they can help. We will go in depth about the types of guides and their roles, and how you can begin to build a connection with them. </p><p>Spirit Guides can communicate in many ways, and we will discuss the most common ones in detail. I will show you how you can use breathing and meditation to aid in spirit communication, and common tools used to reach your guides.</p><p>At the end of the course you will be empowered to build a long lasting connection with your guides, and use their Love and Light to aid your spiritual growth.</p><p>Spirit guides are incorporeal beings that are assigned to us before we are born that help nudge and guide us through life.  They’re responsible for helping us fulfill the spiritual contract we make with ourselves before we incarnate.  Your higher self helps select these guides, who help us while we are living out our incarnation.</p><p><strong>Who are these guides?</strong><br>Some guides will stay with you throughout your entire life, and others will pop in every now and again to help you with specific areas of your life or goals you are trying to achieve.  These guides are at varying levels of consciousness themselves.  Some may be highly ascended masters (such as Jesus) and others might be your average spirit who just happens to be a master in a certain area.  They may appear to have a male or female energy, though in reality they are just energy.  They may be spirits who have had physical incarnations, or they might be spirits who have never taken corporeal form.  You may be the only person they are guiding, or they may be on the “panel” for other people as well.  They might be deceased relatives, but that is less likely.  When it’s time for your spirit guides to help you, they tune in to your energy and help direct you to fulfill your earthly mission.</p><p><strong>How do guides help us?<br></strong>Spirit guides can see what’s going on in our lives, and when it’s time for them to actually guide and/or intervene they have several ways they can accomplish this. </p><p><strong>Sending signs</strong>.  Guides can arrange synchronicities to help alert you to something you need to see or know about.  Pay attention to those when they happen.  Recently the same scene from the movie, <em>The Incredibles</em>, was shown to me 3 times in 3 different ways in a 24 hour period.  I saw it at home while my kids were watching it, at Office Depot (it was playing as a demo on the tv), and someone else mentioned that particular scene to me in conversation.  That’s a sign, folks.  I got the message.</p><p><strong>Gut feelings</strong>.  Guides can poke you in the gut when you’re experiencing something they want you to pay attention to.  Following your gut feelings is probably a good idea.  Have you ever had this eerie feeling that something terrible was going to happen but you couldn’t quite put your finger on it?  That might be a guide poking you in your gut.</p><p><strong>Intuitive insight</strong>.  Guides can send you flashes of intuition which may sound like a voice in your head.  “Slow down!” and then you realize you were almost in a car accident.  Or “He’s cheating on you.”  These are thoughts that appear to come out of nowhere but which contain important information you’ll want to notice.  Many people tune out their intuition, but it’s a valuable source of information.</p><p><strong>Sending people into your life</strong>.  Your guides sometimes get together with other people’s guides and together they try to create a meeting between their charges.  Perhaps you are thinking about someone from college and whammo blammo see them in the bookstore later that day. Chance encounter?  Probably not.  Perhaps you were thinking about moving and you run into your old realtor friend in the supermarket.  If it feels like a coincidence, consider that it might be more of a set up. </p><p><strong>Arranging and nudging</strong>.  Guides can also nudge you in the direction they want you to go, or arrange for something to happen to you.  For example, perhaps you’re running late and can’t find your keys.  You’re frustrated because you need to get somewhere on time.  Suddenly, your phone rings and it’s a really important call you would have missed if you had found your keys earlier.  Who do you think actually misplaced your keys?  This is hard for them because you have free will.  They can only arrange so much or nudge so hard.  The more you can pick up on their clues, the better.  Sometimes you just need to surrender to a situation that seems frustrating.</p>", 
    "end_date": null, 
    "title": "How to contact your Spirit Guides and Angels", 
    "price": "20.00", 
    "instructors": "Gilad James", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681980_9601.jpg", 
    "course_url": "https://www.udemy.com/how-to-contact-your-spirit-guides/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T00:56:11Z"
}