{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Over 2500 students enrolled. (Course updated for June 2016)</strong></p>\n\n<p><strong><br></strong></p>\n\n<p>I used to feel completely confused with what I wanted for my life.</p>\n\n<p>I was lazy, unmotivated, lost and didn't know what career path to take. </p>\n\n<p>What's worse is that I already felt like I had wasted so many years of my life without feeling like I achieved anything. But I didn't know how I could stop this from continuing.</p>\n\n<p>I realised, this was because I didn't know <em>my Life Purpose. </em><br></p>\n\n<p><br></p>\n\n<p>Do you want to finally find your life purpose?</p>\n\n<p>- Live courageously?</p>\n\n<p>- Have complete certainty?</p>\n\n<p>- Have an unlimited supply of motivation?</p>\n\n<p><strong><br></strong></p>\n\n<p><em>The reason why you haven't found your life purpose yet, is because you haven't asked yourself the right questions. Simple!</em></p>\n\n<p><em><br></em></p>\n\n<p><strong>KNOWING your life purpose will help you feel satisfied again, fulfilled, and confident of your future.</strong></p>\n\n<p><strong>Yet 80% of people never seem to discover that life purpose. </strong></p>\n\n<ul><li><strong>80%</strong> never find their dream job</li><li><strong>80%</strong> never discover what makes them happy</li><li><strong>80% </strong>live out of fear of their future</li><li><strong>80% </strong>live with regret for not finding their purpose sooner, or even at all. </li></ul>\n\n<p><em>Unless you do find your purpose, you will be part of that 80%!</em><br></p>\n\n<p>But how <em>can you</em> find your purpose when so many others haven't?</p>\n\n<p><strong>I'm Justin light and I have been living the craziest purpose driven life since 2014. </strong></p>\n\n<p>In this <strong>comprehensive video course</strong>, I take you gently by the hand as<strong> I show you not only how to build your life purpose</strong>, but I also show you <strong>do it in 1 foundational course.</strong></p>\n\n<p>You <strong>do not need an expert counsellor or psychologist</strong> and you <strong>do not need expensive coaching sessions.</strong></p>\n\n<p><strong><em>Your life purpose is what makes you stand out amongst all the millions of other people who live an ordinary life instead of an extraordinary life.</em></strong></p>\n\n<p>If you uncover the life your heart truly wants, the seemingly huge problems in your life currently won't seem to matter anymore, <strong>you won't be worried about people judging, you will feel like you finally have meaning and you'll never want anything less, ever again. </strong></p>\n\n<p>But you've already been searching for years, yes?</p>\n\n<p>Use my experience, my knowledge from 3 years of serious purpose seeking, reflection and meditation. I wake up everyday so incredibly grateful for the life discovery I made because now I get to spend the rest of my dream ACTUALLY HAPPY.</p>\n\n<p>Follow my videos and exercises - and be as fulfilled, purpose driven, confident and as certain as me (even more so!).</p>\n\n<p>What's even better, however, is that finding your <strong>life</strong> <strong>purpose creates a snowball effect</strong> - your purpose will attract the life you've always wanted, <strong>you will start to meet people, find places and opportunities like-minded to your purpose</strong> thus reinforcing your purpose, and making your dream your life's reality,<strong> for ever more</strong>.</p>\n\n<p>I have actually caught myself (many times) saying:</p>\n\n<p>\"How has my life changed so quickly? I am so lucky...\"</p>\n\n<p><strong>++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n<p><strong>Your life is a bit like a GPS, you can travel correctly if you give it a location, but if you can't choose where you're travelling to, you will never reach that destination.</strong></p>\n\n<p><strong></strong></p>\n\n<p><strong>++++++++++++++++++++++++++++++++++++++++</strong></p>\n\n<ul><li>If you want <strong>a life of purpose</strong>, this course is for you.</li><li>If you want <strong>more courage, more passion and confidence</strong>, this course is for you.</li><li>If you want to finally <strong>start living</strong>, this course is for you.</li></ul>\n\n<p>It doesn't matter whether you're old, young, no previous coaching, rich, poor, family or single – you must find your life purpose before anything else happens... and I show you how to do this.</p>\n\n<p><strong><em>As with all of my training and future courses:</em></strong></p>\n\n<ul><li>you have <strong>unlimited lifetime access at no extra costs, ever</strong></li><li><strong>all future additional lectures, bonuses, etc in this course are always free</strong></li><li>there's an unconditional, never any questions asked<strong> 30 day money-back-in-full guarantee</strong></li><li><strong>my help is always available to you</strong> if you get stuck or have a question</li></ul>\n\n<p><br></p>\n\n<p>Take this course now, before anymore time is wasted searching for your life purpose. The sooner you take this course, the sooner your time can be spent on purpose.</p>", 
    "end_date": null, 
    "title": "How to Find my Life Purpose - Introductory Course", 
    "price": "35.00", 
    "instructors": "Justin Light", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/712858_6ef0_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-discover-your-dream-in-5-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-02T01:54:29Z"
}