{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course <strong style=\"\">Expert NLP Master, Trainer &amp; Coach Matt Barnett</strong> introduces you to the power of NLP Strategies so that you can refine your behavior using NLP and start improving your results in life and in business</p><p>. <em style=\"\">&quot;NLP Strategies is some of the &#039;big stuff&#039; in NLP, i had many a &#039;AHA!&#039; moment when I first discovered NLP Strategies,moments of ....&#039;AH! so THAT is why I do that, and he does THAT&#039; ! it&#039;s both very interesting and insightful, I BET you recognize yourself at some point in the course !&#039;  Matt Barnett </em></p><p><strong style=\"\">Why would you want to learn NLP Strategies?</strong></p><p>NLP Strategies describe the mental process we go through to produce any behavior. So by learning about NLP Strategies, you will be learning HOW you produce behavior, the process that runs in your own mind. </p><ul style=\"\"><li>Learn about the Motivation Strategy so that you can understand how you become motivated - so that you can always operate at your peak </li><li>Understand other people&#039;s Motivation Strategy, so that you can fire off their &#039;hot buttons&#039; and get them fired up and ready for real action </li><li>Discover &#039;The NLP  Decision Making Strategy&#039; - so you can understand how you and others choose to decide - So that you can influence decisions with other people.<em style=\"\">Imagine how useful that might be if you have a business </em></li><li>Investigate the concept of &#039;The NLP Convincer Types&#039; - So that you can maintain control over yours and others decisions -  do you know which type you are? </li><li>Understand the &#039;NLP Re-assurance strategy&#039; - So that you can maintain and reinforce new behavior and belief, remove doubt from others and leave them satisfied </li><li>Delve into the nested world of the complex yet easy to understand &#039;Buying strategy&#039; so that you can truly understand the process your customers go through when purchasing your products and services. </li><li>Understand the concept of Buyers remorse so that you can prevent it happening with your clients and customers in the future..</li><li>Apply the Buying strategy to other aspects of your life- so that you can have more success in Dating, relationships, work etc. </li><li>Investigate habits, and the processes in play when we carry out automatic behaviour  - so that you can &#039;slot in&#039; more useful components to the strategy and get better results. </li></ul><strong style=\"\">Matt Barnett is an Expert in NLP and Hypnosis and business and personal development. </strong><strong style=\"\">In this course you will </strong><ul style=\"\"><li>Gain insight into the world of NLP from an expert in the field and draw on Matt&#039;s experience of working with others to achieve great results</li><li>Get access to crisp and clear audio  - so that you can easily understand the concepts, apply them and get great results. </li><li>You will get access to high quality Video - so that you can see visual prompts to key points throughout the training. </li><li>You will benefit from Matt&#039;s relaxed and personal style of delivery - so that the learning of Strategies with NLP is a pleasant experience</li><li>You will gain access to scripts and PDF&#039;s to support you in your study - so that you can print them off and practice yourself</li></ul><strong style=\"\">The course is structured in an easy to follow ongoing &#039;flow&#039; </strong><ul style=\"\"><li>Learn NLP Strategies through the application of real world examples and scenarios - so that you can easily relate to the topics discussed .</li><li>Matt takes you step by step through the entire buying strategy with a fictional purchase so that you can visualize and understand the process. </li></ul><strong style=\"\">You will have direct access to Matt Barnett Personally through the in course messaging system so you can ask any questions, start discussion and interact with your fellow students and Matt Barnett himself. </strong>*This course is 100% guaranteed and backed by the Udemy no nonsense money back Guarantee. If for ANY reason at all you do not believe you have had value, you will be refunded with no fuss.", 
    "end_date": null, 
    "title": "How to 're program'your mind and install positive behaviour ", 
    "price": "20.00", 
    "instructors": "Matthew Barnett", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367600_89ff.jpg", 
    "course_url": "https://www.udemy.com/nlp-strategies/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T20:48:08Z"
}