{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Over 1,000 students enrolled in this course and 11 - 5 star reviews! Find out why!</strong></p>\n\n<p>  \t          Just give me 1 simple hour and I'll show you how to tap into the powers of your subconscious mind to conquer your fears and solve your most perplexing problems.  </p>\n\n<p>  \t          Now, in the privacy of your own home, you will learn what's hidden deep within your subconscious mind; secrets that even you are not aware of.  </p>\n\n<p>  \t          Imagine waking up in the morning and immediately knowing what your mind is telling you to start your day and improve your life.  </p>\n\n<p>  \t          Great people all throughout history have used their dreams to guide them to success. Now you will learn the exact same techniques to build success in your life.  </p>\n\n<p>  \t          Since dream symbols mean different things to different people, you can't rely on simple dream interpretation web sites or dictionaries to tell you what your dreams mean.  You are different from every other person out there. Your dreams reflect your emotions, your experiences and your background.  </p>\n\n<p>  \t          Once you fully understand your dreams you will have the power to conquer your fears, control your emotions and learn the easy ways to really make a success of your life.  </p>\n\n<p>  \t          In my “<strong>How to Use Dream Interpretation for Expanded Awareness\" </strong>Course I will show you how to understand what your mind is telling you using The Universal Language of Dreams. Once you learn this simple language, you really will be able to change your life.  </p>\n\n<p>  \t          This course will teach you…  </p>\n\n<ul>  \t<li>How to gain greater knowledge</li>  \t<li>The Universal Language of Dreams</li>  \t<li>The foolproof way to trust your intuition</li>  \t<li>The secret to building more confidence</li>  \t<li>A little known way to delete fear from your life</li>  \t<li>The easy way to fix your biggest problems</li>  \t<li>How to find out where your dreams are leading you</li>  \t<li>How dreams can help you make productive choices</li>  \t<li>The only 3 types of dreams you need to worry about</li>  \t<li>How to learn the answers to your toughest questions</li>  \t<li>How to tap into powers that can make you successful</li>  \t<li>The 2 Rules you must learn to interpret your dreams correctly</li>  \t<li>The simple way to change your thought patterns for a better life</li>  \t<li>Why a bloody dream is not a nightmare, but a clue to improving yourself</li>  \t<li>What common dream symbols mean and how they can literally change your life…</li>  </ul>\n\n<p>  \t          …And so much more.  </p>\n\n<p>  \t          It's easy… takes less than an hour…  and it comes with a 30-Day Money Back Guarantee.  </p>\n\n<p>  \t          So go ahead… you have nothing to lose. Click that “<strong>Take This Course</strong>\" button now and watch the miraculous changes in your life.  </p>", 
    "end_date": null, 
    "title": "How to Use Dream Interpretation for Expanded Awareness", 
    "price": "20.00", 
    "instructors": "Dave Lappin", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/80378_1ba6_7.jpg", 
    "course_url": "https://www.udemy.com/dream-interpretation-made-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-18T18:26:25Z"
}