{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Would you like to be the one who gets the upper-hand on a narcissist/manipulator?</strong><strong></strong><br></p><p><strong>This course has a 4.9/5 Star rating with 30 Reviews and over 1250 students!</strong></p><p><strong>Students who take this course complete 45% more lectures than students in similar Personal Transformation Courses offered on Udemy. </strong>(This is an Engagement metric only shown to instructors.)</p><ul><li>Tired of being told it is always your fault, you don't do anything right?</li><li>Tired of trying to explain your side and being told you are crazy, you don't remember right, you're just over reacting, you can't take a joke?</li><li>Do you wish you knew the techniques to prove that <em><strong>THEY ARE THE PROBLEM</strong></em>, not you?</li><li>This course is designed to teach you how to do just that.</li></ul><p><strong><em><br>\"This Course is a Gold nugget !! I wish all people in the world can learn this information, because then there will be much more honesty and accountability for what we say.\"  </em>Carl Pohl</strong><strong></strong><br></p><p>It doesn't matter who you are, ANYBODY can learn these techniques and get results instantly. Here is what one student said:<br><strong><em>\"Good info, great examples, immediately usable.\"</em> Abbey Julia</strong><strong></strong><br></p><p>Three sections of this course are designed to prepare someone who is being manipulated and is possibly not in a confident state. They may feel it is their fault and that needs to change. Sections 2, 4 and 8 will cover that particular situation. If this is not you, those sections still may be a good refresher.</p>Section 3 is necessary in order to use the actual techniques, which are described (and written) in:<ul><li><strong>Section 5 - Level 1: Direct Techniques<br></strong></li><li><strong>Section 6 - Level 2: Assertive Techniques<br></strong></li><li><strong>Section 7 - Level 3: Power Ending Speaking Technique</strong><strong></strong></li></ul><p><strong><br>UPDATE February 19, 2016<br></strong>Added: Homework exercise in Section 2 - Lecture 8.</p><p><strong><em>\"Essential, no Time wasting, Very Understandable, Concrete. Thanks a lot!\"</em> Full Pori</strong><strong></strong></p><p>If you ever walked away from an interaction with a manipulator feeling upset, misunderstood, or taken advantage of, then I highly recommend you take this course.</p><p><strong><em>If you start this course now you can begin to stop the manipulation today. It works that quick!</em></strong></p><ul><li>This course has a 30 Day Money Back Guarantee - Full Refund - No Questions Asked!</li><li>Once you enroll, you have unlimited lifetime access!</li><li>You will have instant and free access to all future updates.</li><li>I am here to help. I offer my full support to whatever questions or needs you may have. This can be a highly charged and emotional subject. I know, I have been there and I will be here for you if you want my help.</li><li>You can check out a few lectures for free before you make a financial commitment. Lectures:  2, 4, 15, 16, 22, 26, &amp; 30.</li></ul>", 
    "end_date": null, 
    "title": "How To Stop Manipulators And Narcissists", 
    "price": "20.00", 
    "instructors": "Joe Fedison", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/717046_2966_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-stop-manipulators-and-narcissists/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T13:38:58Z"
}