{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><b>What does Lack of Focus mean? </b></p><p>When you lack focus, life can be much more difficult than it should be. You may realize that without knowing how to focus on something, you won't even be able to remember it. If you forget the important things, if it's hard for you to concentrate, it will be even more difficult to be productive, responsible, or even make good decisions. Not knowing how to focus can quickly make your life get out of control. You may miss meetings, fail in an exam, or get fired from a good job. Of course, no one wants something like that. </p><p>Now you see <em>why knowing how to focus is so important</em>. There are many reasons why you might lose concentration. It may be due to poor sleeping habits or bad eating habits. It may be a limited ability to prioritize what is important. You may not have examined your life close enough to investigate what is really important to you and why it is worth focusing on. Another issue is that you may try to do too much in too little time. (we talk about that in the Section 7: Multi-Tasking)</p><p>You cannot force yourself to concentrate on everything at once. There are countless reasons why you might lose your concentration, more than I can mention in this space. Really, what is important is that whatever your reason is, you can work on it and improve your focus. </p><p>I think most people don't know how to be focused, and I mean, how to be <strong>laser focused</strong>, because they have not yet learned the necessary habits to develop this skill. If you cannot concentrate, it's not because you have a problem. Concentration is something that you can work and improve if you know how. You may be surprised at all the progress you can make when you learn to improve your ability to focus..</p>", 
    "end_date": null, 
    "title": "How to Focus, Concentrate, and Live a Conscious Life", 
    "price": "20.00", 
    "instructors": "Alex Marquez", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/569730_0565_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-focus-concentrate-and-live-a-conscious-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-30T23:53:34Z"
}