{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This class is based on an article by Dr. Carol Morgan that was<strong style=\"\"> shared on social media 87,000 times</strong>. Join the crowd and take control of your life! The course is for ANYONE who wants to be <strong style=\"\">HAPP</strong><strong style=\"\">Y</strong> - which is pretty much everyone! </p><p>We live in such a negative world that it&#039;s not surprising that we all get toxic thoughts programmed into our minds on a daily basis - for our whole lives. When you take this course, <strong style=\"\">you will learn how to take control of your thoughts and to re-direct them into positive ones</strong></p><p>The structure of the class includes <strong style=\"\">video lectures</strong>, followed by <strong style=\"\">worksheets</strong> that help you apply the material in your own life. You will do some self-analysis and probably discover things about yourself that you never even knew! This is essential to the process of changing your thinking - and your life!The last lecture is an audio meditation that is designed to<strong style=\"\"> re-program your mind with positive thoughts</strong>. If you listen to it on a regular basis, <strong style=\"\">your thought processes will naturally change for the better with very little effort</strong>. The more you listen, the happier you will become. For best results, wear earphones while listening.<strong style=\"\">87,000 people thought this information was important enough to share with their family and friends</strong>, and now YOU have a chance to dive even deeper. If they can take the steps to get happy ... <strong style=\"\">why not YOU?</strong>Are you READY? <strong style=\"\">LET&#039;S GO!!!</strong></p>", 
    "end_date": null, 
    "title": "How To Remove Toxic Thoughts That Are Sabotaging Your Life", 
    "price": "20.00", 
    "instructors": "Carol Morgan", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/453070_ecdf_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-remove-toxic-thoughts-that-are-sabotaging-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T13:22:29Z"
}