{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What is the course about?</strong></p><p>This course teaches you how to do a Shamanic Journey to find and bring back your Power Animal, and also how to connect with your Spirit Guides, and how to get answers to questions.</p>A shamanic journey is similar to a meditation, but done in a very different way.<p>Maybe you tried to do this already through a meditation, but it didn’t really work out for you, because doing a meditation is not your thing. </p><p>A Shamanic Journey is a spiritual practice, and it is a way of exploring the spiritual realms, and making contact with spirits, spirit animals, power animals, lost souls, angels, ancestors, elders, or departed shamans. It is a way of finding out more about yourself, or finding information, healing, wisdom, knowledge, and guidance with one’s personal life.</p><p><strong>How long will the course take to complete</strong></p><p>To learn Shamanic Journeying is not complicated, and I will teach you in a way, that you can start journeying almost immediately.</p><p><strong>What kind of materials are included?</strong></p><p>I provide guided meditation, and drumming music to download, as well as course manuals.</p><p><strong>How is the course structured?</strong></p><p>The course is very easy to follow, without complicated instructions. My motto is: Keep it simple, but learn and experience a lot!</p><p>And also be excited about the Bonus part!</p><p><strong>Why take this course?</strong></p><p>If you want to make contact with your spirit guides, spirit animals, power animals, angles, ancestors, elders, or departed shamans, and if you want to find out more about yourself, or finding answers to questions, than a shamanic journey will be very helpful.</p><p>Through this journey we focus on how to find your Power Animal, and bring it back into your life, so that you will experience more energy and Inner Peace. </p><p>In the Bonus part you will also learn how to connect with your Spirit Guides, and so much more.</p><p><strong>Prerequisites</strong></p><p>It would be good, but not necessary, to have some experience with meditations, or energy work. Important is to be open minded.</p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "How To Do A Shamanic Journey - A Way To  Inner  Wholeness", 
    "price": "25.00", 
    "instructors": "Daniela Hills", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/684144_04d1_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-a-shamanic-journey-a-way-to-inner-wholeness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T16:21:58Z"
}