{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a basic introduction to hypnosis, and an overview of some basic concepts. This is a standalone course designed to give you a fundamental understanding of this powerful and natural state of mind, and it also serves as an Introductory course for my other Hypnosis courses.</p><p>Through 7 video lectures, you will:</p><ul style=\"\"><li>Learn what hypnosis is, and what it isn&#039;t</li><li>Find out how hypnosis can improve your life</li><li>Discover whether you are a good candidate for hypnosis</li><li>De-bunk some common myths about hypnosis</li><li>Explore where, when, and how to use hypnosis processes</li></ul><p>By the end of this course, you will have the opportunity to experience hypnosis for yourself, and improve some different areas of your life.  I have included three different hypnosis processes intended to appeal to a wide range of students. You can listen to these processes as often as you like.</p><ul style=\"\"><li>If you have trouble getting to sleep, or staying asleep, the Deep Sleep process will help you sleep as easily and naturally as you did as a child </li><li>Weight Loss Basics will program your subconscious mind so it&#039;s easier to do all the things you already know consciously that you should do</li><li>The Stress Buster process will relax your body and your mind, allowing you to unwind and let go of stress and worry</li></ul>", 
    "end_date": null, 
    "title": "Hypnosis 101: Exploring the truths and misconceptions", 
    "price": "30.00", 
    "instructors": "Tani Barr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/474012_41f7_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-101/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-12T08:09:47Z"
}