{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em></em>In this course titled '<strong>Hypnotic Magic Question To Get What You Want In Life Quickly</strong>' By Pradeep Aggarwal , you will learn -</p><p>You must have heard a saying, ‘the quality of your life depends on the quality of questions you ask.’ This is absolutely correct. You should ask ‘’yourself’’ right questions to attract right opportunities in life. Most of the time, people attract wrong people in their life or select a wrong career path because they ask the wrong questions to themselves.</p><p><strong></strong></p><p>This course is designed to help you to get what you want in your life quickly in less time. This is an amazing course, which will tell you how you can change/improve your life by simply changing the questions.</p><p>By the end of the course, you will learn how to structure hypnotic magic questions. You can create questions for any area of your life viz., health, relationship, money, spirituality etc.<br></p><p>This course is ideal for people who are into sales and require to meet potential clients and customers for business growth and development.<br></p><p>You will also be able to trigger your confidence level and relax during times of need by following the exercises in this course.</p><p>This course contains a lot of NLP and psychic exercises and more than 35 minutes of live video content designed over 12 lectures in English.</p>", 
    "end_date": null, 
    "title": "Hypnotic Magic Question To Get What You Want In Life Quickly", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644506_5d2a.jpg", 
    "course_url": "https://www.udemy.com/hypnotic-magic-question-to-get-what-you-want-in-life-quickly/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T08:09:44Z"
}