{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis - Increase Your Sexual Desire Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn that-</p><p>Sex as we all know is a part of our life. Many times it happen people fail to enjoy their sexual life, which may affect their married life a lot. Lots of couples fight over this issue, which creates lot of problems in their relationship.<br></p><p>Apart from some physical and hormonal reasons, there may be some psychological reasons behind the decrease in men's and women's sexual desire.</p><ul><li>Lack of confidence</li> <li>Consciousness (for example if she or he has gained weight, they may become conscious whether they will look good or not without clothes)</li> <li>Shyness or hesitation</li> <li>Guilt or shame</li> <li>Frustration</li> <li>Anger</li> <li>Stress/ Anxiety</li></ul><p><strong>Partner's Mistakes: </strong></p><ul><li>No co-operation in trying to explore new things</li> <li>putting him or her down either by words or actions</li> <li>Partner's frustration or stress</li> <li>Partner's rejection</li></ul><div>This course if for everyone who are facing problems in their sex life due to the above reasons and want to overcome it using powerful self hypnosis techniques and positive affirmations.</div><div>By the end of the course you will be able to overcome all these problems and enjoy a healthy sex life and a happy married life.</div><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English.</p>", 
    "end_date": null, 
    "title": "Hypnosis - Increase Your Sexual Desire Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "36 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/598092_2956.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-increase-your-sexual-desire-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-31T10:25:30Z"
}