{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis - Boost Your Energy Levels Now Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn -</p><ul><li>Why You Need To Boost Your Energy?</li><li>1)     \nDo you sometimes need a quick,\nreliable injection of extra energy?<b></b>\n\n2)     \nWould you prefer a natural energy\nbooster to get you going when you need it?\n\n<b></b>\n\n<b>2.     \n</b><b>How Self Hypnosis Can Help?</b><b></b>\n\n1)     \n<b>One thing\nthat hypnosis can do is improve the connection between your mind and body. Your\nmind and your body are always connected to each other — the stronger the\nconnection, the better it is for your physical and mental wellness. </b>\n\n2)     \n<b>Syncing\nboth mind and body together can result\nto an increase in your energy levels. Because the mind is the fuel that powers\nyou as a physical machine, a healthy mind will also mean that you have more\nenergy to do the things that you want.</b>\n\n3)     \nSelf\nhypnosis helps change your old and limiting beliefs and thoughts<b></b>\n\n4)     \nSelf\nhypnosis brings more mental alertness<b></b>\n\n5)     \nSelf\nHypnosis helps you a great wave of relaxation refreshing your whole body<b></b>\n\n6)     \nSelf\nhypnosis helps to connect with the deep sources of power and energy within you<b></b>\n\n7)     \nSelf\nhypnosis helps maintain positive attitude <b></b>\n\n8)     \nSelf\nhypnosis treats stress, anxiety, nervousness and depression successfully<b></b><strong></strong></li></ul><p>This course is for those who want to increase their energy levels and become more confident in their life and energetic during important situations in their personal and professional life.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English including bonus.</p><p>This course contains-</p><p>Lecture 1: Introduction</p><p>Lecture 2: Remove Myths About Self Hypnosis</p><p>Lecture 3: Conscious Mind Vs Subconscious Mind</p><p>Lecture 4: How To Enter Into The State Of Self Hypnosis</p><p>Lecture 5: How To Master Self Hypnosis To Reprogram Your Subconscious Mind</p><p>Lecture 6: Guided Visualization Exercise: To Boost Your Energy</p><p>Lecture 7: Summary</p><p>Lecture 8: Bonus Exercise - Affirmations For Depression, Stress, Insomnia And Negativity</p>", 
    "end_date": null, 
    "title": "Hypnosis - Boost Your Energy Levels Now Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/579820_c8f0.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-boost-your-energy-levels-now-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-11T05:46:17Z"
}