{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis- Overcome Drug Addiction Using Self Hypnosis</strong>' By Pradeep Aggarwal , you will learn that-</p><p>The most common definition of drug addiction is the inability to stop using the drug in spite of numerous attempts.<br></p><p>Drug addiction means repeated use of drugs in increasing quantity with the appearance of withdrawal symptoms when drug use ceases. Psychological factors play an important role in drug addiction. In this course, you will learn how to overcome drug addiction easily and safely using self hypnosis.</p><p><strong>Psychological Reasons for Drug Addiction: <br> </strong></p><ul><li>Stress or anxiety</li><li>Moral weakness</li><li>Self punishment or Guilt</li><li>Mood disorders like depression, anxiety, or bipolar disorder</li><li>Thought disorders like schizophrenia</li><li>Personality disorders like antisocial personality disorder</li><li>Inability to connect with others, lack of friends</li><li>Poor performance at work or school</li></ul><p><strong></strong></p><p><strong>Psychological Effects of Drug Addiction</strong> <strong></strong></p><p><strong></strong></p><ul><li><strong>Get Addicted:</strong> User is addicted to drugs, as well as the changes that take place in the brain once a person becomes a drug addict.</li><li><strong>Become a Need in Times of Stressful situations:</strong> Initially, many people start using drugs to cope with stress or pain. So anytime they face stress or anxiety, they again feel the need for drugs.</li><li><strong>\"Craving\" of the drug:</strong> anytime the user encounters stress or pain, they feel the need to use the drug. </li><li>Wild mood swings, depression, anxiety, paranoia, violence</li><li>Decrease in pleasure in everyday life</li><li>Complication of mental illness</li><li>Hallucinations</li><li>Confusion</li><li>Psychological tolerance to the drug's effects creating a desire to do ever-increasing amounts of the drug</li><li>Desire to engage in risky behavior</li></ul><p>You will also learn more about your conscious and sub conscious mind and the myths and perceptions surrounding self hypnosis.<br></p><p>By the end of the course you will be able to overcome drug addiction and lead a healthy and happy life.</p><p>This course is ideal for everyone who want to get over drug addiction and lead a happy life without depression , anxiety , fear and mental illness.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 8 lectures in English and a bonus e-book on positive affirmations.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Overcome Drug Addiction Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/634600_4d05_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-overcome-drug-addiction-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-08T09:00:44Z"
}