{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>Hypnosis- Get Rid Of Your Fear Using Self Hypnosis.'</strong>Pradeep Aggarwal , you will learn -</p><p><span></span>Fear can anything like – fear of\nheights, fear of flying, fear of driving, fear of opposite sex, fear of\nfailure, fear of success, fear or examination, fear of interviews etc. Sometimes\nfear is a natural phenomena, or a sign of warning but being fearful always is\nnot a good thing. Fear stops you from taking up new challenges in life. Fear\nbecomes a block on your pathway to success. Don't let your stop you from\nbecoming successful in life.</p><p><span></span>The most common reasons for fear are wrong programming in your mind\nand fearful memory of a past event.</p><p><span></span>Using self hypnosis and visualizations you can overcome any fear or phobia in your mind which is causing you problems to achieve success and your goals by changing the negative and wrong programming in your mind.</p><p>This course is ideal for people who are into sports and have multiple fears of losing , success , anxiety and negativeness and want to overcome it and become more successful in their life.</p><p>It is also very helpful for people who want to get over depression , anxiety , insomnia , negativity and stress.</p><p>This course contains a lot of exercises and more than 30 minutes of live video content designed over 7 lectures in English and bonus material.</p>", 
    "end_date": null, 
    "title": "Hypnosis- Get Rid Of Your Fear Using Self Hypnosis", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585032_c36e.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-get-rid-of-your-fear-using-self-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T04:19:54Z"
}