{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you ready to transform your life for the better? Discover the tried and tested success principles that will put you in the box seat to achieving the success you crave.</p><p>Learn how to set expectations and how you can handle the experiences from the past, present and future.</p><p>Discover who you need to please first before achieving any level of success. You will be shown how to replace your vocabulary (and why it needs to be replaced!)</p><p>Discover simple strategies to avoid making excuses and finally take control of your life - your family will thank you for it.</p><p>We are all not perfect - learn how to harness those imperfections to transform your life.</p><p>Find out where to search for motivation and inspiration - we are sometimes surrounded with lots of negative influences that can completely suck the success out of our lives. You will learn to appreciate the simple things in life, and how these become the building blocks for your ultimate success.</p><p>You will also learn how exercise is such an important step to having the success Impact on your life. </p><p>This course comes with a 30 day money back guarantee so enroll in this course today. </p>", 
    "end_date": null, 
    "title": "Impact: Long Lost Success Principles That Transform Lives", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/653252_4278_2.jpg", 
    "course_url": "https://www.udemy.com/success-principles/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-28T09:45:48Z"
}