{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em style=\"\">Course updated Jan 2015: **NEW** Skype Support Package 121 with Instructor now included for all students for first 3 months!</em>  </p>  <p>  \t<strong style=\"\">Did you know that a simple Acupuncture technique exists that helps men overcome Impotence (ED), premature ejaculation (PE) and the addiction to internet porn?</strong>  </p>  <p>  \t            We&#039;ve all heard the expression that it could be all in the mind so what if it was?  </p>  <p>  \t            This is David Childerley and I want to help all men overcome sexual issues by teaching them a simple EFT Tapping technique that quickly releases the mental root causes.  </p>  <p>  \t            Over the last decade I have coached thousands of Men from all over the World one on one over Skype to help them get their sex life back on track and now you can benefit from my experience.  </p>  <p>  \t          In many cases that I have personally worked on over the last 10 years, sexual issues are created in the mind. Psychology research has shown that many sexual related issues stem from the mind and effect the physical body.  </p>  <p>  \t                        In this easy to use video course you&#039;ll learn how to apply the EFT Tapping technique so that you can create the amazing sex life you deserve.  </p>  <p>  \t<strong style=\"\">    Also included in this course:  </strong>  </p>  <ul style=\"\">  \t<li>  \t<p>  \t\t<strong style=\"\">**NEW** Skype Support Package with Instructor now included for all students for first 3 months</strong>  \t</p>  \t</li>  \t<li>How to overcome PE or premature ejaculation using EFT Tapping</li>  \t<li>How to overcome the addiction to internet porn using EFT Tapping</li>  </ul>  <p>  \t      Overcome all your sexual issues by changing your limiting beliefs about yourself.  </p>  <p>  \t      Change is easy when you have the tools and the support along the way.  </p>  <p>  \t      I will personally support all students taking this course as I believe that enjoying a normal sex life is a human right and I encourage all men to support each other by sharing the available knowledge.  </p>  <p>  \t<strong style=\"\">Enrol now and release your sexual frustrations, you&#039;ll be glad you did!</strong>  </p>", 
    "end_date": null, 
    "title": "Impotence & Premature Ejaculation: Release Root Causes Fast", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320376_32f7_4.jpg", 
    "course_url": "https://www.udemy.com/overcome-impotence-erectile-dysfunction-using-eft-tapping/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T18:57:02Z"
}