{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                  COURSE UPDATED: October 13, 2015 - New bonus material added. Entire course updated to comply with new Udemy standards.</p>  <p>  \t              With a full calendar and hardly a minute to spare many of us are in danger of being overwhelmed by the amount of work we have taken on - both at work and at home. We all know that the quickest way to create some space and take a breath is to just say “no”. From William Ury’s best seller “The Power of a Positive No” to the advice of well meaning friends we are told that we shouldn’t be afraid to say no. But many people are.  </p>  <p>  \t                  Saying no isn’t easy. Done the wrong way it can cause damage to the most important of relationships.  </p>  <p>  \t                  Dealing with our emotional response to thought of saying no is one thing, dealing with how other people react to being told no is a completely different thing all together. We want to be seen as being more than just competent. We want to earn the trust of our friends and colleagues and we need to get the work done. So we say yes with the consequences that the important but not urgent works slips further behind, we rush to produce work of a quality below what we are capable of and we fear we will burn out if this continues much longer.  </p>  <p>  \t                  In this course we will be getting to the heart of why we often struggle to say no and what action you can take to make it easier to say no while improving relationships and building trust. You will be introduced a new set of interpersonal skills that will help you to:  </p>  <ul>  \t<p>  \t\t                  ·diagnose why the right things are not being done at the right time to the right standard  \t</p>  \t<p>  \t\t                  ·understand and identify your emotional reactions to saying no (and to being told no)  \t</p>  \t<p>  \t\t                  ·respond in a way that increases trust in business and personal relationships, allows you to focus on what is important and deliver value  \t</p>  </ul>  <p>  \t                  It doesn’t matter how busy you are it is the one course you should say, “yes!” to.  </p>", 
    "end_date": null, 
    "title": "Improve relationships and increase trust by just saying no! ", 
    "price": "40.00", 
    "instructors": "Paul Marshall", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355784_b885_5.jpg", 
    "course_url": "https://www.udemy.com/saying-no-just-isnt-easy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-25T01:14:26Z"
}