{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Every\n person can, at any moment, call upon not only one Archangel but seven \nspecific Archangels to bring blessings and protection… you just need to \nlearn how to ask. In this Online course, Sunny Dawn Johnston will show \nyou how to call out to each individual Archangel, to know them by name, \nand to develop your own special relationship with each and every one of \nthem. Sunny will detail the personalities, gifts, and traits of each of \nthe seven Archangels, and help you form a clear picture of the abundant \nenergy, vibration, and unconditional love that each of the Archangels \nhave for us.</p><p><strong>TOPICS COVERED</strong></p><ul><li>Learn how to discern the difference between Angels, Archangels, Deceased Loved Ones, Spirit Guides and Ascended Masters</li><li>Develop a personal relationship with the Archangels</li><li>Trust the guidance that you are receiving</li><li>Transform your life from physical to spiritual</li><li>Realize who you truly are at your deepest level</li><li>Connect with the energy of Healing, Beauty, Protection, Love, Forgiveness, Communication, and Vision</li><li>Develop your intuitive gifts</li><li>Understand the messages the Angels are sharing with you</li></ul><p><strong>In these 8 weeks you will receive an opportunity to…</strong></p><ul><li>See, hear, feel and know that the Archangels are with you always and in all ways</li><li>Experience the unconditional love the Archangels have for you</li><li>Listen to several guided meditations to support your ever growing Angelic relationship</li><li>Experience the Archangels through music and lyrics that literally “bring in” the energy of the Archangels</li><li>Know the who, what, where, when and why’s of the Archangels</li><li>Have your own personal experience with each one of the Archangels… \nso that there is no doubt that not only do they exist, but that they are\n with you, each and every day</li></ul><p><strong>CHANGES YOU CAN INTEGRATE INTO YOUR LIFE AFTER TAKING THIS COURSE:</strong></p><ul><li>  Increased awareness of the Divine Angelic “synchronicities” occurring in your life and how to interpret them</li><li>Improved presence of mind to ask for and be open to assistance and guidance in all forms, physical and non-physical</li><li>A calm peaceful centering that comes from knowing “I am not alone”</li><li>A deepening awareness and passion to live life to the fullest</li></ul><p><strong>***This course was designed so you could work with an angel a week for eight weeks, but you are welcome to work at your own pace.</strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Invoking the Archangels", 
    "price": "20.00", 
    "instructors": "Sunny Dawn Johnston", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/674852_0fab.jpg", 
    "course_url": "https://www.udemy.com/invoking-the-archangels/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T19:34:56Z"
}