{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis 2.5 hour course allows you to get the most from coaching. So if you are being coached in business, sport or life then this is for you. It is based on the book <strong style=\"\"><em style=\"\">It&#039;s Not About The Coach</em></strong> that I published in 2013. It is highly practical as the course relies on presentations, interviews, readings from the book and lectures that focus on the case for coachability. You can of course accompany your learning by reading the book also. This is a 6 part advanced course that builds on the 3 part introduction course. Here is more about the content itself…  </p>  <p>  \tTen years ago I was struggling to ascertain whether coaching was right for me, despite the fact that my organisation had paid for and arranged a world-class coach. Greater authentic impact was certainly one of my key goals but I was struggling to take to the challenge of coaching – the probing, questions and observation in particular. After some visible resistance I slowly found my feet as a coachee.  </p>  <p>  \tI begin speaking to colleagues; slowly these conversations turned into a research project and eventually a book (<strong style=\"\"><em style=\"\">It</em></strong><strong style=\"\"><em style=\"\">&#039;</em></strong><strong style=\"\"><em style=\"\">s </em></strong><strong style=\"\"><em style=\"\">Not About The Coach</em></strong>) that I published in 2013.  </p>  <p>  \tI began to realize that coaching is a space between two or more people, coach and coachee. Typically coming together to discuss performance and how it might develop. However, to date just about all of our research and literature has focused on the coach. <strong style=\"\">Why aren&#039;t there any resources for the other half of the coaching relationship?</strong> Everyone else thinks it is about the coach; training, qualifications and accreditation etc are readily available. Yet we often neglect the hero of the story - the coachee.  </p>  <p>  \tA <strong style=\"\">new world</strong> where coachees are at the centre of the relationship. Inspiring them to…  </p>  <li style=\"\">Make informed choices about coaching</li>  <li style=\"\">Discover readiness for coaching</li>  <li style=\"\">Develop the values required by coachees</li>", 
    "end_date": null, 
    "title": "It's Not About The Coach - 6 part advanced programme", 
    "price": "20.00", 
    "instructors": "Stuart Haden", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343184_0c3a_2.jpg", 
    "course_url": "https://www.udemy.com/its-not-about-the-coach-6-part-advanced-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T20:18:36Z"
}