{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tThis course allows you to get the most from coaching. So if you are being coached in business, sport or life then this is for you. It is based on the book <strong style=\"\"><em style=\"\">It’s Not About The Coach</em></strong> that I published in 2013. It is highly practical as the course relies on presentations, interviews, readings from the book and lectures that focus on the case for coachability. You can of course accompany your learning by reading the book also. This is a 3 part introduction course with a 6 part advanced course to follow if you need it. Here is more about the content itself…  </p>  <p style=\"\">  \t  Many of us are lucky enough to work with great coaches, who are keen to support and challenge us in many aspects of work and life. <strong style=\"\">But, do we really make the most of these relationships? </strong><strong style=\"\"></strong>  </p>  <p style=\"\">  \t  Let’s deconstruct the well known saying - <strong style=\"\">‘when the coachee is ready, the coach will appear.’</strong>That&#039;s just it, so many of us are not ready for coaching despite having experienced individuals to hand.  </p>  <p style=\"\">  \t  My latest research has showed that <strong style=\"\">people only possess 40% of the skills required</strong> to be an effective coachee. So unless you can evaluate whether coaching is the right option for you, you might be wasting everyone’s time. This course will help you answer the following two questions…  </p>  <li style=\"\">Are you ready to be coached?</li>  <li style=\"\">Do you possess the skills to be an effective coachee?</li>", 
    "end_date": null, 
    "title": "It's Not About The Coach - 3 part INTRODUCTION course", 
    "price": 0, 
    "instructors": "Stuart Haden", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343188_eee4_3.jpg", 
    "course_url": "https://www.udemy.com/its-not-about-the-coach-3-part-introduction-course/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T12:19:43Z"
}