{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t Imagina que fueras capaz de potenciar tus mejores cualidades como lo  hacen las grandes marcas… ¿Cuál es el impacto que esto tendría en tu  trabajo? ¿qué papel juega tu marca personal dentro de tu comunidad? ¿y  en tu vida?  </p>\n\n<p>  \t El liderazgo efectivo se consigue a través del propio autoliderazgo. En  este curso te proponemos un viaje, una experiencia de transformación que  te llevará a conocerte mejor y ser capaz de desarrollar las destrezas  del auténtico liderazgo.  </p>\n\n<p>  \t Todo tesoro necesita de un mapa para llegar a él. Tu mayor tesoro es tu  propia vida. Si te has preguntado qué quieres hacer con ella, en este  curso aprenderás a abrir tu mente para enfocar los objetivos, recursos y  acciones de tu proyecto vital.  </p>\n\n<p>  \t<strong>Sinopsis</strong>  </p>\n\n<p>  \t  Este Itinerario de Autodescubrimiento es un completo programa compuesto de 3 cursos YPD para desarrollar tu capacidad de liderar tu propia vida:  </p>\n\n<p>  \t 1. Desarrolla tu marca personal (LA MARCA)  </p>\n\n<p>  \t 2. Desarrolla tu liderazgo con Viktor Frankl (LA VIDA ES BELLA)  </p>\n\n<p>  \t 3. Dónde estoy y a dónde quiero ir (EL MAPA DE MI VIDA)  </p>\n\n<p>  \t<strong>Autores</strong>  </p>\n\n<p>  \t   </p>\n\n<p>  \t Franco Soldi (CEO Founder &amp; YPD Captain)  </p>\n\n<p>  \t   </p>\n\n<p>  \t \"Jary\" Juan Antonio Ramos-Yzquierdo (Chief Operations Officer &amp;YPD Captain)  </p>", 
    "end_date": null, 
    "title": "Itinerario de Autodescubrimiento", 
    "price": "25.00", 
    "instructors": "YPD Young Potential Development", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151750_4833_2.jpg", 
    "course_url": "https://www.udemy.com/itinerario-de-autodescubrimiento/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-24T01:06:39Z"
}