{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>1700+ HAPPY STUDENTS HAVE TAKEN THIS UNIQUE, LIFE CHANGING COURSE</strong>  </p>\n\n<p>  \t<strong>LATEST: Course updated April 2016 (now with 13 hours of content, which can be viewed again, and again!)</strong>  </p>\n\n\n\n<p>  \t<strong>JOIN THE CHAKRA REVOLUTION </strong>- it is an inner revolution, spinning your yogic energy centres, so your energy flows perfectly into creating you, and your life, exactly how you want it!  </p>\n\n\n\n<p>  \t                  You too can be happy like 1700+ students who have taken the right step and enrolled on this incredible course...  </p>\n\n\n\n<p>  \t                  Get ready to really move forward, and live the life you always dreamed of, and were born to live.  </p>\n\n\n\n<p>  \t<strong>Like me, YOU can be who you want to be, have whatever you want to have, do whatever you want to do, whenever you want i.e. be completely FREE!</strong>  </p>\n\n\n\n<p>  \t                        Right now you have the choice to be able to feel really good about yourself, and your life.  </p>\n\n\n\n<p>  \t                        This is all possible by unlocking the ancient secrets of the Chakra energy centers, as taught in Kundalini Yoga, and Ancient Wisdom across the world, through the ages.  </p>\n\n\n\n<p>  \t            After over <strong>10 years of practicing, and teaching Kundalini Yoga</strong>, having learnt this sacred art in Anandpur Sahib, Northern India - I can tell you this stuff is <strong>amazing</strong>.  </p>\n\n\n\n<p>  \t            I also have spent the last <strong>10 years practicing and teaching Kundalini Dance</strong>, having learnt this groundbreaking practice in the rainforest outside of Byron Bay, Australia - a <strong>powerful, shamanic Journey through the Chakras</strong>, and I share the wisdom of how you too, like me can heal, and feel wonderful all the time.  </p>\n\n\n\n<p>  \t<strong>  I may be completely unique in the world to have mastered these 2 practices</strong>, but they complement each-other perfectly. <strong>Happiness is about finding</strong> <strong>balance</strong> - Kundalini Yoga is very male, very specific, and goal orientated, whereas Kundalini Dance, and the wisdom I share from this, is very female, creative, intuitive and loving.  </p>\n\n\n\n<p>  \t<strong>I have unlocked the secrets to happy, and successful living, and I am sharing these secrets with you now!</strong>...  </p>\n\n\n\n<p>  \t                        This is an <strong>8 week Chakra journey</strong>, a voyage of discovery within your inner 'seven seas' of knowledge, to finally rediscover the lost magical island of pure being, and <strong>unbounded joy.  </strong>  </p>\n\n\n\n<p>  \t      Week One: Introduction to your 7 Chakras - <strong>We are made up of energy vibrating across 7 unique frequencies, just like all of life in the universe.  </strong>  </p>\n\n\n\n<p>  \t<strong>      This is why this is the best, simplest, an most effective system to get you exactly where you want, and need to be - because we literally embody these 7 principles!</strong>  </p>\n\n\n\n<p>  \t                            Week Two: <strong>Base Chakra</strong> - Anchor your attention through the sitting bones into the Sacred Earth.  </p>\n\n\n\n<p>  \t                        Find your sense of belonging, to feel fully safe and secure no matter what happens.  </p>\n\n\n\n<p>  \t                        Reclaim your rightful claim to your beautiful and amazing body.  </p>\n\n\n\n<p>  \t                            Week Three: <strong>Sacral</strong> <strong>Chakra</strong>- Dive deep into your sexual essence and remember how good it is to <strong>feel the sensual nature of your body, and the world around you.  </strong>  </p>\n\n\n\n<p>  \t                        Unlock your unbounded creativity, together with your forgotten gifts, and talents.  </p>\n\n\n\n<p>  \t                            Week Four: <strong>Solar Plexus</strong> <strong>Chakra</strong>- Reclaim your vital energy to become a powerful magnet to become who you were born to be, and <strong>live the life you were born to live</strong>.  </p>\n\n\n\n<p>  \t                            Week Five: <strong>Heart</strong> <strong>Chakra</strong>- Between the pillars of your strong shoulders lies a lost and forgotten island surrounded by a <strong>deep ocean of wonderful bliss</strong>.  </p>\n\n\n\n<p>  \t                        It's time to return to the joy you once had.  </p>\n\n\n\n<p>  \t                        You deserve to feel your own soul dancing in the shining light of your conscious attention.  </p>\n\n\n\n<p>  \t                            Week Six: <strong>Throat</strong> <strong>Chakra</strong>- Everything is communication.  </p>\n\n\n\n<p>  \t                        We were born to relate, but communication starts at home.  </p>\n\n\n\n<p>  \t<strong>            Learn to really listen</strong> to and through your body to a deeper place, an inner knowing, sounding from the lost inner voice.  </p>\n\n\n\n<p>  \t                            Week Seven: <strong>Third Eye</strong> <strong>Chakra</strong>- Take the mask off, and learn to really see yourself as you truly are, an amazing and unique soul.  </p>\n\n\n\n<p>  \t<strong>            Create a vision a thousand miles high</strong>, and across the whole world.  </p>\n\n\n\n<p>  \t                            Week Eight: <strong>Crown Chakra- Coming home to rest in pure awareness</strong>, the shining light of divine love.  </p>\n\n\n\n<p>  \t                        Life is a blessing, allow your soul to embrace the heart of the Universe.  </p>\n\n\n\n<p>  \t<strong>      Don't wait a moment longer - start feeling better, and living fully right now, by enrolling on this unique course...</strong>  </p>\n\n\n\n<p>  \t                        30 Day Money Back Guarantee  </p>\n\n\n\n<p>  \t                        Course Updated: April 2016</p>", 
    "end_date": null, 
    "title": "Journey Through The Chakras: 7 Keys To Kundalini Yoga & Joy", 
    "price": "30.00", 
    "instructors": "Mark Keane", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124202_075a_2.jpg", 
    "course_url": "https://www.udemy.com/journey-through-the-chakras/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-22T23:34:50Z"
}