{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn how to finally kick those chocolate cravings to the curb once and for all! You will feel alleviated from the mental trap these cravings create - Imagine walking away from a piece of chocolate because you said so!</p>\n\n<p><strong class=\"redactor-inline-converted\">Get your own power back by learning a few simple steps you can do as you walk to the vending machine or storm out the door to get your next piece of chocolate, only to find yourself not wanting it anymore. The joy will be all yours! </strong>        </p>\n\n<ul><li>Understand that with a few minutes of tapping (EFT) you can walk away from that chocolate any day you chose to</li><li>Know that you can take back your power today</li><li>Feel the respect for yourself grow with every time you are able to say no to chocolate</li></ul><p><br><strong class=\"redactor-inline-converted\">CHOCOLATE IS KNOWN TO BE A CRAVING THAT FALLS IN THE LAPS OF WOMEN,</strong> but it doesn't exclude anyone. Research believe that if you are suffering from chocolate cravings you are deficient in Magnesium and possible antioxidants, and unfortunately not chocolate. But when you have a craving, who cares why you do... You just want the darn chocolate and be done with it, right?! <strong class=\"redactor-inline-converted\"><em>Crave it,</em> e</strong><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">at it, go about your life, and then REPEAT</strong>. </em></p><p><strong>It's the repeat process we ultimately want to break with this course</strong> so that you can chose when it is appropriate for you to actually have chocolate. This course is not about banning chocolate from your life forever, unless that is your goal. This is about managing your life to your liking. Cravings have a tendency to take over everything that is logical and right. UNTIL you know how to manage them. And that is exactly what this course will help you to do. </p><p>I won't tell you to buy a bottle of magnesium pills to grab when you feel that craving because that is like telling you to go to bed when you need to go to the bathroom... I know the struggle. I have been a sugar addict most of my life and what I am sharing with you in this free course works! </p><p><strong class=\"redactor-inline-converted\">TAKE BACK YOUR POWER TODAY</strong> </p><p>Much Love and Blessings <br>~Helena   </p>", 
    "end_date": null, 
    "title": "Kick free from your chocolate cravings today", 
    "price": 0, 
    "instructors": "Helena Berggren", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/854032_0caa_3.jpg", 
    "course_url": "https://www.udemy.com/chocolate-cravings/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T13:51:33Z"
}