{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this <strong>audio only</strong> program, learn how to work with the darkest aspects of yourself to understand, engage in a healthy way, and overcome.</p><p>“Why are the people around me so difficult?” “Why do I keep getting in situations like this?” Our shadow side, teaches Robert Augustus Masters, contains the emotions and desires we've disowned, neglected, or hidden from ourselves. If not skillfully worked with, it can easily direct our lives on every level.</p>\n\n<p>With <em>Knowing Your Shadow</em>, this acclaimed psychotherapist and author shows us how to illuminate and wisely engage with the endarkened aspects of who we are. Join him to explore in depth the areas where shadow work can most benefit us, including:</p>\n\n\n\n<ul><li>Discovering and cultivating intimacy with the endarkened aspects of yourself</li><li>Identifying and healing your core wounds</li><li>Working effectively with anger, fear, shame, guilt, and other difficult emotions</li><li>Understanding how your shadow influences those around you, often beyond conscious awareness</li><li>Guided practices, meditations, and exercises for developing more authenticity and wholeness in your personal and workplace relationships, your sexuality, and your spiritual path</li></ul>\n\n\n\n<p><br>Our moods and relationships often seem to have a life of their own. <em>Knowing Your Shadow</em> offers exceptional support for taking charge of your life at a deep level, providing expert guidance and instruction to discover and make wise use of what lies hidden or otherwise neglected within us.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Learn More About:</strong></p>\n\n\n\n\n\n<ul><li>Becoming intimate with your shadow</li><li>Relating wisely to shame and guilt</li><li>Ending your suffering by entering your pain</li><li>Exploring the presence of your past</li><li>Freeing yourself from your inner critic</li><li>Working with fear, anger, and other darker emotions</li><li>Bringing sex out of the shadows—how we eroticize our unmet needs</li><li>The signs of spiritual bypassing</li><li>Healthy spirituality</li><li>Becoming intimate with all that you are</li></ul>", 
    "end_date": null, 
    "title": "Knowing Your Shadow: Overcome Dark Emotions (Audio Only)", 
    "price": "50.00", 
    "instructors": "Sounds True, Robert Augustus Masters", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848678_0d6f.jpg", 
    "course_url": "https://www.udemy.com/knowing-your-shadow-audio-only/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T00:39:10Z"
}