{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"This course is the shortest path to get you hired. Worked for me. \"</em><strong>- Jose Luis Rosa</strong><br></p><p><strong>More than 1000 students in the first week. </strong></p><p>--------------------------------------------------------------------------------------------------</p><p><strong>Perfect resume will not land you a job. Tips from this course, probably will. </strong></p><p><strong>--------------------------------------------------------------------------------------------------</strong></p><p>Job search is like an exam. You need to get prepared in order to pass it.</p><p>OK. You have just realised that you have the opportunity to take control of your career, regardless of what industry you want to get hired.</p><p>This course is a compilation of already tested techniques and clear actions which will help you to climb that career ladders.</p><p><strong>Get a complete step-by-step blueprint to score a job, regardless of your level of expertise or state of the economy.</strong></p><p>Our team spent more than 3 months just to do research and to extract the best practices from the students who were using this method to land a job. General conclusion was that job search is much simpler process than it looks like. That <strong> simpler </strong> part is carefully described in this course.</p><p>Throughout the lessons, you'll have the opportunity to complete action steps that will help you design your job search path. You'll get as much out of this course as you choose to put into it. I expect that you do all the work and I will teach you how.</p><p>This course is compiled of some of the best job search techniques, easy to follow lessons, good reads, and real examples.</p><p><strong>Join this course and design own easy-to-follow-path which will land you a job. </strong></p><p>During this course, you will enter the processes which will help you to acquire important life skills. Our students got a chance to improve their negotiation and communication skills and to learn the simplicity of getting what they want.</p><p>This course is win-win situation to anyone seeking a better job. I encourage you to take the course because 0 (zero) you already have, so you can only profit from it.</p><p>This course is coming with Udemy's <strong>30-Day-Money-Back-Guarantee </strong>so in case you don´t get hired in the first 30 days, please take your money back.</p><p>I will try to bring you through the whole course, and will be happy to answer any question you might have. Join the course and see you inside.</p><p><em>Course is delivered by Vince and Edo.</em></p>", 
    "end_date": null, 
    "title": "Land a Job In Record Time - 5 Years Experiment In One Course", 
    "price": "20.00", 
    "instructors": "Edo Sadikovic", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584052_08c5_2.jpg", 
    "course_url": "https://www.udemy.com/job-search/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-15T20:29:42Z"
}