{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>+ + + + + + ++ + <em>Join Over 3100+ other students TODAY!!</em> + + + + + + + + + +</p><p>+ + + + + + ++ + <em>Over 23+ 5 Star Reviews These 23 Reviews Can't Be Wrong So Buy this Course with Full Confidence and Learn How to Manifest What You Want using The Law of Attraction!!!</em> + + + + + + + + + +</p><p>Many of us have watched \"The Secret\", felt good and pumped up; and then went out and tried to put  The Law of Attraction into practice to manifest our desires.<br></p><p>Few have actually succeeded.</p><p>But I have!</p><p>I have learned to become a conscious creator and manifestor and have used the Law of Attraction to radically and quickly change my life around from one of homelessness and depression to one of success and happiness on my own terms.</p><p>And I want to share what I've learned; what has worked for and works for me daily, with you in this course.</p><p>In this course you will learn the basic principles of the law of attraction, with real world examples and how to use it effectively to manifest the life you desire. </p><p>In this course I also give you tips and techniques to allow you to turn your desires into reality.</p><p>Now is the time to start living the life of your dreams!</p><p>Now is the time for freedom, wealth, happiness and love!</p><p>NO NON-SENSE STRAIGHT TALK!!!</p><p>In this course you will learn...</p><ul><li>How to change your life by changing your Mind</li><li>How to harness the Power of The Universe</li><li>How to use your imagination to change reality</li><li>How to use ancient mind power techniques to manifest your desires</li><li>Why The Universe is at your command</li><li>Why you should keep a positive attitude at all times</li></ul>", 
    "end_date": null, 
    "title": "Law of Attraction: How To Manifest What You Want", 
    "price": "20.00", 
    "instructors": "John Williams", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/490754_522f.jpg", 
    "course_url": "https://www.udemy.com/law-of-attraction-how-to-manifest-what-you-want/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-30T19:50:22Z"
}