{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Law of Attraction is the ancient wisdom discovered and documented by mankind because it is mother of all wisdom. Every problem has its solution created along side. One must learn to attract this solution into life. Law of Attraction helps learn exactly just that. This wisdom has helped the famous 3% to correct the course of their life and become closer to the life they wanted. You can too.</p><p>Law of Attraction is presented as \"like attracts like\", \"thoughts become things\". The definition of the word system is - a set of steps if practised leads to a definite result. Now what if you had a system for successful manifestation. What if you had a guiding tools that help you devlop a life system whose result is always succesful manifesation. This course is all about setting up up with one such Life System. This course is about the learning the secrets of manifestation wisdom from abundance masters.</p><p>Therefore, I am inviting you to this workshop on Manifestation Secrets of Law of Attraction. The path way to solve your current problem – financial, relationship, business, people, job, personal, professional or even social problems will be revealed to you.</p><p>If you keep doing the same things you get same results, but when you add something new to your mind and life you start doing new things and become closer to solution. When you learn you add difference in your life. There is nothing more profoundly powerful than learning the right thing at the right time. And learning the manifestation secrets of Law of Attraction can be the most powerful things you could do right now! Join Now!</p>", 
    "end_date": null, 
    "title": "Law of Attraction Complete Manifestation Wisdom Course", 
    "price": "50.00", 
    "instructors": "Life Coach, Avi Peron Academy Venkateshwaran M", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/550720_04e9_6.jpg", 
    "course_url": "https://www.udemy.com/manifestationsecrets/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-10T03:33:20Z"
}