{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Since the release of the movie, <em>The Secret</em>, in 2007, there has been a lot of talk about Law of Attraction. Some of it accurate, some not.</p><p>This course teaches the science behind this law: the fundamentals, strategies and tips for increasing your success, abundance, self-confidence, and results.</p><p><em>Law of Attraction Bootcamp: Fundamentals, Tips &amp;</em> Strategies walks you through 7 steps what you need to know to create your ideal life. <br></p><p>It contains the most up-to-date scientific and spiritual information regarding this universal law. </p><p>Myths are debunked as we answer some of the most widely asked questions such as, </p><p><em><strong>What are the physics of Law of Attraction?</strong></em></p><p><em><strong>How do I use LOA to create my ideal situations and circumstances and stop the ones I don't want from repeatedly showing up in my life?</strong></em></p><p><em><strong>How do I stop worry and fear when it feels like nothing is changing and feel easier about life instead?</strong></em></p><p><em><strong>Am I attracting things because of negative subconscious beliefs?</strong></em></p><p><em></em>We'll answer these questions—<strong>and many more</strong>—in this course. </p><p>In order to create your ideal results in life, the things you truly want to do, be and have, you must understand how the process of turning thoughts to things works. You must be willing to alter habitual ways of thinking, feeling and acting in order to create positive change.</p><p>Are you ready and willing to do what it takes to create the life you want?</p><p><em>Law of Attraction Bootcamp</em> gives you most up-to-date place to start and step-by-step instructions on what to do to make your life better. It teaches you the well known and proven secrets to creating your ideal life.</p><p><strong>The 7 steps to harnessing the power of LOA in everyday life, provided in this course, are used by all those who achieve big success.</strong></p><p>Are you ready to be one of them?</p><p><em>No problem can be solved from the same level of consciousness that created it.</em></p><p><em>~Albert Einstein</em></p><p>You can not solve your challenges, or get better results, from the same level of thinking that created them. This course <strong>significantly</strong> alters how you think about LOA so you can easily attract your desired results.</p><p>Join us as we pull back the curtain and reveal how the Law of Attraction <em>really</em> works. No fluff or speculation, just pure spiritually scientist stuff here.</p><p>Be one of the few people on the planet who <strong>truly</strong> understand why situations and circumstances happen as they do and how to transform your results from what you don't want to what you do—faster.</p><p>Don't wait any longer to create the results you want and increase your happiness.<strong> </strong></p><p><strong>Make sure to take the \"Is this the right course for me?\" less than 1 minute quiz right now, watch the available preview videos and read the free preview pdf's. This will give you an excellent sense of my teaching style, how the course is organized and presented and if it's the right class for you. If you resonate with that you see and read, enroll today. This course has a 30 day money back guarantee and lifetime access. </strong></p><p><strong><em>***You truly have nothing to lose and everything to gain by enrolling right now. 2016 is the perfect year to make the changes you desire. If you don't have the results you want, join us </em></strong><strong><em>in class and find out how you can!***</em></strong></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Law of Attraction Bootcamp: Fundamentals, Tips & Strategies", 
    "price": "20.00", 
    "instructors": "Allison Sutter", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/487448_a066_6.jpg", 
    "course_url": "https://www.udemy.com/law-of-attraction-discover-the-secret-create-your-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-27T12:03:44Z"
}