{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Lead with your strengths. Reach your greatest potential by learning to identify and capitalize on the talents and abilities that make you unique. <br></p><p><strong>Become expertly skilled at understanding, discovering, communicating, and applying your natural talents.</strong><br></p><ul><li>Understand your incredibly powerful talents</li><li>Discover how you should use your talents to be more effective</li><li>Communicate your talents with confidence</li><li>Apply your talents for success</li></ul><p><strong><br></strong></p><p><strong>People who do focus on their strengths every day are</strong><strong> more engaged and more productive.</strong><br></p><p>You will learn the fundamentals of strengths-based development that will give your life a new perspective. Shine a spotlight on the talents that make you...you.</p><p>“Today you are you, that is truer than true. There is no one alive who is youer than you.” --Dr. Seuss</p><p><strong>Content and Overview</strong></p><p>In over 9 hours of content and exercises, this course covers the essential topics to help you maximize your natural talents. We also provide links to additional resources for each of the 34 StrengthsFinder themes, so you have everything you need based on your individual results.</p><p>This course covers the importance of strengths-based development using the StrengthsFinder assessment. We know that everyone possesses a unique set of talents and strengths. However, It's not enough to simply understand that you are unique. The truly great individuals learn how to capitalize on these differences.</p><p>Based on more than four decades of research, the Clifton StrengthsFinder® is the greatest tool for helping people find the source of their natural talents. <strong>However, simply taking the assessment is not enough.</strong><br></p><p>That’s why we created this course. Our process was designed to efficiently lead you down a path of self-discovery and to help you truly unlock your greatest potential.<strong></strong></p><p>Upon completion, you will be expertly skilled at understanding, discovering, communicating, and applying your natural talents.</p><p><strong>To take this course, you will need to take the StrengthsFinder assessment. The cost for the assessment is $15, and it is not included in this course.</strong></p><p>As well as the Udemy 30 day guarantee, you have my personal promise that you will be delighted by what you'll learn in this course.<br></p><p>This is an introductory price for this course, and the <strong>price will increase on December 14th at 4pm eastern time.</strong></p><p><strong>Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Lead With Your Strengths And Harness Your Potential", 
    "price": "50.00", 
    "instructors": "Dan Fratantoro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647816_6792_2.jpg", 
    "course_url": "https://www.udemy.com/lead-with-your-strengths-and-harness-your-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T13:19:58Z"
}