{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t      Wouldn&#039;t you love to be one of those &#039;no fear&#039; people that can effortlessly speak in front of a crowd?...You Can!  </p>  <p style=\"\">  \t        This FREE course is not only for those people that have been asked to MC a Wedding but also for those people that would like to over come their fear of public speaking and arm themselves with the tools needed to nail it the next time they need to speak to a crowd of people.  </p>  <p style=\"\">  \t        In this course, I will cover  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        -The role of the wedding MC  \t</p>  \t<p style=\"\">  \t\t        -How to prepare-  \t</p>  \t<p style=\"\">  \t\t        -How to deal with nerves - Here you will learnt the fantastic tool that so many public speakers use to turn their fear into excitement.  \t</p>  \t<p style=\"\">  \t\t        -I’ll cover the various duties you may need to perform  \t</p>  \t<p style=\"\">  \t\t        -And all the hints, tips and techniques to help make the day go spectacularly well. We&#039;ll discuss the importance of Being Yourself - No One is better at being you than &#039;You&#039; -Being Energetic -Being the Best version of &#039;You&#039; -Smiling -Movement - What to do with your Hands? Where to Look? -Knowing the Audience is your Friend-Projecting your Voice -Not worrying when you make an Error -Trying what you&#039;re going to say, before you say it -Practicing, Practicing and Practicing-Not being Repetitive-Using Humour...or not using Humour - Using a Microphone Effectively - and Much, Much More.  \t</p>  \t<p style=\"\">  \t\t  This is a course that absolutely anyone can follow along to and irrespective of your public speaking skills, you can not only become competent at speaking to a crowd but you can become absolutely great at it, and impress yourself and so many others.  \t</p>  \t<p style=\"\">  \t\t      There are 15 video lectures to follow along to with over an hour of easily digestible and applicable content that you can review again and again. Also provided is the text version of all lectures.  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Learn How to be a Great Wedding MC!!  ", 
    "price": "30.00", 
    "instructors": "Chris Parsons", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/224666_db19_2.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-be-a-great-wedding-mc-for-free/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-21T02:01:34Z"
}