{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is about self hypnosis and how self hypnosis can be used to help with personal development and how self hypnosis can be used for overcoming problems. This self hypnosis course is also about how self hypnosis can be useful for clients in counselling or therapy, and how to make personalised self hypnosis audio tracks.</p><p>This self hypnosis course consists of video lectures about what self hypnosis is, what self hypnosis can be used for, and videos of structured self hypnosis inductions. There are also mp3 audio versions of the self hypnosis tracks so that you can listen to these self hypnosis tracks through headphones on an audio player. There are also additional PDF notes.</p><p>This course is for those interested in personal development and interested in accessing and reprogramming their own mind.</p><p>The self hypnosis course can be completed in about 3 hours, but you may well take longer as you practice with the different self hypnosis processes and explore what works best for you.</p><p>The self hypnosis course is structured to take you through:</p><ul><li>What self hypnosis is</li><li>Uses of self hypnosis</li><li>How to make your own self hypnosis audio tracks</li><li>How self hypnosis can be integrated into counselling and therapy</li><li>Therapeutic techniques that can be done with self hypnosis</li><li>Structured self hypnosis inductions</li><li>How to develop your own inductions</li><li>How to re-induce hypnosis and set up self hypnosis triggers</li></ul><p>There are also notes which include scripts of many of the self hypnosis inductions an notes about much of the content of this self hypnosis course.</p><p>You should take this course if you are interested in hypnosis, and interested in learning self hypnosis, whether for yourself, or to teach to others, like clients.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn Self Hypnosis For Personal Development", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/230198_004f_2.jpg", 
    "course_url": "https://www.udemy.com/self-hypnosis-for-personal-development/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-26T21:55:52Z"
}