{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you lead a stressful, busy, life where there is never enough time to relax?</p><p>Does this describe the life you lead?</p><p>Are you trying to manage life's up and downs without the skills at hand. </p><p>Because our bodies perceive this stress as a crisis you are susceptible to anxiety, depression, sleep or health issues and difficulty focusing. </p><p>Since the busy state of this world is not about to slow down, the solution is to learn the skills, which will help you, cope on a daily basis, rather than living for a long awaited vacation as the only respite from the stress. </p><p>In this course you will discover how mindfulness meditation is the foundation for managing stress and in helping you establish clarity of what you most want for your life. </p><p>You will be taken through an introduction of mindfulness meditation, with a simple explanation of how to meditate and the multitude of benefits. </p><p>The icing on the cake is the series of 7 short daily meditations for you to practice forever, they are yours, including the written scripts for each meditation. </p><p>You may have had a desire to start or have attempted your own meditation practice, but found it difficult to begin or stick to it. This course will help you overcome some of the obstacles of sitting in stillness that many people experience. </p><p>The course is designed in easy steps based on my 25 years as a psychotherapist, yoga and mindfulness meditation teacher and my personal challenges to establish a consistent mindfulness meditation practice. </p><p>As you rush through your days feeling frenetic and harried, take a moment and ask yourself. Do I want to live my life like this? </p><p>Take this journey with me, to free yourself in a stressful world. </p>", 
    "end_date": null, 
    "title": "Learn to Mindfully Meditate with 7 daily practices", 
    "price": "20.00", 
    "instructors": "Rebecca Jane", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/518090_5e7f_4.jpg", 
    "course_url": "https://www.udemy.com/mindfulness-meditations/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-02T14:55:00Z"
}