{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Learn 5 proven strategies to start feeling better about yourself, right away</strong><strong></strong><br></p><p>This new course from top-rated instructors Steve Churchill and Dr. Roger Allen will help you overcome feelings of inferiority which may be holding you back from achieving your goals and dreams.</p><p>We'll start out by discussing the term inferiority complex and list the symptoms of this self-defeating behavior.</p><p>After a lesson on the reasons and benefits of why you should work to eliminate feelings of inferiority, we present the <strong>5 actionable strategies</strong> you can use to start feeling better about yourself right away. </p><p>Each one of these lessons is followed by a worksheet of exercises you can complete to start applying each strategy in your life.</p><p>If you've struggled with having healthy self-esteem, if you've had a difficult time managing emotional and psychological fallout from damaging experiences, or, if you just want to build up your self-confidence a little bit more, then join us and the thousands of other students who have already enrolled in our courses.<br></p><p><strong>Bonus Material</strong></p><p>This course includes free bonuses of a printable quick reference guide, all the audio files as MP3 downloads, an extra lesson on \"moving forward,\" and guaranteed responses from the instructors to any question you post in the discussion area.</p><p><strong>Enroll Now</strong></p><p>You can view the free preview videos in the course outline down below, and there's a 30-day money back guarantee for the course.</p><p>Join us and the thousands of other students in our courses and start feeling better about yourself, right away.</p><p><br></p>", 
    "end_date": null, 
    "title": "Learn How to Stop Feeling Inferior: 5 Proven Strategies", 
    "price": "35.00", 
    "instructors": "Steve Churchill, Dr. Roger K. Allen", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661730_fc76_3.jpg", 
    "course_url": "https://www.udemy.com/inferiority/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T03:54:19Z"
}