{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do people like Walt Disney, Thomas Edison and Steve Jobs <strong><em>*INSPIRE*</em></strong> you?  Do you ever wonder what they did to achieve such great feats?  Would you like to unlock their secrets of personal transformation to live an extraordinary life beyond your wildest imagination?</p>  <p>  \t<strong>…In Order To Make Your Dreams A Reality,</strong> <strong>You First Have To Understand One Very Important Thing…</strong>  </p>  <p>  \t                                                                          All great visionaries, innovators, and entrepreneurial leaders were committed to their ideals <em>despite what the world thought</em>....  They latched onto them and <strong><em>*NEVER*</em></strong> <strong>allowed the criticism, fear and discouragement of others to overtake their positions.</strong>  </p>  <p>  \t                                                                          …They understood that <em>in order to tap their inner potential, they'd have to approach life differently than the masses.</em>  </p>  <p>  \t                                                                          …But you may be wondering how <strong><em>exactly </em></strong>they went about their work…  </p>  <p>  \t                                                                          …In <strong>The Mechanics of Thought</strong> you will learn just that — the models of behavior these people adopted to shape their lives and impact humanity….  </p>  <p>  \t                                                                          It reveals a “Code of Excellence\" and exposes you to concepts which are intended to <em>shift your paradigm</em> and stimulate a <em>new</em> line of thinking…  </p>  <p>  \t                                                                          And the best part is…  </p>  <p>  \t<strong>You'll Learn It All In </strong><strong><em>Under</em></strong><strong> AN HOUR!</strong>  </p>  <p>  \t                                                                          This *revolutionary* course is <em>power-packed</em> with ancient and contemporary cultural secrets like:  </p>  <ul>  \t<li>What the yin-yang symbol <strong><em>really</em></strong> means and how it applies to the concepts of “Consciousness,\" “Duality\" and “Oneness\"</li>  \t<li>Cause-Effect and the process of creation as it relates to both humans AND nature</li>  \t<li>How to <em>shift</em> your paradigm and *<strong>BREAK OUT* </strong>of mental prison</li>  \t<li>The transmutation of energy and how to convert negative thoughts into positive ones</li>  \t<li>How to [protect the mind] from <strong><em>fear</em></strong> by cultivating unconditional love</li>  \t<li>How to become self-reliant when the world portrays a <em>victim</em> mentality</li>  \t<li>How to <strong><em>match</em></strong> the vibrational frequency of your desires with the “new-age\" law of attraction  </li>  \t<li>The importance of reaching for dreams that sit <em>*OUTSIDE*</em> of your comfort zone</li>  \t<li>The dissipation of thought energy and <strong>how to project your emotional attention towards a definite worthwhile purpose</strong></li>  \t<li>3 simple steps to manifesting your dreams</li>  \t<li>The path of evolution and the road to PERSONAL FREEDOM</li>  \t<li>The <em>subtle</em> and <strong>obvious</strong> differences between love and fear</li>  \t<li>Plus more…</li>  </ul>  <p>  \t                                                (…It's valuable information you'll want to review over and over, again and again…)  </p>  <p>  \t                                                                          When you buy it NOW you'll receive:  </p>  <ul>  \t<li><strong>40+ page</strong> downloadable ebook</li>  \t<li><strong>60+ slides</strong> of course</li>  \t<li><strong>45+ minutes</strong> of animated content</li>  \t<li><strong>Direct Q&amp;A</strong> access to myself</li>  \t<li><strong>Ongoing materials</strong> added periodically</li>  </ul>  <p>  \t                                                                          Oh, and one last thing…  </p>  <p>  \t                                                                          If you feel the material wasn't what you expected, at <strong>any</strong> point within the first <strong>30 days</strong>, you can always ask for a <strong>100% refund</strong>, *GUARANTEED*.  <strong>NO QUESTIONS ASKED.</strong>  </p>  <p>  \t                                    My interest is not in getting your money but in helping you <em>TRANSFORM</em> your <strong>LIFE</strong>.  </p>  <p>  \t                                    So with that I encourage you to buy the course, go through the materials, run it through your mind a couple of times, and <em>determine for yourself</em> whether it was a worthwhile purchase.  </p>  <p>  \t                                    And again, you can watch ALL the videos in under an <strong>hour</strong>... which I think is pretty cool, but that's just me.  </p>  <p>  \t                                If you're ready, click <strong>\"Take This Course\"</strong> to get started.  </p>", 
    "end_date": null, 
    "title": "Learn How To Think Like A Visionary, Innovator, Entrepreneur", 
    "price": "50.00", 
    "instructors": "Chase Mirkovitz", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/376642_eafd_5.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-think-like-a-visionary-innovator-entrepreneur/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-23T23:36:58Z"
}