{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">In this course &#039; Learn Conversational Hypnosis For Sale And Influencing &#039; By Pradeep Aggarwal , you will learn many hypnotic and NLP techniques to influence and persuade your prospective and existing clients better. Conversational hypnosis is about giving suggestions and talking to them and making them do what you want by making them create pictures in their mind and by  putting hypnotics suggestions in their mind. </p><p style=\"\">This course will help you make your clients remember the benefits of your products only and also forgetting about the competitor and its strengths . Using the powerful and simple techniques your client will have a very clear and vivid picture of your products and its benefits. The techniques can also be used to persuade and influence your boss/colleague/spouse/friends etc .</p><p style=\"\">This course contains 8 lectures and over 30 minutes of live video recording </p><p style=\"\">The lectures are -</p><p style=\"\">Introduction</p><p style=\"\">What is conversational hypnosis?</p><p style=\"\">How to install pictures and the benefits of your products in your client&#039;s mind</p><p style=\"\">How to evaluate the above technique</p><p style=\"\">How to make your client forget your competitor</p><p style=\"\">How to use post hypnotic suggestions on your prospective and existing clients</p><p style=\"\">How to use waking hypnosis on your clients</p><p style=\"\">Summary of the course</p>", 
    "end_date": null, 
    "title": "Learn Conversational Hypnosis For Sales And Influencing ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535018_8d50.jpg", 
    "course_url": "https://www.udemy.com/learn-conversational-hypnosis-for-sale-and-influencing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T11:40:08Z"
}