{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong><strong style=\"\">Regain control of your mind and life. Become an independent thinker. Gain more self-confidence and present your ideas with assurance. Enroll in this course and learn to think for yourself.</strong></p><p style=\"\">Following the crowd and thinking like they do will limit your opportunities in life. Caring too much about what other people think of you will forfeit your dreams and goals in life. Thinking for yourself will keep other peoples' opinions from ruining your destiny. </p><p style=\"\">If you're someone who want more confidence in yourself, if you want to trust your own ideas more, if need more self-assurance to succeed professionally, then <strong style=\"\">this course is for you.</strong><br style=\"\"></p><p style=\"\">This course presents information and exercises you can use to confidently trust your own ideas. The content comes from cutting-edge research and real-life case studies on the benefits of independent thinking. </p><p style=\"\">In each section, there's a different approach presented to <strong style=\"\">help you become an independent thinker</strong>. There are fascinating case studies of people who successfully learned to think for themselves, as well as examples of people who failed in life because they let other people do their thinking for them.<br style=\"\"></p><p style=\"\"><span style=\"\">Steve Churchill </span>(your instructor) has developed career and leadership development training courses for dozens of Fortune-500 companies, and those programs have been used to train hundreds of thousands of professionals.<br style=\"\"></p><p style=\"\"><strong style=\"\">Click the Take this Course link</strong> to join thousands of other students in the Udemy community by enrolling in this course and <strong style=\"\">learning to more effectively think for yourself</strong>.</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learn How to Think for Yourself", 
    "price": "25.00", 
    "instructors": "Steve Churchill, Didactable Interactive", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606648_3f4b_8.jpg", 
    "course_url": "https://www.udemy.com/think-for-yourself/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T03:37:48Z"
}