{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis course is presented in a very simple, accessible way by Kaya, one of the most important teachers &amp; symbol specialist of dream &amp; sign interpretation. It has been prepared to raise awareness in students and help them learn to discern and understand the importance of signs in our materialization, decisions, changes, etc. Knowing how to interpret signs helps accelerate our evolution. In the long term, it gives rise to responsible people who know how to discern the difference between good and evil and how to make decisions consciously, with profound understanding of their life program and that of others.  </p>  <p>  \tThis course leads students to better understand the memories that are hidden behind daily situations, even the simplest ones. We learn that life can be interpreted like a dream; that there is no difference between the physical and metaphysical worlds. This very advanced Sign Introduction Program, called <strong style=\"\"><em style=\"\">Signs &amp; Symbols by Kaya</em></strong>, provides accessible tools and knowledge to students of all ages.  </p>  <p>  \tUnderstanding Symbolic Language gives students the key tool to interpret their life and the daily situations they experience. In this course students will learn that coincidences do not exist and that there is a reason for everything. Did you know that life can be interpreted like a dream?  </p>  <p>  \tKAYA is a Spiritual Teacher, Author, International Lecturer and a worldwide specialist on the Interpretation of Dreams, Signs &amp; Symbols in more than 43 countries. His profound spiritual knowledge, expertise in dream, sign &amp; symbol interpretation, his philanthropy, exemplary devotion, and humanitarian aid are a source of inspiration for millions of people on the planet. He is also the Author of the <strong style=\"\"><em style=\"\">Dictionary, Dreams-Signs-Symbols, The Source Code</em></strong> published by the multinational non-profit organization, UCM Publishing.  </p>", 
    "end_date": null, 
    "title": "Learn How to Interpret Signs & Symbols", 
    "price": "20.00", 
    "instructors": "Kaya Muller", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339838_f07d_7.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-interpret-signs-symbols/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-09T13:19:25Z"
}