{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' Learn How To Manifest By Increasing Your Life Force Energy.' By Pradeep Aggarwal , you will learn - </p><p><span></span></p><p>How to increase your life force energy so that you manifest and achieve things in your life quickly. In this course, you will also learn why energies are low and how to increase your energy.</p><p>You will learn five crucial things that decrease our life force energy. These are the things that happen in our day-to-day lives and take away our vital energy.</p><p>You will learn approximately 9 ways to increase your life force energy. Just by learning and incorporating these things in  your life, you will start seeing increase in your life force energy and slowly start manifesting what you really want in your life.</p><p>You will also learn powerful breathing techniques to manifest positive energy , relaxation techniques for instant relaxation and how to anchor confidence at important situations of your life.</p><p>This course is ideal for everyone who are not able to achieve what they want in life and are unable to attract positive energy into their lives.</p><p>It will help students achieve their goals and become more successful in their lives.</p><p>This course is in English and contains 7 live recorded lectures.</p>", 
    "end_date": null, 
    "title": "Learn How To Manifest By Increasing Your Life Force Energy", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "37 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682244_3e9e.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-manifest-by-increasing-your-life-force-energy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T08:47:34Z"
}