{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">The key to becoming all you were born to be is LOVE....so use it!</strong></p><p> Love is the spirit of life itself. You are part of life, and so love is your spirit too, as you already feel it to be. This course is to inspire you to use more of your love for your own benefit, and other people&#039;s too!</p><p> In this course you&#039;ll learn how to love more amongst family and friends, amongst people at work or in teams or groups; in the community and in the wider world also.</p><p> And you&#039;ll learn how to make good things happen, things that you might always have wished could happen but you had no idea how it could be possible.</p><p> Love can be a lot more powerful than we generally give it credit for, even though we know it&#039;s important and we value it greatly.</p><p> What&#039;s more, you, yourself, are much more than most of us think we are, and this course is about getting to know that deeper &#039;you&#039; and understanding how you can use the greater power that lies deep within you.</p><p> The combination of that greater love with the greater &#039;you&#039; can be extremely powerful. It can help you <em style=\"\">be</em> things and <em style=\"\">do</em> things you never thought you&#039;d be or do. When you&#039;ve completed the course you&#039;ll be able to use that powerful combination for your own benefit and other people&#039;s too.</p><p> There&#039;s a new perspective on the Law Of Attraction too.</p><p> The course has 10 sections with a total of 48 videos, total 200 minutes. It really would be best to go through the sections in order because there&#039;s a step-by-step process carefully set out. So please start at the beginning and work through it sequentially.</p><p> Enjoy the course, and become ALL you were born to be!</p>", 
    "end_date": null, 
    "title": "Learn To Love More", 
    "price": 0, 
    "instructors": "Philip Snow", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/94442_4bd4_2.jpg", 
    "course_url": "https://www.udemy.com/learn-to-love-more/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-19T09:22:47Z"
}