{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>El secreto acerca de \"El Secreto\". Alguna vez hizo empleo de la visualización sin resultados aparentes? Comprenda y descubra la verdad detrás de las leyes de visualización como nunca antes.</strong></p><p>La <strong>visualización creativa</strong> is el el proceso mediante el cual Ud. puede crear resultados en su vida, que nunca antes habría podido lograr. VC puede ser usada para mejorar su salud, física, mental, emocional, social, financiera, profesional, matrimonial y espiritual. Por esta razón nos referimos a la visualización creativa como terapia de intención dirigida, que no es mas que el tipo de terapia que puede hacer por si mismo, y para si mismo.</p><p>Existen muchas investigaciones científicas acerca de los temas que aquí presentaremos. Sin embargo, este curso no es una revisión de los temas que han sido investigados; mas que eso, este curso es un manual que le enseñará de forma directa como visualizar. Es para aquellos que se sienten listos a cambiar radicalmente sus vidas y convertirlas en lo que siempre han soñado.</p><p>Aquí aprenderá como manejar con destreza la ley de la atracción, hacer de la visualización parte de su rutina diaria, entender 'que\" y \"como\" visualizar, y crear su propio futuro. Usará el poder de la intención dirigida para lograr resultados nunca antes vistos en su vida. Si lo desea, también puede contribuir a hacer de este mundo en que vivimos un lugar mas placentero para todos y así, experimentará una forma maravillosa de compartir.</p><p>El curso esta magistralmente explicado por un profesor con vasta experiencia. Sin embargo, se usa un estilo pedagógico particular con toda intención. Lo que Ud. aprecia en el video promocional de este curso, es el estilo que se usa de principio a fin. No animaciones, no gráficas, no resúmenes. El estilo de enseñanza es un resultado de la evolución de años como hipnoterapista. Funciona maravillosamente cuando la atención del estudiante es completa, porque el estudiante comienza a visualizar mientras aprende. De este punto de vista de enseñanza, ayudas visuales que pudieran ser útiles en otros tipos de cursos, a la vez podrían presentar una distracción en este estilo. Por esa misma razón, le aconsejamos que no escuche las lecciones en forma de audio mientras realiza otro tipo de actividades como manejar un vehículo. </p><p>Como siempre, aqui estamos para responder sus preguntas y aceptar sus comentarios.</p>", 
    "end_date": null, 
    "title": "Ley de la Atracción y Visualización: Todo Lo que Mereces ", 
    "price": "20.00", 
    "instructors": "Flavio Souza-Campos, Ph.D.", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/708814_706b_12.jpg", 
    "course_url": "https://www.udemy.com/visualizacioncreativa/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-28T18:32:14Z"
}