{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Join the founder and director of the Agape International Spiritual Center for his first full-length <strong>audio only</strong> course, and begin the adventure of conscious participation in your soul's evolution by activating your highest potential.<br></p><p>You were never born. You will never die. And the reason you've incarnated is to reveal the glory of the Divine as you and you alone can. This is the essence of the Life Visioning Process, Dr. Michael Bernard Beckwith's transformational inner technology for uniquely expressing the love, wisdom and beauty that you are.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">A Spiritual Journey Through Four Stages</strong></p>\n\n\n\n<p>As we mature along the spiritual path, explains Michael Beckwith, we move through four stages of consciousness. Stage one, Victim Consciousness, finds one in constant reaction to things happening \"to me\" at the hands of a power outside of our control. In stage two, as the Manifester, you take responsibility for your life and put the laws of the universe to work for you. We become a third stage, Channel, when we surrender our will to a higher intelligence that functions \"through us.\" Stage four—Being Consciousness—manifests as enlightened living.</p>\n\n\n\n<p>On <em class=\"redactor-inline-converted\">Life Visioning</em>, Michael Beckwith offers guided meditations, creative visualizations, affirmative prayer, and insights from diverse traditions to support you in navigating the four stages. He then leads you through a complete Life Visioning session that allows you to intuit \"God's idea of itself as your life.\"</p>\n\n\n\n<p>Here is the same powerful practice that Michael Beckwith has taught to thousands during the past 30 years, shared for the first time on audio. It is a tool you can return to any time as a basis for discovering and unleashing the ultimate potential for your life.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Tune Yourself in to the Eternal Broadcast</strong></p>\n\n\n\n<p>\"Through Life Visioning, we become the living condition through which divine ideas express themselves,\" explains Michael Beckwith. \"These ideas can be anything from solutions to problems to a new business model to direction in your spiritual development.\" With <em class=\"redactor-inline-converted\">Life Visioning</em>, you place yourself in position to \"catch and articulate\" the eternal broadcast of that which is seeking to manifest through you, for the benefit of all.</p>", 
    "end_date": null, 
    "title": "Life Visioning by Dr. Michael Bernard Beckwith (Audio Only)", 
    "price": "50.00", 
    "instructors": "Sounds True, Michael Beckwith", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848676_ffed.jpg", 
    "course_url": "https://www.udemy.com/dr-michael-bernard-beckwith-audio-only/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T00:38:32Z"
}