{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Life Mastery - Be Happy, Health and Successful</strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><br></strong></p>\n\n<p><strong class=\"redactor-inline-converted\">Do you love your life? Life Mastery is a practical programme designed to help you rocket towards your personal and career goals to achieve total happiness. If you feel like things aren't turning out as you'd dreamed, you want to progress faster, or you're overwhelmed with stress and worry, then this course will CHANGE YOUR LIFE. </strong></p>\n\n<p>Most courses cover either happiness in a vague way, or success from a purely money focused angle, but this programme combines BOTH into one simple route to achieve all your goals as a fully rounded person. It covers everything you need to do: from saying 'No', managing your time, getting promotions, choosing a career, keeping fit, self talk, overcoming fear or guilt, and so so much more. It looks at lots of real life examples and gives practical tools you can use right away to get better results.</p>\n\n<p>Happiness and Success are often seen an elusive or complex, but with this practical course you'll soon master a step by step formula for creating a life you love. Whether you're at the start of your career, wanting a change, feeling frazzled, or just not getting to your goals quickly enough, this course will build essential skills for your career and personal goals.</p>\n\n\n\n<p>Chris Croft is an international speaker, and widely published author, who's been teaching Happiness, Time Management and Assertiveness to companies for over 20 years. This is the first time he's combined all his business and personal experience into a comprehensive happiness and success course. He's taught all over the world, as well as online, and has an entertaining and practical teaching style. This course is guaranteed to keep you engaged and amused, and teach you life changing skills for home and work.</p>\n\n\n\n<p>The course overview includes:</p>\n\n<ul><li>Ridding yourself of stress, guilt, jealousy and anger forever</li><li>Getting promoted and networking like a pro</li><li>Choosing a career you love, for all the right reasons</li><li>Meditation, and what the practical benefits are</li><li>Changing your self talk to create the person you want to be</li><li>Being assertive, not aggressive</li><li>Saying 'No' and choosing happiness</li><li>Getting organised with Time Management</li><li>Setting effective and exciting goals, and then achieving them consistently </li><li>And lots lots more!</li></ul>\n\n\n\n<p>Start building the life of your dreams today and say goodbye to stress, disorganisation and unhappiness. This course WILL change your life.... if you let it!</p>", 
    "end_date": null, 
    "title": "Life Mastery - Be Happy, Healthy and Successful", 
    "price": "30.00", 
    "instructors": "Chris Croft, Louise Croft", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/775932_2ab6_3.jpg", 
    "course_url": "https://www.udemy.com/life-mastery-happy-healthy-successful/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-27T10:39:16Z"
}