{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Life Coaching Course: Online Life Coach Course Training Package</p>\n\n<p>This life coaching course: online life coach training package, covers all aspects of life coaching and so makes it the perfect choice for those people wishing to train as a life coach, as well as those people wishing to set up their own life coaching practice.  Equally though, it is perfect for those who wish to use life coaching as a self development tool, in order to reach one's full potential.</p>\n\n\n\n<p>This life coaching course: online life coach training package, comes with unparalleled support from the course creator, Libby Seery, and she's available 7 days a week.</p>\n\n\n\n\n\n<p>During the life coaching course: online life coach training package, you'll be introduced to many tools and techniques which will equip you with the skills necessary to become an effective communicator, ensuring you get the most from personal and professional relationships.</p>\n\n\n\n\n\n<p>You'll learn how to set goals and how to achieve them with the aid of the SMART and TGROW coaching models.</p>\n\n\n\n\n\n<p>This life coaching course: online life coach training package, provides everything you need as all course materials are included as part of the course, including over forty downloadable resources, all of which are ready for you to upload your own company logo to, and personalise as your own.</p>\n\n\n\n\n\n<p>This life coaching course: online life coach training package, includes:</p>\n\n\n\n\n\n<ul><li>Coaching, Counselling, Consulting and Mentoring</li><li>The Key Responsibilities of a coach</li><li>Listening Skills</li><li>Questioning</li><li>Wheel Of Life</li><li>Albert Mehrabian Model</li><li>Matching and Mirroring</li><li>Clean Language: Its Use In Coaching</li><li>Passive Aggressive Assertive Model of Communication</li><li>How Assertive Are You?</li><li>Feedback</li><li>Administration</li><li>Conclusion</li></ul>\n\n\n\n\n\n<p>We also offer an exclusive support service to Udemy students. On enrolment, you will be given access to a fully supported learning experience which extends to personal support via email with the course creator, Libby Seery. As previously stated, this is a bespoke service available to Udemy students only.</p>\n\n\n\n\n\n<p>The course is self paced and offers you complete flexibility. Choose to study at a time and place that suits you, safe in the knowledge that help is always at hand.</p>", 
    "end_date": null, 
    "title": "Life Coaching Course: Online Life Coach Course Training", 
    "price": "20.00", 
    "instructors": "Libby Seery", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/545678_bd42_2.jpg", 
    "course_url": "https://www.udemy.com/life-coaching-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-05T16:44:51Z"
}