{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t <em style=\"\">&quot;Clarifying my life purpose has allowed me to know myself again and be more joyful and playful. Specifically, my stepmother and I now have a much better relationship after 20+ years of not getting along. My husband and I have taken our relationship to a new level of support and communication. The tools I&#039;ve applied have helped me to come from a place of inner strength and confidence without becoming defensive or taking things personally.</em>&quot; ~ Cheryl Coffey  </p>  <p style=\"\">  \t &quot;<em style=\"\">The Life on Purpose Process has truly been life-changing. Not only did it help me to gain crystal clarity about my life purpose, it helped me to uncover what had been holding me back for much of my life. Through the Process, I became clear about what was the next step that I wanted to take in my life.</em>&quot; ~ Jonathan Dudley from Ireland  </p>  <p style=\"\">  \t The <strong style=\"\">Life On Purpose Process</strong> is a proven, systematic, spiritually-based and practical approach that over the past seventeen years has assisted thousands of people to clarify their life purpose and to then further assist them to design their life as a true and authentic reflection of their purpose. To expand upon this just a bit:  </p>  <ul style=\"\">  \t<li style=\"\"><strong style=\"\">Proven</strong> — Since its conception in the mid-90’s, thousands of people have used the Life On Purpose Process to bring clarity of purpose to their life so we know it works and works well,</li>  \t<li style=\"\"><strong style=\"\">Systematic</strong> — The 6 Passages that make up the Process will guide you step by step—truly a road map to your life on purpose.</li>  \t<li style=\"\"><strong style=\"\">Spiritually Based</strong> — The Life On Purpose Process works with and is consistent with universal spiritual principles found in all authentic spiritual paths, like the law of attraction, the attractive force of universal Love, the power of gratitude and living a grace-filled life, etc. People of many different religions and denominations have experienced the process and received immense value including those whose definition of spiritual didn’t include a belief in a Higher Power necessarily. In the Life On Purpose Process spiritual is defined as a connection to a deeply held set of values and to a purpose beyond one’s self-interest.</li>  \t<li style=\"\"><strong style=\"\">Practical</strong> — Not just theory or esoteric principles, but ideas, distinctions, and tools that you can apply immediately to enhance your experience of daily life.</li>  </ul>  <p style=\"\">  \t <em style=\"\">&quot;I cannot end the year without expressing once again the impact the Life on Purpose Virtual Video Coach had in my life. This process was a defining moment for me and I can confidently declare that I am living each day expressing the best version of myself because I live on purpose.... and when the waters get choppy, I have the tools to sail through them.&quot;</em> Irma T Ruiz of Puerto Rico  </p>  <p style=\"\">  \t The six passages of the Life On Purpose Process include:  </p>  <p style=\"\">  \t <strong style=\"\">1. Preparing for the Journey Along the Purposeful Path</strong>: As with any challenging journey, it’s best to thoroughly prepare yourself for your travels along the Purposeful Path. This includes accurately determining where you are starting from and where you intend to end up, as well as what some of the obstacles that can get in the way of completing the journey. “Purposeful Preparation” is important to a successful journey.  </p>  <p style=\"\">  \t <strong style=\"\">2. Starting on the Correct Path with the Life On Purpose Perspective</strong>:<br style=\"\">  \t As with any journey it makes sense to begin on the path that will get you where you want to go most expediently, so we’ll explore how most people have thought of a life purpose (the Cultural Perspective), and then look in depth at the Life On Purpose Perspective that open a door to a new world of purpose and possibility.  </p>  <p style=\"\">  \t <strong style=\"\">3. Clarifying What Has Been Shaping Your Life – Your Inherited Purpose</strong>:<br style=\"\">  \t Another key passage along the Purposeful Path is clearly identifying what has been shaping your life and keeping you from clarifying and living your true, divinely inspired life purpose. We call this the Inherited Purpose – a powerful force based in fear, lack and a need to struggle to survive that shapes our lives much of the time, especially when we’re unclear about our true purpose. Many who have already traveled along the Purposeful Path feel that identifying their specific and unique Inherited Purpose to be one of the most powerful, transforming parts of the Process.  </p>  <p style=\"\">  \t <strong style=\"\">4. Clarifying &amp; Polishing Your True, Divinely Inspired Purpose</strong>:<br style=\"\">  \t After “cleaning the slate” by identifying and beginning to be responsible for your Inherited Purpose, the real fun begins as you go through a process called “Priming Your Passion” to clarify your true, divinely inspired life purpose. The process can be not only life affirming, but also life transforming. This completes Stage 1 or the clarifying your life purpose stage.  </p>  <p style=\"\">  \t <strong style=\"\">5. Learning the Tools for Living On Purpose</strong>:<br style=\"\">  \t This is the start of Stage 2 of the Process in which you begin to live true to your life purpose. This is where the “rubber meets the road” and where some of the biggest transformations take place as you’re introduced to 15 Power Tools for Living On Purpose. You will use these tools to begin to build your life on purpose.  </p>  <p style=\"\">  \t <strong style=\"\">6. Mastering the Tools for Living On Purpose</strong>:<br style=\"\">  \t Of course, being introduced to a set of tools is just the beginning, especially if you’re interested in building a masterpiece of a life on purpose. In the sixth passage you will learn how to master the art and science of creating a life that is shaped by your true, divinely inspired life purpose.  </p>  <p style=\"\">  \t “<em style=\"\">I had always felt like I was not living up to my potential and that there was something more to life- something more I “should be doing”. What I discovered was that what I thought my life purpose was actually my parents/culture’s idea of what I should be- not mine! This was transformational and allowed me to finally decide for myself, based on my own passions, my true purpose. My Divine Purpose is now conscious and drives all decisions and choices I make in my everyday life</em>.”~ Julie Chapman in Greensboro NC  </p>  <h5 style=\"\">Plus Added Bonuses</h5>  <p style=\"\">  \t Included in the Life On Purpose Course are these special bonuses designed to further enhance your life on purpose:  </p>  <h5 style=\"\"><strong style=\"\">Purposeful Planning: How to Be Sure that All Your Goals &amp; Projects are Divinely Inspired</strong></h5>  <p style=\"\">  \t One of the most powerful ways to bring more purpose and passion in your life is through Purpose Projects Purpose Project will escalate your ability to design your life on purpose. This special report will show you how to be sure how your Purpose Project are Divinely Inspired.  </p>  <h5 style=\"\"><strong style=\"\">The Power of Engagement Bonus Video &amp; PDF Report</strong></h5>  <p style=\"\">  \t We all have the gift of engagement — the ability to engage ourselves and others into the possibility of living on purpose, for example. Yet, for many of us, it’s not well differentiated and therefore we have only limited access to it.  </p>  <h5 style=\"\"><strong style=\"\">Designing Your Encore Performance Bonus Video #2</strong></h5>  <p style=\"\">  \t Have you bought into the ‘Golden Year Fantasy’ that says that once you reach sixty or sixty-five, you’re supposed to retire to some Sun City type retirement community where you and all the other ‘has beens’ spend countless hours playing tennis, golf or shuffle board, only to die quietly in your sleep a few years later? Well, that’s simply not the reality of today.  </p>  <h5 style=\"\">Special Tuition for Udemy Students</h5>  <p style=\"\">  \t Hundreds of people have benefited from the Life On Purpose Process as an online program in the past paying as much as <strong style=\"\">$219</strong>. For a limited time the Life On Purpose Course is available to Udemy student for the introductory special tuition of <strong style=\"\">$149</strong>.  </p>  <p style=\"\">  \t <em style=\"\">I was already familiar with Brad’s work because I reviewed his book <strong style=\"\">Life on Purpose: Six Passages to an Inspired Life</strong> in 2007, and we’ve kept in touch over the years. Life on Purpose is simply the best book on life purpose I’ve ever read, and it deserves the rare honor of maintaining a solid 5-star average rating on Amazon.com. </em>  </p>  <p style=\"\">  \t <em style=\"\">I went through the entire program in May, and I loved it. I had to chuckle at the synchronicity because this was essentially the product I was trying to create. My ideas and processes were different of course, but the end benefits would be the same — to help you bring a clear sense of purpose to your life and to fully ground it in your daily actions, so that you’re truly living on purpose.</em> ~ Personal development expert Steve Pavlina  </p>", 
    "end_date": null, 
    "title": "Life On Purpose: Clarifying & Living Your Inspired Purpose", 
    "price": "25.00", 
    "instructors": "Brad Swift", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/154316_1224_3.jpg", 
    "course_url": "https://www.udemy.com/lifeonpurpose/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-28T22:28:11Z"
}