{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In diesem Kurs behandeln wir alle Aspekte des Life Coachings. Das macht ihn zur perfekten Wahl für alle, die Training als Life Coach erhalten oder mit dem Coaching anderer beginnen möchten. Gleichzeitig eignet sich der Kurs ideal zur persönlichen Weiterentwicklung, um dein volles Potential zu nutzen. </p>  <p>Zusätzlich erhälst du täglich exzellenten Support, unterstützt von der Erstellerin der Inhalte Libby Seery.</p>  <p><strong>A</strong><strong>ls besonderes Extra bekommen alle Udemy Kursteilnehmer ein zusätzliches Zertifikat von Renaissance Life Therapies.</strong></p>  <p>Wir zeigen dir in diesem Kurs viele hilfreiche Techniken und Methoden die dir dabei helfen werden, effektiv zu kommunizieren und das Beste aus deinen persönlichen und professionellen Beziehungen zu machen.</p>  <p>Du lernst, wie man Ziele setzt und sie mithilfe der SMART und TGROW Coaching-Modelle erreicht.</p>  <p>Dieser Kurs beinhaltet alles was du brauchst, inklusive zahlreicher Materialien und mehr als 40 Ressourcen zum Herunterladen. Du musst einfach nur dein eigenes Logo einfügen und sie personalisieren.</p>  <p>Hier ist ein Einblick in die Kursinhalte:</p>  <ul><li>Coaching, Lebensberatung, Consulting und Mentoring</li><li>Die Verantwortungen als Coach</li><li>Die Fähigkeit zuzuhören</li><li>Fragen stellen</li><li>Rad des Lebens</li><li>Albert Mehrabian Modell</li><li>Matching und Mirroring</li><li>Klare Sprache und die Verwendung im Coaching </li><li>Passiv Aggressiv Bestimmt Modell der Kommunikation</li><li>Wie bestimmt bist du?</li><li>Feedback</li><li>Verwaltung</li><li>Fazit</li></ul>                          <p>Wir bieten unseren Udemy Teilnehmern außerdem exklusiven Support. Mit deiner Einschreibung erhälst du vollen Zugriff auf die Lernumgebung einschließlich persönlichem Support über Skype und Email mit der Erstellerin der Kursinhalte Libby Seery*. Dieser Service ist ausschließlich für Udemy Studenten verfügbar.</p>  <p>Du kannst selbst bestimmen, wie schnell du die Kursinhalte behandeln möchtest. Wähle eine Studienzeit und einen Ort nach deinem Belieben, und wir sind für dich da wann immer du Unterstützung brauchst.</p>  <p><em>*Direkte Kommunikation Libby Seeri erfolgt in Englisch. Sehr gern vermitteln wir und übersetzen wir deine Anfrage sowie die Antworten für dich ins Englische bzw. Deutsche!</em></p>", 
    "end_date": null, 
    "title": "Life Coach Training – für eine professionelle Lebensberatung", 
    "price": "20.00", 
    "instructors": "Markus Knopp", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777856_ee91_2.jpg", 
    "course_url": "https://www.udemy.com/life-coach-training-fuer-eine-professionelle-lebensberatung/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T15:33:45Z"
}