{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4></h4>\n\n<p>Are you dissatisfied with your life? Do you think there is something out there better for you but don’t know exactly where to find it?  Do you feel that you have reached a plateau and that you could use some help in extending yourself further? Transforming your life is not easy, but if you are successful at doing so, it is a very rewarding achievement.  Much wisdom is necessary for efficient management of your life; it is hard to keep track of everything and most importantly to remember it all and use it at effectively transforming your life. Have you ever actually tried to? Have you ever listened to motivational speakers, become excited about a world of possibilities, but the next day returned to reality, wondering how to spark this transformation? You must follow a structure that will progressively bring forward the knowledge you need to know at the time you need to know it; a structure of life management and self-empowerment. A structure that will progressively guide you in the steps you must take for the successful transformation of your life. A structure that will involve the effective management of your beliefs, actions, and behaviors.\n\n  </p>\n\n\n\n\n\n\n\n<p>This is exactly what this course is intended to do, provide you with this structure! This course is designed to present you with the knowledge and tools to start the transformation of your life. It will teach you a method that you can apply in serving any area of your life! \n\n  </p>\n\n\n\n\n\n\n\n<h4></h4>\n\n\n\n\n\n\n\n<p>This course is made up of eight parts. In two of these parts, called Method Marks, you are going to learn how to build the structure referred to above. You can apply this structure to any area of your life.\n\n  </p>\n\n\n\n\n\n\n\n<p>The course will then guide you in applying this structure by taking six life transformation steps, called Life Marks, that are related to the <em>Self-Growth</em>, The <em>Physical Environment</em>, and the <em>Health</em> Areas of your life.\n\n  </p>\n\n\n\n\n\n\n\n<p>These steps are:\n\n  </p>\n\n\n\n\n\n\n\n<p>Healing from your past <strong>- Mark 1</strong></p>\n\n\n\n\n\n\n\n<p>Managing your perspective <strong class=\"redactor-inline-converted\">- Mark 2</strong></p>\n\n\n\n\n\n\n\n<p>Controlling your mood <strong class=\"redactor-inline-converted\">- Mark 3</strong></p>\n\n\n\n\n\n\n\n<p>Managing your physical environment <strong class=\"redactor-inline-converted\">- Mark 4</strong></p>\n\n\n\n\n\n\n\n<p>Managing your fitness needs <strong class=\"redactor-inline-converted\">- Mark 5</strong></p>\n\n\n\n\n\n\n\n<p>Managing your nutrition needs<strong class=\"redactor-inline-converted\"> - Mark 6</strong></p>", 
    "end_date": null, 
    "title": "Life Transformation: A Method and Strategy", 
    "price": "20.00", 
    "instructors": "Marc Tabet", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/785650_9868_2.jpg", 
    "course_url": "https://www.udemy.com/life-transformation-a-method-and-strategy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T02:20:47Z"
}