{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Have you dreamt of having a better life than you currently have? If you were given the tools and resources to design your Dream Life, would you?</p><p>Will if feel good to show your loved ones how confident and successful you are, as you step forward and start achieving the dream life you always desired?</p><p>Remember as a kid we pretended we were superheroes. We were policemen and policewomen, we were doctors, we were nurses. Then we grew up and all those dreams of being like our childhood superheroes or our career aspirations were squashed once reality set in.</p><p>What would your life be like if what we pretended as kids actually started becoming true? If you are serious about designing your ideal life, then this is the course for you.</p><p>You are about to embark on a journey of designing your ideal life, mapping out exactly what you want and then crafting an action plan to get you there.</p><p>Look around and see how older people have so many regrets. Regrets of not spending enough time with their family, not traveling enough, not having more money, not working harder to be able to retire easily. Don't let that happen to you. Once you take this course you will have the exact methods many of my clients and friends have used to design a life that most people desire greatly.</p><p>Isn't it time you started designing your Dream Life?</p><p>Enroll in this course today and start on the right path in designing your very own Dream Life!</p>", 
    "end_date": null, 
    "title": "Living Your Dream Life - Creating The Ideal Life For You", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/605400_5d70_3.jpg", 
    "course_url": "https://www.udemy.com/design-dream-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T01:57:09Z"
}