{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">STUDENTS PRAISE COURSE IN REVIEWS:</strong>  </p>  <p>  \t<strong style=\"\"><br style=\"\">  \t</strong>  </p>  <p>  \t<strong style=\"\">If you do the activities in this course, it is powerful. This is “The Secret” on steroids. It is action oriented. You are not just asked to visualize, you are asked to “do.” I love the instructor’s voice. Easy to understand and soothing. I now have a clear vision and will take action to making all my dreams come true. Thank you for allowing me to dream big! </strong>  </p>  <p>  \t<strong style=\"\">Heather, you know who (how) to inspire people and make sure they reach for the best dream possible. Thanks for sharing your wealth of knowledge and look forward to future classes.</strong>  </p>  <p>  \t<strong style=\"\">Good course to get the vision for your life</strong>  </p>  <p>  \t        Just in time for New Year&#039;s Resolutions that you will actually ACCOMPLISH to rock 2015!<br style=\"\">  \t        Wouldn&#039;t you love to  </p>  <p>  \t                wake up every morning  </p>  <ul style=\"\">  \t<li>grateful?</li>  \t<li>focused? </li>  \t<li>smiling?</li>  \t<li>confident?</li>  \t<li>energetic? </li>  \t<li>stress free? </li>  </ul>  <p>  \t            The material is based on the Law of Attraction, and the movie The Secret, but it also covers those other secrets that you have to figure out if just believing and thinking positive have not helped you in the past. I have followed these concepts and worked on them daily for the last three years, and they have turned my life around! They can change your life too.  </p>  <p>  \t            This is the first course in a series that will set you on the road to your Dream Life that you will Love. The course is based on the teachings of Mary Marin Morrissey of the Life Mastery institute. I am a Certified Dream Builder Coach, taught by Mary herself over the past three years. I also am working on my doctorate in higher education, and have taught adults for over 30 years..  </p>  <p>  \t                             Are you at a crossroads in your life because you have just graduated? or got divorced? or are having financial hardship? or decided on a new career? or retired? Now is when you need to create a clear vision of what the life you would love would look like, so you know what direction to go in to get there. After all, as the Cheshire Cat said in &quot;Alice in Wonderland&quot;, if you don&#039;t know where you are going, any road will get you there.  </p>  <p>  \t                             If you follow along with me in all the lessons and really think through and feel the emotions related to the exercises, I guarantee you will move ahead towards a life you love.  </p>  <p>  \t                             The course has over 12 Lectures and covers about an hour, but your exercises and thinking will take you at least another hour of your time if you give the effort you need.  The content of the course includes your searching for your purpose in life (your why am I here?) your vision (what would I love?) a start on overcoming your fears and paradigms (current conditions) that stop fo from living the life you love, a background on Transformational Philosophies that much of this material is based on, and building a belief that your dream can emerge from within you and become reality.  </p>  <p>  \t              You have a complete 30 day money back guarantee, so there is no risk in investing in your future...  </p>  <p>  \t                       Enroll in this course and take the first steps towards happiness. You will feel a difference in your heart. I guarantee it!  </p>", 
    "end_date": null, 
    "title": "Love Your Life - Why Settle? Be Happy - Dream Builder Course", 
    "price": "40.00", 
    "instructors": "Heather F Edgington", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/342982_ad67_7.jpg", 
    "course_url": "https://www.udemy.com/love-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T12:53:24Z"
}