{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This <strong class=\"redactor-inline-converted\">audio only</strong><strong> course</strong>, which is taught by Marianne Williamson and Andrew Harvey, will show you how to let your heart guide your life</p>\n\n\n\n<p>Marianne Williamson is a lecturer, spiritual teacher, and the author of New York Times bestsellers, including <em class=\"redactor-inline-converted\">Meditations for a Miraculous Life</em> and <em class=\"redactor-inline-converted\">A Return to Love</em>.</p>\n\n\n\n\n\n\n\n\n\n<p>Andrew Harvey is a mystic, teacher, writer, and poet who has taught at Hobart College, the California Institute of Integral Studies, and Cornell University. He is the author of several books, including his latest, <em>The Direct Path</em>.</p>\n\n\n\n\n\n\n\n\n\n<p>Throughout this program, you’ll discover, embrace, and embody love, which is the greatest power and the supreme mystery of the universe.</p>\n\n\n\n\n\n\n\n\n\n<p>Beyond that, you’ll know how to put love into sacred action, and you’ll connect with your divine nature so you can make choices based on love.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Embrace Universal Love Within Yourself &amp; Share It With Others</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Discover everything you should know about love and its shadow</li><li>Understand what sacred activism is, and how you can pursue it</li><li>Practice living love, and put love in action</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>Allow Love to Guide Your Decisions &amp; Change the World for the Better</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Society often pushes people towards making decisions that are based upon fear, aggression, fundamentalism, and tribalism.</p>\n\n\n\n\n\n\n\n\n\n<p>To overcome this, you must learn how to ground yourself in the experience of universal love, and then express that love through justice and compassion.</p>\n\n\n\n\n\n\n\n\n\n<p>This course is filled with insights, practices, prayers, and meditations that will help you transform yourself, fully experience love in all of its forms, and create a life led by love.</p>\n\n\n\n\n\n\n\n\n\n<p>Williamson and Harvey will explore the nature of universal love so you can discover this love within yourself and encourage it in those around you.</p>\n\n\n\n\n\n\n\n\n\n<p>You’ll heal past wounds, nurture self-compassion, awaken your creativity, find clarity and empathy, and enrich your relationships while inviting abundance into your life.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Contents and Overview</strong></p>\n\n\n\n\n\n\n\n<p>You’ll begin this audio course with Andrew Harvey, who will take you through the great mystery of love, stories of divine love, and a guided practice and meditation to set off on the path of love.</p>\n\n\n\n\n\n\n\n\n\n<p>Marianne Williamson will then guide you through what love can do, and the fact that your true self is love. You’ll continue moving through practices and meditations to start diving further into how to embody love.</p>\n\n\n\n\n\n\n\n\n\n<p>Harvey will explain love and the shadows of the mind, heart, and body so that you can learn how to work with your shadows and turn your body into one of divine love.</p>\n\n\n\n\n\n\n\n\n\n<p>Once you understand love within yourself, you’ll learn how to express it in your relationships, as well as creatively, with your money, and in difficult situations.</p>\n\n\n\n\n\n\n\n\n\n<p>After removing barriers to love, you’ll be able to put love into action in every aspect of your life. This will help you evolve your own consciousness and move towards enlightenment.</p>\n\n\n\n\n\n\n\n\n\n<p>By the time you complete this audio course, you’ll know not only how to embody love within your body and mind, but also how to use sacred activism to share that love with the world.</p>\n\n\n\n\n\n\n\n\n\n<p>You’ll bring about positive changes in your own life and the lives of others by infusing love into all that you do and everyone you meet.</p>", 
    "end_date": null, 
    "title": "Love's Manifesto: Let Your Heart Lead the Way (Audio Only)", 
    "price": "50.00", 
    "instructors": "Sounds True, Marianne Williamson, Andrew Harvey", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848680_bc84.jpg", 
    "course_url": "https://www.udemy.com/marianne-williamson-audio-only/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T00:40:42Z"
}