{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tWhat if I could teach you to fly?  </p>  <p>  \tWhat if I could teach you to summon invisible objects?  </p>  <p>  \tWhat if I could teach you to create worlds &amp; control your entire reality?  </p>  <p>  \tMost people waste 1/3 of their entire life ignoring their sleep completely when this is one of the deepest and most potent opportunities to explore your mind while having direct benefits on your real life with practical applications such as:  </p>  <ol style=\"\">  \t<li><strong style=\"\">Doubling Your Confidence</strong> for stressful situations or even dates with &quot;Lucid Dream Mock Rehearsals&quot;</li>  \t<li><strong style=\"\">Improving Language Skills</strong> by practicing - I used this while learning Russian in my dream with &quot;babushkas and black bears in deep Siberia&quot;</li>  \t<li><strong style=\"\">Preparing for Job Interviews</strong> by running through questions and feeling the realness of the stress during your lucid dream</li>  \t<li><strong style=\"\">Envisioning Conducting Difficult Presentations</strong> so you can feel more confident during the real thing</li>  </ol>  <p>  \t<strong style=\"\">Who is Sam &amp; Why Should You Learn Lucid Dreaming from Me?</strong>  </p>  <p>  \tI&#039;m Sam and I want to welcome you to my Lucid Dreaming Course where I&#039;m going to teach you how to trigger inception as early as tonight!  </p>  <p>  \tI&#039;ve been lucid dreaming for the past 3 years…  </p>  <p>  \tI&#039;ve experimented with various supplements and &quot;sleeping aids&quot; such as tracking apps and fitness bands so I can teach you the coolest tips, tricks and strategies for you to get the most out of your sleep.  </p>  <p>  \t<strong style=\"\">The Lucid Dreaming Journey</strong>  </p>  <p>  \tI&#039;m going to take you through 3 parts that will completely revolutionize this one third of your life that most people completely ignore.  </p>  <ol style=\"\">  \t<li><strong style=\"\">Part 1: The Practical Benefits of Lucid Dreaming:</strong> We&#039;ll go into the fundamentals of Lucid Dreams exploring the direct benefits such as enriching your relationships, improving your language skills and doubling your confidence through Lucid Dreams</li>  \t<li><strong style=\"\">Part 2: The &quot;Pre-Sleep&quot; Mental State -</strong> We&#039;ll dive into preparing you for Lucid Dreams including secret equipment and supplements you can take and the #1 tip to induce dreams</li>  \t<li><strong style=\"\">Part 3: Triggering Inception Through Induction -</strong> We&#039;ll cover &quot;inception-style&quot; induction techniques so you can start lucid dreaming as soon as tonight.</li>  </ol>  <p>  \tPlus you&#039;ll get <strong style=\"\">5 bonuses</strong> such as:  </p>  <ol style=\"\">  \t<li>Your own <strong style=\"\">Dream Journal</strong></li>  \t<li>A list of the <strong style=\"\">Top 10 Reality Checks</strong></li>  \t<li><strong style=\"\">The Secret Equipment &amp; Supplements List</strong> for super wild &amp; crazy dreams</li>  \t<li><strong style=\"\">Top Mantras for Self-Hypnotizing Lucidity</strong></li>  \t<li><strong style=\"\">Additional Bonus Lectures</strong> to continually expand your dream state</li>  </ol>  <p>  \tIt&#039;s risk free with a money back guarantee but once I take you through the induction stage I&#039;ll make you completely forget about ever getting a refund.  </p>  <p>  \tEnroll in the Lucid Dreaming course today and I&#039;ll see you in a few seconds.<br style=\"\">  \tSweet dreams!  </p>", 
    "end_date": null, 
    "title": "Lucid Dreaming: How to Trigger Inception in Your Sleep", 
    "price": "20.00", 
    "instructors": "Richard Korbut, Samuel McCulloch", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430052_cf5e_2.jpg", 
    "course_url": "https://www.udemy.com/lucid-dreaming-sleep-hacking-dream-inception/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T16:20:23Z"
}