{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>You want to control your dreams? You want to have your first lucid dream? You have already tried lucid dreaming but had no success?</p>  <p>Lucid dreaming enables you to control your own dreams and do whatever you want. Lucid dreaming is fun and simply awesome. Anybody can learn to have lucid dreams.</p>  <p>In this course I will teach you how you can have lucid dreams with the help of the DILD technique.</p>  <p>DILD is a powerful and easy to implement lucid dreaming technique. I had my first lucid dream within 14 days using the DILD method. You can do the same!</p>  <p>Enroll now and learn in this course:</p>  <p>The basics of DILD. How can you increase your dream recall. How you can increase your dream awareness. How you can achieve lucid dreams fast with the DILD technique.</p>  <p>As always 30 days refund is applicable.</p>  <p>What are you waiting for? Learn lucid dreaming fast with the DILD technique!</p><p>I am an experienced lucid dreamer for many years.<br> Lucid dreaming is a wonderful habit which allows you to fill your life with fantastic dream memories. You can explore your own world every night and be a superhero. You can transform into animals or have amazing lucid dreaming sex with celebrities. There are no limitations existing in the dream world. This world belongs to you and you can visit this world every night.</p><p>Everybody has the possibility to learn how to lucid dream as this is a natural gift. <br> Unfortunately mass media, schools, universities do not communicate this awesome topic.<br> Thus not many people are actually aware that such a wonderful thing named lucid dreaming exists.<br> Luckily you have now found a course that will teach you step-by-step how you can learn to have lucid dreams fast and easily. <br> <br> Do not waste your precious dream time anymore and learn to lucid dream.</p>", 
    "end_date": null, 
    "title": "Lucid Dreaming the Easy Way with the DILD technique", 
    "price": "20.00", 
    "instructors": "Klartraum King", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/722946_8395_2.jpg", 
    "course_url": "https://www.udemy.com/lucid-dreaming-with-the-dild-technique/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-10T17:50:17Z"
}