{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">If you want to manifest massive wealth, better health and improved relationships you need to understand that manifesting is an<em style=\"\"> inside job</em>. You simply cannot manifest amazing things in life if the vibes that you are giving off are <strong style=\"\">all out of whack</strong>. </p><p style=\"\">In this course you learn how to master the art of Quantum Manifesting to create everything you want in life as if by magic!</p><p style=\"\">This is a 6 week course structured into easy to follow steps. </p><p style=\"\">In step one you learn how to use Quantum Energy Healing to clear out your energetic blocks &amp; negative belief systems that have been hindering you from manifesting the life that you have been striving for. </p><p style=\"\">In Step Two, we focus on Quantum Energy Reprogramming to reprogram your Quantum Field with new healthy beliefs that are in alignment with everything that you wish to create in your life. </p><p style=\"\">In Step Three you learn two ancient magical manifesting meditations (which use sound, mantra, and the sacred I AM THAT I AM  miracle frequency embedded into the meditation music) that literally transforms energy into matter creating ANYTHING that your heart desires. </p><p style=\"\">Included in this course are the following:</p><p style=\"\">-an easy to follow schedule</p><p style=\"\">-step by step instructional videos</p><p style=\"\">-downloadable subliminal mp3s</p><p style=\"\">-special sound meditations encoded with the miracle I AM frequency </p><p style=\"\">-a guided meditation to teach you how to tap into the power of your heart</p><p style=\"\">What if you realized that you really did have the power to create the life that you&#039;ve been dreaming of? This course will blow the roof off of what you always thought was possible and blast you to the next level! In this course I will show you how to create a life you love AND your heart&#039;s desire - with power and velocity; creating more joy and fulfillment in your life than you ever thought possible. Get ready to up-level your life to infinity and beyond!</p><p style=\"\"><strong style=\"\">Stop sitting back watching everyone else manifest all the things you desire. Take control of your life &amp; start manifesting the life of your dreams today!</strong></p>", 
    "end_date": null, 
    "title": "Magical Manifesting ", 
    "price": "50.00", 
    "instructors": "Shannon Terry", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/495530_b6e8_3.jpg", 
    "course_url": "https://www.udemy.com/magicalmanifesting/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T00:11:58Z"
}