{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em style=\"\">A Certificate of Completion will be provided to all students after completing this course.</em>  </p>  <p>  \t<strong style=\"\">Why should you become a student?   </strong>  </p>  <p>  \tto directly apply a world renowned test and identify your personality(Fortune 500 companies use DISC to screen their employees for specific hiring traits)  </p>  <p>  \tto access a practical tool that has real world applications in:  </p>  <p>  \tinfluencing and motivating others  </p>  <p>  \twinning friends  </p>  <p>  \timproving relationships (you will understand your spouse&#039;s secret language especially when she looks strange at you and says the ubiquitous “nothing&quot; or when he is hyper aggressive with his own quality time)  </p>  <p>  \tto apply an experiential, step-by-step, action plan specifically designed toDISCover your strengths and tackle your weaknesses  </p>  <p>  \tit&#039;s targeted to students that want to get hired  </p>  <p>  \t and to the business people that do the hiring  </p>  <p>  \tbecause it helps you understand what your prospective employer or employee wants from you, how he thinks and why he acts and reacts the way he does  </p>  <p>  \tthe course features content specific to leadership, sales, relationships and more; it&#039;s a holistic course with applications in your everyday life. ______________________________________________________________  </p>  <p>  \t<strong style=\"\">Do you want a successful career?</strong>  </p>  <p>  \tExcellent communication skills?  </p>  <p>  \tA deeper knowledge of what makes you … you?  </p>  <p>  \t And all of this packaged in a comprehensive, step-by-step, action-by-action course?  </p>  <p>  \tThen enroll now! and get the skills that bring the ideal !  </p>  <p>  \tTrust me. actually don&#039;t trust me, I&#039;ll prove it to you!  </p>  <p>  \t<strong style=\"\">Take advantage of the 30-day money back guarantee and try it out. If, for any reason, you aren&#039;t satisfied, you can request a full refund within those 30 days.</strong>     ____________________________________________________________________  </p>", 
    "end_date": null, 
    "title": "Make your career with best personality", 
    "price": "20.00", 
    "instructors": "Yara Choudhary", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399052_85fa_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-improve-your-personality/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T12:30:57Z"
}