{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tThis is a video based course that takes less than an hour to watch, but  will take much longer to fully do the work in the Student Course Guide.  </p>  <p>  \tThis course provides the student an in-depth plan for managing grief during the Holidays. It is full of practical, hands on, and functional exercises and activities. There is a lengthy Student Course Guide that is a workbook of sorts. It is lengthy, (about 30 pages) but full of questions that will help the student as he/she creates a practical plan to embrace the holiday season with hope instead of being paralyzed by grief.  </p>  <p>  \t Printable forms are included for the student to be able to indefinitely use them to assist him/her as he/she dissects every part of their Holiday into smaller parts that will allow them to manage the difficult areas as opposed to floundering through the holidays with a series of actions and reactions that are completely controlled by grief.  </p>  <p>  \t    This course is not designed for the student to tackle each task in one sitting. Grief simply will not allow that. Choose one or two tasks from this course and incorporate those until you are strong enough or ready to incorporate more. Please take note...the workbook is over 30 pages that will need to be printed. There are also &quot;Planning Sheets&quot; that will need to be printed and can be used every holiday season as you manage grief during the Holidays.  You will also have lifetime access to this course and the information it contains.  </p>  <p>  \tTammy McDonald is the instructor and she is a Certified Life Coach with specialty training in Grief and Loss. She develops training programs, speaks to groups, and serves clients through one on one coaching sessions in person or via Skype. She is also a published Author.  </p>", 
    "end_date": null, 
    "title": "Managing Grief during the Holidays: Gaining the gift of Hope", 
    "price": "40.00", 
    "instructors": "Ms. Tammy McDonald", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/340630_f89e_2.jpg", 
    "course_url": "https://www.udemy.com/managing-grief-during-the-holidays-gaining-the-gift-of-hope/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-10T15:58:07Z"
}