{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' Manifest Anything By Removing 5 Negative Blocks' By Pradeep Aggarwal you will learn -</p><p><span></span></p><p>How to manifest anything you want in life by removing the 5 negative blocks that hold you back. And you will also learn the correct way of manifesting your desires so that you achieve your goals successfully and accelerate the law of attraction and manifestation in your life.</p><p>You will learn the beliefs that block your imagination and hold you back. You will learn how your beliefs play an important role in your life and manifestation.</p><p><span></span></p><p>In this lesson, you will learn how to identify if you have negative blocks or not by challenging your beliefs with the powerful “Questions”. By asking yourself these 3 questions you will be able to identify if you have negative blocks that hold you back and stop your manifestation. </p>You will also learn how to relax and anchor confidence feeling in your life and different situations where it is required .<p>it is ideal for everyone who want to grow in life and achieve their desired goals in life by removing their negative beliefs and blocks from their mind.</p><p>This course is in English with more than 30 minutes of live recorded content through 8 lectures and 2 bonus E-books.</p><br>", 
    "end_date": null, 
    "title": "Manifest Anything By  Removing 5 Negative Blocks", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/681324_96d8.jpg", 
    "course_url": "https://www.udemy.com/manifest-anything-by-removing-5-negative-blocks/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-26T08:04:10Z"
}