{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you know you were put on this planet to do something <strong><em>remarkable</em></strong> with your life, yet struggle to implement and execute your magnificence on a daily basis?</p>\n\n<p>Do you find yourself overwhelmed by all the conflicting messages on how to truly live your life purpose? Do you have fear or self-doubt about making that leap from doing what you HAVE to do and SHOULD do to truly doing what you LOVE to do each day?</p>\n\n<p><em class=\"redactor-inline-converted\">Master Your Life Purpose</em> is the culmination of over 10 years research into exceptional human beings. Based on my <em class=\"redactor-inline-converted\">Exceptional Life Blueprint</em> program, <em class=\"redactor-inline-converted\">Master Your Life Purpose</em> takes 10 simple yet powerful principles to help you - </p>\n\n<p>IDENTIFY what you were born to do</p>\n\n<p>CLARIFY why you were born to do it</p>\n\n<p>Help you generate CONFIDENCE that you will live your exceptional life</p>\n\n<p>The course is delivered through video lectures, with worksheets accompanying each step. Each lecture has been delivered in 10 minutes or less to make it easy to complete wherever, whenever and however you like. </p>\n\n<p>If you truly are committed to making the rest of your life the best of your life, I have no doubt you will absolutely love <em class=\"redactor-inline-converted\">Master Your Life Purpose. </em></p>", 
    "end_date": null, 
    "title": "Master Your Life Purpose", 
    "price": "30.00", 
    "instructors": "Marcus Pearce", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/853828_2c1a_4.jpg", 
    "course_url": "https://www.udemy.com/master-your-life-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-19T08:38:39Z"
}