{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Discover the NeuroCognitive and Behavioral Approach. Learn how 4 brainstructures run our lives and how to take control<br></p>\n\n\n\n<p>  \t      The NBA (or <em>Neurocognitive and Behavioral Approach</em>) is a fascinating, innovative and multi-disciplinary approach born out of 25 years of scientific research. It combines the fields of neurosciences, social psychology, behavioral sciences and many more to come up with one overlaying, comprehensive theory which gives unique insights in our complex human nature. It was originally developed by the French scientist J. Fradin.  </p>\n\n\n\n\n\n<p>  \t      As the director of the <em>I</em><em>nstitute of Neurocognitivism </em>I had the chance to work with Dr Fradin and become an expert in his groundbreaking approach. I've developed this course as to make his work accessible to all, regardless of background or prior knowledge. I'm much more a communicator than a scientist myself. And that's exactly my contribution to his work: explaining complex matters in a comprehensive and entertaining way.  </p>\n\n\n\n\n\n<p>  \t<strong>Over 5000 students enrolled. Raving 5 star reviews:</strong>  </p>\n\n\n\n\n\n<p>  \t<em>\"...Every lecture is packed with information that is presented very clearly. The lectures offer both insight and techniques to improve personal development.\"</em>  </p>\n\n\n\n\n\n<p>  \t<em>“...quality is top. It was a joy to watch this course. Recommended.\"</em>  </p>\n\n\n\n\n\n<p>  \t<em>“... the best part about the course is its intention to disseminate how you can benefit from applying the knowledge learned in real life situations, not just learning the information for learning's sake. Highly recommended!\"</em>  </p>\n\n\n\n\n\n<p>  \t<strong>Last updated: March 2016</strong></p>\n\n\n\n\n\n<p>  \t                                This course is so much more than a pile of recorded lectures. It's really almost a living, breathing entity, a work in progress, that continues to evolve over time. What to expect:  </p>\n\n\n\n\n\n<ul>  \t<li>30 day full money back guarantee, no questions asked</li>  \t<li>High instructor availability: I answer any questions you may have in a short time frame. I always answer within 24 hours, but usually much faster than that.</li><li> Weekly educational announcements, mostly blog posts, on how our brain works and its impact in our daily life. This is brand new content, exciting insights, that I'll be sending your way on a weekly basis</li>  \t<li>Based on student's questions, I'll be adding new content on a regular basis</li>  \t<li>The content stays up to date, based on new scientific research and studies</li>  \t<li>Tools and insights for personal development and authentic relationships</li>  </ul>\n\n\n\n\n\n<p>  \t                                Expect to develop a revolutionary new framework, based on our active brain structure. Look at the world with new eyes and recognize the underlying patterns that govern our lives and that of those around us. Expect exercises, homework, putting theory into practice in a fun and entertaining way. You will also gain access to our Facebook group where you will be able to exchange your experiences with the NBA and learn from others as well.  </p>\n\n\n\n\n\n<p><strong>BONUS</strong><br></p>\n\n\n\n\n\n<p>Oh, and I almost forgot to mention. Once you complete this course, you get access to another one of my courses (on stress management), completely for free. There's no catch, nothing else to do than complete this one. So you end up with 2 courses for the price of one.</p>\n\n\n\n\n\n<p>So what are you waiting for? Join now!  </p>", 
    "end_date": null, 
    "title": "Master your brain: Neuroscience for personal development", 
    "price": "30.00", 
    "instructors": "Gregory Caremans", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/277654_7a46_6.jpg", 
    "course_url": "https://www.udemy.com/my-brain-and-i/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-09T08:47:35Z"
}