{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Updated 12 February 2016</em></strong></p><p><em>NEW BONUS LECTURE added:</em></p><p><strong><em>20 Keys To Aligning With The Shift</em></strong></p><p>**************</p><p>The study and development mastery as a way of life is for those who are keen to go beyond the limitations of popular, intellectual spirituality, and work towards achieving ascension status in a meaningful and practical way - both for themselves, and for the planet.</p><p>This <em>introductory course</em> presents a selection of basic concepts and considerations that are fundamental to developing mastery as a way of life.<br></p><p><strong>**NB: as a free introductory course, it is intended to provide a general overview of Mastery <em>as a concept</em>. It is not intended to be in-depth and comprehensive.</strong></p><p><strong>The Premise</strong></p><p>Humanity has stepped into a brand new paradigm (post-2012) that supports the development of mastery as a way of life.</p><p>In this new paradigm, any and all attempts to carry forth beliefs, habits and assumptions rooted in the energies of the old, declining paradigm are being met with increased resistance and disruption, manifesting as an increased incidence of personal conflict, drama, struggle and rapid decline in overall well-being.</p><p><strong>The normal, fear-based conditioning and unconscious reactionary tendencies that have dominated human activity in the old paradigm are incompatible with this emerging<em> </em>new<em> Paradigm of Mastery</em>.</strong></p><p>Learn and align with the energies of the new paradigm, and apply them in your living reality, and you can expect to thrive.</p><p>Hold on to the many layers of unconscious conditioning that all humans have to varying degrees, and increasingly you will struggle - financially, in your relationships, and in your overall health and well-being.</p><p><strong>The Objective</strong></p><p>The objective of this introductory course is to identify for the viewer the opportunity to make the shift, and to prepare the viewer for continued study and learning of more advanced concepts and applications.<span></span></p><p><em><strong>GET INVOLVED IN THE DISCUSSION</strong></em><br></p><p><em><strong>You are encouraged to be an active participant in this course. </strong></em></p><p><em>Ask questions. </em></p><p><em>Read and comment on the the discussion topics and on questions from others. </em></p><p><em>Look for on-going announcements and additional resources.</em></p><p><em>The more involved you are, the more valuable this learning experience will be.</em></p><p><em><strong>*********</strong></em></p><em><p><em></em></p><p><strong>Be sure to download all resources and training materials in the last part of this course.</strong></p></em>", 
    "end_date": null, 
    "title": "Masterful Living: A New Beginning", 
    "price": 0, 
    "instructors": "Elio-David Di Iorio B.A.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/200838_3321_4.jpg", 
    "course_url": "https://www.udemy.com/masterful-living-a-new-beginning/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-17T19:14:12Z"
}