{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What's Coming in 2016:</strong></p><p><strong>As of 1/23/2016 I've changed the title of this course to include stress-reducing job seeking techniques. Stay tuned for additional lectures at no charge.<br></strong></p><p><strong><strong>About this Course:</strong></strong><br></p><p><strong>Relax, rejoice and rejuvenate. </strong>If you want to facilitate YOUR DISCOVERY of different aspects of meditation, yoga and easy-to-implement relaxation and rejuvenation techniques, this course is for you.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p><p><em>5-Star Review by Charles King:<br><strong>Some pretty cool stuff</strong> I was impressed with the way that affirmations were read with three different types of emphasis--that's new to me, and I like the idea of playing a video while I do other things in different windows.</em><br>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - <br></p><p>Each person is unique, so<strong> I have made many of the lectures and videos available for a free preview, and I encourage you to view them and decide if this course is right for you.</strong><br></p><p>Unlike most courses,<em> this course does not expect you to watch every video (lecture.) </em>I've gone out of my way to provide a wide variety of resources for different types of people.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -</p><p>5-Star Review by Samir Ganich</p><p><strong>Great!</strong> Very inspirational and helpful, life changing stuff. Thank you for your brilliant work, Alan! </p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p><p><strong>Take this course if you want to feel more balanced,</strong> or if you want to learn or improve your yoga and meditation skills.</p><p>There are many different types of meditation videos, with a wide variety of music--Bollywood, flute, spiritual, classical, rap, guitar, and more.</p><p>The 70 yoga instructional videos range from 1 to 2 minutes, and if you put them on autoplay, you can use them to do a yoga practice or meditation. </p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p><p>5-Star Review by Vanessa Davilla</p><p><strong>I've gone through the first 11 lessons and feel great</strong> I like the way that this course encourages me to think about what's important to me. I already wrote an affirmation and uploaded it with a favorite photo.</p><p>- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - </p><p>This course includes three of my books. The books alone cost $60 or more. They allow you to delve deeper, on your schedule.</p><p>This course is being expanded, and you'll have lifetime access to it.</p><p>I make you this promise. If you don't find what you are seeking in this course, open a discussion item and tell me what you want. As long as it does not violate someone's copyright rights, I'll make every effort to add that material.</p><p>Alan</p><p><strong>P.S. Join now while the introductory price is in effect.</strong></p>", 
    "end_date": null, 
    "title": "Meditation Plus", 
    "price": "20.00", 
    "instructors": "Alan H. Jordan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564408_60e3_7.jpg", 
    "course_url": "https://www.udemy.com/yoga-meditation-affirmations-gratitude-integrated-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T13:45:39Z"
}