{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>~Just $10 Until April 4th~</strong></p><p>Udemy is about to change it's pricing structure at which point this course will only be available for existing members and it will no longer be available for purchase</p><p>Like many, I strongly disagree with Udemy forcing us to assign arbitrary prices because they have saturated their market with coupons and discounts. For that reason this course will be taken down as soon as the new rules move into effect.</p><p>As always, I will continue to support this course and answer questions from students in it even though I am parting from Udemy.</p><p>---</p><p>purchase. Give Me 15 Days And I’ll Give You The <strong>Rock-Solid Fundamentals Of Successfully Meeting And Attracting Women</strong>…<br></p>  <p>\t<strong></strong>  </p>  <p>\t<strong>Here’s what this is all about:</strong>  </p>  <p>\t If you’d like to rapidly increase the quality and quantity of women in your life in the next 30 days and more, here is some good news.</p>  <p>\t<strong> I’m Not Gonna Sell You A <em>Magic Pill</em>! </strong>  </p>  <p>\tIf you’re looking for a “magic pill” product to just send women into your bed without you lifting a finger, pushing your personal boundaries and taking serious, consistent action, <em>stop reading this page right now</em>.</p>  <p>\t I’m not going to “hype” you that EVERYBODY will instantly become a rockstar with the ladies by just buying a product- Life isn’t that simple</p>  <p>\t You can have a great life with women… <em>But that’s up to you to make happen.</em>  </p>  <p>\t There are shortcuts, of course – but you gotta take action and work hard to create what you want with women!</p>  <p>\t If you don’t have the persistence and drive to apply what I’m going to teach you – you ain’t gonna get any results.</p>  <p>\t<em>It’s that simple.</em>  </p>  <p>\t With that said and done…</p>  <p>\t<strong> Here’s The Story About How I Transformed From A Lonely Loser Into A Hit With The Ladies </strong>  </p>  <p>\t My name is David Crowther, and just a few years ago, I was your typical loser with the ladies.</p>  <p>\t You see, I grew up with a family that would move around every couple of months, which led to me becoming incredibly introverted as time passed by. (Some kids get really extroverted from such a situation, but I wasn’t as lucky)</p>  <p>\t<em>I was so shy I couldn’t even look a girl in the eye!</em>  </p>  <p>\t Even if I knew she liked me, I was so dreadfully shy that I couldn’t connect with any women at all, in fact… <em>I even had trouble making guy friends!</em>  </p>  <p>\t Safe to say, I didn’t start out this journey easy.</p>  <p>\t When I look back on it now I laugh, because I’ve got an amazing relationship with my girlfriend and I’m now a successful coach teaching hundreds of men worldwide for over half a decade…</p>  <p>\t But back then, <em>boy was learning to meet and attract women terribly tough!</em>  </p>  <p>\t Some days I’d meet this girl and things would actually go incredibly well… some days I’d be rooted to the ground in bone-chilling approach anxiety, cold bullets of sweat dripping down my foreheaed… <em>and I wouldn’t approach a girl even if you gave me a thousand bucks!</em>  </p>  <p>\t So how did I engineer such a transformation?</p>  <p>\t<br>\t<strong> The answer is simple:</strong> <em>Tons of painful trial and effort and hustle. </em>  </p>  <p>\t<em>(Don't worry, it’s not gonna be that tough for you)</em>  </p>  <p>\t<br>\t<strong>Here’s why:</strong>  </p>  <p>\t After my years as a successful dating coach, I’ve boiled down the fundamentals of how to successfully meet and attract women into a short online course <em>any man</em> can take and use to create significant change in his dating life… if only <em>he takes action on what he learns.</em>  </p>  <p>\t<strong>So here’s the deal:</strong>  </p>  <p>\t I’d like to help you shortcut the painful years of stumbling in the dark that I had in order to achieve success with women.</p>  <p>\t How?</p>  <p>\t<em>Introducing…</em>  </p>  <p>\t<strong><u>The Attraction Mastery Course</u></strong>  </p>  <p>\t The groundbreaking fundamentals of how to meet and attract your ideal women, <em>delivered to you on a silver platter.</em> Every little secret of attraction I’ve discovered over hundreds of satisfied clients and my own personal journey, <em>revealed for you to cherry-pick to create your ideal dating and sex life.</em>  </p>  <p>\t<strong></strong>  </p>  <p>\t<strong>Here’s just a sneak peek of what you’ll learn in the 15 day course:</strong>  </p>  <p>\t ·3 secrets of attraction that'll allow you to trump over any kind of \"looks, money, status\" limitations and have a girl locked in, fascinated with who you are and wanting to know more - Day 2, 3 Secrets of Attraction</p>  <p>\t ·<strong>The classic body language mistakes that instantly telegraph to girls that you're a bore and shouldn't be touched with a 10 feet stick (and the simple tweaks that have her opening up to you) - day 2, body language 101</strong>  </p>  <p>\t ·The mindset that allows you to socially develop in WEEKS, not YEARS - day 3, Rapid Social Development</p>  <p>\t ·<strong>My personal 3 best conversational maps that turn the iciest of queens into doe-eyed, aroused, giggling girls - day 3, Game Plan</strong>  </p>  <p>\t ·The top 5 biggest reasons (read: EXCUSES) why men fail to approach and meet the women of their dreams (<em>and how to nix them in the bud before it's too late!) </em>- day 4</p>  <p>\t<strong></strong>  </p>  <p>\t ·<strong>Why rejection simply <em>doesn't exist</em>. (understand this and you'll approach anxiety will hurt you no more)- module 4 4</strong>  </p>  <p>\t ·The 9 month, 4 nights a week mistake that left me with no numbers and no dates despite approaching like a horny jackrabbit (and the exact steps to avoid it!) - day 4, My 9 Month Mistake</p>  <p>\t ·<strong>The subtle signs that let you know when to persist and when to stop (doing this wrong will turn you into that <em>creepy guy at the bar who doesn’t know when to stop!) - </em>day 5, What is Interest?</strong>  </p>  <p>\t ·What you MUST do in the first crucial seconds of any interaction with women to set a frame that makes every step from then on 10 times easier (get this wrong, and you're making it THAT much harder for yourself) - day 5, Leading &amp; Framing</p>  <p>\t ·<strong>Logistics 101: The best places for you to meet women, while skyrocketing your progress with every approach you make (this is so you can learn from your mistakes quickly and get on the right track fast!) - day 6- Where to Meet Women</strong>  </p>  <p>\t ·Why nightclubs aren’t the best place to meet and attract women, <em>contrary to popular belief.</em> - day 6</p>  <p>\t ·<strong>8 simple \"no-brainer\" steps to locking in attraction with practically any hottie you meet </strong><em>(even if she's surrounded by bitchy friends!)</em> - day 7</p>  <p>\t In 7 days, you'll learn the fundamentals of meeting and attracting women <strong>tested in the seduction front lines </strong>to make your transformation into a sexier, seductive man as easy as going down a greased slide.</p>  <p>\t But We’re Just Getting Started…</p>  <p>\t …Because in the last 8 days, you'll learn just a few more <strong>crucial </strong>pieces of information to help you master this area of your life:</p>  <p>\t<strong>Here's just a sneak peek of what you’re getting:</strong>  </p>  <ul>\t<li>·3 simple things a man can do to lock in his progress while blasting him to the next level - day 8</li>\t<li>·<strong>How to baby step your way to success with women with zero information overload or overwhelm (it's dead-simple, but it'll trigger a landslide of success if you keep at it) - day 9</strong></li>\t<li>·Do this when a girl starts shit testing you or her friends start being bitchy and instead of plummeting down, her attraction for you will spike - day 9, Contingencies &amp; Interrupts</li>\t<li>·<strong>Free Association 101: The 5 rules for infinite, interesting conversation with anyone (man, woman, you'll become a conversation king when you start using these rules) - day 10, How to Free Associate</strong></li>\t<li>·The easiest way to get her to invest in the interaction, so you're not the only one doing the work, and she's <em>starting to seduce you as well!</em> (even experienced guys get this wrong) - I'll show you how to do this in day 10, Qualification &amp; Acknowledgement</li>\t<li>·<strong>The perfect training plan refined through years of live in-person training to deliver you the maximum results in minimum time - day 11, Perfect Training Launch Plan</strong></li>\t<li>·4 mistakes you might make after you've started seeing results from the first 7 days (and how to nip them in the bud!) - day 12</li>\t<li>·<strong>5 ways to exceed your expectations and deliver you results with women beyond your wildest dreams - day 14</strong></li>\t<li>·How to automate your progress and results with women so that you're naturally attracting and bringing women into your life <em>without even any conscious thought about it</em> - day 15</li>  </ul>  <p>\t…and a whole lot more.</p>  <p>\t<strong>Now Here’s The Best Part:</strong>  </p>  <p>\tThis course isn't a boring, 100-hour tome of a course with me blabbering on about some obscure theory that requires even more time to decipher and break down into something you can actually use.</p>  <p>\t Each one of these videos is 5-10 minutes long, which means you’ll breeze through the course <strong>while absorbing all of its life-changing benefits into your interactions with women.</strong>  </p>  <p>\t<strong>So How Much Does The Attraction Mastery Course Cost?</strong>  </p>  <p>\tHere’s where it gets good for you.</p>  <p>\t<br>\t Instead of spending close to a thousand dollars for live coaching with me, and instead of groping in the dark trying to find success with women without any results for all of your efforts…</p>  <p>\t<em>…You can get the Attraction Mastery Course for just $97 $47 today.</em>  </p>  <p>\t Heck, if you add that up, that’s just a meal out somewhere nice or 5 Starbucks Lattes to get your hands on information that could change your life with women forever.</p>  <p>\t<strong> Why is it so cheap? </strong>  </p>  <p>\t The answer is simple: I’ve been in your shoes where I couldn’t meet or attract the women I wanted, and the thought of approaching a cute girl would have me running away in a cold sweat, and I’d have <strong>paid through my nose</strong> to get even just one small tip that could’ve helped me in any way.</p>  <p>\t What this means for you is this: You’re getting an absolute bargain here!</p>  <p>\tAnd All You Really Need Is Just <strong>One.</strong>  </p>  <p>\tUnless you’d like multiple girlfriends, meeting and dating one attractive girl is more than worth the reduced price of the Attraction Mastery Course.</p>  <p>\t<strong> In fact… </strong>  </p>    <p>\t Here’s My MONEY Back Guarantee To You</p>    <p>\tGo through the course, all 15 days of it.</p>  <p>\tDo the action steps I give you, and if after 30 days you can look me in the eyes and say the course hasn’t helped you or for any reason at all you’re not satisfied…</p>  <p>\t …<em>Udemy will</em><em> immediately refund you your money back for your time wasted.</em>  </p>  <p>\t Why? Simply put, I'm dedicated to producing results for my clients and students, and if you’re not satisfied with your investment, I’d like to buy it back from you.</p>  <p>\t So there’s absolutely no risk here.</p>  <p>\t Either you learn the fundamentals of attracting women into your life… <em>or you get your money BACK.</em>  </p>  <p>\t However:</p>  <p>\t<strong>Time Is A Factor</strong>  </p>    <p>\t The fact is, I just can’t price the Attraction Mastery course at $47 forever without ending up on the streets! So please understand that this is a one-time offer that might be taken off the market any time soon, so get your copy of the course</p>  <p>\t<em>before it’s too late</em>.</p>  <p>\t To your success with women,</p>  <p>\t David Crowther</p>  <p>\t<strong> P.S.</strong> In case you’re one of those people (like me!) who skip straight to the bottom to see what the fuss is all about, here’s the deal:</p>  <p>\t As part of a one-time offer, I’d like to give you my Attraction Mastery course for a measly $47. It was originally sold at $97, but the reason why I’m giving you such a great deal is because I’ve got a theory that if you know what you’re getting is worth WAY more than what you’re getting it for, you’re more likely to take action on what you’ll learn and be more than satisfied with the results.</p>  <p>\t Inside the course, you’ll learn the simple fundamental principles and techniques that allow my students to shortcut years of painful trial and error to create their ideal dating lives just by following the exact same instructions I’ve laid out for you in the videos.</p>  <p>\t The course is a 15-day video course, and you’ll receive daily videos from 5-10 minutes in length that ingrain the proper mindsets, beliefs and behaviours that lead to future success with women.</p>  <p>\t Also, to really sweeten the pot, I’m backing up your investment in the course with a double your money back guarantee: If after going through the 15 days and taking action, if in the next 30 days you’re not satisfied by the progress you’ve gotten with the course or for any reason at all you’re not satisfied, just tell Udemy and you’ll get your money back.</p>  <p>\t So there’s no way you can lose out here.</p>  <p>\t However, this offer is part of a limited, one-time offer that I’m testing that <em>will not be available forever.</em> What this means for you is that you’ve got to <em>take action now</em> in order to make sure you get your hands on Attraction Mastery before it’s too late.</p>  <p>\t So click the button below to get started. You won’t regret it.</p>", 
    "end_date": null, 
    "title": "Meet & Attract Women - Learn How Today", 
    "price": "20.00", 
    "instructors": "David Crowther", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341192_7c26_4.jpg", 
    "course_url": "https://www.udemy.com/meetwomen/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T07:54:18Z"
}