{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>FREE... </strong>( for now)</p>\n\n<p><strong>Over 15.000 students enrolled. Raving reviews.</strong></p>\n\n\n\n<p><em>  \t                    \"...Thank you for the awesome FREE course, it is outstanding!\"  </em></p>\n\n\n\n<p><em>  \t                    \"... a brilliant intro to neuroscience...\"  </em></p>\n\n\n\n<p><em>  \t                    \"... a wealth of information, good solid course to have.\"  </em></p>\n\n\n\n<p><em>  \t                    \"... I never looked at my brain from this perspective\"</em>  </p>\n\n\n\n<p>Yes, you just found the <strong>number 1</strong> free personal development course on Udemy (out of over 280). Well done! </p>\n\n\n\n<p>So what makes this one so special?</p>\n\n\n\n<p>You probably heard about the 'right brain - left brain' theory. Well, forget everything about it. It's just not true. Recent studies show reality is far more complex and nuanced than that.</p>\n\n\n\n<p>  \t                          The NBA (or <em>Neurocognitive and Behavioral Approach</em>) is a fascinating, innovative and multi-disciplinary approach born out of 25 years of scientific research. Discover how 4 brain structures are responsible for all of our decisions and internal conflicts.  </p>\n\n\n\n<p>  \t                          Once you learn to recognize what part of your brain is active, you start looking at the world from a totally different point of view. A lot of things start to make sense.</p>\n\n\n\n<p><strong>What to expect...</strong></p>\n\n\n\n<p>This high quality course will walk you through the different brain structures, breaking down complex theories into easy to digest chunks of information. The narrative style is humorous, without overdoing it, as not to overshadow the fascinating content being conveyed. The course is well paced, with closed captions (subtitles) enabled for greater ease. </p>\n\n\n\n<p>It's really a no-brainer to follow this course. Or as several students stated (scroll down and check the reviews below): \"... <em>Everybody should take this</em>...\"</p>\n\n\n\n<p>  \t<em>      This course is an introduction to the NBA. For a more advanced course, please check 'Master your brain', or 'Neuroscience for Parents' available here on Udemy.  </em>  </p>", 
    "end_date": null, 
    "title": "Meet your brain: a short introduction to neuroscience", 
    "price": 0, 
    "instructors": "Gregory Caremans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341182_c447_4.jpg", 
    "course_url": "https://www.udemy.com/meet-your-brain/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T07:30:20Z"
}