{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you want more confidence, more self-esteem, more mental clarity, more personal power and more success?</p><p>Then this course is for you!</p><p>In this course you'll learn to develop the ten essential \"Mind Powers\" which are the fundamentals you need to produce, create and attract more of what you want in your life. </p><p>You'll learn to develop your confidence, your self-esteem and your personal power so you can achieve your goals and cultivate a life that contains more of what you want and leads to more happiness and success. </p><p>These ten mental skills, mental tools and mental abilities are the same ones I have used to completely change my life. I moved from being frustrated, confused and angry to creating a successful coaching and consulting business that supported me and my family and took me around the world on my schedule. I went from being a college dropout to being offered a teaching position as a professor at a Canadian university. </p><p>These are the same mental tools my students all over the globe have used to change their lives for the better. I'm sure they will help you too.<br></p><p>The course includes:</p><ul><li> Ten main video lessons outlining each main skill; </li><li>Several short videos to clarify some points; </li><li>A very powerful creative visualization exercise; </li><li>Several worksheets to help you organize your thoughts and develop mental clarity; </li><li>Some short quizzes to help your retention of the main points; </li><li>The ability to ask questions of the author; </li><li>Lifetime access to all videos and course materials and to all future updates.</li></ul>", 
    "end_date": null, 
    "title": "Mind Power - Mastering Your Inner Power", 
    "price": "25.00", 
    "instructors": "Anthony Hamilton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660440_725f_2.jpg", 
    "course_url": "https://www.udemy.com/mind-powers-master-your-inner-power/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T21:25:28Z"
}