{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course, taught by Thích Nhất Hạnh, a world famous Buddhist monk, poet, peace activist, and teacher, will teach you how to find happiness and access the “Kingdom of God” in the here and now.</p><p>You'll practice mindfulness techniques, including meditation and simple breathing methods, so you can concentrate fully and connect with all the life that surrounds you. </p><p>From breathing meditation to walking meditation, you'll learn how to touch the wonders of life to nourish and heal your body and reduce your suffering.</p><p><strong>Practice Mindfulness in Your Everyday Life to Transform Your Mind and Body</strong></p><ul><li>Understand how to be mindful, whether you're simply breathing or walking</li><li>Learn from your past and release anxiety about your future</li><li>Reflect upon your connection with nature and to all life</li><li>Access ancient Buddhist teachings to release suffering and gain compassion</li></ul><p><strong><br>Receive Freedom, Joy, and Release from Suffering with Buddhist Teachings</strong></p><p>As you listen to Thích Nhất Hạnh's speech, you'll begin to learn how to breathe, practice mindfulness, and release your suffering while sending compassion outwardly as well as towards yourself.  </p><p>In addition to learning how to make yourself happier, you'll understand the necessity of being happy in order to serve others.</p><p>Also, in between the lectures in this course, Buddhist monks and nuns alongside Thích Nhất Hạnh will musically chant and meditate with you as you put what you're learning into practice.</p><p><strong>Contents and Overview</strong></p><p>This course begins with Thích Nhất Hạnh explaining how to breathe to the sound of the bell so you can come back to center and bring calmness into the mind and body.</p><p>As you breathe in and out to the sound of the bell, you can begin practicing mindfulness from the start of the course.</p><p>You'll then learn about the importance of listening with every cell of your body by breathing with the sound. As you do, you’ll bring unity into your body and mind to become fully present.</p><p>If you're dealing with difficulties, you'll understand how practicing mindfulness can bring you joy in the present, and how to embrace your suffering while moving through it.   </p><p>Next, you'll learn a method for transforming suffering into healing and compassion before diving into how to acknowledge your connection to the Kingdom of God through Mother Nature.  </p><p>Another aspect of mindfulness is being able to learn from the past and prepare for the future. You'll learn how being in the present can help you transform the past and remove anxiety about what’s to come.</p><p>You'll even comprehend the law of interbeing, understanding how the entire universe is reliant upon positive and negative aspects of life being connected to each other.</p><p>Thích Nhất Hạnh will then discuss mindful consumption, as taught by the Buddha. You'll know how to avoid sickness and unhappiness by only consuming things that provide you, and those you love, with health.</p><p>By the time you complete this course, you'll be aware of how to use mindfulness in your everyday life to bring more joy and compassion to yourself and everyone around you.</p>You'll be able to meditate, reflect, transform, and make decisions in your work and relationships that will positively impact life all over the world.", 
    "end_date": null, 
    "title": "Mindfulness Practice for Joy & Compassion by Thích Nhất Hạnh", 
    "price": "50.00", 
    "instructors": "Thích Nhất Hạnh, Sounds True", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680048_801e.jpg", 
    "course_url": "https://www.udemy.com/refreshing-our-hearts-by-thich-nhat-hanh/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T00:20:12Z"
}