{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Mind Over Matter In 30 Days</strong></p><p><strong>Take control of your life starting now!      (NEW!)</strong></p><p>No matter what fear(s), ailments, or life issues you may have, this course will show you how to overcome them !</p><p>Life can plague us with issues that make us feel as though we are not in control. Well, you <strong>CAN</strong> be in control, and I will show you how.</p><p>Just think about how this information can help you to become a new and improved person in a short period of time.</p><ul><li>Health</li><li>Relationships</li><li>Finances</li><li>Fears and Phobias</li><li>Mental development</li><li>Whatever it may be. There is a reasonable solution within this course.</li></ul><p><strong>Learn about the 3 <em>simplified</em> techniques that you can start using, immediately.</strong></p><p><strong>E.F.T. (Emotional Freedom Technology)- </strong>I have used this technique myself for several things, and it has worked for me, astoundingly! It involves tapping on specific energy points of your body in a sequence while making certain types of affirmations. This releases stored blockages that cause your problems. Learn how EFT can be used for practically anything!</p><p><strong>The Law of Attraction</strong>-This is a principle based on the idea that the Universe communicates with us according to what we think, confirm and focus on. The universe is always giving things to us, whether good or bad, it obeys our thoughts, feelings and confirmations. This course will show you how to gain more control over <strong>WHAT</strong> the Universe gives you. Isn't that great!</p><p><strong>Meditation</strong>- Meditation is the deliberate quieting of the mind, which causes the mind to open up to the \"programming\" that we intend on inducing it with. Although, meditation can take years of dedication to perform effectively, this course will show you how to use some simple, no cost technology to greatly speed up the process.</p><p><strong></strong><strong>Here is a special note before I sign off</strong></p><p>I believe in this course with 100% confidence, and it is definitely intended to do everything it says. However, my company ( or even I, personally) do not make any type of claims. This course is purely educational but contains information about <strong><em>techniques</em></strong> that have proven successful for many people from all over the world and from all walks of life.<br></p><p><br><strong></strong></p><p><strong></strong><strong></strong><br><strong></strong></p><p><strong></strong><br></p>", 
    "end_date": null, 
    "title": "Mind Over Matter In 30 Days: Mind hacks to achieve anything", 
    "price": "20.00", 
    "instructors": "Chad Deshotel", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/662454_0b17_4.jpg", 
    "course_url": "https://www.udemy.com/coachchad100/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-06T21:29:28Z"
}