{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tMotivational Speaking: You Can Become a Motivational Speaker  \t</p><p>Imagine yourself speaking on the stage in front of hundreds or thousands of people. Your words are inspiring and motivating your audience to make changes and take positive actions. You can lead from the platform!</p><p>How to Be a Motivational Speaker</p><p>In this &quot;How to be a Motivational Speaker&quot; course you will learn the fundamentals of how to structure a motivational speech and how to run a motivational speaking business. Everyone has a story to their life, but not everyone has a story that is interesting enough or compelling enough to motivate other people from the platform. This course will guide you through the process of positioning yourself, crafting your speech, improving your platform skills and building a motivational speaking business.</p><p>TJ Walker is a coach and trainer to motivational speakers around the globe. Additionally, he gives motivational speeches worldwide on the power of personal expression.</p><p>Why wait even one more day before you can start sharing your message with others? Sign up today for this course today. </p><p>Course updated on July 28, 2015</p><p>There is a 100% Money-Back Guarantee for this course. And the instructor also provides an enhanced guarantee. </p><p>TJ Walker has more than 100,000 course enrollments from more than 14,000 online students around the globe. </p>", 
    "end_date": null, 
    "title": "Motivational Speaking: You Can Become a Motivational Speaker", 
    "price": "20.00", 
    "instructors": "TJ Walker", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/341472_b57e_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-motivational-speaker/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-11T15:45:42Z"
}