{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Finding your life purpose is the universally accepted route towards personal fulfilment and happiness. Without a life purpose, scientists estimate that chances of being happy drop by around 80%. </p><p><strong>This course takes you from zero life purpose to putting you firmly on track to feeling fulfilled and happy in life.</strong></p><p>Some highlights:</p><ul><li>Find your life purpose </li><li>How to build your purpose in 3 steps</li><li>How to start each day of purpose</li><li>How to support yourself financially</li><li>How to deal with your haters</li><li>Much more!</li></ul><p>--------------------------------------------------------</p><p><strong>Why You Need a Life Purpose</strong></p><p>A life purpose is the ultimate human motivator. Once you know your path and begin to walk it, lifes' annoyances take a back seat. Things like your boss shouting at you fade into irrelevance, because you have a mission and he simply is not necessary to fulfil it.</p><p><em>You need a life purpose because it decreases your stress levels.</em></p><p>Not only does having a purpose remove stress, it also makes you feel happy. Happiness is <strong>only</strong> forthcoming when we feel as though we're working towards something positive.</p><p><em>Happy people are proven to be healthier, wealthier and immensely attractive to other people.</em></p><p><strong>Contents and Overview</strong></p><p>This course packs maximum value into minimum time. It distils the most common life purpose discovery techniques into short and sharp lectures because I want you to get out there and begin right away.</p><p>You'll first discover how to find your life purpose using a method I term 'The Upward Spiral'. There is room for discovery here but the aim is to make you <em>commit</em> to your chosen purpose.</p><p>Then you'll find out how long you should stick with your life purpose. The first time commitment is surprisingly short!</p><p>3 steps are outlined as sure fire methods of building your purpose. Follow these and you can't go much wrong! You'll build something of immense value both to you and to your fans (yes, having a purpose means you will have fans!)</p><p>You'll also find out the optimal way to start each day. This lecture is designed to load you into a cannon and fire you at the speed of sound into your daily mission.</p><p>Of course, you have to survive whilst on your mission. For that you need money and I outline 2 strategies for you to accomplish this. The second one is what I have personally done - making money in my sleep. Not millions (like infomercials have you believe) but enough to provide the daily needs.</p><p>Finally we deal with haters. When you begin finding a life purpose, the venom you'll experience will be almost intolerable. The lazy people surrounding you will try to pull you down to their level and it will be hard to resist them. I give you a sure fire way of dealing with them that has never let me down. </p><p><strong>BONUS MATERIAL</strong></p><p>You'll also receive bonus material in the form of 5 daily motivators. These are special parcels to be opened whenever your will to work is low. They will fire you up and get you sprinting towards a life purpose,<strong> leading to fulfilment and happiness in life.</strong></p>", 
    "end_date": null, 
    "title": "Motivation for Men: Find Your Life Purpose and Profit", 
    "price": "20.00", 
    "instructors": "Mr Grant Klims", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/776736_2c34.jpg", 
    "course_url": "https://www.udemy.com/how-to-find-your-life-purpose/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-28T09:25:47Z"
}