{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Neues Licht auf Ho&#039;oponopono</strong></p><p><strong style=\"\">Über Ho&#039;oponopono und Ho&#039;oponopono als Lebens- und Seinsschule</strong></p><p>Ho&#039;oponopono ist eine alte hawaiianisch-schamanische Methode um Belastendes im Leben zu klären und loszulassen und das Leben wieder in Harmonie, Frieden und Freiheit zu erleben. </p><p>Da die eigene Erfahrung das Ausschlaggebende ist, findest du im Werbevideo einen Mini Ho&#039;oponopono Crashkurs. Du kannst gleich feststellen, dass die Methode sehr leicht angewendet werden kann und augenblickliche Ergebnisse bringt. Sollte es dich ansprechen, dann lies den Text weiter. </p><p>Du lernst in diesem Onlinekurs den ersten Teil eines von Mircea Ighisan in den Jahren 2011 bis 2015 entwickelten Ansatzes, der erstmals in dieser Form vorgestellt wird. </p><p>Mein Verständnis von Ho&#039;oponopono.</p><p>Ho&#039;oponopono ist in meinen Augen mehr als eine Methode. Es ist ein Weg, der dich über inneres Klären und Loslassen wieder mehr und mehr zu dir und dem was du wirklich bist führt. Infolgedessen erfährst du immer höhere Grade an Harmonie, Frieden und Freiheit in allen Beziehungen deines Lebens. Mit der Welt, mit anderen Menschen und letztendlich auch mit dir selbst. </p><p>Du kannst dir Ho&#039;oponopono wie eine Lebens- und Seinsschule vorstellen. In meinem Verständnis dieser Schule, ist der sichtbare Lehrer nie der eigentliche Lehrer. Die wirklichen „Lehrer“ in dieser Schule sind dein Leben und früher oder später auch die Stille in deinem Innern. </p><p>Ich sehe mich in der Funktion eines Mentors, der sein Wissen mit dir teilt und dir Werkzeuge an die Hand gibt, um die Aufgaben die dir vom Leben gestellt werden zu lösen. </p><p>Um beim simplen Bild der Schule zu bleiben. Eine Schule besteht in einer einfachen Einteilung aus: Grundschule, Mittelstufe und die hohe Schule. </p><p>Je nachdem wo du in dieser Schule bist hat Ho&#039;oponopono bestimmte Bedeutungen und bestimmte Lehrinhalte. </p><p>In der Grundschule lernst du erstmal</p> <ul style=\"\"><li>Die Grundlagen kennen</li><li>Die Methode kennen und du lernst sie erfolgreich anzuwenden</li><li>Erfährst du dass du mit Leichtigkeit, schnell und einfach Belastendes loslassen kannst.</li><li>Du baust über Wissen und vor allem Praxis Vertrauen auf</li><li>Du hast – hoffentlich ;) – Spaß dabei</li></ul> <p>Es geht in der Grundschule also nicht um das Lösen all deiner Probleme im Leben, sondern erstmal ums „Reinkommen“. Darum Leichtigkeit beim Klären und Loslassen zu erfahren und Vertrauen in dich und auf diesem Weg zu sammeln. Nicht mehr und nicht weniger. </p><p>In der Mittelstufe hast du andere Lern- und Lebensrealisierungsaufgaben. Es geht hier darum ein bestimmtes Level (oder Niveau) an Harmonie und an Frieden in deiner Beziehung </p> <ul style=\"\"><li>zur Welt (auch beruflich, finanziell etc.), </li><li>mit anderen Menschen (Partnerschaftlich, Familiär etc.) </li><li>in der Beziehung zu dir </li></ul> <p>in Leben zu realisieren. Die Mittelstufe kann eine sehr lange Phase sein und umfasst alle Bereiche deines Daseins. </p><p>Es geht hier nicht um Meisterschaft, sondern darum alles in Bewegung bringen zu können und eine bestimmte Ebene an Harmonie und Frieden in dir und im Leben zu erleben. </p><p>Für die Grund- und Mittelstufe bedeutet der Begriff Ho&#039;oponopono „Fehler gutmachen“, &quot;etwas richtig stellen&quot;, &quot;etwas in Ordnung zu bringen&quot;.</p><p>Als Ausblick, weil ich mich hier irgendwo am Beginn dieses neuen Abschnittes befinde. </p><p><em style=\"\">„Die Philosophie von Ho&#039;oponopono sieht die Welt als interverbundene Ganzheit, ungeachtet des Gefühls der Getrenntheit. Infolge dieser Verbundenheit geschieht nichts in der Welt, das nicht auch in Resonanz zum Selbst des Betrachters steht. Probleme im Außen lassen sich ändern, wenn man seine innere Resonanz dazu auflöst.“</em></p><p>Quelle: Spiritualwiki (Artikel über Ho&#039;oponopono)</p><p>In der Oberstufe und in der hohen Schule auf diesem Weg hat Ho&#039;oponopono eine andere Bedeutung. Ho&#039;oponopono lässt sich hier als „Weg zur Vollkommenheit“ übersetzen. </p><p>Was möglich ist spiegelt sich im 2ten Huna Prinzip wieder. Huna ist der hawaiianische Schamanismus aus dem Ho&#039;oponopono stammt. Das 2te Huna Prinzip lautet. </p><p><em style=\"\">„Es gibt keine Grenzen.“</em></p><p><strong style=\"\">Zum „Neues Licht auf Ho&#039;oponopono“.</strong></p><p>Der Ansatz der sich in mir in den Jahren 2011 bis 2015 gebildet hat besteht aus 5 Bausteinen, die auf 2 Kurse verteilt sind. </p><p>Neues LIcht auf Ho&#039;oponopono Teil 1 (dieser Kurs)</p><p>Baustein 1: Deine Rolle und der freie Wille</p><p>Baustein 2: Die Ho&#039;oponopono Sätze</p><p>Baustein 3: Die Verantwortung für die eigene Wahrnehmung übernehmen</p><p>Dieser Kurs deckt den Stoff der Grundschule im Ho&#039;oponopono ab. </p> <ul style=\"\"><li>Du lernst die Ho&#039;oponopono Methode</li><li>lernst sie smart (!) anzuwenden</li><li>erfährst Leichtigkeit beim Klären und Loslassen</li><li>du wirst - hoffentlich – viel damit klären und loslassen (das ist von dir abhängig, ob du es auch anwendest oder nicht) </li><li>baust Vertrauen in dich und in diesem Weg auf. </li></ul> <p>Obwohl mein Ansatz auf 5 Bausteinen besteht, sind diese Kursinhalte sind in sich vollständig. </p><p>Dieser Kurs ist sowohl für Anfänger wie für Fortgeschrittene (auch im Ho&#039;oponopono) geeignet.</p><p>Neues Licht auf Ho&#039;oponopono Teil 2 </p><p>Im 2ten Teil von „Neues Licht auf Ho&#039;oponopono“ steigen wir tiefer ins Huna ein und auch in die Spiritualität. Ich habe die gesamte Formel in 2 Kurse gesplittet, weil es </p><p>- sehr viel Stoff ist und alleine schon das bestehende internalisiert werden will </p><p>- ich die „spirituellen“ Bausteine in einen extra Kurs gepackt habe, weil manche Menschen doch ihre Probleme damit haben </p><p>Baustein 4: Die Anwendung der 3 Selbste um tiefere Schichten in sich zu erreichen und zu balancieren</p><p>Baustein 5: Spirit (als zentrales aktives Element von dem die Transformation ausgeht)</p><p><strong style=\"\">Inhalte Onlinekurs „Neues Licht auf Ho&#039;oponopono Teil 1“</strong></p><p>Der Kurs besteht aus 6 Teilen (~ 3,5 Stunden) + einen Bonuskurs. (2 Stunden)</p><p>Teil 1: Einführung (4 Videos ~ 43 Min)</p><p>Teil 2: Vorbereitung (1 PDF, 4 Videos ~ 43 min)</p><p>Teil 3: Baustein 1: Deine Rolle &amp; der freie Wille (3 Videos ~ 18 min)</p><p>Teil 4: Baustein 2: Die Ho&#039;oponopono Sätze (13 Videos ~ 80 min)</p><p>Teil 5: Baustein 3: Die eigene Mächtigkeit wahrnehmen und fühlen (5 Videos ~28 min)</p><p>Teil 6: Tipps zur Anwendung (7 Videos ~ 27 min)</p><p>Teil 7: Bonusvideos Spielerisch lernen (14 Videos ~ 129 min)</p><strong style=\"\">Detail und Lehrinhalte „Neues Licht auf Ho&#039;oponopono Teil 1“</strong><p>Teil 1: Einführung (4 Videos ~ 43 Min)</p><p>Inhalte: </p> <ul style=\"\"><li>Kursübersicht</li><li>Wozu ist Ho&#039;oponopono gut?</li><li>Über Ho&#039;oponopono und diesen Ho&#039;oponopono Ansatz</li><li>Ein Einblick in meine Erfahrungen mit Ho&#039;oponopono </li></ul> <p>Teil 2: Vorbereitung (1 PDF, 4 Videos ~ 43 min)</p><p>Inhalte: </p> <ul style=\"\"><li>PDF: Grundlagen eines neuen Weltbildes (64 Seiten)<ul style=\"\"><li>Die Theorie: Ich baue Ho&#039;oponopono auf einem quantenphysikalischen Weltbild auf. Das hawaiianische Huna baut sowohl auf einem quantenphysikalischen Weltbild wie auch auf einem spirituellen Weltbild auf. Wir nähern uns dem Weltbild hauptsächlich von der Seite der wissenschaftlichen Erkenntnisse der Wahrnehmung und er Quantenphysik. Es ist verständlich geschrieben (laut vielen bisherigen Feedbacks ;))</li></ul></li><li>Der Zustand (State) aus dem du etwas machst<ul style=\"\"><li>Der Zustand aus dem du etwas machst, ist wichtiger als das was du machst. In diesen Videos gehe ich darauf ein warum ist er wichtig, welche Wirkung entfaltet der Zustand und wie du in einen guten Zustand kommst.</li></ul></li><li>Technik: Das Fallen Lassen der Wahrnehmung<ul style=\"\"><li>Eine sehr simple Technik die auf quantenphysikalischen Erkenntnissen aufbaut, mittels denen du in Sekundenschnelle deine Wahrnehmung klären kannst. </li></ul></li></ul> <p>Teil 3: Baustein 1: Deine Rolle &amp; der freie Wille (3 Videos ~ 18 min)</p><p>Inhalte: </p> <ul style=\"\"><li>Die Bedeutung deiner Rolle im Transformationsprozess (Will ich wirklich?) und die des freien Willens</li><li>Die Wirkung des freien Willens erfahren</li><li>Wie du herausfindest was du wirklich willst und wie du neu wählen kannst (ein Einstieg)</li></ul> <p>Teil 4: Baustein 2: Die Ho&#039;oponopono Sätze (13 Videos ~ 80 min)</p><p>Inhalte: </p> <ul style=\"\"><li>Die Rolle des Beobachters – Theorie und Praxis</li><li>Die Ho&#039;oponopono Sätze und warum sie wirken</li><li>Was erzeugt Wirkung?</li><li>Ho&#039;oponopono anwenden</li><li>Die Ho&#039;oponopono Sätze tiefer betrachtet</li><li>Wir steigen tief ins Verständnis der 4 Ho&#039;oponoponosätze ein, was sie bedeuten und in welcher Haltung sie innerlich zu machen sind, damit sie eine starke Wirkung entfalten.</li></ul> <p>Teil 5: Baustein 3: Die eigene Mächtigkeit wahrnehmen und fühlen (5 Videos ~28 min)</p><p>Inhalte:</p><p>Obwohl viele Anwender theoretisch wissen, dass wir alles verändern können, fühlen sie das in bestimmten Themen / Lebensbereichen nicht. Man fühlt sich ohnmächtig (Ohne Macht) statt mächtig. In dem Fall wird sich bei der Anwendung früher oder später die Ohnmacht bestätigen. </p> <ul style=\"\"><li>wie du deine Mächtigkeit in den verschiedenen Themen / Lebensbereichen wieder wahrnimmst und fühlst. </li><li>Wie du smart mit affektierten (wenn du von Emotionen übermannt bist) Zuständen umgehst</li></ul> <p>Teil 6: Tipps zur Anwendung (7 Videos ~ 27 min)</p><p>Inhalte: </p><p>Dieser Bereich ergänze ich in regelmäßigen Abständen mit euren Fragen bis eine Sättigung da ist. Im Moment sind 7 Videos mit Anwendungstipps und Vorgehensweisen online. </p><p>Teil 7: Bonusvideos Spielerisch lernen (14 Videos ~ 129 min)</p><p>Das ist ein Kurs im Kurs als Bonus. Er hat nichts mit Ho&#039;oponopono zu tun, sondern mit Lernen an sich und wie du als Erwachsener wieder dahin kommst spielerischer (und schneller) zu lernen. Inspiriert von den Erkenntnissen von der russischen Shetinin Schule und dem Verständnis und den Möglichkeiten die aus dem neuen Weltbild entwachsen. Ziel ist, </p> <ul style=\"\"><li>dass du wieder mehr bei dir ankommst</li><li>mehr und mehr deinen Verstand defragmentierst und öffnest</li><li>in Verbindung bist</li><li>lernst dich bewusst zu synchronisieren</li></ul><br style=\"\">", 
    "end_date": null, 
    "title": "Neues Licht auf Ho'oponopono ", 
    "price": "20.00", 
    "instructors": "Mircea Ighisan", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368900_8737_2.jpg", 
    "course_url": "https://www.udemy.com/neues-licht-auf-hooponopono/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-12T16:00:23Z"
}