{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This course is a gateway to new life and understanding. Many of us feel unhappy, have a fear of different very unlikely situations, thinking about how unsecure and wrong the world is. This is a problem of 97 percent of population of the world. Unsatisfaction of what is happening in our life is usual and considered normal. But there is a solution that can change your life dramatically.<br>The problem lies in our wrong perception of the world. We have a very unstable fundamentals that we usually base on bible, atheist or other explanations of the world. But there is a natural explanations. Natural knowledge that explains with no pain whatever happens to us. And it is not a lie. It is truth that is hidden to us because we have a believing in magic worlds from childhood. These are the factors that significantly influence our fundamentals. Bible is the greatest book in the universe but in order to understand it we have to understand the truth of life. Otherwise, we get wrong picture of what is written in this book.<br>How to look on the world? Simply from natural, rational and scientific way. World is a product of evolution and development. Out psychology is based on Maslow pyramid that is important to understand. We have to be flexible on order to understand this kind of truth. But to be flexible we have to understand the basics of life and it creation. These simple foundations change us with time dramatically. And we will understand the basics truth that will open us gates to the new dimension of understanding of life.<br>What is this new understanding is about? Simply go on the street and look on the scratch on the car and you will get a picture of who this person is, what he eat, how he behave, whether he is married or not. And much more. Magic? No, simple logic. Look at  the persons face and you will understand when he will likely die or buy ice cream on tomorrow friends party. These complex logic structure appear only when you understand fundamentals of life correctly. Telling you in other words god opens you gate for the life understanding. These gates are closed for those with a wrong fundamentals.<br>After that you will feel happy, satisfied with life and you will understand how to live happily. What I mean is that it is end of time of unsure knowledge of what we are doing. It is time for fair and solid decisions.</p>", 
    "end_date": null, 
    "title": "New dimensions of Life", 
    "price": "25.00", 
    "instructors": "Mr Andrei Li", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616380_3dd5_3.jpg", 
    "course_url": "https://www.udemy.com/new-dimensions-of-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T04:10:26Z"
}