{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome to my new course spring 2016! This short intensive course comprises practical techniques that I use with great success on a daily basis in live sessions with clients and have done for the last ten years. I've carefully and deliberately chosen techniques that you can do WITHOUT a partner. <br></p><p><br>This is a practical course, with almost zero theory, devised for a busy individual who just wants to DO IT - get strong and confident without using up time learning the nuts and bolts of Neuro-Linguistic Programming! When you buy an appliance, you want it to do certain things, but you don't necessarily want to know the mechanics of how it does it! If that's your situation: you want expert assistance in getting strong, motivated and confident in record time, this is the course for you. If you want theory - the hows, whys and wherefores - the whole nine yards - stay tuned for my upcoming courses here, or you are welcome to check out my NLP certification training courses. There's plenty of NLP theory as well as practice on those! :) <br><br>If you're not familiar with what NLP is, for now, it’s simplest to define Neuro-Linguistic Programming (NLP) as a personal development tool that you can use for rapid change in how you feel how you think and how you behave. This short course is jam-packed with proven to be effective techniques to feel better about yourself, boost your self-esteem, get motivated to achieve what you want to achieve and feel confident and strong.</p>\n\n<p> The NLP techniques I’ve chosen for you in this intensive course EACH take just a few minutes with the exception of the Super Self-Esteem Booster exercise takes around 15 minutes. All of the exercises on this course have been proven to be incredibly effective over the last ten years with thousands of clients and groups locally here in Ottawa, and all over the world. My work using hypnosis and NLP has been featured in over 20 newspapers the length and breadth of Canada, including the full page Saturday feature in our capital's 'paper, The Ottawa Citizen and one of Canada's largest circulating newspapers, The Montreal Gazette. Additionally, there are video testimonials on our training website saying how awesome my NLP and Hypnosis training courses are!</p>\n\n\n\n<p>The course material is colourful, featuring occasional music, animated text accompanying my voice explaining what's to come, then guiding you through each step of each technique. </p>\n\n\n\n<p>As a bonus to all of you, there is a complimentary 11 minute 'Relax and Revitalise' meditation audio for you to download from my website. No subscription required.</p>\n\n\n\n<p>Let's get started! If you need any assistance with any technique, I will be happy to help you.</p>\n\n\n\n<p>Louise Goddard<br>Master of NLP, NFNLP Instructor and NGH Hypnosis Instructor</p>", 
    "end_date": null, 
    "title": "NLP Techniques to skyrocket confidence and self-esteem!", 
    "price": "20.00", 
    "instructors": "Louise Goddard", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682884_c545_4.jpg", 
    "course_url": "https://www.udemy.com/master-your-mind-unleash-your-authentic-self-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T23:13:38Z"
}