{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<h4><strong><em>Are you interested in having better relationships, more influence or control of your own mind?</em></strong></h4>  <h4><strong><em>Do you want to know what many top executives, sports stars and successful people know?</em></strong></h4>  <h4><strong>Then you must learn what NLP has to teach you.</strong></h4>  <p>  \t<br>  \t    NLP (or Neuro Linguistic Programming) is a collection of tools, techniques and strategies that help you to improve just about every area of your life. <br>  \t<br>  \t    NLP has been used with success in the following areas (amongst others) : <br>  </p>  <ul>  \t<li> Sales</li>  \t<li> Management</li>  \t<li> Sports &amp; Athletics</li>  \t<li> Therapy</li>  \t<li> Weight Loss</li>  \t<li> Smoking Cessation</li>  \t<li> Behaviour Modification</li>  \t<li> Phobias Elimination</li>  \t<li> Relationship Building</li>  \t<li> Negotiation &amp; Influence</li>  \t<li> Public Speaking &amp; Presenting</li>  </ul>  <p>  \t<br>  \t    This course is designed to give you an introduction into NLP and what it can do and how it is used. This course can be taken as a standalone course or in conjunction with <strong>NLP For Beginners: Foundation Course. </strong>The two courses compliment eachother but teach different and self-contained topics. It&#039;s best to take the Foundation Course first and then the Improvers Course, but they can also be taken the other way around without any problem. <br>  </p>  <h4><strong>Syllabus</strong></h4>  <p>  \t<br>  \t    The topics covered in this <strong>Improvers Course</strong> of <strong>NLP for Beginners</strong> are: <br>  </p>  <ul>  \t<li> Language Tools</li>  \t<li> Perceptual Positions</li>  \t<li> Sub-modalities</li>  \t<li> Time lines</li>  \t<li> Anchoring</li>  \t<li> Strategies</li>  </ul>  <p>  \t<br>  \t    If you want to improve your life and build better success into everything you do, then NLP has something to teach you. <br>  \t<br>  \t    This course is designed for people with little or no NLP experience and will give you tools that you can use immediately to create lasting and beneficial change in you and others.  </p>  <h4><strong>About the trainer</strong></h4>  <p>  \t<br>  \t    Hari is an NLP Master Practitioner who has been using NLP for over 8 years and been coaching clients with it since 2010. He is a speaker, author, coach and trainer whose passion it is to help people better understand the power of their own minds so that they can improve their lives. <br>  \t<br>  \t    He is the author of the book - &#039;The Thought Gym&#039; (available on Amazon internationally) and founder of TheThoughtGym[dot]com - a website dedicated to help people <em>&quot;Train the mind, so the rest will follow&quot;</em>.  </p>", 
    "end_date": null, 
    "title": "NLP For Beginners: Improvers Course", 
    "price": "20.00", 
    "instructors": "Hari Kalymnios", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/289676_8bba_5.jpg", 
    "course_url": "https://www.udemy.com/nlp-improvers/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-28T16:28:20Z"
}