{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled ' NLP- Learn To Create Your Future Now Using NLP Techniques ' By Pradeep Aggarwal , you will learn different NLP techniques to achieve your goals effectively and effortlessly using powerful and simple NLP and Self Hypnosis techniques . </p><p>You will be able to plan your goal better by writing it down and also find out reasons why your mind rejects a goal .You will also be able to achieve your goals easily by using powerful NLP techniques like visualization, affirmations and many more.</p><p>This course is ideal for people who have trouble converting their thoughts into actions and moving closer towards achieving their personal and professional goals .</p><p>This course contains more than 30 mins of video content designed over 8 lectures</p><p>This course contains -</p><p>Lecture1:Introduction</p><p>Lecture2:How And Why Your Subconscious Mind Accepts Or Rejects A Goal?</p><p>Lecture3:Why Writing Down Your Goal Work Wonders?</p><p>Lecture4:Celebrating Future Success: Learn How To Place Yourself in Future</p><p>Lecture5:Ask Your Future Self to Help You: Learn How To Seek Help From Your Future Self.</p><p>Lecture6:Take Action: Simply Planning Does Not Work.</p><p>Lecture7:Bonus Exercise - Relaxation Techniques Using Self Hypnosis</p><p>Lecture8:Summary</p>", 
    "end_date": null, 
    "title": "NLP- Learn To Create Your Future Now Using NLP Techniques ", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/554112_88a9.jpg", 
    "course_url": "https://www.udemy.com/nlp-learn-to-create-your-future-now-using-nlp-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-14T06:00:17Z"
}