{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled '<strong>NLP- How To Use A Person's Name For Instant Rapport</strong>' By Pradeep Aggarwal , you will learn -</p><p>The very first and crucial step in creating an instant rapport with anyone is by remembering and pronouncing their names correctly. By remembering a person’s name, you create an instant rapport and liking for yourself. The person feels respected and valued when you remember their names and call them by their names whenever you meet next time.</p><p>This is a very basic step in instant rapport and is often overlooked. This course is designed to help you to remember people’s name easily.</p><p>By the end of the course you will be able to remember people's name very easily whom you have met in social gatherings, events , parties  corporate meetings etc and build a long lasting relationship for growth and development of your personal and professional life.</p><p>This course is ideal for people who are into sales and require to meet potential clients and customers for business growth and development.</p><p>You will also be able to trigger your confidence level and relax during times of need by following the exercises in this course.</p><p>This course contains a lot of NLP and psychic exercises and more than 35 minutes of live video content designed over 10 lectures in English.</p>", 
    "end_date": null, 
    "title": "NLP- How To Use A Person's Name For Instant Rapport", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643124_42c3.jpg", 
    "course_url": "https://www.udemy.com/nlp-how-to-use-a-persons-name-for-instant-rapport/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T06:50:47Z"
}