{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn the 9-step system to identify the right goals for you, plan them out, and maintain motivation to complete them.</p><p><strong>Overcome your resolutions with a proven system to achieve resolutions and goals.</strong></p><ol><li>Identify your pain points</li><li>Plan against your pain points</li><li>Maintain motivation</li></ol><p><strong>A System for Success</strong></p><p>Have you experienced Jan-Gym syndrome, where you go into a gym motivated in January, but have fallen off the rails by February? I have too, and set about creating a way to overcome this. This course will show you that way, which allowed me to hit 85%+ of goals that I set. Unlike other goals courses which focus on setting S.M.A.R.T goals, this course is about the surrounding processes and methods.</p><p><strong>Course Overview</strong></p><p>Suitable for all levels, this short course will help you learn how to implement a system to replace unsuccessful resolutions with well-defined and achievable goals.</p><p>Starting with identifying why resolutions don't work, this course will take you through setting goals as if you are running a project, from identifying your needs to setting tasks and deadlines, then maintaining progress.</p><p>The course will also provide some valuable resources and techniques that you can use to support your progress to hitting your resolutions and goals.</p><p>Students completing the course will have the knowledge to build a systemic approach to taking on goals and hitting them.</p><p>With a minimalist design and short snappy videos, you will be able to focus on the content and work with the instructor on each concept covered, and you will receive a certificate of completion upon finishing the course.</p>", 
    "end_date": null, 
    "title": "No More Resolutions!", 
    "price": "20.00", 
    "instructors": "Mr Syed Ahsan", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/702512_5433_2.jpg", 
    "course_url": "https://www.udemy.com/screw-resolutions/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T01:30:32Z"
}