{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*Over 300 new students this month</strong></p><p><strong>*Eight week structured plan now added to the 30 page course workbook</strong></p><p>This course is for designed for anyone who experiences anxiety in the form of excessive worrying, feelings or fear, or rumination; and also for those who feel stuck in life, and lack the motivation or the self-confidence to get things done and move forward. Anxiety is unavoidable, but this course will teach you how to change your relationship with it in order to stop it guiding your actions when it's not to your benefit. Throughout the course you will learn, at your own pace, a set of simple yet powerful practices that you can incorporate into everyday life to help break the cycle of anxiety, stress, unhappiness and exhaustion.<span></span></p><p>The course is made of three major sections; Creating a Foundation. Dealing with Anxious Thoughts and Feelings, and Taking Action. There is also a section on Emergency Exercises, that can help you calm down in very anxious and stressful situations. You'll be walked through the process step by step, with expert guidance all the way through and a course workbook with all the exercises and main points in detail. Each section provides daily exercises and tasks that require you to practise and take action, along with audio exercises that you can listen to on your computer, laptop, tablet, or phone.</p><p>The course is based on research and practices from mindfulness, health psychology, and Acceptance and Commitment Therapy.</p>", 
    "end_date": null, 
    "title": "No Nonsense Self Help: Overcome Anxiety in 56 Days", 
    "price": "25.00", 
    "instructors": "Dr Matthew Lewis", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/228900_6a94_4.jpg", 
    "course_url": "https://www.udemy.com/overcome-anxiety/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-25T14:15:00Z"
}