{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p></p><p>The only constant in life is change. When we lose or leave  our jobs, a relationship ends, our health suffers, or other major life change  occurs, we often enter a period of darkness and pain. In times of transition,  we are like hermit crabs: having kicked off our shells that are too small, now  taking those vulnerable steps toward a new home that is ultimately bigger and  better for us. This seminar will inspire you to take the leap  toward that bigger shell and to maintain faith and focus until you get there.</p><p></p><p></p><p><strong style=\"\">Featuring:</strong></p><p></p><ul style=\"\"><li>Laurie presents key tips and strategies to effectively navigate the eight stages of transition.</li></ul><p><strong style=\"\">NOTE:&nbsp;</strong><span>This seminar is the 2nd of 6 in Laurie Gardner&#039;s Courageous  U series, &quot;Big Shell or Bust: Making and Managing Change.&quot; Enroll in  each seminar separately or enjoy the whole series.</span></p><p></p><p>Also note that this seminar was originally offered as a live  teleseminar. Udemy participants who have questions should type them on Udemy  rather than following the instructions for phone Q &amp; A.</p><p></p><p><strong style=\"\">What people are saying about &quot;Now What?&quot;:</strong></p><p><em style=\"\">“Laurie’s seminars are clear, fluid, positive, and authentic. Thank you!”&nbsp;&nbsp; - Michelle C., Boston, MA</em></p><p><em style=\"\">“Laurie’s enthusiasm and insights make it all seem possible!”&nbsp;&nbsp; - Shelley H., Mill Valley, CA<br style=\"\"></em></p><p></p><p></p>  ", 
    "end_date": null, 
    "title": "Now What?", 
    "price": 0, 
    "instructors": "Laurie Gardner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/40021_e1b9_7.jpg", 
    "course_url": "https://www.udemy.com/now-what/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-04T22:12:28Z"
}