{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em style=\"\">(Atualizado a 02 de Abril de 2015)</em></p><p><strong style=\"\">«40% da nossa capacidade para sermos felizes está relacionada com a nossa capacidade de mudança».</strong> (estudo da conceituada investigadora Sonja Lyubomirsky da Universidade da Califórnia, publicado na revista científica Psychology Today).</p><p>Passei os últimos 23 anos da minha vida a procurar ativamente aquilo que estás prestes a receber. Tu não precisas de fazer a travessia no deserto: tens isto.</p><p>É muito simples. Cada uma das etapas é um passo para ti, entre o ponto onde estás e aquele onde queres ir. E <strong style=\"\">tens-me do teu lado</strong> - sou do tipo que responde a mensagens, dúvidas e esclarecimentos em menos de 24 horas (e que os resolve). E também te ofereço suportes não digitais para te orientares no mundo real.</p><p>Não há necessidade de complicar: foi essa uma das coisas que me bloqueou vezes sem conta. Neste processo mostro-te os verdadeiros<strong style=\"\"> segredos das transformações de sucesso</strong> - e como as podes criares na tua própria vida.</p><p>Tens aqui a oportunidade de:</p><p>- Encontrares a verdade da tua situação;</p><p>- Libertares a tua voz interior para criares a visão mais significativa e emocionante para essa mudança que consigas imaginar;</p><p>- Perceber o que deves fazer e quais os passos para a concretizar;</p><p>- Criares as condições para entrares em ação de forma sustentada ao longo do tempo;</p><p>- Preveres vários dos contratempos que podes encontrar e como os superar;</p><p>- Bónus poderosos que te ajudam ainda mais a adaptares o que aprendeste à tua situação.</p><p><span><strong style=\"\">Este processo é simples e poderoso - e funciona</strong></span>. Funcionou na minha vida, nas vidas dos meus clientes e nas vidas dos inúmeros casos de sucesso que tive oportunidade de estudar em detalhe. </p><p>Mas não é um passeio no parque: terás de fazer a tua parte. Para além do óbvio (€), como em tudo na vida (que vale a pena) tens também de investir<strong style=\"\"> a</strong><strong style=\"\"> tua atenção, energia, e foco - e confiança</strong> no processo. Vou ajudar-te.<br style=\"\"></p><p>Todos temos dons incríveis dentro de nós, e podemos aceder-lhes de inúmeras formas. Grande parte das vezes só não sabemos como os usar.</p><p>Se faz sentido para ti, <strong style=\"\">estendo-te a mão</strong>. Vemo-nos do outro lado.</p>", 
    "end_date": null, 
    "title": "O Mapa Da Transformação", 
    "price": "20.00", 
    "instructors": "Júlio Barroco", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/242722_cf5e_4.jpg", 
    "course_url": "https://www.udemy.com/o-mapa-da-mudanca/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-13T12:49:11Z"
}