{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>&quot;...Shame causes us to feel that we are unacceptable.&quot; - Norman Bales, Coping With Shame and Guilt</p><p>The conflicting messages about sex and sexuality are so pervasive in our culture, it&#039;s no wonder so many of us are confused.  We are taught that our bodies are inherently shameful, that our sexual thoughts, feelings, and desires, are wicked.  Yet we see sexual imagery all around us, encouraging us to buy all manner of products.  We are supposed to conform to a certain standard of attractiveness and desirability, but maintain our virtue, chastity, and modesty.</p><p>If we deviate even slightly from our locally accepted, currently fashionable, socially imposed &quot;norms&quot; we are shamed.  As a result, you might have troubles fully accepting and embracing your sexuality, and this can often lead to challenges in your intimate relationships.</p><p>Through 7 video lectures, you will explore:</p><ul style=\"\"><li>What Is Shame?</li><li>Where Does Shame Come From?</li><li>Tips and Tricks to Overcome Shame</li></ul><p>By overcoming shameful thoughts and feelings about sex in general, or perhaps specific sexual thoughts, desires, and / or behaviors, you will be able to have a happier, more fulfilling, more deeply intimate sex life with the partner(s) of your choice.</p>", 
    "end_date": null, 
    "title": "Overcome Shameful Thoughts and Feelings, to Have Better Sex!", 
    "price": "30.00", 
    "instructors": "Tani Barr", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/471532_11f4_2.jpg", 
    "course_url": "https://www.udemy.com/overcoming-shame-with-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-09T04:35:51Z"
}