{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is a step-by-step guide to overcome any bad habit and develop a good one. It's meant to remove the barrier standing between you and your goals - your poor routines and the lack of healthy ones. </p><p>No prior knowledge is required to successfully utilize this course. In the lessons, I will teach you everything you need to know to drop a bad habit and develop a healthy one. </p><p>Inside the course, you'll find video lessons, quizzes, as well as exercises to do to make the process of overcoming/developing a habit as easy, pleasant, and most importantly effective as possible. </p><p>There is about 60 minutes of video content, but the length of the actual process of overcoming or developing a habit can vary. For some people it's going to be extremely easy, but for some it can be quite challenging. It depends on how long the habit has been present in your life and how immune you are to it, as well as how difficult the habit you want to develop is. On average, it should take students about a month to fully break an unhealthy routine and another month to develop a habit that is going to get them closer to their goal. </p><p>This course is meant for anyone that:</p><ul><li>Knows they have a bad habit or habits and want to break them, but can't succeed. </li><li>Wants to develop a healthy routine</li><li>Isn't sure why they are not where they want to be in life</li></ul>", 
    "end_date": null, 
    "title": "Overcome & Develop Any Habit: Use Full Potential in Life", 
    "price": 0, 
    "instructors": "Adam Kwiatek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822820_1ac9_3.jpg", 
    "course_url": "https://www.udemy.com/break-a-habit/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T13:49:21Z"
}