{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li><em style=\"\"><strong style=\"\">Più di 70 studenti soddisfatti hanno scelto questo corso</strong></em></li><li><em style=\"\"><strong style=\"\">Media voto di 5 stelle, la più alta della categoria Formazione</strong></em></li></ul><p><br style=\"\">Ti è mai capitato di trovarti in una situazione in cui non sapevi cosa fare e in cui avresti avuto bisogno di una mano per uscirne? Oppure vivi la sensazione di non avere abbastanza tempo per fare tutto ciò che dovresti, e stai perdendo così parte della tua serenità? <br style=\"\"><br style=\"\">In questo corso scoprirai cosa ti guida e come motivarti a raggiungere i tuoi obiettivi e vivere una vita organizzata in funzione del tuo scopo ultimo; imparerai a gestire il tuo tempo in maniera efficace e a scegliere le attività su cui concentrarti, e riuscirai ad avere più tempo libero!</p><p style=\"\">Ti guiderò infatti alla scoperta e alla creazione dei tuoi valori, delle tue regole, della tua mission personale e della tua vision. Ti aiuterò a scegliere i ruoli migliori per quello che vuoi realizzare nella tua vita, ti aiuterò ad impostare i tuoi obiettivi annuali, mensili e settimanali. Scoprirai un metodo di gestione del tempo di ultima generazione,  per trasformare i risultati che desideri in azioni quotidiane che ti porteranno al raggiungimento dei tuoi obiettivi. </p><p style=\"\">Ti aiuterò a sviluppare le abitudini per mantenere il sistema efficiente e per aumentare il tuo livello di felicità.</p><p style=\"\">Troverai all&#039;interno del corso numerosi video che ti spiegheranno la parte teorica, seguiti da uno o più esercizi da svolgere in totale autonomia. Solitamente bastano due giornate full immersion per completare il percoso formativo; comunque, se avessi bisogno di più tempo non c&#039;è nessun problema: potrai infatti riprendere gli esercizi in un secondo momento e completare il corso rispettando le tue tempistiche.</p><p style=\"\">Alla fine del corso, avrai la possibilità di fare una sessione di coaching live direttamente con me, nella quale avrai l&#039;opportunità di personalizzare il metodo a seconda delle tue esigenze e potrai fugare tutti i dubbi residui.</p><p style=\"\">Sarai così libero di organizzare la tua vita al meglio!</p><p style=\"\"><br style=\"\"></p>", 
    "end_date": null, 
    "title": "OYL - Organize Your Life", 
    "price": "50.00", 
    "instructors": "Daniele Rumbolo", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238394_ef62_3.jpg", 
    "course_url": "https://www.udemy.com/oyl-organize-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-06T13:53:15Z"
}