{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Maharishi Patanjali’s keen insight into the inner workings of Yoga is interpreted for the modern day life by Sri Sri Ravi Shankar. Sri Sri’s commentary on the Yoga sutras of Patanjali makes this deep wisdom practically accessible to the whole world!</p><p>For a large majority of us in the West, our understanding of Yoga is limited to physical postures (called Asanas). In his authoritative text on Yoga, the foremost authority on the subject, Maharishi Patanjali, gives us a keen insight into what exactly is meant by Yoga. </p><p>This treatise, \"The Yoga sutras of Patanjali\", consists of 195 aphorisms (aka sutras). Of these 195 sutras, only 3 are about physical postures! Through the remaining 192 sutras, Maharishi Patanjali sheds light on the inner workings of the mind, its tendencies, modulations and states into which it gets stuck and how to overcome them. He skillfully guides us through so that we can get a firm understanding of 'who we are' and experience our nature which is pure joy.</p><p>Over 11 sessions, Sri Sri Ravi Shankar gives a modern day interpretation of the Yoga sutras of Patanjali. Sri Sri’s keen insight and scintillating wit transforms this course into a wondrous journey of self exploration and deep understanding. The student is transformed and empowered!  </p><p>Each session consists of about an hour long video in which Sri Sri walks us through <em>the Yoga Sutras of Patanjali</em>, explaining them with stories and practical real life examples that everyone can relate to easily. At the end of each video we would like to encourage everyone to participate in a discussion on the commentary that you watched. You may feel like contributing right after watching the video or later after you had time to ponder on some of the wisdom that you heard on the video.</p><p><strong>Some of the setup and discussion points that we recommend after every session:</strong><br></p><p>- what resonated with you from the video? It may have caused you to stop and think. Maybe it reminded you of a pattern that you get stuck in at times or see others stuck in.</p><p>- how do you see the patterns, obstacles, solutions etc. mentioned by Maharishi Patanjali playing out in your own life. Sharing concrete examples from your own life will make the discussion so much more rich and meaningful for you and everyone!</p><p>- How would you like to implement few things from what you heard in the video. It is said that when you practice and perfect what you \"know\" (knowledge) it transforms into wisdom which in turn brings you freedom and happiness!</p><p>- You may share the above by going to the discussions / comments tab and look for the lecture that you would like to contribute for. You can share your insights in the comments section of that discussion topic.<br></p><p> - By your contribution and sharing, you would be adding to the richness of the learning experience not only for you but for everyone!  Encourage each other to participate. The learning process becomes so much fun when everyone does!</p><p>You are free to determine your own pace for completing the 10 lecture series. We do recommend leaving at least a day between each lecture to give yourself time for self-reflection.<br></p><p>We highly recommend that you watch each lecture in one sitting, without any distractions. This may require you to make sure that you will not be disturbed for the duration of the lecture.<br></p><p>We wish you a very joyful journey of self-exploration and learning, through this course !<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Patanjali's Yoga Sutras (Part 1) ", 
    "price": "50.00", 
    "instructors": "Sri Sri Ravi Shankar", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679814_7f16_8.jpg", 
    "course_url": "https://www.udemy.com/patanjalis-yoga-sutras-commentary-by-sri-sri-ravi-shankar/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T19:50:24Z"
}