{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>There maybe times when you feel overwhelmed by life, not coping or really enjoying what you are doing or have, feeling stressed and anxious. Sometimes we are so busy and saturated with information that we can barely keep up with ourselves let alone anyone else. If you recognise any of this you are in the right place!  This course will give you a better quality of life everyday and give you the best chance to feel happy and thrive.</p><p>During this course you will learn a unique series of techniques and tools that are simple and easy to use, but powerful in enabling you to still the mind and to fully connect to all of who you are; present, aware and in flow – and to be so at will. Regular practice of these techniques can support you in being at your best enjoying; vitality, creativity, accessing a higher level of intelligence and living your life to the full, so that you can thrive.</p><p>Science has taught us that everything is made up of energy, which is there for us to sense and use as data input. Becoming aware and in charge of this energetic influence allows us to operate from our highest self, feel at our best and manage how we influence others.</p><p>As we operate from our highest self we are able to access a wider expanded experience: wisdom, knowing, creativity, vision, passion and purpose, peace, happiness, love, joy, genius, brilliance - when we enter this state all realisations exist. Ultimately, we sense the energy of our full potential and an unconditioned Quantum level of intelligence, this goes beyond IQ and Emotional Intelligence. We can tap into a much bigger more visionary energy, connected in this way we are able to see through the detail to the big picture and purpose of things.</p><p>In essence, the impact of accessing this energetic state is that you feel relaxed and calm, confident, have a sense of well-being and peace, giving you the best opportunity to manifest your dreams and happiness and have a far-reaching positive impact, on yourself, others and the world around you.</p><p><strong style=\"\">The course is video based and we have also included participant course notes to make a comprehensive experience for you.  There are lectures giving detailed context and experiential exercises.  These are quick and user friendly.</strong></p><p><strong style=\"\">During the course we will be exploring with you:</strong></p><p>The Zones of Personal Energy and management</p><p>A theoretical/scientific context so you understand how and why the techniques work</p><p>The three levels of Presence</p><p>You will experience a series of exercises to shift your awareness to a higher vibrational level</p><p>You will learn how to be fully present and access your Knowing, Wisdom and a heightened Quantum level of intelligence – all of who you are</p><p>And how to apply this in your daily life</p><p><strong style=\"\">A few things that people have said:</strong></p><p><em style=\"\">\"I feel so much more alive, energized and back to my full power. My limiting beliefs have gone\"</em></p><p><span><em style=\"\"> “I loved the deepness and clarity and authenticity of your work. You could tell that you embody what you teach. You had a grounding presence and passion. Thank you for your care, sensitivity, wisdom and generosity.\"</em></span><span><em style=\"\"> </em></span><em style=\"\"></em></p><p><em style=\"\">“You were inspirational, supportive, totally authentic and courageous.”</em></p><p><em style=\"\">“Passionate, great fun to be with and dive into new territory to unleash the potential that waits for us there.\" <em style=\"\">Soleira Green</em></em></p><p><strong style=\"\">We are really excited to be sharing this with you.</strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Personal Energy Mastery - Mindfulness and Beyond", 
    "price": "20.00", 
    "instructors": "Penny Mallinson & Sue Coyne, Sue Coyne", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/601710_9189_2.jpg", 
    "course_url": "https://www.udemy.com/personal-energy-mastery-mindfulness-and-beyond/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-03T18:53:15Z"
}