{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Before there can be Personal Improvement there must first be Personal Awareness!</strong>  </p>  <p>  \t<span>In the first of a three part series, we will explore your <strong>values</strong>, <strong>thought patterns</strong> and <strong>emotional patterns</strong> and how they have been shaped, influenced and/or impacted by your life’s experiences.</span>  </p>  <p>  \t<span>Once you discover your true values, thought patterns and emotional patterns, you will discover the difference between <strong>rational decisions</strong> and <strong>emotional decisions </strong>as well as the strengths and weaknesses of each.  This is important because we must understand that our lives are made up of a pile of decisions, and without the right knowledge and understanding, the decisions we make can have a negative impact on our lives as well as on the lives of those we care about.</span>  </p>  <p>  \t<span>Lastly, after going through the Personal Exploration process, we will make the difficult skill of Personal Awareness simple by going through a practical, easy to understand chart that explains the <strong>Levels of Awareness</strong>.</span>  </p>  <p>  \t<span>This workshop requires courage to discover more truth about yourself, which will give you the foundation to attain the success you have always dreamed of.</span>  </p>", 
    "end_date": null, 
    "title": "Personal Exploration", 
    "price": "20.00", 
    "instructors": "Terry Fulton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392266_e031_3.jpg", 
    "course_url": "https://www.udemy.com/personal-awareness-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T17:56:49Z"
}