{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>A place where you can start your journey towards financial freedom.</strong></p><p><em>“It’s bonkers when you really think about it…”</em></p><p><em><br></em></p><p>In our world today, the majority of adults report feelings of “<strong>not having enough</strong>”, they report that they <strong>aren’t satisfied with their current lifestyle, </strong>and they report that there just isn’t enough time, money or motivation to make any real change in their lives…</p><p>If you can relate to this, it just means you are part of the 97%... </p><p>To make matters worse, these feelings won’t go away when you’re able to make more money.</p><p>The way we were socially conditioned from birth, right through your schooling years, through college and or university, from the time you got your first job… </p><p>You were conditioned to believe that spending money to buy “things” will get you happiness, that spending money will make you feel satisfied…</p><p><strong>This however is futile.</strong> Money does not equal happiness… Happiness is all about your perception.</p><p>If you continue to live life by conventional wisdom, you’ll only ever get the same results as the “norm”… which isn’t right, wrong, good or bad, it’s just how it is.  If you’re content to keep getting normal results just like everyone else, that’s awesome, there’s nothing more you really need to do, just keep plotting along.</p><p>If you’d like improve your life’s results on the other hand, if you’d like to authentically increase your life’s results for more wealth, time and more freedom… </p><p><strong>It requires you to think differently than the majority of society.</strong></p><p>It requires you to question the social norms and the conventional ways of thinking around money, it requires you to take action – which will feel uncomfortable.</p><p>Financial freedom usually costs much less than people think… Most people however don’t believe this, they think they are destined to live out their lives struggling, hoping one day they’ll get that “lucky break”.</p><p><strong>When you can make your desire for change, greater than your desire to avoid the fear of failure</strong>, you’ll begin to see lots and lots of opportunities around you. Solutions will appear, seemingly out of nowhere.</p><p>Sadly, the majority of the population never reach out for these opportunities… The familiarity and safety of their “comfort zones” just doesn’t seem worth the “risk”, instead they continue to do the same things over and over again, year after year, decade after decade. </p><p>If you can be ok with feeling uncomfortable for a while, whilst you learn new ways of thinking about the world and your personal freedom, you’ll find opportunities in abundance, this will save you decades of sameness… It’ll save you decades of feeling like you don’t have enough.</p><p><strong>Within this course</strong>, I’ll uncover how I was able to change my money foundations and break free from the “<strong>money stress</strong>” and bring forward “<strong>money freedom</strong>”, and you’ll learn how you can do the same.</p><p>You’ll learn how to start rebuilding your emotional and psychological money foundations so that you’ll <strong>stop self sabotaging</strong> your attempts at “how to” courses and strategies.</p><p>When you search around, especially on <span>Udemy</span> you’ll find thousands of “how to” courses... Most of which have sound strategies that actually work. </p><p><strong>What’s missing</strong> however is <strong>the upgrade in psychology</strong> that’s needed to actually become successful in that area.</p><p>Have you ever attempted a new course, only to quit after you became stressed and frustrated? Did you end up moving back to the same results as you were already getting? Don’t be so hard on yourself, this is all part of your conditioning.</p><p><strong><em>You can break free… </em></strong>and you do this by rebuilding your money foundation so that they support a high quality of thoughts, a higher quality of happiness and a higher quality of mind… Which usually comes with a side effects of increased wealth, personal space and the availability of more personal time.</p><p>This course is backed by <span>Udemy's</span> 30-day money back guarantee, try it out now, just think about all you have to gain… </p><p><strong>Imagine... how much of your life can be improved…</strong></p><p>Once you enroll into this course, and you decide, you don’t think this course is for you…</p><p>Request a refund and you’ll get every cent back!</p><p><u><strong>Enroll in this course now and start thinking your way to more wealth, more time and more freedom.</strong></u></p>", 
    "end_date": null, 
    "title": "Personal and Financial Mastery For Fiscal Freedom", 
    "price": "25.00", 
    "instructors": "Mark Jeanes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765152_b9e2_2.jpg", 
    "course_url": "https://www.udemy.com/personal-and-financial-mastery-for-fiscal-freedom/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T06:33:21Z"
}