{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Welcome to this course on Personality Development. Its unique features are as follows :  </p>  <p>  \t      1. It is holistic, covering all levels of human existence viz. Physical, Mental, Emotional &amp; Spiritual. It introduces you to your real Self which is behind your appearance and which has limitless potential to empower and guide your life. The methodology  therefore is &#039;inside out&#039; - growing from within.  </p>  <p>  \t      2. It takes an integrative and spiritual view of life and yet has a scientific approach all along. Even as it suggests a spiritual outlook, it refers to supportive modern findings in supersciences like Aura, Brain Waves, Mind-Body Wellness research, Psycho-neuro-immunology and neuro-Cardiology, etc.  </p>  <p>  \t      3. With deep insight yet in a simple language, it reveals that our personality is not something that we unchangeably are, but something that we ourselves have created through our conscious or unconscious past choices in thoughts, lifestyle habits, values, perceptions, attitudes etc.. And therefore, it can be changed by changing those same inputs.  </p>  <p>  \t      4. Through a step-by-step method, the students are led to understanding how to transform their personalities physically, psychologically and spiritually. The body and mind affect each other, and soul affects both of them.  </p>  <p>  \t      5. There are 14 lectures ; all are engaging videos except just one which is in audio format. There are supplementary resources including PP slides, motivation-in-a-minute videos which were telecast earlier, some popular blogs, etc.  </p>  <p>  \t      6. What is shared is not borrowed from books, but learned practically the hard way from actual life with guidance from great Masters. It is backed by a total work experience of 42 years, plus a parallel exposure to yoga-meditation principles and practices for over three decades.  </p>  <p>  \t      7. The course includes wellness tips and useful material on career growth / professional excellence, besides how to have positive attitudes in resolving stress and conflicts of life, how to be confident, how to motivate oneself, how to convert adversities into opportunities and setbacks into encouragement, etc. Everyone these days is advised to have positive attitudes but no one explains how to develop them ; this course explains where attitudes come from - the level at which we must work, etc. Similarly, we all like self-confidence, but do we know the roots within where confidence can be drawn from ? This course deals with all of that.  </p>  <p>  \t      8. Everyone, not just students, will find this course very inspiring, eye-opening and practically useful. You do not have to be religious to understand the essential spiritual aspects shared here ; all you need is an open mind. Even successful managers / executives / self-employed professionals / entrepreneurs / housewives / trainers / coaches will find the insights useful to them.  </p>  <p>  \t      9. Names of some life-transforming books and a couple of free downloads are shared in the end to help students beyond this course.  </p>  <p>  \t      10. The price has been kept affordable and the course offers a great value for your money.  </p>", 
    "end_date": null, 
    "title": "PERSONALITY DEVELOPMENT : Growing From Within !", 
    "price": "30.00", 
    "instructors": "Mr. Hans Dholakia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/347126_83be_9.jpg", 
    "course_url": "https://www.udemy.com/personality-development-holistic-all-round/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T07:56:15Z"
}