{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tThis course is about making changes to your habits and personality so that you can make modifications to the way you see things and the way you perceive things. Making such modifications allows you to bring you to the next level. Now you might be thinking, what&#039;s on the next level? For some, its success, for others, its wealth, and for still more, its personal growth and development, and there might be others who have other forms of reaching the next level.  </p>  <p style=\"\">  \tThe course is done in a lecture manner, takes about 1 hour and with over 40 lectures, it details the method to understand yourself, your characteristics and personality. And upon understanding such characteristics, we are able to work on areas such as your diet, your activities, your thinking process, etc to bring about a betterment of your life perspective and development. And when you have a betterment of your life perspective and development, you can reach that next level much more easily.  </p>  <p style=\"\">  \tJust imagine for a moment, being able to attain what you always wanted, that much more easily, just by making some modifications that are so small and slight, and yet, has such potential for growth. This is Personal Fengshui, using Fengshui for your own Personal Success.  </p>  <p style=\"\">  \t<span style=\"\">This course is for everyone and anyone who wants to make the best of their life and achieve their utmost in their capabilities and see the success that they are born to be. Although of course, if you do not want to take this course, it is understandable that you are comfortable with the life you have now, so much so that change become something that is not welcomed at times, and there are some people like that. However, for those who wish to change themselves and improve their lives, then please go on ahead and register in Personal Fengshui To Your Success, and I wish you the best!</span>  </p>", 
    "end_date": null, 
    "title": "Personal Feng Shui to Your Success", 
    "price": "20.00", 
    "instructors": "Max Liang", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/315600_4e77_3.jpg", 
    "course_url": "https://www.udemy.com/ffs-personal-feng-shui-to-your-success/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-08T06:46:49Z"
}