{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Imagine lograr transformar sus recuerdos pasados, recodificar y resignificar sus temores y emular el éxito de los demás.</strong><br></p>\n\n\n\n<p>En este curso, Juan David Arbeláez -Coach, escritor y conferencista internacional- le explica de manera simple y ultra-práctica, cómo sacar provecho de la programación neurolingüística (PNL)  para reprogramar esa poderosa súper computadora que es nuestra propia mente. </p>\n\n\n\n<p><strong>Un curso básico pero lleno de contenido práctico, en donde usted aprenderá:</strong></p>\n\n\n\n<ul><li>Qué es y qué no es la PNL</li><li>Cómo operar su Panel de Control Mental</li><li>Una técnica para destruir sus miedos y transformar sus recuerdos</li><li>Una técnica para generar hábitos y cambiar una conducta por otra</li><li>Secretos de empatía y lenguaje corporal</li><li>3 secretos lingüísticos y varias palabras que bien podrían considerarse \"Mágicas\" para transformar su entorno, e influenciar a los demás.</li><li>Herramientas de excelencia, liderazgo y negociación con PNL</li><li>Una técnica para modelar el éxito de los demás</li></ul>\n\n\n\n<p>¡Y muchas otras cosas más!</p>\n\n\n\n<p><strong>Mucho se dice sobre la programación neurolingüística, l</strong><strong>astimosamente no todo es cierto.</strong></p>\n\n\n\n<p>Si usted cree que es posible llegar a hipnotizar a los demás o someterlos a todos sus caprichos. </p>\n\n\n\n<p>Pero si usted es una persona que le interesa lo práctico y aplicado, y desea conocer técnicas sencillas de PNL para implementar en su propia vida, aquí y ahora, usted ha llegado al lugar correcto.</p>\n\n\n\n<p><strong>¿Y quién es Juan David Arbeláez para explicarle PNL?</strong></p>\n\n\n\n<p>Empresario, escritor y conferencista. Fundador de dos compañías de desarrollo de software. Ha creado más de una docena de productos acreditados en Colombia como desarrollos innovadores de alta tecnología, licenciados por cientos de compañías a nivel mundial. </p>\n\n\n\n<p>Autor de varios libros sobre empoderamiento. Sus presentaciones han sido vistas por las más prestigiosas empresas colombianas y miles de espectadores en todo el país.</p>", 
    "end_date": null, 
    "title": "PNL YA - Programación Neurolingüística práctica y rápida", 
    "price": "20.00", 
    "instructors": "Juan David Arbelaez", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625088_3b18.jpg", 
    "course_url": "https://www.udemy.com/pnl-practica/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T20:01:09Z"
}