{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>¡Conviértete en un Experto Practitioner en PNL!</p><p><strong>Curso en PNL (Programación Neurolinguística) Nivel Practitioner III (Experto)</strong></p><p><em>¿Conoces ya los fundamentos y técnicas más conocidas de la PNL y te gustaría llevar tus habilidades en PNL al siguiente nivel, al nivel de experto? </em></p><p><em>¿Te gustaría aprender las técnicas más potentes de PNL a nivel profesional?</em></p><p>Este curso es para todos: Tanto si trabajas en el mundo de la empresa, la salud, la educación, el deporte, el arte, como si eres emprendedor o empresario, o como si simplemente estás interesad@ en el área de desarrollo y crecimiento personal, este programa es para ti.</p><p>Con él, adquirirás nuevas habilidades expertas de PNL (Programación Neurolinguística) fácil y cómodamente, pudiendo desarrollar todo tu potencial personal y también, si lo deseas, trabajar profesionalmente con otras personas como un experto en PNL</p><p>Juntos, profundizaremos en las herramientas y técnicas expertas de PNL en el Nivel Practitioner:</p><ul><li><strong>Técnica \"Visual Squash\"</strong> - Descripción, Explicación y <strong>Demostración \"EN VIVO\"</strong> con una personal real</li><li><strong>Técnica \"Swish\"</strong> - Descripción, Explicación y <strong>Demostración \"EN VIVO\"</strong> con una personal real.</li><li><strong>Técnica \"Chocolate Godiva\"</strong> - Descripción, Explicación y <strong>Demostración \"EN VIVO\"</strong> con una persona real</li><li><strong>Introducción a los Meta-Programas </strong>(¿Qué son? ¿Para qué sirve? ¿Cómo usarlos?)</li><li><strong>Meta-Programa \"Contemplativo - Orientado a la Acción\"<br></strong></li><li><strong>Meta-Programa \"En el Tiempo - A través del Tiempo\"<br></strong></li><li><strong>Meta-Programa \"Independiente - Grupal\"<br></strong></li><li><strong>Meta-Programa \"Interno - Externo\"<br></strong></li><li><strong>Meta-Programa \"Asociado - Disociado\"<br></strong></li><li><strong>Meta-Programa \"Una Vez - Varias Veces\"<br></strong></li><li><strong>Meta-Programa \"Similitud - Diferencia\"<br></strong></li><li><strong>Meta-Programa \"Hacia - Lejos de\"<br></strong></li><li><strong>Meta-Programa \"Global-Específico\"</strong></li><li><strong>Preguntas para Elicitar Meta-Programas</strong> (Descripción, Explicación y Demostración \"En Vivo\" con una persona real.</li><li><strong>Demostración EN VIVO</strong>, con una personal real, de <strong>Elicitación de Meta-Programas</strong> (4 Partes)</li><li><strong>Cómo Preparar tu Primera Intervención Profesional</strong> como Experto en PNL</li><li>Y mucho más...</li></ul><p><strong>&gt;&gt; PREGUNTAS FRECUENTES &lt;&lt;</strong></p><p><strong>P: ¿Qué obtengo cuando me incorporo al Cuso PNL Nivel Practitioner III?</strong></p><p>R: Obtienes:</p><p>Acceso instantáneo al Área Privada de Miembros, a todas las Video-Lecciones, a las Fichas Temáticas descargables y al Manual del Curso</p><p>¡Más de 16 Clases y 4 Horas de Contenido de Altísima Calidad!</p><p>Soporte personalizado vía emaildurante la duración completa de los estudios, hasta la expedición del Certificado de Nivel.</p><p><strong>P: ¿Es este un Curso de Certificación en el Nivel Practitioner?</strong></p><p>R: No. Este es un Curso de Entrenamiento, no de Certificación, en PNL.Y al mismo tiempo, los contenidos del curso son totalmente equivalentes a - y en muchos casos, más completos y actualizados que -los impartidos en el nivel de certificación practitioner.</p><p>Si estás interesado en realizar un Programa de Certificación Oficial en PNL, te recomendamos nuestros Programas de Certificación Internacional por la AUNLP (R) - American Union of NLP - Puedes acceder a ellos AQUÍ: www(punto)uapnl(punto)com</p><p><strong>P: ¿Existe algún soporte personal (para dudas, preguntas, etc.) durante la realización del programa?</strong></p><p>R: Sí, existe soporte por correo electrónico a todos los miembros durante todo el tiempo de estudio del curso hasta la consecución del Certificado de Cumplimiento.</p><p><strong>P: ¿Recibo algún tipo de Certificación?</strong></p><p>R: Sí, recibes la Certificación Oficial de Cumplimiento del curso de Udemy.</p><p><strong>P: Cuánto tiempo dura el Programa?</strong></p><p>R: El programa está diseñado para ser estudiado al ritmo individual que cada persona elija tener. Recomendamos dedicar un mínimo de 2-3 horas semanales con regularidad y practicar cada semana. Esta flexibilidad, te permite realmente organizarte a tu propio ritmo.</p><p><strong>P: ¿Voy a recibir una formación adecuada con su Programa de Entrenamiento Online?</strong></p><p>R: Absolutamente. Si bien lo ideal sería que un Trainer Certificado en PNL te entrenara durante un programa de entrenamiento presencial, por desgracia, este lujo no es práctico para muchas personas. Cuando tenemos en cuenta los desplazamientos, hoteles, tiempo fuera del trabajo y la familia, etc., los costos ascienden rápidamente. Por esta razón, muchas instituciones se han dirigido a la formación online como una alternativa viable para satisfacer las necesidades de hoy en día. De hecho, las Universidades de Columbia, Harvard y Cornell tienen multitud de programas de entrenamiento online, así como Penn, Dartmouth y Yale, que también ofrecen cursos en línea. José Luis Yañez, mientras trabajaba en su Master Científico en Comportamiento Organizacional por el Birkbeck College de la Universidad de Londres, ha trabajado y estudiado ampliamente con programas online ofrecidos por estas universidades. A continuación, ha sido capaz de modelar este Curso Online en PNL por Udemy para ofrecer un nivel similar de formación.</p><p><strong>P: ¿Existe alguna exigencia de licencia para los profesionales de la PNL?</strong></p><p>R: En este momento,hasta donde alcanza nuestro conocimiento, no existen requisitos de licencia oficial para practicantes de PNL en ninguna parte del mundo. Es tu responsabilidad, si emprendes algún negocio orientado a servicios profesionales, obtener las licencias necesarias para operar tu negocio, así como las licencias oficiales en tu país para la práctica profesional, regulada oficialmente, de la psicología o medicina si quieres ofrecer consejo, diagnóstico o tratamiento médico oficial. Este Programa de Entrenamiento en PNL no tiene por objeto permitirte dispensar consejo médico, hacer un diagnóstico médico, o proporcionar tratamiento médico.</p><p><strong>P: ¿Quién en realidad enseña el programa?</strong></p><p>R: El programa se imparte en línea por José Luis Yañez, Psicólogo Colegiado, Master of Science in Organizational Behaviour por el Birkbeck College de la Universidad de Londres, NLP Trainer &amp; Life Coach Master Practitioner por la AUNLP (R), certificado directamente por Steve G. Jones y Consultor, Formador y Coach Ejecutivo, con más de 20 años de experiencia profesional. Actualmente, Fundador y Presidente de +Lead-Map ©. José Luis entrena personalmente a cada estudiante ya sea en línea o en un entrenamiento presencial</p><p><strong>P: ¿Cuáles son las credenciales de José Luis Yañez como Entrenador?</strong></p><p>R: José Luis Yañez tienemás de 20 años de experiencia como Consultor, Directivo y Coach, habiendo desempeñado roles de responsabilidad gerencial y directiva en empresas como Ernst &amp; Young (Manager Executive Search &amp; Selection), Amadeus GTD (Manager HR Development and Career Management) y Xfera -Yoigo- (Director Human Resources Planning &amp; Development).</p><p>Ha trabajado como consultor para multitud de corporaciones nacionales y multinacionales entre las que podemos mencionar Pepsico International, Citibank, Vodafone, Microsoft, GE, BBVA, y un largo etcétera.</p><p>Actualmente, es Fundador y Presidente de +Lead-Map ©, marca de Consultoría especializada en Liderazgo Positivo y Rendimiento Humano</p><p>Educación y Certificaciones Académicas de José Luis:</p><ul><li>Licenciado en Psicología por la Universidad Autónoma de Madrid</li><li>Psicólogo Colegiado por el Colegio Oficial de Psicólogos de Madrid (número de licencia: M-07622)</li><li>Postgrado Universitario en Psicoterapia Psicoanalítica y en Psico-Diagnóstico por la Universidad Pontificia de Comillas</li><li>Master en Dirección de Recursos Humanos por el Instituto Directivos de Empresa</li><li>Master of Science in Organizational Behaviour por el Birkbeck College de la Universidad de Londres</li><li>Certified NLP Trainer por la American University of NLP – AUNLP (R), formado directamente por Steve G. Jones</li><li>Certified Life Coach Master Practitioner por la American University of NLP – AUNLP (R), formado directamente por Steve G. Jones</li><li>Advanced Certified Clinical Hypnotherapist por la American Alliance of Hypnotists (R)</li><li>Certified in the Theory and Principles of Indirect Hypnosis, Ericksonian Psychotherapy and NLP por BRH (British Hypnosis Research), formado directamente por Stephen Brooks</li></ul><p><strong>P: ¿Ubicación?</strong></p><p>R: Internet</p><p><strong>P: ¿Fechas?</strong></p><p>R: Puedes comenzar en cualquier momento.</p><p><strong>P: ¿Duración?</strong></p><p>R: El tiempo mínimo recomendado para realizar el programa es de 3 Semanas y el máximo recomendado es de 3 meses. Cada estudiante elige realmente la duración del programa en función de su dedicación y preferencias. El programa es, en este sentido, totalmente flexible.</p><p><strong>P: ¿Fecha límite de inscripción?</strong></p><p>R: Ninguna. Puedes registrarte en cualquier momento.</p><p><strong>P: ¿Es necesario una titulación universitaria oficial o un master para realizar el curso y ejercer profesionalmente cómo especialista en PNL?</strong></p><p>R: No. En la mayoría de los países, nuestro programa es todo lo que necesitas.</p>", 
    "end_date": null, 
    "title": "PNL Nivel Practitioner III", 
    "price": "50.00", 
    "instructors": "Jose Luis Yanez", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/690250_6a57_3.jpg", 
    "course_url": "https://www.udemy.com/pnl-nivel-practitioner-iii/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-06T10:55:37Z"
}