{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><em><strong></strong></em><li><em><strong>Over 60,000 total students enrolled in my 20+ Udemy courses.</strong></em></li></ul><ul><li><em><strong>Overall 350+ reviews from happy students</strong></em></li></ul><ul><li><em><strong>Course updates based on students requirments</strong></em></li></ul><ul><li><em><strong>50+ minutes of bonus content</strong></em></li></ul><p><br></p><p><em><strong>“Powerful Goal Setting - Achieve Your Dreams HD Course</strong></em>\"\n  teaches you everything you need to know about achieving your dreams and setting up your goals . <em><strong>No skills required</strong></em>  and  experience, \nthis is great for anyone looking to take action and make a change ! I will offer you my experience and skills so you can copy paste my formulas.</p><p><em><strong>I am six figure marketer having experience in the mentoring an teaching fields years ago, I love helping people!</strong></em><br><br> You  will learn the professional \ntactics and formulas that I use every day  in my successful business and lifestyle.<strong> I am grateful and thankful for my beautiful life.</strong><br></p><p>By following my guide  you will have the ability to set up your goals and achieve your dreams definitely.<br>These formulas can be  implemented in the <strong>next couple of hours and you can see results by tomorrow</strong>, I tell you! It's amazing to see that changes you are looking for,imagine to work on your dream carefully and correctly ? To be in control of your life and achieve full happiness.<br><br><strong><em>Let's  face it: Our future is the most important right ? So we have to invest time and money to earn a better future.</em></strong><br><br></p><p>You\n will receive all the informations from any  corner  and everything you \nneed to know. So  basically you get everything from \n scratch just to begin shifting your mindset to the right level.</p><p>It's good for any life situation and it really helps, I won't bother you anymore with that long marketing messages as we both love to take action and make it happen, <strong>we love the challenges and results.</strong><br><strong><em>By\n  the end of this course you will have all the knowledge and skills  \nnecessary to work on your dreams and achieve your goals, I will teach you all. I promise.</em></strong><br><br>I really appreciate feedback from my students.I <strong>always</strong> respond to questions. (average response time 6 hours)</p><p><strong><em>Click the green button that says “Take This Course\" now and I'll see you on the other side.</em></strong></p><p><em><strong><strong><em></em></strong></strong></em><em><strong></strong></em></p>", 
    "end_date": null, 
    "title": "Powerful Goal Setting - Achieve Your Dreams HD Course", 
    "price": "20.00", 
    "instructors": "Scrembo Scrembo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/691086_b276.jpg", 
    "course_url": "https://www.udemy.com/powerful-goal-setting-achieve-your-dreams-hd-course/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-07T15:16:44Z"
}