{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">Are you tired of trying and failing?</strong>  </p>  <p>  \t    Do you set unrealistic expectations and then fail to follow through, only to be left with a mountain of guilt and shame?  Do you follow through as best you can, and then fail anyway?  Do you try everything, but nothing seems to stick? Something feels like it’s missing… but it always evades your grasp?  </p>  <p>  \t    Are you tired of the vicious cycle?  </p>  <p>  \t    If so, read on.  </p>  <p>  \t    People everywhere have trouble following their dreams and making them reality.  Maybe you’re one of them.  I know I was.  </p>  <p>  \t    MY  mind was locked in a prison of its own design. But then I became aware… and instead of using my mind to hold me back… I flipped a switch and…  </p>  <p>  \t    I used my mind to free myself and ACCELERATE EVERYTHING.  </p>  <p>  \t    Maybe you don’t realize that the depression and mental stress you feel is ruining your relationship with those around you.  Even in trace amounts… it’s poisonous.  </p>  <p>  \t    Maybe you just can’t seem to tackle problems as they arise.  They just accumulate until you end up in a more difficult and complex situation than you had originally.  </p>  <p>  \t    What if you knew how to treat the problem from the start?  What if you could stop that ripple effect, where everything gets so out of control that you just can’t handle it anymore… and you snap.  You have a breakdown, or a violent outburst, or you stay in bed all day, depressed, and never want to get out.  </p>  <p>  \t    Most people live with these issues every day.  It’s too scary to face their problems.  And no one’s judging your for it.  After all, it’s not your fault.  I was like you too, until I listened to that advice the homeless man told me.  </p>  <p>  \t    Everyone wants to live the life of their dreams… but the sad part is, no one teaches us how to do it… and we all have to start somewhere.  </p>  <p>  \t    I have great some GREAT news!  </p>  <p>  \t    We’ve created a program that will help you unlock the Power of Your Own Mind.  </p>  <p>  \t    There’s so much potential you have that is just WAITING to be tapped into.  And we’ll give you the keys to unlock your success.  With our Power of Mind program, you’ll immediately begin to make changes NOW and become the person you’ve always wanted to be.  </p>  <p>  \t    The power of mind program was created with the sole purpose of giving people the tools to train their minds…. It’s over a decade in the making.  </p>  <p>  \t    The power of mind program teaches you how to improve the most difficult situations:  </p>  <p>  \t    ✓Finances  </p>  <p>  \t    ✓Business  </p>  <p>  \t    ✓Relationships  </p>  <p>  \t    ✓Spirituality  </p>  <p>  \t    ✓Health  </p>  <p>  \t     ✓Fitness  </p>  <p>  \t    ✓Energy  </p>  <p>  \t     ✓Happiness  </p>  <p>  \t    ✓Satisfaction  </p>  <p>  \t     ✓Abundance  </p>  <p>  \t       And much more…  </p>  <p>  \t    Change comes from within…  </p>  <p>  \t    Have you ever thought about how you could change reality by changing the way you think?  </p>  <p>  \t    The power of your mind can help you make changes in all aspects of your life that you never thought possible.  </p>  <p>  \t    It all starts with the seed of “thought”.  </p>  <p>  \t    Control how you think and you can control your life. By making simple positive changes to your thought pattern, you can change your destiny.  </p>  <p>  \t    With The Power of Mind you will discover the very fundamental truths of your mind and inner powers that exist in every one of us. By applying the techniques provided, you are one step away, not just from a different mind, but a different LIFE.  </p>  <p>  \t    Of course, this is all something any “life coach” could teach.   The only difference is that they usually don’t practice what they preach, and they teach very badly, and they run, on average, about 20 times the cost of our program.  </p>  <p>  \t    Imagine being able to make as much money as you want.  To find the love of your life effortlessly.  Finally getting the body you’ve always wanted and then KEEPING it for the rest of your life… these are all APPARENTLY external goals… and yet the key to achieving ALL of them is found only in ONE place… your mind.  </p>  <p>  \t    Here’s just a taste of the things you’ll learn…  </p>  <p>  \t<strong style=\"\">Module 1: Positive Thinking </strong>  </p>  <p>  \t    Learn how reduce your stress, boost your health, overcome negative thoughts, and improve your life.  The POWER of Positive Thinking is the key to them all.  </p>  <p>  \t    How to apply the law of attraction to your thoughts, so that the goals you want become nearly effortless to achieve! How to live an optimistic life, so that negativity and misery don’t enter back into your life How to use positive self identification so your won’t SELF-SABOTAGE by feeling that you don’t deserve success  </p>  <p>  \t<strong style=\"\">Module 2: Critical Thinking</strong>  </p>  <p>  \t    A beginners guide to critical thinking that advances rapidly.  This easy-to-understand book outlines barriers, steps, and benefits of not just thinking… but knowing HOW to think… and how that changes EVERYTHING.  </p>  <p>  \t    A frame of mind that will guarantee that any problem you come across in the future can be handled with ease. The things to do that so that your mind never rusts away from disuse. The One Little known secret to amplifying your creative process and becoming 200% more productive.  </p>  <p>  \t<strong style=\"\">Bonus MODULE: The Champion’s Mindset</strong>  </p>  <p>  \t    The Champion’s Mindset is SO powerful.  The Champion’s mindset is an exploration the only thing that TRULY separates a winner from a loser: the competition itself.  </p>  <p>  \t    A surefire technique to overcome paralyzing fear, so you NEVER choke up when it counts The Winning Team Mindset: How helping others helps you far more than helping yourself.  </p>  <p>  \t     THE FOUR PILLARS of The Championship Personality “OFF THE COURT”: Responsibility, fairness, honesty, and compassion A way to be so persistent that you never deter from your goal, even for a SECOND.  This ALONE is worth TEN TIMES the cost of the book.  </p>  <p>  \t    As soon as you join our program, you’ll be able to start making changes to your life, know everything there is to know about how to achieve your goals and live the life of your dreams.  </p>  <p>  \t    So… Now You Know… but what will you do?  </p>  <p>  \t    Will you turn around and walk away?  Will you close the window and give up on all of your hopes… your aspirations… your dreams?  </p>  <p>  \t    Will you go back to the life that you’ve been living for so long now… that is a constant source of anxiety, frustration, and longing?  </p>  <p>  \t    Because if you choose to leave this opportunity… that’s exactly the outcome you’ll get.  </p>  <p>  \t    But you COULD be part of something more amazing than you’ve ever been part of.  You could be the kind of person that you ENVY… and the kind of person that your friends and family ENVY… the person who has it ALL figured out.  The one who has it ALL together.  The person who has truly MASTERED the incredible Power of your own mind.  </p>  <p>  \t    “If you want something you&#039;ve never had, you must be willing to do something you&#039;ve never done.” ― Thomas Jefferson.  </p>  <p>  \tJoin Power of Mind course and transform your life starting today!  </p>", 
    "end_date": null, 
    "title": "Power of Mind", 
    "price": "40.00", 
    "instructors": "Earners Classroom", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/348976_62dc_2.jpg", 
    "course_url": "https://www.udemy.com/power-of-mind/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-18T03:13:14Z"
}