{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t                            Your mind as consciousness creates your reality, and when you know how to effectively work with all of its parts, you can do some very powerful and amazing things, like heal your body or intuit something you could not have logically known.  </p>  <p style=\"\">  \t                      This course is designed to take you on a journey of mind-body mastery starting with the basics of mindfulness and meditation, and then advancing to working with your subconscious mind to facilitate healing. I&#039;ve included some of the latest mind-body research blended with spirituality to help you understand the power of your mind.  </p>  <p style=\"\">  \t                      In this course you will learn:  </p>  <ul style=\"\">  </ul>  <ul style=\"\">  \t<li style=\"\">The fascinating science that proves why mind-body medicine is so powerful.</li>  \t<li style=\"\">Simple techniques and processes for beginning and maintaining a mindfulness and meditation practice.</li>  \t<li style=\"\">Easy mind-body techniques to quickly and effectively relax and turn off your stress response.</li>  \t<li style=\"\">Simple mindfulness techniques for healthier eating.</li>  \t<li style=\"\">How to maximize present moment awareness to magnify creativity and manifestation.</li>  \t<li style=\"\">How to effectively change your perception so that you experience less stress.</li>  \t<li style=\"\">How to use heart-centered meditation techniques packed with the power of love to literally heal your body and mind.</li>  \t<li style=\"\">How to use a heart-centered meditation to diffuse any negative emotion.</li>  \t<li style=\"\">How to maximize your intuition through meditation and the science behind it.</li>  \t<li style=\"\">How to use brainwave entrainment technology to deepen your meditative states.</li>  \t<li style=\"\">How to uncover limiting beliefs stuck in your subconscious, and use a specific guided meditation technique to permanently remove them.</li>  \t<li style=\"\">The effective use of core positive affirmations, and how to bypass any mental blocks around them.</li>  \t<li style=\"\">Basic Functional Medicine concepts for building a strong body and mind.</li>  \t<li style=\"\">Functional Medicine nutritional support recommendations.</li>  \t<li style=\"\">How the science behind the placebo effect proves your unlimited ability to heal yourself, and how to maximize this power in your every-day life.</li>  \t<li style=\"\">How to activate your inner physician to trigger a biological cascade of events for self-healing.</li>  \t<li style=\"\">How to tap into your higher mind (higher self) to always know the truth and become your own authority.</li>  </ul>  <p style=\"\">  \t                            This course is presented in six modules designed to be taken over about six weeks. Ideally I would like you to practice the techniques you learn in each module for about a week before progressing to the next module. Some may choose to first view the entire course, and then start practicing the techniques described in each module.  </p>  <p style=\"\">  \t                          Each module contains a powerful guided meditation containing brainwave entrainment tracks to deepen your practice and help induce your relaxation response. These guided meditations are each designed to promote a specific process for healing the body and mind. I recommend you listen to the guided meditations in a quiet place using earphones or earbuds to get the maximum effect.  </p>  <p style=\"\">  \t                 As the modules progress, the guided meditation techniques become more advanced. Theses advanced meditation techniques are most effective if you master the basics of meditation and mindfulness taught at the beginning of the course. These basics include diaphragmatic breathing, engaging present moment awareness, and inducing the relaxation response.  </p>  <p style=\"\">  \t                For each of the more advanced guided meditations, I&#039;ve included a downloadable ebook to help you fully understand the intention and process.  </p>  <p style=\"\">  \t                        I&#039;ve taught this course in live workshops, and here is feedback from one of the participants.  </p>  <p style=\"\">  \t<strong style=\"\">&quot;I initially signed up for Dr. Holden&#039;s course in order to improve at meditation -- but ended up getting so much more out of it!  Dr. Holden describes the latest findings in neuroscience, and the various ways our mind affects our health, in a way that is easy to grasp.  The course is a veritable fountain of useful information.  It also covers many different techniques for rewiring your brain including, of course, the excellent guided meditations.  So it&#039;s a bit like getting a user&#039;s manual to your brain, complete with a hands-on tutorial.  I feel that I benefited tremendously from everything I learned in the course (in many ways, it was what you&#039;d call a &quot;paradigm shift&quot;), as well as the meditation practice.  I was also very inspired by the example of Dr. Holden himself, who has greatly improved his own health using the same tools and information that he&#039;s offering us.  I highly recommend this course to anyone interested in meditation, the healing powers of their own mind, or simply in getting healthier!&quot; N.Z. Jacksonville, FL</strong>  </p>  <p style=\"\">  \t<em style=\"\">                        All information contained in this course is intended for informational and educational purposes only, and is neither intended nor suited to be a replacement or substitute for professional medical treatment nor for professional medical advice relative to a specific medical question or condition.  </em>  </p>  <p style=\"\">  \t<em style=\"\">Always speak with your physician or other healthcare professional before using any techniques in this course if you have an emotional or physical health problem. If you have or suspect that you have a medical problem, contact your health care provider promptly. Do not disregard professional medical advice or delay in seeking professional advice because of something you have read in this course.</em>  </p>  <p>  \t<em style=\"\">Learning and practicing information provided in this course DOES NOT create a doctor-patient relationship between you and Keith R. Holden, M.D.</em>  </p>", 
    "end_date": null, 
    "title": "Power of the Mind in Health and Healing", 
    "price": "40.00", 
    "instructors": "Keith R. Holden, M.D.", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392584_6432_2.jpg", 
    "course_url": "https://www.udemy.com/power-of-the-mind-in-health-and-healing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-13T00:49:29Z"
}