{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em><strong>Over 40,500 people from 179 countries enrolled in my courses</strong></em></li><li><em><strong>First Winner of Udemy's Innovation Award - 2015</strong></em></li><li><em><em><em><strong>Overall, 1100+ TOP </strong></em><em><strong>Reviews (below) from very happy students</strong></em></em></em></li></ul>\n\n<p><strong><br></strong></p>\n\n\n\n<p><strong></strong>In this course I will reveal one of the secrets of successful people. Namely, they are never sleepwalking through life. Instead, they have a clear vision, set goals and create the right plan of action. You may think that it's enough to just work hard. However, doing it without a clear vision is like going full speed on a yacht without any navigation system. It doesn't matter how fast you can go, you may never reach the destination you truly desire. In this guide I will share with you a step by step process for achieving your wildest goals. You get only 1 shot in life, you may as well make it count. I don't want to bore you with long marketing messages so simply go ahead, watch the trailer &amp; free preview videos and discover why tens of thousands of people trusted in my content. I'm sure that you will enjoy our journey together and I'm very excited to see you on the other side.</p>\n\n\n\n<p><strong>What people say about my courses </strong>(some of 380+ top reviews)<strong>:</strong></p>\n\n\n\n<p><strong></strong><em><strong>\"Excellent Production Quality.</strong> </em><em>Jimmy and his video team have obviously made a great deal of effort in the filming and post-production. They set a standard for other Udemy instructors to follow\"</em><strong>.</strong><em> - Alicia</em></p>\n\n\n\n<p><em></em><strong><em></em></strong><em><strong><em>\"T</em><em>he best!! </em></strong><em><strong>Jimmy's courses are the best!!!</strong> very high quality...\"</em> - Sandy Allain</em></p>\n\n\n\n<p><em></em><em><strong>\"GREAT INFORMATION! Jimmy Naraine Is the man! he gives great information and he explains everything very well</strong> he does not sugar Coat anything he goes straight to the point! Take ACTION!\" </em>- Rihan</p>\n\n\n\n<p><em><strong>\"</strong><strong>Helpful and enjoyable. </strong></em><em><strong>Jimmy's presentations are very professional, coming from beautiful spots all over the world</strong>. I learned a great deal of important and usable information, and am implementing it as I write this.\"</em> - Stan Prentice</p>", 
    "end_date": null, 
    "title": "Powerful Goal Setting - Step by Step Blueprint", 
    "price": "20.00", 
    "instructors": "Jimmy Naraine", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537750_38fc.jpg", 
    "course_url": "https://www.udemy.com/powerful-goal-setting-step-by-step-blueprint/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T06:45:11Z"
}