{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ol><li>How was your last 12 months in business?</li><li>Did you achieve the success you were after?</li><li>If you could rate yourself from 0-10, honestly how did you go?</li><li>Was it extraordinary? Fantastic! Congratulations!</li><li>Do you think you could have done better? Keep reading</li><li>Are you trying to achieve too much and actually achieving very little?</li><li>Are you confused about where to focus your energy?</li><li>Are you stressed and super busy without getting results?</li></ol>                            <p>Running a successful business requires a lot of skill. Crucially, the most important is setting the right goals and staying 100% focussed.  Ask yourself: Do you really have complete clarity on where you’re taking your business (and life) in the next 12 months? Is it really mapped out in a clear, concise plan? Without setting goals you won’t be successful, it is that simple. Just setting goals is not enough though. It is absolutely crucial that you keep your eye on your goal, every day. There is so much noise out there in the business world, so many opportunities. It is super easy to get distracted. </p>    <p>Try to chase two rabbits and you will catch neither. This course helps you set the right goals and teaches you a system to give you clarity and focus. </p>    <p><strong>Learn:</strong></p>  <ul><li>Why setting goals is absolutely crucial for your success</li><li>That you might be a casualty of the entrepreneurs’ curse</li><li>How to set the right goals for your personal life and your business using the ‘Making the most of your year’ template</li><li>How to map out your next 12 months and your next quarter using the ultimate organiser template we provide</li><li>Why your success is 100% linked to how disciplined you are and the secrets on how to be more disciplined</li><li>How fear can stop you achieving your goals</li></ul>                <p><strong>Content and Overview</strong></p>  <p>Part one covers the why goal setting is absolutely crucial for your success. In modules two-four Andrew covers how to set the right goals and how to keep your eye on your goal every single day. Two templates are provided to help you work through the planning and goal setting process. It does not matter which month of the year it is. You can start your planning process anytime. By implementing the disciplines in this course you can triple your productivity and success in your business.</p>    <p>You will walk away with your 12 month and 90 day plan. You will be crystal clear on where to focus and equipped with a powerful system to help you keep your energy on your goals every single day. </p>    <p>You have a totally unconditional money back guarantee. It allows you to study the course for 30 days and if you are in any way unhappy with it, you will get a full refund, no questions asked! Enrolling in the course is absolutely risk free. Oh and did I mention that you get lifetime access?</p>", 
    "end_date": null, 
    "title": "Powerful Planning and Great Goal Setting for Business Owners", 
    "price": "45.00", 
    "instructors": "Andrew Roberts", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682960_6e04_6.jpg", 
    "course_url": "https://www.udemy.com/powerful-planning-and-great-goal-setting-for-business-owners/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-28T01:06:30Z"
}