{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Mindsight is a technique that was developed by Dr. Daniel J. Siegel, who is a pioneer in the emerging field of interpersonal neurobiology.<br> <br>Dr. Siegel has used scientific research from various fields, from psychology to attachment theory, in order to develop new insights and approaches that help people heal themselves from past traumas and overcome present obstacles.<br> <br>The Mindsight technique is based in science and practicing the techniques gives you the power to change the way that your mind works for the better.<br> <br>This course gives you the opportunity to explore Mindsight, and learn how to change your inner world so you can enhance your outer world.<br> <br><strong class=\"redactor-inline-converted\">Begin Implementing the Mindsight Approach to Personal Transformation<br> </strong></p>\n\n<ul><li>Discover the Four Streams of Awareness\n</li><li>Implement the Wheel of Awareness Practice\n</li><li>Explore the Eight Domains of Integration\n</li><li>Use Mindsight to Change Your Mind and Brain\n</li></ul>\n\n<p><br><strong class=\"redactor-inline-converted\">Release Old Mental Habits and Traumas to Enhance Your Present Moments</strong><br>In this course, you’ll deeply explore, in a practical way, how you can promote integration between brain and mind.<br> <br>As you implement this Mindsight practice in your daily life, you’ll begin to shift the physical structure of the brain and improve the way that your mind works.<br> <br>Ultimately, you’ll enhance your relationship with yourself and with others.<br> <br>You’ll also develop resilience, release fear, and focus on the positive aspects of your life from one moment to the next.<br> <br><strong>Contents and Overview <br></strong>You’ll start this course with an introduction into the Eight Domains of Integration and the Four Streams of Awareness.</p>\n\n<p>These lectures will allow you to fully understand how you can use mindfulness practice in a whole new way to transform your mind in the present while releasing past traumas.</p>\n\n<p>When ready, you’ll try the Wheel of Awareness practice, which is a mindfulness meditation that focuses on the breath and brings you into the present. This is a tool you can use daily to transform your mind.</p>\n\n<p>Then you’ll move through each of the domains of integration so you can fully understand how to begin using them to change the mind and brain.</p>\n\n<p>You’ll also discover how to enhance neuroplasticity in the brain through exercise, sleep, healthy eating, supplementation, and meditation that intensely focuses your attention.</p>\n\n<p>Once you understand how the left and right brain are connected and how they are different, you’ll cover what memory is and how it also affects the brain.</p>\n\n<p>Dr. Siegel helps you further comprehend the way the mind works by delving into how subjective experience and neural firing are connected yet separate, how to use Mindsight to improve relationships, and how time affects the mind.    </p>\n\n<p>By the time you complete this course, you’ll know how to apply these scientific lessons to actually create healing with yourself or others.</p>\n\n<p>You’ll be able to recognize the lessons of the past, be open to the present, and chart your future with a mind that’s clear, healthy, and positive</p>", 
    "end_date": null, 
    "title": "Practicing Mindsight by Dan Siegel, Part 2", 
    "price": "50.00", 
    "instructors": "Sounds True, Dan Siegel", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796144_f93f_2.jpg", 
    "course_url": "https://www.udemy.com/practicing-mindsight-by-dan-siegel-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T19:04:39Z"
}