{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  </p><p>Dr. Daniel J. Siegel coined the term Mindsight to help people understand how they can harness the power of the mind for personal transformation.<br> <br>This course, which is taught by Dr. Siegel himself, will give you the chance to explore how you can resculpt your brain’s neural pathways.<br> <br>Ultimately, you’ll learn the tools necessary to break free from your negative mental patterns that are holding you back from living your life to the fullest.<br> <br>Once you release those patterns, you’ll be liberated and strong enough to pursue the life of your dreams.<br> <br><strong class=\"redactor-inline-converted\">Learn All About the Mindsight Practice of Transformation<br> </strong></p>\n\n<ul><li>Develop a Full Understanding of the Brain’s Anatomy\n</li><li>Comprehend How Your Mind Affects Your Brain\n</li><li>Enhance Your Brain’s Neural Activity to Achieve Emotional Health\n</li></ul>\n\n<p><br><strong class=\"redactor-inline-converted\">Remove Old Patterns and Create the Life You Really Want<br></strong>If you’ve been struggling with negative thoughts and emotions, this course will give you a deeper understanding of the way your brain and your mind work.<br> <br>You’ll gain access to valuable techniques that will not only change your mind, but also rewire your brain so you can truly transform the way you experience life.<br> <br>As you move through this course, you’ll explore various scientific areas to uncover how you can apply Mindsight into your personal life.<br> <br>You’ll also complete questions to help you dive further into what you’re learning.<br> <br>You’ll also discover how you can apply this practice professionally to help others and the world.   <br> <br><strong>Contents and Overview<br></strong>You’ll begin this course with an introduction into Mindsight. You’ll learn how it was created, and how to truly understand the brain and the mind.</p>\n\n<p>The more you develop a thorough understanding of the mind, the more you will be capable of actually changing the way that it works.</p>\n\n<p>You’ll start to discover how to use Mindsight to get out of your brain, and how your mind can actually change your brain. Before long, you’ll be exploring how to create a healthy mind using the Mindsight technique.</p>\n\n<p>You’ll comprehend how neural activity works in the brain and how the brain is wired, as well as other physical aspects of the brain that affect the way you think and feel.</p>\n\n<p>By the time you complete this course, you’ll understand how the brain is sculpted by your experiences, and how you can change your brain and your mind for the better.</p>\n\n<p>You’ll feel in control over your mind and you’ll be ready to make changes so that you can pursue your goals with greater confidence.</p>", 
    "end_date": null, 
    "title": "Practicing Mindsight by Dan Siegel, Part 1", 
    "price": "50.00", 
    "instructors": "Sounds True, Dan Siegel", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796142_10dc.jpg", 
    "course_url": "https://www.udemy.com/practicing-mindsight-by-dan-siegel-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T19:04:28Z"
}