{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>El mundo ha sido creado única y exclusivamente para que disfrutes de él, y para ello es necesario que aprendas a confiar, sobre todo en ti.</p><p>La confianza es uno de los principios básicos de la felicidad. Y el miedo es uno de los principales obstáculos para alcanzar esa confianza. Este curso está diseñado para enseñarte los principios que conforman la autoestima y la confianza, para que puedas empezar a mejorar tu visión de la vida y de ti mismo. <br style=\"\"> <br style=\"\"> </p><p><strong style=\"\">Eres especial, eres diferente y único</strong>. Disfruta de ello. Este es tu momento, no lo dejes pasar. Te ha llegado el momento de decidir si seguir en ese estado de conformidad al sufrimiento, a la monotonía, a la carencia y a la tristeza, o salir a vivir la vida que de verdad te mereces.</p><p><br style=\"\"></p><p>Éste es un taller práctico de cuatro semanas, diseñado con el objetivo de que de verdad notes los cambios reales en tu vida. Te pondré los instrumentos y los recursos para hacer posible que dirijas tu vida hacia donde te mereces, tú sólo tendrás que seguir el camino que este curso te irá dibujando.</p><p><br style=\"\"></p><p> En este taller vas a descubrir cuáles son en realidad tus emociones, cuál es tu forma de comunicarte. Conocerás tu cuerpo, entenderás cuál es la relación que mantienes con los demás.</p><p><br style=\"\"></p><p><strong style=\"\">Y por supuesto</strong>, podrás contactar conmigo mediante email siempre que lo desees, y podrás contarme cuáles son tus dudas, así mismo, podrás explicarme aquello que sientes o te sucede al ir ejerciendo este taller, y juntos resolveremos los obstáculos emocionales que te impidan avanzar.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Practica la felicidad. Rediseña tu vida en 4 semanas", 
    "price": "35.00", 
    "instructors": "Montse Puchol", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/465082_0d91_3.jpg", 
    "course_url": "https://www.udemy.com/practica-la-felicidad-redisena-tu-vida-en-4-semanas/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T15:44:26Z"
}