{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>When Food is Food &amp; Love is Love</strong></p><p>This unique <strong class=\"redactor-inline-converted\">audio only course</strong> is taught by Geneen Roth, a renowned teacher and the author of bestselling books that include <em class=\"redactor-inline-converted\">Women Food</em> and <em class=\"redactor-inline-converted\">God: An Unexpected Path to Almost Everything</em>.</p>\n\n\n\n<p>She has been featured on <em class=\"redactor-inline-converted\">The Oprah Winfrey Show</em> and <em>20/20</em>, and her work focuses upon utilizing addiction as a path to one’s inner universe.</p>\n\n\n\n\n\n\n\n<p>In this audio program, Geneen discusses the reasons why so many people find themselves emotionally eating. She shares what you can do if you find yourself turning to food in order to fulfill emotional needs.</p>\n\n\n\n\n\n<p>You’ll discover a spiritual practice that will help you finally break free of emotional eating habits, and you’ll develop a healthy relationship with food.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Set Yourself Free from the Habit of Emotional Eating</strong></p>\n\n\n\n\n\n\n\n<ul><li>Understand what emotional eating is, what causes it, and how to overcome it</li><li>Discover and begin practicing the seven eating guidelines  </li><li>Embark on a spiritual path to change the way you view food and the way you eat</li></ul>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\"><br>Transform Your Relationship with the Foods You Love</strong></p>\n\n\n\n\n\n\n\n<p>Throughout this course, you’ll learn that your relationship with food is actually symbolic of your relationship to being alive. It’s also related to beliefs that you hold about pleasure, nourishment, trust, and deprivation.</p>\n\n\n\n\n\n\n\n<p>In other words, eating has more to do with your emotions than you may realize, and it goes far beyond simply feeling hungry.</p>\n\n\n\n\n\n\n\n<p>With the teachings in this course, you can break free from emotional eating and dieting by using mindfulness meditations and visualizations.</p>\n\n\n\n\n\n\n\n<p>You’ll also cover other techniques that will help you understand the real reasons why you turn to food.</p>\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Contents and Overview</strong></p>\n\n\n\n\n\n\n\n<p>This course begins with an overview of emotional eating, including how to heal your relationship with food. Then you’ll dive right into your first exercise, which explores your significant relationships.</p>\n\n\n\n\n\n\n\n<p>Geneen will share valuable eating guidelines so you can begin to shift the way that you view and consume food. Through writing and meditation exercises, you’ll come back to your body to begin your spiritual transformation.</p>\n\n\n\n\n\n\n\n<p>After covering the super-ego, which is the critical inner voice that can lead to emotional eating, you’ll explore each of the eating guidelines individually.  </p>\n\n\n\n\n\n\n\n<p>As you learn about each eating guideline in greater depth, you’ll also complete exercises that include meditations and visualizations. These will allow you to put what you’re learning into practice.</p>\n\n\n\n\n\n\n\n<p>The audio course ends with a list of commonly asked questions, so you’ll have a complete understanding of what emotional eating truly is, as well as how to control it and move away from it.</p>\n\n\n\n\n\n\n\n<p>By the time you complete this audio course, you’ll be ready to approach food from a completely different—and much more positive—perspective.</p>\n\n\n\n\n\n\n\n<p>You’ll know what your body and your mind really need, and you’ll know how to use the nourishment of your body to nourish your spiritual growth.</p>", 
    "end_date": null, 
    "title": "Principles to Break Free from Emotional Eating (Audio Only)", 
    "price": "50.00", 
    "instructors": "Sounds True, Geneen Roth", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/848682_4ca9.jpg", 
    "course_url": "https://www.udemy.com/break-free-from-emotional-eating-audio-only/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-14T00:41:10Z"
}