{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Foreward</strong></p><p>I feel like a lot of instructors promise you productivity, time or financial freedom but they under deliver. They are either too broad, have weak content or don&#039;t resonate with their students&#039; needs.</p><p>Who am I? I&#039;m a multi-tasking savant and I care a lot about my students. If you have any trouble while going through this course OR you&#039;re just on the fence about signing up and have some preliminary questions, you can email me for help at ProactiveProductivity@gmail.com.</p><p><strong style=\"\">Summary</strong></p><p>Whether you&#039;re a stay at home mom with a ton of responsibilities or a quickly-developing entrepreneur, people are always saying that there&#039;s not enough time in a day. With what I&#039;m about to teach you, I have found a way to create more time in my day simply by renegotiating my priorities all while achieving a high-level of productivity in all that I do. I have tried many organizers and structure systems throughout the years because I tend to have <em style=\"\">a lot</em><span></span> going on. Through this system, I have achieved a state of relaxed control and the steps that follow should be followed exactly in their order so that you too, may progress from “having so much on your plate&quot; to being able to control your life and where it goes too. In addition to productivity and time-management I also teach you about marketing, leadership and even how to make money using the steps that I have used; proven techniques in their industries that still work today. </p>", 
    "end_date": null, 
    "title": "Proactive Productivity", 
    "price": "20.00", 
    "instructors": "Joshua Aguirre", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475212_7bf7_4.jpg", 
    "course_url": "https://www.udemy.com/proactive-productivity/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T18:28:59Z"
}