{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><em style=\"\"><em style=\"\"><strong style=\"\">UPDATE: Scheduled price rise to $99 very soon.</strong></em></em></p><p style=\"\"><em style=\"\"></em><strong style=\"\">Things Are Not What They Seem To Be! </strong>Get ready to discover the <strong style=\"\"><em style=\"\">scientific basis</em></strong> of abundance, visualization, positive thinking, and miracles!</p><p style=\"\">Welcome to this course, a grand journey into the building blocks of space and time, one that will make you look at reality in a completely revolutionary way! Lying just beneath your everyday perspective is a truth that will shock you beyond your imagination…</p><p>Here is a question for you: does life happen <u style=\"\"><em style=\"\">to</em></u> you, or <em style=\"\"><u style=\"\">for</u></em> you? In other words, do all things work together for your ultimate good, or not? Many people perceive life as if it happens <u style=\"\"><em style=\"\">to</em></u> them. Our challenge here is to start seeing it all as happening <em style=\"\"><u style=\"\">for</u></em> us. And <strong style=\"\">for this to be the case, the universe itself, down to its most basic elements, has to have been scientifically built to fulfil our every conscious and subconscious desire, belief, thought.</strong><br style=\"\"></p><p><strong style=\"\">Is it possible that the building blocks of space and time actually <em style=\"\">listen</em> to us?</strong></p><p>This course will enable you to clearly understand that this is so!</p><p>This course will enable you to become a deliberate creator of your reality because it enables you to see &quot;under the hood&quot; of what reality is made of, and yo understand that you are in direct manipulation of it, from a very scientific point of view. <em style=\"\">It will make you bigger!</em></p><p><strong style=\"\">What&#039;s The Fuss All About?</strong></p><p><em style=\"\">So, you might ask, &quot;What&#039;s the fuss all about?&quot;</em></p><p>Well, there are several reasons people seem to like this material:</p><ul style=\"\"><li>It&#039;s practical</li><li>It&#039;s simple</li><li>It&#039;s based on proven and time-tested scientific principles and examples</li><li>Students who take it end up feeling better <em style=\"\">instantly</em> and start to <em style=\"\">create</em> tangible positive changes and experiences in their lives, <em style=\"\">instantly, by applying what they learn here.</em></li></ul><p>Welcome!</p>", 
    "end_date": null, 
    "title": "Quantum Energy: The Basis Of Mind Power & Manifestation", 
    "price": "20.00", 
    "instructors": "David Cameron Gikandi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455600_dad0_3.jpg", 
    "course_url": "https://www.udemy.com/quantum-energy-mind-power-manifestation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-24T10:44:06Z"
}