{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Ready to quit smoking and end nicotine use? More people stop smoking using the cold turkey method than all. I did too. Reflecting on my experience I have designed this program to help you do the same. </p><p>I was a heavy smoker for more than 13 years, but a few years ago I decided to quit and I haven't smoked ever since. In this program, I will share everything I have learned with you and I will help you do the same by walking you step-by-step through the entire process. </p><p>The program is centered around the idea that the best way to stop doing something is to focus your energy and attention on doing something else, instead of focusing on \"not doing\". So I will teach you how to overcome your smoking addiction by focusing on changing your daily routine to live a healthier lifestyle. I will help you put processes in place that will make you more self conscious and will allow you to regain control of your behavior. </p><p>Education • Motivation • Support</p><p>It takes 21 days to make or break any habit and that is why the program is structured into 21 short videos for you to watch - one video per day at a time. Some of the lectures are about self reflection and about understanding why you do what you do. In other lectures I will ask you to do very specific things and introduce minor changes into your daily routine. Combining those two will allow you to gradually change your life seemingly without effort. At the end of the program you will become a person where smoking is something that you just don't do anymore. </p><p>I have included a worksheet for each lecture to allow you to track your progress along the way. I've been keeping a personal journal for many years now and I cannot recommend it enough. Feel free to start your personal journal and keep putting down your thoughts and ideas even beyond the scoope of this program. </p><p>Even though the program is on how to quit smoking, the underlying principles that I will teach you over the course of the next 21 days can be applied to achieve any goal you set for yourself. If nothing else, I can promise you that you will save more money on cigarettes from this program than you have to invest in taking it. </p><p>Quitting smoking is going to be challenging now, but it's going to be even more challenging in 5 years. So why not do it now?</p><p><em>If you purchased the course through clickbank there is a 60 Day Money Back Guarantee. </em><br></p>", 
    "end_date": null, 
    "title": "Quit Smoking in 21 Days ", 
    "price": "25.00", 
    "instructors": "Alexandar Alexiew", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/624466_8780_4.jpg", 
    "course_url": "https://www.udemy.com/quit-smoking-in-21-days/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T08:02:51Z"
}