{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    You’ve read all the books, attended all the seminars, and maybe even hired a coach but success, your dream life, still eludes you.  </p>  <p style=\"\">  \t    The good news – it’s not entirely your fault.  </p>  <p style=\"\">  \t    More good news – R.E.A.C.H. to Design Your Life teaches you what so many personal development courses, books, and even coaches fail to teach that is integral to attaining the life you want.  </p>  <p style=\"\">  \t    Taught by award winning author and President of Reach! Life Design, Inc., Kathy Hammond, M.A. reveals these missing components so you can create the life intended for you.  </p>  <p style=\"\">  \t    Based on behavioral science, the course’s 22 lectures and 16 exercises, along with three quizzes, completed at your own pace, will have you create your own foolproof blueprint to the life you want and deserve. You will receive potent and relevant strategies to overcome obstacles, alter perceptions, and learn how to set a course that is uniquely yours. This course is for people who are sick and tired of settling for just good enough and want all that life has to give.  </p>  <p style=\"\">  \t    But, it doesn’t stop there because you have more power and ability to achieve even greater goals than even you thought possible. This is what separates R.E.A.C.H. to Design Your Life from other self-improvement and goal setting programs.  </p>  <p style=\"\">  \t    If you’re serious about changing your life to have it reflect what you know is possible, this course is for you. You will learn:  </p>  <p style=\"\">  \t    - The missing components in life design that are keeping you from the life you want and deserve  </p>  <p style=\"\">  \t    - How to abandon past perceptions that are holding you back  </p>  <p style=\"\">  \t    - How to set your desires into motion and keep moving  </p>  <p style=\"\">  \t    - The power of Stop-Start-Continue  </p>  <p style=\"\">  \t    - How to recognize and be brave enough to pursue your real purpose  </p>  <p style=\"\">  \t    - How to apply behavioral science to identify the behaviors you need to adopt to achieve the life you want  </p>  <p style=\"\">  \t    - The power of R.E.A.C.H. principles in life design  </p>  <p style=\"\">  \t    - How to determine if you have been aiming at the wrong goals and how to recognize the right goals  </p>", 
    "end_date": null, 
    "title": "R.E.A.C.H. to Design Your Life", 
    "price": "20.00", 
    "instructors": "Kathy Hammond, M.A.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85718_a5cf_5.jpg", 
    "course_url": "https://www.udemy.com/reach-to-design-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-29T19:50:19Z"
}