{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A truly life changing course that will acquaint you with the simplest yet most powerful force at play in your experience of life, the Storyteller. This course will guide you through the steps of recognizing the inner narrative and its impact on your life, and lead you through the process of dropping that narrative and experiencing freedom and peace like never before.</p><p><strong>Let me show you what I mean by narrative:</strong> As an experiment, please stop reading for a few seconds and with your eyes closed, listen to the voice in your head. </p><p>Recognize that voice? </p><p>Of course you do, it rarely quiets down and it's always commenting on EVERYTHING. It tells you what it likes, and what it doesn't like; what you should do, and what you shouldn't do. Did I mention it also claims to possess psychic powers? Sure it does! It tells you what to expect, and what your life will be like,  how you're in danger,  how you shouldn't trust that guy that lives across the hall, and how that lady at the counter hates you, and how Tommy must love you...maybe, and how Jenny probably got in an accident because she's five minutes late...</p><p>Now imagine what would happen if that voice all of a sudden stopped talking. Take a deep breath. Nice, right?</p><p>By noticing You, the Storyteller, and learning how to make a habit of dropping the narrative, you will begin to see things as they really are instead of how the Storyteller told you they were, perhaps for the first time since infancy. Life will no longer seam like a scripted event, and the freedom of each moment, brand new as an opportunity to choose again will become clear.</p><p>This course is a mix of video talks filled with ideas and metaphors to jumpstart the process, and journaling exercises that are quick and require zero experience in journaling.</p><p>If you have any questions, comments or doubts,  I will be carefully responding to your comments at least once a week.</p><p>Many of us want change, but most of us are so attached to our stories that we look for that change outside ourselves. This is isn't new information, however, we're still on the wild goose chase, hoping to be proven wrong or to distract ourselves from the underlying issue. The problem with this approach is too obvious to point out, but by going to the source of the issue, our internal AND external experience of life become free and joyful BEYOND UNDERSTANDING. This is how we achieve true inner peace.<br></p><p>This course unties that one knot, the one that started the whole mess. Working with the Storyteller changes everything. From a quiet mind (which has seemed quite unattainable for us common folk for a long time) we can learn things, achieve things, pursue things, love things, all from a position of peace, freedom, safety, and wholeness.</p><p>Let's do this!</p><p><br></p>", 
    "end_date": null, 
    "title": "Radical Mindfulness - A Guide to Conscious Living", 
    "price": "40.00", 
    "instructors": "MJ Cash", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647226_4161_8.jpg", 
    "course_url": "https://www.udemy.com/you-the-storyteller/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-21T20:53:54Z"
}