{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Reclaiming your True Voice is a course about stepping into your voice power and speaking in your true voice.</p><p>This course is about reconnecting with the true voice you have that has been locked up with the dings of life.  The voice that you were born with, the one that is free and interesting is still inside you.  This course is about unlocking that voice and getting connected to it so you can utilize it to maximize your success.</p><p>This course is about learning to connect the words and the sound so you can be authentic when you speak to others and make greater connections whether it's in personal relationships or even presentations.</p><p>This course talks about authenticity, breathing, connection and stepping into voice power.  The voice is the most vulnerable piece we have and if you want to create a business and life you love, you'll want to reclaim your true voice.</p><p>The course includes video, PDF's and will have audios.  Additional material will be delivered on a regular basis as the course is updated.</p><p>The course will take about an hour or more to complete at this time but as more videos are added will take longer.</p><p>The course is structured in building blocks or stepping stones way.  However, it is not essential that you do the steps in any order.</p><p>99% of the people I know do not speak in their true voice or connect to their breath.  Why does this matter?  Because we are moving into a place where people are looking for authenticity and to make strong connections with people they buy from and build relationships with.  It's essential that you as a business owner and a person are able to connect with yourself and others.  By stepping into and speaking with your true voice that very thing can happen with ease.</p><p>If you are ready to reclaim your voice power, this course is for you.</p>", 
    "end_date": null, 
    "title": "Reclaim Your True Voice and Speak with a Free Voice", 
    "price": "35.00", 
    "instructors": "Tracy Goodwin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631510_381c.jpg", 
    "course_url": "https://www.udemy.com/reclaim-your-true-voice-and-speak-with-a-free-voice/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T17:06:07Z"
}