{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Imagine if I told you you can achieve any type of desired result. What would you want to achieve? Do you know off the top of your head? What kind of goals do you typically make?</p><p>This can be your reality as long as you have the right mindset and the right methodology. You can begin to achieve anything you want personally or professionally.</p><p><em>\"Redefining Goal Setting - </em><em>Crush your goals once and for all\"</em> is a guided program looking to give students a proven and systematic method to break goals down into bite-size, tangible pieces and help them exceed their wildest expectation.</p><p>You will learn not only how to dream BIG and visualize success, but to also how to chunk BIG goals down and learn various strategies in terms of accountability.</p><p>Try today, risk free! There is a <strong>30-Day Guarantee </strong>on the course so if you are not happy about the results you get, you automatically get a refund, no questions ask!</p><p>I have also included two video bonuses to compliment your learning journey. One on <strong>Overcoming Fear</strong> and the other on <strong>Visualization. </strong><span></span></p><p>My VIP coaching clients pay thousands to have the exact same system in their lives implemented over the course of a few short weeks. Now, you can have the same system in your life, start crushing your goals, and begin to live the life that you deserve!</p><p>Let's rock and roll superstar!</p>", 
    "end_date": null, 
    "title": "Redefining Goal Setting ", 
    "price": "20.00", 
    "instructors": "Jay Wong", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503000_5b78_3.jpg", 
    "course_url": "https://www.udemy.com/redefining-goal-setting/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T15:48:32Z"
}