{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Reiki is simple to learn, however it does require practice, so I have invested quite a bit in offering full scope Reiki training through lessons easy enough to retain student interest and not overwhelm their learning process. </p><p>This course offers both the traditional teachings of Mikao Usui and includes many Western teachings of Madame Takata as she brought Reiki over to the United States a few decades ago.  Upon completion of this course, students will be certified in first degree Reiki and will be able to give treatments to themselves and others.  Unlike other classes offered, students of this course have the opportunity to become well versed not only in traditional Reiki teachings, but also gain access to additional techniques, lessons, and downloadable references that will assist their learning experience and practice well after completing the lessons.  This comprehensive Reiki certification course can be learned at the student's own pace, and from the comfort of their own home or office.  </p><p>My goal is for you to get the most out of your experience with Reiki and for it to be as helpful to you as it has been to me.  By enrolling in this class, you gain entry into our private Facebook community of fellow students where you can ask questions and gain peer feedback as you continue your journey into Reiki healing.<br></p>", 
    "end_date": null, 
    "title": "Reiki Level One Certification, Including Bonus Techniques", 
    "price": "20.00", 
    "instructors": "Amelia Clemens", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/566304_4ab1.jpg", 
    "course_url": "https://www.udemy.com/reiki-first-degree-certification-course-w-bonus-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-27T17:45:35Z"
}