{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      Learn about Reiki, a universal energy that has been used successfully all over the world to heal emotional, physical and energetic imbalances. In this course you will learn how to perform Reiki on yourself and others.  </p>\n\n<p>  \t      In Level II of this course you will learn how to perform Reiki from a distance as well as how to use aspects of the Reiki energy to clear unwanted habits and manifest your goals.  </p>\n\n<p>  \t      In Level III, you will learn how to teach and perform attunements on others wanting to utilize Reiki for themselves.  </p>\n\n<p>  \t      You will receive three comprehensive manuals as well as additional worksheets. You will have the choice to connect with other like-minded individuals in an active online group which you can access even after you have completed the course.</p><p>You will receive distance attunements for all three levels from your Instructor/Master. You will also receive a traditional certificate (pdf format) from your Instructor/Master once you successfully complete this course.  </p>\n\n<p>  \t      This course can be used as a way to enhance personal growth and/or work on any imbalances within yourself or those around you. Individuals wanting to add Reiki to their current practice or wanting to begin their own Reiki practice will benefit highly from this course. Also, individuals wanting to teach Reiki to others will have the material they need to do so once they have completed this course.  </p>\n\n<p>  \t      <strong>Why take this course?</strong>  </p>\n\n<p>Unlike in-person courses, you can take the time you need to work through the material while having continuous access to ask your Certified Reiki Master/Teacher questions. You also have lifetime access to the course materials and any updates that are made.</p><p>You will be given manuals in addition to the course manuals that you can edit and use for your own Reiki practice. This course is always being added to, and with your lifetime access you can access the new information whenever you choose.</p>\n\n<p><strong>Important Note:</strong></p>\n\n<p>Students who wish to receive certification in this course will receive attunements to Levels I, II and Master Reiki which will require that they provide personal information (name, email) when they schedule these attunements. Note: information provided is confidential and only used for the purpose of the attunement ceremony.<br></p>", 
    "end_date": null, 
    "title": "Reiki Level I, II and Master Certification", 
    "price": "45.00", 
    "instructors": "Lisa Powers", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59527_ac27_15.jpg", 
    "course_url": "https://www.udemy.com/reikicourse/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-11T21:02:53Z"
}