{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Be Prepared to Find Love in 2016!<br></strong><br>This is the ultimate relationship coaching course. If you are looking for dating tips of men or dating tips for women than we are here to help! This course will provide dating advice that could change your life.  If you are you tired of being single and ready to find the one than you should start focusing on relationship coaching with a course like this one. Are you dreaming about finding the perfect match and being in an amazing healthy relationship with your significant other? Are you frustrated with the dating scene and the difficult process of finding that person? You don't have to feel this way anymore. This course will help you attract the love life you want with actionable dating tips for both men and women.  </p>  <p>  \t      In this course you will learn dating techniques and go through relationship coaching that will have potential partners begging at your feet (no jokes!), you will learn the techniques that will allow a relationship to grow and become better with time, you will learn how to become emotionally ready for your next commitment and how to love the life you are living with your partner!  </p>  <p>  \t<strong>What are others saying about this course:</strong>  </p>  <p>  \t<em>I really enjoyed the content of this course, a lot of practical information that you can apply not on your dating life but also you other side of personal life. The action items and worksheet really help me to actually apply the course to my life. Really helpful relationship advice! Beside I like how both of them present the content, very engaging. Overall an awesome course that you must take if you want to have great relationship. -Vigilius Tridian</em>  </p>  <p>  \t<em>This course is awesome. Johnny and Larissa know what they speak about. The course is great for the extroverted and the introverted. No matter where you fall on the social spectrum, their advice will help you in finding the relationship you want. The content was actionable and memorable. The production quality was also great. Well worth your time and money!- Kevin Douglas</em>  </p>  <p>  \t<strong>After Taking This Course You Will:</strong>  </p>  <ul>  \t<li>Finally meet your perfect match!</li>  \t<li>Break old habits that's been preventing love from finding you!</li>  \t<li>Feel Empowered with winning attraction formulas!</li>  \t<li>Discover new hope in your love life!</li>  \t<li>Have more confidence when dating!</li>  \t<li>Enhance your overall love life and receive more love!</li>  \t<li>Find solutions to age old problems!</li>  \t<li>Develop success habits!</li>  \t<li>Develop a criteria against which you can measure your perfect match!</li>  \t<li>Know exactly what you want!</li>  \t<li>Know how to find your perfect match!<br></li>  </ul>  <p>  \t<strong>What's in the course:</strong>  </p>  <p>  \t      Through the use of video tutorials, Powerpoint presentations and real-world examples you will gain the tools needed to become relationship ready.  </p>  <p>  \t      After the first 20 minutes of the course you will already have acquired the basic skills needed to start your journey on becoming the best catch.  </p>  <p>  \t      In a series of quick 5 minute videos with one easy exercise at the end of each section you will breeze through this course and make you relationship ready in no time.<br><br>  </p>  <p>  \t<strong>You should take this course if:</strong>  </p>  <ul>  \t<li>You are ready for an amazing relationship.</li>  \t<li>You are tired of being single.</li>  \t<li>You want your next relationship to last a lifetime.</li>  \t<li>You want to become the perfect catch.</li>  \t<li>You want to learn the habits of people in successful relationships.</li>  \t<li>You want to take control of your love life.</li>  \t<li>You are looking for dating tips.</li>  \t<li>You are looking to invest in personal development.</li>  \t<li>You are looking to take the ultimate relationship coaching program!</li>  </ul>  <p>  \t  Scroll back up and join the course today.  </p>  <p>  \t    We are excited to see you in the course!  </p>  <p>  \t      -Larissa and Johnny  </p>", 
    "end_date": null, 
    "title": "Relationship Ready, Meet & Attract Your Perfect Life Partner", 
    "price": "20.00", 
    "instructors": "Johnny FD Jen, Larissa Swart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/303978_156d_8.jpg", 
    "course_url": "https://www.udemy.com/get-relationship-ready/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-20T02:16:36Z"
}