{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn a simple and powerful technique that will radically change your life. Whether you are new to Mindfulness or want to do a refresher course, this program will assist you to anchor this wonderful tool into your life. </p>\n\n<ul><li>Reduce stress and tension</li><li>Manage insomnia. Get a good nights sleep</li><li>Feel calmer and more relaxed. Reduce anxiety and depression. </li><li>Live a fuller life by being more present.</li><li>Improve your relationships by responding as opposed to reacting</li></ul>\n\n\n\n\n\n<h4>What You Get When You Enrol in This Program:</h4>\n\n\n\n\n\n<ul><li>Video lectures about all things related to Mindfulness</li><li>MP3 recorded meditations</li><li>A 58 page WORKBOOK with valuable information and exercises and reflections to help you to get the most out of this course.</li><li>Quizzes throughout the program to test your learning.</li><li>Access to Teagan via email and the discussion boards.</li><li>Practice in the comfort of your own home at your own time and pace</li></ul>\n\n<h4>How Is This Program Different To Other Mindfulness Courses?</h4>\n\n\n\n\n\n<p>Lets just say that there are some great Mindfulness programs on Udemy and you will benefit from all of them. Follow your heart and go with the one that calls to you :)</p>\n\n<p>Teagan is one of the most highly skilled meditation teachers you will find because she understands that you need to find the right meditation practice for you. Not one size fits all. We are all different and as such need different practices that suit our needs. For example, if you have a highly distracted mind, you need a practice that will keep you really focused. She wants you to succeed not fail. She wants you to fall in love with this practice not to find it a chore!</p>\n\n<p>This program also includes a module about effective breathing. Breath is so important to Mindfulness practice and can bring you into the present quickly.  This is the only course that includes breathing instruction.</p>\n\n<h4>Why Study With Teagan?</h4>\n\n<p>Teagan Fea is a twice qualified Yoga Teacher and has been practicing meditation for 16 years. She also works as a Therapist helping people to transform their lives with daily mindfulness practice. She is also a teacher with Mindfulness Works NZ. Teagan offers her wisdom and experience in this program.</p>\n\n\n\n\n\n<p><em>“Thank you for all your support and guidance.  I know I have told you this a lot but my time with you (both on the course and one on one) has been truly life changing.  You have given me the insight and courage to make the move and to work towards changing careers, to be happier and more accepting of life, and to be more mindful.  You are AMAZING and inspiring.  I feel truly blessed to have met you and so very grateful for it all.” Erica, Auckland</em></p>\n\n\n\n\n\n<h4>Register today &amp;  join thousands of students around the world who are feeling more relaxed!</h4>", 
    "end_date": null, 
    "title": "Relax, Sleep Peacefully & De-stress With Mindfulness", 
    "price": "20.00", 
    "instructors": "Teagan  Fea", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/869790_c14b.jpg", 
    "course_url": "https://www.udemy.com/relax-into-life-with-mindfulness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-06T00:08:18Z"
}