{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>This course is the Holy Grail of the Remote Viewing world.</strong> <em>(Largely because one could use this knowledge to find the Holy Grail.)</em> Remote Viewing has finally advanced enough to where the exact location of a person, place, thing or event, can be located in tandem with the Global Positioning System (GPS).</p>  <p><strong>In this course, you’ll be able to:</strong></p>  <ul><li><strong>Locate buried treasure</strong></li><li><strong>Find a missing child</strong></li><li><strong>Find a murder victim’s lost remains</strong></li><li><strong>Establish your sanctuary site in a disaster</strong></li><li><strong>Track a “most wanted” fugitive.</strong></li><li><strong>Know the location of the “next” terror attack, or mass shooting</strong></li><li><strong>Locate Real Estate for personal use or investment</strong></li><li><strong>Even use it to hunt for Big Foot and UFO’s.</strong></li></ul>                <p>Doing all of this from the comfort of your kitchen table. By using your Remote Viewing skills, along with the recommended software, or even Google Earth, you’ll be able to discover what others have lost, or are unable to find.</p>  <p><em>But…This course is not for everyone. </em><strong>You must have taken the previous courses, the Basics, Advanced and Master’s courses </strong>in order to understand how to work this course successfully. You must be fluent in the standard Remote Viewing protocols and the Associative Remote Viewing protocols in order to tackle these complex methods and strategies. </p>  <p>If you have achieved that level, congratulations! You are the elite, the expert class that can finally complete your RV skill set. </p>", 
    "end_date": null, 
    "title": "Remote Viewing GPS - Expert Edition Part 1", 
    "price": "20.00", 
    "instructors": "Stacey Tallitsch", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/515834_c768_2.jpg", 
    "course_url": "https://www.udemy.com/remote-viewing-gps/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T04:34:41Z"
}