{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Discover the Advanced skills of Remote Viewing. Prepare yourself for expanded intuitive abilities in every aspect of your life, and understand what success means. Opportunity is the lifeblood of success, and without intuition there is no opportunity. </p><p style=\"\">In this course, you&#039;ll be given the opportunity to deconstruct complex targets (with other students), which could be a once in a life-time event to join a quest and solve a mystery. </p><ul style=\"\"><li><strong style=\"\">Join other students by working in teams to unravel enigma targets and learn the truths others only speculate.</strong></li><li><strong style=\"\">Pick winning horses at the track and Off-Track-Betting. </strong></li><li><strong style=\"\">Toss the templates and use the full potential of your intuition. </strong></li><li><strong style=\"\">Learn how professional Remote Viewers do their work with little more than blank sheets of paper and a pen.</strong></li><li><strong style=\"\">Hear from those who know what it takes to become a billionaire, and harness that potential by learning this skill.</strong></li><li><strong style=\"\">Explore your potential with Blind Targets and discover the pitfalls of Front Loaded targets.</strong></li></ul><p style=\"\">Learn how to free yourself from the daily grind of working for someone else, without vision, without unlimited growth. Become what you&#039;ve always wanted, unearth your full potential and have the confidence that your path is how you succeed, where others fail.</p><p style=\"\"><strong style=\"\">If you&#039;re looking to take your intuition to the next level, you need this course. </strong></p><p style=\"\">In this course, you&#039;ll need blank sheets of paper, a black pen, a printer and an unyielding thirst to know the unknown and be successful. </p><p style=\"\">If you&#039;ve <em style=\"\">never </em>said to a missed opportunity, &quot;Man, if only I had known that...&quot; then this course is not for you. </p><p style=\"\">If you&#039;re tired of always missing out on success. Never knowing the best option, and always choosing the wrong way, then you really need to learn Remote Viewing and turbo charge your intuition to obey your wants, and protect you from being your own worst enemy. </p>", 
    "end_date": null, 
    "title": "Remote Viewing Advanced - Intuition of Billionaires", 
    "price": "20.00", 
    "instructors": "Stacey Tallitsch", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/190868_ea6c_4.jpg", 
    "course_url": "https://www.udemy.com/remote-viewing-advanced-intuition-of-billionaires/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-29T14:39:46Z"
}