{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>What would your life be like if you could go back in time and change your personal history to eradicate the suffering?</p>\n\n<p>What would change in your life if your memories couldn't hurt you any more? </p>\n\n<p>TimeLine Transformation is a fast, simple reprogramming of the brain to remove trauma and sabotaging programs and patterns. Memories are retained, but they no longer have the power to hurt you. Negative behavior dissolves effortlessly usually in a single session. </p>\n\n<p>Watch and DO the simple reprogramming techniques WITH these brave souls who had their TLTs videoed so that YOU could do the processes along with them and heal as well.</p>\n\n<p>You will learn how to clear negative emotions, such as anger, with Kimberly as she dissolves years of rage at her family. - Rachila was going to come up next to clear deep sadness, but she didn't need to because she had followed the process while I worked with Kimberly so her grief was gone.</p>\n\n<p>We cleared a rape trauma for Joni that had caused a lifetime of not trusting herself. After 10 minutes her tears had turned to laughter and 'I got this!' - Sophia hadn't been raped, but as she did the process with us she cleared not trusting herself.</p>\n\n<p>And that's just the first two demonstrations.</p><p>After that you get to do it yourself for your own trauma</p>", 
    "end_date": null, 
    "title": "Reprogram your Brain so your memories can't hurt you!", 
    "price": "50.00", 
    "instructors": "Joy Phoenix", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/564218_4451_6.jpg", 
    "course_url": "https://www.udemy.com/reprogram-your-brain-so-your-memories-cant-hurt-you/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-25T05:51:25Z"
}