{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          <strong style=\"\"></strong>En este curso conseguirás establecer tus objetivos, crear un plan de acción y pasar a la acción para conseguir tus objetivos y transformar este año en el año que deseas.  </p><p style=\"\">Trataremos todos los aspectos de tu vida:</p><p style=\"\"><strong style=\"\">1. Creando el plan de acción</strong> - no puedes crear cambios sin establecer primero tu plan de acción y conocer qué pasos debes poner en práctica. </p><p style=\"\"><strong style=\"\">2. Conoce tu mente</strong> - para crear nuevos hábitos y nuevos patrones mentales, debes saber cómo funciona tu mente y cómo puedes conseguir de un modo más eficaz, conseguir mejores resultados.</p><p style=\"\"><strong style=\"\">3. Cuida tu salud</strong> - un cuerpo sano es una mente sana. Aprende a cuidar tu alimentación, anímate a hacer deporte,...</p><p style=\"\"><strong style=\"\">4. Relaciones sociales y de pareja</strong> - aprende a comunicarte con tu entorno y a ser más asertivo.</p><p style=\"\"><strong style=\"\">5. Carrera profesional </strong>- descubre tu pasión, tus fortalezas y tus debilidades, establece tus objetivos y disfruta de tu trabajo.</p><p style=\"\"><strong style=\"\">6. Reinvéntate</strong> - ahora que ya sabes qué quieres y cómo hacerlo, es el momento de crear tu nueva vida, cambiar tu imagen, impulsar tu carrera y conseguir tus objetivos. </p><p style=\"\">En este curso, muy práctico, irás creando paso a paso el plan de acción para conseguir tus objetivos en los distintos aspectos de tu vida.<br style=\"\"></p>  <p style=\"\">  \t        Encontrarás vídeos y pdf&#039;s que te contarán paso a a paso lo que tienes que hacer.  </p>", 
    "end_date": null, 
    "title": "Reto año nuevo ¡Reinvéntate!", 
    "price": 0, 
    "instructors": "Marta Alerm", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385914_b37a_2.jpg", 
    "course_url": "https://www.udemy.com/reto-reinventate/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T18:49:13Z"
}