{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t          Saying “no” is a skill that improves personal health <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">and </em></strong>the health of relationships at work, socially, and in the family.  If you say “yes” when you should say “no,” you plant seeds of discontent that will grow into a nasty \"weed patch\" that will spoil the landscape of your life.  </p>\n\n<p>  \t          This course will quickly help you learn why it is difficult for you to say “no” and teach you how to say the powerful, tiny word “no” with confidence.  The lively video sessions will help you learn quickly and efficiently.  They are backed up by downloadable and linked resources so you will have all that you need to transform your life—<em><strong>to go from giving in to what others want to </strong><strong>getting on with what you want</strong>.</em>  </p>\n\n\n\n<p>This course was entirely developed and written by Richard Walters, PhD.  The course includes methods that he used during his career as a licensed psychologist and workshop leader where he saw many people experience great benefits from the principles and methods in this course.  Everything in the course was prepared by Dr. Walters but, because a neurological problem has robbed him of speech, he is assisted in delivery of the training by Dan Walters (the voice on lesson 5 and who appears in lessons 8 through 12) and by Greg Vonow (the narrator of lessons 1, 2, 4, and 6).  We all wish you well.</p>\n\n<p>It is a precious privilege to have the opportunity to learn and grow in life skills.  Use the opportunity, and <strong class=\"redactor-inline-converted\">may you prosper!  </strong></p><p>The course is one-hour, in short, easy to understand lessons, with a self-evaluation inventory and various downloadable guide sheets including \"mini-posters\" that can help you change habits you haven't been able to change--until now.</p><p><strong>Let's get going!  I am ready to help you!</strong></p><p>Rich Walters<br></p>", 
    "end_date": null, 
    "title": "Say No, Stay Friends", 
    "price": "20.00", 
    "instructors": "Dr. Richard Walters", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/164860_ec36_10.jpg", 
    "course_url": "https://www.udemy.com/say-no-stay-friends/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-15T19:16:27Z"
}