{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong></strong><strong>“Scent of the Spiritual”</strong> is a course that examines human nature and living a spiritual life in today’s modern world. The course material does not represent any lineage or spiritual system, but represents the insights and discovered truths of the lecturer, some 40+ years after an initial spiritual awakening.  </p>  <p>  \t  The course material is a modern viewpoint, referencing neuroscience and psychological principles. But the spirituality presented here is also grounded in everyday understanding that we all share. The &quot;Shift&quot; of consciousness that one may have heard about is also explained.  </p>  <p>  \t  The author has taken great effort to present everything in simple language without special meanings that only an “insider” would understand. Be assured that a spiritual life is available to everyone, not just the lucky few that have had an “awakening.”  </p>  <p>  \t  The course is presented in lecture format (see the intro video) along with selected (and short) essays in PDF format. The student is encouraged to view the lectures once all the way through in the order presented, and then to review or revisit areas of interest.  </p>  <p>  \t  Suggestions are made on how to incorporate a spiritual viewpoint while still being part of the world. The world changes one person at a time, and you may be the one to change today. I am grateful for your participation.  </p>", 
    "end_date": null, 
    "title": "Scent of the Spiritual", 
    "price": 0, 
    "instructors": "Larry Davis", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/334048_d8b6.jpg", 
    "course_url": "https://www.udemy.com/scent-of-the-spiritual/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-02T13:12:26Z"
}