{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">WHY do so many women struggle with receiving in their lives, whether with Money, Love, Happiness, Purpose etc.? Receiving is our Birthrite, yet we have never been taught this valuable skill. In fact, our conditioning has been quite the opposite! </p><p style=\"\">DO YOU FEEL: </p><p style=\"\">*Constantly stressed about Money </p><p style=\"\">*Underappreciated in your Relationships </p><p style=\"\">*Stuck in an unfulfilling Career </p><p style=\"\">*Physically Drained and Depleted </p><p style=\"\">*You Give and Give for little in return </p><p style=\"\">If you said YES to any of the above that is a sign your receiving channels are blocked! My name is Shakaya and I am an ABUNDANT Receiver. I mentor people around the world in how to Receiving (without all the struggle, stress and shame!). In this course I present PRACTICAL receiving SECRETS for people who desire to learn how to receive all the Money, Love, Health &amp; Happiness they desire and deserve!  </p>Secrets to Receiving is a fun, content-rich course that will assist you to release the blocks you have around receiving, and transform you into a channel of receiving! People don&#039;t know why but they either want to give to you or they don&#039;t... after this course you will understand why receiving may have been difficult for you, and exactly how to open to receive MORE Money, Love &amp; Abundance that you want~ sky&#039;s the limit for people who know how to receive! <p style=\"\">You will learn the 3 pillars of Receiving: 1. Release the Blocks to Receiving 2. Discover the Archetype of Receiving 3. Practice the Receive Rituals. You will receive with this course video instruction and training templates to keep you engaged and on track for REAL results!</p><p style=\"\">I hope you will join me, and i can&#039;t wait to get started on YOUR Receiving Journey!</p>", 
    "end_date": null, 
    "title": "Secrets to Receiving", 
    "price": "40.00", 
    "instructors": "Shakaya Leone Leone", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/537584_3f11_3.jpg", 
    "course_url": "https://www.udemy.com/secrets-to-receiving/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-26T01:42:09Z"
}