{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong> NEW COURSE launched November 2015!</strong></p><p><strong>Already with 250 students seeking the Truth!</strong><br></p><p><strong>Enlightenment. It's what we all want.</strong> Even if we don't know it's what we want, (or think we don't know what we want) it's what we all want, no exceptions, and it is most certainly what we all need.</p><p>Enlightenment has been reserved for the few, at the expense of keeping the masses in the dark. This can no longer continue, for an unconscious humanity, who is a slave to a system that that has greed at its core, is a danger, not only to himself, but to all life on this planet.</p><p><strong>Now must be the time of the common awakening.</strong></p><p>We must all, each and everyone of us, take responsibility to <strong>reclaim what is rightfully ours</strong>, our birthright, the illumination of reconnecting with our own true, divine nature.</p><p>With such a shift in consciousness, <strong>all fears, doubts, worries and other illusions, that plague the mind like a dark cloud, will be lifte</strong><strong>d forever</strong>, in favour of the pure light of awareness. </p><p>To know ourselves as the pure light that is beyond decay, impermeable to the ravages of time, is to <strong>relax into the deepest rest ever known</strong>.</p><p>When the lights go on, life becomes simple, decisions become easy, things begin to flow with ease and grace.</p><p><strong>You will be elevated above all problems</strong> that previously seemed so big, they will no longer have any weight, they will have no power over you, for you will shine the light of clarity on all things like a lighthouse in the darkness.</p><p>The joy that comes from such a shift from mental obsession to the pure love of simply being is beyond words, and yet, you will understand it completely, for you will remember that place as that which you have somehow always known.</p><p><strong>It is time to believe in yourself, it is time for great things to happen to you, it is time for enlightenment. </strong></p><p><strong>ENROLL TO REVEAL THE TRUTH OF WHO YOU ARE! THE TIME IS NOW!</strong></p><p><strong>30 Day Money Back Guarantee!</strong><br></p>", 
    "end_date": null, 
    "title": "Secret Enlightenment : Spiritual Illumination For All", 
    "price": "20.00", 
    "instructors": "Mark Keane", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/625070_da18.jpg", 
    "course_url": "https://www.udemy.com/secret-enlightenment/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-28T19:45:38Z"
}