{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Prof. Franz Ruppert spricht von den neuen Entwicklungen in seiner psychotherapeutischen Arbeit. Hauptbestandteil sind Interviews mit Helge Max Jahns. Rupperts Arbeitsweise hat sich im Laufe des Jahres 2015/2016 vom herkömmlichen Aufstellen abgewandt und eine deutliche Veränderung oder Wende vollzogen.</p>\n\n<p>Nun arbeitet Ruppert mit der \"Selbst Begegnung\". Der Klient begegnet sich selbst. Er schreibt sein Anliegen auf eine Tafel. Dann beginnt er mit einem der Worte zu arbeiten. Nach einiger Zeit kommt das nächste und das nächste, bis alle Worte aufgerufen und ihnen nachgespürt wurde.</p>\n\n\n\n<p>Die Resonanz kann entstehen durch Stellvertreter, die mit einem Wort in Resonanz gehen oder durch den Klienten selbst oder auch durch den Therapeuten.</p>\n\n\n\n<p>Im Gesamtbild der Worte und dem, was sich im Verlauf zeigt, entsteht dann für den Klienten ein Bild, worum es tatsächlich geht, woran er arbeiten sollte, was sich noch zeigen will etc.</p>\n\n\n\n<p>Diese Art der psychotherapeutischen Arbeit ist nicht nur für besonders schwere Traumatisierungen besonders hilfreich und Erkenntnisse fördernd. Sie kann auch bei einfacheren Fragestellungen genutzt werden, wo sich mit \"Nachdenken\" keine weiterbringenden Ergebnisse oder Erkenntnisse zeigen wollen.</p>\n\n<p>Der Kurs wird aktuell gehalten. Weitere Veränderungen in der Arbeit von Franz Ruppert werden zeitnah durch weitere Interviewteile oder Auszüge aus Reden von ihm ergänzt.</p>", 
    "end_date": null, 
    "title": "Selbstbegegnung - die neue Arbeitsweise von Franz Ruppert", 
    "price": 0, 
    "instructors": "Helge Max Jahns, Prof. Dr. Franz Ruppert", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/827828_c624.jpg", 
    "course_url": "https://www.udemy.com/selbstbegegnung-mit-franz-ruppert/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T07:05:49Z"
}