{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>June 2016: Just added another article on SMART goal setting. More info to come!</strong></p><p><strong>It's NEVER too late to set a goal or make a resolution. NOW is the time to bring your dreams into the real world... but keep in mind...</strong></p>\n\n<p><strong>\"If you don't know where you're going... you might end up somewhere else.\" - Yogi Berra</strong>. </p>\n\n<p>Humorous as Yogi's statement is, there is a powerful truth behind it. If you wander aimlessly and expect to achieve your dreams and make specific things happen, you will be disappointed. You set goals and make resolutions because you want something to change... you want something to improve. But that can be difficult to do, maybe you've already tried and failed at goal setting. Maybe you're tired of making resolutions and dropping them after a month or two.</p>\n\n<p><strong>This course is all about making BETTER goals, not making more goals.</strong></p>\n\n<p>Let's talk about goals that you can actually stick to... resolutions you will keep. This is more than just a goal setting course where you set goals you'll never reach. My process shows you how to use simple <em>\"resolution hacks\"</em> to ensure you pick the right resolution from the beginning, then develop a realistic action plan to get there. No more fighting and losing the will power battle with changes you want or need in your life.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course is for anyone who's ever tried to make a New Years Resolution, and keep it, but couldn't make it happen.</strong></p>\n\n\n\n<p>It's for anyone who has something they want to change in their life, but can't seem to get there using will power alone. Take a different approach and learn to leverage your own strengths to make your goals achievable. By focusing your energy and creating a sustainable action plan you can reach those goals and make those resolutions stick.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">What's in this course?</strong></p>\n\n\n\n<p>Using short instructional videos paired with activities and thought exercises to hone in on the perfect personal resolutions for you, this course sets you up to make and keep your resolutions thoughout the year. If you've always wanted to travel, learn a new language, or develop a new skill you'll see how to do it. If you want to lose some weight, get fit, or get healthy you can. If you want to quit smoking, quit drinking, quit falling into debt and finally save money, this course will empower you to achieve your goals.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You can make 2016 the year you finally make those resolutions reality. </strong>Check out the lesson descriptions, watch the preview lessons and then Take this Course today and take action. The only way you'll ever get what you want is to go for it... now you'll know how.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course is totally risk free.</strong> Thanks to the Udemy money back guarantee, if at anytime during the first 30 days you want out you can get a full refund. So, you've got nothing to lose... and everything to gain.</p>\n\n\n\n<p>Click the <strong class=\"redactor-inline-converted\">\"Take this Course\"</strong> button today and start turning your dreams into reality now!</p>", 
    "end_date": null, 
    "title": "Set Goals and Resolutions That Stick", 
    "price": "20.00", 
    "instructors": "Eric Byrd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716534_2f10.jpg", 
    "course_url": "https://www.udemy.com/how-to-stick-to-your-new-years-resolutions/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-05T04:03:57Z"
}