{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>I believe that everybody should wake up each day to a life they love. <br> <br>I believe that everyone is capable of creating this life for themselves. <br> <br>But sometimes, it isn’t easy to make the necessary changes to bring about the life you love. The minutiae of everyday life gets in the way, you don’t know where to start, and before you know it the year is over, you're tired and still on the same treadmill wondering where the time has gone. <br> <br><em><strong class=\"redactor-inline-converted\">Seven steps to creating a life you love</strong></em> will help you get off the treadmill, get your power and energy back and go after the things you want. </p>\n\n<p>I have used these steps in my own life, with great success, and now I am sharing them with you. Each step is introduced with a video or text explanation, and includes downloadable worksheets for you to complete. The more time you spend completing the exercises in each step, the more you will get out of the course.</p>\n\n\n\n\n\n<p>In each step, we will look at the following areas:</p>\n\n\n\n<ul><li>Health and wellbeing </li><li>Work</li><li>Family and friends</li><li>Significant other, romance</li><li>Finances</li><li>Physical environment e.g. home</li><li>Fun, recreation and leisure</li><li>Personal growth, learning and self-development</li></ul><p><br></p>\n\n\n\n\n\n<p><em class=\"redactor-inline-converted\"><strong>Seven steps to creating a life you love</strong></em> will leave you with the skills and knowledge to implement change in your life at any given time. You will be able to take the exercises with you through life, and come back to them again and again each time you want to set a new goal for yourself.</p>", 
    "end_date": null, 
    "title": "Seven steps to creating a life you love", 
    "price": "20.00", 
    "instructors": "Tanya Wasylewski", 
    "commitment": "32 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818728_0e99_4.jpg", 
    "course_url": "https://www.udemy.com/seven-steps-to-creating-a-life-you-love/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-11T14:16:51Z"
}