{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A very small percentage of people are at a point in their life they dreamed of. Whether you like it or not, your current situation reflects the quality of choices you've made in your past.</p><p>This course for people that are striving for more than they currently are/possess and are willing to take the adequate actions. If you follow it, it will make you establish a mindset that will help you achieve your goals - not just the financial ones, but whatever you are missing in life.</p><p>I am going to teach you about all the crucial concepts you need to understand in order to live a satisfied life and not be disappointed. We're going to cover time, motivation, money, happiness, and more. </p><p>The following lessons, if used correctly, are going to change the way you think and perceive your surroundings. Therefore, if you are fully content with your life, I highly recommend you to stay away from this course, as any changes in your life might take your happiness away, and happiness is possibly the most important feeling that we all strive for.   </p><p>However, if you decide to participate in this course, I insist that you take constant notes on the most important concepts you learn from each lecture. By doing so, you will utilize my work to its full potential. Feel free watch the course 2 or more times, as it can only help you. </p><p>The course is made up of a few sections on specific topics. Each section has a few lessons directly related to the subject. They are slides with a voiceover. Main ideas are typed out, but the audio goes in more depth. <br></p>", 
    "end_date": null, 
    "title": "Shape Your Mind to Make Your Dreams a Reality & Avoid 9-5", 
    "price": 0, 
    "instructors": "Adam Kwiatek", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/800282_83a2_3.jpg", 
    "course_url": "https://www.udemy.com/makeyourdreamsareality/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-21T21:52:51Z"
}