{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Very helpful</strong></p><p><em>This course helped me to focus on what really matters to me. I feel grateful for being able to get rid of so much stuff, so many obligations that I wasn't even aware of before I started the course. I would recommend it to everybody that feels a bit lost from time to time or experiences a lack of time or focus in his or her life.</em></p><p>- Ada Kaspersma</p><p><strong>Very practical course</strong><br></p><p><em>I very much enjoyed following this course. It's very practical and helped me to Simplify my Life in different ways. I also enjoy Jelle's enthusiasm. Well done!</em></p><p>- Carola Schwab</p><p><strong>Extremely valuable</strong></p><p><em>A very good course to help yourself setting goals in life and live that way with focus. In fact it means you first set a goal and then minimize all things, people, work and stuff that distracts you from reaching that goal.</em></p><p><em>If you want more focus in your life on the topics that are important to you: follow this course.</em></p><p><em>If you expect a paved path which you can follow as a receipt, this is not your course.</em></p><p><em>It's all about you, your life, your goals. It's self reflecting, you learn a lot about yourself and after the course you think different about your life than before.</em></p><p><em>I gave a 4 star rating. It will become a 5 star if all lectures are in English. Now it has some Dutch audio and video with subtitles, but most of the video's are already in English. I hope Jelle will make the last few ones also in English.</em></p><p>- Martijn van de Polder</p><p><strong>Great!</strong></p><p><em>The greatest course ever in order to simplify your life! Easy, clear, simple and you just get enthusiastic and happy with Jelle as a teacher! I can really recommend this course, it is worth so much as time is the most current value in life!</em></p><p>- Viviane Vandewyer</p><p><strong>Learning every day</strong></p><p><em>I took the course at a moment I knew I really wanted some big changes in my life. The course was very clear and helped to start simplifying my life. But even after the course I still use the information on a daily base in making choices. Learning every day to say yes to a more simple and better life. And Jelle is a great teacher in this process.</em></p><p><em>- </em>Diane Kuiken</p><p><strong>This content changes your mindset</strong></p><p><em>By taking this course i've changed the way I make important decisions. I think Jelle is inspiring and the course helps me to do more of the things I really want to do and think twice before I agree to do something.</em></p><p>- Sanne van de Louw</p><p><strong>More focus</strong></p><p><em>I think Jelle and his course about Minimalism is very interesting. You will be more aware of your goals, dreams and the focus on the right things in your life. </em></p><p>- Linda Koster</p><p><strong>Not only simplify but also: what's your goal?</strong></p><p><em>Thanks to Jelle (the author of this course) I was already familiar with simplifying your life. I'm following him and his blog for a while. My expectations: only tips and trics about how to declutter but this is a lot more. In this course he tells you exactly how to find your goals and focus on the things you want to do in your life. And after that the next step: eliminate all that's distracting you from that goals!</em></p><p>- Léonie Teunissen</p><p>You are ambitious and want to get everything out of your life but you are distracted. You have no time left for the things you really care about and you are not living the life you will be proud of later on.<br></p><p>Something is missing, a clear direction.</p><p>In this online course 'Simplify your life in 4 weeks' you write your personal mission and you simplify to reach a life with less stress and more direction.</p><p>After this course you will have:</p><ul><li>a simplified life with less stress and more direction</li><li>you know what is really essential in your life.</li><li>a cleaner house and a calm head.</li><li>more time and money to spend on the things you always wanted to do.</li><li>you live with more awareness and understanding</li></ul>", 
    "end_date": null, 
    "title": "Simplify Your Life in 4 Weeks", 
    "price": "20.00", 
    "instructors": "Jelle Derckx", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610702_84f3_3.jpg", 
    "course_url": "https://www.udemy.com/simplify/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T13:06:22Z"
}