{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">This Course is intended to show you how to find the success you seek by adopting some very simple but powerful habits of today&#039;s greatest leaders. Remember,  &quot;life has no limitations, except the ones you make...&quot; Les Brown</p><p style=\"\">The Rich, Powerful and successful have something in common,</p><p style=\"\">They have great habits and they do things other people don&#039;t do and that is why they get what others won&#039;t get! </p><p style=\"\">You can be all you want to be, go where you want to go and achieve what you want to achieve but you need to change your daily habits to reflect your desire and break the limits over your life. </p><p style=\"\">It was Les Brown who said:</p><p style=\"\">&quot;life has no limitations, except the ones you make...&quot; Les Brown </p><p style=\"\">In the course I will show you those things that the rich and powerful do differently..</p><p style=\"\">They all have some things in common:</p><p style=\"\">They do difficult things others don&#039;t do....</p><p style=\"\">It takes guts to do tough things.. </p><p style=\"\">Many of us are conditioned to avoid problems,  change or trying out something new!         As a result, we rarely feel a sense of power and achievement.</p><p style=\"\">Worse, we go through life not growing and maturing.</p><p style=\"\">Do you want to :</p><p style=\"\">Have a productive Life?</p><p style=\"\">Learn to say NO without feeling guilty ?</p><p style=\"\">Learn how to ask for what you want.. ?</p><p style=\"\">Master the act of taking good and calculative risks?</p><p style=\"\">Then get ready, and I&#039;ll see you in our first lectures.</p><p style=\"\">Cheers! </p>", 
    "end_date": null, 
    "title": "Six Difficult Things That Powerful People Do..", 
    "price": "20.00", 
    "instructors": "Toyin Popoola", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585688_77e7_2.jpg", 
    "course_url": "https://www.udemy.com/six-difficult-things-that-powerful-people-do/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T18:56:24Z"
}