{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Social Anxiety Solution: How to Overcome Social Anxiety Disorder, Social Phobia and Shyness! </p>\n\n<p>I'm Rafael Cintron, the founder of the Life Development Academy. I dedicate myself to help people defeat anxiety, depression and create happiness in their lives. I myself came from a very difficult place full of anxiety and shyness and I managed to break from all of it. I now dedicate to teaching you how you can do it too!  </p>\n\n<p><strong>What will you learn in this course? </strong></p>\n\n<ol><li>How to Stop Your Negative Thoughts and Anxieties </li><li>How to Relieve Your Constant Shyness and Learn how to be social </li><li>How to Always be in a Positive Mood </li><li>How to Start and Keep Conversations with People without being awkward </li><li>How to Get Compliments from other people  </li><li>How to Feel Great about Yourself </li><li>How to Show Your Personality to the world and make people love you for who you are </li></ol>\n\n<p><strong>Why should you trust me? </strong></p>\n\n<p>Through my daily videos in the Life Development Academy, I help people achieve their dreams and improve every single day. With this complete course, I'm finally able to create a step-by-step process to ensure you have more energy to build a better life. This course is one of the first on my entire Life-Developing Project. If you take this course I ensure that you will not be disappointed and will finish with a renewed look on your social life and will be able to express your personality like you never imagined. </p>\n\n<p><strong>How does the course run? </strong></p>\n\n<p>The course is composed of 4 major chapters that will teach you the top areas of overcoming your Social Anxiety Disorder and breaking free from the Anxiety. I will teach you step by step how I managed to overcome my shyness and how you can do it too. </p>\n\n<p><strong>Is this a final course?</strong></p>\n\n<p>No.Future courses will include other topics in Life Development and Motivation to help you even more and increasing your success and fulfillment in life. If you like the Increasing Willpower and Productivity Course, be sure to stay tuned for the next ones.    </p>\n\n<p><strong>Thank you for choosing my course and have a great day! </strong></p>", 
    "end_date": null, 
    "title": "Social Anxiety Solution: How to Overcome Social Anxiety", 
    "price": 0, 
    "instructors": "Rafael Cintron", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833596_7540_3.jpg", 
    "course_url": "https://www.udemy.com/social-anxiety-solution-how-to-overcome-social-anxiety/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T16:03:30Z"
}