{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t  Revolutionize how you deal with life&rsquo;s challenges, crisis, problems and stress so you can get on living fully!  </p>  <p>  \t  This Algorithm for Emotional Fitness and Intentional Change provides the framework for leading an exciting and fulfilling life aligned with what you really want. It provides you with the knowledge and some of the tools needed to get you off the stress-treadmill and moving forward on your own terms again.  </p>  <p>  \t  You will <strong style=\"\">FEEL</strong> the potency of the simple ideas taught in this program because the <strong style=\"\">Algorithm</strong> makes use of ground-breaking perspectives that alone, can turn your life around &mdash; but only if it needs it!  </p>  <p>  \t  Life happens and it is not always pretty. During crises and in our ordinary lives, there are pivotal actions that have a far reaching impact. Learning where these are and how to utilize them builds our emotional fitness (and sanity!)  </p>  <p>  \t<strong style=\"\">Develop Your Own &quot;Personal Crisis Response Plan&quot;</strong>  </p>  <p>  \t This course will show you the 5 - 15 seconds that you probably haven&#039;t paid much attention to in the past. This one lesson alone can make a massive difference to your life in the days and years to come!  </p>  <p>  \t  What is taught is essentially very easy, but like most things, there are levels of skill. We can all swing a golf club, but swinging it like Tiger is something else all together! Still, even those who are not pros can enjoy the game immensely, our time outdoors, the relationships and many other side benefits.  </p>  <p>  \t  Having simple, doable systems and steps to call upon whenever needed can make a massive difference to anyones&#039; life, and when used, can save enormous amounts of grief, wasted time and stress.  </p>  <p>  \t  This same formula can be used to initiate changes you wish to make in your life.  </p>  <p>  \t<strong style=\"\">Radically New - Not Taught Anywhere Else</strong>  </p>  <p>  \tWhile this approach to personal problem solving and stress reduction is not taught anywhere else, it is based on more than twenty years of theoretical development, clinical practice and empirical research.  </p>  <p>  \t  The few simple exercises that the training takes you through will allow you to see your life and your future with new eyes!  </p>  <p>  \t  This course is preparatory for the &quot;Solutions Mastery&rsquo;s Advanced Training: The Revolution&rdquo; and provides essential information, powerful insights and practical steps you can start using today.  </p>", 
    "end_date": null, 
    "title": "Solutions Mastery: An Algorithm for Emotional Life Fitness", 
    "price": "20.00", 
    "instructors": "Karen Judd Smith", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119562_9b70_7.jpg", 
    "course_url": "https://www.udemy.com/solutions-mastery-an-algorithm-for-emotional-life-fitness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-14T00:22:18Z"
}