{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The  <em style=\"\">Soulscripting(</em>TM) course helps people change their lives. </p><p style=\"\">Ever wonder where you took a wrong turn? Want to get back to who you were born to be?</p><p style=\"\">This course narrows the gap between where you are and where you wish to go by offering a four part practical technique. It addresses everything from inhibitory shadow beliefs to innate gifts and will empower you to take charge of your life story.<span style=\"\"></span></p><p style=\"\"> <em style=\"\">Soulscripting(</em>TM) dives deep into your core and frees the soulful aspirations that reside there. You have to uncover your truth before you can live it and this method does just that. </p><p style=\"\">The course consists of twelve lectures which include a 44 page workbook containing several exercises that will guide you in this powerful journey. The suggested time to cover  the material is four weeks in order to experience the full impact. </p><p style=\"\">Soulscripting is straightforward and applicable to real-life. Though it is a soulful journey, this is not a &quot;woo-woo&quot; presentation packed with fluff that sounds nice. This course will provide a meaningful exploration to get you aligned with your deepest desires and provide tools you can use long after the course is complete. </p>", 
    "end_date": null, 
    "title": "SoulScripting: How to Craft The Story of the Life You Crave", 
    "price": "35.00", 
    "instructors": "Emelia Sam", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/516406_d751_2.jpg", 
    "course_url": "https://www.udemy.com/soulscripting/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-31T21:57:33Z"
}