{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this <strong>audio only</strong> program hosted by Dr. Weil and his renowned colleagues in the space, you will learn to:</p>\n\n<p><strong class=\"redactor-inline-converted\">Build a Natural Foundation of Emotional Wellness\nwith Dr. Andrew Weil</strong></p>\n\n\n\n<p>Just as the body is designed to heal itself, so too are we wired for emotional well-being. With <em>The Spontaneous Happiness Prescription</em>, you’ll learn Dr. Andrew Weil’s most effective strategies for overcoming anxiety and depression while cultivating a lasting “sea level” of contentment, comfort, and serenity—naturally. </p>\n\n\n\n\n\n<p>Day by day, you’ll raise your “happiness baseline” by making simple dietary and lifestyle changes, calming your senses, improving your sleep cycles, connecting more deeply with others, and utilizing other practical strategies emerging from current medical research.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>The Spontaneous Happiness Prescription</em> includes two Sections narrated by Dr. Weil and three practice-filled Sections lead by his renowned colleagues:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Steven Gurgevich, PhD will lead you through powerful breathing exercises to help refocus both mind and body for calm and resilience</li></ul>\n\n\n\n\n\n\n\n<ul><li>Sharon Salzberg, co-founder of the Insight Meditation Society, will lead you through mindfulness meditation for increasing awareness and presence—two states found in our most fulfilling moments; as well as practices for fostering gratitude, forgiveness, and loving kindness</li></ul>\n\n\n\n\n\n\n\n<ul><li>Madan Kataria, the Laughter Guru, will teach you a step-by-step process for incorporating Laughter Therapy into your life</li></ul><ul><li>In addition, please download the self-reflection workbook in Section 1, Lecture 1</li></ul>", 
    "end_date": null, 
    "title": "Spontaneous Happiness Prescription by Dr. Weil (Audio Only)", 
    "price": "40.00", 
    "instructors": "Sounds True, Andrew Weil", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855206_0b1a.jpg", 
    "course_url": "https://www.udemy.com/dr-andrew-weil-audio-only/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T18:39:41Z"
}