{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Come with me on a journey to achieving your dreams quickly. Where you will transform your life from mediocrity to greatness and become a purpose-driven woman who is living intentionally.</em></strong></p><p><strong><em>****Over 1800+ Students are already enrolled ****</em></strong></p><p><strong><em>****COURSE UPDATED IN DECEMBER 2015****</em></strong></p><p><strong><em></em></strong>There is no manufacturer who releases his product into the marketplace without a well-defined purpose or function. “<em>Before I formed you in the womb I knew you,  before you were born I set you apart; I appointed you as a prophet to the nations (Jer1:5niv)</em>. If the product is used in unintended ways, it will lead to accidents, breakdowns and frustrations. <strong></strong>  </p>  <ul>  \t<li><em>Are you frustrated      with the direction of your life?</em></li>  \t<li><em>Are searching for your      purpose in life?</em></li>  \t<li><em>Are you wondering why      you are here?</em></li>  \t<li><em>Is your life stagnant?</em></li>  \t<li><em>You know there's much      more to you than meets the eye</em></li>  \t<li><em>You have a burning      desire to be more and achieve more</em></li>  </ul>  <p>  \tIf you are ready to<strong> BREAKTHROUGH</strong> to the <strong>NEXT-LEVEL</strong>, then this course is for you. <em>You are fearfully and wonderfully made (Psa139: 14kjv)</em> to fulfill a specific purpose and your role is to DISCOVER the purpose and walk in it.  </p>  <p>  \tAfter years of living in mediocrity, I went on a journey of self-discovery.  </p>  <p>  \tWhat I found were time-tested TRUTH that will elevate any average Joe from a life of mediocrity to fulfillment of destiny.  </p>  <p>  \tYour destiny is hidden under layers of decisions made by you or for your, life circumstances and situations. Until the layers are pilled back and the true <strong>YOU</strong> is revealed, your destiny is questionable.  </p>  <p>  \t<strong>JOIN TODAY </strong>to start uncovering your destiny  </p>  <p>  \t<em>Many are called but few are chosen (Matt22: 14kjv).</em> This journey is only for the chosen few who are <strong>BOLD</strong> and ready to put their <strong>FAITH</strong> to work.  </p>  <p>  \tAll your emotions and methodologies will be tested. Your EXPECTATION will determine the RESULTS you get from taking this journey with me. Discovering your purpose is a personal commitment; your family and friends cannot help you. It's just YOU and the creator. <em>For the earnest expectation of the creation eagerly waits for the revealing of the sons of God. (Rom8:19nkjv). </em><strong>SIGN-UP NOW</strong> your future awaits you.  </p>  <p>  \tIt's a New Life. It's up to you to believe it, walk in it and your expectation shall not be cut-off.</p><p><strong>Click the \"take this course\" button, top right, now ... </strong><em><strong>your transformation is now</strong></em></p><p><em>Thank you, Keroy King</em></p>", 
    "end_date": null, 
    "title": "Steps To Becoming a Purpose-Driven Woman ", 
    "price": "20.00", 
    "instructors": "Keroy King", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/327908_ab7d_11.jpg", 
    "course_url": "https://www.udemy.com/its-a-new-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-27T05:34:28Z"
}