{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>*DISCLAIMER - I would never recommend or share anything that I haven't applied and been successful with. What I share in this course I have applied, tested and proven. </strong></p><p><strong><em>LATEST: Course Updated for October 8, 2015</em></strong></p><p><em><strong>Please NOTE: </strong>This course has been completely re-done to add massive amounts of value to my students.</em></p><p>  \t    The '<em>Success Series'</em> course is the ultimate course where you'll learn how to:  </p>  <ul>  \t<li><strong>Stop Procrastinating and Gain Consistent Motivation That Lasts! <br>  \t</strong></li>  \t<li><strong>Replace Limiting Beliefs With Instant Confidence <br>  \t</strong></li>  \t<li><strong>Live a Life of Purpose, Passion and Fulfillment <br>  \t</strong></li>  \t<li><strong>Map Out Your Ideal Life and Then Make It a Reality<br><br></strong>This course will rapidly shorten the gap from where you are today to where you want to be in the future by giving you proven systems to overcome any challenge or obstacle, erase any fear and build a foundation for success that will give you a huge advantage in life.</li></ul><p>__________________________________________________________________________</p>  <p>  \t<strong> Imagine Yourself...</strong>  </p>  <p>  \t        Waking up in 12 months, or maybe even in 3 years in the same exact place you are now... Making the same amount of money, wishing you had done something different, but you didn't, and now you have to live with the regret and disappointment of wondering \"what if?\"  </p><p>What if you had started investing in yourself earlier, where would you be now? ....What if you had more money and free time, instead of stress, self-doubts, fears and uncertainty.<br>  \t<br><strong>Now Imagine...</strong><br>  \t<br>  \t        Having a clear road map to follow that will guide you towards your ideal life, and the achievement of all your goals. One that will bridge the gap between where you are now, and where you want to be. A road map that will guide you to having the freedom, confidence, and financial security to do more of what you love with the people you love.<br>  \t<br><strong>Trust me...</strong><br>  \t<br>  \t        I know how it is to struggle with uncertainty, lack of direction, not really sure what my purpose in life is, or what I'm really passionate about...and I think everyone on this planet knows what it's like to struggle with procrastination, and if we're being honest, who doesn't have self-doubts, fears and frustrations and have a couple bad habits we'd like to replace. <br>  \t<br><strong>But what if...</strong><br>  \t<br>  \t        You had a way to never procrastinate again, how much could you accomplish? What would you want to accomplish and start going after in your life, knowing that nothing could hold you back?<br><strong><br></strong></p><p><strong>If you're ready...</strong><br>  \t<br>  \t        To start living life on your terms, have better health relationships and more money and free time then this is your chance to make that a reality in your life right now!  </p><p>__________________________________________________________________________</p><p><strong><br></strong></p><p><strong>You Can</strong> <strong>Do it Too</strong><br></p><p><strong><br></strong></p><p>Regardless of your age, or where you're at in life right now, this program will show you step-by-step how to gain total control over the direction, outcome and quality of your life.<br><br>Don't worry, I've got you covered by already doing the hard work for you by investing over half a million dollars and countless hours into finding out what works, what doesnt, and <strong>what really makes the difference when it comes to achieving success...</strong> This program reveals it all. <br></p><p>Now you can try this step-by-step program risk-free because we're so confident you're going to benefit from these tested proven methods that will show you EXACTLY how to bridge the gap from where you are today and the dream life you will envision and design during one of the training modules in the program. <br></p><p>Your confidence will soar when you feel what it's like to have absolute certainty you're doing the right thing, at the right time and you're on a direct path to the achievement of your goals. <br><br>This program is perfect for <strong>anyone who wants to achieve more financial abundance</strong> by following a proven process. <br></p><p>What I mean by proven process is just like following a recipe book in the kitchen, this program is a recipe book with the step-by-step formula for you to follow to achieve the results you want both personally and professionally in your life. <br><br>Success is a science. And anything is possible through education. So when you learn how to tap into the limitless amount of self-confidence and motivation that you have within you, I have within me, and that we all have within us, anything is possible. We just have to unlock <strong>our true potential</strong> and this<strong> is accomplished through education and acquiring new knowledge. </strong><br></p><p>You'll feel what it's like to be unstoppable! Where you feel with absolute certainty that <strong>nothing can stop you from achieving your goals and your ideal life. </strong><br></p><p>It's an incredible feeling knowing you are following a proven process. </p><p><strong>I can remember the day I invested $25,000.00 in a business coach for one day of consulting.</strong> It was scary and exciting at the same time. That investment in myself and in my business turned out to be the smartest investment I ever made. </p><p>You control the outcome of your life by the decisions you make. Right now you have the opportunity to make an educated decision to increase the quality of your life and the trajectory of your success and financial income exponentially. <br></p><p>Because I like to keep things simple, the program was designed around making the training modules step-by-step so <strong>all you have to do is follow the guidance and take action! </strong></p><p><strong>__________________________________________________________________________</strong></p><p><strong><br></strong></p><p><strong>                                                              Course Details </strong></p><p><strong><br></strong></p><p>As you work through the course, I have provided <strong>5 - tailored Exercises and Examples</strong> that will walk you step-by-step through and teach you how to:</p><p> <strong>1. Stop Procrastination &amp; Get Motivated</strong></p><ul><li>How to Set Crystal Clear Goals - Vision, Time-Frame, Plan, Action (VTPA Exercise)</li><li>Make Sure Your Goals are Inline with Your Values - Value Based Goal Setting (VGBS Exercise) </li></ul><p><strong>2. Replace limiting beliefs with instant confidence</strong></p><ul><li>Learn How To Create Instant Change In Your Life - (Why We Do What We Do Exercise) </li></ul><p><strong>3. Live a life of purpose, passion and fulfillment</strong><strong></strong></p><ul><li>Learn How To Get More Done in Less Time - (Daily Productivity Planner)</li></ul><p><strong>4. </strong><strong>Map out your ideal life and then make it a reality</strong></p><ul><li>Find Out Your Current Quality of Life and How To Instantly Improve it - (Quality of Life Exercise)</li></ul>  <p>These exercises and examples will help you take your life from where you are now to where you want to be in the future.</p><p>__________________________________________________________________________</p><p><br></p><p><strong>    What Others</strong><strong> Are Saying...</strong></p><p><br></p><p>  \tHere's what a few students, who have <em><strong>already made the decision</strong></em> to take this course, had to say after finishing:  </p>  <p>  \t    <em>\"There are tons of personal development programs out there that take way too long to explain concepts. So much so, that I've stopped reading much of their content. This is the first course I've done that actually breaks everything down easily so I can work as I go, and not have to remember stuff later on. The worksheets are incredibly helpful to look at daily, because I can actually map out my week/month based on the larger goals. I would highly recommend taking this course if you have no clue how to set goals and work toward them. You'll avoid the hassle of trying to find the right books/audio programs to help you do that, which can be extremely confusing. Plus Mark's explanations and concept presentations are no-brainers. Highly recommend buying it, worth every penny and ounce of time.\"</em></p><p><em><strong>- Royce Rendon</strong></em></p><p><em>\"Mark obviously understands the fundamental components of getting what you want, and feeling how you want in life. His course covers various strategies to change your habits, mindset, and overall being in ways necessary to achieve success and/or complete happiness. If you know you want more out of life, but need some direction and guidance, this course will definitely pave the way!\" </em></p><p><em><strong>- Zach W<br></strong></em></p>  <p>  \t    <em>“Mark has mastered the two essential components to peak performance- design and optimal execution. He is the Tony Robbins of peak performance for empowering our youth.”</em> </p><p><strong><em>- Max Carey</em></strong> - <em>Founding Board Member of Outback Steakhouse</em>  </p><p><em>Thank you so much for creating this course! I've always had big dreams but never knew how to achieve them. This course helped me build a foundation to reach all of my goals and get rid of any limiting beliefs and roadblocks that could prevent me from attaining success. This should be taught in every school!<br></em></p><p><em><strong>- Liz Selby</strong></em></p><p><em>\"I've read Marks book SHORTEN THE GAP - Short Cuts to Success and Happiness and loved it so I try to get my hands on anything he does. Highly recommend his material to anyone that wants a higher quality of life and happiness. Check out his book as well. Thanks again Mark!\"<br></em></p><p><em><strong>- Steve Mcknoff</strong></em></p><p><strong>__________________________________________________________________________</strong></p><p><strong><br></strong></p><p><strong>What You Will Learn:</strong></p><ul><li>Why People Struggle with Motivation &amp; How to Avoid Those Same Mistakes</li><li>How to create crystal clear goals so you are more likely to achieve them</li><li>How to create and achieve goals that align with your core values</li><li>How to Avoid Reaching Goals but Remaining Unfulfilled</li><li>How to Erase Limiting Beliefs &amp; Procrastination</li><li>Identify goals for each area of life (each area depends on the others)</li><li>Discover the Secrets to Taking Massive Action Toward Your Goals</li><li>Discover WHY setting clear goals is crucial to their achievement</li><li>Discover the 'Why' Behind Your Goals to Build Powerful &amp; Lasting Motivation</li><li>How to Instantly get motivated with my simple technique</li><li>Find out why top athletes and millionaires/billionaires use these techniques to stay motivated and continue to reach higher levels of success</li><li>Discover the Real Secret to Fast and Lasting Motivation</li><li>Uncover the Skills, Habits and Behaviors You Would Need to Achieve Your Goals in Life</li><li>How to Build Rapid Momentum &amp; Steady Motivation to Achieve Your Goals</li><li>How to Easily Build Confidence to Achieve Your Goals</li><li>Find out What Changes You Would Need to Make to Reach Your Goals</li><li>Find out What Is Stopping You from Achieving Your Goals</li><li>Learn How Your Beliefs Control Your Destiny</li><li>Discover the Biggest Problem with Overcoming Limiting Beliefs/Roadblocks and How to Avoid It</li><li>Discover the Hidden Truth About Your Fears and Self-Doubts</li><li>Discover Why You Haven't Already Achieved Your Goals</li><li>Identify Your Limiting Beliefs and Mental Blocks</li><li>How You Can Control Your Negative/Limiting Beliefs</li><li>How to Focus for Instant Motivation and Productivity</li><li>Learn the Key to Maintaining Focus on Your Goals</li><li>How to Effectively Schedule Your Day</li><li>How to Avoid Distractions</li><li>Find out Why People Don't Stay Motivated for Long Term Goals</li><li>How to Easily Build the Habit of Success</li><li>How to Train Yourself to Be Successful</li><li>How to Build up Your Confidence for Goal Achievement</li><li>A Simple Tool That Will Help You to Become More Effective and Productive</li></ul><p><strong>Why You Should Take This Course:</strong></p><ol><li>Overcome Procrastination</li><li>Get Instant Motivation</li><li>Ensure That You Live a Fulfilling Life</li><li>Avoid Self-Sabotage and Limiting Beliefs</li><li>Set &amp; Achieve Goals Properly</li><li>Greater Self-Confidence</li><li>Overcome Your Fears and Self-Doubts</li><li>Greater Control Over Your Emotions &amp; Thoughts</li><li>Become More Productive</li><li>Establish Success Habits</li><li>Increased Short-Term &amp; Long-Term Motivation</li><li>Greater Clarity on What You Want Your Life to Look Like</li><li>More Mental Discipline</li><li>Design Your Own Lifestyle/Dream Life</li><li>Avoid Common Motivation Mistakes</li><li>Better Organizational  and Productivity Skills</li><li>Learn to Think and Act like the Top Performers</li></ol><p><strong>Why Learn From Me:</strong></p><ul><li>I've used the same process in my life to create amazing results and a 7-figure income with the same tools I am teaching here.</li><li>My instruction is simple, straight forward and provides practical ways to get started immediately.</li><li>I am endorsed Top Thought Leaders in the Personal Development industry (ex. Brian Tracy, John Assaraf, Peter Voogd etc.)</li><li>I only provide PURE value and don't use any fillers in my products.  I want to shorten the gap on learning and only give you ONLY the Gold Nuggets.</li></ul><p><strong>My Guarantee</strong></p><p>As well as the Udemy 30 day guarantee, <strong>you have my personal promise</strong> that you will be wowed and delighted by what you'll learn in the next 1-2 hours. I am so happy with the course, so confident you will like it, that you can take it for the full 30 days.  You can study it, put everything into operation.  If you aren't 100% happy, I am more than happy to refund you.<br></p><p><strong>I'm confident you'll benefit from this course. Go ahead, order The Success Series right now, you’re going to absolutely love it, and if you don’t love it, <strong>you don’t pay a dime.</strong></strong></p><p><strong>You have nothing to lose and everything to gain.</strong></p><p><strong>Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Stop Procrastination & Get Motivated! Create Your Dream Life", 
    "price": "45.00", 
    "instructors": "Mark Lack", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284074_90ef_7.jpg", 
    "course_url": "https://www.udemy.com/ultimate-guide-to-create-your-dream-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-19T23:14:13Z"
}