{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          I&#039;ll put it to you as mildly as I can, you playing it small, not doing anything you have always wanted to do, running around with every excuse on the planet for not achieving anything in your life, does not suit you, or any one in your life or in this world.  </p>  <p style=\"\">  \t  The sooner more people realize this, the less people will live in poverty. You have such an amazing power in you, to make use of it and start being what you are capable of being, you need to start with your mindset. That is what this course is all about.  </p>  <p style=\"\">  \t  This course is here to teach you how to stop procrastinating and help you reach those goals you are constantly setting and help you to achieve success you have always wanted.  </p>  <p style=\"\">  \t           Most of us always have some projects we can&#039;t quite finish. It all comes down to good enough reasons for you to jump in and finish those tasks you usually put to the side. That is what this training is all about.  </p>  <p style=\"\">  \t                We start with the all important mindset lessons to get you &quot;in the right place&quot; to move forward. I started off with the negative mindset so that you can understand how it influence your life and the decisions you make. Once we established the right mindset,  we move on to the next step, setting the right kind of goals and working towards them with the right kind of system.  </p>  <p style=\"\">  \t                It’s  the system that makes all those “other systems” work. This is  an inspirational, fun (and practical) system that will show you how to get  off the blocks when you&#039;re feeling your weakest, your slowest, your  worst and get things done faster, stronger, and better once you&#039;re at  full speed.  </p>  <p style=\"\">  \t                I stay away from fluff, steer clear of cliches,  and give you a guide that you can dig into and work on starting today.  </p>  <p style=\"\">  \t                From there we will  go on learning how to do it faster and manage your valuable time better, so that you can get more done in a shorter space in time. To round it all off nicely we will learn how to shut off distractions, how important it is to take time off and some activities you can do to get the most out of it.  </p>", 
    "end_date": null, 
    "title": "Stop Making Excuses And Start Taking Action In Simple Steps", 
    "price": "30.00", 
    "instructors": "Ben Oberholzer", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/198630_405f_5.jpg", 
    "course_url": "https://www.udemy.com/the-action-takers-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-14T09:12:59Z"
}