{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Learn not just how to understand why you’ve been spinning your wheels, but what you need to <em>do </em>(and how to do it!) so you can build the life you want to live.</p>\n<p><strong>Master the Strategies That Will Set You Free</strong></p><ul><li>Identify which are the <em>wrong</em> goals</li><li>Create your larger Vision so that you know what you want to do <em>and </em>who you are yearning to be</li><li>Develop and implement a strategic plan of action to get you from where you are to where you want to go</li></ul>\n<p><strong><br></strong></p><p><strong>A Powerful Blend of Theory and Practice</strong></p><p>The personal development industry has exploded over the past several years. People are no longer satisfied with “just getting by” and want more out of life. Unfortunately, all too often, the so-called solutions are merely feel-good fluff or lists of things to do without any strategic depth that will help you to create real change in your actual life.</p><p>This course takes over three decades of psychological study that give you a solid understanding of why you feel stuck, and combines it with hands-on, practical exercises and strategies so you can start really moving forward.</p>\n<p><strong>Content and overview</strong></p><p>The comprehensive nature of the program approaches the problem of how to create lasting change from a multitude of angles. The vast majority of the lectures include video presentations of the material, each one focusing on a different aspect of why, what, and/or how to make a specific shift in your life. The Resources section is full of worksheets, examples, and links to additional information to help you implement what you learn in real-life situations.</p><p>After a general overview, you’re going to learn how to identify and release those dreams and goals that you’ve picked up along the way but aren’t really yours to pursue. After all, what is the point of working really hard if it doesn’t take you where you want to go?</p><p>Next, you will develop your own larger Vision, a deeper sense of the type of life you desire which will act as your guidance when deciding your best next actions.</p><p>Once you know where you want to go, you’ll then learn how to set up a robust and solid, yet flexible plan of action that will get you moving in the right direction.</p>Finally, you’ll learn several different techniques to help evolve your skills, keep you on track, and continuously deepen your experience and satisfaction with your life. The final lecture shows how you can utilize what you’ve learned by combining the various strategies to synergistically support each other and create the life of your dreams.", 
    "end_date": null, 
    "title": "Stop the Struggle and Soar", 
    "price": "20.00", 
    "instructors": "Rachel S. Heslin", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500386_45b2_3.jpg", 
    "course_url": "https://www.udemy.com/do-the-right-thing/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T20:26:20Z"
}