{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><strong>Top Udemy Instructors with a combined Student base of 12,000, 12 Courses and over 450 Five Star Reviews</strong></li><li><strong></strong><strong>Course Launched October '15</strong></li></ul><p><em>They say\nyou're the average of the first 10 people you surround yourself with. What if,\nduring the past year,   when talking\nabout those 10 friends you could say that:</em></p><p>-4\nmembers from the close group have <strong>launched Udemy businesses with one achieving\n6-figures per year</strong></p><p>-Another\nmember <strong>quit their corporate career to launch an successful online business</strong></p><p>-And\noutside of business, <strong>2 members quit smoking</strong> and we've had <strong>d</strong><strong>ozens of\nconversations</strong>, some serious and some fun over a few drinks, that have taken us\nto new heights mentally that cannot be quantified.</p><p>These are\njust a few of the results that our Mastermind Group has had over the past year.</p><p><strong>The Concept</strong></p><p>A\n'Mastermind' is a term created by Napoleon Hill upon analysing what hundreds of\nsuccessful people had in common and realising that they all had specialists\nbehind them which elevated their performance to the next level. It's comprised\nof a bunch of individuals who share the same values, objectives &amp; vision\nand who work together in order for each to progress and reach their\naspirations.</p><p><strong>What about this course?</strong></p><p>Having\nexisted for over 3 years and throughout 5 events, this Mastermind Group has\nseen a lot of different situations. We'll take you from A to Z on how to create\nyour very own Mastermind. It doesn't necessarily have to be business related -\nit can be about anything (relationships, hobbies, sports) as long as you all\nshare the same values &amp; core objectives.</p><p>Find out\nexactly how to:</p><ul>\n <li>Create &amp; organise the\n     Mastermind Group including how to add new members, deal with passive ones,\n     communicate, set goals, find accountability buddies &amp; much more</li>\n <li>Prepare for the Mastermind\n     Event, generate excitement around it, plan the activities &amp; prepare\n     life-changing workshops that will provide every member with immense value</li>\n <li>Conduct the actual event\n     flawlessly, learn from your mistakes &amp; develop a better plan for the\n     following event</li>\n</ul><p>Many more\naspects are present, including the following bonuses:</p><ul>\n <li>Our mastermind email\n     templates to immediately kickstart your mastermind creation process</li>\n <li>Our mastermind schedule,\n     Excel &amp; PowerPoint templates so you can copy &amp; paste the structure\n     of our mind blowing events</li>\n <li>Case Studies about the impact\n     of our Group on our lives, Success stories and failures</li>\n</ul><p><strong>The Guarantee</strong></p><p>This\ncourse has a 30-day Money-back guarantee, but we're confident that you won't\neven consider it because of the tremendous value it offers. If you're not\nsatisfied with the content, I'll jump on a 30 minute Skype call with you to\nassess your Mastermind Group perspectives or give you advice on how to organise\nyour Group.</p><p><strong>Take Action!</strong></p><p>Being in\na successful &amp; engaging Mastermind has changed our lives for the better. We\ntruly hope this course inspires you to take action &amp; achieve your goals\nwith the help of your tight-knit community. If that sounds like you, then <strong>take this course now</strong> and join us in the virtual\nclassroom!</p>", 
    "end_date": null, 
    "title": "Success Blueprint: Transform Your Life Via Mastermind Groups", 
    "price": "50.00", 
    "instructors": "Dragos Stefanescu, Richard Korbut, Martin Georgiev, Samuel McCulloch, Tom Tarczy, Francisco Innecco", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/535530_fe53_3.jpg", 
    "course_url": "https://www.udemy.com/business-personal-success-101-powerful-mastermind-groups/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-23T21:13:13Z"
}