{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   Why is it that some people are able to achieve so much success - in their personal, professional, social lives - whereas so many others are struggling? For example, when two people commit to a goal - say, to go to the gym and lose weight, why does one of them manage to follow through, and the other one doesn’t?  </p>  <p style=\"\">  \t<strong style=\"\">What are successful people doing differently</strong> from the failures? How are successful people thinking differently from the failures? Are successful people wired differently from the rest of us? Is success simply encoded in their DNA? Or is it something else? And the more important question is: How can we get access to the magic ingredient that successful people have and add it to our own lives so that we too may experience more success in our lives?  </p>  <p style=\"\">  \t   This <strong style=\"\">short and practical guide</strong> will inspire you to rethink how you set and achieve your goals. In How Successful People Think Differently you will learn: <br style=\"\">  \t<br style=\"\">  \t   •Why successful people say “I don’t” instead of “I can’t” <br style=\"\">  \t<br style=\"\">  \t   •<strong style=\"\">Why successful people never suppress their desires - and what they do instead</strong><br style=\"\">  \t<br style=\"\">  \t   •How successful people think smart <br style=\"\">  \t<br style=\"\">  \t   •<strong style=\"\">The “if-then” strategy that triples your chances of achieving success <br style=\"\">  \t<br style=\"\">  \t   •The type of thinking that makes successful people successful in the first place</strong><br style=\"\">  \t<br style=\"\">  \t   •Why The Secret is setting you up for failure <br style=\"\">  \t<br style=\"\">  \t   •<strong style=\"\">The wrong (and the right) way to visualize your goals (this alone will be worth the price of the book!)</strong><br style=\"\">  \t<br style=\"\">  \t   •The right (and the wrong) type of thinking that either sets up you up for success or failure <br style=\"\">  \t<br style=\"\">  \t   •<strong style=\"\">Simple, and sometimes surprising, success principles to help you achieve your goals</strong><br style=\"\">  \t<br style=\"\">  \t   •And a lot more...  </p>  <p style=\"\">  \t   In the last 100 years, science has made remarkable progress in unlocking the secrets behind successful people. Science has uncovered just how successful people think differently and how successful people think smarter than the rest of us. <strong style=\"\">Unfortunately, a lot of this great, life-changing research is hidden inside dense, boring, hard-to read academic literature.</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Fortunately, I’ve gone through that research for you - and in this success course, you’re going to be getting access to life-changing tools and strategies that are scientifically-proven to help you achieve your personal and career goals, whatever they may be.  </p>  <p style=\"\">  \t   A lot has been written about goal setting, achievement and success. A lot of this advice sounds good but is not very useful, such as “Never give up. Think positive. Take risks”. <strong style=\"\">This short and fun course provides you with practical tools that you can use to change your thinking and change your life.</strong>  </p>  <p style=\"\">  \t   Learn the science of success, and apply the success principles in this program to set and achieve your own goals, whatever they may be. Some success principles will provide validation of what you already think to be true (but didn’t have proof for), whereas other principles will surprise. <br style=\"\">  \t<br style=\"\">  \t   Here’s the promise: All these principles are simple to apply, and if you apply them to your life, you will begin to experience more success in all areas of life. <br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">How do I know? <br style=\"\">  \t<br style=\"\">  \t   Because I have proof (inside!)</strong><br style=\"\">  \t<br style=\"\">  \t   Just one idea in this course might be the inspiration and the spark of change you are looking for...just one idea can change your life. <br style=\"\">  \t<br style=\"\">  \t   Now, does that sound good? <br style=\"\">  \t<br style=\"\">  \t   Then enroll in the course and let’s get started.  </p>", 
    "end_date": null, 
    "title": "SUCCESS: 9 Steps to Elite Performance", 
    "price": "20.00", 
    "instructors": "Akash Karia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241526_080d_3.jpg", 
    "course_url": "https://www.udemy.com/science-of-success-how-successful-people-think-differently/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-11T16:26:15Z"
}