{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Goals! Everyone talks about creating goals, but often these goals are impromptu New Years’ resolutions, empty promises, or simply good intentions without any thought or planning.</p>  <p>No more! In this hands-on and precise course, you’ll walk through the process of defining exactly what you want and then you’ll discover and document the exact work it will take to create the goal. This seminar clearly defines how to make goals an actuality in your life.</p>  <p>Take charge of your goals, take charge of your life, and get involved with this exciting course on achieving your goals. In this course you will:</p>  <ul><li>Complete your very first goal</li><li>Identify your heart’s desires</li><li>Manage successes and failures</li><li>Utilize the Japanese approach of Kaizen</li><li>Create and manage SMART goals</li><li>Build a Goal Breakdown Structure</li><li>Schedule the work to complete the goals</li><li>Maintain excitement and motivation for your goals</li><li>And much, much more…</li></ul>                  <p>Joseph Phillips has taught goal setting for people in the United States, Belgium, the Netherlands, France, Germany, and the United Kingdom. Thousands of people have completed his course on goal setting and made their lives better. You can too. This course includes:</p>  <ul><li>Lifetime access to take the course over and over</li><li>30-day money-back guarantee</li><li>A course handbook for notes</li><li>Exercise files and templates for goal management</li><li>Interaction with the Instructor, Joseph Phillips</li></ul>        <p>If you’re ready to quit procrastinating and ignoring your\ngoals, if you want to take immediate actions to improve your life, and if you’re\nwilling to do the hard work success requires, let’s get started right now in\nthis course. <br></p>", 
    "end_date": null, 
    "title": "Success: How to Set and Achieve Goals", 
    "price": "20.00", 
    "instructors": "Joseph Phillips", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698200_d24e_2.jpg", 
    "course_url": "https://www.udemy.com/goalsuccess/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T14:40:42Z"
}