{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><span style=\"\"></span></p><ul><li>Over <strong>3500 happy students</strong> enrolled in my courses</li><li>Currently <strong>103 out of 124 4- and 5-star reviews</strong></li><li>No risk involved. Watch the <strong>PREVIEW VIDEOS</strong>!</li></ul><p><br></p>\n\n<hr>\n\n<p><strong>Success is a <em>game</em> - a game with unique rules, laws, principles, and strategies.</strong></p>\n\n<p><u><em>This course teaches you how to win that game - in a <strong>VERY</strong> unique way...</em></u><em></em></p>\n\n<p><strong>Like a coach, I use simple graphics, hand-drawn images, and pictures</strong> to visually breakdown these rules, laws, principles, and strategies - to show you the mechanics of how they work - then when you fully and deeply grasp how they work, I teach you specific ways to use them to <u>play the game of success like a champion</u>!</p>\n\n<p><strong>I'm <u>sure</u> you're going to <em>love </em>this unique way of learning and growing into a more awesome human being.</strong></p>\n\n<hr>\n\n<p><strong>So...what makes this one of the best success courses you will ever take?</strong></p>\n\n<ul><li>My relentless focus on delivering high-quality content within the course</li><li>The high value of the ideas</li><li>The unique and engaging way lessons are presented</li><li>How practical and usable the ideas are that I teach you</li><li>The transformation you'll see in yourself</li><li>The transformation others will see in you</li></ul>\n\n<hr>\n\n<p><strong>This course is for you if you:</strong></p>\n\n<ul><li>Want to be to be a freakish force of success!</li><li>Have very little time to watch boring, complicated lessons because the kids need fed, the dog needs walked, and life just continues to happen</li><li>Tired of ideas that are really nothing more then weak, boring cliche's that are largely worthless nonsense ('be yourself', 'never walk away from fear', 'let it go', etc.)</li><li>Enjoy video training over book-learnin'</li><li>Want actionable, practical strategies and tools that you can use right now - today</li><li>Think visual explanations are the bomb!</li><li>Like having some fun while you learn</li></ul>\n\n<p>Scan the lessons below, and be sure to <strong>watch some of the many FREE preview videos</strong> to see for yourself that what I just said is true!</p>\n\n<hr>\n\n<p>After you're done watching the free preview videos (and your brain has adjusted to how awesome it feels), then follow these steps:</p>\n\n<ol><li>Join the course</li><li>Watch <em>all</em> the videos</li><li>Put what you learn into action</li><li>Come back and let me know what you think - if you like what you've learned, leave a lovely (that means nice) review, if not, get a lovely refund (you have a full 30 days to do this)</li></ol>\n\n<hr>\n\n<p>Be amazing!</p>\n\n<p>Derek</p>", 
    "end_date": null, 
    "title": "Success: How To Take Your Life From Good To Great To Amazing", 
    "price": "20.00", 
    "instructors": "Derek Franklin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633976_7f98_3.jpg", 
    "course_url": "https://www.udemy.com/success-school/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T19:44:11Z"
}