{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em>Over <strong>41</strong><strong>,500 people </strong>from <strong>179 countries </strong>enrolled in my courses</em></li><li><em>First <strong>Winner of Udemy's Innovation Award</strong> <strong>2015</strong></em></li><li><em><em><strong><em>Overall, 1100+ TOP </em><em>Reviews</em></strong></em></em></li></ul>\n\n<p><br>This is the first course I offer for free (for a limited time) Don’t miss out, start watching the videos right away and see why tens of thousands of students trusted in my content.<br></p>\n\n<p><br>Would you like to learn how to set and achieve exciting goals? Do you want to become more confident, boost your self esteem and get more things done? What about the ability to notice the positive side of things?</p>\n\n<p>Finally, would you like to learn how to climb your personal Everest?</p>\n\n<p>Welcome to this short course on strategies for success.</p>\n\n<p>It may sound a bit counter intuitive, but the truth is that success is predictable. You become your habits. How you think, what you do on every day basis and people you surround yourself with have a huge impact on your level of success. </p>\n\n<p>Many people look at the ones who made it and say: “that businessman was lucky, that model has good genetics, that investor is from a rich family”. The reality is that they are simply making excuses. Instead of working hard on their goals, they work harder on finding the reasons why they can’t be successful.</p>\n\n<p>However, there are certain things successful people do on every day basis that most people are simply not willing to do OR they have no idea that they should do them. Your life is ending one minute at a time and there is no point of reinventing the wheel. In this course you will learn proven strategies used by top performers and I will show you how you can implement them to climb your, personal Everest.<br></p>\n\n<p>I’m excited to have you onboard and let our journey begin.<br><br>- Jimmy<br><br></p>", 
    "end_date": null, 
    "title": "Success Tips: Boosting Confidence, Wealth & Productivity ", 
    "price": 0, 
    "instructors": "Jimmy Naraine", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/626202_e239.jpg", 
    "course_url": "https://www.udemy.com/strategies-for-success-habits-of-successful-people/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-29T19:40:46Z"
}