{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t Do you ever think how your life would be in 1 year?  </p>  <p>  \t Think of your life last year. What were you doing?  </p>  <p>  \t What were your goals?  </p>  <p>  \t Think really well and see what you wanted to do the last 12 months.  </p>  <p>  \t Now that you have a clear picture in your mind, ask yourself…  </p>  <p>  \t How many goals and dreams you saw through?  </p>  <p>  \t Most likely, not so many of them….  </p>  <p>  \t Why is that?  </p>  <p>  \t Because the things we WANT  </p>  <p>  \t And the things that we DO….  </p>  <p>  \t Are usually very different!  </p>  <p>  \t Most of us have really big and bold dreams. We want to reinvent ourselves, build ourselves from scratch from a physical, emotional, spiritual or relationship point of view. However, when we don’t have a plan or a system to help us see through these changes, then we fall back short.  </p>  <p>  \t Don’t worry….It happens to EVERYBODY! It’s part of being human!  </p>  <p>  \t However, what if I told you that you can bypass this condition?  </p>  <p>  \t What if it was possible for you to change the way you think and do things, right at the core?  </p>  <p>  \t Could you be, in 1 year’s time, the person who you want to be in the place where you want to be?  </p>  <p>  \t You could be:  </p>  <ul>  \t<p>  \t\t -Happier  \t</p>  \t<p>  \t\t -Healthier  \t</p>  \t<p>  \t\t -Stronger  \t</p>  \t<p>  \t\t -Full of confidence  \t</p>  \t<p>  \t\t -Richer  \t</p>  \t<p>  \t\t -More spiritual  \t</p>  \t<p>  \t\t -And anything you set your mind to!  \t</p>  </ul>  <p>  \t It’s time for a change, and that time is NOW!  </p>  <p>  \t Instead of daydreaming, wishing that your life would be better, that you would be better, start to make a permanent change for the better NOW! Turn yourself into what you want to be, the person what will turn heads on the street, in the family, anywhere!  </p>  <p>  \t Introducing….  </p>  <p>  \t <strong>Success Booster - Realize Your True Potential</strong>  </p>  <p>  \t 12 months to a completely new YOU!  </p>  <p>  \t Join the Success Booster program and get access to a success program that’s going to help you reach your true desires and make the changes that will help you find your true happiness and peace! Success Booster was designed on the true mantra that says “small changes have the biggest impact”.  </p>  <p>  \t Instead of making you fail by investing days and hours trying to turn yourself into somebody else, Success Booster shows you how small and calculated changes, that are easy to implement, will help you reach your goal over the course of 1 year!  </p>  <p>  \t This is an extremely easy to follow and fun program that you can easily make a part of your busy life!  </p>  <p>  \t All you need is a couple of minutes per day to make Success Booster work for you!  </p>  <p>  \t Here’s how the program works…  </p>  <p>  \t Over the 12 months, you will focus on improving one area of your life, one in each month. You will go through the following changes:  </p>  <p>  \t 1.Goals/Vision  </p>  <p>  \t 2.Motivation  </p>  <p>  \t 3.Accountability  </p>  <p>  \t 4.Persistence  </p>  <p>  \t 5.Facing Fear  </p>  <p>  \t 6.Acting As If  </p>  <p>  \t 7.Asking For Things  </p>  <p>  \t 8.Time Management  </p>  <p>  \t 9.Communication and Public Speaking  </p>  <p>  \t 10.Keeping Score  </p>  <p>  \t 11.Finances  </p>  <p>  \t 12.Giving Back  </p>  <p>  \t With Success Booster you will get:  </p>  <ul>  \t<p>  \t\t -An overview of the topic of improvement for that month  \t</p>  \t<p>  \t\t -A set of exercise  \t</p>  </ul>  <p>  \t When the 12 months come to an end…you’ll see that you have just improved the 12 areas of life that are vital for your LIFELONG success.  </p>  <p>  \t All that you need is to be consistent and invest a couple of minutes each day, in you!  </p>  <p>  \t Just imagine that in only 1 year EVERYTHING is going to be MUCH BETTER! All that you have to do is to take the first step, and join Success Booster! Let yourself change for the better and let yourself improve and find your true happiness and personal success.  </p>", 
    "end_date": null, 
    "title": "Success Booster", 
    "price": "30.00", 
    "instructors": "Earners Classroom", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/166250_5e73_2.jpg", 
    "course_url": "https://www.udemy.com/success-booster/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-18T03:17:13Z"
}