{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Anyone involved with others – at work or at home – who wants to tackle difficult behaviour more effectively will enjoy this course. It'll help you successfully settle those difficult interactions that just won’t resolve themselves. <br></p><p>With video demonstrations to support the lectures you'll quickly learn to handle apparently impossible situations where people just won’t co-operate: bosses, co-workers, customers, patients or members of the public who act in unpleasant, unpredictable ways.</p>\n\n<p>And it isn’t limited to the workplace; if you ever find yourself struggling in your personal relationships there's help here too.</p>\n\n\n\n\n\n\n\n\n\n<p>This course tells you how to identify seven common difficult characters, recognise clues to the patterns in their behaviour, and most importantly, how to understand how to prepare yourself, so that you become more effective more often in your relationships.</p>\n\n\n\n\n\n\n\n\n\n<p>This 90-minute course includes 12 video lectures. You'll also be provided with concise and clearly written downloads to help you practice some recommended exercises and enhance your skills. And there's a reading list if you want to take your study further.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How to complete the course</strong><br>The course contains 12 lectures; approximately 50 minutes of video, presented in bite-sized lectures. Reading time for the associated material is approximately 40 minutes. We recommend watching these several times to help you effortlessly absorb the information. We also recommend reflection breaks between each lecture; avoid 'cramming' and find a pace that suits you.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>This course will help you if:</strong></p>\n\n\n\n\n\n\n\n<ul><li>You have to deal with challenging behaviour in the course of your work, home life or socially</li><li>You work with one or more colleague whose behaviour you find unacceptable, obstructive or overly demanding</li><li>You find it difficult to get your point across in certain situations</li></ul>\n\n\n\n\n\n\n\n<ul><li>You are regularly in contact with someone who insults for, puts you down, or manipulates you</li></ul>\n\n\n\n\n\n\n\n<ul><li>You have a partner or ex-partner who persistently uses unfair behaviour to get their own way</li><li>You want to more confident in dealing with situations where someone else constantly tries to get the upper hand.</li></ul>\n\n\n\n\n\n\n\n<p>-------------------------<br></p>\n\n\n\n<p>Barry Winbolt MSc is a relationship consultant, mediator and writer. He has over 25 years experience providing training and advice in working relationships, communication skills and personal development.</p>\n\n\n\n\n\n<p>His highly engaging workshops are designed to be relevant to attendees and to deliver practical skills and techniques that can be applied immediately.</p>\n\n\n\n\n\n\n\n<p>The course looks at the most common kinds of difficult behaviour, and provides you with an essential toolkit for identifying and managing them effectively.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Tactics for tackling difficult people in life and work", 
    "price": "20.00", 
    "instructors": "Barry Winbolt and Skill Boosters", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/816354_ac35_2.jpg", 
    "course_url": "https://www.udemy.com/tackling-difficult-people-with-barry-winbolt-msc/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-08T12:59:31Z"
}