{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you worried about money? Does something or someone always seem to stand in your way when you get close to one of your goals? <br></p><p>Do you feel fearful? Stressed out? Anxious?<br></p><p>Are you feeling uneasy about your life or changes in your life?<br></p><p>Do you find yourself imagining negative scenarios and negative outcomes of what might happen if you take the risk to get what you want?<br></p><p>Do you lack self-confidence and confidence in the people you spend time with?<br></p><p>If you answered yes to any of the questions above, then your fear may very well be limiting you in your quest for true peace, happiness and fulfillment in your life. </p>\n\n<h4>So, how can you get what you want in life without being limited by fear?</h4>\n\n<p>This course will offer you the solution that you’ve been seeking.<br></p><p>Inside, you’ll find a valuable ebook full of specific action tips and tools to turn your fears into an unstoppable force for your success. Plus, a worksheet to guide you in self-awareness and reflection about your fears, as well as a checklist that will help keep you on track to take action each day to help you realize the life you desire and deserve. <br></p><p>If you can just take the time to study the materials and action tips, implement them and complete the worksheet and checklist, you’ll be on your way to creating the life you want.<br>As you follow the tips, techniques and strategies outlined for you in this course, you will be able to discover your fears, face them fearlessly and overcome them with grace.</p>", 
    "end_date": null, 
    "title": "Take Back Your Life: Narcissistic Abuse Recovery", 
    "price": "50.00", 
    "instructors": "Angela Atkinson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/802198_67e7_2.jpg", 
    "course_url": "https://www.udemy.com/take-back-your-life-narcissistic-abuse-recovery/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-23T20:03:07Z"
}