{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">The Tarot Course offers comprehensive, in-depth training in learning to read the Tarot. </strong>  </p>  <p style=\"\">  \t<strong style=\"\">The Tarot</strong> is a handbook to higher consciousness, a book of wisdom disguised as a pack of cards. The Tarot can be used to accelerate the process of Self-realization.  </p>  <p style=\"\">  \tIn the thirty seven years of studying and teaching, I have become a master Tarot teacher. I have been on the faculty of The New York Open Center for over 26 years, teaching Tarot and the Western Hermetic Tradition.  </p>  <p style=\"\">  \tThe Tarot is a river of knowledge into which the streams of Kabbalah, Alchemy, Astrology and Hermetic philosophy have flowed.  </p>  <p style=\"\">  \tThis miracle of life enables us to communicate with levels of consciousness not normally available to the everyday mind. Composed of a series of transformative images, the Tarot is primarily a method of divination rather than fortune telling. Divination means; &quot;to communicate with the Divine&quot;. In the Hermetic Tradition the Divine is within, it is our own Higher Self.  </p>  <p style=\"\">  \tThe Tarot turns your attention to the deeper meaning of things.  It can give you insight into any situation, especially, insight into one&#039;s self.   It will gladly show you, at any given moment, the lesson life is teaching you, the outcome of your choices, and how to come to your highest state of consciousness. Tarot allows you to use the circumstances of life as lessons along the path.  </p>  <p style=\"\">  \tA common misconception is the belief that one must be psychic to work with the cards. This is not true. However the converse is true, working with the cards will greatly develop your intuition.  </p>  <p style=\"\">  \tAlthough the Tarot is user friendly at all levels of development, knowledge of the correspondences to Kabbalah, Alchemy, Numerology, Astrology and Archetypal symbolism can give access to ever-deeper levels of meaning and use of the cards. This class will give the students a basis in all of these traditions.  </p>  <p style=\"\">  \tEnroll Now - I love to see you  </p>", 
    "end_date": null, 
    "title": "Tarot Course - Unlock Your Potential - Predict The Future", 
    "price": "20.00", 
    "instructors": "Helen Goldberg", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418954_b5c7.jpg", 
    "course_url": "https://www.udemy.com/tarot-course-unlock-your-potential-predict-the-future/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-11T03:51:22Z"
}