{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Estrategia Poderosa de la Programación Neurolingüística Circulo de Excelencia que te ayuda a construir confianza y seguridad en ti mismo. Con este curso vas a aprender el significado de las Anclas en la Programación Neurolingüística. Como hacer un Anclaje de manera sencilla. Puedes utilizar una experiencia positiva del pasado y anclarla para utilizarla cuando mas la necesites. Aprenderás a reforzar la técnica del Circulo de Excelencia para tu beneficio. Vas a aprender también la fabulosa técnica de la PNL que es Apilar las anclas, que es muy conveniente y muy práctico para cualquier proceso, en el que quieras estar en un mejor estado como por ejemplo con mas confianza. Por supuesto vas a saber como interrumpir o romper el estado para mantener las anclas para cuando las necesites. Podrás alcanzar objetivos ya que con esta técnica vas a generar confianza y seguridad en ti mismo. </p><p>El Circulo de Excelencia, puede ayudarte a que accedas a tus recursos internos y los utilices al máximo. Por supuesto y lo mas importante vas a aprender a realizar el circulo de excelencia paso a paso y lo vas a poder realizar todas las veces que quieras. Sigue detenidamente los pasos que te van a ayudar a crear El Circulo de Excelencia los encuentras en la clase numero 10. Te deseo mucho éxito en este curso de la Técnica Poderosa de la Programación Neurolingüística Circulo de Excelencia.</p>", 
    "end_date": null, 
    "title": "Tecnica Poderosa De La PNL Circulo De Excelencia", 
    "price": "20.00", 
    "instructors": "Mayra Barroso", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/682000_c0a2_5.jpg", 
    "course_url": "https://www.udemy.com/tecnica-poderosa-de-la-pnl-circulo-de-excelencia/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-27T01:31:57Z"
}