{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><p style=\"\">In the <strong style=\"\">Thawing Your Inner Family of  Self</strong> program I&#039;ve blended the most useful and effective techniques I  have learned in my almost 30 years of clinical experience. This multi-media  course has a dual purpose:</p>    <p style=\"\">1. It is designed for those who want to  overcome Family of Origin Issues such as  growing up in a less-than-nurturing family such as abandonment issues,  codependency, PTSD, dysfunctional relationships, low self-esteem, chronic  depression, etc.</p>    <p style=\"\">2. It is designed to teach other counselors  and coaches these very powerful and effective techniques for helping their  clients too. The program is also a great compliment to any helping process by  providing structure and tools for use with clients. </p>    <p style=\"\">I combined the classics with some of the  newest, most powerful personal transformation technologies available today to  create this interactive process for Overcoming  Childhood Trauma, personal healing and development. These include  Gestalt psychology, Ego-State therapy, Inner Family Systems Therapy, Precision  Cognitive-Behavioral Therapy, Transactional Analysis, Inner Child work, Parts  Integration, Hypnosis, Neuro-Linguistic Programming, Schema Therapy, and many  other models. This, of course, includes at the very core my own Iceberg Model.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Thawing the Inner Family of Self", 
    "price": "40.00", 
    "instructors": "Don  Carter, MSW, LCSW", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22858_ec7b_5.jpg", 
    "course_url": "https://www.udemy.com/tifs-program/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-14T13:39:18Z"
}