{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Imagine your future. Are you happy? Healthy? Are you doing work you enjoy? Do you have great relationships? Do you know yourself? Love yourself?</strong></p>\n\n<p>That’s the future we all want. That’s the future we all head for. But how do we get there? How do we plan for that future and actually create it? How do we have all those things not only in the future but right now as well.</p>\n\n\n\n<p>We aren’t taught in school how to create and maintain self-esteem and self worth. We aren’t taught how to build and maintain great relationships. We aren’t taught how to learn or how to find our strengths and passions. We are taught the true power of self-awareness and self-reflection.</p>\n\n\n\n<p>Instead so many of us spend our early adulthood stressed out about who we are, what we want, what to do next, how to be happy. Instead we struggle, and hopefully learn those things, but some of us never learn those lessons and continue to struggle. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Too many people continue to struggle. </strong></p>\n\n<ul><li>60-90% of visits to the doctor are due to stress. </li><li>4 out of 10 are struggling to figure out their life purpose. </li></ul>\n\n<p>I’m sure both these stats are light.</p>\n\n\n\n<p>But you don’t have to be one of those people. And the earlier you learn these lessons the better. I designed this class to be geared towards students, because I know that I wish I had learned these lessons when I was in school. It’s never too late to start over, but it’s also never too early to learn the skills and tools you’ll need so you don’t need to be one of the stats above.</p>\n\n\n\n<p>So let’s get started!? Take this class if you want:</p>\n\n\n\n<ul><li>Find your passion and inspiration, and gain the confidence to follow that path and bring it into your life.</li><li>Awaken your self-awareness - that will lead to knowing yourself, loving yourself, and creating great relationships.</li><li>Build a foundation for a lifelong healthy stress-less life.</li><li>Learn faster and more powerfully.</li><li>Put your life on happiness trajectory.</li><li>To be cut above the rest.</li></ul>\n\n<p><strong class=\"redactor-inline-converted\">My goal with this course is to empower you to become unstoppable. Fully load yourself with the skills and knowledge you likely won’t get while in school but are essential to seeing, planning and creating a future filled with passion, purpose, vitality and happiness.</strong><br></p>\n\n\n\n<p>PS. I’m here with you every step of the way. Actively participating in the chat room.</p>\n\n\n\n<p>See you on the other side!<br>-Laura</p>", 
    "end_date": null, 
    "title": "The Resilience, Joy, and Power Mindset", 
    "price": "25.00", 
    "instructors": "Laura Boysen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/815838_f5e5_2.jpg", 
    "course_url": "https://www.udemy.com/be-unstoppable/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-07T21:06:16Z"
}