{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Become one of the leading experts in mastering the most powerful Universal Law i.e. THE LAW OF ATTRACTION and LEARN TO MANIFEST YOUR EVERY DESIRE using the same law with this amazing yet simple, practical and easy to follow course and change the rest of your Life for Better. </em></strong><strong><em>This course can definitely help you to go from where you are right now to where you want to be!</em></strong></p><p><strong><em></em></strong><em><strong>What people are saying about this course?</strong></em></p><p><strong>Law of attraction in Action</strong></p><p><strong></strong>First of all I should say that this course is absolutely simple and easy to follow. Its very detailed yet with no unnecessary stuff. The templates have been very useful and the Mindset-Skill set-Tool set strategy is amazing. Excellent work! <strong>- Ravi  Kumar G</strong></p><p><strong>Manifest Your every Desire using LoA</strong><br></p><p>Yes, this course delivers exactly what it says! This has been life changing for me and i did not move an inch till i finished the course completely. The action steps are very helpful and that's one of the plus points of this course. Highly recommended course. <strong>- Catherine</strong></p><p><strong><br></strong></p><p>  \t<strong><em>~ Your thoughts create your reality.</em></strong>  </p>  <p>  \t              You can achieve any desire in your mind if you learn how to focus your thoughts. Hi, I am Sneha, founder of thePowerMonk. I have spent several years testing several techniques and laws to help you to unleash the ultimate awesomeness in you.  </p>  <p>  \t              This course is for anyone looking to achieve every desire on their mind and is open to applying a powerful universal law called as the LAW OF ATTRACTION. Whether or not you know what the LoA is, this course will teach you exactly how to take charge of your reality. You will learn -  </p>  <p>  \t              1. The essence of the law and how it really works  </p>  <p>  \t              2. A tried and tested to make the law work in your favor every single time YOU want.  </p>  <p>  \t<strong>Why should you take this course?</strong>  </p>  <p>  \t              There are easy hacks to make the law work in your favor, but the harsh truth is that whether or not you use these hacks, the LoA is always at work. So learning a few tricks to apply it as and when needed is not correct. You need to change yourself from within so that you can consciously make the Law of Attraction work for you unfailingly every second of your life. This course is not about quick fixes but is about a solid psychological system where in you permanently align yourself with the LoA -  </p>  <p>  \t              Step 1. Changing your MINDSET  </p>  <p>  \t              Step 2. Developing the SKILLSET  </p>  <p>  \t              Step 3. Acquiring the TOOLSET.  </p>  <p>  \t<strong>What kind of material is included in this course?</strong>  </p>  <ul>  \t<li>Video lectures</li>  \t<li>Pictorial representation and demonstration to reinforce the concept</li>  \t<li>Action items with downloadable templates</li>  \t<li>Fully transcribed lectures as downloadable documents</li>  </ul>  <p>  \t              After a year of intense research and a lot of trials and testing I am here to teach you the true essence of the law of attraction and the most efficient strategy to make it work. Take this course and you can skip the trial and error phase, shoot for the stars and make a sure landing!  </p>  <p>  \t              Good luck!  </p>", 
    "end_date": null, 
    "title": "The Law of Attraction - Learn to Manifest your EVERY Desire!", 
    "price": "20.00", 
    "instructors": "Sneha Reddy", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/258774_4695_10.jpg", 
    "course_url": "https://www.udemy.com/learn-to-manifest-your-every-desire-using-law-of-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T05:00:05Z"
}