{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p><p><strong>What is the #1 obstacle that holds us back from living out who we really are?</strong>  <strong><u>Trade-Offs!</u></strong></p>  <p>They are something we give or take in exchange for something we think we want or trading something in order to please others to gain more love and acceptance. </p>  <p>The main problem with trade-offs is that they take our attention off of what we really want as the outcome of our life - our intentional legacy. And that, leads to regrets. </p>  <p>Most pre-retiree programs only focus on the financial part of retirement - the last step of the process. To fill that gap, we are offering practical tools and techniques like this course to smooth out the path that will lead to realizing the Rest of Your Amazing Life.</p>  <p><strong>This program was written exactly for you if:</strong></p>  <ul><li>You wake up in      the middle of the night with the realization you are living a life      according to others' expectations.</li><li>You are painfully aware that something is terribly off      and you don’t know why.</li><li>You are sick and tired of longing for better health,      happiness and purpose and wish to live life moving toward who you really      are.</li></ul>  <p><strong>In this course, you will discover:</strong></p>  <ul><li>Why the impact      of your life matters.</li><li>The legacy you wish to leave the world.</li><li>The 3 different kinds of trade-offs, how to identify      which ones you practice and why.</li></ul>  <p><strong>The most important things you will leave with are:</strong></p><ul><li>Practical tools      and techniques you can use immediately to help rebalance trade-offs to      become the person who truly has much to give!</li><li>Guided exercises to help you consciously make decisions      that support your calling!</li><li>New concepts that will lead to relief of stress and      pain through awareness and action.</li></ul><strong></strong>", 
    "end_date": null, 
    "title": "The Trade-Off Trap: Breaking through to the life you love!", 
    "price": "50.00", 
    "instructors": "Ellen Mann, Life Coach mentor/transitioning Tina Baker", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/777906_47cc_3.jpg", 
    "course_url": "https://www.udemy.com/the-trade-off-trap/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-29T16:38:00Z"
}