{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The latest and most current scientific discoveries in the areas of human Evolution, Quantum Physics and Astronomy come together in this course about how and WHY the universe was created the way it is - basically a giant machine to create life and get feedback from all forms of life everywhere.</p><p><br><strong class=\"redactor-inline-converted\">The four states of consciousness are:</strong></p>\n\n<ol><li><strong class=\"redactor-inline-converted\">The Electronic </strong> - It all starts with the electron.  </li><li><strong class=\"redactor-inline-converted\">The Rotational </strong>- Electrons band together to create molecules.</li><li><strong class=\"redactor-inline-converted\">The Vibrational </strong>- Molecules in turn communicate to create US.</li><li><strong>The FeedBack Loop</strong> - Essentially all life in the universe including you and me.</li></ol>\n\n<p>As the 4th and highest state of consciousness, we are invented in order to provide the Creator with information about how he or she is doing.  As we give back this information to the universe, the Creator responds with higher and better challenges for us to overcome.  Each challenge feedback increases the energy state of the universe and lowers our own - but as part of the feedback loop, eventually all of the energy we fed into the universe is given back to us with dividends and our lives improve greatly as our energy state is raised by an equal or higher amount to that which we emitted.  It's really that simple.  </p><p>The greatest lesson you will learn from this course is that you must not ever overthink Consciousness.</p>\n\n<p>It's really that simple.</p><p>The information contained herein is easy to understand and will inspire anyone who wants to do better things or gain more insight concerning their allotted time on this planet.  <br></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "The 4 States of Consciousness", 
    "price": "20.00", 
    "instructors": "Michael Mathiesen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828434_fbd9_3.jpg", 
    "course_url": "https://www.udemy.com/4statesofconsciousness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T19:13:10Z"
}