{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Do you want to create more abundance and prosperity in your thinking, and in your bank account without compromising your values?  </p>  <p style=\"\">  \t    In this rich 90 minute course, Feng Shui Practitioner  Nicolette Vajtay interviews Feng Shui Practitioner Mia Staysko with White Lotus Interiors, sharing Feng Shui Tips to Fatten Your Wallet!  </p>  <p style=\"\">  \t        Abundance isn&#039;t just about money... it&#039;s how you think about money.  Once you know what you believe about money, and can rid yourself of what society and the media tell you what you SHOULD have, then you can begin to truly prosper.  Marry your new thinking with the practice of Feng Shui, and you have a magic plan to create a thriving life!  </p>  <p style=\"\">  \t        You&#039;ll learn about the primary tool needed to start your own Feng Shui analysis of your home:  The BaGua.  You&#039;ll learn how to stretch the BaGua over your floorplan, how to locate the Wealth corner in your home, the elements that help create more positive energy in your space, and about the other areas in your home that affect your ability to create wealth in your life.  </p>  <p style=\"\">  \t        You&#039;ll find short videos (around 5 minutes each) filled with content rich conversation and dynamic cures!  Take this class on your own schedule, ten minutes during your lunch break, after the kids are in bed, or spend an hour and a half with us and start implementing the Feng Shui cures right away!  </p>  <p style=\"\">  \t        This class is for everyone!  We hope you will take this information and RUN with it to create the abundant life you so desire!  </p>", 
    "end_date": null, 
    "title": "The Wealthy Buddha:  Feng Shui Tips to Fatten Your Wallet", 
    "price": "35.00", 
    "instructors": "Nicolette Vajtay, Mia Staysko", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/392244_ab9c_3.jpg", 
    "course_url": "https://www.udemy.com/the-wealthy-buddha-feng-shui-tips-to-fatten-your-wallet/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-12T17:33:39Z"
}