{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em style=\"\"><strong style=\"\">The Lunatic Gene</strong> - The cause of the voice in your head that either talks you out of success because of the limitations that others put upon you, or propels you towards success despite of this. And yes, you have it too!</em>  </p>  <p>  \t<strong style=\"\">This course is a light-hearted look at some hard hitting subjects, including the meaning of your life, the causes of your unhappiness and a route-map to your inner sanity, acceptance and happiness. This aspect of The Lunatic Gene simply covers the cause of the negative aspects of how it manifests. This course offers you simple and practical exercises to both increase your knowledge of how your Lunatic Gene manifests, and gives you easy to do exercises to help you stop fighting and start dancing with yours.</strong>  </p>  <p>  \t                If you have ever experience a mid-life crisis, sleeplessness, depression, pain, suffering, family crises, are working in a job you hate, living with a spouse that you have fallen out of love with and are feeling stuck, or feel low or depressed, you have advanced symptoms of the negative aspect of The Lunatic Gene.  </p>  <p>  \t<strong style=\"\"><em style=\"\">Warning: This course is highly controversial and may bring up things you are not ready to face at the moment. Despite the title, it is recommended that you only proceed if you are of sound mind and open to hard-hitting challenges. Everybody has a Lunatic Gene. This book explores your relationship with it, with practical steps for you to discover how you can stop fighting your Lunatic Gene, and start dancing with it.</em></strong>  </p>  <p>  \t                The Lunatic Gene - The Reason Your Life Will Never Make Sense, is a journey into the world of what makes people do seemingly crazy things, offering you a template of the early warning symptoms which, if unaddressed, will lead you to an early grave. It also explores how you can reduce guilt and judgement in your life.  </p>  <p>  \t                Based on the experience of Adam Shaw, The Heart Guy, who has spent over 20 years as a Wellbeing professional, including 13 years as a nurse, and growing up within the grounds of a psychiatric hospital for 17 years, where his parents worked and lived. He has worked with thousands of people with wellbeing challenges and serves up a very alternative view on health and wellness. More recently, he has worked in the business funding arena, helping CEO&#039;s and Entrepreneurs to improve their resilience, team dynamics and pitch better to attract funding into their businesses.  </p>  <p>  \t                Of specific importance is his work with people who only had weeks, days, and even hours to live. The regrets expressed by people in this state had common themes, which if they had been addressed earlier in life would have led to a happier and more purposeful life.  </p>  <p>  \t                He highlights the regrets and mistakes that consistently come up for people at the end of their lives and offers you easy steps of how you can avoid this by implementing some very simple steps, and improving your relationship with yourself.  </p>  <p>  \t                This will explore:  </p>  <ul style=\"\">  \t<li>What is the purpose of your life? </li>  \t<li>Are you happy?</li>  \t<li>What makes you happy? </li>  \t<li>Are you spending enough time with people you like?</li>  \t<li>Are you doing things that can easily improve your life?</li>  \t<li>What causes lunacy?</li>  \t<li>Is the world a lunatic asylum?</li>  \t<li>Is your phone set to drain your energy?</li>  </ul>  <p>  \t                Please also note that the improvements to your life suggested on this course do not necessitate you giving up anything completely. It will suggest that you use your perceived &#039;bad&#039; habits are used to trigger good ones, thus adding balance to your life.  </p>  <p>  \t                At the end you will be invited to join a community to help you implement the suggestions in this course and meet people on a similar journey.  </p>  <p>  \t                Welcome to a voyage of discovery into Your Lunatic Gene!  </p>", 
    "end_date": null, 
    "title": "The Lunatic Gene. The Reason Your Life Will Never Make Sense", 
    "price": "20.00", 
    "instructors": "Adam Shaw", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/294632_a61c_3.jpg", 
    "course_url": "https://www.udemy.com/the-lunatic-gene-the-reason-your-life-will-never-make-sense/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-05T13:36:25Z"
}