{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is designed for women who have serious badass potential.  Over the course of a few weeks and through the completion of periodic missions, Olive and Minna - communication coaches based in NYC - will guide you through the ABC's of cultivating confidence. </p>We use theoretical and technical approaches. We review concepts of communication from a sociological perspective and address the conditioning that has disempowered too many women. We offer strategies and assign missions to improve your body language, inner dialogue, and overall presence.  We will explore the body, posture, breath, and the voice - guiding you through self-inquiry and investigation of body language, tone, gaze, and vocal presence. You will have a holistic, 360 degree, inside-and-out understanding of what's holding you back and how to move beyond that fear to become the fullest expression of your badass self<p>What is a badass?  We will go into detail in the course, but briefly it is the woman who owns her value, demonstrates her value, and gains respect from those around her through action, intention, and communication.  She can be delicate, generous, playful, passionate, steadfast. She is <u>confident</u>. </p><p> Are you these things? Do you give yourself permission to display these qualities? Does fear or conditioning inhibit your authentic expression of self? If the answer is yes, then this course is for you.<br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "The Confidence Advantage: Becoming a More  Powerful Woman", 
    "price": "20.00", 
    "instructors": "Olive Persimmon, Minna Taylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/707328_aca3_3.jpg", 
    "course_url": "https://www.udemy.com/confidence-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-27T01:02:49Z"
}