{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Who are you?</p><p>What do you want? </p><p>Why are you here?</p><p>If you cannot answer these questions then you need to take this course. Consider this the users guide to your life. In this course you will learn what you have been missing for your entire life. </p><p>Often times in our lives even when things are going pretty good, there seems to be something missing. We do our best to fill the hole with what we know we enjoy, but it just empties out again after just a little while. We all, at some point, feel incomplete, but we cannot pinpoint what it is that we are missing.</p><p>What we are missing is ourselves. We miss ourselves. What this means is that most of us are lost in a sea of masks that we must wear each and every day. We have lost touch with the one who is wearing the masks. We have lost touch with our true self. We have lost our purpose in life!</p><p>This course designed to unbury you and your purpose from all the debris and rubble which has piled up on top of you. This debris fell in the form of beliefs and opinions from your environment, and they trapped you under them until became them. YOU'RE NOT! </p><p>You are not anything other than what you choose to be, and in this course that is exactly what you will learn. </p><p>-To know who you are.</p><p>-To know what you want.</p><p>-To know why you are here.</p><p>-To know what to choose.</p><p>One of the best feelings in the world that you could ever experience is the feeling that you are making the right decisions, for you!</p><p>It is your choice, live the way others want you to, or live YOUR life the way you want!</p>", 
    "end_date": null, 
    "title": "The KEY to YOUR life - Conquer Yourself and Master Your LIFE", 
    "price": "20.00", 
    "instructors": "Jeremiah Nicolas Brackett", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467704_5f5c_3.jpg", 
    "course_url": "https://www.udemy.com/the-key-to-life-conquer-yourself-and-master-your-life/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T21:59:11Z"
}