{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t        “Life is not a journey to the grave with the intention of arriving safely in a pretty and well preserved body, but rather to skid in broadside, thoroughly used up, totally worn out, and loudly proclaiming: ‘Wow! What a ride!’”  </p>  <p>  \t        Robert Wickman  </p>  <p>  \t        How do you live life with passion, on your own terms? How do you get to the place where your days unfold in a way that creates excitement and energizes you? How do you get to the place where you are finally living your dreams, tackling goals and projects you always wanted to do?  </p>  <p>  \t        The <strong>Intentional Life Series</strong> will take you there. At the end of <strong>Chart Your Own Adventure</strong> (part one of this series), you will have six maps that each provide a unique perspective on who you are and where you are going. As you overlay these maps, they will reveal alternate paths open for exploration, aligned with your deepest motivations and desires.  </p>  <p>  \t        This course contains:  </p>  <ul>  \t<li>21 Lessons</li>  \t<li>Two and ½ hours of video</li>  \t<li>A dozen exercises</li>  \t<li>Handouts and infographics</li>  \t<li>A resource list</li>  \t<li>Not a single test! (other than having to face yourself in the mirror!)</li>  </ul>  <p>  \t        Don’t waste another day wondering if you are missing out, if life has more to offer, if you will ever be able to live on your own terms. If you are bold enough, that journey starts today.  </p>", 
    "end_date": null, 
    "title": "The Intentional Life Series: Charting Your Own Adventure", 
    "price": "25.00", 
    "instructors": "Greg Kittinger", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/310768_d2ef_4.jpg", 
    "course_url": "https://www.udemy.com/charting-your-own-adventure/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-30T13:41:03Z"
}