{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>The 12 Secret Laws of Attraction They Failed to Tell You</strong></p><p><strong>Finally, How to Get What You Want Using Creative Visualization</strong></p><p>Did you try the Law of Attraction? Did 30k fail to “manifest” into your bank account within 30 days?</p><p>What about the new house, the promotion or that shiny, expensive car?</p><p>Yes, the Law of attraction has probably failed for millions of other people around the world too.</p><p>I have conducted seminars in 5 different countries and have asked thousands of people if the Law of Attraction has worked for them. They all responded with a resounding “No!”</p><p>This feedback, coupled with my 27 years of experience of working these 12 Laws to my complete advantage has compelled me to put this course together.</p><p>The false information dished out about this science has destroyed too many dreams.</p><p>This course is put together based on those 27 years of experience and feedback I have gathered from thousands of people.</p><p>This course will teach you all you need to know about these 12 Secret Laws and how you can use them to get whatever you want in life too.</p><p>On this earth-shattering course you will discover</p><ul><li>How creative visualization works <i>scientifically</i></li><li>Why the <b><i>single </i></b>Law of Attraction has failed miserably for you</li><li>How the mind initially resists attracting what you want and how you can overcome it</li><li>How these 12 Laws will recondition your mind so your self-worth thermometer increases so you can naturally accept more abundance in your life</li></ul><p>You will also be exposed to all of these 12 laws that are proven to work like magic. You will also learn;</p><ul><li>Why, when you use creative visualization, you can quite often attract the <b>opposite to what you want</b> (This is your 'test')</li><li>Precisely when and how your 'Test' will appear and how to easily overcome it</li><li>How to open your mind to riches</li><li>How to attract boatloads of money into your life by Tithing</li><li>Why you must NOT display the popular dream boards in your home – EVER -Contrary to what other gurus tell you</li><li>Why attracting what you want requires you to raise your mind above the crowd (These 12 Laws help you do this automatically)</li><li>I also give you the very basics that a lot of other guru's have neglected to tell you such as;</li><li>How to actually sit and visualize</li><li>Why, how and where you must create a sacred place to visualize</li><li>Timings of when you can expect - and what to expect - regarding the results of your visualizations</li><li>Packed with real life examples this course can quite literally change your life for the better, forever.</li></ul><p>So if you have tried the law of attraction before and it failed dismally for you too, then this course gives you the inside knowledge of how to ensure you start attracting all that you want in life - right now.</p>", 
    "end_date": null, 
    "title": "The 12 Laws of Attraction", 
    "price": "20.00", 
    "instructors": "Rob Hamilton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576424_78e5.jpg", 
    "course_url": "https://www.udemy.com/the-12-secret-laws-of-attraction/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T10:21:24Z"
}