{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">&nbsp;&quot;Discover The Amazingly SIMPLE Prosperity Secrets Of EVERY Millionaire, And How You Can Easily Apply Them To YOUR Life...&quot;</em></strong><br style=\"\">  <br style=\"\">   Hello, this is Gary Vurnum.<br style=\"\">  <br style=\"\">   Basically... I&#039;ve discovered some secrets that I want to share with you RIGHT NOW!<br style=\"\">  <br style=\"\">   Do you want to know the #1 secret to finally creating a life of wealth and prosperity?<br style=\"\">  <br style=\"\">   Well...over the last 7 years I have devoted myself to learning everything I can about how to lead a prosperous life.<br style=\"\">  <br style=\"\">   I&#039;ve read books on prosperity and wealth accumulation. I&#039;ve read autobiographies of successful people from business, sport, movies, and every walk of life. I&#039;ve grilled many self-made multi-millionaires at seminars I have either spoken at or attended. I&#039;ve coached both successful people to greater heights, and helped many unsuccessful people make amazing changes to their lives.<br style=\"\">  <br style=\"\">   From all of this research, I discovered that EVERY single wealthy person had one major &#039;secret&#039; in common. Every one! (And no, it&#039;s NOT the Law of Attraction!)<br style=\"\">  <br style=\"\">   <strong style=\"\">Just imagine knowing the fundamental way of thinking of every successful person. Don&#039;t you think that might help you change what YOU do?</strong><br style=\"\">  <br style=\"\">   So, do you want to know what it is?<br style=\"\">  <br style=\"\">   And...more importantly, how you can immediately use it to change your life?<br style=\"\">  <br style=\"\">   Well...I&#039;ve only ever shared this with a total of 18 people before on an expensive 1-on-1 Program, but today I&#039;m going to share it with you!<br style=\"\">  <br style=\"\">   Here is the #1 secret that ALL successful people apply in their lives.<br style=\"\">  <br style=\"\">   One simple word says it all - EXPECTATION!<br style=\"\">  <br style=\"\">   You&#039;ve heard that you become what you think about...well, although this is completely true, it can be a recipe for failure - because more people are focusing on what they DON&#039;T want instead of what they DO!<br style=\"\">  <br style=\"\">   Millionaires become what they EXPECT to become!<br style=\"\">  <br style=\"\">   They don&#039;t spend their lives thinking about The Law Of Attraction...they just expect things to turn out the way they want to. Unsuccessful people believe they need to WORK with LOA but - because the harder you &#039;try&#039; the further away you get - as you&#039;re coming from a place of lack!<br style=\"\">  <br style=\"\">   Millionaires don&#039;t care about the Law of Attraction. They EXPECT success!<br style=\"\">  <br style=\"\">   There is one way to instantly know whether you are sabotaging yourself? <br style=\"\">  <br style=\"\">   Ask yourself &quot;WHAT AM I EXPECTING?&quot;<br style=\"\">  <br style=\"\">   Anyone can take action...but action in the WRONG direction can be worse for you than no action at all! Expect yourself to move forward - and then REACT to the opportunities and experiences that appear in your life!<br style=\"\">  <br style=\"\">   Rich people get richer because they don&#039;t spend their lives thinking about how to get more money because they don&#039;t NEED it! Most rich people could &#039;retire&#039; on their current net worth - but they still need something to do - so they focus instead on doing what they&#039;re good at....NOT MONEY!<br style=\"\">  <br style=\"\">   If you’ve heard of the phrase ‘money goes to money’ – then this is why!<br style=\"\">  <br style=\"\">  <strong style=\"\">OK...if you liked that secret, I actually have SIX more that I discovered during my detailed research of very wealthy people that I want to share with you in this course.</strong><br style=\"\">  <br style=\"\">   In it I lay out not only the six further secrets themselves, but also how you can IMMEDIATELY apply them in YOUR life!<br style=\"\">  <br style=\"\">  <em style=\"\"><strong style=\"\">Get immediate access to this course in which I walk you through the exact mindset that you need to have in order to lead a wealthy and prosperous life.</strong></em><br style=\"\">  <br style=\"\">   <em style=\"\">I look forward to sharing &quot;The 6 Simple Keys To Prosperity&quot; with you, and show you how you can use them to change your life in ways you could only imagine!</em><br style=\"\">  <br style=\"\">   See you inside.<br style=\"\">  <br style=\"\">   To Our Success!<br style=\"\">  <br style=\"\">   Gary Vurnum</p>  ", 
    "end_date": null, 
    "title": "The Six Simple Keys To Prosperity", 
    "price": "20.00", 
    "instructors": "Gary Vurnum", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/67276_a062_9.jpg", 
    "course_url": "https://www.udemy.com/prosperity/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-20T15:33:07Z"
}