{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Course Description</strong></p><p><em style=\"\">“The information in this course is golden. I have read Think and Grow Rich and the Science of Getting Rich, both books are priceless, but the <strong style=\"\"><strong style=\"\"></strong>Master Key System is simply mind-blowing</strong>. I never realized The Master Key System was the inspiration behind Think and Grow Rich and the movie and book <strong style=\"\">The Secret</strong>.”- Tim H.</em></p><p><em style=\"\">“The love how each part offers a quick-guide action step to immediately implement what I learned. I also think the Q &amp; A study questions are brilliant. It helped me to further understand what was taught in each part” – Karen Seymour</em></p><p>In a testimonial letter dated April 21, 1919 written by the great Napoleon Hill, author of Think and Grow Rich, stated: “my present success and the success which has followed my work… is due largely to the principles laid down in the Master-Key System.”</p><p>You will be able to read the entire testimonial letter from Napoleon Hill after you sign up for this course.</p><p>Until recently the Master Key System was largely unknown and almost lost to the ages of time. Fortunately, it regained popularity, due to no small part from its influence on Rhonda Byrne, the author of the book and the film <strong style=\"\">The Secret</strong>. In addition to the Science of Getting Rich, the Master Key System was one of the main sources of inspiration for Rhonda Byrne to create the movie and write the book.</p><p>In addition, the Master Key System was an inspiration to Bill Gate&#039;s and the success of Microsoft. It is believed Bill Gate&#039;s discovered the book while attending Harvard and after reading the Master Key System, he was so inspired he dropped out and started Microsoft.</p><p>When was the Master Key System first published? Charles Haanel first published the Master Key System in 1912 as a 24-week correspondence course. In 1916 it was then published in book form. </p><p>The Master Key System thoroughly describes and instructs the student how to fully implement the <strong style=\"\">“Law of Attraction”</strong> in their life. In addition, it teaches creative visualization, powerful and proven methods and techniques to maximize the benefits of concentration and the importance of truth and harmonious thinking. </p><p>When you start to use the Master Key System, you&#039;ll find yourself quickly and easily achieving your goals and awakening your talents and skills.</p><p>What you&#039;ll find in this course:</p><p>You&#039;ll find each section of this course contains an introduction, the main teaching part, followed by a section with questions and answers to reinforce your knowledge learned. Finally, each section offers a powerful action-step exercise that will teach you how to immediately implement what you learned. </p><p>The course consists of 24 parts. Part 1 deals with the relation between the world within and the world without. Part 2 deals with the two modes of mental activity. “How to awake the solar plexus and completely eliminate fear” is dealt with in Part 3. Among other things, Part 4 speaks of the development of faith and course, and Part 5 the Secret of Power and the Law of Attraction. </p><p>Parts 6 and 7 refer to concentration, visualization and materialization of ideals. The next three lessons contain splendid instructions in regard to the cultivation of the imagination, the secret of the solution to every problem, and a good sadhana demonstrating the law of abundance. </p><p>Others parts continue the useful instructions concerning the dynamic power of thought, of a mental harmony and efficiency, the mastery of fate or Karma, the law whereby the sadhaka may control other forms of intelligence, the elimination of sickness and the secret of mental therapeutics. </p><p>Part 23 is a solace to those who are ignorant of the practical nature of spirituality. The last part is a blessing to those who desire to master the marvelous secrets of the theory and practice of constructive thinking.</p><p>In summary, the Master Key System will unlock the secret behind the “Law of Attraction” and will give you the ability to fully utilize the natural laws of the universe for your benefit and the benefit of others. When you really think about it, it&#039;s that what you really want? </p><p>Get started today! </p>", 
    "end_date": null, 
    "title": "The Master Key System  - Unlock Wealth, Health and Happiness", 
    "price": "30.00", 
    "instructors": "Andy LaPointe", 
    "commitment": "17.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/536624_c61f_3.jpg", 
    "course_url": "https://www.udemy.com/the-master-key-system-unlock-wealth-health-and-happiness/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-24T22:08:08Z"
}