{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Take <em>Harry Potter</em>, <em>Spider Man</em>, <em>Kungfu Panda</em>, and whoever you want to - they have something in common.</p><p>What if I told you they are all the variants of a same <strong>H</strong><strong>ero.</strong></p><p><strong>Do you believe that?</strong></p><p><strong><em>Joseph Campbell</em> </strong>did. He studied myths from all over the world and  proposed Mankind's one greatest story called <strong>Mono-myth.</strong></p><p><strong>Why the same story has been told over and over again?</strong></p><p><strong></strong>To remind us some of the cosmic laws that always work and divert us from the fantasies of our luring conscious minds to achieve something impossible. </p><p><strong>Why do you need that?</strong></p><p><em>Life is a conflict</em>, we all need some strength to face it. Our course gives you exactly that, we just give you enough push to wake up your psyche to follow your bliss. </p><p>Having a mere knowledge of <strong>The Hero's Journey</strong> can unlock your own potential because the journey is all about us.</p><p><strong>Review of the Students </strong></p><ul><li><strong>Renee McGlothlin</strong></li></ul><p><strong>Great Introduction to The Hero's Journey</strong></p><p>This course is a very good introduction to, and explanation of, the 'mono-myth' of the Hero's Journey as first revealed by Joseph Campbell in 'Hero With A Thousand Faces'. I have been a Campbell fan for decades and still found this course helpful in further embracing his work. I highly recommend it. My only misgiving is that my American ear sometimes found the instructors accent difficult, to the point that I watched several of the videos more than once to fully comprehend him. But his grasp of the subject is very good indeed.</p>", 
    "end_date": null, 
    "title": "The Journey of a Hero - To Unlock Your Own Potential", 
    "price": 0, 
    "instructors": "Kamal Sucharan Burri Burri", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/506878_9d20.jpg", 
    "course_url": "https://www.udemy.com/the-journey-of-a-hero-to-unlock-your-own-potential/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-20T07:23:26Z"
}