{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is taught by Dr. Rick Hanson, a pioneering neuropsychologist who has been able to teach students how to naturally change the way that their minds work.<br> <br>Throughout this program, you’ll explore how you can activate processes inside your brain in order to accelerate your personal transformation.<br> <br>You’ll understand how thoughts affect your brain physically, how to harness the power of positive thoughts and reverse the effects of stress and pain, and how to create a life filled with joy rather than suffering.<br> <br><strong>Learn Meditative Practices That Will Transform Your Mind and Your Life<br> </strong></p>\n\n<ul><li>Discover How to Steady and Quiet Your Mind to Allow Focus and Concentration\n</li><li>Understand the Causes of Suffering So You Can Find Joy and Peace\n</li><li>Implement Equanimity in All of Your Daily Activities\n</li><li>Uncover Your True Self and Enhance Your Life with Positivity\n</li></ul>\n\n<p><strong class=\"redactor-inline-converted\"><br>Use Your Brain’s Neuroplasticity to Transform Yourself in a Profound Way</strong><br>This course focuses on the best of modern science and ancient Buddhist teachings to give you the tools you need to evolve your mind.<br> <br>In addition to learning about how the brain works, you’ll also tackle how to take advantage of your brain’s neuroplasticity to change the way that your thoughts affect your life.<br> <br>As you move through this course, you’ll encounter a variety of exercises and guided practices that will allow you to meditate in ways that will truly transform your mind for the better.<br> <br>You’ll practice mindfulness, weave positive thoughts and emotions into the fabric of your brain, and strengthen your concentration and focus.<br> <br><strong class=\"redactor-inline-converted\">Contents and Overview<br></strong>This course begins with an introduction to concentrating the mind so you can understand what happens in your brain when you focus.</p>\n\n<p>You’ll then move into your first guided meditation. This exercise will help you steady and quiet the mind, before diving into what occurs in the awakened mind and nirvana.</p>\n\n<p>Dr. Hanson then describes the causes of suffering so you can comprehend how your reactions and your brain can actually create unnecessary suffering.</p>\n\n<p>To move beyond suffering and into a state of peace, you’ll tackle the four components of equanimity before diving into several guided exercises designed to help you focus on your personal transformation.</p>\n\n<p>In order to change, you’ll need to open yourself up to a growing sense of serenity and contentment every day, so you’ll discover how to do that with a sense of equanimity as your foundation.  </p>\n\n<p>The final section of this course focuses on discovering what the “self” is. Through a combination of lectures and exercises, you’ll explore what’s existent and nonexistent in your apparent self.</p>\n\n<p>You’ll learn how to take life less personally and how to be a witness of your life rather than a prisoner.</p>\n\n<p>By the time you complete this course, you’ll have a variety of practical tools that you can use daily to positively change your brain’s function and enhance your life in various ways.  </p>\n\n<p>You’ll be able to use the best that modern science and ancient Buddhist teachings have to offer in order to release fear and negativity and create a life that’s less stressful and more joyful</p>", 
    "end_date": null, 
    "title": "The Enlightened Brain by Dr. Rick Hanson, Part 2", 
    "price": "50.00", 
    "instructors": "Sounds True, Dr. Rick Hanson", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796150_523b_3.jpg", 
    "course_url": "https://www.udemy.com/the-enlightened-brain-by-dr-rick-hanson-part-2/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T19:07:45Z"
}