{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t          In this special 90 minute course, Feng Shui Practitioner Nicolette Vajtay interviews Master Feng Shui Practitioner James Jay of Feng Shui Designs Inc. about the most important tool in Feng Shui:  The BaGua.  </p>  <p style=\"\">  \t        In this class you will experience the most in-depth exploration of the BaGua available anywhere, according to the Black Sect Tantric Buddhist principles of Feng Shui.  James clearly presents the development of the Feng Shui BaGua and explains the intricacies of this fundamental tool in very easy to understand language.  </p>  <p style=\"\">  \t          James teaches us how the BaGua came into being (approximately 5,000 years ago), why it is so important, especially if you are a Feng Shui Practitioner, and how it is used in modern Feng Shui.  </p>  <p style=\"\">  \t                From the concept of the polarity of Yin and Yang, through the development of the Eight Trigrams and the Five Elements, James weaves a thoroughly engaging and insightful presentation.  </p>  <p style=\"\">  \t                Short videos filled with rich content allow you to dive into this class at your own pace, ten minutes each evening after the kids are in bed, or perhaps on your lunch break for some inspiration!  </p>  <p style=\"\">  \t        While this class may be for anyone with a basic understanding of Feng Shui, it was created for Feng Shui Practitioners eager to continue their education and review the origins of the ancient practice.  It is also for Feng Shui enthusiasts and those who may have had a session with a Practitioner and wants to dive deeper into their own practice at home.  </p>  <p style=\"\">  \t        If you are hungry for more, and would like to understand the most basic concepts of Feng Shui, and understand the foundation of this ancient practice at it&#039;s roots, this class is for you.  </p>  <p style=\"\">  \t                Don’t miss this gem!  </p>", 
    "end_date": null, 
    "title": "The Feng Shui Bagua:  A Master Class with James Jay", 
    "price": "45.00", 
    "instructors": "Nicolette Vajtay, CEO Feng Shui Designs, Inc.  JAMES JAY", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/353448_f273.jpg", 
    "course_url": "https://www.udemy.com/the-feng-shui-bagua-a-master-class-with-james-jay/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-22T01:55:54Z"
}