{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Have you wanted a deep, meaningful connection to your Higher Mind, God (the Universe) but did not know how to create it? Has the purpose of life evaded you? Have you wondered how you might discover peace and contentment in life? Or, have you simply sought a way to deeply relax and let go of stress?I f any of these questions describe you, then meditation is for you.</p><p>Meditation will give you the results you seek. Meditation is a dynamic process of focusing the mind that produces clarity and conscious connection to the Higher Mind. By learning to relax the physical body and the conscious (chaotic) mind, you will relax and move deeper into your True Self. Letting go of earthly concerns, for even ten minutes a day, will produce amazing changes within you. With regular practice, you will feel greater control, find your health improving, optimism growing, experience greater insight and objectivity, strengthened intuition, and your sense of Inner Connection becoming stronger.</p><p>There are many benefits to meditation. Medical science has endorsed it as a tool for overcoming stress, reducing worry, and creating an overall sense of well-being. Successful people meditate to create clarity.</p><p>In this series, you will be led through a diversity of techniques in order for you to discover the methods that work best for you. It is suggested that you experience each technique, for that is the way you will find your path to self discovery, balance and health.</p>", 
    "end_date": null, 
    "title": "The Art of Meditation:  How and Why", 
    "price": "20.00", 
    "instructors": "Jean Walters", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/503232_88c7_2.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-meditation-how-and-why/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T18:49:06Z"
}