{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">The problem</strong>: If are a high-performer or you want to be one - then you need more energy to follow through your day.  </p>  <p>  \t<span>If so - then the №1 thing that will provide you with more energy is a better sleep. Combined with highly-effective morning tips that will give you even more energy - you will feel better than ever.</span>  </p>  <p>  \t<span><strong style=\"\">This course will help you:</strong></span>  </p>  <ul style=\"\">  \t<li><span>Optimize all parameters of your sleep, get most out of every minute and make your sleep a pleasure again</span><span>, even if you never thought it can be so.</span></li>  \t<li><span>You will reduce every major obstacle that hurts your sleep quality and f</span><span>ind your perfect sleep duration through experimentation</span></li>  \t<li><span>If it&#039;s hard for you to beat the snooze button addiction - then I have great news, there&#039;s a complete module on how to wake up easily and instantly. </span></li>  \t<li><span>You will get external motivation for waking up with your first alarm and a lot more useful tricks, like a</span><span>djusting yourself to a new sleep schedule with a first try and r</span><span>eseting your sleep schedule in just 1 day.</span></li>  \t<li><span>And a looot more.</span></li>  </ul>  <p>  \t<span></span>  </p>  <p>  \t<span><strong style=\"\">Why it&#039;s different: </strong></span>  </p>  <ul style=\"\">  \t<li><span>It&#039;s specific - it gives you specific action steps for a specific problem. </span></li>  \t<li><span>90% of online courses are never watched (sure, you knew that). I condened 4 hours of material in just 30 minutes of this course, so you will go through it fast.</span></li>  \t<li><span>It&#039;s recorded in plain english.</span></li>  \t<li><span>It&#039;s multi-angled. There are different tips that you can choose and use.</span></li>  </ul>  <p>  \t<span><strong style=\"\">The bonus:</strong> is a short habit-creating crash course. Your morning - is the part of the day to create healthy, long-term habits that will change your life and will be with you in years.</span>  </p>  <p>  \tYou will discover my 90%-99% habit creation strategy and will feel yourself like a cyborg that can install every habit, every skill and behaviour.  </p>  <p>  \t<strong style=\"\">Don&#039;t Miss It</strong>: the course is FREE for a limited time and will soon become paid as more content is coming out. <strong style=\"\">So enroll right now! </strong>It&#039;s short and to the point.  </p>  <p>  \tDavid Datoff.  </p>", 
    "end_date": null, 
    "title": "The Morning Energy: Reinstall Your Sleep, Energy and Habits.", 
    "price": "25.00", 
    "instructors": "David Bolbochan", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421818_cffb.jpg", 
    "course_url": "https://www.udemy.com/the-morning-energy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T14:19:51Z"
}