{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What happy students have to say:</strong></p>\n\n<p><strong>A Great Course!</strong><br></p><p>Hey J.T.,<br>\"Your course has already improved my life in the short time since I've completed it. I can see the power of questions further enhancing my potential. I must thank you again for putting together a great course.<br>I wish you nothing but the best in life. Now let us further empower the people around us with powerful questions! Have an amazing rest of your day!\"<br>Erik-</p>\n\n<p>\"Dear teacher, you are relentless in creating questions that encourage quality responses leading to achieving success. I've enjoyed each of your lectures. They are packed with insights and great examples. Thank you for this course. I shall refer to it often and endeavor to make positive, energizing, questions. Best wishes for your continued success!\" -Ken</p>\n\n<p>\"Hi! I have just completed this course of power of question and have really understood how and where to use what kind of question technique to get the expected answers.\" -P.</p>\n\n<p>\"...I used your course as inspiration for my life .although the course is short there is lot to learn from the power of these question.i been procrastinating for years not using my media skills but your course has now helped me to move past this big hurdle.\" -JN</p>\n\n<p><strong> Empower your life NOW by always asking the right questions.</strong></p>\n\n<p>Do you know how easily you can change your life by simply asking the right questions? Or how detrimental the wrong questions can be? The questions you ask determine your fate, your future, and your well-being, so make sure you're asking the right ones!</p>\n\n<p>This crash-course will show you how to leverage the power of questions: Both the questions you ask yourself and the ones you use to influence others. You will understand what kind of questions empower you, and which ones are simply a drain on your emotions and your influence.</p>\n\n<p>This course will provide answers to the age-old questions:</p>\n\n<p><strong>- HOW do I maintain stamina and influence, even in difficult situations?</strong></p>\n\n<p><strong>- HOW do I pick myself up after I fail?</strong></p>\n\n<p><strong>- WHAT do I need to do to hold people's attention?</strong></p>\n\n<p><strong>- HOW can I convince them to follow me and feel good?</strong></p>\n\n<p><strong>- HOW can I help others become happier?</strong></p>\n\n<p><strong>- HOW can I influence my customers to buy into my ideas, products, and services?</strong></p>\n\n<p>As a successful Sales and Marketing Professional, I have learned to use many different communications tools to achieve my goals, and now I am here to teach you how to leverage these to achieve your own greater success.</p>\n\n<p>So let's go on a journey together and learn how to harness the powerful effects of communication for ourselves and those around us.</p>\n\n<p>Come along. After all, it's FREE and it comes like always with Udemys 30-days-money-back-guartee too :-) From there you can also access my many other resources and tools to help you improve your personal and professional situation.</p>\n\n<p>What's holding you back? Now, that's a great question, isn't it?</p>", 
    "end_date": null, 
    "title": "The Power Of Questions", 
    "price": 0, 
    "instructors": "Joachim Guenster (J.T. Story)", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467258_efc1_3.jpg", 
    "course_url": "https://www.udemy.com/the-power-of-questions/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-04T10:10:17Z"
}