{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\r\n\t<strong>Includes a FREE DOWNLOADABLE BONUS copy of Wallace D Wattles hidden treasure &#039;How To Promote Yourself&#039;</strong>\r\n</p>\r\n<p>\r\n\t  Seeing the movie &#039;The Secret&#039; for the first time back in 2006, I was immediately inspired to locate the book behind the move. It was called<strong> &#039;The Science Of Getting Rich&#039;</strong> and even though it was written by Wallace D Wattles way back in 1910, every single page just leapt out at me as making perfectly good sense. It was like I instinctively &#039;Knew&#039; that what Wallace was saying was absolutely THE TRUTH, and I haven&#039;t looked back since.\r\n</p>\r\n<p>\r\n\t  At the time of receiving my very first copy of The Science Of Getting Rich, I was living in a flat that I hated, going to a job I detested, driving a car I was embarrassed by and was incredibly sick with something called &#039;Graves Disease&#039;... Now as I sit here writing this, I live in a house that I love, surrounded by fantastic neighbours, just two doors away from my parents. I have worked <em>(And I use the term very lightly)</em> from home since 2011 doing &#039;stuff&#039; that I love. I drive a car that puts a smile on my face eveytime I start her up, and my present health is incredible... Now, Just like you, I work on this &#039;stuff&#039; everyday, and have only just begun to scratch the surface of what&#039;s truly possible using the Ideas, tools and techniques in this incredible body of work called &#039;The Science Of Getting Rich&#039;\r\n</p>\r\n<p>\r\n\t  I actually own quite a few copies of &#039;The Science Of Getting Rich&#039; in several different formats, and I am so excited to have the opportunity to share this work with you here on Udemy. Millions of people worldwide have immersed themselves into this great mans work, and now it&#039;s your turn.\r\n</p>\r\n<p>\r\n\t I look forward to meeting you on the beaches of the world to hear how this course changed your world and made you rich...\r\n</p>\r\n<p>\r\n\t Love &amp; Light\r\n</p>\r\n<p>\r\n\t Mark Denton Bevens\r\n</p>", 
    "end_date": null, 
    "title": "The Science Of Getting Rich Workshop", 
    "price": "25.00", 
    "instructors": "Mark Denton Bevens", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/238970_5549_2.jpg", 
    "course_url": "https://www.udemy.com/the-science-of-getting-rich-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-07T15:37:38Z"
}