{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">Calling all humans interested in cultivating goddess energy!</p><p style=\"\">Can you feel the awakening of the divine feminine ~ balancing the masculine and reinvigorating our planet?  Let&#039;s get together for gatherings that lift the Goddess vibration in YOU!  How about utilizing feminine power to heal ourselves, our families, our relationships and indeed - this planet! It&#039;s time.  We are here, together, in this transitional era to enjoy life and bring harmony to the world.  Our purpose is to awaken and LIVE as the Authentic Goddess, worldwide. </p><p style=\"\"><br style=\"\"></p><p style=\"\"> This class, the Goddess Sensuality Series PART 1, will help us discover and practice the four &#039;baseline&#039; feminine energies - Lover™, Devotee™, Conservationist™ and Visionary™.  The complete series will include discussion about the goddess energy and do-it-yourself activities to activate your relationships! Do-it-yourself activities include healing ceremony instructions, tantra exercises, and activities around moon and sun manifestation, as well as JujuMama&#039;s many exciting processes for personal development!  This class is open to all ethnicity, gender, culture, religion, sexual orientation, age, and profession. You will be welcome with open arms by me ~ Kenya K Stevens, CEO of JujuMama llc, love coach.  We love you and look forward to meeting u soon. xxoo</p>", 
    "end_date": null, 
    "title": "The Goddess Sensuality Series - Part 1", 
    "price": "25.00", 
    "instructors": "Kenya Stevens", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/436844_5762_2.jpg", 
    "course_url": "https://www.udemy.com/the-goddess-sensuality-series-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-02T19:53:04Z"
}