{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The Success Blueprint is for people who&#039;d like to bring their ideas, desires, goals into the physical reality. Based on NLP and understanding of our minds and our neurology, I will take you through the missing keys for success.</p><p>You will finally understand the psychology of success, uncover your deepest desires and then... you will understand how specifically to bring it all from the intangible world of Quantum reality, into the physical plane, the Newtonian Reality.</p><p>You will not be told to visualize forever and do endless affirmations. You will learn the Success Blueprint and apply it immediately, in any context of your life, for the real world results.</p><p>While this course is perfectly aligned with a very deep understanding of the Law of Attraction and alike... it&#039;s the untold story, a missing link if you will, of aligning yourself from within, while performing the right behavior on the outside. A behavior of successful people. </p><p>Here&#039;s a short description of the 3 modules covered and you can preview for free, the video introduction to each module for greater understanding of what is covered:</p><p><strong style=\"\">Module 1:</strong></p><p>- I&#039;ll show you how successful people do it , so that you can apply it to yourself, when creating your life!</p><p>- You will understand what sets the top 1% apart, and learn about the differences that truly make the difference.</p><p>- Master the 4 universal keys that are needed for success, applicable in any area of your life.</p><p><strong style=\"\">Module 2:</strong></p><p>- Reset and detox your thinking so that you can think clearly and focus on what is really important in your life!</p><p>- Determine what your hidden dreams and desires are, so that you can get in touch with your deepest purpose, as well as confront your deepest fears and self imposed limitations </p><p>- Understand truly what has been stopping you, so that you can be free to create, what you truly deserve.</p><p><strong style=\"\">Module 3:</strong></p><p>- Discover your deepest purpose so that you can find the true source of your own, never-ending internal motivation</p><p>- Learn how to design big hairy audacious goals, so that you can easily turn them into your reality</p><p>- Learn how to finally think like a super successful person, so that you can easily become the conscious creator of your own reality</p><p></p><p>If what you liked what you read above, that means that you are ready for this course. Join me now, so that you can finally... create the life of your dreams.</p>", 
    "end_date": null, 
    "title": "The Success Blueprint - Missing Keys for Manifestation", 
    "price": "20.00", 
    "instructors": "Robert Simic", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546386_795a_4.jpg", 
    "course_url": "https://www.udemy.com/the-success-blueprint-secret-keys-for-manifestation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T06:29:46Z"
}