{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t   You have the feeling that something has to change. You want to do more, have more, BE more but you´re not really sure how to go about it or where to start…  </p>  <p style=\"\">  \t   In all truth,  it doesn´t matter what your goals are, developing self-awareness is the first step to getting you there.  </p>  <p style=\"\">  \t   The better you understand your true self and what motivates you,  the easier it will be to focus your energy on defining and directing the changes that need to take place to get you where you want to go.  </p>  <p style=\"\">  \t   It’s often said, “We cannot change what we will not see.”  </p>  <p style=\"\">  \t   Self-awareness is the process of acknowledging not just your strengths, but also your weaknesses. It involves listening to your feelings as well as your body, then taking action based on what you hear.  </p>  <p style=\"\">  \t   When you are more in tune with your body, it is much easier to say “no” to that extra piece of cake, to staying up later or even working yourself until you drop. Self-awareness is a process of learning to trust in yourself. And the more you practice it, the better you will get.  </p>  <p style=\"\">  \t   Join us in this course as we discuss some key tips for beginning your journey to greater self-awareness. Learn how to:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t   ·Reflect on who you are and who you’d like to become.  \t</p>  \t<p style=\"\">  \t\t   ·Discover your true self  \t</p>  \t<p style=\"\">  \t\t   ·Become aware of your motivations  \t</p>  \t<p style=\"\">  \t\t   ·Better understand your personality type  \t</p>  \t<p style=\"\">  \t\t   ·Push outside your comfort zone  \t</p>  \t<p style=\"\">  \t\t   ·Acknowledge your negative traits  \t</p>  \t<p style=\"\">  \t\t   ·Silence the negativity &amp; replace it with positive self-talk  \t</p>  \t<p style=\"\">  \t\t   ·Use self-awareness to be your best self  \t</p>  </ul>  <p style=\"\">  \t   Self-awareness is a necessary part of self-esteem and change. If you want to grow as an individual, begin with taking a close look at a complete and honest picture of who you are now.  </p>  <p style=\"\">  \t   The better you understand yourself, the better you will be able to accept yourself as you are…and change those things you want most to change.  </p>  <p style=\"\">  \t   This is the first step on your journey to becoming the best you can be. In this course you will discover the art of developing greater self-awareness as a way to living the extraordinary life you were meant to live.  </p>  <ul style=\"\">  </ul>", 
    "end_date": null, 
    "title": "The Art of Developing Self-Awareness", 
    "price": 0, 
    "instructors": "Jan Marie Mueller", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/161764_df17_4.jpg", 
    "course_url": "https://www.udemy.com/developing-self-awareness/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-11T09:17:52Z"
}