{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>About the Course</strong></p><p>Coaching has many uses in organizations, and the sequence of coaching activities is similar in all of them. Assuming, of course, that coaching is part of the organizational policy.</p><p>The course on <strong>The Key Stages of Coaching</strong> will involve learners in the process of discovery, goal setting, action planning, and follow-up that distinguishes coaching from other development methods. </p><p><strong>Course Target</strong></p><p>This course is for anyone in an organization who has a role in improving the performance of co-workers, keeping in mind the fact that coaching is not solely a top-down activity. </p><p>Typically, coaching involves team members, team leaders, and supervisors, including senior managers and CEOs. But, everyone can benefit.</p><p><strong>The Instructor</strong></p><p>My name is Sorin, and I will be your instructor. I have been working as a manager and trainer for the last 10 years, and I used to coach young professionals. </p><p>And, the plan is to share with you what I have learned from my experience, and to pass on what I have learned during my training, a while ago.</p><p><strong>Course Structure</strong></p><p>There are 3 stages of coaching to learn: preparing to coach, structuring and delivering coaching sessions, and following up on the coaching session.</p><p><strong>Course Objectives</strong></p><p>After completing the course, you will be able to determine which coaching opportunities exist within a given scenario, use appropriate techniques to persuade a coachee that coaching is needed, and identify examples of the appropriate actions to take when planning and preparing for a coaching session. </p><p>After completing the course, you will also be able to understand the benefits of applying a structured approach to coaching, identify the elements of SMART coaching goals, establish the reality of a situation, evaluate development options in a coaching session, and effectively wrap up a given coaching session. </p><p>And, finally, you will also be able to recognize the benefits of following up the coaching session, <br> apply techniques to ensure that a coachee realizes his or her coaching goals in a given scenario, and - very important determine whether the appropriate level of support was provided to coachees in a given situation.</p><p><strong>Apply now!</strong></p><p>So, if this is of interest for you, go ahead and hit the Register button. Or, if you are not yet convinced, please try the free preview lectures first. Thank you, and see you on the inside!</p>", 
    "end_date": null, 
    "title": "The Key Stages of Coaching", 
    "price": "30.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578928_6393_4.jpg", 
    "course_url": "https://www.udemy.com/the-key-stages-of-coaching/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-10T11:00:22Z"
}