{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Realizing Your Potential</strong></p><p><strong><em>Learn The Essential Method For Advanced Personal Development</em></strong></p><p>Only when you're totally clear about who you really are, can you relate to yourself and the world most effectively. Only when you clearly know what makes you tick, can you make your life tick, can you make your work, play, business and relationships tick.<br></p><p>You no longer operate on mediocre levels of being and acting because now you <em>know </em>what you're doing rather than <em>think </em>or <em>believe </em>you know. This is what makes you a confident achiever in the world instead of a struggling, stressed-out tryer and hoper... </p><p>And it's not a matter of willpower but of <em>know-how</em>. You have the potential but not the knowledge. The purpose of this powerful course is to give you that know-how.</p><p> If you're ready to move on to higher and higher levels of being and performing -- you've come to the right place!<br></p><p><strong>YOU ARE GOING TO LEARN:</strong></p><p>1. A reality-based <em>Method </em>for realizing your self and your potential.</p><p><span></span>2. Who you are both personally and <em>really</em>, and how to apply the <em>Method </em>by which one empowers the other.</p><p>3. What the purpose and meaning of your life are, and how to apply the <em>Method </em>to Fulfill them.</p><p>4. What the “vicious circle\" is that unconsciously perpetuates most all your mistakes, stressors and blocks -- and how to apply the <em>Method </em>to overcome it.</p><p>5. How to play all your roles like a movie star.</p><p>6. How the <em>Method </em>gives you crystal clarity and total self-control.</p><p>7. How to <em>internalize </em>your true identity in order to actualize it.</p><p>8. How to <em>internalize </em>any goal to make it effortlessly achievable.</p><p>9. How to <em>correct the relationship</em> between your personal self and your real self.</p><p>10. What is the most powerful characteristic of your real self and how to apply it to achieve your goals.</p><p><strong>WELCOME TO THE GREATEST ADVENTURE ON EARTH!</strong></p>", 
    "end_date": null, 
    "title": "The Universal Detachment Method", 
    "price": "20.00", 
    "instructors": "William F. McLaughlin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/396894_7319_2.jpg", 
    "course_url": "https://www.udemy.com/realizing-your-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-18T01:10:43Z"
}