{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course we will explore what separates successful entrepreneurs from most people. Namely, the building blocks which dictate what we think is possible or attainable - our beliefs.</p>\n\n<p>I am sure you have something which you wanted to try but something was holding you back? Well, the feeling is very familiar and you are not alone. </p><p>Having been there myself, I know first hand what it is like to be held back by limiting beliefs. After having the privilege to work with more than 10 great entrepreneurs over the last 5 years, I combined all the lessons I learned with my expertise in psychology and NLP to create this course. The main purpose is to help you identify the hidden blindspots holding you back and destroy the beliefs which are no longer serving you in order to end self sabotage once and for all. The syllabus is broken down into easily digestible sections, in which we explore step by step strategies and specific techniques. The course is designed to be practical, with no more than 60 minutes worth of content and exercises. </p>\n\n<p>By overcoming your limiting beliefs, you will gain control over your choices and your mindset, and have more leverage to take on the exciting ventures you were postponing for so long. </p>\n\n<p>I am certain you will enjoy the course and I am really excited to see you on the inside. </p>", 
    "end_date": null, 
    "title": "The Almighty Entrepreneur: Unlocking A Growth Mindset", 
    "price": "20.00", 
    "instructors": "Pavel Nikolov", 
    "commitment": "23 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833692_7b69_2.jpg", 
    "course_url": "https://www.udemy.com/the-almighty-entrepreneur-unlocking-the-growth-mindset/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T17:37:24Z"
}