{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>\"If HABIT is the vehicle that will drive you to your GOALS, t</strong><strong>his COURSE is the roadmap that will guide you on the journey.\" </strong></p><p><strong></strong>~ Chris Kyle, creator of The Habit Journal</p><p>_____________________________________</p><p><strong>Did you know that focusing on your daily habits can make you</strong> healthier, wealthier, happier, more productive, more creative, more confident, more mindful, more organised, less anxious and altogether more successful?</p><p><strong>So why aren't we all working on our habits? </strong>Well, making something a habit is difficult...which is why I created this course to help you get started right now.</p><p><strong>My name is Chris Kyle, I am the creator of The Habit Journal™</strong> and this course will teach you how to use it to track your habits, achieve your goals and change your life forever.</p><p><strong>The Habit Journal was launched on the crowdfunding site Kickstarter</strong>, in February of this year. It had a goal of raising £3000 ($4500) in 30 days to manufacture the physical version. It reached the goal in 3 days and went on to raise £32,435 ($49,300), attracted 2218 backers and was selected as a Staff Pick within an hour of going live. The first run of the journals is now sold out and we're currently working on the second run with our Italian manufacturer. (Don't worry, you don't need the physical journal as the full printable PDF version comes free with this course)</p><p><strong>When was the last time you set a goal for yourself? </strong>This course is very hands on with many practical exercises...in fact, this is one right now: <em>take a pen and a piece of paper and start listing all the goals you've achieved in your life.</em></p><p>How long is your list?</p><p>Seriously, be honest, have you <em>ever </em>achieved a goal that you set for yourself? </p><p><strong>I'm not preaching here</strong>, for 30 years of my life I hadn't set myself one goal never mind achieved one...not one. My goals were set by my teachers, my parents and my bosses. I let my life be determined by other people. My one and only aim was to create as little friction as possible in this world and in doing so I achieved absolutely nothing. The worst thing was, I thought I was doing just fine. I had a house, a car, a girlfriend, some friends, an average paying job. Maybe you also think you're doing just fine as well, but are you really?</p><p><strong>What if you were capable of so much more?</strong> What if you had untapped potential? What if you could tap into that potential just by focusing on your daily habits? What if instead of watching TV, playing video games, drinking soda and surfing the internet you decided to work on habits that could transform your life and make you a success?</p><p><strong>How would it feel to finally set your own goals</strong>, to start successfully achieving those goals, to improve every area of your life including your health and fitness, your mental and spiritual well-being, your relationships with your family and/or partner, your personal development and your financial situation?</p><p><strong>This course will teach you how </strong>to use the journal to identify your goals and then get you focusing on all the right habits to help you achieve those goals...AND...it takes just 5 minutes of journaling every night. Are you willing to trade 5 minutes of your time for the life you want? </p><ul><li>You don't need to be into journaling to use it. </li><li>You don't need to be into self help. </li><li>You don't need to pay for a life coach.</li><li>You don't need to be young.</li><li>You don't need to have any qualifications.</li><li>You don't need to already know what you want in life.</li></ul>                                                                                                                                                 <strong>The only thing you need</strong> to be is motivated and committed to giving the course 100% effort. When you do this you'll realise than every goal is achievable and everything you want in life is attainable. <p>_____________________________________</p><p><strong>WHAT YOU WILL GET WITH THIS COURSE:</strong></p><ul><li>The Full PDF version of The Habit Journal, a 272 page guided journal for recording, measuring and applying lasting habits. Yours to print out and keep.</li><li>FUN!! This is one of the most hands on courses on Udemy, with lots of practical exercises and 2 major assignments to get you up to speed with your new habits immediately!</li><li>Full, free lifetime access</li><li>Over 40 lectures and 3 hours of content!</li><li>All future extra lectures and upgrades are always included for free</li><li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li><li>Regular free surprise tips and tricks to help with making your habits stick!</li></ul>_____________________________________                                                                                                                                                 <span></span><span></span><span></span><span></span><span></span><p><strong>THIS COURSE IS FOR YOU IF YOU WOULD YOU LIKE TO:</strong></p><ul><li><strong></strong>Lose weight</li><li>Get fitter</li><li>Run a marathon</li><li>Start eating healthier</li><li>Learn to meditate</li><li>Get up earlier</li><li>Become more productive</li><li>Improve your relationships</li><li>Stop smoking or other bad habits</li><li>Start your own business</li><li>Excel in your chosen sport/hobby</li><li>Improve yourself mentally</li><li>Develop spiritually</li><li>Improve your financial situation</li><li>Get promoted in work</li><li>Clear your debts</li><li>[<em>insert your goals here</em>]</li></ul>_____________________________________ <p><strong><em><strong>Thi</strong><strong>s course is recorded in full HD so please remember to click the HD button on your video window when playing a lecture.</strong></em></strong></p><em><span></span></em><p><em>\"The Habit Journal\" and related logo are trademarks of Chris Kyle.</em></p>", 
    "end_date": null, 
    "title": "The Habit Journal™ : How To Achieve Any Goal", 
    "price": "20.00", 
    "instructors": "Chris Kyle", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481130_b20e_12.jpg", 
    "course_url": "https://www.udemy.com/thehabitjournal/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T12:52:41Z"
}