{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\">***JOIN A COMMUNITY OF 1000+ WOMEN GAINING CONFIDENCE!!***</strong></p><ol style=\"\"><li style=\"\">Would you like to <strong style=\"\">take control of your personal and professional life</strong> by oozing confidence?</li></ol><ol style=\"\"><li style=\"\">Do you want to know <strong style=\"\">what it is that makes women charismatic</strong> and how you can become this way too?</li></ol><ol style=\"\"><li style=\"\">Do you want to <strong style=\"\">transform the way you feel about yourself</strong> and the way the world perceives you?</li></ol><p style=\"\"><strong style=\"\">If so, enroll in this course today!</strong></p><p style=\"\">Confidence is the sexiest thing a women can wear. This course is all about giving you tools which you can use on a daily basis in order to feel more confident and increase your self esteem. After completing this course you will not only perceive yourself in a more feminine, sexier, positive light but the world will also feel the confident energy you carry around on a daily basis. </p><p style=\"\"><strong style=\"\">Powerful women all have one thing in common: </strong></p><p style=\"\">They all have confidence and strength from within. If you are ready to start radically changing the way you feel from within then this course is for you! The course is easy to complete and has a relaxed, friendly feel. By making use of both videos and downloadable pdf&#039;s, learning a new confident tool never gets boring!</p><p style=\"\">Warning!! Ladies, I am allergic to all things boring and dull and this course is about having fun while adding positive confidence back into our lives. So if you are ready for radical change then don&#039;t sign up now. Increase your self-esteem, confidence and self love. Start your personal transformation journey today!</p><p style=\"\">After taking this course you will have know how to build your confidence, you will be amazed how your confidence improve, you will also love the unique confidence tips and you will truly feel like a confident woman.</p><p style=\"\"><strong style=\"\">Start Learning Today!</strong></p><p style=\"\">This is the <strong style=\"\">most comprehensive Women&#039;s Coaching Course</strong> on the market!</p><p style=\"\"><strong style=\"\">**BONUS:**</strong></p><p style=\"\">Sign up today and get my Relationship Ready Course for FREE!!</p>", 
    "end_date": null, 
    "title": "THE ULTIMATE CONFIDENCE COACHING COURSE For WOMEN", 
    "price": "50.00", 
    "instructors": "Larissa Swart", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/432672_73e1_2.jpg", 
    "course_url": "https://www.udemy.com/confidence-coaching-for-women/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-26T04:20:42Z"
}