{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Dr. Rick Hanson is a pioneering neuropsychologist and author who teaches the inner skills necessary for personal wellbeing and psychological growth.<br> <br>In this course, Dr. Hanson will show you how to train your brain so you can heal old pain, become more positive, and live life less seriously while enjoying every moment.<br> <br>You’ll learn what it takes to have complete control over your feelings and thoughts as you improve your brain by continually sculpting it for the better.<br> <br><strong class=\"redactor-inline-converted\">Transform Your Mind So You Can Embrace Joy and Peace Every Day<br> </strong></p>\n\n<ul><li>Comprehend How the Brain Works and How It Developed\n</li><li>Use Neuroplasticity to Change Your Mind for the Better\n</li><li>Heal Past Traumas and Release Present Fears\n</li><li>Experience Guided Practices That Improve the Mind</li></ul><p><strong><br>Remove Negativity from Your Life and Start Focusing on the Positive<br></strong>The goal of this course is to teach you how to control your brain’s reaction to life.<br> <br>Rather than responding to situations with heartache, frustration, and fear, you’ll return your brain to its natural state of caring, contentment, and calm.<br> <br>You’ll also access tools that you can use every day, particularly guided meditations, that will not only bring about calmness and focus, but also improve your concentration.<br> <br><strong class=\"redactor-inline-converted\">Contents and Overview<br></strong>After a brief introduction, you’ll dive right into self-directed neuroplasticity to discover that the brain actually continues to develop throughout life.</p>\n\n<p>You’ll learn how the brain functions, what experts have learned about the effects of behaviors on the brain, and how you can engineer your own brain so it’s more aligned with who you want to be.</p>\n\n<p>Then you’ll tap into the importance of mindfulness, virtue, and wisdom, which are the three pillars of practice in Buddhism.</p>\n\n<p>You’ll immediately apply these concepts with guided meditations that stimulate your brain’s potential for growth.</p>\n\n<p>As you move deeper into the course, you’ll explore the evolution of the brain, and you’ll learn how to counteract the “negativity bias” that it developed in order to protect you from danger.</p>\n\n<p>Through several guided practices, you’ll maximize your brain’s ability to accurately assess levels of threat and overcome the negativity bias.</p>\n\n<p>You’ll deepen your responsiveness to what’s good in life and start using positive experiences to heal old pain.</p>\n\n<p>Finally, you’ll uncover how meditation and concentration techniques can change your brain, and you’ll experience it first-hand through guided practices that will steady the mind and help you be satisfied with less.</p>\n\n<p>By the end of this course, you’ll have a toolbox of meditations that you can use daily to help your brain release negativity and embrace the positive.</p>\n\n<p>You’ll know how to integrate the best of Buddhist teachings and modern science into your life so you can transform your mind, be less afraid, and find peace and happiness</p>", 
    "end_date": null, 
    "title": "The Enlightened Brain by Dr. Rick Hanson, Part 1", 
    "price": "50.00", 
    "instructors": "Sounds True, Dr. Rick Hanson", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/796148_f20d.jpg", 
    "course_url": "https://www.udemy.com/the-enlightened-brain-by-dr-rick-hanson-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-17T19:07:35Z"
}