{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>If you don't design your own life plan, chances are you'll fall into someone else's plan. And guess what they have planned for you? Not much. - Jim Rohn <br></p>\n\n<p>_____________________________________</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Do you know that by NOT having a daily journal you are compromising your</strong> health, wealth, happiness, unrealized potential, and altogether your finite life?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">So why don't we all have a daily journal? </strong>Well, as I learned the hard way, most of us by default just live life...which is why I created this course to help you get started right now.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">My name is Jawwad Siddiqui, I have been keeping a daily journal for past 5+ Years</strong> and this course will teach you how I used it to gain freedom from 9-5 jobs, gain control over my finances, and get smarter about doing important things.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">When was the last time you set a goal for yourself? </strong>This course is very hands on with many practical exercises...in fact, this is one right now: <em>take a pen and a piece of paper and start listing all the goals you've achieved in your life.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>How long is your list?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Seriously, be honest, have you <em>ever </em>achieved a goal that you set for yourself?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What if you were capable of so much more?</strong> What if you had untapped potential? What if you could tap into that potential just by focusing on your daily journals? What if instead of watching TV, playing video games, drinking soda and surfing the internet you decided to work on journaling that could transform your life and make you a success?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">How would it feel to finally set your own goals and gain control of your life</strong>, to start successfully achieving those goals, to improve every area of your life including your health and fitness, your mental and spiritual well-being, your relationships with your family and/or partner, your personal development and your financial situation?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course will teach you how </strong>to use the journal to identify your goals and then get you focusing on all the right habits to help you achieve those goals...AND...it takes just 5 minutes of journaling every night. Are you willing to trade 5 minutes of your time for the life you want?</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">The only thing you need</strong> to be is motivated and committed to giving the course 100% effort. When you do this you'll realize than every goal is achievable and everything you want in life is attainable.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>_____________________________________</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">WHAT YOU WILL GET WITH THIS COURSE:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Short Actionable Videos</strong> - so you can get started as soon as possible. </li><li><strong class=\"redactor-inline-converted\">PDF Guide to Daily Journals </strong>- Template, tips, and instructions to get you started with the daily journals. </li><li><strong class=\"redactor-inline-converted\">Community (New!)</strong> - Join the exclusive facebook group dedicated to helping, encouraging, and support each other!</li><li><strong>Friend</strong> - coaching and feedback along the way to help you get there!</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>____________________________________</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">THIS COURSE IS FOR YOU IF YOU WANT TO: </strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Be Confident of Your Appearance / Looks</li><li>Stop the Debt Struggle</li></ul>\n\n\n\n\n\n<ul><li>Stop Feeling De-Motivated </li><li>Learn to meditate</li><li>Get up earlier</li><li>Start your own business</li><li>Excel in your chosen sport/hobby</li><li>Improve yourself mentally</li></ul>\n\n\n\n<ul><li>Get promoted in work</li><li>Clear your debts</li><li>[<em>insert your goals here</em>]</li></ul>", 
    "end_date": null, 
    "title": "The Daily Journal - Habit of Successful People", 
    "price": 0, 
    "instructors": "Jawwad Siddiqui", 
    "commitment": "31 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/788372_9cb5_4.jpg", 
    "course_url": "https://www.udemy.com/the-daily-journal-habit-of-successful-people/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-10T12:07:05Z"
}