{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>What students are saying:</strong></p><p>Excellent course. Concepts explained in real life terms. ~ R. Venkataramani,</p><p>Excellent, life changing, course!!! This course inspired me to keep going in my journey for excellence. Really good content. ~ H. Quevedo</p><p>Have your life goals fallen by the wayside? Have you been letting life \"happen\" to you?  Do you need direction? Are you feeling lost, stuck, unfulfilled, or disillusioned with life? This course explains the 5 decisions that, if applied together and consistently, will help you achieve your goals. The course, based on the book by the same title, provides a simple but powerful blueprint to help you map your course and reach your destination.<strong> </strong></p><p><strong>Learn:</strong></p><ul><li>That you have the power to control and change your life </li><li>The of precision and clarity of vision in setting goals and achieving success</li><li>The key processes in planning and taking action</li><li>The power and impact of focusing your attention</li><li> How to overcome obstacles</li></ul>In this life, there are no Fairy Godmothers or people or sources outside of yourself that you can rely on 100% to make your dreams come true. The responsibility for your happiness and success falls squarely on your shoulders. Ready to get started? Click the \"Take This Course\" link to the right of your screen, and I'll see you online!", 
    "end_date": null, 
    "title": "The 5 Decisions That Can Transform Your Life Forever", 
    "price": "40.00", 
    "instructors": "Lilia Fallgatter, JD", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/578476_3e7f_2.jpg", 
    "course_url": "https://www.udemy.com/the5decisions/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-09T23:13:54Z"
}