{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated May 8, 2016!  What people are saying about Think and Grow Rich Transformation: How to Become Wealthy by Louise Anne Maurice of Womanly Wealth Academy</strong>:<br></p>\n\n<p><em>\"Powerful - </em><em>This course is life-changing. I had so many “I get it” moments working through the exercises because I became aware of the deeper issues that have been holding me back from being successful and making positive lasting changes in my life. The empowerment coaching helped me put it all together and gave me direction. I can’t thank you enough.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Have you ever read the title of the book <strong><em>Think and Grow Rich</em></strong> by Napoleon Hill and muttered under your breath “really?\" You are not alone. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you are you struggling and striving to become wealthy in every area of your life and can't understand what stops you, this course is perfect for you. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You are someone who deeply desires success but you keep sabotaging yourself, you want to join this course because it was designed with your success in mind. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you have spent thousands on “self-help or self-improvement\" courses, training or books including <em>Think and Grow Rich </em>but the methods just haven't worked for you, this course will be the answer you have been searching for.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What is covered in Think and Grow Rich Transformation: How to Become Wealthy?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ol><li>This course gives you 7 Think and Grow Rich Secrets that are sabotaging your wealth. </li><li>You receive exercises that give you insight for each secret and show you how to turn those secrets around so they become your unique foundation for becoming wealthy. </li><li>You also receive how to become wealthy skill builders for each secret.</li><li>Think and Grow Rich Empowerment Coaching that guides you to applying the lessons you have learned and making it work for your life.</li></ol>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Click on \"Take this Course\" and join me today!<br></p>", 
    "end_date": null, 
    "title": "Think and Grow Rich Transformation: How to Become Wealthy", 
    "price": "20.00", 
    "instructors": "Womanly Wealth Academy, Louise Anne Maurice", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430234_aecf_4.jpg", 
    "course_url": "https://www.udemy.com/think-and-grow-rich-secrets-how-to-become-wealthy/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T19:45:36Z"
}