{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<strong></strong><strong></strong><p><strong></strong></p><p><strong>TOP 10 Hacks von 200+ High-Performern - d</strong><strong>ie Sie SOFORT umsetzen können!</strong></p><p><strong>Die Zeiten durchschnittlich zu sein sind endlich für Sie vorbei!<br></strong></p> <strong>Deswegen sollte Sie das interessieren:</strong><ul><li><strong>1 Kurs mit 7 Lektionen</strong> und als <strong>Bonus</strong> das <strong>geheime Profil eines High-Performers</strong></li><li>Jede Lektion enthält <strong>konkrete Schritte, die Sie sofort, noch heute, umsetzen können</strong></li><li>Werden Sie zu einer stärkeren Version Ihrer selbst <strong>mit diesen Top Hacks und Action-Steps werden Sie zum High-Performer</strong></li><li>Viel energetischer <strong>schöpfen Sie damit Ihre maximale Leistung aus zu mehr Erfolg und mehr Gewinn</strong></li></ul><p>Investieren Sie jetzt in sich selbst. <strong>Diese Investition kann Ihnen keiner mehr nehmen.</strong></p><p>★ Erschaffen Sie <strong>eine stärkere Version von sich selbst</strong><br>★ <strong>Lernen Sie Ihr Gehirn besser kennen</strong><br>★ Gestalten Sie Ihren <strong>Alltag effizienter</strong><br>★ <strong>Arbeiten Sie konzentrierter</strong><br>★ Lernen Sie Ihr Gehirn zu <strong>unterstützen</strong></p><p><strong>Werden Sie jetzt zu Ihrem eigenen Lebensstilberater!</strong> </p>Der Kurs bzw. die Lektionen sind für Sie jeweils verfügbar als Videokurs, Audiobook und als PDF-Dateien<p><br></p>\n<p><strong>Inhalt des Kurses:</strong> <br>• Teaser (0:48)<br>• Vorstellung (5:27)<br>• Kurseinführung (10:21)<br>• Lektion 01: Ernährung (27:24)<br>• Lektion 02: Schlaf (20:19)<br>• Lektion 03: Skills - Neue Fähigkeiten (47:05)<br>• Lektion 04: Training und Bewegung (19:44)<br>• Lektion 05: Meditation - Leben im Jetzt (20:48)<br>• Lektion 06: Dankbarkeit und positive Menschen (9:07)<br>• Lektion 07: Focus (17:17)<br>• Lektion 08: Profil eines High-Performers (4:01)</p>Warum sollten Sie diesen <strong>Kurs sehr ernst nehmen?</strong><p>Ich habe in meiner <strong>Studie viele hunderte Stunden</strong> hunderte Podcasts angeschaut und angehört.<br><br>Dabei habe ich <strong>die besten “Hacks” der Top Performer</strong> notiert und <strong>analysiert</strong>.<br><br>Resultierend daraus wurde das <strong>optimale Profil eines High-Performers erstellt</strong>.<br><br>Die besten “Hacks“ wurden untersucht, <strong>detailliert beschrieben und konkrete Action-Steps daraus herausgearbeitet</strong>.<br><strong>Damit auch Sie sich zum High-Performer \"transformieren\" können.</strong></p><strong>Folgende Fragen wurden gestellt und beantwortet:<p><br>High-Performer Profil</p></strong><p>Was sind die Top 10 Hacks der Top Performer dieser Welt und wie sieht das Profil eines High-Performers aus?</p><p><strong>Stetige Verbesserung</strong><br><br>Was sind die einfachsten Dinge, die man tun kann, um in verschiedenen Lebensbereichen besser zu werden?</p><p><strong>Höchstleistung und Flow</strong><br><br>Wie kommt man in den Zustand der Höchstleistung, wie verbessert man seine Biochemie, den Geist und Körper?</p><p><strong>Inneres Gleichgewicht</strong><br><br>Wie stellt man ein gesundes Gleichgewicht her und agiert dabei auf einem extrem hohen Niveau?</p><strong>Zum Kursaufbau</strong><p>Der Kurs ist sehr fokussiert aufbereitet und dauert für sich etwa 3 Stunden.<br><br>Addieren Sie die verlinkten Bonusvideos vom Autor dazu, sind es <strong>mehr als 10 Stunden pures Know-How</strong>.<br><br>Jede Lektion dauert etwa zwischen 10 min und 45 min. Sie können sofort beginnen, denn dieser Kurs ist ein <strong>digitales Produkt</strong>, es wird kein physisches Produkt ausgeliefert.</p><p><strong>Einführung und Zitat</strong></p><ul><li>Jede Lektion beginnt mit einer Einführung und einem bekannten Zitat passend zum Thema des \"Hacks\".</li></ul>Lektionsthema im Detail<ul><li>Danach wird der Lektionsinhalt detailiert <strong>erklärt</strong> und aufgezeigt, <strong>wie High-Performer diesen \"Hack\" umsetzen</strong>.</li><li>Als nächstes wird in der Lektion auf <strong>weiterführende Videos</strong> von Pawel M. Konefal verweisen, die zum Lektionsthema passen. Diese dauern ca. <strong>zwischen 20 min und 40 min</strong>.</li><li>Nach der Take-Action Phase gibt es noch einen <strong>Quiz</strong>, <strong>weiterführende Links und Literaturtipps</strong> passend zum Thema.</li></ul><p><strong>Take-Action Phase</strong></p><ul><li>In der Take-Action Phase der Lektion erhalten Sie <strong>ganz konkrete Handlungsaufforderungen</strong>, die Sie wirklich <strong>einfach und sofort umsetzen</strong> können.</li><li>Das <strong>Ziel</strong> dieses Kurses ist es, <strong>das gelernte sofort in die Tat umzusetzen</strong>.</li></ul><p><strong>Okay, das ist spitze!</strong> Aber was kann Ihnen dieser <strong>Kurs jetzt ganz konkret</strong> bringen?</p><p><strong>Damit werden Sie Schritt-für-Schritt selbst zum High-Performer und</strong> profitieren in Ihrem Alltag bei allen täglichen Aufgaben und Herausforderungen.</p><p><strong>Fangen Sie JETZT damit an!</strong></p>", 
    "end_date": null, 
    "title": "TOP 10 Hacks von 200+ High-Performern", 
    "price": "45.00", 
    "instructors": "Pawel M. Konefal", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/787538_802d_5.jpg", 
    "course_url": "https://www.udemy.com/high-performer-kurs/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-09T17:10:24Z"
}