{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      The Total Heart Mind Body and Soul Makeover is about digging deep, taking personal responsibility for everything that you think, feel, say and do, and tapping into powerful inner resources you may not even know you have.  </p>  <p>  \t      In this Course you will learn a fast, simple, easy to use, step by step process that over time will totally transform your heart, mind and body and connect you to your soul and Spirit. It will change how you think, feel and act by showing you how to choose Love and lose the fear.  </p>  <p>  \t      The Heart Mind Body and Soul Makeover includes an ebook with clear instructions for building your own Heartcompass LifeNavigator's Kit. In the course you will learn exactly how to use the Kit and get results the first time you use it. </p><p>The Lectures in this Course are supported by external resources - links, videos, and downloadable materials to help you maximize and expand upon your results.  </p>  <p>  \t      People who study this course and apply what they learn find relief from stress, experience improved relationships, make better choices that can lead to improved health and well being, solve financial and business challenges, and discover spiritual growth and awakening.  </p>  <p>  \t      The Total Heart Mind Body and Soul Makeover begins with a single step - the decision to get started right now. That first step will be the hardest one in this entire process! Get started today and see a difference in your life tomorrow.  </p>  <p>  \t      Don't wait. The Total Heart Mind Body and Soul Makeover is unlike anything you have ever experienced. It will empower you to take control over your life, and discover the self confidence and peace of mind you have been looking for.</p><p>NEW! Enroll in this Course at the full tuition price and receive one personal coaching session with the Teacher at no additional charge!</p>", 
    "end_date": null, 
    "title": "Total Heart Mind Body and Soul Makeover", 
    "price": "20.00", 
    "instructors": "Ilana Moss", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325902_922e_3.jpg", 
    "course_url": "https://www.udemy.com/total-heart-mind-body-and-soul-makeover/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-23T18:55:13Z"
}