{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">  Did you know that tapping acupuncture points can release the symptoms of depression naturally?  </strong>  </p>  <p>  \t<strong style=\"\">  How would you like to dump all the old emotional baggage and be free from fear forever?  </strong>  </p>  <p>  \t  Well now you can and I will show you how using an simple and easy to use technique called EFT Tapping.  </p>  <p>  \t  If you&#039;ve been struggling with depression, stress, low confidence or anxiety related issues for years and tried all the meds, maybe now would be a good time to try a natural technique that you can do at home in private.  </p>  <p>  \tTake a new journey with me and I will show you how to deal with negative emotions and release them fast. This means you can take control of your feelings and start a new direction in life.  </p>  <p>  \t  This course will teach you over 16 videos how to do the tapping technique for different emotions by following along with me on screen, it couldn&#039;t be easier.  </p>  <p>  \t  This course is not designed to replace any medical treatment and always consult with your doctor if you have any concerns.  </p>  <p>  \t  Take the 30 day challenge and be determined to beat your depression for good. Your mind is strong and with the right support you can change how you feel and become more confident as the month progresses.  </p>  <p>  \t<strong style=\"\">Let me show you how. </strong><strong style=\"\">Join me today and lets get started, you&#039;ll be glad you did!</strong>  </p>", 
    "end_date": null, 
    "title": "Transform Depression & Boost Your Self Esteem", 
    "price": "20.00", 
    "instructors": "David Childerley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/339268_5e1c_5.jpg", 
    "course_url": "https://www.udemy.com/how-i-beat-depression-without-drugs-and-how-you-can-too/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-08T22:37:31Z"
}