{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tAre you ready to DREAM your BIGGEST DREAMS and create steps to put an amazing life into action? Are you finally ready to step into the life you&#039;ve always dreamed of?  </p>  <p>  \tStop living in mediocrity and take hold of your future. This course is so much more than vision boarding, goal setting, and action planning. It&#039;s a transformational course that will help you from start to finish get a grasp on what you want and putting it into action.  </p>  <p>  \tAre you stuck in trying to set goals? Living an okay life, but striving for more? Desire to do, be, or have great things but are completely stuck in your current situation? Keep living with excuses or limiting beliefs?  </p>  <p>  \t<strong style=\"\">Get Rid of Fear and Doubt For Good</strong> &amp; <strong style=\"\">Create a Solid Plan and Start Living It</strong>  </p>  <p>  \tThis transforming lifestyle course was created to help you declare a vision for your life. You’ll clarify and hone your vision and work on creating goals that work to help you reach your vision.  </p>  <p>  \tIt is time for you to create goals and to get access to how you can successfully achieve them. This course also helps you to master the manifestation process at the same time. Work on your goals while opening the doors of opportunity for all you desire. In this course, I will teach you how to do all of this. <strong style=\"\">Start living and experiencing all that life has to offer, now.</strong>  </p>  <p>  \t<strong style=\"\">Your Life, Transformed</strong>  </p>  <p>  \tIn a nutshell, you’ll receive a lifestyle transformation. Instead of dreaming about your ideal life, you’ll put things into action and start living the life you want today. You’ll get a new perspective on life and instead of living with excuses, you’ll utilize the power within you to start getting what you want from life.  </p>", 
    "end_date": null, 
    "title": "Transform Your Life Masterclass", 
    "price": "50.00", 
    "instructors": "Kristin Lloyd, MS", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434294_c65d_3.jpg", 
    "course_url": "https://www.udemy.com/transform-your-life-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T17:39:24Z"
}