{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<span style=\" color:inherit; \"><strong>WHAT IF YOU COULD TRANSFORM YOUR INNER-CRITIC TO BRING OUT YOUR INNER BOMBSHELL?</strong></span>  </p>  <p>  \t  If you’re feeling stuck and not truly ENJOYING your life, read on….  </p>  <p>  \t  Who is your inner bombshell?  </p>  <p>  \t  Simple. She’s the best version of you.  </p>  <p>  \t  The you that knows who she is, what she wants and how to get it. Who has that rockstar career, mind-blowing relationship and super fun life.  </p>  <p>  \t  Who turns heads wherever she goes. Because her beauty shines from within and she walks with a confidence second to none.  </p>  <p>  \t  Who naturally attracts good things to her and lives with an overall sense of ease and playfulness.  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>You deserve to have it all...</strong>  </p>  <p>  \t      A rockstar career, loving relationship and to feel confident and happy. You imagine yourself to be someone who has great ideas and takes action on them. Someone with big dreams. You want to feel at peace with yourself and your body. Someone who attracts good things and lives with an overall sense of ease and playfulness.  </p>  <p>  \t      But for some reason, its just not clicking. And you&#039;re tired of settling for less than you know you deserve.<strong><br>  \t</strong>  </p>  <p>  \t<strong>I help women fall in love with themselves to finally have the lives they&#039;re dreaming of.</strong>  </p>  <p>  \t      In Crazy Wild Love, we will clear the clutter out of your life, decrease negative self talk, bust your limiting beliefs and improve your relationships. Did I mention that you&#039;ll also feel and look great too?  </p>  <h5><em><strong>Are you someone who…</strong></em></h5>  <ul>  \t<li>Is <strong>READY</strong> to tame your inner-critic and love yourself?</li>  \t<li><strong>WANTS</strong> to get out of your rut and wake up in a better mood?</li>  \t<li><strong>WISHES</strong> to have more adventure and fun in your life?</li>  \t<li>Is <strong>SICK</strong> of having their life filled with clutter?</li>  \t<li><strong>DESIRES</strong> a sense of meaning and purpose?</li>  \t<li>  \t<p>  \t\t   Is <strong>TIRED</strong> of knowing what to do but not losing weight?  \t</p>  \t</li>  </ul>  <p>  \t<em><strong>Imagine...</strong></em>  </p>  <ul>  \t<li>You feel<strong> ready and determined</strong> to make your dreams a reality</li>  \t<li>You turn heads wherever you go because your <strong>confidence and beauty</strong> shines through</li>  \t<li>Every day is infused with fun, play and a <strong>sense of adventure</strong></li>  \t<li>That inner-critic voice has quieted down and now the only voice you hear is the one telling you that <strong>“you can do it!”</strong></li>  \t<li>You are able to <strong>manifest and cultivate</strong> anything you want in your life</li>  \t<li>You finally develop healthy self-care <strong>habits that actually work</strong> for you, with your unique body in your busy life</li>  \t<li>You finally fall <strong>madly in love</strong> (for the first time or with your partner)</li>  </ul>  <p>  \t <strong>Join Me for 10-Weeks in Bombshell Bootcamp!</strong>  </p>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t       For more articles and to find out more about the author, Alexis Meads visit: <a href=\"http://alexismeads.com\" class=\"external-link\" target=\"_blank\" rel=\"nofollow\">AlexisMeads.com</a>  </p>  <h5></h5>  <h5><strong>What People Are Saying About Alexis and the Course:</strong></h5>  <p>  \t              “My experience with Alexis was rewarding and positive, and exceeded my expectations. More than anything, I thought it was going to be a simple test in self-discipline. I was mistaken. It was so much more than kick-starting my body.&quot; - Sarah Johnson  </p>  <p>  \t              “Alexis is very patient and shows compassion during your personal growth journey. She helps diagnose and problem solve what you may be going through to help guide you to what you believe as the truth. She guides you to what is best for your mental as well as physical health.” - Suzy Yun  </p>  <p>  \t              “I had a wonderful session with Alexis. She is so open and warm that I was instantly comfortable speaking to her about what was going on in my world and what I was hoping to get out of the session.  We discussed setting goals and how to create intention and balance as I go through a transition in my life.&quot; - Teal Reamer  </p>", 
    "end_date": null, 
    "title": "Ultimate 10 Step Program to Greater Confidence and Success", 
    "price": "35.00", 
    "instructors": "Alexis Meads", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/76336_761b_16.jpg", 
    "course_url": "https://www.udemy.com/crazy-wild-love-bombshell-bootcamp/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-09T17:51:45Z"
}