{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        Welcome to <strong style=\"\">introduction to the Planets and how they affect our relationships</strong>. We are delighted you can join us on our journey.  </p>  <p style=\"\">  \t    So if you are struggling to create meaningful relationships and your life seems to be in need of some magic, you will enjoy learning about the effect of the Planets on your relationships.  </p>  <p style=\"\">  \t         This course is designed to provide you with all the information you need to understand the Planets including over an hour of beautifully crafted films, E books, downloads and details on interpreting your Birth Chart.  </p>  <p style=\"\">  \t    We also include guidance on how your birth sign can impact you and your partners compatability.  </p>  <p style=\"\">  \t        We look at the significance and power of each planet and share guidance and tips in developing more fulfilling relationships So if you feel you are on an emotional roller-coaster, or your relationships are more drama and turmoil than you would wish for, learn how the power of Astrology can help you.  </p>  <p style=\"\">  \t        With over an hour of professionally crafted film, join our subject expert Caitlin in understanding how our personality traits, emotional responses, habits and behaviours are affected by the Planets.  </p>  <p style=\"\">  \t      We include all relationships and support you in creating longer lasting, more meaningful, enviable relationships.  </p>  <p style=\"\">  \t      Look out for the magic in your life by using Astrology to light the way ahead and shake things up.  </p>  <p style=\"\">  \t  This introductory price will be held until 1st April 2015 whereupon it will increase.  </p>  <p style=\"\">  \t        We estimate you will return to this course time and time again as we have included an in-depth look at both the world of Astrology and provided guidance for developing rewarding, fulfilling relationships.  </p>  <p style=\"\">  \t        We include downloadable materials including an e book providing guidance on your birth sign and share all of the information you need to move forward in your life&#039;s journey.  </p>", 
    "end_date": null, 
    "title": "Understand how to use Astrology to guide your relationships", 
    "price": "30.00", 
    "instructors": "Astrella Astrology, Lucian Evans", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/406726_4705_2.jpg", 
    "course_url": "https://www.udemy.com/understand-how-to-use-astrology-to-guide-your-relationships/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-28T15:12:00Z"
}