{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t        In this course you will discover your natural inner strengths and learn how to build and manage them to achieve fulfillment and success.  This course focuses on building your strengths rather than fixing your weaknesses.  It uses the <strong style=\"\"><em style=\"\"> Gallup StrengthsFinder 2.0</em> </strong>assessment as a starting point and then walks you through a practical journey to understand, internalize and apply your unique inner strengths to become more successful and more fulfilled in your life.  </p>  <p style=\"\">  \t<strong style=\"\"><u style=\"\">Key Steps along the Journey:</u></strong>  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t        ·Discover and understand your natural inner talents by taking the <strong style=\"\"><em style=\"\">Gallup StrengthsFinder</em> </strong>assessment.  \t</p>  \t<p style=\"\">  \t\t        ·Learn how to manage and build them into real strengths.  \t</p>  \t<p style=\"\">  \t\t        ·Identify beliefs that are holding your back and how to reprogramme new empowering beliefs.  \t</p>  \t<p style=\"\">  \t\t        ·How to start becoming clear on your life purpose.  \t</p>  \t<p style=\"\">  \t\t<strong style=\"\"><em style=\"\">CLICK FREE PREVIEW\" AND EXPERIENCE FIRST HAND, THE WHOLE 1st SECTION FOR FREE!!!!</em></strong>  \t</p>  </ul>  <p style=\"\">  \t        Most people live their whole lives never knowing their natural brilliance, with their <strong style=\"\">Genius</strong> hidden under limiting conditioning.  </p>  <p style=\"\">  \t        This course addresses the root of all human behaviour and then builds up from there to help you fully align yourself from the deepest level, your human needs, to your natural strengths, to your values, and beliefs, and then finally to define and <strong style=\"\">Unleash</strong> <strong style=\"\">Your Genius.</strong>  </p>  <p style=\"\">  \t        This course draws on the most up to date cutting edge fields within psychology. Below are just some of them...  </p>  <p style=\"\">  \t<em style=\"\">Human Needs Psychology, Strength Based Psychology / Positive Psychology, Neuro Linguistic Programming and Strategic Intervention</em>  </p>  <p style=\"\">  \t<strong style=\"\">What you will learn...</strong><strong style=\"\"></strong>  </p>  <p style=\"\">  \t        ·You will learn and understand what your natural talents are and how to build them into real strengths  </p>  <p style=\"\">  \t        ·You will clearly define your unique strengths.  </p>  <p style=\"\">  \t        ·Understand the difference between your \"hardware\" and your \"software\"  </p>  <p style=\"\">  \t        ·You will understand how you have programmed yourself up until now and how to change any limiting programming.  </p>  <p style=\"\">  \t        ·You will understand how you have prioritized your life and how you measure those priorities.  </p>  <p style=\"\">  \t        ·How to break through limiting beliefs.  </p>  <p style=\"\">  \t        ·You will understand the forces that drive ALL your choices, decisions, emotions and behaviour, and how to direct your life down the path of your natural <strong style=\"\">Genius</strong>.  </p>  <p style=\"\">  \t<strong style=\"\">Duration of the Program:</strong>  </p>  <p style=\"\">  \t        21 Weeks  </p>  <p style=\"\">  \t        This programme is designed to give you 3 weeks between each of the modules to allow you time to work with the material.  </p>  <p style=\"\">  \t    Stay in touch with updates and new courses...  </p>  <p style=\"\">  \t    https://www.facebook.com/gavinlundonlinecourses  </p>", 
    "end_date": null, 
    "title": "Unleash Your Genius (Discover Your Strengths)", 
    "price": "20.00", 
    "instructors": "Gavin Lund", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/175816_8662_17.jpg", 
    "course_url": "https://www.udemy.com/unleash-your-genius/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-03T13:46:26Z"
}