{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></strong></em></p>\n\n<p>Do you find yourself daydreaming about the next quest in your favorite online game, do you spend more than eight hours a day with your computer or favorite game console playing video games? Has virtual-reality negatively impacted your relationships in the real world?  </p>\n\n\n\n<p>Some experts warn that excessive gaming can even be fatal. A tech-addiction expert in Seattle said she has known of people who have died from heart attacks and blood clots, both results of the unhealthy lifestyle many extreme gamers live.</p>\n\n\n\n<p><strong>The warning signs of video game addiction include:</strong><br></p>\n\n\n\n<ul><li><strong>Gaming to escape difficult life situations</strong></li><li><strong>Playing for longer periods as time goes on</strong></li><li><strong>Skipping showers and meals to play</strong></li><li><strong>Poor performance at work or school</strong></li><li><strong>Lying to others to hide gaming activities</strong></li><li><strong>Exhibiting signs of irritation when forced to stop gaming</strong></li></ul>\n\n\n\n<p>If this sounds like you then you might be addicted to the virtual world videogame addiction can have real-world consequences for personal relationships with family and friends as well as physical symptoms such as carpal tunnel migraines and insomnia.<br></p>\n\n\n\n<p><strong><em>Are you or someone you LOVE “trading the virtual world for the real one.”?</em></strong></p>\n\n\n\n<p>Course will teach you all the necessary skills to deal with your videogame habit, allowing you to lead a much fuller, richer life in the real world rather than a digital one.</p>\n\n\n\n<p><strong>Is There a Cure for Video Game Addiction?</strong></p>\n\n\n\n<p>Treatment for video game addiction is similar to that for other addictions. <strong><em>Counseling and behavior modification are the primary means of treating addicted gamers. </em></strong>Together, individual and family counseling are powerful treatment tools. Some treatment facilities incorporate medication in their programs.</p>\n\n\n\n<p><em><strong>However, unlike drugs or alcohol, video games are tied to computers, which are a key part of life for most people.</strong></em> In that way, the addiction is similar to a food addiction. As a result, some treatment centers explore controlled use rather than abstinence.</p>\n\n\n\n<p>By the end of this course you will have a solid foundation of knowledge to deal with this unique addiction. Our suggested strategies are based on Cognitive Behavioral Therapy Treatment... One of the top and Doctor recommended Therapies for Video Game Addiction.</p>\n\n\n\n<p><strong>This course could easily sell for hundreds of dollars. I personally know of Psychologists out there who are charging hundreds per hour, even thousands of dollars for a fraction of the information contained in this Udemy Course.</strong></p>\n\n\n\n<p><strong><em>As with all my courses:</em></strong></p>\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently <strong><em>$ 20</em></strong>, but will next increase to <strong><em>$ 50</em></strong></li><li>You have unlimited lifetime access at no extra costs ever !!!</li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30-day money back in full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n<p><strong>PSS: Do you really want to overcome your Video Game Addiction and or Help a Family member overcome their addiction? </strong></p>\n\n\n\n<p>PSSS: It will take hard work. It will take perseverance. But if you can honestly answer “Yes\" then there is no reason why you can't start Freeing yourself from this time-consuming addiction today.</p>\n\n\n\n<p>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the feedback from students.</p>\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "Video Game Addiction : Overcoming Video Game Addiction", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618898_0da1_2.jpg", 
    "course_url": "https://www.udemy.com/video-game-addiction-treatment/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-22T05:58:38Z"
}