{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \tHow can we build stronger, more resilient communities? By developing leaders to transform and energise the people around them! This includes building capacity to integrate different perspectives and embrace diversity - as well as enrolling those who have traditionally felt excluded!  </p>  <p style=\"\">  \t Our projects have already reached over 30,000 learners. We are supported by the NZ UN Convention for Human Rights, UNESCO, The Todd and Tindall Foundations in our work with over 50 organisations.  </p>  <p style=\"\">  \t <span style=\"\">We aim to empower marginalized people and their families develop goals which will strengthen their identity as well as develop self-confidence. We can all aim for careers that we are passionate about and gain recognition whilst making the social impact we target.</span>  </p>  <p style=\"\">  \t<span style=\"\"></span>Watch audio-visual stories told by empowered community leaders as well as people who have been disenfranchised such as disabled people and their families or refugees and migrants who successfully overcame challenges and engaged on their leadership pathway. They collaborated with us to develop these learning units used by community leaders, educators, parents, support workers and students. In order to empower our communities, we need to encourage collaboration between education, community and social care,  </p>", 
    "end_date": null, 
    "title": "Virtual Role Models Focusing on Community Integration", 
    "price": 0, 
    "instructors": "Annick Janson, Viktorija Gorčakovaitė", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29365_5641_6.jpg", 
    "course_url": "https://www.udemy.com/virtualrolemodels/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-12T02:57:43Z"
}