{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Are you living the ultimate life of your dreams?</strong></p><p><strong>If not, read on...</strong></p><p>If you're <strong>frustrated</strong> about finally achieving the success you deserve or have even given up on your vision thinking it won't be possible, you're not alone.</p><p><em>What if you could create your life just the way you wanted in less than 30 minutes a day only by watching a short video?</em> Wouldn't that be awesome?!</p><p>**************************************************************************</p><p><strong>Over 600+ s</strong><strong>tudents enrolled in the first 24 hours of launch!</strong></p><p><strong>5 star reviews from students who absolutely love the system!</strong></p><p><strong></strong>**************************************************************************</p><p>The reason you're not living your dreams right now is that <strong>your reality in your mind is out-dated</strong>. It's programmed for your current lifestyle, and not for the dreams you want to attract in your life. </p><p><strong>The solution?</strong></p><p>You need to upgrade your internal software and constantly feed it powerful messages that will create lasting changes in your brain and accelerate you to success.</p><p><strong>Vision Videos</strong> help you to create your dream life by starting at the root of the cause of all things – <strong><em>your thoughts.</em></strong></p><p>Most people endlessly try to change their external circumstances first and realize they're never actually getting closer to their dreams. <em>Does that sound like you?</em></p><p>If it does, then don't worry…</p><p>...because this powerful technology will effortlessly program your subconscious mind to attract the ultimate life you've always strived for.</p><p>**************************************************************************</p><p><strong>Here's what some of my students have said:</strong></p><p><em>\"He's Got Everything Rolled Into One. </em><em>I've been involved in self improvement for most of my life but in this course my eyes have really been opened to the max. Gabriel packs this training with a comprehensive list of resources (mostly free), and then he shows how to use these tools, make things personal to your own needs and then roll everything together to produce your own powerful video. A vision video that will propel yourself forward and improve your lifestyle, your relationships and your whole quality of life. Gabriel's presentation method is very easy to follow and understand. I recommend this five star training to anyone who wants to make more of themselves and their success in life.\"</em></p><p><em> <strong>-- David Ed Wilkes</strong></em></p><p><em>Gabriel has really put together a great resource for both newbies and experienced people alike who are interested in creating exciting powerful visions for their future. I can't wait to get more stuck into this course, but even from what I've seen I've taken away so much. Just the resources on finding and creating binaural beats alone to train your brain is worth investing time into the course as it saves (and has saved me) a lot of research time!</em></p><p><em>Enrol in this course if you want to understand the real \"secret\" behind The Secret.</em></p><p><em><strong> -- Hari </strong><em><strong>Kalymnios</strong></em></em></p><p><em>**************************************************************************</em></p><p>By applying this system everyday, you'll start seeing amazing things happen in your life to support you in manifesting your goals. Some you'll even call miracles!</p><p>So what can you lose? <strong>Nothing</strong>! But if you don't give it a try, you risk losing the possibility of never achieving your dreams.</p><p><strong>So take action and enroll now</strong> in the <em>Vision Video Mastery</em> course to start creating your ultimate life.</p><p>See you there!</p>", 
    "end_date": null, 
    "title": "Vision Video Mastery", 
    "price": "30.00", 
    "instructors": "Gabriel Both", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499078_c45d_2.jpg", 
    "course_url": "https://www.udemy.com/vision-video-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T16:05:09Z"
}