{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Please note: </strong><em>This course has been renamed from Life Success Using Visualization: Conceive, Believe, Achieve to Visualization Mastery 201, on June 23, 2015.</em></p><p>  \t                        Have you ever wondered how successful people do it? I mean, the ones who are doing it right ... not the ones who cheat the system and eventually end up in the news and jail. I'm talking about the people who are honestly living the good life. The ones who are positive, kind, and decent people who also happen to have tons of time, money, energy, happy relationships, health, and happiness.  </p>  <p>  \t                        How do all the things they have go from being just an idea in their head to their actual reality?  </p>  <p>  \t                        The secret to turning thoughts to things is to start at the core of it all—your thoughts and feelings. Or better yet I'll say your visualizations. Visualizations are powerful \"mind movies\" that are running through your head 24/7. </p>  <p>  \t                    Did you know you already have a daily visualization practice? The coolest part about this course is that you DO NOT have to carve out extra time from your day to do the activities. You can easily and <strong>quickly integrate them </strong>into the already existent flow of your day.</p>  <p>  \t                    The question is: Are you seeing more of what you want ... or, what you don't want in your life? </p><p>All you need to do to answer that question is <strong>look at your results</strong>. Results always tell the truth and more importantly, they tell us what beliefs we're spending our time emotionally investing in.  </p>  <p>  \t                    So, I have to ask ... \"Are you totally happy with your results—your health, wealth, and relationships? Or ... might there be some areas you'd like to improve?\"  </p>  <p>You CAN have all the stuff you want. Just imagine being able to create the incredible results that you truly desire in 30 days, 6 months, or even 1, 2, or 3 years.</p>  <p>  \t                This course teaches you the critical information you need to increase the results you want. <em><strong>It's strategically designed</strong></em> to help you master the first step—visualization—so you never again have to wonder how you're going to create all the cool stuff you want in life.  </p>  <p>  \t                        In the same way that historical greats like Henry Ford turned the idea of creating the reality of the car, you, too, can create at extremely high levels once you know <strong>how</strong> to organize your thoughts, and feelings, into the greatest creative tool on Earth—intentional focused vision. </p><p>In fact, if you don't have a vision, an idea, of what you want and where you're headed, you're probably experiencing stagnation in your life. Are you one of the many who talk about doing lots of stuff ... but never quite make it happen? If so, this course is for you. It's also for those who feel confused and frustrated that you're working really hard and not much is truly happening as you'd prefer.</p>  <p>  \t                        In this course, we're starting at the beginning with how to mold your thoughts and feelings into things. I'm walking you through 5 important categories: money, relationships, health, happiness, and success and showing you, step-by-step, how to change your average results into intentional, fun, and amazing ones.  </p>  <p>  \t                    Join me, and your fellow \"visioneers\", as we expose the longest standing mystery in personal development: how to turn your thoughts to real-life, tangible things you can see, hear, taste, touch, and smell helping you craft your incredible success!</p>  <p>  \t            Enroll today! Can't wait to see you in class. Remember ... there's a 30 day money-back-guarantee-no-questions asked so you've got nothing to lose (except maybe your awesome results by not giving it a go).</p>", 
    "end_date": null, 
    "title": "Visualization Mastery 201: Turn Thoughts to Things Today", 
    "price": "50.00", 
    "instructors": "Allison Sutter", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/416850_1bd4_8.jpg", 
    "course_url": "https://www.udemy.com/life-success-with-visualization-conceive-believe-achieve/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-08T23:30:32Z"
}