{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course I talk about my most important life-hacking practice that helps me achieve focus and results — waking up early and going through a consistent morning routine.</p><p><strong>I will help you see the benefit of waking up early and show you the practices early risers use to better themselves</strong></p><ul><li>Get in shape</li><li>Increase knowledge</li><li>Get projects done</li><li>Motivate yourself</li><li>Achieve your goals</li></ul><p><em>-----</em></p><p><em>Danny's description of his journey to make the most of his mornings was refreshingly open and honest. The strategies he uses include actionable steps that are both simple and realistic. After going through this course, I am inspired to reassess my own morning routine. Thanks Danny for a note-worthy course. — Autumn Gal Udemy review</em></p><p><em>-----</em></p><p><strong>Become an Early Riser</strong></p><p>Becoming an early riser gives you more time in the day to focus on routines or projects that you quite often would like to do, but never seem to have the time. By practicing this skill, you add time to your day to focus on what matters to you, before the busyness of the day sets upon you.</p><p>Getting up early has been the practice of many people through history. The comforts of modern mattresses have lured us to sleep in. But the reality today is that many of the most successful people and entrepreneurs have a consistent morning routine. You can do this!</p><p>-----</p><p><em>The biggest thing I appreciate about this course is, it is very practical. Danny understands that it is not easy. He lists the \"resistance\" you might face and also gives solutions. He also gives many options that you can implement right away. The most important thig is, it is not a lecture delivered from a \"high horse\". Danny is down to earth and explains everyday solutions for real problems. Very useful. Worth going through multiple times.</em></p><p>-----</p><p><strong>Content and Overview</strong></p><p>This course will explain the value of sleep and will show you that waking up early does not mean sacrificing the amount of sleep you get.</p><p>Most of the course lectures will highlight some of the most popular morning routines, and will show you how to adapt them to your life and goals. This course will discuss:</p><ol><li>Journaling and its benefits</li><li>Having written goals and written personal mission statement</li><li>Benefits of exercising in the morning</li><li>How to actually get up early</li><li>And so much more...</li></ol>-----<em>The course covers so much ground, from what to do, to how to do it, to motivation to do it. Great quality. Delivery interesting and engaging--personal examples that are compelling that I can easily relate to.</em><em> — Udemy review</em>-----<span></span>", 
    "end_date": null, 
    "title": "Waking Up Early: get in shape, focus, and achieve your goals", 
    "price": "30.00", 
    "instructors": "Danny Zacharias", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514790_3bbc.jpg", 
    "course_url": "https://www.udemy.com/waking-up-early/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T18:38:49Z"
}