{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p>\n\n\n\n<p><strong>HAVE YOU EVER FELT STUCK, OUT OF ANSWERS, AND COMPLETELY UNCLEAR ABOUT WHAT YOUR PRACTICAL NEXT STEPS SHOULD BE?</strong></p>\n\n<p><strong></strong>If this is you, Warrior Mindset contains an armoury of crucial life principles for big thinking people who aren't willing to give up or settle for the status quo. You'll discover an arsenal of insights for clearly identifying your problems, and a framework for overcoming them.</p>\n\n<p><strong>Throughout Warrior Mindset, you will learn how to:</strong></p>\n\n\n\n\n\n<ul><li>Identify and Change Your Habitual Response Patterns.</li><li>Face New Challenges With Greater Confidence &amp; Ease.</li><li>Reduce Your Need for the Approval of Other People.</li><li>Harness the Tools That Are Essential to Your Transformation in Times of Pressure.</li><li>Remove Your ‘Head Trash’ &amp; Harness the Tools That Cultivate Your Inner Freedom.</li><li>Develop Genuine Self Esteem &amp; Confidence That is Easily Recognised by Others.</li><li>Take the Initial Steps Towards a More Grounded, Fulfilling, and Rewarding Way of Life.</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Most people consider a health kick at times, but unfortunately, these often only offer us short-term results. Personal breakthrough begins with a revolutionary change in our thinking, our habits, and our degree of self-awareness.</p>\n\n\n\n\n\n<p>In this 65 part video course, Kain walks you through the process of looking beyond your circumstances, to understand your internal challenges and embrace the unexpected for finding your primary mojo in life. Then set it on Fire!</p>\n\n\n\n\n\n<p>You'll gain clarity for your future, and a 'Supercharged' mindset for overcoming your greatest challenges with more confidence and ease. By learning the principles of a Warrior Mindset, you'll get your personal breakthrough, and find the inner freedom to enjoy it.</p>\n\n\n\n\n\n<p><strong><em>Warrior Mindset comes with a Full Money Back Guarantee, and if you're less that 100% satisfied, you can get a full refund within 30 days of purchase.</em></strong></p>", 
    "end_date": null, 
    "title": "Warrior Mindset: The Ultimate Personal Breakthrough Formula", 
    "price": "25.00", 
    "instructors": "Kain Ramsay", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/343262_d6a4_12.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-personal-breakthrough-programme-full-version/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-13T14:38:23Z"
}