{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><em><em><em><strong><em>LATEST: Course Updated Again for May  2016</em></strong></em></em></em></em></p>\n\n<p><strong>STOP COASTING THROUGH LIFE UNNOTICED. BECOME THE ULTIMATE GENTLEMAN </strong><strong>YOU CAN BE!</strong></p>\n\n\n\n<p>At some point, every man has wished to be a GENTLEMAN. But few know what it takes to remake themselves into the ultimate man.<strong>THAT'S ALL ABOUT TO CHANGE.</strong><br></p>\n\n<p><strong>The Art of Being A Gentleman: Classic Skills and Manners for the Modern Man.A Contemporary Guide to Common Courtesy is your Solution to Turning your Fantasy of Sophistication into a Reality!!</strong></p>\n\n\n\n<p>Being a gentleman has become something of a lost art in recent generations and the time has now become associated (quite sadly) with males that are in such with their sensitive sides and are not as aggressive or masculine as other men when in fact, being a true gentleman means being in touch with both your sensitive and masculine sides and knowing when and how to use both of them appropriately.</p>\n\n\n\n<p> Nothing is kept secret - I reveal all I know ... and as I test even more\n things, those that are successful are added to the course - <strong>at no extra cost to you</strong>! This is a course that will continue to grow and grow.  </p>\n\n\n\n<p>\n  \t                                                                     \n                                                           As well as \nthe Udemy 30 day guarantee, you have my personal promise that you will \nbe wowed and delighted by what you'll learn in the next 3 to 4 hours ...\n and <strong>you'll be kicking yourself if you already have a Udemy course</strong></p>\n\n\n\n<p><strong>NO GIMMICKS, NO TRICKS, NO SCI-FI GADGETS. ALL EASY TO IMPLEMENT INFORMATION TO HELP YOU UNLOCK YOUR FULLEST POTENTIAL.</strong><br></p>\n\n\n\n<p>If you don't think this is true, then just look at men like Teddy Roosevelt, Abraham Lincoln, Ernest Hemingway, Winston Churchill and a host of others as examples. All of these men could go from hunting in the backwoods in their favorite worn-out shirt to a diplomatic dinner or cocktail party and be just as comfortable in each environment.</p>\n\n\n\n<p><em><strong>Give yourself a fresh start by enrolling in this life-changing course now. Every moment you delay, you lose out. Simple as that.</strong></em></p>\n\n\n\n<p>And just because someone does not have formal schooling or an understanding of global politics, this does not mean that they are any less of a gentleman being a gentleman is all in the way you carry yourself a true gentleman. Always have self-confidence and a willingness to step out of their comfort zone and try new things and they treat others, regardless of religious belief, political affiliation or lifestyle with respect and kindness.</p>\n\n\n\n<p>Upgrade Your Life! Become A True Gentleman Today! <strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you money...Scroll up and Enroll Now!</strong></p>\n\n\n\n<p><em>So if you are looking to understand what it takes or to become a true gentleman yourself than walking the manly path is definitely for you. It will teach you the basics of everything that you need to know to carry on the fading tradition of classic gentlemanly behavior.</em></p>\n\n\n\n<p><strong>What You Will Learn With This Course:</strong></p>\n\n\n\n<p><strong>1) The essence of politeness and respect and learning still the difference between respect and fear. And why it's important to respect your elders and women.</strong></p>\n\n\n\n<p><strong>2) How to carry yourself with confidence and be comfortable in your own skin, and the goals for </strong>your<strong> life's journey.</strong></p>\n\n\n\n<p><strong>3) How to embrace both your sensitive and masculine sides and to appreciate each one and understand why and how they make you a well-rounded person. You will also learn when it is appropriate to use your masculine or sensitive side.</strong></p>\n\n\n\n<p><strong>4) You will learn the different styles of casual dress, from formal casual to business casual and of course, how to wear and size a formal suit and even the two most convenient ways to tie a necktie.</strong></p>\n\n\n\n<p><strong>5), you will of course learn how to treat a young lady with courtesy and politeness on your first date. You will learn the basic etiquette of getting and manners to help you make the best first impression possible to build a solid foundation for a relationship of trust and respect.</strong></p>\n\n\n\n<p><strong>6), you will learn to understand body language and the signals and secret communications that people are constantly sending each other. The skill of reading body language will give you an edge in every aspect of life, from romantic interludes to the board room.</strong></p>\n\n\n\n<p><strong>7), you will learn some of the most important things that every gentleman should carry with them in their pocket, and how these simple tools can help you solve a wide variety of small to intermediate problems that you may encounter during the life.</strong></p>\n\n\n\n<p><strong>8), you will learn how to communicate with people in a respectful, honest and honorable manner and to conduct yourself with dignity and self-respect, regardless of the situation that you may find yourself in.</strong></p>\n\n\n\n<p><strong><strong>Is This Course For You ?</strong></strong></p>\n\n\n\n<p>This class is for men who are looking to rekindle the long-lost art of manliness and gentlemanly behavior to carry on the traditions of their grandfathers and great grandfathers and learn self-confidence, and how to treat the world. With respect and dignity and honor and earn respect and earn the respect and honor of all those they meet.</p>\n\n\n\n<p><strong>As with all my courses:</strong></p>\n\n\n\n<ul><li>The initial low price will increase shortly - the course is currently <strong>$ 20</strong>, but will next increase to <strong>$ 50</strong></li><li><strong>You have unlimited lifetime access at no extra costs ever !!!</strong></li><li>All future additional lectures, bonuses, etc in this course are always free</li><li>There's an unconditional, never any questions asked full 30 day money back in full guarantee</li><li>My help is always available to you if you get stuck or have a question - my support is legendary in Udemy.</li></ul>\n\n\n\n<p><strong>This will be a truly interactive course with additional bonus routines added over the course of the first year, inspired by the feedback from students.</strong></p>\n\n\n\n<p><strong>Click the \"Take This Course\" button, on the top right because every hour you delay is costing you your Dream...Scroll up and Enroll Now!</strong></p>", 
    "end_date": null, 
    "title": "What Every Young Man Should Know about Being a Gentleman", 
    "price": "20.00", 
    "instructors": "Brian Cliette", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403678_1d20_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-gentleman/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T17:48:06Z"
}