{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Worum geht es in diesem Kurs?</strong></p>\n\n<p>Dieser Kurs lehrt dich, wie du eine Schamanische Reise machst, um dein Krafttier zu finden, und wie du es zurück in dein Leben bringst. Du wirst außerdem lernen, wie du Kontakt zu deinen Spirituellen Lehrern bekommen kannst, und wie du Antworten auf deine Fragen erhältst. </p>\n\n\n\n<p>Vielleicht hast du das schon mit Hilfe von Meditationen versucht, aber es hat nicht so wirklich funktioniert, weil du vielleicht Schwierigkeiten hast, zu meditieren. </p>\n\n\n\n<p>Eine Schamanische Reise ist eine spirituelle Praktik, und es ist ein Weg die spirituellen Reiche zu erforschen. Es ist ein Weg mit spiriituellen Tieren, Führern, Krafttieren, verlorenen Seelenanteilen, Engel, Vorfahren, oder verstorbenen Schamanen Verbindung aufzunehmen. Du kannst hier mehr über dich selbst herausfinden, oder Informationen, Heilung, Weisheit, Wissen und Führung für dein persönliches Leben erfahren. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Wie lange dauert dieser Kurs?</strong></p>\n\n\n\n<p>Schamanisches Reisen ist nicht kompliziert zu erlernen. Ich zeige es dir in einer Art und Weise, dass du dein neues Wissen schnell und sicher praktisch umsetzen kannst.</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Welches Material ist im Kurs enthalten?</strong></p>\n\n\n\n<p>Du wirst verschiedene geführte Meditationen und Trommel Musik herunterladen können, sowie Handbücher, so dass du nichts extra aufschreiben musst. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Wie ist der Kurs strukturiert?</strong></p>\n\n\n\n<p>Meinem Kurs ist einfach zu folgen, ohne es kompliziert zu machen. Mein Motto ist: Halte es einfach. </p>\n\n\n\n<p>Und sei auch aufgeregt und freu dich auf den Bonus!</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Warum solltest du den Kurs machen?</strong></p>\n\n\n\n<p>Wenn du dich mit deinen spirituellen Lehrern, deinen spirituellen Tieren, deinen Krafttieren, Engeln, Vorfahren und verstorbenen Schamanen verbinden möchtest, oder wenn du mehr über dich selbst herausfinden, oder Antworten auf deine Fragen erhalten möchtest, dann kann eine schamanische Reise sehr hilfreich sein. </p>\n\n\n\n<p>In diesem Kurs liegt der Fokus darauf, dein Krafttier zu finden, und es in dein Leben zurück zubringen, so dass du mehr Energie und Inneren Frieden erleben kannst. </p>\n\n\n\n<p>Bonus: Du lernst auch wie du dich mit deinen Spirituellen Lehrern verbinden kannst, und wie du Antworten zu deinen Fragen bekommst. </p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Voraussetzung</strong></p>\n\n\n\n<p>Es wäre gut, wenn du schon Erfahrung mit Meditation oder Energie Arbeit hast, es ist aber nicht unbedingt notwendig. Wichtig ist offen für neue Erfahrungen zu sein. </p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Wie man eine schamanische Reise macht", 
    "price": "25.00", 
    "instructors": "Daniela Hills", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790662_7e6a_2.jpg", 
    "course_url": "https://www.udemy.com/wie-man-eine-schamanische-reise-macht/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T15:52:06Z"
}