{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How to Increase Your Willpower and Productivity for a More Successful Life: The Step by Step Program.</p>\n\n<p>I’m Rafael Cintron, the founder of the Life Development Academy. I dedicate myself to help people achieve success and fulfillment in life. Through my research and work with many people of different backgrounds and lifestyles, I’ve managed to see a pattern of unfulfillment in people due to their lack of willpower. Due to the lack of willpower, people feel that they just can’t get things done in their life and achieve what they want to achieve.</p>\n\n<p><strong>What will you learn in this course? </strong></p>\n\n<ol><li>How to create a powerful morning and be able to get more things done during your day.</li><li>How to encourage and motivate yourself to achieving goals in your life.</li><li>How to increase your overall willpower and stay on track in your life dreams and aspirations.</li><li>How to find people that will help and support you in every step of the way</li><li>How to believe that you are capable of achieving and creating a more productive life</li><li>The exact behaviors that you need to ensure your willpower is at the highest level</li><li>How to avoid a burn-out from work and create a general life balance</li></ol>\n\n<p><strong>Why should you trust me? </strong></p>\n\n<p>Through my daily videos in the Life Development Academy, I help people achieve their dreams and improve every single day. With this complete course, I’m finally able to create a step-by-step process to ensure you have more energy to build a better life. This course is one of the first on my entire Life-Developing Project. If you take this course I ensure that you will not be disappointed and will finish with a renewed look on life, work, and productivity. With this course, you will have the willpower necessary to make your goals a reality.</p>\n\n<p><strong>How does the course run? </strong></p>\n\n<p>The course is composed of 4 major chapters that will teach you the top areas of building willpower and ensuring more productivity. Each chapter consists of small topics broken down into simple guidelines to help you improve starting today.</p>\n\n<p><strong>Is this a final course?</strong></p>\n\n<p>No.Future courses will include other topics in Life Development and Motivation to help you even more and increasing your success and fulfillment in life. If you like the Increasing Willpower and Productivity Course, be sure to stay tuned for the next ones.</p>\n\n<p><strong>Thank you for choosing my course and have a great day! </strong></p>", 
    "end_date": null, 
    "title": "Willpower and Productivity Development: Step by Step Program", 
    "price": 0, 
    "instructors": "Rafael Cintron", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/831450_8861_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-increase-willpower-and-productivity-step-by-step/", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-25T15:31:55Z"
}