{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Live Unstoppable - 7 Steps to Soaring Transformation is a step by step process into the core of transformation. Your instructor Jacquelyn Jones, a Master Life and Business Strategist has studied, tested and combined the most profound teachings and brought them together in this unique comprehensive learning experience that is packed with repeatable, reliable tools and strategies for you to remove barriers and blocks that may be holding you back and guide you to create a life you love living; a life of unstoppable success in all areas of your life.</p><p>The 7 Steps to Soaring Transformation tunes you into your higher self and unleashes the glorious power within you to live your greatness. In this journey, you will be taken through the proprietary 7 step process in an easy to understand, hands-on, fun and engaging experience. Each of the 7 Steps has key lessons, tools, strategies and “life work&quot; exercise that ignite feelings, thoughts and new perceptions that bring forth shifts, and when applied to action, create miraculous and soaring transformation.</p><p>What you will learn is how to attain inner and outer success, a life of abundance and prosperity as well as an inner feeling of completeness that allows a fullness of life to dwell and expand from within you, and it all begins in your core.</p><p>So come along! Begin your journey to soaring transformation <strong style=\"\">NOW</strong>. You are in the right place. It&#039;s the right time. Don&#039;t wait another second…. A happier more abundant life is waiting for you. Join the movement, your success starts NOW!</p><p><strong style=\"\">Over 40 lectures and 4 hours of content!</strong></p><p><strong style=\"\">The 7 Steps to Soaring Transformation are...</strong></p><ul style=\"\"><li><strong style=\"\">Evaluate</strong> and take 100% responsibility</li><li><strong style=\"\">Evoke </strong>and discover your core desired feelings</li><li><strong style=\"\">Envision</strong> and create what you desire most in life</li><li><strong style=\"\">Engage</strong> and begin your journey of transformation</li><li><strong style=\"\">Expand</strong> and step-in to a higher vibration of being</li><li><strong style=\"\">Empower</strong> your mind and soar from your core</li><li><strong style=\"\">Emerge</strong> and celebrate your becoming</li></ul><p><strong style=\"\"><em style=\"\">Get Started Today! You Will Be So Glad You Did!</em></strong></p>", 
    "end_date": null, 
    "title": "WINGs Live Unstoppable - 7 Steps To Soaring Transformation", 
    "price": "35.00", 
    "instructors": "Jacquelyn Jones", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/494626_3ef7_4.jpg", 
    "course_url": "https://www.udemy.com/live-unstoppable-7-steps-to-soaring-transformation/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-05T23:42:53Z"
}