{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t    Do you manage your ego or does it manage you? How well do you understand the dynamics of ego and how it weaves itself within all human interactions? When acting as a business coach or life coach, it is imperative that you refine your understanding of ego. In fact, keeping your ego in check is a crucial skill not just for coaches. Anyone who manages leads, consults, guides, teaches, facilitates, partners or the like would be wise to keep their ego appropriately leashed and well behaved. This course is designed to support you to do just that.  </p>  <ul>  \t<li>It will ask you to take stock of how your own ego might be tripping you up.</li>  \t<li>It will offer you a boat-load of practical ideas on what you can do to better manage your ego.</li>  \t<li>You will also find ideas that you can apply to your personal and family life in terms of maintaining a better sense of balance between you and the people who are most important to you.</li>  </ul>  <p>  \t    This course is packed with about 120 minutes of valuable audio, video, and downloadable handouts.  </p>  <p>  \t    If you are seeking resource hours for your ICF (International Coach Federation) accreditation (Associated Certified Coach, Professional Certified Coach or Master Certified Coach) or renewal,this course is for you.  </p>  <p>  \t    Lyn Christian MCC, CFCC, founder of SoulSalt Academy, tapped into her experiences over the past 16 years as a coach, as well as accessing colleagues within the field of mBraining and Psychology, to bring you these insights on the topic of ego.  </p>", 
    "end_date": null, 
    "title": "You and Your Ego", 
    "price": "30.00", 
    "instructors": "SouSalt Academy", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/236726_5ece_2.jpg", 
    "course_url": "https://www.udemy.com/you-and-your-ego/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-03T21:56:53Z"
}