{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>You Only Have One Life - Is It Not Time To Make It Count?</p><p>Grab your notebook or journal and be prepared to take lots of notes. You are going to learn exactly how to finally take charge of your life.</p><p>Discover exactly what you want in life by firstly determining exactly where you are in life currently. By taking stock of where you are first, you can then work on creating an ideal life vision for yourself.</p><p>You will be shown exactly how to determine what success means to you (success means different things to everyone)</p><p>You are about to learn how to create a detailed, clear plan for your life and how to set goals and mini-goals so you actually can start getting on track to achieving your ultimate life.</p><p>You have this one life, and life is so short, so lets make it count. You will be shown how to overcome setbacks and also how to bounce back quickly if you encounter similar setbacks again.</p><p>This course comes with a 30 day money back guarantee so enroll today and get started!</p><p> <br></p>", 
    "end_date": null, 
    "title": "You Only Have One Life: How To Live a Life Full of Passion", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660860_1ea6_3.jpg", 
    "course_url": "https://www.udemy.com/self-improvement/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T07:00:03Z"
}