{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you want to understand the deeper secrets of who we are? </strong><br></p><p><strong>Do you want a greater degree of control over your life and the ability to heal blocks and wounds that you may not yet even be aware of?</strong></p><p><strong>That's what this course is about.</strong></p><p>You see, you are MORE than just a physical body.</p><p>You have an energy body as well - and this energy body determines how you feel, how people respond to you, and literally creates your reality.<br> </p><p>This course is an in-depth dive into one of the most practical systems of spirituality, and this course will explain how the health of your energy body affects every part of your life. This course will empower you to heal blockages in your energy body, regain your balance in areas of your life that need attention, and gain a deeper appreciation for yourself and others.</p><p>By taking the Indian wisdom of the 7 chakras(energy centers) and applying this knowledge in practical ways for the 21st century, this course will give you a greater level of self mastery and an ability to heal, and a deeper understanding of HOW the health of your energetic body is creating your reality.</p><p>This is a master class, and includes over 7 HOURS of HD Video Content. This is for individuals who are excited about developing self mastery and inner healing abilities. This course is also meant to be HIGHLY entertaining, as I deliver content in my engaging and often irreverent style that highly contrasts with more traditional 'boring' spiritual teachers. </p><p>Are you ready to join me on a journey within?</p><p><br></p>", 
    "end_date": null, 
    "title": "Your 7 Chakras : The Complete Guide to Your Energy Body", 
    "price": "50.00", 
    "instructors": "Alexander Fairman", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/764686_2a53_2.jpg", 
    "course_url": "https://www.udemy.com/the-chakra-system-master-class/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T20:05:19Z"
}