{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>\"I find this course very helpful in redefining my life purpose and all the small steps I have to complete on the journey. I will be coming back to it, enjoying the Yoga Nidra meditations to find out about other long tetm and short term sankalpas considering my life. I highly reccommend this course to people who feel confused with what they would love to do in their lives and what they do or are supposed/ forced to do for different reasons.</em><br></p>\n\n<p><em>Thank you so much Sharon for sharing your deep knowledge with us!\"</em> by M Kawka</p>\n\n\n\n<p>Do you identify with Bono singing in the U2's song, <strong>\"I still haven't found what I'm looking for.\"</strong>? Then this life purpose course is for you. Prepare for personal transformation, you have the ability to<strong> engage in a deep spiritual way that will empower and transform your life</strong>. You will learn very specific Yoga Nidra Meditation techniques to discover your life purpose..  Be patient as Rome was not built in a day! Do the ground work and you will be rewarded.</p>\n\n\n\n<p><strong>Why are we on this planet and what are we really meant to be doing</strong><em>? What is this thing called 'life purpose' and 'personal transformation'. </em><em>Every being is intended to be on earth for a certain purpose.\" </em> Sa'di, 12th Century Persian poet</p>\n\n\n\n<p>Everyone feels a pull towards some defining <strong>life purpose</strong>, no matter how much it may have become shrouded over along the way. Personal transformation begin with you taking the first step to realise your absolute potential.</p>\n\n\n\n<p>There are consequences to not knowing or finding your <strong>life purpose</strong>. People describe feeling \"off-track\" in some way, or incomplete, despite a conventionally successful life. Sometimes they wonder if they've been on the \"wrong\" path all along, chosen the wrong career, or life partner. Or that perhaps they haven't realized that their chosen path could be more meaningful or purposeful for them. This can bring an absence of inner peace and a sense of not being fully in sync with the inner self. The path to personal transformation begins here and now.</p>\n\n\n\n<p><strong>This course helps you to discover our Heart's Desire - your Life Purpose</strong></p>\n\n\n\n<p>This <strong>personal transformation</strong> life purpose course is designed in building blocks. Please, take one step after the other, do not skip forwards or backwards. For the best possible outcome commit and do it in the sequence it is presented in. It is time for you to stop struggling. For the primary purpose of every human being is simply to be: fully engaged in this moment, and aligned with the natural flow of reality itself.</p>\n\n\n\n\n\n<ul>\n<li>The beauty of effortless being, and how to awaken to it through Yoga Nidra</li>\n<li>Tapping the vast power and intelligence of stillness within Yoga Nidra Unfolding your purpose through actions in alignment with the timeless present.</li></ul>\n\n\n\n<ul><li>We will use a combination of ancient yogic philosophy with it's treasure trove of wisdom to draw us into the mysteries of the heart and how to use this wisdom today.</li><li>Integration workbook exercises to enable deep reflection on the meditations and knowledge revealed to you. This will assist you in a practical reflective life purpose discovery tool.</li><li>This course is designed to be self-paced, however a regular commitment is required for you to gain the skills to remain relaxed and focused on your purpose even if inner confusion and conflict arises. This will help you become the co-creator of your life purpose, with personal transformation events and challenges unfolding with a new found grace and ease.<em>                                                                                                     </em></li></ul>\n\n<p>Not sure? Scroll down there are free previews for you to get a taste of what is to come<br></p>\n\n\n\n<p>Enrol with confidence! Your enrollment is backed by Udemy's 30 Day, no questions asked, money back Guarantee!</p>\n\n\n\n<p><em>The material   on this web site is provided \nfor educational purposes only,  and is not   to be used for medical \nadvice, diagnosis or treatment</em><br></p>", 
    "end_date": null, 
    "title": "Your Life Purpose Revealed Through Yoga Nidra", 
    "price": "25.00", 
    "instructors": "Sharon Ramel", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/452884_953d_8.jpg", 
    "course_url": "https://www.udemy.com/realise-your-life-purpose-connect-with-your-hearts-desire/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-21T07:06:14Z"
}