{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong></p><ul><li>This course is taught by a <strong>personal development consultant with 15 years of experience</strong></li><li><strong>20'000 satisfied students</strong> enrolled in my courses</li><li><strong>300+ TOP reviews</strong> in my courses</li><li><em><strong>30 Money Back Guarantee</strong> - You have 30 days to watch the course and decide if that's for you</em></li><p><em>LATEST: Course Updated November 2015</em></p><p>Most people think they still have a lot of time to live their dreams and they wait...Then what happens is that people end up with huge regrets at the end of their lives. This course aims to overcome this challenge by discussing the top 5 regrets that people have in life and how to avoid them so you can live an amazing &amp; fulfilling life.</p><p><strong>Learn The Top 5 Regrets Of People In Life &amp; How To Avoid Them</strong></p><li>Find your true life purpose</li><li>Live a life true to yourself</li><li>Learn to save many hours per day</li><li>Learn to be more productive</li><li>Boost your confidence &amp; self image</li><li>Learn social skills secrets</li><li>Learn to be happy everyday</li><p><br></p></ul><p><strong>Live An Amazing Life By Avoiding The 5 Top Regrets People Have In Life</strong></p><p>Bronnie Ware is an Australian nurse who spent years taking care of people at the end of their lives. By talking to them, she discovered the top 5 regrets of people.<br></p><p>In this course, you will learn what the 5 top regrets people have in life are and you will also learn tools &amp; techniques to avoid having those regrets so you can live an extraordinary life!</p><p>You will learn how to live a life true to yourself and unleash your inner potential. You will discover your true purpose in life, know who you are &amp; know your strengths, discover what your values are, create an action plan for your life &amp; learn 5 secrets to create a successful life. You will then walk through the world with ease.</p><p>You will learn how \"not to work so hard\". You will learn how to balance your life so you can live without regrets, how to save many hours per day and how to do more by doing less. You will then be super productive and you will have time to do the things you love!</p><p>You will learn how to express who you really are. I'll show you how to kill you inner fears, teach you how to show your true self, help you increase your self confidence &amp; self image and also share with you an expression model to express what you really want in life. You will then be someone of integrity.</p><p>You will learn many social skills secrets &amp; communication tools to become socially successful and live a life of social success!</p><p>The last section will show you how to really be happy everyday!</p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "Your Extraordinary Life: How To Live A Life With No Regrets", 
    "price": "20.00", 
    "instructors": "Alain W.", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633502_3515_9.jpg", 
    "course_url": "https://www.udemy.com/be-your-own-hero/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T12:47:54Z"
}