{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Actualizado: Octubre, 2015</p><p><strong>INSCRÍBETE EN ESTE CURSO GRATIS del 19 al 31 de Octubre 2015! APROVECHA! Usa el código GRATIS.</strong><strong></strong><br></p><p>Únete a los más de 600 estudiantes de este Programa! Esto es lo que están diciendo de este <strong>CURSO INTRODUCTORIO</strong>:<br></p><p><em><strong>\"Muy bien estructurado y sus explicaciones son claras\"</strong></em> ~ Edgar Valdivieso</p><p><em><strong>\"El curso no tiene desperdicios, espero que quienes recién comienzan la búsqueda hacia sí mismos puedan hallarse a través de tus palabras, tan generosas y constructivas.\" </strong>~ </em><em>María Elena Brero</em></p><p><em><strong>\"Me ha hecho tomar conciencia de mi estilo al expresarme y a comprender algunas de mis reacciones tanto en mi vida personal como laboral.\" </strong>~ </em>Yosi Warren</p><p><em><strong>\"</strong><strong>Un buen aperitivo. Como en una buena comida, un buen aperitivo deja un grato sabor en el paladar e invita al plato fuerte que le sigue.\" </strong>~ </em>Peter Peter</p><p><em><strong>\"Excelente introducción del curso de EL PODER DE CONFIAR EN TI …/… Esta técnica me ha ayudado a sentir mayor confianza en lo que hago y en como me expreso.\" </strong>~ </em>Rodolfo Array</p><p><em><strong>\"</strong><strong>Es una manera muy sutil de guiarnos a ese camino de asertividad para hacernos mejores seres humanos en este día tras día que muchas veces nos arropa y que debemos aprender a manejar.\" </strong>~ </em>Carmen Karina Arasme</p><p><em><strong>\"Es bastante básico, pero siendo apenas una introducción, tiene lo que necesita …/… Te felicito Gisela por tu estilo tan claro de explicar lo que enseñas. No todo instructor tiene este don…\" </strong>~ </em>Luis Carlos Gomez</p><p><strong>¿Y TÚ?</strong></p><p>•\t¿Quieres fortalecer tu confianza en ti mismo/a? </p><p> •\t¿Quieres <strong>GANAR</strong> en la vida… en vez ser un “perdedor\"? </p><p> •\t¿Quieres aprender cómo dejar de ser complaciente con los demás en vez de satisfacer tus propias necesidades? </p><p> •\t¿Te sucede que muchas veces dices “SÍ\" cuando quieres decir “NO\"…. o dices “NO\" cuando quieres decir “SÍ\"? </p><p>   Si has respondido afirmativamente a cualquiera de estas preguntas ¡este curso es el correcto para ti!    Te doy la bienvenida al <strong><em>Curso Introductorio del Entrenamiento en ASERTIVIDAD</em></strong>, una forma acertada de <strong>SER y de VIVIR</strong> tu vida que te produce cada vez mayores satisfacciones personales y te conduce al logro de tus metas en los diversos contextos de tu vida, convirtiéndote en un <strong>GANADOR / GANADORA.</strong> </p><p>    Cuando eres y te expresas como una persona asertiva, desarrollas <strong><em>proactividad.</em></strong> No te sientas a esperar a que otros hagan las cosas por ti sino que tú sales a buscar y conseguir lo que quieres.    Lee lo que participantes que han hecho el <strong>Curso Completo de Asertividad</strong> han manifestado para que sepas lo que TÚ PUEDES LOGRAR: </p><p>   •\t <em>“Me atrevería a decir que es <strong>uno de los cursos más poderosos que he tomado</strong>. No solo Gisela Echeverría demuestra total pasión y conocimiento por el tema sino que ha diseñado un curso magistral, utilizando herramientas interactivas y extrasensoriales a través de todo el curso…\" </em></p><p> •\t“<em><strong>Me ha ayudado muchísimo a plantearme mayores retos y superar expectativas de mis jefes en busca de mi crecimiento profesional</strong>. Lo recomiendo a todos aquellos con ganas de ser Exitosos!\"</em> </p><p> •\t<em>“He podido apreciar mis <strong>cambios en mi forma de pensar y actuar</strong> y siento mas confianza al relacionarme con otros\". </em></p><p> <em>•\t“<strong>Uno de los cursos más completos y útiles que he realizado en el tema de crecimiento personal\". </strong></em></p><p> <strong>•\t“U</strong><em><strong>n curso sumamente útil con una coach con quien es fácil comunicarse y compartir\". </strong></em></p><p><em> •\t<strong>“Uno de los cursos mas interesantes y productivos que he realizado en mi vida! Es una propuesta de trabajo interno absolutamente coherente y con posibilidades de aplicación inmediata.\"</strong> </em></p><p><em> •\t“La práctica de las destrezas asertivas <strong>han contribuido a desempeñarme mejor en mi trabajo,</strong> a interactuar mejor con mis clientes y proveedores, a ser una mejor profesional.\" </em></p><p>    Este <strong><em>Curso Introductorio de Asertividad</em></strong> es totalmente <strong>GRATIS,</strong> así que no tienes nada que perder al inscribirte y tomarlo…. Y más bien tienes <strong>MUCHO POR GANAR! </strong></p><p>    ¡Te invito a salir de tu <em>zona de confort </em>y a sorprenderte de todo lo que eres capaz de hacer y de lograr. </p><p>    <em><strong>“Locura es hacer lo mismo una y otra vez y esperar resultados diferentes\"</strong> </em>~ Albert Einstein</p><p> <strong>¡BIENVENIDO A LA FASE INTRODUCTORIA DEL ENTRENAMIENTO HOLISTA Y SISTÉMICO EN ASERTIVIDAD QUE CAMBIARÁ TU VIDA PARA MEJOR! </strong><br></p><p><strong>NOTA: Esta primera fase -Curso Introductorio- permanecerá GRATIS hasta finales del mese en curso. A partir del 1ro. Noviembre pasa a ser \"curso pago\". APROVECHA.</strong></p>", 
    "end_date": null, 
    "title": "¡Sé Un Ganador - Sé Asertivo! ~ Curso Introductorio", 
    "price": "20.00", 
    "instructors": "Gisela Echeverría G.", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/454260_6188_4.jpg", 
    "course_url": "https://www.udemy.com/se-un-granador-se-asertivo/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T00:18:43Z"
}