{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>INSCRÍBETE EN ESTE CURSO GRATIS del 19 al 31 de Octubre 2015! APROVECHA! Usa el código GRATIS.</strong></p><p>¡Únete a los más de 600 estudiantes del <em><strong>Programa Completo en Asertividad</strong></em>!</p><p>Algunos comentarios:</p><p><em>\"Uno de los cursos más interesantes y productivos que he realizado. Es una propuesta de trabajo interno absolutamente coherente y con posibilidades de aplicación inmediata.\"</em></p><p><em>\"Las destrezas asertivas han contribuido a desempañarme mejor en mi trabajo, a interactuar mejor con mis clientes y proveedores, a ser una mejor profesional.\"</em></p><p><em>\"Uno de los cursos más poderosos que he tomado. Toca lo más profundo de tu ser llevándote a un serio y responsable autoanálisis.\"</em></p><p><em>\"Me ayudó a conocerme mejor y descubrir cosas de mi personalidad. He apreciado mis cambios en mi forma de pensar y actuar; siento mas confianza al relacionarme con otros.\"</em></p><p><em>\"He estado aplicando las destrezas que aprendí en este curso y estoy asombrado de los resultados positivos que me han producido.\"</em></p><p>El <strong><em>Entrenamiento Holista y Sistémico en Asertividad</em></strong> es un proceso completo diseñado para dotarte de una sólida Auto-Confianza que te motive a vivir una Vida Asertiva. Comprende Tres Fases:</p> <ul><li><strong>Curso Introductorio: Estableciendo Las Bases del Proceso</strong></li> <li><strong>Curso Intermedio: Del Auto-Conocimiento a la Auto-Confianza</strong></li> <li><strong>Curso Azanzado: El Poder de Confiar en Ti y de Ser Asertivo</strong></li></ul> <p>Estás en el <strong>CURSO INTERMEDIO</strong> del programa. Incluye un Manual de Trabajo o <em><strong>Cuaderno de Bitácora</strong></em> con todos los ejercicios que debes realizar.</p><p>¿Qué es Ser Asertivo? En términos generales, una <strong>PERSONA ASERTIVA</strong> confía en si misma; piensa, siente y se expresa positivamente, con decisión y firmeza. Tiene claro lo que quiere y lo que no quiere; es capaz de sobreponerse a sus miedos siendo proactiva al plantear apropiadamente lo que desea o necesita para que sus demandas sean satisfechas.</p><p>Si no has realizado el <strong>Curso Introductorio<em>,</em></strong><em> </em>¡NO ESPERES MÁS! ¡Es GRATIS! Y para los estudiantes, este <strong><em>Curso Intermedio </em></strong>y el <strong><em>Curso Avanzado</em></strong> tienen el precio mínimo establecido por Udemy para sus cursos.</p><p>¡Un Ganador nunca posterga sus decisiones! ¿Eres tú un Ganador?</p><p>Al inscribirte en este curso adquieres como <strong>Bono</strong>:</p><ul><li>Copia en PDF de mi libro \"Más Allá de una Buena Historia\"</li><li>Participación en video-reuniones conmigo.</li><li>Oportunidad de participar en rifas en las que puede ganar: cupones especiales para realizar cualquier de mis cursos GRATIS, una consulta privada en vivo conmigo.</li><li>Otros bonos que serán anunciados oportunamente. </li></ul>", 
    "end_date": null, 
    "title": "¡Sé Un Ganador - Sé Asertivo! ~ Curso Intermedio", 
    "price": "35.00", 
    "instructors": "Gisela Echeverría G.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/533008_d58f_3.jpg", 
    "course_url": "https://www.udemy.com/se-un-ganador-se-asertivo-curso-intermedio/", 
    "currency": "USD", 
    "subject_name": [
        "Personal Transformation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-20T17:53:54Z"
}