{
    "selfpaced": false, 
    "topic_name": [
        "Artificial Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    ¿Te interesa la visión por computador? ¿Te gustaría conocer qué métodos puedes utilizar para detectar y reconocer objetos en una imagen? \n\nEn este curso te introducirás en los principios básicos de cualquier sistema automático de detección y reconocimiento de objetos en imágenes. A lo largo del curso analizaremos diferentes métodos de representación y clasificación que te permitirán abordar casos de aplicación de complejidad creciente.\n\nEl contenido del curso se estructura a partir de un esquema básico de detección y reconocimiento de objetos que sirve de guía para ir introduciendo tanto los diferentes métodos de extracción de características y representación de la imagen como diferentes alternativas para clasificar una imagen y para localizar todas las instancias de un objeto en la imagen. El temario incluye conceptos básicos de formación de la imagen, la convolución y su aplicación a la detección de contornos, características de regiones, descriptores de imagen (Local Binary Pattern, Histogram of Oriented Gradients, características de Haar) y varios métodos de clasificación (clasificador lineal, Support Vector Machine, Adaboost, Random Forest, Convolutional Neural Network).\n\nFinalizar el curso te permitirá:\n•\tDiseñar, a partir de un esquema básico común, soluciones adaptadas para diferentes problemas de detección y reconocimiento de objetos en una imagen,\n•\tConocer las principales técnicas para la descripción y clasificación de una imagen,\n•\tConocer las herramientas que permiten el desarrollo de aplicaciones reales de detección y reconocimiento de objetos, para que seas capaz de desarrollar tus propios sistemas de detección y reconocimiento de objetos en múltiples aplicaciones.\n\nEl curso está orientado tanto a estudiantes universitarios de algún grado relacionado con la informática, la ingeniería o las matemáticas, como a otros estudiantes con conocimientos de programación, interesados en aprender cómo utilizar técnicas de visión por computador para extraer información de las imágenes. \n\nINICIO: 1 de Diciembre de 2015\n\n                                            Syllabus\n                        INTRODUCCIÓN A LA DETECCIÓN DE OBJETOSEn esta primera semana explicaremos los fundamentos de un detector de objetos. Empezaremos introduciendo los conceptos básicos de la formación y el análisis de imágenes, para aplicarlos en el diseño de detectores simples basados en las características de los píxeles de la imagen. Finalmente, explicaremos los conceptos de correlación y convolución y veremos cómo se pueden utilizar en la detección de objetos.CLASIFICACIÓN DE OBJETOSEn esta semana explicaremos el concepto de clasificador de ventana como forma de decidir si una ventana candidata contiene una instancia del objeto que queremos detectar o no. Lo ilustraremos utilizando LBP como descriptor de la imagen y la regresión logística cómo método de clasificación. Nos fijaremos tanto en la parte de aprendizaje del clasificador como en su utilización para determinar el contenido de una ventana.DETECCIÓN DE OBJETOSEn esta semana nos centraremos primero en la fase de detección de posibles candidatos en la imagen. El conjunto de candidatos que se detecten serán analizados por el clasificador que explicamos en la semana 2 para determinar la presencia del objeto. \nAdemás, explicaremos también los pasos necesarios para poder preparar correctamente todos los datos que se utilizan en el aprendizaje y evaluación del detector. Finalmente, veremos cómo podemos evaluar de forma objetiva el rendimiento del detector.\nDETECTOR BASADO EN HOG/SVMEn esta semana veremos un segundo ejemplo de sistema de detección de objetos que se basará en la utilización de HOG como descriptor de la imagen y SVM como clasificador. DETECTOR BASADO EN HAAR/ADABOOSTEn esta semana veremos un tercer sistema de detección basado en las características de Haar para describir la imagen y Adaboost como clasificador. Para poder explicar las características de Haar explicaremos también el concepto de imagen integral. Veremos cómo entrenar un clasificador con Adaboost que nos permita seleccionar el mejor subconjunto de las características de Haar. Finalmente, explicaremos cómo combinar varios clasificadores en una cascada para poder implementar un sistema completo de detección.TÉCNICAS AVANZADASEn las semanas anteriores hemos visto los métodos más habituales para la detección de objetos. En esta última semana explicaremos algunas técnicas más avanzadas que se pueden utilizar en diferentes fases de la detección y que pueden ser útiles en problemas de detección más complejos. Entre estas técnicas están los modelos no holísticos (DPM, Random Forests), métodos de adaptación de dominio, la utilización de redes neuronales convolucionales, explotar la multi-modalidad en las imágenes y técnicas alternativas para la generación de candidatos.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Detección de objetos", 
    "price": 0, 
    "instructors": "Antonio López Peña, Ernest Valveny and Maria Vanrell", 
    "institution_name": [
        "Universitat Autònoma de Barcelona (Autonomous University of Barcelona)"
    ], 
    "commitment": "6-8 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/deteccion-objetos", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}