{
    "selfpaced": false, 
    "topic_name": [
        "Artificial Intelligence"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/nlpintro\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/nlpintro-001/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    nlpintro-001\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course provides an introduction to the field of Natural Language Processing. It includes relevant background material in Linguistics, Mathematics, Probabilities, and Computer Science. Some of the topics covered in the class are Text Similarity, Part of Speech Tagging, Parsing, Semantics, Question Answering, Sentiment Analysis, and Text Summarization.\nThe course includes quizzes, programming assignments in Python, and a final exam.\n\nCourse Syllabus\n\nWeek One (Introduction 1/2) (1:35:31)\nWeek Two (Introduction 2/2) (1:36:26)\nWeek Three (NLP Tasks and Text Similarity) (1:42:52)\nWeek Four (Syntax and Parsing, Part 1) (1:48:14)\nWeek Five (Syntax and Parsing, Part 2) (1:50:29)\nWeek Six (Language Modeling and Word Sense Disambiguation) (1:40:33)\nWeek Seven (Part of Speech Tagging and Information Extraction) (1:33:21)\nWeek Eight (Question Answering) (1:16:59)\nWeek Nine (Text Summarization) (1:33:55)\nWeek Ten (Collocations and Information Retrieval) (1:29:40)\nWeek Eleven (Sentiment Analysis and Semantics) (1:09:38)\nWeek Twelve (Discourse, Machine Translation, and Generation) (1:30:57)\n\n\nThe course assignments will all be in Python.\n\n\nCourse Format\n\nThe class will consist of lecture videos, which are typically between 10 and 25 minutes in length. The lectures contain 1-2 integrated quiz questions per video. Grading is based on three programming assignments, weekly quizzes, and a final exam.\n\n                                    ", 
    "end_date": "9999-12-31T23:59:59Z", 
    "title": "Introduction to Natural Language Processing", 
    "price": 0, 
    "instructors": "Dragomir Radev", 
    "institution_name": [
        "University of Michigan"
    ], 
    "commitment": "7-10 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/nlpintro", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-07-04T00:00:00Z"
}