{
    "selfpaced": false, 
    "topic_name": [
        "Artificial Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    Pervasive sensing and mobile platforms, advanced algorithms, and next generation robotics are making our environments more responsive, intelligent and automated. This technological change is transforming the industry landscape as never before, and organisations need to better understand the disruption that lies ahead. This unique module will ensure you stay ahead of the curve in leveraging technological change in information technology by:\r\n• Providing an overview of the key emerging technologies that are driving technological shifts and reshaping the social, political and economic context.\r\n• Deepen your understanding of the capabilities being created as a result of these technological shifts, and the industry impact of these capabilities.\r\n• Build decision-capacity to successfully combine technological disruption, societal drivers and business models for sustained growth and differentiation.\r\nWHO SHOULD PARTICIPATE\r\nThis course is designed for executives and professionals within accelerated leadership programmes, to enhance their strategic knowledge on the topic and provide them with continuous leadership development.\n\n                                            Syllabus\n                        Week 1: Robotics\r\n1.1 Introduction: Rodney Brooks , Founder, Chairman and Chief Technical Officer, Rethink Robotics; Technology Pioneer 20141.2 Tactile Robots: Gerald E. Loeb, Chief Executive Officer, Syntouch, USA; Technology Pioneer 20141.3 Service Robots: Henrik I. Christensen, Distinguished Professor in Computer Science, Georgia Institute of Technology1.4 Exoskeleton: Yoshiyuki Sankai, Chief Executive Officer, Cyberdyne, Japan; Technology Pioneer 20141.5 Bionic Limbs: Hugh Herr, Assistant Professor in Media Arts and Sciences and Health Sciences and Technology, Massachusetts Institute of Technology (MIT)1.6 Industrial Robots: Eberhard Veit, Chief Executive Officer, Festo1.7 Conclusion: Rodney Brooks, Founder, Chairman and Chief Technical Officer, Rethink Robotics; Technology Pioneer 2014\r\nWeek 2: Artifical Intelligence\r\n2.1 Introduction: Stuart Russell, Professor, University of California, Berkeley2.2 Natural Language Processing: Eugene Charniak, Professor, Brown University2.3 Common Sense Reasoning: Catherine Havasi, Chief Executive Officer, Luminoso2.4 Anticipatory Intelligence: Timothy Tuttle , CEO and Founder, Expect Labs2.5 Cognitive Intelligence: Ashwin Ram, Area Manager &amp; Chief Innovation Officer, Interactive Intelligence, PARC2.6 Machine Intelligence: Erik Brynjolfsson, Professor, Sloan School of Management, Massachusetts Institute of Technology2.7 Conclusion: Stuart Russell , Professor, University of California, Berkeley\r\nWeek 3: Big Data\r\n3.1 Introduction: Alex Pentland, Toshiba Professor of Media, Arts and Sciences, Massachusetts Institute of Technology (MIT)3.2 Mobile Data: Nathan Eagle, Chief Executive Officer, Jana Mobile; Technology Pioneer 20143.3 Location Data: Michael Altendorf , Chief Executive Officer and Co-Founder, Adtelligence, Germany; Technology Pioneer 20143.4 Open Data: Helen Margetts , Director and Professor, Oxford Internet Institute, University of Oxford, United Kingdom3.5 Conclusion: Alex Pentland, Toshiba Professor of Media, Arts and Sciences, Massachusetts Institute of Technology (MIT)\r\nWeek 4: Sensor Networks\r\n4.1 Introduction: Joseph Paradiso, Associate Professor of Media Arts and Sciences, Massachusetts Institute of Technology4.2 Internet of Everything: Matthew Grob, Executive Vice-President and Chief Technology Officer, Qualcomm4.3 Ingestible Sensors: Andrew Thompson, Chief Executive Officer, Proteus Digital Health; Technology Pioneer4.4 Geospatial Sensor Networks: Walter S. Scott, Founder and Chief Technical Officer, DigitalGlobe; Global Growth Company4.5 Smart Dust: Prabal Dutta, Assistant Professor, University of Michigan4.6 Smart City Networks: Carlo Ratti, Director, SENSEable City Laboratory, MIT - Departments of Urban Studies and Planning; Global Agenda Council on Urbanization4.7 Conclusion: Joseph Paradiso , Associate Professor of Media Arts and Sciences, Massachusetts Institute of Technology\n                                    ", 
    "end_date": "2014-07-29T00:00:00Z", 
    "title": "PLM14101: Global Information Technology Outlook", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "World Economic Forum"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://forumacademy.weforum.org/courses/ForumAcademy/PLM14101/Summer_2014/about", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Independent"
    ], 
    "start_date": "2014-06-17T00:00:00Z"
}