{
    "selfpaced": false, 
    "topic_name": [
        "Artificial Intelligence"
    ], 
    "description": "\n\n                    \n                    \n                    One of the most common tasks performed by data scientists and data analysts are prediction and machine learning. This course will cover the basic components of building and applying prediction functions with an emphasis on practical applications. The course will provide basic grounding in concepts such as training and tests sets, overfitting, and error rates. The course will also introduce a range of model based and algorithmic machine learning methods including regression, classification trees, Naive Bayes, and random forests. The course will cover the complete process of building prediction functions including data collection, feature creation, algorithms, and evaluation.\n\n                                            Syllabus\n                        Week 1: Prediction, Errors, and Cross ValidationThis week will cover prediction, relative importance of steps, errors, and cross validation.Week 2: The Caret PackageThis week will introduce the caret package, tools for creating features and preprocessing.Week 3: Predicting with trees, Random Forests, &amp; Model Based PredictionsThis week we introduce a number of machine learning algorithms you can use to complete your course project.Week 4: Regularized Regression and Combining PredictorsThis week, we will cover regularized regression and combining predictors.  \n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Practical Machine Learning", 
    "price": 0, 
    "instructors": "Jeff Leek", 
    "institution_name": [
        "Johns Hopkins University"
    ], 
    "commitment": "4-9 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/learn/practical-machine-learning", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}