{"selfpaced": false, "topic_name": ["Physics"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    phys1-001\n                                                                    phys1-002\n                                                                    phys1-003\n                                                                    phys1-004\n                                                                    phys1-005\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    \n    We will investigate motion in the world around us; we welcome both those\n        who want to participate fully and those who wish to sample, cafeteria-style,\n        the activities of this course.  Those who participate fully will experience\n        a course that is very different in style but equivalent (at least) in core\n        content to a traditional, on-campus, first-semester college-level introductory\n        physics course that includes a laboratory. At the same time, those who\n        cherry-pick selected course elements (e.g., learning the basics of video\n        capture and analysis of motion in one’s own surroundings) will still advance\n        their understanding of physics.   \n        \n    \n    We aim to understand and to predict motion in the real world using a small\n        set of powerful fundamental principles. The laboratories are the backbone\n        of this course, providing opportunities (1) to observe and to analyze motion\n        in our own surroundings, (2) to apply fundamental principles to build explanations\n        of the motion, and (3) to evaluate, in a constructively critical way, our\n        own measurements and models, as well as the measurements and models of\n        our course peers. Other course elements (lecture videos with “clicker”\n        questions, homework) support and extend the physics explored in the laboratories.Participants\n    who satisfactorily complete the course will be eligible for six (6) Continuing\n    Education Units from the American Association of Physics Teachers. \n\n                                            Syllabus\n                        (NB:  This syllabus will be revised soon to reflect a 16-week term; please check back later.  )\n    \n\nWeek 1:              \n    Motion in 1D: Kinematics, Vectors (Part 1) &amp; Newton’s 2nd Law\nLab 0:                  Install Video Analysis &amp; Computer Modeling Software\n\n\nWeek 2:              \n    Motion in 1D: Prediction of Motion; Constant/Non-Constant Forces\nLab 1:                  Constant Velocity Motion in Your Surroundings\n\n\nWeek 3:              \n    Motion in &gt; 1D: Vectors (Part 2) &amp; Newton’s 2nd Law\nWeek 4:              \n    Motion in &gt; 1D: Prediction of Motion; Momentum\nLab 2:                  Free Fallin’ with Drag (1D Dynamics)\n\n\nWeek 5:              \n    Curving Motion, Including Uniform/Non-Uniform Circular Motion\nWeek 6:              \n    Energy Principle; Work\nLab 3:                  Galactic Black Holes (&gt;1D Dynamics)\n\n\nWeek 7:              \n    Multiparticle Systems: Potential Energy\nWeek 8:              \n    Energy Applications\nLab 4:                  Rope Physics in Sports (Forces &amp; Energy)\n\n\nWeek 9:              \n    Energy &amp; Momentum: Collisions\nWeek 10:            \n    Angular Momentum Principle\nLab 5:                  Free Choice Project (Energy &amp; Momentum)\n\nWeek 11:            \nFinal Exam; Lab 5 Submit &amp; Evaluate\n\n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Introductory Physics I with Laboratory", "price": 0, "instructors": "Michael F. Schatz", "institution_name": ["Georgia Institute of Technology"], "commitment": "10-14 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/phys1", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-09-22T00:00:00Z"}