{"selfpaced": false, "topic_name": ["Physics"], "description": "\n\n                    \n                    \n                    WHAT IS “HOW STUFF MOVES”?\nMechanics is the study of how things move. It was the first quantitative science to achieve wide power to predict behavior, including things never before directly observed. Newton, Leibniz, and others invented calculus to describe motion and we will find both differential and integral calculus extremely useful throughout this course.\n\nThis is the second in a 3-part series of courses that parallels the second-semester mechanics course taught at Harvey Mudd College. Part 2 expands on Part 1 by considering the rotation of objects, connecting new concepts of angular momentum and torque to the properties of linear motion. Part 1 examined linear motion, and Part 3 examines wave motion. This course is an invitation to develop your problem-solving skills and to learn how to apply mathematics to all sorts of problems of the physical world. Learning the rules that govern how stuff moves in the world around us is exciting; using those rules to predict correctly something that you haven’t observed means that you really understand something. It‘s a great feeling.\n\nWHAT SHOULD I KNOW BEFORE WE START?\nYou need not have taken physics before, but we assume that you have studied mathematics, up to and including a first course in calculus. You may be taking a calculus course concurrently with this course; that should be a good strategy. We will introduce important calculus ideas and methods as the need arises and provide examples.\n\nThere is a Mathematics Diagnostic Test that you can take at the beginning of Part 1 of this series to ensure that your mathematics background will set you up for success in this course.\n\n                                    ", "end_date": "2015-04-21T00:00:00Z", "title": "PHYS024.2x: How Stuff Moves, Part 2: Angular Motion", "price": 0, "instructors": "Elizabeth Connolly and Peter Saeta", "institution_name": ["Harvey Mudd College"], "commitment": "", "subject_name": ["Science"], "course_url": "https://www.edx.org/course/how-stuff-moves-part-2-angular-motion-harveymuddx-phys024-2x", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-03-17T00:00:00Z"}