{"selfpaced": false, "topic_name": ["Physics"], "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    physics1-001\n                                                                    physics1-002\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    This course is a rigorous introduction to classical mechanics, which is the study of forces and motion.  How does gravity control the motion of the\nplanets around the sun or the motion of a projectile fired from a cannon?  Why does a spinning skater spin faster when\nshe pulls her arms in?  Why is a\nperpetual motion machine impossible? These are the kinds of questions which can\nbe answered with classical mechanics, which was first formulated by Isaac\nNewton around 1666. Classical, or Newtonian Mechanics is the oldest branch of\nphysics, but it will never go out of style. \nIt remains the foundation of our understanding of the physical world and\nis constantly used by engineers and scientists. There is a space probe, called\nNew Horizons, that is on its way to Pluto right now, and it will arrive on July\n14, 2015, exactly on time and on target, because its path has been computed\nusing classical mechanics, and nothing\nmore.\n\n                                            Syllabus\n                        \n\nWeek 1:                1D motion: speed, velocity and acceleration\n\nWeek 2:               1D motion continued.  \nVector Math.\n\nWeek 3:               Motion in 2D.\n\nWeek 4:               Newton’s Laws.\n\nWeek 5:               Applications of Newton’s Laws.  Friction.\n\nWeek 6:               Work and Energy.\n\nWeek 7:               Conservation of Energy. \n\nWeek 8:               Gravity and orbits.\n\nWeek 9:               Conservation of Momentum and Collisions.\n\nWeek 10:             Rotational Motion.\n\nWeek 11:             Conservation of Angular Momentum.  Static Equilibrium.\n\nWeek 12:             Simple Harmonic Motion.\n\n \n                                    ", "end_date": "1900-01-01T00:00:00Z", "title": "Physics 1 for Physical Science Majors", "price": 0, "instructors": "Michael Dubson", "institution_name": ["University of Colorado Boulder"], "commitment": "8-12 hours", "subject_name": ["Science"], "course_url": "https://www.coursera.org/course/physics1", "duration": null, "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2014-04-14T00:00:00Z"}