{"selfpaced": false, "topic_name": ["Physics"], "description": "\n\n                    \n                    \n                    Have you ever wondered why ventilation helps to cool down your hot chocolate? Do you know why a surfing suit keeps you warm? Why iron feels cold, while wood feels warm at room temperature? Or how air is transferred into aqueous liquids in a water treatment plant? How can we sterilize milk with the least amount of energy? How does medicine spread in our tissue? Or how do we design a new cooling tower of a power plant? All these are phenomena that involve heat transfer, mass transfer or fluid flow. \n\nTransport Phenomena investigates such questions and many others, exploring a wide variety of applications ranging from industrial processes to environmental engineering, to transport processes in our own body and even simple daily life problems\n \nIn this course we will look into the underlying concepts of these processes, that often take place simultaneously, and will teach you how to apply them to a variety of real-life problems. You will learn how to model the processes and make quantitative statements.  \n\nFAQ\n\nIs there a book required for the course?\n\nThe course uses materials and software that are freely available online. A useful reference book is: Harry Van den Akker &amp; Robert F. Mudde, Transport Phenomena (Delft Academic Press, 2014, ISBN: 978-90-6562-3584).\n\nI just want to learn the basics of Transport Phenomena (TP). Do I really need to spend 8 hours per week for 7 weeks?\n\nWe offer this course for everyone who wants to use TP in their education or professional life and for anyone who just has an interest in it. Each week we will give a short overview of the course elements and indicate how to take a ‘quick route’. You can decide how you want to go through this course, depending on the topic, your background and the time available. \n\nIf I miss a week, does that affect my performance?\n\nYou can study at your own pace as long as you finish before the final deadline. However, some assignments and discussions are primarily active and monitored during the scheduled period. \n\n \n\nLICENSEThe course materials of this course are Copyright Delft University of Technology and are licensed under a Creative Commons Attribution-NonCommercial-ShareAlike (CC-BY-NC-SA) 4.0 International License.\n\n                                    ", "end_date": "9999-12-31T23:59:59Z", "title": "TP101x: The Basics of Transport Phenomena", "price": 0, "instructors": "Peter Hamersma and Robert Mudde", "institution_name": ["Delft University of Technology"], "commitment": "6-9 hours", "subject_name": ["Science"], "course_url": "https://www.edx.org/course/basics-transport-phenomena-delftx-tp101x-0", "duration": null, "language_name": ["English"], "provider_name": ["edX"], "start_date": "2016-10-01T00:00:00Z"}