{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    This course provides you with insights into the rich fabric of the cultures of China. You will develop a basic understanding of written Chinese, its history and expression in calligraphy. We will also explore the origins and variety of Chinese cuisine, the role of food in festivals and the etiquette of Chinese dining and tea drinking. You will also look at the origins of some of the values that underpin Chinese society and how these are being affected by economic development and urbanisation. You will uncover some of the symbolism of numbers and colours and the Chinese Zodiac and get a feel for how traditional values and beliefs are expressed in Chinese opera and architecture.\r\nAfter completing this course you will have a greater understanding of Chinese language and culture how contemporary China has been framed by both tradition and its place in our increasingly globalised world. You will have a menu from which to choose topics that you may wish to pursue through further studies.\r\nWhat will I learn?\r\n\r\nYou will understand the long heritage of Chinese society and the diversity of the Chinese landscape, its cultures and nationalities.\r\nYou will acquire a broad appreciation of, philosophies and social values that underpin contemporary Chinese society, and how these are evolving in modern China.\r\nYou will understand the origins of and the high value placed on education and writing, including Chinese calligraphy.\r\nYou will understand the structure of Chinese written characters, the role of the Pinyin writing system, and be able to recognise and write some Chinese characters.\r\nYou will be able to identify key features of the different cuisines of China and put dining etiquette into practice.\r\nYou will have a good basic appreciation of the symbolism of numbers, colours and animals and features of Chinese opera and architecture.\r\n\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nAsian Studies Teachers\r\nTourism and Travel Advisers\r\nInternational Event Management\r\nEnglish Teachers (as a Second Language)\r\nTeachers of English to Speakers of Other Languages\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: DIFFERENCES ACROSS REGIONS AND NATIONALITIES\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: CHINESE CUISINE AND ITS SOCIAL SIGNIFICANCE\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: DIVERSITY OF CHINESE CULTURE\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: SYMBOLS, ART AND EDUCATION\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Chinese Language and Culture", "price": 0, "instructors": "Professor Liu Cheng (Brady)", "institution_name": [], "commitment": "", "subject_name": ["Humanities"], "course_url": "https://www.open2study.com//node/1756", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}