{"selfpaced": false, "topic_name": ["Language & Culture"], "description": "\n\n                    \n                    \n                    This course is for people who are learning English and who are interested in finding out more about British culture and improving their English language skills.\n\nThe course will use short videos to present a different topic each week, including English as a global language, the environment, entrepreneurship and literature. Filmed in Great Britain, these videos will help you to develop your listening skills as you watch authentic examples of people speaking English. Our experienced tutor will examine some of the language used in the videos and will draw your attention to useful points that will help you improve your spoken and written English.\n\nThe course does not follow a language syllabus but takes authentic English in context as its starting point. Short quizzes and discussions will help you measure your understanding and practise your English throughout the course. At the end of each week you will be asked to describe your own feelings and experiences about that week’s topic in a short piece of writing.\n\nThe course draws on the British Council’s expertise in online learning. It is one of three courses from its Exploring English course collection.\n\nYou can find out more about this course in Chris Cavey’s post for the FutureLearn blog: “3 tips for getting the most out of Exploring English.”\n\n\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Exploring English: Language and Culture", "price": 0, "instructors": "Chris Cavey", "institution_name": ["British Council"], "commitment": "2 hours", "subject_name": ["Humanities"], "course_url": "http://www.futurelearn.com/courses/explore-english-language-culture?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}