{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>Why is the ‘18 Days to Life’ program different? On most diet programs we are simply given a long list of forbidden and permitted foods. We are expected to change all our life-long habits at once. How many programs deal with the following questions:</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>What is the difference between hunger and cravings?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Is it possible to lose weight without cutting out any food groups?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>What is the connection between the subconscious mind and our eating habits?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>How can you transform the way you perceive food?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Why is mindfulness important for health and weight loss?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Can you implement practical meditation in just a few minutes a day?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Is it possible to build up a simple yet well balanced exercise program at the right pace?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>How can you turn setbacks into building blocks for success?</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>After 15 years of research, and authoring the Life Transforming Diet (Feldheim Publishers) and The 5 Skinny Habits (Rodale Publishers), I will explain all of these concepts and more on The 18 Days to Life program. Through 21 daily lectures and 23 PDF Downloads, you will be provided with a workable, realistic system that allows you to go on living your own particular lifestyle while you gradually transform your life. I will show you how to recondition your mind and perceptions. Our <strong>main goal</strong> is to <em>restore your body’s natural rhythm</em>. This is done at the <strong>right pace</strong> – making just <strong>one habit change a day</strong> for 18 days. There are <strong>no forbidden foods or food groups.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>In my own personal weight-loss struggle, I turned to the forgotten wisdom of the ancients―Maimonides, Aristotle, Hippocrates, Galen, and even Benjamin Franklin―to find consensus on ideal nutrition for optimum physical and emotional health. After studying volume upon volume, I distilled the teachings of humanity's greatest doctors and philosophers and discovered something amazing: Ancient doctors already knew what today's medical findings are rediscovering about what's best for human health, weight loss, disease prevention, and psychological well-being. The most current dietary and fitness guidelines are also incorporated, and doctors and psychologists have approved this program. On <em>The 18 Days to Life</em> diet plan, you'll harness the best of both worlds―the ancient and the modern―for long-term success.</p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "18 Days to Life - Diet, Fitness and Mindfulness", 
    "price": "50.00", 
    "instructors": "David Zulberg", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/811816_6f60_6.jpg", 
    "course_url": "https://www.udemy.com/18-days-to-life-diet-fitness-and-mindfulness-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-03T22:47:26Z"
}