{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Being overweight, unhealthy, uncomfortable and tired is a problem for most Americans. </p><p><em> I should know.  I use to fit into that category before I lost 40 pounds in 3.5 months.  Maybe the reason you’ve found interest in this course is because I just described you!</em></p><p>You’ve tried other ‘diets’ — I hate that word, by the way.  You’ve lost and gain weight so many times you can’t even count.  You realize that if you don’t <strong>lose those 10, 30 or 50 pounds</strong> that you’re going to be miserable the rest of your life — that you could be headed for some series health problems like heart disease or even cancer.</p><ul><li>What if there were some simple steps that you could take that will give you the motivation and information to transform your thinking and transform your life?  </li><li>What if changing your eating habits without counting calories or weighing food could set you up for a lifetime of happiness.  </li><li>What if you became a healthier, happier and even better looking person, inside and out?</li></ul><p><strong><em>This is your course for life!</em></strong></p><p>I too, was once healthy and active but over the years gained extra fat and was carrying around 40 extra pounds that made me tired and depressed.  Then, one day, I made a choice that changed my life.  I chose to transform my life by changing my mindset and habits.  It was difficult at times but I’ll never look back.  Now I’m healthy, happy and finding success in all areas of life! </p><p><em><strong>Breakthrough Weightless 101 is your course to achieve it all and more. </strong></em></p><p>When you invest in yourself through this course, you will set yourself up for becoming the person you always knew you could be. </p><p><strong><em>Now is the time to get healthy, get happy and lose that weight forever!</em></strong> </p>", 
    "end_date": null, 
    "title": "5 Steps To Losing Weight For Life!", 
    "price": "35.00", 
    "instructors": "Todd Stocker", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/679966_61ba_5.jpg", 
    "course_url": "https://www.udemy.com/breakthrough-weight-loss-101/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-24T22:39:47Z"
}