{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>It’s been said that big doors…swing on small hinges.</p><p>In other words, you can achieve BIG RESULTS with surprisingly small actions…</p><p>As long as you’re taking the RIGHT actions.</p><p>And in this program, you’re going to learn what those actions are…what those small hinges are…when it comes to weight loss.</p><p>Hi, I’m Neil, the creator of this program and the founder of StrongerLeaner. And I want to welcome to 57 Quick &amp; Easy Fat-Loss Hacks.</p><p>In this unique program, you’ll learn a mind-blowing 57 easy lifestyle tweaks that you can use to dramatically ramp up your body’s fat burning.</p><p>These lifestyle tweaks are NOT difficult, or expensive, or time-consuming. Instead, these hacks all take advantage of the logic behind the 80/20 principle to leverage the most efficient weight-loss strategies…</p><p>Making weight loss faster, easier, and more enjoyable than ever…</p><p>While helping you to save time and frustration by AVOIDING the 80% of weight-loss strategies that give you minimal results.</p><p>You’ll discover secrets and strategies like:</p><li>\t7 clever ways to take advantage of your own psychology to make yourself a naturally healthy eater… This is how you make weight-loss AUTOMATIC…</li><li>\tThe surprising location where weight-loss REALLY happens (hint: it’s not the gym, the dining room, or even the kitchen)…</li><li>\t9 “smart replacements” for common high-calorie foods. These are simple substitutions you can make each week that will significantly reduce calories without changing the way your food tastes…</li><li>\tExactly what you should order at restaurants to avoid derailing your diet…</li><li>\tThe one weight-loss technique that nobody talks about, even though it’s been proven through research time and time and time again…</li><li>\tTricks to reduce your time spent in the kitchen by up to 80%…</li><li>\tHow to hack the physiology of your sleep to optimize your body’s hormone levels and reduce hunger…</li><li>\tThe secrets to achieving elite motivation that will help ensure consistent progress…</li><li>\tWhy you might be wasting hours and hours of your life at the gym…</li><li>\tAnd much, much more.</li><p>These weight-loss hacks can be used with any diet or exercise plan you want: it doesn’t matter if you’re on the Atkins, South Beach, or Paleo Diet, if you’re a Cross-Fitter or a weekend warrior or just a regular guy or girl who wants to lose some weight and look good…without starving or killing yourself at the gym.</p><p>Now let me just be clear: this is not a fad diet or a miracle cure.</p><p>This is a system of easy lifestyle modifications that make weight loss easier and more enjoyable. This is a collection of essential weight-loss strategies that you can use for the rest of your life to achieve and maintain a leaner, sexier physique. This is weight-loss made smart.</p><p>This is 57 Quick &amp; Easy Fat-Loss Hacks.</p><p>Check out the free previews, and I’ll see you inside the program.</p>", 
    "end_date": null, 
    "title": "57 Quick & Easy Fat-Loss Hacks", 
    "price": "35.00", 
    "instructors": "Neil Flinchbaugh", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780048_aeaf.jpg", 
    "course_url": "https://www.udemy.com/57-quick-easy-fat-loss-hacks/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T14:57:34Z"
}