{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">One of the biggest challenges that continues to discourage steady weight loss is: the scale.<br style=\"\"></p><p style=\"\">When the scale doesn&#039;t reflect as much as you expect, doesn&#039;t show a loss at all – or even worse – reflects a gain, this can easily be the final straw in your weight loss efforts causing you to get off track once again. </p><p style=\"\">This course identifies how to understand your body&#039;s natural weight loss patterns and examines 7 common reasons that the scale doesn&#039;t reveal your true efforts. <br style=\"\"></p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Learn to W</strong><strong style=\"\">ork With Your Natural Weight Loss Patterns to Reach Your Goal Weight</strong></p><ul style=\"\"> <li style=\"\">Know when and how to weigh for the most accurate results</li> </ul><ul style=\"\"> <li style=\"\">Keep frustration from causing additional lulls and detours in your weight loss journey</li> </ul><ul style=\"\"> <li style=\"\">Understand your body to better customize your weight loss efforts and reach your goal more quickly.</li></ul><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">Get to Know Your Body for Smooth, Speedy and Less Frustrating Weight Loss</strong></p><p style=\"\"> Frustration is the number one reason that diets, exercise programs and all other weight loss efforts fail. When you work hard to eat right, exercise and make drastic changes to your lifestyle - you expect to see results.</p><p style=\"\"><em style=\"\">The sad thing is - often it is not your fault. You may be giving up when there is an easy fix or explanation.</em></p><p style=\"\">There are 7 factors that can cause drastic effects on the scale including slow progress, no loss, or even drastic gains. Before getting frustrated it is important to know and understand these 7 factors and determine if 1 or more of them is acting as a barrier between you and your results on the scale.</p><p style=\"\">Depending on which factors are affecting you there are things you can do to combat them and see your full weight loss more quickly and easily. </p><p style=\"\">Understanding the true nature of how your body is reflecting on the scale can keep you from getting frustrated and keep you on track once and for all - until your goal weight and for life!</p><p style=\"\"><br style=\"\"> <strong style=\"\">Contents and Overview</strong></p><p style=\"\">This course contains 17 lectures and over 40 minutes of content. It&#039;s designed for anyone who wants to lose weight, regardless of your experience. This course contains specific information about hormones and chemicals that affect the body but also provides general concepts that can be easily adapted to your own life. </p><p style=\"\">This course includes questionnaires that help you to identify areas of improvement that can help speed your weight loss progress as well as links to additional resources.</p><p style=\"\"><br style=\"\"></p><p style=\"\"><strong style=\"\">What am I going to get from this course?</strong></p><ul style=\"\"><li style=\"\">You will learn what factors affect the scale, how to identify which are affecting you at any given time and gather tips on how to avoid, manage or simply wait out these challenges. </li> </ul><ul style=\"\"> <li style=\"\">You will learn how the most important things are your mindset and your motivation to keep the scale moving down.</li> </ul><ul style=\"\"> <li style=\"\">By the end of this course, you&#039;ll have a better understanding of how your lifestyle and factors outside your control affect the scale and how to manage or deal with them to stay on track for successful weight loss.</li></ul>", 
    "end_date": null, 
    "title": "7 Reasons You're Not Losing Weight...and What To Do About It", 
    "price": "20.00", 
    "instructors": "Kerri Gaither", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/460938_0efc.jpg", 
    "course_url": "https://www.udemy.com/7-reasons-youre-not-losing-weightand-what-to-do-about-it/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-27T19:27:53Z"
}