{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hi,</p><p>My name is Ivan Nikolov. I teach the <strong>\"7 Unorthodox No-diet Rules for Achieving Ideal Body Weight\"</strong> course. Let me tell you a bit about this course...</p><p><em>This course is for you </em>if you fall into any of the categories:<em></em></p><ul><li><strong>This course is for you if you describe yourself as “overweight\" or “obese\"</strong>, and you've continuously suffered failures with weight loss diets!</li></ul><ul><li><strong>This course is for you if you are of normal weight and want to know how to maintain it for life</strong> or simply want to know how to enjoy a healthy living by making the right nutrition-related choices!</li></ul><p><strong><br>What this course IS NOT...</strong></p><ul><li><strong></strong><em>This course is not about dieting.</em><strong></strong> The rules mentioned in this course ARE NOT A DIET!</li></ul><ul><li>This course does not give an <em>“Eat all you want and lose weight\" type of advice!</em></li></ul><ul><li>This course<em> is not about a nutrition trend that is hot now but will be rejected or even forgotten in the future!</em></li></ul><p><strong><br>What this course IS...</strong></p><ul><li><em>An ORIGINAL AND UNCONVENTIONAL content</em> that is entirely based on my own study of nutrition and movement for a period nearly quarter of a century as a competitive natural body builder, personal trainer and nutrition consultant, as well as an avid health and functional fitness enthusiast.</li></ul><ul><li><em>An unorthodox but simple and intuitive set of rules that will serve you for a lifetime.</em></li></ul><ul><li><em>This course lays down the simple truths about why we are so screwed up health-wise </em>and how to undo the damage by simply doing what the human body is well adapted to reacting favorably to and avoid what it is ill adapted to reacting favorably to.</li></ul>", 
    "end_date": null, 
    "title": "7 Unorthodox No-diet Rules for Achieving Ideal Body Weight", 
    "price": "25.00", 
    "instructors": "Ivan Nikolov", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/559466_e835_3.jpg", 
    "course_url": "https://www.udemy.com/7-unorthodox-no-diet-rules-for-achieving-ideal-body-weight/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-20T14:46:34Z"
}