{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><br></p><p>Are you tired of dieting? Are you tired of losing weight and gaining it back again? </p>  <p>This course will show you:</p><ul><li>How to lose weight and stay slim for life without dieting. </li><li>With the Asian Slim Secrets method, you don’t need to starve yourself.  </li><li>You will stay full and satisfied with delicious food and you will lose weight easily.   </li><li>Learn this method and you will never ever have to go on a diet again, for the rest of your life.          </li><li>You will learn how to control your appetite instead of having your appetite control you.</li><li>You can still eat your favorite food such as pizza, fried chicken or steak.</li></ul><p><strong>Testimonials:</strong></p><p><strong>\" I Enjoyed Food, Stay Full &amp; yet I Lost Weight.\"</strong></p><p><em>“I lost 9.6 lbs from Dec 12 to Jan 10.  <br>People couldn’t believe it.<br>They said “Nobody loses that kind of weight<br>over the Christmas and New Year Holidays.”<br>Yes you do if you follow<br>Linda Yo’s weight loss method.<br>I enjoyed food, stay full and yet I lost weight.”</em></p><p><strong>~ Ken Blanchard,<br>co-author of One Minute Manager</strong></p><p><strong>\"Lost 25 Pounds &amp; Never Feel Hungry\"</strong></p><p><em>\"</em><em> Your plan was the only one </em><em>that ever worked for me.  I've lost weight and I never feel hungry.  </em><em>It's magical!!  Thank you so much for sharing your secret!!\"</em></p><p><strong>~</strong><strong> Patty McCormick, Ventura, CA</strong></p><p><strong>Credential: </strong>Linda Yo, MS is a nutritionist and the author of Asian Slim Secrets. She hold a master degree in nutrition from San Diego State University and she has lived in Asia, Australia and the United States. Because of her background, she was able to combine Western science with the Eastern method of eating which lead to the easiest method to lose weight and stay slim naturally. </p><p><strong>Disclaimer</strong>: This course is designed as a source of information only. The suggestion for specific foods in this course are not intended to replace appropriate and necessary medical care. If you have a medical condition, please consult your physician. If any recommendation in this course contradicts your physician's advice, check with your doctor before you proceed. </p><p>Efforts have been made to make sure the information in this course is accurate. However, there may be mistakes either in written or verbal words or in content. Therefore, this course should be used as a general guide only and not as the ultimate guide of health information. </p><p>The creator expressly disclaim any liability or loss resulting from the directions given in the course. </p>", 
    "end_date": null, 
    "title": "Asian Slim Secrets 101 - Never Diet Again!", 
    "price": 0, 
    "instructors": "Linda Yo, MS", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658066_2442_13.jpg", 
    "course_url": "https://www.udemy.com/asian-slim-secrets-101/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T19:11:33Z"
}