{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>Do you struggle with your Weight?</strong></p><p><strong>Do you really want to lose weight in 2016?</strong></p><p><strong>Don’t you wish you could eat MORE to weigh Less?</strong></p><p><strong><em>Well Now You Can! And I can show you how!</em></strong></p><p><em>Yes, you read that right!</em> </p><p>The fact is, most people who struggle to lose excess weight and keep it off are <strong>actually not eating enough food</strong>, not too much. </p><p>In this Course you will:</p><ul><li>Learn how to eat more of the foods you’re already eating at the best times and intervals for <strong>YOUR body</strong> to boost your metabolism and optimize digestion.</li><li>Discover what healthier foods are best for YOU at this time and how to include <strong>MORE</strong> of these healthier foods in your diet as a <strong>LIFESTYLE HABIT</strong> that you enjoy.</li><li>Also learn how certain processed foods and their ingredients could be contributing to your weight gain and how to easily make the switch to better choices.</li></ul><p><strong>Watch that stubborn weight come off </strong>and stay off. It's easier than you think when you empower yourself with practical knowledge, proven skills and strategies from me – a former junk-food junkie turned nutrition and health coach.</p><p>What you eat and how much are just two of the <strong>MANY FACTORS</strong> that may be causing you to have trouble gaining or losing excess weight. No two people are alike. </p><p><strong>That’s why 10 people can go on the same weight-loss program and some will reach their goals quickly and easily, while others won’t shed a pound, or not enough or – heaven forbid – actually GAIN weight following the exact same program!</strong></p><p><em>When it comes to overall health and weight issues, what I know for sure is, different people need different things at different times – and that can change.</em> </p><p><strong>So in addition to what to eat, how much and when, learn the specific factors and that might be keeping you from achieving your health and weight loss goals.</strong></p><p><em>Some will only have to make small changes to their current dietary lifestyle, while others will have to do more.</em> </p><p><strong>Either way, you’ll get started on the road to completely transforming your relationship with food, and get your eating habits working FOR YOU so you can find your natural weight and restore or maintain your health and energy.</strong></p><p><strong><em>Don’t forget Udemy’s 100% Money Back Guarantee! So all you have to lose is that excess weight!</em></strong></p><p><em>This course contains 90+ minutes of instructional videos along with a variety of supplemental materials, including articles and book recommendations.</em> </p><p>Because it's jam-packed with lots of valuable info and practical tips, it's something you can return to again and again to continually upgrade your eating lifestyle, as well as help you get back on track when you go astray.</p><p><strong>So, take the decision to make a change today and get started Eating More to Weigh Less!</strong></p><p><strong>Take This Course Today - See you inside</strong></p><p><strong>Best regards</strong></p><p><strong>Kelly and John</strong></p>", 
    "end_date": null, 
    "title": "Diet to Eat More, Weigh Less!", 
    "price": "20.00", 
    "instructors": "Kelly Amrit Hayford, John Colley", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695338_8a28.jpg", 
    "course_url": "https://www.udemy.com/diet-to-eat-more-weigh-less/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-12T03:06:55Z"
}