{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you tired of all the excuses? Face it. When it comes to making real change in our lives, we are experts at procrastination. And the foundation of a great procratinator? Great excuses.</p><p>Are you ready to move out of the procrastination treadmill? Are you ready to take control of your life? To take control of your excuses?</p><p><strong>Then this course is for you!</strong></p><p>Joan Kaylor uses her <strong>20 years of EFT experience</strong> to produce a cutting-edge program just for you. </p><p>We all know that to lose weight we need to move more: we need to eat less (and better!), but we don't. Why? We make excuse after excuse. Now is the <strong>time to stop the excuses</strong> and turn all that negative energy into negative weight gain :)</p><p><strong>What is EFT?</strong></p><p>EFT - <strong>Emotional Freedom Techniques</strong> is a relatively new, effective and a fast-moving process from the world of Energy Psychology that is growing in popularity among healers, scientists, spiritualists and ordinary folks, just like you, because of its gentle effectiveness.</p><p>Many call it \"Psychological Acupressure\", this technique releases energy blocks in your energy systems that cause your emotional intensities and discomforts. These blockages in <strong>your energy systems</strong>, in addition to blocking you emotionally, often lead to excess excuses and weight gain. Recently people have widely accepted that their emotional blockage is an important factor in their physical discomforts and disease. Because of this, EFT is extensively used on physical issues, including weight gain with <strong>often amazing and effective outcomes. </strong></p><p>Joan Kaylor has been using EFT in her practise for decades. She is very excited to bring you this effective, gentle modality and assist you in going to your ideal body weight while increasing your self-esteem and energy.</p><p><strong>Join us on the other side and start releasing your excuses today!</strong></p>", 
    "end_date": null, 
    "title": "EFT - Tap Away Your Excuses Preventing Your Weight Loss", 
    "price": "50.00", 
    "instructors": "Scott Paton, Joan Kaylor", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/615134_3dd3_2.jpg", 
    "course_url": "https://www.udemy.com/eft-weight-loss-no-excuses-no-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-17T19:22:22Z"
}