{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \tWith Fat Loss Secrets Revealed the insanity stops NOW!  </p>  <p style=\"\">  \t    These programs are designed to get large amounts of work completed in a  short time frame with minimal equipment and lack of space. We have  witnessed with these programs that our clients are not only getting in  great shape but they are more motivated, enthusiastic and above all  enjoying exercise more than ever.  </p>  <p style=\"\">  \t    Remove the horse blinders and break the monotony!  </p>  <p style=\"\">  \t    From the 1hr old fashioned Spinning and Aerobic class to the 15-30 min  of cutting edge HIIT. Science has shown that this style of training is  not only superior from a fat loss stand point its superior from a heart  health stand point. Fat Loss Secrets will give you the power to super  charge and expand your workout arsenal.  </p>  <p style=\"\">  \t    Get ready as we reveal over 30 cutting edge programs with 1000&#039;s of training variations.  </p>  <p style=\"\">  \t    You&#039;ll break the boredom and run though fitness plateaus while finally experiencing EXTREME FAT LOSS!  </p>  <p style=\"\">  \t    EXTREME FAT LOSS INCLUDES:  </p>  <p style=\"\">  \t    Fat loss routines that are designed to be completed in 15 min or less!  </p>  <p style=\"\">  \t    Fun proven techniques guaranteed to maximize your potential for fat loss  </p>  <p style=\"\">  \t    Cutting edge strategies featuring innovative exercises using only basic equipment  </p>  <p style=\"\">  \t    Programs suitable for novice to expert  </p>  <p style=\"\">  \t    This course has been proven to:  </p>  <p style=\"\">  \t    Maximize caloric expenditure while at rest  </p>  <p style=\"\">  \t    Decrease body fat faster than traditional aerobic/cardio programs  </p>  <p style=\"\">  \t    Break the monotony and make training fun again  </p>  <p style=\"\">  \t    Get more work done in a shorter amount of time  </p>  <p style=\"\">  \t    Testimonial:  </p>  <p style=\"\">  \t    One of my criteria for whether or not I’ll recommend new fitness  products to other fitness professionals is simple: applicability. Can  someone take the information obtained from a certain product, and apply  it to their programming right away? In the case of Fat Loss Secrets  Revealed, the answer is a resounding YES! I’m always looking for new and  innovative ways to make my clients hate me (in a good way) when it  comes to fat loss programming. While most fat-loss products will try to  persuade you into thinking that long-duration cardio and starvation  diets are the way to go, Matt Pack essentially cracks open a can of  whoop ass, and introduces the viewer to a multitude of complexes,  circuits, and other “secrets,” using nothing but a dumbbell, barbell, or  your own bodyweight, that will undoubtedly help to get you (or your  clients) into the best shape of your life  </p>  <p style=\"\">  \t    Tony Gentilcore, CSCS, CPT<br style=\"\">  \t     www.gentilcoretraining.com  </p>  <p style=\"\">  \t    For more testimonials from coaches or clients go to www.primalfitmiami.com/product/fat-loss-secrets-revealed/  </p>", 
    "end_date": null, 
    "title": "Fat Loss Secrets Revealed", 
    "price": "40.00", 
    "instructors": "Matt Pack", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/244302_45f8_2.jpg", 
    "course_url": "https://www.udemy.com/fat-loss-secrets-revealed/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-16T17:08:29Z"
}