{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you want a flat stomach, firm butt, or toned thighs? To feel sexy in a bathing suit? Be more energetic than ever, while eating lots of food you love?</p><p>Infused with conversational wit, tough love, and common sense, 20 POUNDS IN 90 DAYS is a balanced, sustainable plan to <strong>change your habits and the way you eat forever</strong>, and <strong>transform your life in profound and unexpected ways.</strong></p>\n<p>Suffering from health problems, food addiction, and strapped for time to exercise, FitQuick founder and author Chloe Black wanted a way out of diet myths and self-deprivation. After putting natural food theories to practice with scientific-backed research, she perfected this revolutionary program to lose 20 pounds or more, in just 3 months. <br></p>Are you tired of boring, restrictive diets? Do you deny yourself the foods you love, only to binge and feel bad?\n<p><em>Committing to meal preparation and a health regimen is a challenge.</em> 20 POUNDS IN 90 DAYS <u>makes it easy </u>to beat procrastination with a <strong>28-day meal-planning calendar, 4 detailed shopping guides, 16 creative and delicious recipes, proven exercise routines, and much more.</strong></p>\n<p>If you <strong>love food</strong> and want to <strong>enjoy lots of it</strong>, this program is perfect for you.</p>\n<p>Don't waste time and money on expensive \"fat burner\" pills, starvation cleanses, or infomercial ab-gimmicks. Learn to leverage the power of natural foods to live longer and <strong>get the defined arms, abs, and thighs you want.</strong></p>\n<p><strong>This isn’t a book of quick fixes and generic “you can do it” tips. </strong>Through these 28 principles, you will FINALLY master the confidence you need to:<br>• Gain control over your progress by measuring macronutrients, BMI, and other key health indicators.<br><br>• Enjoy carbs the healthy way, and <strong>still lose weight.</strong><br><br>• Use strength training and HIIT exercise techniques to <strong>accelerate your success into overdrive. </strong><br><br></p>What will you learn with 20 POUNDS IN 90 DAYS?<br>• Essential habit-building strategies to <strong>reach your goals.</strong><p><br><br>• Daily drink supplement that will <strong>cleanse your body </strong>and prime it for <strong>fat loss.</strong></p><p><br><br>• 3 healthy hacks to <strong>drop 5 pounds</strong> in a single week.</p><p><br><br>As well as…<br>• 28 easily learnable components that <strong>make losing weight feel easy</strong>, and happen naturally.</p><p><br><br><br>Wouldn't it be fantastic to <strong>master your own self-discipline, eat food you love, and get to your goal weight?</strong> <br></p><p>Done correctly, you will quickly see visible improvements including <strong>higher self-esteem, increased alertness, a more athletic body, trimmer waistline, the ability to rise above temptation, live a longer life, and look better naked.</strong><br><br></p>Dedicate yourself to the 20 POUNDS IN 90 DAYS program, and in just a few, short months, experience these results:<br>• You're <strong>done with yo-yo dieting</strong>, and your head is clear of the shame and self-judgment that used to plague your thoughts.<p><br><br>• No longer feel embarrassed of how you look in pictures or certain outfits. <strong>Feel sexy and comfortable in clothes, or nothing at all.</strong></p><p><br><br>• Everyone is \"wowed\" by your body. <strong>Friends and family are shocked by your physical transformation</strong>, and everyone wants to know your secret.</p><p><br><br>The benefits are countless, and the price is small. Scroll up to buy!</p>", 
    "end_date": null, 
    "title": "Fitness Hacking", 
    "price": "20.00", 
    "instructors": "Chloe Black", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716100_c62d_3.jpg", 
    "course_url": "https://www.udemy.com/20pounds90days/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T21:07:57Z"
}