{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>EXPERIENCE NATURAL, VIBRANT HEALTH IN AS LITTLE AS 6 WEEKS.</strong></p>\n\n<p><em>Natural weight loss plan with <strong>RADICAL</strong> results. <strong>Now released to the public for the very first time. </strong>(Previously only available to a few of my private clients.)</em><br></p>\n\n\n\n\n\n<p>Follow this <strong>6-weeks weight loss plan</strong> and<strong> LOSE AT LEAST 5-15 kg (11-33 lbs) OR MORE IN 6 WEEKS </strong>- and better still, keep it off. This plan is designed to help you <strong>LOSE WEIGHT FAST</strong> and attain <strong>LIFELONG VIBRANT HEALTH</strong>.</p>\n\n\n\n\n\n<p><strong>FIX IN SIX </strong>is <strong>not a fad diet</strong>. Instead, it introduces you to a <strong>new way of living</strong> by empowering you with expert weight loss advice and health knowledge that will change your life forever. Apply the principles that I share in this weight loss plan and you will have a lean body for life.</p>\n\n\n\n\n\n<p>This weight loss diet plan is packed with<strong> </strong> <strong>practical and time-saving tools</strong> such as:</p>\n\n\n\n\n\n<ul><li><strong>66 lectures</strong> (84 curriculum items) that are filled with practical life-changing tips, advice and knowledge to help you lose weight naturally.</li><li><strong>More than 40 HD videos that teach all the weight loss secrets you need to know.</strong></li><li><strong>Printable Cheat Sheets </strong>to remind you of what you've learned and give you practical suggestions on how you can apply your learnings to your day-to-day life.</li><li><strong>150+ healthy recipes</strong> that I've developed over the course of more than 10 years. They've been tested and tried on satisfied clients and the demanding palates of my husband and kids, so I know you'll love them. And they don't require that you spend hours in the kitchen either.</li><li><strong>6 x 7-Day Meal plans</strong><em> </em>(once for each day of the 6-week diet) that show you exactly what recipes you need to eat and when.</li><li>My secret<strong> Top Weight Loss Foods List</strong> that allows you to experiment with different foods types.</li><li><strong>Shopping lists </strong>that will save you hours in meal-planning and remove the guesswork involved when grocery shopping. Know upfront <strong>exactly</strong> what you need to buy for each week of the course.</li><li><strong>7 quizzes</strong> to test your newly acquired knowledge.</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>**PLUS**</strong> I've included <strong>FIVE</strong> <strong>BONUS Lectures</strong> for <strong>FREE</strong>:</p>\n\n\n\n\n\n<ul><li><strong>Your Mindset </strong>- Discover the key to <strong>sustained weight loss</strong></li><li><strong>Your Lifestyle</strong> - The role of <strong>exercise, sleep, water &amp; eating habits</strong> in weight loss</li><li><strong>Natural Weight Loss Supplements</strong> - eat these and you’ll burn fat faster</li><li><strong>Free Tool: </strong>The Calorie Calculator &amp; Weight Loss Food Consumption Tracker</li><li><strong>Freebie Resources That You Can Access</strong> (In my final lecture)</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Welcome to the NEW YOU</strong><br></p>\n\n\n\n\n\n<p>Do you wish to live a healthier lifestyle without spending hours in the gym or kitchen? Do you want to<strong> lose an insane amount of weight</strong> and feel <strong>healthier</strong> and more <strong>energetic</strong> than you've felt before <strong>AND</strong> <strong>keep it off</strong> for life? Have you tried or considered other weight loss diets and then discovered that they didn't live up to your expectations, or that they actually tried to get you to buy their expensive supplements, shakes and 'must-have' foods that you can <em>only</em> buy from them? Or have you followed a diet and maybe lost a few pounds, but at the expense of feeling terrible, miserable and worse than before you started? Do you want to eat healthy food without becoming a social recluse or the laughing stock of your friends? If you answered yes to any of the previous questions, then this step-by-step 6-week weight loss plan is for you! Eating healthy is feasible, fun and cool.</p>\n\n\n\n\n\n<p>You can b<strong>e your own weight loss expert and achieve lasting wellness</strong> without breaking the bank. Yes, although you may want to consider investing in a Vitamix or similar power blender to derive the most benefit from some of my recipes, you can definitely finish the course without one. (I've tested it with a normal blender too and everything worked just fine.) Eating foods that give you LIFE - and knowing which ones to avoid - will have a positive influence on your relationships, self-esteem, and career. It's been scientifically proven that those who look healthy and attractive people <strong>earn higher salaries and get more promotions</strong> than those who don't. That's a fact. They also tend to attract other attractive people (although there are obviously big exceptions to this!).</p>\n\n\n\n\n\n<p>I know from my own experience, and the remarkable results achieved by my clients, that <strong>you will be radically transformed from the inside out </strong>by following the FIX IN SIX weight loss diet plan. This will be one of the best investments that you've made in yourself in years. How much do you invest in things that don't really matter? Things like cars, furniture, etc. <strong>Isn't it far more important to take good care of your body?</strong> Not only will I show you how to get the physique you've always wanted - I will also empower you with practical tools and knowledge that you can use to change the lives of those closest to you!</p>\n\n\n\n\n\n<p>Follow my <strong>healthy weight loss principles</strong> and see how they work miracles for you, just like they've resulted in amazing results for me and my clients. I know that your life and body will never be the same again.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Why am I the right person to teach you?</strong></p>\n\n\n\n\n\n<p>I am a <strong>certified natural nutritionist, health coach, model and mother</strong> who is passionate about helping people reach their full potential. In this weight loss diet plan I share all my <strong>insider tips and tools </strong>about weight loss with you. I've <strong>achieved great results</strong> for my clients and I want you to share in their success. Coaching my clients one-on-one didn't enable me to share what I've learned with a broader audience, and because of the frustration that I had in my own health journey, I knew I had an obligation to do so.</p>\n\n\n\n\n\n<p>Starving yourself to death (like my of my peers did in the modelling industry) or going on extended fasts is not a realistic or enjoyable way to live life. I knew there must be a better way and I'm glad to inform you that there is! Best of all, the FIX IN SIX weight loss diet is <strong>all-natural, nourishing to your body, realistic, practical and achievable for anyone</strong>, whether you are a bride who is preparing for your wedding, a movie star, a parent or a busy executive who simply desires to look and feel great.</p>\n\n\n\n\n\n<p><strong>This weight loss plan took more than more than 10 years to develop. </strong>It involved extensive research, making sense of conflicting medical opinions, studying, personal experiments, and health coaching sessions with clients. I've spent hours in the kitchen developing <strong>healthy and yummy weight loss recipes.</strong> My husband has always been quick to remind me that healthy food needs to be just as delicious as the other 'unhealthy' alternatives out there. So this has been my aim from the beginning (having 3 young children gives you no other choice!). Today, after 10 years of trial and error, I'm proud to say that I've finally figured out to make healthy food yummy too!</p>\n\n\n\n\n\n<p>In short, <strong>FIX IN SIX</strong> will show you that <strong>it is easy </strong>to experience vibrant health and have a lean body – no fuss or stress – just pure fun.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Testimonials </strong></p>\n\n\n\n\n\n<p>“Your support and guidance as I rediscovered my health has been amazing. And more importantly, I have had a clear nose for weeks now and the wheezing is not obvious - yahoo! <strong>I am losing weight consistently.</strong> I purposefully decided to focus more on diet than exercise to see the effect on my body, so <strong>my weight loss to date is purely because of your diet.</strong>”</p>\n\n\n\n\n\n<p>\"I have been having <strong>lots of fun </strong>with smoothies, salads and juicing. I have <strong>loads of energy </strong>and am surrounded by lots of accountability buddies.\"<br></p>\n\n\n\n\n\n<p>\"<strong>You have been an inspiration</strong>, and the more people I talk to, the more interested they are to follow suit - yippee! Even my hubby is thinking of shifting to a smoothie mix in the morning - who knows?\"</p>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WHAT WE'LL BE COVERING</strong></p>\n\n\n\n\n\n<p><strong>WEEK 1: Detox - Your Ultimate Fat Burner</strong></p>\n\n\n\n\n\n<ul><li>Kick-start your weight loss journey by <strong>cleansing your body and burning fat fast</strong></li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WEEK 2: Weight Loss Secrets I Wish I Knew Earlier</strong></p>\n\n\n\n\n\n<ul><li>These weight loss foods are <strong>low in calories</strong> and will <strong>satisfy your hunger</strong></li><li><strong>**BONUS**</strong> Your Mindset - Discover the key to <strong>sustained weight loss</strong></li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WEEK 3: Why Good Fats Make You Slim</strong></p>\n\n\n\n\n\n<ul><li>The healthy way to follow the <strong>Paleo diet </strong>and succeed <strong>PLUS</strong> learn the difference between <strong>GOOD fats</strong> and <strong>BAD fats</strong></li><li><strong>**BONUS**</strong> Your Lifestyle - The role of <strong>exercise, sleep, water &amp; eating habits</strong> in weight loss</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WEEK 4: How to Quit Sugar Successfully</strong></p>\n\n\n\n\n\n<ul><li>The <strong>Six C’s</strong> that will help you to quit (or cut down on) sugar - don't leave the home without them!</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WEEK 5: The Raw Truth About Raw Foods</strong></p>\n\n\n\n\n\n<ul><li>Why eating raw is one of the best things that you can do for your body</li><li>An unbiased look at the <strong>Pros and Cons of raw food</strong></li><li><strong>PLUS:</strong> <strong>Superfoods</strong> that make you smart, slim and healthy</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WEEK 6: Boosting Your Metabolism To Burn Calories Faster</strong></p>\n\n\n\n\n\n<ul><li>Practical ways to boost your metabolism so that your weight loss efforts are not in vain</li><li><strong>**BONUS**</strong> <strong>Natural Weight Loss Supplements</strong> - eat these and you’ll burn fat faster</li></ul>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>CONSTANTLY UPDATED</strong></p>\n\n\n\n\n\n<p><strong>FIX IN SIX</strong> will be constantly updated with new weight loss tips, resources, etc., so as the course expands and grows, so will your investment in this course. And at this incredibly low introductory price, this weight loss plan is already a huge bargain!</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>FLEXIBILITY INCLUDED</strong></p>\n\n\n\n\n\n<p>No client is the same, so why should all course participants follow the exact same diet?</p>\n\n\n\n\n\n<p>They shouldn't.</p>\n\n\n\n\n\n<p>As a health and weight loss coach, I know that there are mainly two types of people who come to me for advice:</p>\n\n\n\n\n\n<p><strong>Type 1: \"</strong>Give me the exact diet that I need to follow and I'll follow it.\"</p>\n\n\n\n\n\n<ul><li><strong>My husband fits into this category. </strong>He's an all or nothing kind of guy. Don't tell him he's got options. He wants to follow the plan to the 't' because once he commits, he's all in and he wants to know without a shadow of a doubt that if he does XYZ, he WILL achieve the results that he signed up for.</li><li>Because of this, my husband insisted that I include <strong>6 detailed weekly Meal Plans</strong> to tell you exactly what to eat for breakfast, lunch, dinner, snack time, and to satisfy your sweet tooth ... <strong>for each day</strong>. To those of you who fall into this category, you'll be glad he did.</li></ul>\n\n\n\n\n\n\n\n<p><strong>Type 2: \"</strong>Give me the basic principles but let me decide how I want to apply them.\"</p>\n\n\n\n\n\n<ul><li><strong>I fall into this category. </strong>Needless to say, the FIX IN SIX weight loss diet caters for these types of individuals too. I like experimenting with new dishes, combining different foods in creative ways and 'listening' to what my body needs.</li><li>I will teach you exactly what you need to know to make powerful food choices so that you can let your creative juices flow without jeopardizing your weight loss goals. To make things even simpler for you, I've created printable PDF summaries so that you lose weight quickly, easily and naturally. Once you know that 'what' and the' why' (the theory), you will instinctively know the 'how', i.e. how to apply those principles in the kitchen.</li></ul>\n\n\n\n\n\n<p>In short, <strong>FIX IN SIX just works,</strong><strong> regardless of your preference</strong>.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>30 DAY TRIAL and 100% Money-Back Guarantee</strong></p>\n\n\n\n\n\n<p>I'm 100% confident that you will LOVE this weight loss plan, so giving you a 100% Money-Back Guarantee is just the natural thing to do. My goal with FIX IN SIX is simple: to help you find <strong>the best solution that works for YOU </strong>so that you can <strong>lose weight and keep it off</strong>. The FIX IN SIX diet has worked wonders for me and my clients, so I don't hesitate to recommend it to anyone. However, I realise that this programme may not necessarily be the best fit for everyone. Also, I don't know what your medical condition might be, so if you're unsure about anything, please consult your doctor before starting this diet. Going straight from a highly toxic diet to a healthy diet might be a shock to your system, at least initially. UnfortunateIy, I won't be held liable or responsible for the effect that this diet might have on your health. However, this is a natural diet, so it's hardly something to be concerned about. All my clients finished the diet feeling healthier than ever before. If for whatever reason you aren't happy with your results or the course didn't live up to your expectations, you therefore have the <strong>Udemy 30 Day 100% Money-Back Guarantee.</strong></p>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong>WHAT ARE YOU WAITING FOR?</strong></p>\n\n\n\n\n\n<p>Get your 'Fix' and join me on the other side. Click the green “Take This Course” button at the top right now… every minute you delay is another day of suboptimal health!</p>\n\n\n\n\n\n<p>I can't wait to meet you!</p>\n\n\n\n\n\n<p>Chané</p>\n\n\n\n\n\n<p><em>Creator of FIX IN SIX</em></p>", 
    "end_date": null, 
    "title": "Fix in Six Weight Loss Diet: Lose Weight+Gain Health in 6wks", 
    "price": "45.00", 
    "instructors": "Chane de Kock", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692140_7242_7.jpg", 
    "course_url": "https://www.udemy.com/weight-loss-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T17:14:26Z"
}