{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><br></p><p>1). Would you like to<strong> lose 10, 25, 50, even 100 pounds</strong> while still <strong>enjoying your favorite </strong><strong>treats</strong> (<em>yes, even pizza and ice cream)</em>? </p><p>2). Do you want to<strong> lose those extra inches</strong> from your belly, arms, hips and thigh while still <strong>enjoying dinners out, family events and vacations?</strong></p><p>3). Are you<strong> tired of restrictive diets </strong>that leave you feeling deprived and with <strong>terrible cravings? </strong><span></span></p><p>If you answered \"yes\" to at least one of those questions, then this course is for you! </p><p><strong>Flexible Dieting ( aka \"IIFYM\")</strong> allows you to achieve your weight loss goals while still enjoying all of your favorite foods ( and life!). <em>No food is off limits</em> as long as you stay within your unique calorie and nutritional parameters. No gimmicks, no fads, no magic pills or powders. Just <strong>real science and real results!</strong></p><p>Typical diets are super restrictive, extremely low calorie and leave you feeling hungry, deprived, and somewhat <em>cranky! </em><span></span></p><p><em> </em>Then what happens when you can't stick to the plan? </p><p>You give up, and gain the weight back and then some. </p><p><strong>It's time to break the dieting cycle once and for all! </strong></p><p><em>Flexible Dieting Mastery</em> walks you through the process of creating your very own customized nutrition plan that fits your goals and busy lifestyle, THEN shows you how to adjust your plan no matter what life throws at you ( and of course how to incorporate your favorite treats on a weekly, even daily basis). </p><p><strong>Upon successful completion of this course you'll be able to: </strong></p><ul><li> Create your own customized nutrition and weekly meals plan</li><li>Adjust your plan to include your favorite treats </li><li>Continue to meet your goals when dining out, at parties, or while traveling </li><li>Navigate the grocery store like a PRO </li><li>Plan your weekly meals to set yourself up for success </li><li>Determine whether a new diet craze is healthy or completely BOGUS!</li><li>Explain the difference between IIFYM and other \"traditional\" diets</li><li>Understand the important functions of the macronutrients in the human body</li><li>Identify common \"sneaky diet saboteurs\" </li></ul><p><br></p><p>Sign up and experience the most comprehensive flexible dieting course on the web! <br></p><p>Start Learning! </p><p>Enroll now and start dropping pounds and inches today! </p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p>BONUS #1: Follow me on Periscope for real time instructor-student dialogue (@Jacquifit)</p><p>BONUS #2: Your lifetime access to this course includes all ongoing updates</p><p>BONUS #3:  Gain free and discounted access to my courses and e-books </p><p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p><p><br></p><p><br></p><p><br></p><p><br></p>", 
    "end_date": null, 
    "title": "Flexible Dieting Mastery: Lose Weight Eating Food You Love", 
    "price": "30.00", 
    "instructors": "Jacqui Blazier", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633810_75dc.jpg", 
    "course_url": "https://www.udemy.com/flexible-dieting-iifym/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T17:26:23Z"
}