{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>*<strong>Completely </strong><strong>FREE Weight Loss Course</strong></p>\n\n<p><strong><strong>*<strong><strong><strong>Updated <strong>MAY </strong>2016 </strong></strong></strong></strong></strong><br></p>\n\n<p>Losing weight can be one of the hardest things you do in your life, <strong>but it doesn't have to be.</strong> If you have been struggling to lose weight or are intimidated to start, this is the solution for you. </p>\n\n<p><strong>Why This Course is Different From Others</strong></p>\n\n<p>I have found that most popular and trendy weight loss programs fail because they are so complex and demanding. They ask you to...</p>\n\n<ol><li>Completely change your diet and remove all of the foods that you love in order to lose weight. </li><li>Adhere to strict, intense exercise programs that cause you to lose weight quickly, and uncomfortably. </li><li>Overhaul your entire lifestyle, from work to leisure, making it really inconvenient for you to lose weight. </li></ol>\n\n<p><strong>Why Losing Weight is So Difficult</strong></p>\n\n<p>I have found in teaching THOUSANDS of students on Udemy to lose weight, that the biggest challenges you face are that you...</p>\n\n<ul><li>Are busy with work, your business, your job, or school</li><li>Have other obligations that </li><li>Don't have time to cook or learn a new skill to lose weight</li><li>Don't have the time or resources to go to the gym to lose weight.</li><li>You would love to lose weight, BUT you love food! We all do. </li></ul>\n\n<p><strong><em>Here's what I know for a fact:</em></strong></p>\n\n<p>Your time is the most valuable thing that you have, and there are so many other more important aspects to life than working out and cooking. Who has the time?</p>\n\n<p><em>*What if I told you that there was a simpler way to lose weight?</em></p>\n\n<p><em>*What if you could lose all of that stubborn weight you have been holding onto with the bare minimum of time commitment and effort?</em></p>\n\n<p><em><strong>*What if there was a way to lose weight that actually fit YOUR SCHEDULE and was seamless to follow?</strong></em></p>\n\n<p><strong>What you Are Getting in this Course</strong></p>\n\n<p>This course is composed of only the simplest and most effective habits that you can seamlessly integrate into your life so that you can lose weight and keep it off for good this time. </p>\n\n<p><strong>This course includes</strong></p>\n\n<ul><li>How you can lose weight by sleeping more and workout less</li><li>How drinking cold water will help you lose weight</li><li>How you can lower your stress and lose 10 pounds in a month</li><li>How you can cook less, eat more, and lose weight</li><li>Exactly how to naturally counteract your sweet tooth to lose weight successfully</li><li>How you can lose weight and never have to count calories again</li><li>One simple meal that will help you lose your first 20-40+ pounds</li><li>Workout 2-4 hours PER MONTH at home, lose weight, and get ripped</li></ul>\n\n<p><strong>No risk and the Ultimate Reward</strong></p>\n\n<p>If you have been trying to lose weight for years or have been intimidated to start, this is your chance. This is the easiest and most effective way to lose weight with simple habits that will fit with your everyday life.</p>\n\n<p>-Jack</p>", 
    "end_date": null, 
    "title": "Free Weight Loss Course: Weight Loss Made Simple", 
    "price": 0, 
    "instructors": "Jack Wilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/435764_3442.jpg", 
    "course_url": "https://www.udemy.com/weightloss/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-01T17:40:53Z"
}