{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em style=\"\">Refined sugar is wreaking havoc on our health and the health of our children</em>. It&#039;s no wonder that childhood obesity and disease is on the rise. With so many factors working against the health of our children, we must be proactive in helping them establish a healthy foundation for lifelong nutrition and positive connection with their body. </p><p><strong style=\"\"><em style=\"\">Get Your Child Back on Track: Hypnosis for Healthy Eating</em></strong> offers two invaluable tools to help your child create patterns for healthy eating. The first tool is a hypnosis recording called <em style=\"\">Sugar Ants</em>. This recording helps their subconscious mind begin <strong style=\"\">shedding addiction</strong> to and desire for added sugar and junk foods. It begins to develop a negative association with these damaging products and to <strong style=\"\">naturally increase the desire for healthier foods</strong>. </p><p>The second tool is a hypnosis recording designed to help them reconnect with their own body signals. Learning to tune into their body signals helps them to better understand the amount of food their body actually needs rather than simply what their mouth wants to eat. This tool is powerful in helping a child to establish patterns that lead to<strong style=\"\"> achieving and maintaining their ideal weight </strong>throughout their life. </p><p>The worlds does a mighty great job of leading our children to obesity and disease by establishing addictions and desire for unhealthy foods very early in life. It&#039;s up to us to take back the reigns and lead our child to healthy patterns that will serve them throughout their life. </p><p><em style=\"\">Our children need us to teach, guide, and help them</em>. They can&#039;t do it on their own. encourage you to enroll today and witness the powerful and healthy changes that follow. With a <strong style=\"\">30 day money back guarantee</strong>, you have nothing to lose and so much to gain. </p>", 
    "end_date": null, 
    "title": "Get Your Child Back on Track: Hypnosis for Healthy Eating", 
    "price": "30.00", 
    "instructors": "Melody Litton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541864_7dee_2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-for-healthy-eating/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T04:11:57Z"
}