{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*UPDATED JANUARY 2016</strong></p><p><strong>Why Has the Gluten Free Diet Become So Popular?</strong></p><p>Everywhere you look today restaurants, grocery stores, and even some fast food establishments are starting to advertise for their gluten free items. <em>But why?</em></p><p><strong>The Truth About Gluten</strong></p><p>Here are some things that you may not know about foods that contain gluten. </p><ul><li>The starches and sugars they contain cause you to gain weight and body fat</li><li>Gluten proteins have evolved over time and have developed defense mechanisms that actually hurt your stomach lining, and impair your digestion. </li><li>Wheat, rye, and barley ACTUALLY make you hungrier so it is harder to eat them and lose weight!</li></ul><p><em>Why do you think gluten allergies have become so prominent recently?</em></p><p><strong>The Gluten Free Diet and Weight Loss</strong></p><p>Just because a product is gluten free, doesn't mean that it is healthy for you. In fact, some gluten free products can be JUST AS BAD for gaining wait as gluten present products. The reality is that you need to know what gluten free foods to eat so that you can lose weight effectively </p><p><strong>Why a Gluten Free Diet is PERFECT for Weight Loss</strong><br></p><p>The truth is, removing gluten from your diet can be one of the most effective ways that you can lose weight, but you have to do it properly. By removing gluten from your diet and eating real, naturally gluten free foods, you will transform your body and the way you think about food. </p><p><strong>What you are getting in this course</strong><br></p><ul><li>Lose weight, cut your body fat percentage, and improve your energy with a gluten free diet. </li><li>Lose weight without ever having to set foot in a gym. No exercise required!</li><li>Awesome, naturally gluten free recipes that will help you lose weight. </li><li>Save hours of time in the kitchen by cooking 5 star restaurant meals while you sleep.</li><li>No calories cutting! Eat until you are full and still lose weight. </li><li>Lose 20-50+ pounds of body fat by filling up on savory and spicy gluten free recipes. </li></ul><p><strong><em>**Click \"Take this Course\" to start losing weight on the gluten free diet NOW!**</em></strong></p><p><br></p>", 
    "end_date": null, 
    "title": "Gluten Free Cooking for Weight Loss", 
    "price": "25.00", 
    "instructors": "Leandra Trydal, Jack Wilson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/667198_5c03_2.jpg", 
    "course_url": "https://www.udemy.com/glutenfreecooking/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T21:27:35Z"
}