{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hello,</p>\n\n\n\n<p>Thank you for stopping by!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As the course title mentions, this course is about cooking <strong class=\"redactor-inline-converted\">oil-free vegan food</strong>. I have been passionate about cooking for over 10 years now, and have experienced tremendous health benefits on shifting to a no-oil vegan diet.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I live in the UK, and I spent the first 25 years of my life in India. My first preference of food is Indian, and I realised that Indian food could be easily tweaked to meet vegan requirements, when I first turned vegan in December 2014.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">This course will teach you to make 3 fantastic Indian meals</strong>, all of them being completely vegan, and made without the use of oil. I have been making healthy food for family and friends, who are all pleasantly surprised to know <strong class=\"redactor-inline-converted\">great food can also be healthy</strong>!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course has at least 6 chapters devoted to help you understand the key techniques used in Indian cooking, and the different ingredients and cookware that you need to make these meals. Your journey will not stop with these 3 meals, the techniques taught in this course will empower you to experiment and cook many more dishes.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I would like to remind you that <strong class=\"redactor-inline-converted\">this course is probably about the price of a meal for two at a restaurant (or lesser!)</strong>, but has enough content and information to help you build your culinary skills for a lifetime. Hence,<strong> your return on investment is guaranteed by the time you complete making the meals in the course – learning to cook oil-free vegan food is an additional bonus for a lifetime!</strong>\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Hope you have a great time learning and cooking some great food!\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thanks,\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Balachander Vijayakumar (Bala)\n\n  </p>", 
    "end_date": null, 
    "title": "Healthy oil-free cooking for the hungry vegan", 
    "price": "25.00", 
    "instructors": "Balachander Vijayakumar", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/833172_cece_3.jpg", 
    "course_url": "https://www.udemy.com/thehungryvegan/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-27T05:43:20Z"
}