{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t  Long term diets don&#039;t work.  If they did the dieting industry wouldn&#039;t be a million dollar one.  </p>  <p style=\"\">  \t  How much money have you spent over the years on diets, supplements, diet pills,  meal replacements and of course let&#039;s not forget all the exercise equipment that stands in a cupboard somewhere and is never used, the gym memberships that you&#039;ve never maintained and the exercise classes that you paid for and never went to.  Aren&#039;t you sick and tired of wasting all that money and of course wasting your time and energy and hopes of a better healthier slimmer body that somehow just hasn&#039;t happened.  Well not long term anyway.  </p>  <p style=\"\">  \t  Have you ever wondered why no matter how hard you try and how successful you are when you&#039;re on a diet, why the weight never stays off?  </p>  <p style=\"\">  \t  It&#039;s because losing weight has very little to do with what you&#039;re eating and everything to do with your mind, your heart and who you believe you are.  It&#039;s to do with the words you say to yourself, your inner mind chatter.  </p>  <p style=\"\">  \t  Until you change that you will never be able to lose weight and keep it off  </p>  <p style=\"\">  \t  I&#039;ve been there and done it  And have been doing it for over 25 years and as a qualified health and wellness coach I also help others as well  </p>  <p style=\"\">  \t  You will learn how to get rid of those beliefs that are keeping you stuck in the yo-yo dieting spiral.  And not just get rid of them, but replace them with positive supportive ones which will lead you to the healthy happy slender body that is yours by right.  </p>  <p style=\"\">  \t  This course will show you that what&#039;s on the inside is far more important than what&#039;s on the outside.  And once you&#039;ve mastered that the outside will change too.  </p>", 
    "end_date": null, 
    "title": "How to Lose Weight without Dieting ", 
    "price": "45.00", 
    "instructors": "Adrienne Marks", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/399324_aa56_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-lose-weight-without-dieting/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-20T20:26:27Z"
}