{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>\"Outstanding! This is the best nutrition education that I have ever had. The information is comprehensive and explanations are clear, concise, and easy to understand.\" - Marianne Heath</p>  <p><strong>** Lose Weight While Feeling Full with the Foods You Enjoy **</strong></p>  <p>If you want to lose weight, feel better, and improve your quality of life this course is for you.</p>  <p><strong>Learn how to lose weight and keep it off without dieting or going hungry.</strong></p>  <p>No counting calories! No starving yourself!</p>  <p><strong>What this is course is NOT: </strong></p>  <p>This course is not a fad weight loss program. You will not need to exercise hours a day either.</p>  <p><strong>What this course IS:</strong></p>  <p>This course makes the complicated science of losing weight seem simple. What we will focus on are the positives - eating more of the healthy foods you like, and doing the activities you enjoy.</p>  <p><strong>My experience: </strong></p>  <p>Many of my clients have lost 20, 50, and 100 pounds or more. They are frequently asked by family and friends, \"what diet are you on?\" The reply I hear is almost always the same: \"I'm not on a diet, I'm just eating better.\"</p>  <p>There is also a 30 Day Money Back Guarantee! - there is absolutely no risk to you for trying the program out.</p>  <p><strong>How Is This Different From Other Weight Loss Programs?</strong></p>  <p>In this course I will walk you step-by-step through the process of losing weight and maintaining your new weight by creating a healthy diet and lifestyle tailored to your personal preferences that you enjoy and can stick with.</p>  <p>Whether your goal is to lose 20, 50, or 100 pounds or more I will show you exactly how to accomplish your weight loss goals so that you can feel better, have more energy, and improve your overall quality of life.</p>  <p>Learn how to implement a proven and simple strategy to lose weight without going hungry.</p>  <p><strong>Who Am I?</strong></p>  <p>I'm a Licensed and practicing Registered Dietitian Nutritionist and Certified Diabetes Educator. I've spent more than the last decade studying nutrition and also work with people every day to lose weight and improve their health. I have worked with thousands of people to lose weight, improve their health, and maintain their new weight.</p>  <p>In this course I am going to show you exactly what I teach them so that you can do the same.</p>  <p><strong>Don't Diet!</strong></p>  <p>If you have been on a diet before you have probably noticed most diets can be very restrictive. Many diets eliminate certain foods, or even entire food groups you enjoy. This is one reason why dieting doesn't work long-term. In fact, did you know most people who lose weight on a diet regain the weight they lost within a few months to a few years after going off the diet?</p>  <p><strong>Choose Your Own Lifestyle!</strong></p>  <p>Because of this I developed a system to help you create your own custom-made healthy diet and lifestyle you can stick with that will provide you with the results you want.</p>  <p>This program consists of a comprehensive set of guidelines designed to help you lose weight and maintain your new weight without having to eat less food, go hungry, or feel like you are on a diet.</p>  <p><strong>What are the Course Requirements?</strong></p>  <p>I recommend reviewing the handouts provided for each lecture. These are designed to help you with each step of the process towards customizing your own healthy lifestyle. If you would like to print the handouts you will need access to a printer. If you do not have access to a printer then notebook paper and a pen or pencil is all you will need.</p>  <p>You may also need a measuring tape, and a calculator. Although, these are not required.</p>  <p>****************************************************************************************************************</p>  <p><strong>Medical Disclaimer:</strong> The information provided in this program should not be used as a substitute for, or to replace, professional medical advice. You should always consult with your licensed healthcare provider before you start any diet, or begin an exercise regimen. The use of any information provided in this program is solely at your own risk.</p>  <p>****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "How to Eat More, Lose Weight & Keep It Off!", 
    "price": "20.00", 
    "instructors": "Caleb Frazier, RDN, CDE", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512198_3d56_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-eat-more-lose-weight-keep-it-off/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-26T20:38:49Z"
}