{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<em style=\"\">Get the Body and Health you’ve Been Dreaming of by Changing your Mindset.</em>  </p>  <p>  \t<strong style=\"\"><em style=\"\">The Problem…..</em></strong>  </p>  <p>  \t  You have been taking pills and supplements to lose weight. You have tried every fad diet under the sun.  You have been spending all your money on a gym membership that you never use because you can&#039;t find the motivation to go.  All of this and you still haven&#039;t dropped the weight or achieved your health goals!  You are sick of eating when you get stressed, tired or sad.  You are sick of lacking the confidence in yourself and your body to achieve what you want to achieve.  You want to lose weight for your health, family or loved ones and you desire to bring back your self-confidence that was lost when you put on weight.  </p>  <p>  \t<strong style=\"\"><em style=\"\">The Solution…</em></strong>  </p>  <p>  \t  I am pleased to offer a valuable course that will help you lose weight and obtain your health goals by changing your mindset.  </p>  <p>  \t  This course is about identifying the roadblocks to your health goals’ success and creating new innovative solutions to become successful in the future. No pills required! No surgery needed! And no feeling sad, deprived or stressed in the process of getting to your goal.  In fact, the aim is to enjoy the journey towards your physical and mental health.  It&#039;s not all about achieving happiness once you reach your goal weight.  This course will teach you how to enjoy yourself and feel confident as you are now and when you reach your goal.  </p>  <p>  \t  By signing up to this course and taking action on the tasks set, you will be on your way to achieving the healthy body and mind you’ve been dreaming of!  </p>", 
    "end_date": null, 
    "title": "How to lose weight:  Change your mind to change your body.", 
    "price": "20.00", 
    "instructors": "Miranda Hall", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/101846_6e89.jpg", 
    "course_url": "https://www.udemy.com/change-your-mind-change-your-body-keep-the-fun/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-05T12:11:29Z"
}