{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>Are you someone who</strong>;<br></p>\n\n<p>1) Is addicted to sugar and craves it after every meal</p>\n\n\n\n<p>2) you want to brake the cycle and eat less sugar but don't know where to start.</p>\n\n\n\n<p>3) is sluggish because of a lack of energy.</p>\n\n\n\n<p>Do you want more energy, glowing skin, and want to be happier and healthier, start making your own superfood snacks.</p>\n\n\n\n<p>Create super easy snacks with step by step video instruction.</p>\n\n\n\n<p>Look at what our students think:</p>\n\n\n\n<p>\"I enjoyed every aspect of this course. The videos are gorgeous. The step-by-step instructions are detailed and clear. And the recipes are simple, healthy, and scrumptious. My husband and I especially loved the Superfood Fudge. Thank you, Danica, for a fabulous course!\" Sue Kiser</p>\n\n\n\n<p><strong>Learn To Cook Super Food Treats To Be More Energized and Be Your Best Self</strong><br></p>\n\n\n\n<p><strong></strong><br></p>\n\n<ul><li>Learn about different healthy ingredients and why there good for you</li><li>Learn to make desserts without refined sugar, gluten, and animal fat</li><li>Learn step by step how to make interesting healthy desserts that are so good for you, you can eat them for breakfast</li><li>Why making your own treats is better then buying them</li><li>How to change and adapt the recipes to suit your tastes </li><li>How to choose alternatives for refined sugar that make you feel better</li></ul>\n\n\n\n<ul><li>How to make treats that keep you satisfied and take you off the sugar roller coaster </li></ul>\n\n\n\n<p><strong>Be in control of what goes in your body by making your own super food treats</strong></p>\n\n\n\n<p>You will learn which ingredients make you feel good and give you energy. What types of nutrients are in these powerful ingredients. How these healthy food make desserts that taste good and leave you satisfied not craving more and more. More people are realising the damaging effects of refined sugar and how it is in everything in large quantities. Some people want to stop being addicted to sugar and have more varied ingredients in their diet. That is what you can find in this course how to use different super foods to help you eat less damaging refined sugar.</p>\n\n\n\n<p><strong>Overview</strong></p>\n\n\n\n<p>11 super food sweet treat recipes</p>\n\n\n\n<p>I will be adding new recipes often so this course content will grow!</p>\n\n\n\n<p>Step by step instruction that put you in the action so you can easily duplicate what you see in a fun short video with music (by BenSound), comments, and interesting ingredients overview.</p>\n\n\n\n<p>How to make home made nut butter, granola, cookies, bars, crackers, muffins, coconut whipped cream, sweet pastry, fudge, brownies, and crumble topping.</p>\n\n\n\n<p>Use super food ingredients:</p>\n\n\n\n<ul><li>Sweet potatoes </li><li>chia seeds</li><li>coconut oil</li><li>quinoa</li><li>chickpeas</li><li>coconut, almond, hazelnut, buckwheat flour</li><li>pumpkin, sesame, flax, sunflower seeds</li><li>oats</li><li>dates, figs, apricots, raisins, plums, </li><li>raspberries and many more</li></ul>\n\n\n\n<p>These recipes are good for you but taste like there not! They are easy enough for any skill level in the kitchen. You will not need to spend hours in the kitchen just an hour or two out of your busy week will give you enough time to have these treats ready for you and your family. They will live up to the taste buds of non healthy eaters and delicious enough to serve your friends. </p>\n\n\n\n<p><strong>These desserts are not diet food</strong> but treats that have varied ingredients to keep snacking interesting, to keep you feeling good, and full of energy. All the ingredients in this course are easy to find at any food store and aren't crazy expensive. Making these treats will save you money by not having to buy chemical laden fake sugary food. So as a result you will lose weight naturally, boost your immune system, and have a healthy glow. How could you not want all of that by just making a few changes in the kitchen that will change your life. Start eating super foods!</p>\n\n\n\n<p>If you are not happy you have the Udemy 30 day 100% money back guarantee</p>\n\n\n\n<p><strong>Buy this course so you can start becoming your happiest, healthiest, best self!</strong></p>\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn How to Quit Sugar By Making Your Own Superfood Snacks", 
    "price": "20.00", 
    "instructors": "Danica Burton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703252_845b_5.jpg", 
    "course_url": "https://www.udemy.com/learn-to-make-superfood-desserts-to-quit-sugar-lose-weight/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-21T20:48:20Z"
}