{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>This <strong>60 Day</strong> Hypnotherapy Online Programme for <strong>Weight Loss </strong>is a unique combination of Video, Audio and Workbook Tutorials.</p><p>This programme has a structured process that you will be required to follow, and you will need to set aside <strong>one hour a week</strong> to complete the weekly workbook, and also<strong> listen to the 30min audio track every night </strong>as you fall asleep. <em>(You don't have to stay awake to listen to it, you need to play it as you fall asleep.)</em></p><p>This <em>Online Hypnotherapy Programme for Weight Loss</em> is for you if you have struggled with your weight in the past and you find it hard to stay motivated and on the right track.</p><p>You will learn the following skills:</p><ul><li>How to<strong> set your goals</strong> for yourself</li><li>How to <strong>stay on the right track</strong></li><li>How to <strong>make proper choices</strong></li><li>How to<strong> remain motivated</strong></li><li>How to <strong>build new habits</strong> into your life</li></ul><p>Once you begin the programme it is designed for you to use the Videos once a week, ideally the same day every week and the audio track every night. </p><p> The workbook is for you to download and print out to keep track of your progress.</p><p><em>Results do vary person to person.</em>  We see excellent results if the programme is followed exactly as it is designed.  You will have <strong>lifetime access</strong> to the Programme, so you will be able to repeat is as often as you want to.</p>", 
    "end_date": null, 
    "title": "Learn how to Lose Weight and Feel Great with Hypnosis", 
    "price": "40.00", 
    "instructors": "Dipti Tait", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/584260_5aca_4.jpg", 
    "course_url": "https://www.udemy.com/hypnotherapy-for-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-16T05:12:07Z"
}