{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">You can lose up to 20 pounds of FAT in the next 30 days by following my very HEALTHY Paleo Fat Loss Plan... It's so simple, just eat luscious and very tasty GOOD FAT, protein, and veggies to turn your body and cells into FAT burning machines.</strong></p>\n\n<p>Humans are meant to burn mostly FAT 99% of the time, but most people today burn mostly SUGAR 99% of the time in the form of carbohydrates instead. The typical American diet today is mostly carbs and sugar, that's why most people are fat! Don't be like most people!</p>\n\n<p><strong class=\"redactor-inline-converted\">Paleo style diets are now THE most popular weight loss AND health gaining plans anywhere... FOR. A. GOOD. REASON. They work better than any other old school diet that you've ever read or heard about.</strong></p>\n\n<p>You eat lots of luscious, tasty, wholesome food... the kind of food humans are meant to eat... there's no counting calories or weighing your food! You're never hungry!</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">When you eat the right kind of food, you become leaner and healthier NATURALLY!</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Paleo allows you to lose weight AND get healthier because it's so simple and intuitive, it's just eating, moving, and sleeping like humans are designed to! </p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">When you start treating your body like it was designed to be treated, you'll be rewarded with a lean, fit, healthy, energetic, happy NEW YOU! </strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>So why take this course?<br></em></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Most people don't have time to read a book. Watching a online course is much faster and way more interesting</strong></p>\n\n\n\n\n\n\n\n\n\n<p>My deeper insight into more of the WHY this all works so well, gives you that extra level of understanding and motivation so that you'll be more likely to actually do this!</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">If you're like me, you need to know and understand the WHY of how things work before you actually invest the time and energy doing it.</strong></p>\n\n\n\n\n\n\n\n\n\n<p>It's all about turning on your healthy hormones and turning off the unhealthy ones... and this is so simple to do... IF you know how to do it. It's not hard and you'll actually enjoy it.</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Click The Green \"Take This Course\" Button Above and Let's Get Started! </strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here's what you'll get from this course:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li><strong class=\"redactor-inline-converted\">Learn how a paleo eating plan helps you rapidly burn fat, increase energy and health</strong></li><li><strong class=\"redactor-inline-converted\">Learn to exercise smarter: the minimum amount for maximum healthy fat loss</strong></li><li><strong class=\"redactor-inline-converted\">Discover how to improve your sleep &amp; quickly boost fat loss, energy, and health</strong></li><li><strong class=\"redactor-inline-converted\">Find out how simple improvements in your daily habits can boost your fat loss</strong></li><li><strong class=\"redactor-inline-converted\">Recognize how to quickly &amp; simply reduce stress for maximum healthy fat loss</strong></li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">See What Current Students Have To Say About This Course:</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\" <strong class=\"redactor-inline-converted\"><em>Usable information that is easy to understand...</em></strong><em> I have been reading up and researching on Paleo lifestyle information. This course offers details of meals and activity in a format that is easy to understand and explains why to follow this plan. I really enjoyed and understood the course and the science behind the program</em>. <strong class=\"redactor-inline-converted\">- Carol Schuett</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\" <em><strong class=\"redactor-inline-converted\">Very informative on the paleo lifestyle...</strong> Did a good job on introducing others who are new to eating Paleo and simple changes anyone can make in order to start feeling better and looking better. Highly recommended but more importantly applying what you learn so you can see if you too feel the difference after 30 days. - </em><strong class=\"redactor-inline-converted\">Matt West</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\" <strong class=\"redactor-inline-converted\">Good introduction to the paleo health concept...</strong> <em>The instructor's clear explanation of the concepts behind paleo lifestyle is matched by his enthusiasm for helping people become healthier. The course offers an overview of what Paleo is about, and his resources for shopping, exercise and more information are helpful. I recommend the course to anyone who is beginning to learn about nutrition and health. - </em><strong class=\"redactor-inline-converted\">John Martin</strong></p>\n\n\n\n\n\n\n\n\n\n<p>\" <strong class=\"redactor-inline-converted\"><em>I support the Paleo...</em></strong><em> I'm very supportive of the Paleo diet and have been since I first heard about it. I was very impressed with the quality of this course and would definitely recommend it to others who are looking for a way to lose weight healthily and naturally. </em><strong class=\"redactor-inline-converted\">- Carl Jones</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••</strong><br></p>\n\n\n\n\n\n\n\n<p>(<strong class=\"redactor-inline-converted\">Important Disclaimer Notice:</strong> Please talk with your doctor before starting this or any other diet and/or exercise program. Changing your diet and exercise habits is not without risks and may result in sickness or injury. By watching this course and attempting any diet or exercise routines, you agree to do so at your own risk and assume all liability for sickness or injury.)</p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••••</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">[ PRO TIP: Go to the book list on lecture 15 after finishing this course and read at least one book from the top 3 and this course will work at least 10 times better for you! ]</strong></p>", 
    "end_date": null, 
    "title": "Lose Up To 20 Pounds In 30 Days With This HEALTHY Paleo Plan", 
    "price": "20.00", 
    "instructors": "James Forno", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/368480_469e_20.jpg", 
    "course_url": "https://www.udemy.com/fast-healthy-paleo-weight-loss-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T23:56:57Z"
}