{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><p><strong>*Updated JUNE 2016<br></strong></p><p><strong>*Join over 3,000 successful students who are losing weight on the paleo diet</strong><strong><strong><strong><strong><strong> </strong></strong></strong></strong></strong></p><p><strong>If you need to or have been struggling to...</strong></p><ul><li>Lose weight</li><li>Lose body fat</li><li>Trim the fat off of your belly, hips, thighs, arms, and legs</li><li>Lose inches on your waist</li><li>Get in shape</li><li>Lose weight but do not have the time or energy to workout</li><li>Find a weight loss solution that doesn't require hours of meal prep and cooking time</li></ul><p><strong><em>I have created just the solution for you. </em></strong></p> <p><strong>What Is Paleo?</strong></p><p>The paleo diet takes the modern foods that we have available in today's society, and models it after how our ancestors ate in the stone age during what we refer to as the hunter-gatherer era. </p><p>It is not uncommon for my clients and students to lose 5-10 pounds in the first WEEK of changing your diet to paleo. (*see the testimonial below)</p><p><strong>Why Paleo?</strong></p><p>If you haven't yet heard about paleo, you are about to. Paleo is not only one of the most effective diets you can use to lose weight, it is hands down one of the most effective eating lifestyles that we have seen in the history of mankind. This IS NOT another trendy fast, cleanse, juice diet, 30 day diet, or 3 week program to lose weight. </p><p><em>This is a lifestyle weight loss solution.</em></p><p>This diet is for safe, effective, and sustainable weight loss. Paleo enables you to lose all of the weight that you have been trying to get rid of for months and years now.</p><p><strong>Want to know the best part?</strong></p><p>One of the best parts about the paleo diet is that you DO NOT have to COUNT CALORIES to lose weight.</p><p>I try to get into contact with every new student I have on all of my courses to find out what their greatest goals and challenges are. One of the BIGGEST questions I get is... </p><p><strong><em>“Can I lose weight without counting calories?\"</em></strong></p><p>The answer is a resounding YES!</p><p>By focusing on eating real foods that your body recognizes and has no trouble digesting, the weight will seem like it's falling off of you. You won't have to journal or track a single calorie on the paleo diet, and you will lose weight seamlessly. Losing weight has never been so easy.</p><p><strong>Exercise on the Paleo Diet</strong></p><p>Want to know something else that is really incredible about the results that you can see on the paleo diet?<strong> You DO NOT have to exercise to lose weight on paleo. </strong></p><p><strong>Lose Weight on Your Time: Your Personalized Solution to Lose Weight</strong></p><p>From asking most all of the students who's primary goal is to lose weight, I know that many of you are extremely busy with your work, career, business, family, passions, obligations, travel, and hobbies to find time to workout or go to the gym. </p><p>Exercise is a huge commitment to lose weight, and it can take a lot of time and energy. That means it can also take time away from some of the most important things and people in your life. </p><p>With the paleo diet you are going to save hours every week of... </p><ul><li>Driving to the the gym and back</li><li>Planning your workout</li><li>Finding a parking spot</li><li>Fighting for machines and weights</li><li>Showering again</li><li>and fixing your post-workout meal</li></ul><p><strong>How Much Weight You Can Lose On Paleo</strong></p><p>You may be thinking, “I have a lot of weight to lose. Can I really drop 20, 30, 40, 100+ pounds without counting calories and working out?\"</p><p><em>You absolutely can!</em> </p><p>I have trained hundreds of clients in person and thousands online who lose weight on the paleo diet, without exercising one bit. </p><p><strong>In fact, I just got this message last week from one of my Udemy students who is losing weight on my paleo diet challenge.</strong></p><p><em>“I know the title sounds a bit over-the-top but it is actually true. I'm one of those people that Jack mentions in the course who don't have time to exercise so I decided to give his 10 day food challenge (my paleo diet challenge) a go. It went so well for me I decided to stick with it. <strong>I've been going for 7 weeks now and </strong></em><strong><em>I've lost just over 6 kilos (13 pounds) and counting</em><em>. </em></strong><em><strong>Without any exercise whatsoever</strong></em><em><strong>.</strong> I got rid of processed foods, I eat very little dairy now (I can't resist a bit of cheese every now and again!), I make decent healthy snacks to eat during the day, make sure I have breakfast every day, drink plenty of water and green tea and it has made a huge difference. I feel better and have more energy but most of all, the weight is coming off. I haven't set any mad targets, I see this as a lifestyle change rather than a diet, I'm looking at it long term. I don't want to be in shape just for summer. I want it to be a permanent thing. I know that at some point I will need to do some exercise to get all the weight off but it's going to be so much easier with the start I've got from Jack's plan.\"</em></p><p>-Paul W.</p><p>Does that busy schedule sound familiar? </p><p><em>Isn't that great news that you can lose weight on the paleo diet without having to count a calorie or set foot in the gym to exercise?</em></p><p><strong>Food for thought</strong></p><p>Weight loss is governed 80-90% by what you are eating. The last 10-20% covers stress management, exercise, and supplementation which can enhance your weight loss, but they are not necessary to lose weight. </p><p>If you have been struggling to lose weight, lose body fat, and trim inches for months or years but don't have time to, this solution is for you.</p><p><strong>30 Day Trial</strong></p><p>If you aren't happy with the results you are seeing on this course, I want you to find the best solution FOR YOU to lose weight. The paleo diet is a great solution for weight loss, but I realize that this program isn't the best fit for everyone. </p><p>That is why if you aren't happy with your results, you have the <strong>Udemy 30 Day 100% Money Back Guarantee. </strong></p><p><strong>What do you have to lose?</strong></p><p><strong>Nothing (except for the weight you have been dying to lose)</strong>, and you will have everything to gain in working toward your goals! Try this course for 30 days, lose weight, and if you aren't happy, <strong>you will get a full refund. </strong></p><p><strong>What are you waiting for? </strong></p><p>If you are miserable with the way you look and feel now and have been struggling to lose weight, <strong>click “Take this course\"</strong> and start losing weight on paleo now. </p><p>I can't wait to hear about your results. </p><p>-Jack</p></ul>", 
    "end_date": null, 
    "title": "Lose Weight Without Counting Calories. Lose Weight on Paleo", 
    "price": "25.00", 
    "instructors": "Jack Wilson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/496278_c3bb.jpg", 
    "course_url": "https://www.udemy.com/paleodiet/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-07T21:20:04Z"
}