{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In these Four Simple Steps to Easy Weight Loss, you‘ll discover how to ditch the diet and let go of the diet mentality, how listening to your body instead of your head helps you to lose weight, how to make one change that will transform your daily diet and why preparing is such a vitally important step on your weight loss journey.  There are also four simple weight loss tips to help you on your journey and four simple non-diet recipes for you to try.<br></p><p>This course is different from any other weight loss course because weight loss, or gain, is never just about the food we eat. This course will help you see that weight loss is more about the way we think about ourselves and the food we eat and how easy it is to change that thinking.<br></p><p>I am a Wellbeing and Weight Loss Coach and have been working in this field for more than a decade. I am also an author and have Diplomas in Diet, Nutrition and Raw Food Nutrition. </p><p><strong>Learn how how these simple steps can transform your life</strong></p><ul>\n<li>you’ll get four simple tips to help you on your weight loss journey</li>\n<li>you’ll get chapters to help you change the way you think and the way you eat forever</li>\n<li>you’ll get four simple, tasty non-diet recipes to try at home</li>\n</ul><p><strong><br></strong></p><p><strong>About this course</strong></p><p>This course is for anyone who has ever been overwhelmed with diet information and would just like some simple steps to follow to lose weight. For anyone who is desperate to change their eating habits and is fed up with a barrage of different, contradictory diet information.  This course will make your life, your weight loss journey and your food choices, simple.</p><p><br></p><p><em>My problem in the past was that I loved food and as a consequence ate too much. I have stopped eating diary foods and bread - these have been substituted with soya milk and gluten free bread and I have never felt better. My only regret is that I did not discover Elaine 20 years ago.</em><em></em><br></p><p><em><br></em></p><p><em><em>It’s been amazing, I’ve lost 2 stone already and know that the rest will gradually go too.  I just have a different relationship with food now, it doesn’t rule my life, yet I still enjoy my meals. And some of the suggestions equally to other areas of my life too, so generally I’m feeling more confident and optimistic, and even enjoying exercise too!  I really can’t praise this system enough.’</em><br></em></p>", 
    "end_date": null, 
    "title": "Lose Weight: Four Simple Steps to No Diet Weight Loss ", 
    "price": 0, 
    "instructors": "Elaine Hilides", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661156_6101_3.jpg", 
    "course_url": "https://www.udemy.com/lose-weight-four-simple-steps-to-easy-weight-loss/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T14:54:55Z"
}