{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t             This course is designed to be a stand alone weight management program or as an add-on to any other diet or weight loss program you might currently be using.  Learn how to control your relationship with food.  Understand how our primitive instincts aren&#039;t relevant today and how that affects your weight and your choices.  </p>  <p style=\"\">  \t             This video course will provide you with tips and tools to better management your weight and allow you to make those good choices.  </p>  <p style=\"\">  \t<strong style=\"\">  Understand the who, what, when, where, </strong><strong style=\"\">and</strong><strong style=\"\"> why&#039;s of food:</strong>  </p>  <p style=\"\">  \t          *Who - YOU!  </p>  <p style=\"\">  \t          *What - What foods should you eat?  </p>  <p style=\"\">  \t          *When - When are the best times to eat and what foods should you eat?  </p>  <p style=\"\">  \t          *Where - Where should you get your food and what do you get?  </p>  <p style=\"\">  \t        *Why - Why do we have urges for food and how can we deal with them?  </p>  <p style=\"\">  \t          Learn from one of the leading hypnotherapists in Northern California, who has successfully helped hundreds of struggling clients attain their optimal weight.  </p>  <p style=\"\">  \t<strong style=\"\"> Course Outline:</strong>  </p>  <p style=\"\">  \t    PLEASE DOWNLOAD Included material: video/animated lectures, documents, Power Point slides, audio hypnosis recordings. The downloads are available to the right of the movie playing (you might have to click on the arrow in the upper right hand corner to reveal other info (note pad, downloads, announcements and class outline).  </p>  <p style=\"\">  \t          The average student should be able to complete this course within a week, but can continue to use the content going forward. The course includes short, but content dense information that can be viewed multiple times. Included are three audio hypnosis recordings that can be used daily to promote better mental health and sleep.  </p>  <p style=\"\">  \t          The class is separated into 5 sections.  The first four sections discuss your relationship with food and building habits that allow you to better manage your weight. Each of these sections includes tips and tools for you to apply to your daily life to help you attain and keep your ideal figure.  </p>  <p style=\"\">  \t          The 5th section includes audio hypnosis recordings that you can use in your daily routine for better mental health, better sleep and to reinforce the mindset and lessons from the course.  </p>  <p style=\"\">  \t          Let me help you achieve your goal of managing your weight not just for today, but for the future.  <strong style=\"\">Take this course today</strong> and let&#039;s make this change happen, now.  </p>", 
    "end_date": null, 
    "title": "Lose Weight: While Eating a Pizza", 
    "price": "20.00", 
    "instructors": "Alan Barsky", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247856_00eb_6.jpg", 
    "course_url": "https://www.udemy.com/lose-weight-while-eating-a-pizza/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-21T22:40:26Z"
}