{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*UPDATED JUNE 2016 <br></strong></p><p><strong>*Join over 3,000 successful students who are losing weight WITHOUT exercising</strong></p>\n\n\n\n\n\n\n\n<p><strong><em>Have you been struggling...</em></strong></p>\n\n\n\n\n\n\n\n<ul><li>To <strong>lose weight?</strong></li><li>To lose weight and <strong>keep it off?</strong></li><li>With <strong>losing weight </strong>and <strong>gaining it all back, AND MORE?</strong></li><li>With finding time or <strong>motivation to go to the gym?</strong></li><li><strong>To eat healthier?</strong></li><li>To find the <strong>time or energy to cook?</strong></li><li>With trying dozens of different diets, <strong>but none of them will work for you?</strong></li><li>To find someone <strong>who will support you in your weight loss?</strong></li></ul>\n\n\n\n\n\n\n\n<p><em>If there is <strong>an easier way to lose weight. </strong></em></p>\n\n\n\n\n\n\n\n<p><strong></strong>*What if you could<strong> lose all the weight you want </strong>without  ever breaking a sweat or <strong>setting foot in a gym?</strong></p>\n\n\n\n\n\n\n\n<p><strong><em>So how do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n<p><strong></strong>If you have been contemplating losing weight for weeks, months, or years<strong> but don't have the time to exercise, this program is for YOU!</strong></p>\n\n\n\n\n\n\n\n<p>If you are too busy during the week to make time to workout or go to the gym, or if you are incapable of working out or exercising, no worries! You can still lose weight without breaking a sweat. </p>\n\n\n\n\n\n\n\n<p><strong>Why most popular diet programs FAIL when it comes to weight loss...</strong></p>\n\n\n\n\n\n\n\n<ul><li>They ask you to dramatically cut your calories by 50% OR MORE </li><li>They will leave you feeling hungry every day</li><li>Slowing your metabolism so that you struggle to break through plateaus to lose weight</li><li>Their programs are designed to give you RAPID weight loss results at unsafe rates</li><li>They burn you out on eating bland foods to lose weight</li><li>You will crash from having low blood sugar, go on a binge eating spree, and gain back all of the weight you lost and more. </li><li>Requires strenuous, time consuming exercise programs to lose weight</li><li>Requires hours of cooking and preparation time for food and meals that \"optimize weight loss\"</li></ul>\n\n\n\n\n\n\n\n<p><strong>Why This Program is Different...</strong></p>\n\n\n\n\n\n\n\n<ul><li>No dramatic calorie cutting involved for weight loss</li><li>Making sure you eat until you are completely satisfied and full after every meal</li><li>No workouts or exercise required to lose weight</li><li>Gradual weight loss so that you can lose weight and keep it off for good this time</li><li>Cuts hours of time in the kitchen by simplifying cooking and meal prep</li><li>Simple, time-saving techniques to make great tasting healthy food in massive quantities</li></ul>\n\n\n\n\n\n\n\n<ul><li>How to lose 20-100+ pounds of fat without working out at all</li><li>Why popular diet programs don't work</li><li>Why your current diet is wrecking your body and causing you to gain/retain weight</li><li>Why tracking applications are perfect to lose weight</li><li>Exactly what, how, when, and how much you need to be eating to lose weight without exercise</li><li>What foods to avoid to lose weight</li><li>How to lose weight with my favorite weight loss recipes</li><li>How you can save hours of time cooking and make 5 star quality meals</li><li>Why healthy food can taste bland, and how to make it taste phenomenal with some simple, time-saving techniques</li><li>How to eat until you're FULL and still lose weight</li></ul>\n\n\n\n\n\n\n\n<p><strong>80% of your ability to lose weight</strong> is governed by what, when, and how you are eating. That being said, it doesn't matter if you are a 20 year old college athlete who is trying to cut weight for a competition, or 60+ years old and are trying to get in shape with your grandchildren. </p>\n\n\n\n\n\n\n\n<p><strong>This program is designed for all levels of experience, and any age. </strong><strong><em>*How does this work for such a wide array of people? </em></strong></p>\n\n\n\n\n\n\n\n<p><strong><em>Don't different age groups have different needs?</em></strong></p>\n\n\n\n\n\n\n\n<p><strong><em></em></strong>Sure! We all have different nutrition and caloric needs based on our genetics and body types, but at the end of the day we all function best and can lose weight with one important thing...</p>\n\n\n\n\n\n\n\n<p><strong>EATING REAL FOOD!</strong>The reason that most you have been struggling to lose weight is because you have been consuming...</p>\n\n\n\n\n\n\n\n<ul><li><strong>Wheat, rye, barley,</strong> and other grain based carbohydrates</li><li><strong>Synthetic </strong>and <strong>processed </strong><strong>starches and sugars</strong></li><li><strong>Dairy</strong></li><li><strong>Alcohol</strong></li><li>Sodas, juices, energy drinks, and other <strong>high calorie beverages. </strong></li></ul>\n\n\n\n\n\n\n\n<p><strong>*Think of your body as an intelligent computer.</strong> It has a much easier time reading information and using files <strong>that are simpler to process.</strong> When you give it a file format that it doesn't recognize or is extremely complex it overloads your CPU, occupies more memory space, and <strong>slows down your machine. </strong><strong>Which do you think your body has an easier time reading and using?</strong></p>\n\n\n\n\n\n\n\n<p>An orange? Or a Bagel? </p>\n\n\n\n\n\n\n\n<p>Carne asada with peppers and onions? Or Pasta Alfredo?</p>\n\n\n\n\n\n\n\n<p>Black coffee? Or an energy drink?</p>\n\n\n\n\n\n\n\n<p>Smoked salmon with sauteed asparagus? Or a fast food chicken sandwich?</p>\n\n\n\n\n\n\n\n<p>Green tea? Or a margarita? </p>\n\n\n\n\n\n\n\n<p>I want you to consider something. </p>\n\n\n\n\n\n\n\n<p>How many days, months, and years have passed <strong>that you have wanted to lose weight, but were afraid to try? </strong></p>\n\n\n\n\n\n\n\n<p><strong></strong><strong>How long have you put off your own health and well-being?</strong><strong> </strong></p>\n\n\n\n\n\n\n\n<p><strong>What are the barriers that have been stopping you from losing weight and transforming your body forever?</strong></p>\n\n\n\n\n\n\n\n<p>Not long ago, I was nearly 50 pounds overweight before losing weight changed my life forever. I was completely miserable with the way I looked and felt, and I want to help you make that change.</p>\n\n\n\n\n\n\n\n<p>If you are desperate to lose weight and don't have the time to exercise, <strong>this is the solution.</strong></p>\n\n\n\n\n\n\n\n<p>I want you to remember something. <strong>Hundreds of my clients have lost their goal weight on this program</strong>, but if you are unsatisfied with this course,<strong> I want you to find the solution that does. </strong></p>\n\n\n\n\n\n\n\n<p>If you take this course and are not completely satisfied, <strong>Udemy and I will give you 100% of your money back.</strong> I want to make sure that you find the <strong>course and method that works best for YOU. </strong></p>\n\n\n\n\n\n\n\n<p>Otherwise, if you are done with being unhappy and want to <strong>start losing weight NOW, click \"take this course\" to get started. </strong></p>\n\n\n\n\n\n\n\n<p><em>Can't wait to see and hear about your results. I am so incredibly grateful that you would take my course to get you to your goals. </em></p>\n\n\n\n\n\n\n\n<p>-Jack</p>", 
    "end_date": null, 
    "title": "Lose Weight Without Exercise: No Sweat to Lose Weight", 
    "price": "20.00", 
    "instructors": "Jack Wilson", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434758_3394.jpg", 
    "course_url": "https://www.udemy.com/loseweight/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-28T06:03:42Z"
}