{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Discover how to use hypnosis to create the slim person's mindset\nto finally achieve your vision and maintain your ideal weight goals. \n</p><p>Realise that all learning, behaviour and change is unconscious.\nHypnosis, and Self-Hypnosis, is about learning to change behaviour at\nthe unconscious level. \n</p><p><strong></strong>Understand that slim\npeople don't have to torture themselves over what they want to eat.\nThey just have a different outlook and relationship with food; they\nenjoy eating without denial and without feeling guilty.<strong></strong></p><p><strong>Learn to use hypnosis to let go of what's holding you down\nphysically and emotionally, and reveal the amazing person you truly\nare.</strong></p><p>In this course you will:</p><ul><li>\nRecognize\nthat becoming slim can and should be a pleasurable experience.</li><li>\nLearn\nthat you can lose weight by eating delicious and nutritious foods.</li><li>\nDiscover\nwhether your self talk is sabotaging your best efforts and change it.</li><li>\nFind\nout whether you're feeding more than just your physical hunger.</li><li>\nModify\nyour behaviour to assure your success.</li><li>\nFeel\nthe difference between thirst and hunger.</li><li>\nCreate\nthe future you in your mind so you know where you're going.</li><li>\nImagine\nthe possibilities from choosing your options wisely.</li><li>\nBuild\nrapport with your unconscious to succeed on every level.</li><li>\nAnalyse\nyour language to reprogramme your thinking about food and eating. \n</li><li>\nKnow\nthe difference between stress and relaxation and how it affects your\nsuccess</li></ul><br><p>\n<strong>If\nyou don't know where you're going, all roads lead there - especially\nwith weight loss. </strong><strong>This course has\n10 Hypnosis sessions to keep you on track.</strong></p><p>\nMany\nweight loss books, programmes and methods involve going without.\nHypnosis helps stop the internal conflict and align your sights on\nyour goals without the self flagellation that many of these systems\nrequire and seem to delight in. \n</p><p>All successful achievers have the winning mindset. Hypnosis and\nself-hypnosis has been used for years to help people change their\nbeliefs and attitudes; to let go of negative emotions and limiting\nbeliefs. Many successful people use hypnosis and self-hypnosis to\ncreate the winning mindset in all walks of life.</p><p>\nAs\na hypnotherapist, trainer and life coach I have helped people create\ngreat changes in their lives for more than 25 years. This\ncourse is based on years of experience helping many people succeed in\nachieving their ideal body weight through group and one to one\nsessions. By taking this course in the comfort or your own home and\nyour own time you too can learn to use these same techniques. I am\nalso available for help throughout the course on the message board.</p><p>\nEach\nof the 10 sessions ends in a hypnosis session which requires you to\nsit back, relax and listen; that's about as difficult as it gets. the\nhypnosis sessions can be downloaded so that you can listen to them\nany time you want.</p><p>\nThere's\nso much 'stuff' around what and how we eat. We've maybe been told to\neat up and clear the plate because there are starving people\nelsewhere. Or maybe we've had food put in front of us and been told\nthat someone would have to wait because you were getting their meal.\nHow does stuff like that feel? What messages are we getting on a\nsubconscious level? We've had so many attachments around food for so long that we\ndon't even know where to begin when it comes to changing ourselves.\nMany of these attachments have little or nothing to do with eating. These hypnosis sessions are designed to help you let go of all of\nthat.</p><p>By taking this course you'll have discovered how you can use hypnosis to achieve your goals. You'll also have a greater sense of who you are and that many great things are possible when you adopt the correct mental attitude. You'll also be aware of how hypnosis can help you in many other areas of your life and how great change always comes from within. What else is possible?</p>", 
    "end_date": null, 
    "title": "Lose weight without dieting using Slimmer Mindset Hypnosis", 
    "price": "20.00", 
    "instructors": "Mark Casey", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721230_ccbe_3.jpg", 
    "course_url": "https://www.udemy.com/the-slimmer-mindset-hypnosis-course/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-08T21:36:56Z"
}