{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Hi my name is Mike Mangialardi and I'm a dieting fanatic. I am an elite powerlifter in the 181, drug tested division. In the off-season, I have to focus on gaining size and strength, yet staying lean. When I get closer to a competition, I usually have to drop about 10 to 15 pounds. Because of this experience, I have become enthusiastic about finding a dieting approach that is easy to follow and backed by science. Unfortunately such a thing is hard to come by.</p><p>The truth is that most diets are complex, overly-restrictive, and ineffective. We are saturated with different dieting fads that have brought about unneeded frustrations, struggles, and restrictions. On the other hand, am I offering a supposed shortcut to dieting? No. All dieting will take hard work and consistency to be effective. However, it also doesn't need to be so strict and inflexible.</p><p>So what will my course entail?</p><p>In my course I will teach you how dieting actually works. Moreover, I will walk you step by step to getting on track to lose fat successfully.</p><p><strong>Here's what I am guaranteeing you will walk away with:</strong></p><strong> </strong><ul><li><strong>A understanding of how dieting actually works</strong></li><li><strong>An ability to track your calories to ensure fat loss and keep you accountable</strong></li><li><strong>A motivation and confidence to diet with long term success</strong></li><li><strong>An enjoyment in your fat loss efforts</strong></li></ul> <p>If you take the time to do my course, I will take the time to keep in contact with you. Whether its answering your questions, giving encouragement, or reaching out to you to keep you accountable I will aid you throughout your fat loss journey.</p><p>So join with me on a fat loss journey full of success and enjoyment with this simple, flexible, and effective dieting approach.</p>", 
    "end_date": null, 
    "title": "Lose Weight and Not Your Favorite Foods", 
    "price": 0, 
    "instructors": "Mr. Michael Mangialardi", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/577408_1244_5.jpg", 
    "course_url": "https://www.udemy.com/simplifymydiet/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-08T14:15:44Z"
}