{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>---- </strong>Lose Weight Healthily &amp; Easily In 8 Weeks Or Less ----Are you ready for a major healthy nutrition breakthrough in your life?</p><p>=====&gt;<em> Updated: November 2015</em><br></p><p><em><strong>** Bonus Interview with the Founder of Bass-Jump, Dan Witmer. Learn how to lose weight by getting started with a very specific exercise for ONLY 3-4 MINUTES per day, 3-4 days per week!! **</strong></em></p><p><strong><em>Bonus #2: </em>Hear from my good friend Sami, about how she totally<em> transformed her body </em>from being heavily overweight, to being able to lose weight and become <em>completely ripped</em> and winning a trophy on stage in her first ever bodybuilding competition stage show.<br></strong></p><p><strong><em>Bonus #3</em>: You will also get FREE access to my \"8 Week Body Transformation Challenge\" that sells here on Udemy for <em>$99</em>. This offer is only available for a short time as it is brand new, and is among the most comprehensive online courses on this platform.</strong></p><p>Ask yourself these questions:</p><p>· Do you have low energy levels?</p><p>· Do you have sugar cravings?</p><p>· Do you battle with weight gain?</p><p>· Do you sleep well or have poor restlessness napping?</p><p>· Do you eat processed foods and want to clean up your diet?</p><p>· Do you take care of everyone else and forget to take care of yourself?</p><p>I would like to invite you to join me in this in depth online nutrition course that is designed to help you lose weight fast &amp; create positive healthy habits that will dramatically improve the quality of your life on all levels. </p><p>Whatever you may be dealing with can be healed, transformed and you can break through to the next level.</p><p>By learning and becoming aware of where you are currently at with your thoughts and patterns, you can begin to change it entirely and lose weight fast.</p><p>As you watch this online nutrition course in it's entirety you will learn how to lose weight, Boost Cardiovascular Health, Increase Mental Health, Reach and Sustain Maximum Vitality. As well as Increase General Health, Reduce Stress and it will help you stay Disease Free.</p><p>Isn't it your turn to look and feel your best?</p><p>My passion in life is to inspire and reach as many people as I can to live a more fulfilled life through lifestyle and health awareness and coaching. This is just a small gift I give to you, to reboot your inner-self, lose weight and get you on track to living a life where you thrive!</p><p><em>The 100% Money Back Guarantee</em> - <em>This course comes with a 100%, no questions asked, money back guarantee. I am so confident in the course that if for whatever reason you are not fully satisfied, you will receive a full refund direct from Udemy. </em>So there is no risk on your part.</p><p><strong><em>It Is Time To Take Action, Click \"Take This Course\" At The Top Right, Enrol In This Course Now And Learn The Nutrition &amp; Health That Will Get You The Body You Desire!</em></strong></p><p><em>See you on the inside,</em></p><p><em>Mitch</em></p>", 
    "end_date": null, 
    "title": "Lose Weight Healthily & Easily In 8 Weeks Or Less", 
    "price": "20.00", 
    "instructors": "Mitch Asser", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542646_c52c_2.jpg", 
    "course_url": "https://www.udemy.com/lose-fat-fast/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T23:01:55Z"
}