{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><em>- Revised and Last Updated on April 7th 2016</em><br><strong></strong></p>\n\n<p><strong>Hey, let me ask you a question... </strong></p>\n\n<p>Is this <strong>YOU?</strong> </p>\n\n<p>Have you been frustrated and STRUGGLING with weight loss? Are you tired of spending years following the usual advice of fitness experts like cranking up your cardio and trying another diet?!? </p>\n\n<p>If you're like many others, you've likely tried every weight loss fad diet. Whether it's Weight Watchers, Jenny Craig, South Beach Diet or Atkins, even if you lost \"some\" weight, you gained it all back and more? You're not alone. </p>\n\n<p>The weight-loss industry is a machine. It makes making billions of dollars off pain and suffering, raking in huge profits, and delivering minimal or <strong>NO results.</strong> THEN.... they seduce you into buying their <strong>NEXT</strong> product with more lies and false claims. </p>\n\n<p>If you know what I'm talking about and are fed up, then this might be for you. </p>\n\n<p>There are solutions and methods to achieve healthy weight loss <strong>BUT</strong> it's almost like an <em>“Underground”</em> society reserved for athletes, celebrities and fitness gurus. </p>\n\n<p>However the good news is there <strong>ARE Fat Burning Secrets</strong> using a little-known “flexible” diet lifestyle that literally <strong>FORCES</strong> your body to melt away 1-2 pounds of stubborn belly fat every week consistently. </p>\n\n<p>Stay with me for just a few moments and I'll reveal what you need to know and how you can experience what I did! </p>\n\n<p>First, let me introduce myself.  Hi I’m Tim and I want to let you in on this \"little secret.\" It’s a secret that took me years to fully understand. It’s also something the fitness industry does <strong>NOT</strong> want you to discover.  And I hate to say it, but you very own doctor is unlikely to share it with you because medical doctors aren't even aware it exists. </p>\n\n<p>The secret I’m talking allowed me to <strong>DROP 22 pounds of fat</strong> in as little as 12 short weeks without dieting or starving myself. </p>\n\n<p>The best part about this secret was I was able to strategically eat the foods that the so called, “nutritional experts” told me to avoid if I wanted any chance of losing stubborn belly fat. </p>\n\n<p>What I discovered was a <strong>NEW</strong> and <strong>EXCITING</strong> way to eat that gave me the<strong> FREEDOM</strong> to enjoy my favorite foods with family and friends without having to starve myself. </p>\n\n<p>Again, if weight loss has been a challenge for you in the past I want to show you how you can still enjoy your favorite foods while dropping those unwanted pounds and inches off your waistline at the same time. </p>\n\n<p>The BEST part is, it’s not a “fad” diet, but a whole <strong>NEW</strong> way to approach that fits perfectly in anyone's busy lifestyle and \"normal\" eating. </p>\n\n<p>So <strong>IF</strong> you are ready to learn this ground-breaking and exciting way to eat, while losing weight at the same time, simply click the button and I’ll see you on the inside.</p>", 
    "end_date": null, 
    "title": "Lose Belly Fat Fast - Using Real Food WITHOUT Torture Diets!", 
    "price": "20.00", 
    "instructors": "Tim Ernst", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/749660_56a3_5.jpg", 
    "course_url": "https://www.udemy.com/lose-bellly-fat-fast-by-eating-foods-you-were-told-to-avoid/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-02T03:29:58Z"
}