{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t    Have you ever struggled to lose weight?  If you have you are not alone. Lack of willpower, procrastination and self-sabotage are often the source of failure.  </p>  <p>  \t<p>  \t\t    Why? Because really effective weight loss always begins in your mind.  \t</p>  \t<p>  \t\t<p>  \t\t\t    Changing your physical eating and exercising habits is really important of course but if you do all that and still have negative  beliefs and self-talk such as &quot;I hate dieting&quot; or &#039;weight loss is always a struggle for me&quot; then you will be going a long way to sabotaging your own best efforts.  \t\t</p>  \t\t<p>  \t\t\t<p>  \t\t\t\t    This course is all about helping you to avoid those pitfalls, so that you can make the process of slimming down as effortless as possible. In each lesson I will be introducing you to a combination of coaching skills and powerful mind tools that can help to make your journey to slimness very much easier.  \t\t\t</p>  \t\t\t<p>  \t\t\t\t<p>  \t\t\t\t\t    Why am I qualified to help?  \t\t\t\t</p>  \t\t\t\t<p>  \t\t\t\t\t<p>  \t\t\t\t\t\t    Because I&#039;ve been in practice as a Clinical Hypnotherapist and Health Coach for over 15 years and I&#039;ve helped hundreds of people just like you.  \t\t\t\t\t</p>  \t\t\t\t\t<p>  \t\t\t\t\t\t<p>  \t\t\t\t\t\t\t  Are you ready to start?  \t\t\t\t\t\t</p>", 
    "end_date": null, 
    "title": "Mind Skills For Weight Loss - When Will Power Isn't Enough.", 
    "price": "20.00", 
    "instructors": "Anne Marshall", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374400_a8d9_2.jpg", 
    "course_url": "https://www.udemy.com/mind-skills-for-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T10:34:20Z"
}