{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<ul><li><strong>Do you eat when you are not hungry?</strong></li><li><strong>Have you stopped listening to your body when eating &amp; making food choices? </strong></li><li><strong>Would you like to never 'diet' again? </strong></li><li><strong>Would you like to make weight loss and healthful eating habits a way of life? </strong></li></ul><p>In the Mindful Eating Program you will go on a journey of self discovery and total tranformation with regards to how you eat &amp; think about food. We will look at what, why &amp; when you eat and find new eating habits that serve you in a better, healthier way. You will learn how to use mindfulness &amp; awareness to stop seeing food as 'the enemy' and rediscover healthful, happy eating that also offers sustainable weight loss and a life long healthful relationship with food.</p><p>This course includes 32 lectures with many 'try at home' eating &amp; mindfulness exercises. These exercises will help you to implement the course information into your daily routines and change the way you eat forever. This is not just a course it is a new way of eating &amp; living!</p><p>This course can be taken lecture by lecture or section by section over the course of a few hours or (as recommended) over the period of a few weeks (this will allow you to implement the new ways of eating into your life &amp; get the best results from the course and the accompanying eating and mindfulness exercises). </p><p>Please see the course curriculum for more details of the course content.</p>", 
    "end_date": null, 
    "title": "Mindful Eating - Healthy Eating Habits for Life!", 
    "price": "20.00", 
    "instructors": "Sarah Jensen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/523128_7b07_3.jpg", 
    "course_url": "https://www.udemy.com/mindful-eating-healthy-eating-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-08T08:51:03Z"
}