{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Oft denken wir viel zu kompliziert, bei der Suche nach Lösungen für unsere Probleme, vor allem aber, wenn es um komplexe, scheinbar undurchdringliche Wissensgebiete geht. Manchmal reicht aber schon ein weiser Satz eines Experten aus, um Licht ins Dunkel zu bringen und Sachverhalte klar und deutlich zu sehen. </p><p>Deshalb ist das Wissen und die Erfahrung von Experten so wertvoll für uns.</p><p>Weil wir aber auch Dir Zugang zu all diesem Wissen geben möchten, haben wir für dich das <strong>Platin Paket</strong> geschnürt. Voll gestopft mit Beiträgen in Form von <strong>mehr als 8 Stunden Video- und Audiomaterial</strong> von Ernährungsexperten, Rohköstlern, Ärzten und Personen, die jahrelange Erfahrung mit glutenfreier Ernährung haben, bietet dieses Paket einen wahren Schatz an Informationen und das zu einem Hammerpreis, wenn man bedenkt wie viel eine Stunde bei einem Spezialisten normalerweise kostet.</p><p>Das <strong>Glutenfrei Platin Paket</strong> bietet <u>zusätzlich</u> zu den Informationen aus dem Silber Paket und dem Gold Paket folgende Informationen:</p><p>» Videomaterial aus zahlreichen Interviews von Ernährungsexperten und Gesundheitsprofis wie <strong>Rüdiger Dahlke, Nadine Hagen, Urs Hochstrasser, Timo Wirges, Bruno Weihsbroth uvm.</strong></p><p><strong>» PLUS</strong> über 3 1/2 Stunden exklusives <u>unveröffentlichtes</u> Videomaterial aus den Interviews,</p><p>» Erfahrungsberichten und Tipps für ein langes gesundes vitales und glückliches Leben</p><p>» insgesamt über 120 Rezepte, <strong>PLUS</strong> unveröffentlichte Bonusrezeptvorschläge für noch mehr Abwechlung auf deinem Tisch</p><p>» über 110 Seiten brisantes Wissen in Artikeln und zusätzlichem Bonusmaterial für dich exklusiv zusammengestellt</p><p><br></p><p><br></p><p>Dies ist der Kurs zum Glutenfrei Kongress mit angeschlossener Challenge, die live im Oktober 2015 stattfand. Detaillierte Infos findest du auf der dazugehörigen Website. Viel Spaß beim Ausprobieren!</p>", 
    "end_date": null, 
    "title": "Platin-Paket : Glutenfrei Kongress & Challenge & Bonusmateri", 
    "price": "20.00", 
    "instructors": "Sophia Bachem", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/610010_5bcb_3.jpg", 
    "course_url": "https://www.udemy.com/paket-glutenfrei-kongress-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-12T14:59:46Z"
}