{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t        Does l<strong style=\"\">osing 5, 10 or even 15 lbs</strong> of your <strong style=\"\">body fat</strong> this month sound good to you ?  </p>  <p style=\"\">  \t        Have you wondered why you gain fat in the first place ?  </p>  <p style=\"\">  \t        This is the same reason why people lose fat by intense training and strict diet only to gain it back a few weeks or months later.  </p>  <p style=\"\">  \t      This is the same reason why some people lose their body fat and have a lean body effortlessly while others have strict diet and intense training for years without any results.  </p>  <p style=\"\">  \t<strong style=\"\">Fat gain is only a symptom and you need to address the cause.</strong>  </p>  <p style=\"\">  \t        Do you wish you had lost all your excess body fat and had a lean body ?  </p>  <p style=\"\">  \t            Are you curious about those people who seem to train far less or very lenient with diets but are still somehow able to lose fat, get lean and incredibly healthy ????    Ummmm yeah..  </p>  <p style=\"\">  \t           Then join and take this course and reset your fat loss hormones to lose more fat while relaxing more and trying less.  </p>  <p style=\"\">  \t            It all began like this, my hormone hacking adventure I used to follow and preach my clients the &quot;eat less, train more&quot; method of losing body fat.    Even though many medical practitioners and top fitness trainers still suggest this way of losing fat, I found the results vary to a great extent for different clients following the exact same program.  </p>  <p style=\"\">  \t        For some clients, no matter how strict they were dieting or how hard they trained,they weren&#039;t losing their body fat.     I was frustrated which is why I started to study and experiment and found a reliable cause. Hormone Imbalance.  </p>  <p style=\"\">  \t           Through countless self-experiments and experiments with my clients over the past 20 years, I have managed to help over 1000 clients lose their body fat, transform and get healthy by addressing their hormonal imbalances.  </p>  <p style=\"\">  \t        I have always worked with my clients 1-1 and this limited my ability to help more people with this ground breaking discovery. I wanted to help more people to make their diet and training more effective and save them from making the same mistakes I made in the past, so I decided to create a brief presentation on it to share it with my friends and clients.  </p>  <p style=\"\">  \t           The funny thing was I had only scratched the surface of what I&#039;d learned in that presentation.  </p>  <p style=\"\">  \t    I am sharing the same presentation with you for your feedback.  </p>  <p style=\"\">  \t    In this presentation you&#039;ll learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to reset your fat loss hormones and lose fat by doing less and relaxing more </li>  \t<li style=\"\">A simple step by step plan to practice what you have just learnt to lose your excess body fat </li>  \t<li style=\"\">How to balance your fat loss hormones to achieve effective fat loss </li>  \t<li style=\"\">The best ways to track your actions as well as results to keep you on track </li>  \t<li style=\"\">A blueprint to take action on everything I&#039;ll teach you so that you&#039;ll be losing fat in no time! </li>  </ul>  <p style=\"\">  \t           The class is delivered in easy to follow video modules, so you can go at your own speed if you prefer.    No matter who you are, I guarantee you&#039;ll learn at least one thing from this class.  </p>  <p style=\"\">  \t        Note: if you&#039;ve been studying hormones for centuries, you&#039;ll probably know a lot of this. Also this is my first time teaching a 1-many course, so please send me some feedback.  </p>  <p style=\"\">  \t         I will personally respond to any questions you may have as you go through the material so there&#039;s no worry if you&#039;re not sure how to take all of the information and apply it to your life. So sign up now!  </p>  <p style=\"\">  \t           Talk soon,  </p>  <p style=\"\">  \t           Craig Burton  </p>", 
    "end_date": null, 
    "title": "Reset Your Fatloss Hormones", 
    "price": "30.00", 
    "instructors": "Craig Burton", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/305874_880c_5.jpg", 
    "course_url": "https://www.udemy.com/reset-your-fatloss-hormones/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-23T04:19:38Z"
}