{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>* UPDATE (4/17/2016): FOUR new videos added!</strong><br></p><p>If you're struggling to lose weight or stick to a healthier diet, it's not that you don't know what you <em>should</em> do--it's that sticking to your goals and resisting temptation can be more difficult than you thought! This course will show you how to stick to those goals and resist tempting, diet-busting foods and activities through proven mental strategies.</p>\n\n<p><strong>Using Psychological Science to its Full Potential</strong></p>\n\n<p>Everything in this course is rooted in tested mental strategies. I'm not just making things up like a lot of health and fitness \"gurus.\" You'll learn practical tips taken from rigorous research in psychological science, and you'll discover how you can easily and effectively implement these techniques.</p>\n\n<p>This course covers three general steps you can take to self-control mastery:</p>\n\n<ol><li>How to effectively plan for opportunities to take actions that help meet your goals</li><li>How to rethink temptation in ways that make it less alluring</li><li>How to build your willpower and use your self-control strength to resist temptation</li></ol>\n\n<p><br></p>\n\n<p>By the end of this course, you'll be able to use simple tricks and techniques to make self-control easier. If you actually apply these strategies and make a deliberate effort to understand their effects, you'll have a huge advantage when it comes to sticking to your diet, meeting your fitness goals, and leading a healthier lifestyle. Best of all, this course will always be there for you, and you can review the material anytime you need renewed motivation to stay strong.<br></p>\n\n<p><strong>And You Can Trust Your Teacher!</strong></p>\n\n<p>I'm a trained social psychologist. Not only do I have more than 7,000 students on Udemy, but I also teach classes in social psychology at the university level. Moreover, I conduct my own psychological research, so I know a thing or two about how research in psychological science works and what it can tell us.</p>\n\n<p>Don't miss out on the chance to dive straight into the secrets of self-control success that have until now remained locked in dense academic journals. So enroll now--you'll be glad you did.</p>", 
    "end_date": null, 
    "title": "Self-Control Psychology and Weight Loss", 
    "price": "20.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/660446_fa39.jpg", 
    "course_url": "https://www.udemy.com/self-control-psychology-diet/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-04T21:31:13Z"
}