{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">Are you sick of feeling uncomfortable in your own body? Feeling older than you want to? Would you like more energy and to feel youthful again? Well, NOW you can, EASILY!  This program makes it very easy to be on the right path to some serious weight loss.  This program provides a 4 week meal &amp; emotional healing plan with recipes, shopping lists, and empowerment.  Each week is broken down into a theme for the week that addresses the eating and healing issues as you eat yourself healthy. You will learn the benefits of eating 80% raw foods, why raw foods drop the pounds quickly and easily, and delicious ways to prepare them that do not take all day.  We will address emotional eating and habitual eating, giving you powerful emotional tools, and a new breathing tool each week along with joyful movement suggestions to change from the inside out. </p><p style=\"\"> No more just changing what you are eating!  We are going to deal with why you are unhealthy and what you can do about it.</p><p style=\"\">  Bonus... Delicious raw &#039;Cheat Recipes&#039; that will get you through the strongest choco/carb craving.  This program maps it all out for you, no need to try to figure out what to eat each week and what you need from the store.  It is provided to give you the best possible chance to lose ALL that you want to lose.  This course is only 4 weeks long but the changes to your lifestyle will last a lifetime, together let&#039;s make it a LONG lifetime!   By the end of the program you will have changed your eating habits and shed unwanted weight, feeling energized, lighter emotionally &amp; physically, and empowered to take better care of yourself. </p><p style=\"\"> This is your journey, let&#039;s do it right by exacting revenge on all of the unhealthy foods &amp; thoughts that have been plaguing us.   It&#039;s time to take back you.  Enroll in this program NOW, NOW is the time to feel better AND look better</p>", 
    "end_date": null, 
    "title": "Serious About Weight Loss: The Raw Revenge Mind/Body Program", 
    "price": "45.00", 
    "instructors": "Christine Kortze", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/450390_ef0e_4.jpg", 
    "course_url": "https://www.udemy.com/serious-about-weight-loss-the-raw-revenge-mindbody-program/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-18T15:45:48Z"
}