{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Intermittent Fasting is about learning how to optimize your results in the <strong>gym</strong> and increase <strong>fat loss</strong> by using the proper supplementation and <strong>nutrition</strong> protocol in order to achieve <strong>quick </strong>and efficient <strong>results</strong>.</p>  <p>Through this course you will learn:</p>  <p>-About I<strong>ntermittent Fasting</strong> and what it does.</p>  <p>-Basic <strong>Nutrition</strong> that works well with a 7 day “IF” program</p>  <p>- Basic <strong>Training </strong>for optimal for a 7 day split with introduction to <strong>cardio acceleration</strong>.</p>  <p>-Basic<strong> food preparation</strong> with what to eat when, when to eat and how frequently you will be eating</p><p><br></p><p>There are no materials included; however, you may want to take down notes on how to create and <strong>personalize</strong> your <strong>meal and training plan</strong>.</p><p>This course gives you all the information you will need in less than 1 hour, which is great because our lives are <strong>on the go</strong> and when we want to <strong>shed fat</strong> we want to do it quick and efficiently. This course is structured for <strong>easy learning</strong> and gives your the most effective points and the model.<span></span></p><p>So, why take this course, might you ask. It's perfect for anyone looking to get exciting about their <strong>weight loss journey</strong> or their<strong> fitness journey</strong>. You will be provided with tools to use in order to <strong>amp your</strong> current program or<strong> jumpstar</strong>t you with a new program!</p><p>It's recommended that you have a basic understanding of <strong>exercises</strong> for <strong>training</strong> or <strong>workouts plans</strong>.</p>", 
    "end_date": null, 
    "title": "Shed Fat Fast in 7 Days", 
    "price": "25.00", 
    "instructors": "Amanda Lopez", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/632034_1548_3.jpg", 
    "course_url": "https://www.udemy.com/shed-fat-fast-in-7-days/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-06T05:20:54Z"
}