{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Wie es sich anfühlt ohne Gluten zu leben und welches wunderbar klare und leichte Lebensgefühl sich in nur 30 Tagen verbreitet, wenn man den Darm nicht mit den krankmachenden Klebereiweiß belastet, können wir dir nur schwer beschreiben. </p><p>Was wir dir aber geben können ist eine Anleitung wie man dieses tolle Gefühl bekommen kann.</p><p>Unser <strong>Glutenfrei Silber Paket</strong> enthält alles was Du brauchst, um in nur 30 Tagen einen ersten Eindruck davon zu gewinnen wie sich dieses neue Leben anfühlt.</p><p><strong>Du bekommst dafür von uns:</strong></p><p>» 6 Beiträge die Dich darüber informieren was Gluten ist, Wo Gluten überall enthalten ist, Wie man erkennt das man Glutensüchtig ist oder wie man Glutenfreie Produkte erkennt</p><p>» über 120 leckere glutenfreie Rezepte helfen dir beim genussvollen Verzichten</p><p>» in 15 Produkttests zeigen Dir in Beispielen, was der Markt an Alternativen derzeit anbietet</p><p>» in 4 Video-Beiträgen berichten wir welche Sortimente wir in ausgewählten Märkten gefunden haben</p><p>» Erfahrungsberichte von Personen die glutunfrei leben, vermitteln dir anschaulich, wie man der Glutensucht entkommt und wie positiv sich das Leben ohne Gluten verändern kann</p><p>Freu dich auf klare Gedanken, Gewichtsreduzierung, ein leichteres Lebensgefühl, eine beschwerdefreiere Verdauung und dem guten Gefühl, der oft gewünschten Gesundheit ein ganzes Stück näher zu kommen.</p><p>Hier findest du nun neben den knapp 90 Seiten Textbeiträgen, einschließlich der über 120 Rezeptvorschlägen, 2 Stunden Video- und 30 Minuten Audiomaterial.</p><p><br></p><p>Dies ist der Kurs ist ein Teil des Glutenfrei Kongresses mit angeschlossener Challenge, die live im Oktober 2015 stattfand. Detaillierte Infos findest du auf der dazugehörigen Website. Viel Spaß beim Ausprobieren! <br style=\"\"></p>", 
    "end_date": null, 
    "title": "Silber-Paket: Glutenfrei Challenge + Kongress", 
    "price": "30.00", 
    "instructors": "Sophia Bachem", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606988_03f5_2.jpg", 
    "course_url": "https://www.udemy.com/paket-glutenfrei-challenge/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T14:56:53Z"
}