{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Are you craving sugar and finding yourself <strong style=\"\">frequently reaching for the sugary snacks</strong> like chocolate, biscuits, fruity yoghurts and health bars?</p><p>You know they&#039;re not good for you but you just feel stuck when you try to consider other options and feel like there&#039;s limited choice. You just don&#039;t know where to start.</p><p>Trust me, I know how it feels because I was also there too and so have most of my clients.</p><p>When you repeatedly snack on sugary things, not only do you ingest sugar (deemed the most dangerous substance in our diet today), you <strong style=\"\">keep building your habits and routines</strong> to consume it which are harder to break over time.</p><p>There are many reasons why you might want to stop snacking on and craving sugar:</p> <ul style=\"\"><li style=\"\">You want to lose weight</li> <li style=\"\">You want to reduce the risk of diseases like diabetes, </li> <li style=\"\">You want to increase your energy</li> <li style=\"\">You want to feel fuller for longer </li> <li style=\"\">You want to stop losing control over portion size and be sensible around your snacking</li> <li style=\"\">You want to improve your skin and hair quality, reduce wrinkles or see if reducing the sugar can make a difference to your appearance</li></ul><p><br style=\"\"></p><p>This course if for you if you:</p><ul style=\"\"><li style=\"\">Find yourself snacking on sugary food at least once a day</li><li style=\"\">Have tried to stop but have found it difficult</li><li style=\"\">Are experiencing very strong sugar cravings</li><li style=\"\">Think you might be over-eating on natural sugars like dried fruit or stevia</li></ul><p><br style=\"\"></p><p>In this course you will learn how to:</p> <ul style=\"\"><li style=\"\">Understand your sugar cravings in more depth</li> <li style=\"\">Use a low sugar snacking strategy to help you permanently reduce cravings</li> <li style=\"\">Work through the excuses that come up and outline actions to work around them</li> <li style=\"\">Buy truly sugar-free snacks and not be mislead by marketing</li> <li style=\"\">Make a wide range of other sugar-friendly snacks you will have never thought of!</li></ul><p><br style=\"\"></p><p>I explain all of this through powerpoint and audio lectures. You will also get a <strong style=\"\">FREE ebook</strong> with 30 low sugar high protein snack ideas plus a workbook on your snacking constraints.</p><p><strong style=\"\">In less than 90 minutes you can be on your way to happier low sugar snacking.</strong> </p><p><strong style=\"\">__________________________________________________________________________</strong></p><p><em style=\"\">Don&#039;t let sugar rule you! You can take control today and overcome this dangerous addictive substance!</em></p><p><em style=\"\"></em><strong style=\"\">__________________________________________________________________________</strong></p><p>I&#039;m in no doubt that you&#039;ll be excited to get out and try some of these new things which you will have never heard or thought of before.</p> <p><em style=\"\">Start snacking healthy as your first manageable step to a lower sugar lifestyle and reap the health benefits whilst enjoying delicious alternatives.</em></p>", 
    "end_date": null, 
    "title": "Sugar detox: Learn to snack sugar-free & reduce cravings", 
    "price": 0, 
    "instructors": "Laura Thomas", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/445854_f98b_3.jpg", 
    "course_url": "https://www.udemy.com/sugar-detox-learn-to-snack-sugar-free-reduce-cravings/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-12T15:43:52Z"
}