{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t      It&#039;s called <strong style=\"\">comfort food</strong> for a reason.  </p>  <p style=\"\">  \t      Because when you&#039;re feeling down, or sad, or lonely, or stressed, these are the foods you turn to for comfort--and to help you avoid those negative feelings inside.  </p>  <p style=\"\">  \t      They&#039;re foods like ice cream, pizza, spaghetti, cookies, donuts, burgers, and of course, alcohol.  </p>  <p style=\"\">  \t      And of course, these are the same high-calorie foods that lead to weight gain, a bigger waist &amp; hips, and all the health problems that come with obesity.  </p>  <p style=\"\">  \t      It&#039;s called <strong style=\"\">emotional eating</strong> when you have an automatic emotional response that causes you to crave these fatty, sugary foods whenever you&#039;re feeling something unpleasant.  </p>  <p style=\"\">  \t      The truth is, you may not be as bad as the Cookie Monster on Sesame Street...but you <strong style=\"\">are wired to overeat</strong> in certain situations.  </p>  <p style=\"\">  \t      And even if it happens rarely, it&#039;s often enough to completely derail your efforts to lose weight.  </p>  <p style=\"\">  \t      Think about it this way: just one emotion-fueled binge per week can <strong style=\"\">easily </strong>cut a 3500-calorie deficit into a 1500-calorie deficit (or even less). That&#039;s enough to slow your weight loss to a crawl...  </p>  <p style=\"\">  \t      And it may be so frustrating that it causes you to lose heart and abandon your goals altogether.  </p>  <p style=\"\">  \t      Luckily, <strong style=\"\">there is hope.</strong> There are techniques &amp; tricks you can use to recognize when you&#039;re having an emotional eating urge...and to successfully avoid it--without ripping open a single bag of potato chips.  </p>  <p style=\"\">  \t      The great thing about the material in this course is that it applies to <strong style=\"\">any diet</strong>, any lifestyle, any eating plan, any exercise routine, any body-weight goal there is.  </p>  <p style=\"\">  \t      In the next 2 hours, you&#039;ll learn techniques you can use for the rest of your life.  </p>  <p style=\"\">  \t      Not only will they help you to avoid emotional binges, but as a side-effect you&#039;ll also learn better coping mechanisms--so that you can deal with stressful situations in the future in a way that&#039;s healthy &amp; effective.  </p>  <p style=\"\">  \t      Whether you realize that emotional eating is a big problem or not, take a few moments to check out the free preview lessons for this course. I&#039;m confident that you&#039;ll learn a few <strong style=\"\">powerful tips &amp; insights</strong> you can start using today.  </p>  <p style=\"\">  \tSo if you&#039;re eager to kickstart your weight loss results, sign up now and get started taming your inner cookie monster today.  </p>", 
    "end_date": null, 
    "title": "Taming Your Inner Cookie Monster", 
    "price": "20.00", 
    "instructors": "Neil Flinchbaugh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/428002_32fa_3.jpg", 
    "course_url": "https://www.udemy.com/taming-your-inner-cookie-monster/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-20T20:27:18Z"
}