{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>You will learn the exact mindset that took me from 130 kilos to 93kgs in less than six months. </strong></p><p>I remember the day I stepped on the scales and saw those numbers. </p><p>It felt great, it still feels great.  I feel like one million dollars. </p><p>Not because I was overweight, unhealthy, tired and hating myself. </p><p>But because I set myself a goal and achieved it.  </p><p>I got there.  </p><p>I have stayed there.</p><p>I want to show you what I did, how I got there and how I have kept the weight off for many years. </p><p>The feeling of being free of that problem is overwhelming.</p><p><strong>See most people believe that weight loss is all about diet and exercise.</strong> </p><p>That's part of it... but you know what the snake in the grass is?</p><p>Your mind. </p><p><strong>Why is it that some people lose weight easily and other's don't?</strong></p><p><em>It's very easy to understand once you know the way.   You must first believe and understand that it's possible and then it will happen for you.</em></p><p><em>Let me show you... </em></p><p>I had tried many dieting solutions for many years, yes including all the popular ones, but had no success until I started working on my mind. </p><p>Once I did that... then I naturally gravitated to diet and exercise.  </p><p>Since then I have kept the weight off and live a happy existence. </p><p>In this course I take you by the hand and walk you through what I did to achieve this.  </p><p><em>This course is also supported by the Udemy 30 day refund policy.  If you don't like it, ask for a full refund.</em><br></p><p><em><strong>Bonus: Inside I talk about the diet I have used to keep most of the weight off.  You get this for free when you enrol.</strong></em></p><p><br></p>", 
    "end_date": null, 
    "title": "The Weight Loss Mindset: Transform your Mind and Body", 
    "price": "25.00", 
    "instructors": "Luke Houghton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/639872_c40a_3.jpg", 
    "course_url": "https://www.udemy.com/the-weight-loss-mindset-transform-your-mind-and-body/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T01:01:44Z"
}