{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t <strong>There has to be a better way.</strong>  </p>  <p>  \t We must be doing something wrong in the <em>developed</em> world.  </p>  <p>  \t Cast your mind back to the last time you were out on the streets, or anywhere in and around people. Remember the people you saw walking around.  </p>  <p>  \t How was their energy, their posture, their movement, their shape?  </p>  <p>  \t Did you see the pinnacle of evolution in front of you? The most advanced species on the planet? Did you see boundless energy, sprightliness, bio-mechanical works of art?  </p>  <p>  \t Were most people just like a gazelle roaming free in the savannah, brimming with life-force, lean, powerful, alert, poised, balanced?  </p>  <p>  \t <strong>Unlikely.</strong>  </p>  <p>  \t If you&#039;re in the UK, Europe, The United States and most countries in the developed world, you&#039;re more likely to have seen people with low energy, poor posture, a &#039;non-athletic&#039; shape and who quite frankly don&#039;t look anything like a finely-honed wild animal.  </p>  <p>  \t They wouldn&#039;t pass the <em>gazelle test</em>.  </p>  <p>  \t How is it possible that the most advanced species on the planet has somehow allowed itself to end up like this?  </p>  <p>  \t What did we miss?  </p>  <p>  \t Where have we gone wrong?  </p>  <p>  \t It can&#039;t be proven (because technically nothing can be proven true) but I aim to present a compelling hypothesis that the single biggest contributor to this difference between humans and animals is the relationship with food.  </p>  <p>  \t Animals adapt to their environment. Humans adapt the environment to themselves.  </p>  <p>  \t That&#039;s not a problem in itself, but it <em>has</em> led to a huge issue with how we do food.  </p>  <p>  \t Unlike most animals, we have adapted our environment so well that <em>we don&#039;t have to spend most of our time preoccupied with eating</em>.  </p>  <p>  \t The human race as a whole is blessed with abundant food, and although there are many humans in the world who don&#039;t have enough to eat, overall, we have conquered the problem with food supply. (The challenges with the global distribution of food are outside the scope of this programme.)  </p>  <p>  \t However, this has only come about relatively recently in evolutionary terms, and it is the root cause of many predominantly human health-related problems such as diabetes, high blood-pressure, heart conditions and even cancer.  </p>  <p>  \t The health of the developed world is in crisis, not because of circumstances <em>beyond our control</em>, but as a direct result of circumstances <em>we have controlled</em>: How we eat.  </p>  <p>  \t Most of the current causes of premature death in the developed world are as a direct result of how we&#039;ve been eating.  </p>  <p>  \t Ideally, we&#039;d like to live like animals in the wild. Chasing prey one day, dead the next, because all the organs and body&#039;s systems have failed at about the same time.  </p>  <p>  \t Humans often die despite having most of their systems in good shape. Death occurs because one system has had a complete failure and brought about the early demise.  </p>  <p>  \t In this programme I&#039;m going to be discussing why in fact we are, as a race, mostly eating poorly, and what we can all do about it.  </p>  <p>  \t I&#039;ll be combining the wisdom of some of the greatest thinkers who have ever lived with recent findings from research studies and applying it to the business of eating.  </p>  <p>  \t But most relevantly, I&#039;ll be giving you some specific things that you can do on a daily basis to solve the problem. If you want to.  </p>  <p>  \t I&#039;ll be giving you some reasonably easy processes to follow, some &#039;algorithms&#039; that almost anyone can do, irrespective of starting position.  </p>  <p>  \t I&#039;ll be using an approach that has been used by thousands of people over the last 200 years, and which I&#039;ve personally introduced to over 50,000 people, to bring about change in any aspect of their lives.  </p>  <p>  \t I&#039;ve worked hard on this programme and I&#039;m very pleased with it. So I do hope you enjoy it, find it helpful and above all, take action as a result.  </p>  <p>  \t All the best,  </p>  <p>  \t Tom  </p>", 
    "end_date": null, 
    "title": "The Best Diet In The World: Reasonable Eating", 
    "price": 0, 
    "instructors": "Tom Cassidy", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169560_7bba_3.jpg", 
    "course_url": "https://www.udemy.com/the-best-diet-in-the-world-reasonable-eating/", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T10:04:54Z"
}