{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>  \t<strong style=\"\">View The Six Phases to Mastering Weight Loss Report AND watch Dr. Sullivan&#039;s FOX NEWS weight loss interview in FREE LECTURES #1 AND #3 further below on this page to</strong><strong style=\"\"> learn what Stanford University discovered about PreDieting</strong><em style=\"\">&mdash;</em><strong style=\"\">training your brain to lose weight before you begin your next diet</strong><em style=\"\">&mdash;</em><strong style=\"\">no matter what diet you choose!</strong>  </p>  <p>  \t                 For 21 days, Harvard graduate, author and clinical psychologist Dr. Sean Sullivan walks with you step-by-step, applying the latest brain science to train your brain to master your strengths and obliterate your weaknesses. You&#039;ll create completely new brain patterns that enable you to healthily and sustainably lose the weight you choose to lose. Each day of your 21-Day Master Weight Loss Program begins with a very personal brain training video from Dr. Sullivan followed by your targeted <em style=\"\">Master Weight Loss Challenge</em>. Progress at your own pace through 21 days of creating your personal NEW LIFE MAP leading to the body (and brain) you want. You&#039;ll be a Weight Loss Master losing the weight you want to lose.  </p>  <p>  \t <strong style=\"\">&quot;Dr. Sullivan is a game-changing new voice in the psychology of peak performance.&quot;                      - Mark Sanchez, NFL Quarterback</strong>  </p>  <p>  \t                 ------------------------------------------------------------------------------------------------------------------------<strong style=\"\"><br style=\"\">  \t </strong>  </p>  <h5>Obliterate The Vicious Brain Cycle That Makes You Fat</h5>  <p>  \t <strong style=\"\">More than 90% of people who lose a lot of weight gain it back because of <em style=\"\">The Vicious Brain Cycle</em>.</strong> Rather than changing your brain in a desired way, most diets end up tricking your brain into a short-term, unsustainable program of body manipulation. Over the long term you are actually training your brain to want to eat more, not less (<a href=\"http://www.nytimes.com/2011/10/27/health/biological-changes-thwart-weight-loss-efforts-study-finds.html\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">New York Times</a>).  </p>  <p>  \t <em style=\"\"><strong style=\"\">The Vicious Brain Cycle </strong>&mdash;</em>  </p>  <p>  \t                 1.  You feel overweight so you start a diet and lose some weight.  </p>  <p>  \t                 2.  You hit a limit and begin to gain some weight back so you feel bad.  </p>  <p>  \t                 3.  Within a year you are almost always coping by eating more and gaining all the weight back and often gaining even more weight.  </p>  <p>  \t <strong style=\"\">We have all heard of the thousands of diets&mdash;Atkins, South Beach, etc.</strong> It turns out, diets are almost always a formula for weight gain, not weight loss. They create &ldquo;<em style=\"\">The Vicious Brain Cycle</em>&rdquo; because they fail at dealing with the heart of the weight loss problem.  </p>  <p>  \t <strong style=\"\">When you train your brain correctly, though, you actually want to eat and live differently.</strong> Your brain becomes extremely clear about how much you hate unhealthy food running your life. You come to see overeating, and foods that are bad for you, for what they really are&mdash;your massive enemies preventing you from feeling and looking good.  </p>  <p>  \t <strong style=\"\">Your brain ultimately controls what you want and what you do</strong>. So, the only way to lose weight and keep it off is to make intentional and sustained changes <em style=\"\">inside your brain.</em> You need to train your brain to want to eat well by creating a <em style=\"\">Self-Promoting Brain Cycle </em>so it becomes fait accompli that you drop weight and keep it off.  </p>  <p>  \t <strong style=\"\">I&#039;ll show you how to apply the discoveries of brain science to annihilate <em style=\"\">The Vicious Brain Cycle</em> from your life.</strong> You will create new brain habits that ensure lasting changes in your brain and body. Your life will feel different, happier and healthier. You&#039;ll feel better because you&rsquo;ll be rewiring your brain to lose the weight you want to lose.  </p>  <p>  \t                 I&rsquo;ll show you how do it. That&rsquo;s what I do.  </p>  <p>  \t <strong style=\"\">Dr. Sean Sullivan</strong><strong style=\"\">, <a href=\"http://www.themindmaster.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">TheMindMaster.com</a> </strong>  </p>", 
    "end_date": null, 
    "title": "The 21-Day PreDiet Weight Loss Program", 
    "price": "30.00", 
    "instructors": "Sean Sullivan", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/28652_6cba_10.jpg", 
    "course_url": "https://www.udemy.com/the-21-day-the-mind-master-weight-loss-program/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-05T02:36:17Z"
}