{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">The Ultimate guide of weight loss is an amazing and complete guide for everyone, you will learn about the scientific and medical terms of weight loss,this guide is not just a plan to lose weight or a strategy to get a good shape, but it's including everything related to dieting,nutrition and physical activity. A good chance to understand medically and scientifically about the weight loss and how your body loses,Also it is designed for who is stuck at the same weight or who gains weight easily.<br></p><p style=\"\">Course Details<br></p><p style=\"\">-In Section 1: Introduction about me!</p><p style=\"\">-In Section 2: General medical knowledge.</p><p style=\"\">-Enjoy learning the scientific and medical terms related to nutrition.</p><p style=\"\">-Understand how your body works.</p><p style=\"\">-What's metabolism and the factors affect it.</p><p style=\"\">-What are the types of physical activities for good shape</p><p style=\"\">-What's the cellulite and how to reduce it.</p><p style=\"\">-Understand how the weight loss tablets work </p><p style=\"\">-What are the side effects and complications of it.</p><p style=\"\">-In Section 3: The most common diet mistakes.</p><p style=\"\">-Know what's wrong with your diet and exercise program.</p><p style=\"\">-Learn how to avoid that mistakes or solve it.</p><p style=\"\">-In section 4: The most common causes of belly fat.</p><p style=\"\">-What are the main causes of belly fat.</p><p style=\"\">-How to solve it and reduce your abdomen size now.</p><p style=\"\">-In Section 5: Truth behind the slimming therapies</p><p style=\"\">-Understand the functions of the weight loss machines</p><p style=\"\">-Know about the different types of the therapies.</p><p style=\"\">-learn what is the best therapy for you according to your concern.</p><p style=\"\">-My last motivational message for more success and goals achieving.</p>", 
    "end_date": null, 
    "title": "The Ultimate Guide Of Weight Loss", 
    "price": "20.00", 
    "instructors": "Dr Haroun Soliman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/593264_3565.jpg", 
    "course_url": "https://www.udemy.com/the-ultimate-guide-of-weight-loss/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-25T19:14:37Z"
}