{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*UPDATED <strong><strong><strong><strong><strong></strong></strong></strong></strong></strong><strong>JUNE </strong>2016</strong></p>\n\n<p><strong>*Join over 2,000 students who are losing belly fat FAST!<br></strong></p>\n\n\n\n\n\n\n\n<p><strong>Is this course for you?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Have you gained a lot of weight in the last few months?</li><li>Have you been slowly gaining belly fat over the last few years?</li><li>Are you struggling to lose weight and lose belly fat?</li><li>Are you embarrassed to see old friends, family, or coworkers because of all of the weight and body fat that you have gained, since you have seen them last?</li></ul>\n\n\n\n\n\n\n\n<p><strong><em>How do you lose weight and get ripped without spending THOUSANDS of dollars on... </em></strong></p>\n\n\n\n\n\n\n\n<ul><li>A gym membership $40-$149/month</li><li>Fitness classes $180-$349/month</li><li>Personal training: $60-$100/session. Typically at 2-4 sessions per week</li><li>Semi-private training: $20-$40/session. Typically at 2-4 sessions per week</li></ul>\n\n\n\n\n\n\n\n<p><strong>See how this can all start to add up? </strong>Don't get me wrong here, I believe that your health is absolutely worth it. Treating your body right with the proper diet and exercise program is not only a means of losing weight, getting a ripped physique, and showing off your six pack abs.</p>\n\n\n\n\n\n<p>Exercise and eating right can save you tens or HUNDREDS of thousands of dollars of the years on doctors appointments, physical therapists, medications, and even surgeries.</p>\n\n\n\n\n\n<p><strong>Getting Ready to Lose Belly Fat</strong><br></p>\n\n\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n\n\n<p>There is always an event, date, holiday, or season coming up in which we want to lose weight, lose belly fat, and look our best. Whether that be in going home to see family and friends for the holidays, going to a party or a reunion, or just getting ready for pool and beach season. </p>\n\n\n\n\n\n\n\n<p>We ALL want to lose body fat, lose belly fat, and lose weight so that we look GREAT. </p>\n\n\n\n\n\n\n\n<p><strong><em>*What event do you have coming up that you want to lose belly fat for?<br></em></strong></p>\n\n\n\n\n\n\n\n<p><strong><em>*Do you have a date coming up quickly in which you want to lose belly fat, but don't think you have enough time?</em></strong></p>\n\n\n\n\n\n\n\n<p><strong>Why Belly Fat is the Hardest</strong></p>\n\n\n\n\n\n\n\n<p>Belly fat is the hardest place to lose fat on your body, because it is the first place that you tend to gain weight. That means you have to burn through all of the rest of your body's fat stores before you can start losing belly fat. </p>\n\n\n\n\n\n\n\n<p>Belly fat CAN be the hardest place to lose fat, <strong>but with this program, it will fall right off of you. </strong></p>\n\n\n\n\n\n\n\n<p><strong>Your Solution to Lose Belly Fat</strong><br></p>\n\n\n\n\n\n\n\n<p>If you are trying to lose belly fat quickly and don't feel like you have much time to lose fat, I have just the solution for you. </p>\n\n\n\n\n\n\n\n<p>My name is Jack Wilson, and I was formally 50 pounds overweight before choosing a healthier lifestyle completely changed my life and transformed my body forever. I have tested more than a dozen popular diet and exercise programs to cut body fat and lose belly fat, and have found that I keep going back to <strong>one program that is the most effective </strong>to lose belly fat, in record time. </p>\n\n\n\n\n\n\n\n<p><strong>Lose Belly Fat Fast</strong></p>\n\n\n\n\n\n\n\n<p>The best part about about this program is that you will be able to lose belly fat quickly, and <strong>you won't have to workout for a single minute</strong>. You can lose 10, 20, 30+ pounds of belly fat without breaking a sweat!</p>\n\n\n\n\n\n\n\n<p><em><strong>What makes this diet even better is that... </strong></em></p>\n\n\n\n\n\n\n\n<ul><li>You don't have to count calories</li><li><strong>You can eat until you are absolutely STUFFED!</strong></li><li>You can eat massive, savory <strong>meals that will help you lose belly fat</strong></li><li>You get one<strong> cheat day </strong>per week in which<strong> you can eat whatever you want, as much as you want. </strong></li><li>You will <strong>naturally accelerate and optimize your metabolism to burn fat</strong> for its primary energy source. </li><li><strong>You will save HOURS </strong>in the grocery store and kitchen every week. </li></ul>\n\n\n\n\n\n\n\n<p><strong>100% Money Back Guarantee</strong></p>\n\n\n\n\n\n\n\n<p>The truth is, I want you to find the best way to lose belly fat for YOU. If this program doesn't work with your schedule or you aren't happy with your results, you can test this course out for 30 days and if you aren't satisfied, you can get 100% of your money back. </p>\n\n\n\n\n\n\n\n<p><strong>Get Started NOW</strong><br></p>\n\n\n\n\n\n\n\n<p>If you are sick of the way you look and feel, have a special event coming up that you want to look great for,<strong> and need to lose belly fat fast, this course is the perfect solution for you. </strong></p>\n\n\n\n\n\n\n\n<p>Click \"Take this course\" to get started with transforming your body and changing your life forever. </p>\n\n\n\n\n\n\n\n<p>I am so excited to hear about your results on this program. </p>\n\n\n\n\n\n\n\n<p>-Jack</p>", 
    "end_date": null, 
    "title": "The Fastest Way to Lose Belly Fat", 
    "price": "40.00", 
    "instructors": "Jack Wilson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/614142_c67c_3.jpg", 
    "course_url": "https://www.udemy.com/losebellyfat/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-16T20:20:03Z"
}