{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>The Lose the Baby Weight course is for moms with \"babies\" of any age who are ready to get their confidence, happiness, and pre-baby body back. Whether you are newly post-partum, breastfeeding, have other kids, or just can't seem to shake your muffin top, this course will give the most effective ways to get fit and lose the baby weight.</p><p>As a dietitian, I cover the importance of good nutrition in fat loss and give many examples of healthy foods and meals I use. I also discuss strength training as a primary form of exercise (be sure you have your doctor's clearance before beginning any exercise program). I will explain why building muscles is more effective than any exercise in building a lean, sexy physique. I will demystify the weight room and which muscles to work, when, and show you how to \"spot reduce\" to get your best body ever.</p><p>The course consists mostly of videos of me teaching, but there are also slides, helpful handouts (like a sample workout plan and my top 50+ skinny foods that I must have on hand to be successful), and homework with extra resources (relevant YouTube videos and helpful articles).</p><p>There are 6 main sections with mini lectures in each, so the course can be completed in about 2-4 weeks.</p><p>Section 1 is an Overview of How to Lose the Baby Weight. Learn how a registered dietitian and mother of 4 lost all the baby weight and got into the best shape of her life, and how you can too!</p><p>Section 2 is a Welcome with Basic Guidelines for Success. This section will give you basic tools to succeed. We will discuss dieting basics and techniques to use to make losing weight simple.</p><p>Section 3 covers Your Weight Loss Journey. By the end of this module, you will be able to set yourself up for weight loss success by looking at daily habits. You will learn to adapt your program to life’s challenges and lose the weight for good.</p><p>Section 4 is entitled Weight Lifting 101. You will be able to select a workout program that fits your schedule and most effectively shapes your body.</p><p>Section 5 is a guide for Your First Week in the Gym. Helpful tips to select a gym you actually enjoy going to, best times to workout, and a basic 4 day lifting program for beginners.</p><p>Section 6 covers the very essential practice of meal planning for weight loss and healthy living. Plan a one week menu to facilitate in weight loss goals and healthy living.</p><p>By the end of this course, you will have all of the necessary tools and knowledge to begin building a body you are truly happy with. You will learn that no matter how many babies you have had, how old they are, or how much extra weight you have put on, you are capable of losing it all and getting back to your pre-baby weight. You will know how to lose weight after pregnancy. You are capable of getting into the best shape of your life! </p>", 
    "end_date": null, 
    "title": "Total Lose the Baby Weight Course", 
    "price": "50.00", 
    "instructors": "Sarah Mueller, RD", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/680876_372b_4.jpg", 
    "course_url": "https://www.udemy.com/losemama1/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-25T20:13:18Z"
}