{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong></strong></p>\n\n<p>LATEST: Course Last Updated 10th June 2016<br></p><p>************************************************</p>\n\n<p><strong>My goal with this course is simple: to help you lose as much fat as humanly possible in a single week, WITHOUT sacrificing metabolism or the fear of rebound weight gain</strong></p>\n\n<p><br></p>\n\n<p>Continue reading...</p>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>About this course:</p>\n\n<ul><li><strong><em>No workbooks, CD's or anything else is required</em><br></strong></li><li><em><strong>Tons of satisfied students</strong></em></li><li><em><strong>Full, free lifetime access</strong></em></li><li><em><strong>All future extra lectures and upgrades are always included for free</strong></em></li><li><em><strong>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</strong></em></li></ul>\n\n<p>+++++++++++++++++++++++</p>\n\n<p>This course teaches students the ideas needed to <strong>lose</strong> the <strong>most amount of fat</strong> humanly possible in just 7 short days - all whilst doing it in a <strong>safe </strong>and <strong>practical </strong>way. What does this mean to you?</p>\n\n<p>This means that in 7 days from now, you will be able to <strong>look better and feel better</strong>. Your <strong>clothes</strong> will be <strong>looser </strong>and you will have more <strong>energy </strong>than you ever thought possible. People will <strong>compliment </strong>you and ask you what you've been doing.</p>\n\n<p>In the last few years, I've tried to lose weight and I've <strong>tried </strong>many <strong>methods </strong>that plainly do <strong>not work</strong>. I was almost ready to give up as it seemed that <strong>no one agreed</strong> with one another and <strong>no one</strong> had the <strong>answer</strong>. I then stumbled upon this diet that seemed promising. And I gave it a shot. And well, the rest is history - I got results that made me <strong>wish </strong>that I had found this <strong>answer </strong>much <strong>sooner </strong>than I did.</p>\n\n<p><br></p>\n\n<p><strong>That's all well and good - but what does this mean for you and what does this course really teach you? </strong></p>\n\n<p><br></p>\n\n<p>The course is divided into a number of parts - but most importantly are the following 2 parts. Continue reading to see what you'll learn inside this course.</p>\n\n<p><br></p>\n\n<p><strong>The Diet</strong> - This diet is likely to be <strong>unlike </strong>anything that you've tried before. it will be both <strong>harder </strong>and <strong>easier </strong>than what you're <strong>accustomed </strong>to if you've ever tried to lose weight. You'll see exactly what I mean on the inside.</p>\n\n<p><strong>The Exercise</strong> - each training session will last a <strong>total of 17.5 minutes</strong>. That's it. So for each day, you'll only be doing the <strong>exercises </strong>that I'll show you (<strong>pictures </strong>for demonstration purposes are <strong>inside </strong>the course) for a total of <strong>17.5 minutes</strong>. No more and no less. After that, you'll be free to continue with your day. <strong>Forget spending hours in the gym</strong>. And more importantly, you can do the <strong>exercises anywhere</strong> - in your house, in a park, even in the street if you want. We'll just use a few <strong>basic </strong>equipment <strong>that </strong>you might already have or can buy for a few dollars.</p>\n\n<p>If you've tried <strong>diet programs</strong> before, you know that many of them <strong>impose </strong>things on you that are <strong>downright stupid, difficult or even impossible</strong>. <br></p>\n\n<p>What I am offering you here is a chance to <strong>get started</strong> on your dream body and see <strong>results </strong>after <strong>just one week</strong>. Imagine a week from today -<strong> the new you, set on a the path of having the best body of your entire life.</strong> Well stop imagining and <strong>take action,</strong> because that is exactly what you'll have.</p>\n\n<p>Finally, if this product doesn't work for you, the <strong>risk is all on me</strong>. The course is protected by <strong>Udemy's 30 day money back guarantee</strong>, so if you do not get the results that you want, then you'll get your money back. <strong>No questions asked</strong>. So in reality, you have <strong>everything to gain and nothing to lose</strong>.<br></p>\n\n<p>If you <strong>believe </strong>that you are ready to take your <strong>physical body to the next level</strong>, then this is the course for you. The information that you'll learn from this course will <strong>set you up for life</strong>. No more yo-yo dieting that doesn't work. Learn the system that has <strong>helped me and countless others </strong>to <strong>lose weight </strong>and make it your own today. Enroll now.<br></p>", 
    "end_date": null, 
    "title": "Want To Lose The Most Amount Of Weight In Just 1 Week?", 
    "price": "20.00", 
    "instructors": "Kevin Farrugia", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/640664_c9f7_3.jpg", 
    "course_url": "https://www.udemy.com/lose-fat-fast-the-fastest-fat-loss-week/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-14T19:00:42Z"
}