{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>If you spend less than an hour a day doing these small habits, you'll get weight loss results that you can keep with you for life.</strong></p><p>Have you ever felt overwhelmed with fitness information when you're trying to lose weight? Chances are you're probably confused about which tactic to follow, when all you want to do is find the most effective way to lose fat. </p><p>You're not alone. I used to feel the same way when I started to lose weight and it was a frustrating experience for me. I've been in the same situation. I used to think that losing weight meant that I had to starve like a skinny model and start doing the types of cardio that had thousands of moves. </p><p>What I found out was that I didn't need to do either of these. All I needed were these micro habits that I'm about to teach you and some tools to help me get in shape.<br></p><p>In this course:</p><ul><li>You'll learn the most effective micro habit for your diet to lose weight effectively, consistently and permanently.</li><li>You'll discover how to stack these small habits to add more accuracy and precision to your diet.</li><li>You'll find out how you can overcome weight loss plateaus.</li><li>You'll also learn how to burn off those last few pounds of lower belly fat.</li><li>You'll find out how you can work out effectively to burn fat without resorting to the mind-numbing and endless number of cardio moves.</li></ul><p><br></p><p>Right now you're probably wondering if getting in shape is even possible for you and I can tell you that with this course, it definitely is. This course is perfect for those who want to focus all of their efforts on the most effective weight loss tactics instead of chasing the next weird tip. </p>", 
    "end_date": null, 
    "title": "Weight Loss Masterclass", 
    "price": "20.00", 
    "instructors": "Adam Lee", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475752_19f5_9.jpg", 
    "course_url": "https://www.udemy.com/the-honest-truth-about-losing-belly-fat/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-14T07:25:21Z"
}