{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p style=\"\">  \t       Are you tired of weight loss problems constantly being a part of your life? Is getting to the gym to exercise a problem? Are you tired of feeling guilty for eating bad or missing a workout? Do you wish you knew how to lose weight, a plan, that will work for you without having to break the bank to get started?  </p>  <p style=\"\">  \t       Losing weight can be maddening, frustrating, annoying and generally irritating. You put in all of this effort, and get minimum results. You change your eating, you change you entire diet, you take time away from your family and friends and spend it in the gym. You quit or want to quit, but feel guilt and frustration with yourself when you quit.  </p>  <p style=\"\">  \t       Weight Loss Mastery will solve your problems. It is so easy that you will be succeeding immediately. It is not a plan that asks you to change your entire life to get results, it solves the problems of getting mad at yourself by giving you the tools to start right back up with no problem. Just binged on donuts and pizza, no problem just keep on with the plan.  </p>  <p style=\"\">  \t       Weight Loss Mastery does not require exercise. It will fit in your normal daily plan and allow you to spend time with your family and friends as usual, and be on your plan without them even knowing you are losing weight. The only thing they will know is you are losing weight and feeling great.  </p>  <p style=\"\">  \t       So, no more frustration, no more madness, no more worries, just easy common sense success in weight loss. Are you ready to master weight loss forever?  </p>  <p style=\"\">  \t  Copyright - All information in this course is protected by USA and  International approved copyright law. No content may be shared in any  form without the authors signed consent.  - Gregory Johnson 2014 -  </p>", 
    "end_date": null, 
    "title": "Weight Loss Mastery - Master Weight Loss  - Water Diet", 
    "price": "20.00", 
    "instructors": "Gregory Johnson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/211128_c425_6.jpg", 
    "course_url": "https://www.udemy.com/weightlossmastery/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-05T20:23:58Z"
}