{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>&quot;<em style=\"\">A Rule Says You Must Do It This Way, A Principle Says, This Works, And Has For All Recorded Time</em>,&quot; Robert McKee, STORY <br style=\"\"> <br style=\"\"><strong style=\"\">These are not rules to lose weight. </strong></p><p><em style=\"\">These are not strategies to lose weight. </em></p><p><strong style=\"\">This is not a weight loss diet of any kind. </strong></p><p><em style=\"\">These are the principles for you to lose weight.</em> </p><p>After years of study on why I couldn&#039;t lose weight, with failure after failure under my belt, I finally cracked the code, I finally figured it out, and my waist line has never been the same again. <br style=\"\"> <br style=\"\">Talking to hundreds of weight loss success stories and discovering what they did right and what they did wrong. I took not just one life time of struggles and knowledge, but hundreds, and learn what they all did to not just lose 10, 20, 30, or even 50 pounds, but 100&#039;s of pounds and keep it off. <br style=\"\"> <br style=\"\">It wasn&#039;t massive lifestyle changes<strong style=\"\"> (T</strong><strong style=\"\">hough they changed their lifestyles and you will too!)</strong><br style=\"\"> <br style=\"\">It wasn&#039;t one single diet <strong style=\"\">(finding two people from two different places that did the exact same diet was incredibly rare)! </strong><br style=\"\"> <br style=\"\">It wasn&#039;t some special pill <strong style=\"\">(no shortcuts or surgery) </strong><br style=\"\"> <br style=\"\">It wasn&#039;t hours of gym time or home workouts <strong style=\"\">(Some did, some didn&#039;t, in the end, it didn&#039;t play a factor)</strong>. <br style=\"\"> <br style=\"\">It was Ten Basic Principles. <strong style=\"\">Small, simple, easy changes that when added to their daily lives made losing weight easier, faster, and healthier. </strong><br style=\"\"> <br style=\"\">If you want to <strong style=\"\">lose weight fast</strong>. </p><p>If you want to change your body. </p><p>If you want to just be healthier. </p><p><strong style=\"\">Weight Loss Principles is your answer </strong>to constant, consistent, and powerful weight loss that will let you naturally lose the pounds. <br style=\"\"> <br style=\"\">Discover What One Shift Of Focus Will Do For Your Overall Weight Loss Overnight. <br style=\"\"> <br style=\"\">Learn How Much Water You Should Be Really Drinking? <br style=\"\"> <br style=\"\">Find Out How To Keep Your Body Full, Happy, And Energized Throughout The Day <br style=\"\"> <br style=\"\">And these are just three principles. There are seven more principles that will guide you through your weight loss journey and when you apply them, you&#039;ll be one step closer to your ultimate body. <br style=\"\"> <br style=\"\">Weight loss doesn&#039;t have to be difficult. <br style=\"\"><strong style=\"\"></strong></p><p><strong style=\"\">You don&#039;t have to struggle. </strong></p><p><strong style=\"\"></strong>You don&#039;t have to spend every day wondering why you can&#039;t lose the weight. </p><p><strong style=\"\">You deserve more. </strong></p><p>Deserve more from your body. Deserve more from the diet books you invested in. Deserve more from life. <br style=\"\"> <br style=\"\">Weight Loss Principles will show you the truth. </p><p>It will break your delusions. It will take you by the hand and give you the knowledge of hundreds of people who were in your place, or most likely, far worse off than you. People who, like myself, struggled with weight for ten, or even twenty years (like I did), constantly yo-yoing up and down the ladder of weight loss. <br style=\"\"> <br style=\"\">They say there&#039;s two ways you can succeed. You can work hard and struggle day in and day out, learning from your mistakes. Or you can learn from the mistakes of others and start out ahead of the game. <br style=\"\"> <br style=\"\"><strong style=\"\">Weight Loss Principles will let you start out ahead of the game. <br style=\"\"> </strong><br style=\"\"></p>", 
    "end_date": null, 
    "title": "Weight Loss Principles, Or How I Drop Weight Without Stress", 
    "price": "30.00", 
    "instructors": "Clarence Oliver", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418612_2640.jpg", 
    "course_url": "https://www.udemy.com/weight-loss-principles-or-how-i-drop-weight-without-stress/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T20:08:27Z"
}