{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>In this six week, 'Love Food and Lose Weight without Dieting' course you'll find everything you need to change your daily diet and the way you think about eating forever.  You can look forward to never dieting again, to enjoy the food you eat and to love looking in the mirror.  We are going to work together so that you can see why, despite dieting, you have put on more weight, or have been unable to lose weight.<br></p><p>This course is different from any other weight loss course because weight loss, or weight gain, is never just about the food we eat. This course will help you see that weight loss is more about the way we <em>think</em> about ourselves and our daily diet and how easy it is to change that thinking.<br></p><p>I am a Wellbeing and Weight Loss Coach and have been working in this field for more than a decade.  I am also an author and have Diplomas in Diet and Nutrition and Raw Food Nutrition. <br></p><p><strong>Learn what foods you and your body love and how these foods can help you to lose weight</strong></p><p>You’ll get daily weight loss video tips. Tips that help you see yourself, your habits and the food you eat differently.</p><p> Each week, there is a chapter that helps you to:</p><p>- understand what's in the food, beside the calories, that is making you fat and preventing you from losing weight</p><p>- see why it feels as if you're addicted to food and can't lose weight</p><p>- discover where refined sugar is hidden in food and how you can cut it out effortlessly in order to lose weight</p><p>- see the invisible part your gut and immune system play in weight gain and weight loss</p><p>- understand how food doesn’t comfort you and why you’re not an emotional eater and so can lose weight easily</p><p>- discover exactly how drinking water helps you to lose weight</p><p>and there are daily recipes, full of healthy, nutritious, non -diet, tasty food that you can have fun creating.<br></p><p>There are also bonuses including a juice ebook, a smoothie ebook, an infused water ebook and my Top Ten Recipe ebook.</p><p><strong>Remember what it’s like to eat ‘normally’ and feel ‘normal’ again</strong></p><p>Rather than just cutting things out of your daily diet, this course will help you to see what to add to your daily diet to enhance your life. One of the reasons that diets fail is because diets all involve feelings of deprivation and denial.  You feel as if you are being denied the foods you like to eat.  Diets feel hard and difficult and that’s why this isn’t a diet, following this course will help you to feel empowered, liberated from old habits and beliefs and will help you  to lose weight easily and effortlessly.</p><p><strong>About this course</strong></p><p><strong></strong>This course is suitable for anyone who has ever been on a diet, anyone who has put the weight, plus more, back on after a diet.  Anyone who has a difficult relationship with food and can't lose weight.  I want you to have the freedom to eat in a way that makes you feel fabulous and healthy. </p><p>When you finish this course, you’ll have practical tools that help you to lose weight, tools you can use forever, tools that will become a natural part of your daily life and that you won’t even think about.  You’ll also have the body you want.<br></p><p><em>‘As a veteran of so many diets that I felt qualified to write an encyclopaedia on the subject, and then finding myself heavier than ever, I just didn’t see how I was ever going to lose the 5 stone that I realistically recognise I need to do. So when I contacted Elaine, I just knew it was the answer for me. Everything she said confirmed that this was the system that could work </em>'If you do what you have always done you then will get what you have always got!</p><p><em>I have heard those words a thousand times over my life, never did they apply to me more then when Elaine said them to me. Having been overweight my whole life and having done numerous diets some with some success but none ever successful, I promised myself that in 2010 I would no longer diet but would work out my issues with food from the head down, as I felt that for too many years I had tried to loose weight just by concentrating on my body and not doing any work on my mind and thought processes. That's where Elaine comes in. From the very first moment I met Elaine my life began to change, I now view food in a completely different way, in fact I don't view food at all , Food doesn't interest me, I eat only when I am hungry and I eat just what I need and no more, Have I lost weight ?? yes I have in my first two weeks I'd lost 9lbs, I am looking forward to my future so much as I can see my body change everyday and I feel so much better, I honestly feel cleaner from the inside out! Would I recommend Elaine? most definitely particularly if your ready to retrain yourbrain and are ready to feel good about yourself again.'for me, if I was prepared to change my life. It’s been amazing, I’ve lost 2 stone already and know that the rest will gradually go too. It really doesn’t seem a diet at all, I just have a different relationship with food now, it doesn’t rule my life, yet I still enjoy my meals. And some of the suggestions she gave me apply equally to other areas of my life too, so generally I’m feeling more confident and optimistic, and even enjoying exercise too! ’</em><em></em><br></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "Weight Loss: Love Food and Lose Weight Without Dieting", 
    "price": "25.00", 
    "instructors": "Elaine Hilides", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/560562_4630_4.jpg", 
    "course_url": "https://www.udemy.com/love-food-and-lose-weight-without-dieting-/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-21T15:11:32Z"
}