{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p><strong>*LET APRIL BE THE MONTH YOU SPRING INTO YOUR WEIGHT LOSS!</strong><br><strong></strong></p>\n\n<p><strong>*Newly Updated DECEMBER 2015</strong><br></p>\n\n\n\n\n\n<p><strong>*Find out what over 4500 professionals, just like you, have been learning about losing weight FAST, even with a BUSY lifestyle.</strong></p>\n\n\n\n\n\n<p><strong>Is this course for you?</strong></p>\n\n\n\n\n\n<ul><li>As a busy professional, have you gained more weight than you would like?</li><li>Has the business of life made it hard to lose weight through traditional diet and exercise?</li><li>Are you frustrated with not reaching your weight loss goals?</li><li>Is that extra weight making going to  work hard, being with family a drag, and going out with friends a thing of the past?</li><li>Are you frustrated with \"diets\" and \"dieting\", and find them impossible to stay on with your busy lifestyle?</li></ul>\n\n\n\n\n\n<p><em>THEN WEIGHT LOSS MASTERY FOR THE BUSY PROFESSIONAL IS FOR YOU!</em></p>\n\n\n\n\n\n<p><strong></strong>Are you a busy professional who works all day, gets home after dark and does not have the energy to do anything else but sit on the couch and watch T.V.? Does losing weight sound like an impossible task? Has your health and fitness declined as a result of your busy schedule?</p>\n\n\n\n\n\n<p>If you are like me and most busy professionals, you have tried many weight loss programs, fads, and diets and become overwhelmed, confused, and stressed and have given up. If you go to the bookstore today or type weight loss into your search engine you will find a multitude of weight loss books, programs, and dieting advice. Where do you start? Who do you believe? It all becomes too overwhelming to even start at times.</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><em><strong>WHAT ARE STUDENTS SAYING?</strong></em></p>\n\n\n\n\n\n<p>\"Great information that can be put to use in stages. I found it easy to work Dr. Weir's leanings into my everyday life,<strong> </strong><em><strong>and have lost over 20 pounds in the last month and a half!</strong>\" </em>- Chuck</p>\n\n\n\n\n\n<p>\"Dr. Weir does an excellent job at bringing a science based weight loss system to the everyday person. I love how he breaks the system into bite sized chunks that are easy to follow.\" - Kyna</p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p>Weight Loss Mastery For The Busy Professional Simplify's Weight Loss To Give You A Confident Mastery Over Your Body To Shed Pounds, Look Sexy, Have More Energy And Feel Young!<br></p>\n\n\n\n\n\n<ul><li><em>Confidently HACK your nervous system to make it loose the weight for you</em></li><li><em>Learn why \"dieting\" just does not work</em></li><li><em>Easily increase your metabolism to burn fat even when your not exercising</em></li><li><em>Find the missing motivation to not only shed pounds, but keep them off</em></li><li><em>Detoxify and heal your digestive system and gut for sustained weight loss</em></li><li><em>Balance your adrenal glands for better sleep and less stress</em></li><li><em>Find an understanding as to why other \"diet plans\" have not worked for you</em></li><li><em>Learn a sustainable exercise program</em></li></ul>\n\n\n\n\n\n<p><strong><em><br></em></strong></p>\n\n\n\n\n\n<p><strong><em>Weight Loss Mastery For The Busy Professional, comes with the Udemy 30 Day 100% Money Back Guarantee.</em><em> You have nothing to lose, EXCEPT THE WEIGHT!</em><br></strong></p>\n\n\n\n\n\n<p><strong><em><br></em></strong></p>\n\n\n\n\n\n<p><strong>Loose 20-60 pounds in 2 to 6 month and keep it off...even if you are busy, have a job, and no energy!</strong><br></p>\n\n\n\n\n\n<p><strong>Meet your teacher:</strong></p>\n\n\n\n\n\n<p>My name is Dr. Michael Weir, and I am a wellness based chiropractor with over a decade in private practice, helping my busy, professional patients reach their fullest health potentials. I found very early on in my practice that holding extra pounds or being overweight was a huge detriment to my patients feeling great, being out of pain, and living the lives they deserved, BUT they were confused and frustrated with trying to lose that weight through traditional dieting and diet plans. Not only that, most of my patients work in the tech industry, sitting at a computer for 8 to 12 hours a day. Finding the time to lose weight was simply an impossibility.<em> This is why I created this course seven years ago and have delivered it to thousands of people. </em><strong></strong> We are all looking for answers to our health and healing, and Weight Loss Mastery will help give you those answers to help you loose weight.</p>\n\n\n\n\n\n<p>My back ground and post-doctorate education is in the field of \"chiropractic neurology\" which is the study of the brain and nervous system and the ways to help it with out the use of drugs or surgery. Having this back ground showed me how vital the brain is to EVERYTHING we do. It is the master computer and without it working well, there is no way we can be healthy. This is one of the reasons I spend as much time as I do talking about the brain and nervous system in Weight Loss Mastery For The Busy Professional...without our brains leading the charge towards weight loss there is no way we can lose weight and sustain that weight loss.</p>\n\n\n\n\n\n<p>One of the things that greatly separate me from some other teachers is that I am still in daily private practice working one on one with my patients just like you in the real world. This gives me an advantage in teaching you, because I get to sit down every day and hear what the real world struggles are. The struggles of a lack of time to pursue weight loss (this is why I originally developed the \"Metaboost System\" to help speed up your weight loss process with minimal time spent), or the \"yoyo\" effect that my patients were getting when they would lose weight just to have it come right back (as I really dug deep with my patients I found this was because their brains were not in the right place to keep weight off and this is why the psychology portion of this course is so important). As I find new ways to help my patients lose their weight I will share this with you, with brand new course material over the life time of this course.</p>\n\n\n\n\n\n<p><strong>What is Weight Loss Mastery For The Busy Professional? </strong></p>\n\n\n\n\n\n<p>Weight Loss Mastery is about demystifying weight loss and what it takes to be healthy. Its six simple tools to help you loose weight in a simple, uncomplicated way. In the United States we have made weight loss and <em>dieting </em>into such a complex thing that most people are defeated before they even start a program. Dieting has become about counting calories, points, labels, work outs, etc, which can be overwhelming, stressful, and plain not fun. Weight Loss Mastery gives you the tools, the knowledge, and the motivation to make weight loss a part of your life, instead of molding your life around a certain diet or dieting plan.</p>\n\n\n\n\n\n<p><strong>Why Weight Loss Mastery For The Busy Professional? </strong></p>\n\n\n\n\n\n<p>I have found in over a decade private practice that if my busy patients did not make lifestyle changes there was no way that they would be able to 1) loose weight and 2) even if they did lose weight they had a terrible time sustaining and keeping the weight off. That is why I wanted to make a program and a course that was easy to make into a life style. I wanted to make it something that you look forward to instead of dreading. Life should not be stressful and loosing weight should not be either. </p>\n\n\n\n\n\n<p>The other piece of the weight loss puzzle that is all too often over looked is the psychology and neurology of weight loss. If you do not have the motivation, or the tools to keep your head in the game of loosing weight it is very hard to maintain. In this course, I show you how to stay on track, how to fight off discouragement, and stay in the weight loss game.</p>\n\n\n\n\n\n<p><em>Don't forget that with Weight Loss Mastery For The Busy Professional, you have the Udemy 30 Day 100% Money Back Guarantee!</em><br></p>\n\n\n\n\n\n<p><strong>Is Weight Loss Mastery For The Busy Professional a diet?</strong></p>\n\n\n\n\n\n<p> Weight Loss Mastery is not a diet in the traditional sense, because I HATE DIETS AND DIETING! There is a reason that the first three letters of dieting are \"DIE\". I will not assume that I know what kinds of foods you like or what types of allergies you may have by giving you a cook book or a set of \"rules\" that you have to follow. Rules, stress,, dieting, counting, boring foods and fads are not sustainable and I want this lifestyle to be sustainable for you for the rest of your life. So, I am going to give you the knowledge of what foods are good, and what foods are bad, then show you how to create awesome meals that taste good and that you enjoy. </p>\n\n\n\n\n\n<p>Dieting Does Not Work, lets find something that does! Lets find a way to have fun, eat great food, and loose weight in the process. That's Weight Loss Mastery.</p>\n\n\n\n\n\n<p><strong>Do I have to exercise while doing Weight Loss Mastery For Busy Professionals? </strong></p>\n\n\n\n\n\n<p>Exercise in our country has become this weirdly complex, almost elite thing. You have to be a \"member\" and do certain \"routines\". Well let me complicate and demystify exercise...exercise should be fun, you should be able to do it ANYWHERE, and it should be something we can sustain. I am going to show you how to do this in this course.</p>\n\n\n\n\n\n<p> I know what you are thinking, that you have TOO much weight to loose and can YOU really loose 20-60 pounds? Well the answer is yes! Science has shown this to be true and I have seen it over and over with my patients. </p>\n\n\n\n\n\n<p>The answer is more simple than you have been lead to believe, its about getting your brain working in you favor instead of fighting against you constantly, its about getting your metabolism turned ON instead of turning it off (which is what most traditional dieting plans or exercise plans do), and its about getting your physiology (your body) turned in a direction that your pounds fall off.</p>\n\n\n\n\n\n<p><strong>10 Point Checklist When Evaluating If  This Course (Or Any Course) Is Right For You</strong></p>\n\n\n\n\n\n<p>Over the years I have attended hundreds of seminars, and have taken countless online course. I know what works and what doesn't. I have found that all good courses share the following list of positive traits, and I have (and will continue to) made these my goals when creating Weight Loss Mastery for the Busy Professional for you.</p>\n\n\n\n\n\n<p>1. All great courses start at an easily understandable level.</p>\n\n\n\n\n\n<p><em>Over the years working with my patients I have found that if I do not lay a really good foundation for them we can not build. This is why Weight Loss Mastery starts with the psychology and the neurology. We want to start with a very easy to understand foundation so that we can build from that.</em></p>\n\n\n\n\n\n<p>2. A great course is typically taught by some one who is walking the walk and not simply talking the talk. Simply put, they are taught by someone who is daily doing the work they are teaching.</p>\n\n\n\n\n\n<p><em>As I talked about earlier, I am in daily private practice working with patients just like you. I hear all of their struggles, their road blocks and know what it takes to fight through those. Too many teachers today are not in the trenches and simply talking the talk. I always tell my patients that you wouldn't  hire a financial planner who lives on the streets. Find teachers who are walking this walk with you, not simply talking the talk.</em></p>\n\n\n\n\n\n<p>3. All great courses typically teach you how to work smarter, not harder.</p>\n\n\n\n\n\n<p><em>Now don't get me wrong here, anything worse fighting for is going to take a lot of hard work. I hope you already know that about weight loss. What Weight Loss Mastery for the Busy Professional has done is to give you a program to not make it any harder than it needs to be. We do this a lot in our world today, we make things harder than they need to be. My goal with this course was to give you direction to make weight loss as simple as possible, to help you work with your body, in a smarter way, than to fight up against. </em></p>\n\n\n\n\n\n<p>4. A great course puts you in an environment in which you are surrounded by like minded people who are pursuing a common goal, or interest. In an online environment like Udemy,  the course must give you the opportunity to be a part of discussion boards or groups.</p>\n\n\n\n\n\n<p><em>This is one of the reasons that I love Udemy is that they have a built in community. Community in a journey toward weight loss is very important. It gives you a place to realize that you are not alone. It gives you people to ask questions to if you are getting stuck. My favorite part of community is that you can share your success with them! Weight Loss Mastery for the Busy Professional has this is spades with its online discussion board.</em> </p>\n\n\n\n\n\n<p>5. A great course asks really good questions and finds the root of the problem that the learners are asking.</p>\n\n\n\n\n\n<p><em>I always tell my patients that in order to figure out what is wrong with them we need to get to the root, or the cause of the problem. Often in our world today we simply cover over symptoms, and never find the root cause of a problem. I was finding this over and over with my patients weight loss journeys early in my career, and I started to ask some different questions. \"Why is it so hard for people to lose weight and then keep it off?\". The answer I found is the foundation of Weight Loss Mastery and one of the first lessons we teach. It is my philosophy that without answering this one question you will never be able to have consistency in your weight loss journey.</em></p>\n\n\n\n\n\n<p>6. Lastly, a great course should have material that you should be able to take action on immediatly, and begin seeing tangible results right away. In my profession that may mean I learn a new technique that I can take back to my office on Monday morning and begin helping my patients.</p>\n\n\n\n\n\n<p><em>I created Weight Loss Mastery so that every single step that we outline can be actionable as soon as you end the lesson. This is so important because I have found so often that most weight loss strategies require special equipment or the right gym, and not taking immediate action can be the end of your weight loss journey right there. The more that you procrastinate on taking action, the less likely it is that you will follow through. After each lesson, I have an action step, or steps to take immediate action on. This creates momentum and momentum leads to results!</em></p>\n\n\n\n\n\n<p><strong><br></strong></p>\n\n\n\n\n\n<p><strong><em>30 Day Trial of Weight Loss Mastery For Busy Professionals</em></strong></p>\n\n\n\n\n\n<p>You really wouldn't believe how excited I am for you to join me in this course, and bring your health and fitness to its greatest potencial! I know though, that this course may not be for every one out there. Every one is at a different point in their journey, so if you are for any reason unhappy with the results you are seeing from Weight Loss Mastery I want you to find a program that is going to work for you. </p>\n\n\n\n\n\n<p>So, if for any reason you aren't happy with the results you are seeing from Weight Loss Mastery For The Busy Professional, you have the Udemy 30 Day 100% Money Back Guarantee.</p>\n\n\n\n\n\n<p>So you have absolutely not one thing to lose...except that extra weight is keeping you from your greatest potential!</p>\n\n\n\n\n\n<p>Isn't it time that you finally moved past your battle with weight loss, and concurred your goals?</p>\n\n\n\n\n\n<p>Join me today and together, we will MASTER your weight loss!<br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Weight Loss Mastery For The Busy Professional", 
    "price": "50.00", 
    "instructors": "Dr. Michael Weir", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594466_b7db_2.jpg", 
    "course_url": "https://www.udemy.com/weight-loss-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-26T22:41:26Z"
}