{
    "selfpaced": true, 
    "topic_name": [
        "Health & Fitness"
    ], 
    "description": "<p>Do you find it <strong>hard to resist cravings</strong> for soda, cookies, candy, ice cream and other sugary foods? Does it sometimes feel like sugary cravings have <strong>taken over your eating habits</strong> and you're <strong>powerless to control</strong> them? Have you been <strong>gaining weight</strong> because of this? You've come to the right place.</p><p>I used to be a sugar addict. In this course, you will learn the exact techniques I used to overcome my <strong>panic around giving up sugar</strong>, <strong>intense sugar cravings</strong> and <strong>uncomfortable withdrawal symptoms</strong>. I'm very excited to share with you the exact steps that have <strong>worked for me and tons of my clients</strong>. </p><p>I can confidently say that if you work through the course, you will be able to get back in control of how much sugar you consume. From then on, it will be up to you whether you want to be <strong>sugar-free</strong> or choose to have it in <strong>limited amounts</strong>.</p><p>In this course, we will <strong>tackle sugar addiction in 3 stages</strong>. </p><ol><li>The first stage is the <strong>panic and anxiety</strong> that set in the moment you decide to give up sugar. This happens because you have become emotionally attached to your sugar fix and can't imagine your life without it. It is like having someone pull away your security blanket. Together, we will work on calming this panic, so you can start cutting down on your sugar intake calmly and in a detached manner.</li><li>The second step is <strong>overcoming cravings</strong> you will feel once you start avoiding sugar. Your body is accustomed to getting its sugar fix at set times and occasions, and it will make it a point to remind you of that. We will work on calming the cravings so you make healthy choices in the moment instead of relapsing.</li><li>The third aspect is the <strong>withdrawal symptoms</strong>. Not everyone experiences withdrawal symptoms and even then they may be more or less intense depending on your constitution. We will work on alleviating those symptoms as well, so you can continue to make progress.</li></ol>", 
    "end_date": null, 
    "title": "Zero Sugar Cravings Now! Get Rid of Sugar Addiction Easily", 
    "price": "20.00", 
    "instructors": "Sonal Pandey", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542596_e777_12.jpg", 
    "course_url": "https://www.udemy.com/sugar-detox-rid-sugar-addiction-cravings/", 
    "currency": "USD", 
    "subject_name": [
        "Dieting"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-01T21:55:47Z"
}