{"selfpaced": false, "topic_name": ["Information Technology"], "description": "\n\n                    \n                    \n                    Enterprise computing is a computer hardware/software environment that is typically used to anchor corporate and government Information Technology data center infrastructures. Enterprise computers are generally used to solve very large complex problems where high availability, high performance, high reliability and ultra-high security are required for addressing high volatility transaction volumes and where these key performance criteria are needed for delivering mission critical solutions.\r\n\r\nThe iSchool’s Enterprise Computing Strategies (ECS) MOOC is a free, self-guided, self-paced open online course. The course content will help participants develop a new appreciation for the issues and challenges faced by the modern technology manager. Upon successful completion of this course, participants will develop the tools necessary for making more informed computing infrastructure decisions. Participants will learn strategies in computing resource provisioning, since not all computing resources are created equal and since solving enterprise problems is not as easy as just adding more hardware. After this course participants will have an appreciation for developing a computing strategy that can help their organizations save money on equipment acquisition and labor, reduce energy consumption, and simplify and secure their IT infrastructure. Successfully completed coursework will result in a certificate of completion from Syracuse University’s School of Information Studies (iSchool) and IBM.\r\n\r\nInstructors for the course are Susan Dischiave - associate professor and director of the Bachelor of Science in Information Management &amp; Technology program for the iSchool at Syracuse - and Dave Dischiave - associate professor and director of the Global Enterprise Technology Programs and the Systems &amp; Information Science Program for the iSchool at Syracuse.\n\n                                    ", "end_date": "2014-10-13T00:00:00Z", "title": "Enterprise Computing Strategies", "price": 0, "instructors": "Dave Dischiave and Susan Dischiave", "institution_name": ["Marist College", "Syracuse University"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "http://ischool.syr.edu/contact/forms/ecsmooc.aspx", "duration": "6 weeks", "language_name": ["English"], "provider_name": ["Open Education by Blackboard"], "start_date": "2014-09-01T00:00:00Z"}