{"selfpaced": false, "topic_name": ["Information Technology"], "description": "\n\n                    \n                    \n                    Today's fast moving information security field creates demand for industry professionals with up-to-the minute knowledge of the latest technologies, threats and remediation strategies to keep systems secure. The need has never been greater, with customer data, employee personal information, personal health information and digitized intellectual property under constant risk of cyberattack and exfiltration.\r\nBy taking this course, you will gain an overview of Information Assurance (IA) from the view of a Chief Information Security Officer (CISO)—the person in an organization ultimately responsible for keeping information secure in an organization. Students are encouraged to find topics of interest, as they study the material provided. These can lead to insights into career directions within this broad and growing field.\r\nInformation Security and Risk Management will teach you the latest management tools and approaches for securing vital organization information, preparing you to find a direction that will allow you eventually to assume information security responsibilities. You will learn what technologies and practices keep information secure, as well as how to engage the people side of information security, equipping you with the latest methods and best practices you can apply immediately at your workplace. Topics covered include:\r\n\r\nInformation security strategies and individual privacy\r\nLegal security implications\r\nMedical health record confidentiality and integrity\r\nCutting-edge technologies\r\n\n\n                                    ", "end_date": "2015-07-06T00:00:00Z", "title": "Information Security and Risk Management: An Overview", "price": 0, "instructors": "Barbara Endicott-Popovsky", "institution_name": ["University of Washington"], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://www.canvas.net/browse/uwashington/courses/info-security", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Canvas.net"], "start_date": "2015-05-18T00:00:00Z"}