{"selfpaced": true, "topic_name": ["Information Technology"], "description": "\n\n                    \n                    \n                    The Internet has become an integral part of our daily lives. This course will teach you about the technological foundation of this worldwide network. You will learn about its physical foundation of data transmission based on the functional principles and technologies of local area networks (LANs) and wide area networks (WANs). The TCP/IP reference model, that lies at the base of the Internet, its protocols and countless applications, will be presented in the units to follow. The participant will gain comprehensive insight into the complex world of Internet technologies.\n\n                                            Syllabus\n                        \r\nWeek 1 : Introduction - The Internet is great, but is it really so complex?\r\nWeek 2 : Network Technologies - How can messages be transferred from one computer, by way of electrical or optical signals, to the computer next door or to one that is halfway around the world?\r\nWeek 3 : Internetworking with IPv4 - How does a data packet find its way through an Internet that consists of different but interconnected single networks with completely different technologies?\r\nWeek 4 : The New Internet Protocol IPv6 -How will it be possible in the future for smartphones, household appliances, cars, etc. to also be able to communicate with each other via the Internet?\r\nExtra knowledge: Hands-on Wireshark exercises\r\nWeek 5 : Transport Protocols TCP and UDP - Who can guarantee that my data will reach its goal intact after its long journey through the Internet across different networks?\r\nWeek 6 : Internet Applications - What else do we need to know in order to send an email or a video through the Internet?\r\nFinal Examination: Final Examination\r\n\n                                    ", "end_date": null, "title": "Introduction to Internetworking with TCP/IP", "price": 0, "instructors": "Prof. Dr. Christoph Meinel", "institution_name": [], "commitment": "", "subject_name": ["Computer Science"], "course_url": "https://open.hpi.de/courses/internetworking2014", "duration": null, "language_name": ["English"], "provider_name": ["openHPI"], "start_date": "2014-03-31T00:00:00Z"}