{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Attendees will participate in many hands-on activities that will help them practice the theory they learn.  </p>  <p>  \t  What is Agile? Agile is a set of principles and values as defined by Agile Manifesto (<a href=\"http://www.agilemanifesto.org/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">www.AgileManifesto.org</a>) The term Agile is some times used as an umbrella term that cover many product development frame work such as Scrum, XP (eXtream Programming) etc., . Scrum is one of the Product development frameworks that follow the principles of Agile. A brief overview of Scrum can be found here (http://www.scrumalliance.org/pages/what_is_scrum)  </p>  <p>  \t  In this class, the attendees will learn the Principles and Values of Agile and will explore in detail the practices of the Scrum Framework. During the one day session, the trainer will share his years of experience in coaching teams to become Agile using the Scrum framework. Practical tips on what works and what doesn&#039;t, how to create an environment for hyper productive team, etc will be shared during this class.  </p>  <p>  \t  Attendees will learn the concepts &amp; practices that they can take to their teams, and organization to make a difference right away. You will learn how to lead development teams towards Agile by creating and managing a product vision and product backlogs, planning releases and sprints, monitoring progress, and conducting retrospectives. Come prepared to learn! Come with an open mind! You will leave with a lot of learning and ton of energy.  </p>", 
    "end_date": null, 
    "title": "Agile and Scrum Training", 
    "price": "50.00", 
    "instructors": "KnowledgeHut - KH", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169456_63dc_6.jpg", 
    "course_url": "https://www.udemy.com/agilescrum/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T05:58:14Z"
}