{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\"><em>JOIN IN UDEMY'S MOST COMPREHENSIVE SPRINT RETROSPECTIVE COURSE!</em></strong></p>\n\n<p><strong class=\"redactor-inline-converted\"><em>THIS COURSE HAS BEEN DESIGNED TO SAVE YOU HUNDREDS IF NOT THOUSANDS OF DOLLARS ON SCRUM TRAINING </em></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Three reasons to TAKE THIS COURSE right now!</strong></p>\n\n\n\n<p>The unique reasons for taking this course are:</p>\n\n\n\n<p>\t1.\tComplete, Concise, Confident Overview of sprint retrospectives - I cover the theory and give you examples of how the theory is used in industry.</p>\n\n\n\n<p>\t2.\tConfidence in using scrum - In a very simple way, I teach you the fundamentals agile retrospectives and how to organize sprint retrospectives in industry without going into a class room or spending $£1000..</p>\n\n\n\n<p>\t3.\tYou get to ask me questions and see me respond to every single one of them thoughtfully!</p>\n\n\n\n\n\n\n\n<p><strong>What is sprint retrospective?</strong></p>\n\n\n\n<p>It is a method for boosting your team’s efficiency. Based on my experience, it is the perfect way to learn from the past and take that learning to learn new in the upcoming sprints.</p>\n\n\n\n<p><strong>Who should take is course?</strong></p>\n\n\n\n<p>Whether you are a novice, an expert or simply someone who wants the answer to the question \"what is sprint retrospective, this is definitely the class is for you.</p>\n\n\n\n<p><strong>What will I learn?</strong></p>\n\n\n\n<p>In this class you will learn:</p>\n\n\n\n<p>\t•\tConcise overview of sprint retrospective - Including 29 easy tips to hold a sprint retrospective successfully</p>\n\n\n\n<p>\t•\tThe facts based on real industry experience and research - The correct terminology and use of proper methods is essential to mastering it. My experience in industry and research into the topic has been used to give you a solid grounding in the most concise way possible.</p>\n\n\n\n<p>The course is video based with no supporting document necessary.</p>\n\n\n\n<p><strong>How is the course structured?</strong></p>\n\n\n\n<p>Each section features an overview of a particular aspect of holding a sprint retrospective and tips to organize it wonderfully. Examples are included throughout the course with excellent quality video and audio. All is based on real world experience.</p>", 
    "end_date": null, 
    "title": "Agile Retrospective: Continuous Improvement+Kaizen wth Scrum", 
    "price": "20.00", 
    "instructors": "Paul Ashun", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/864886_4c89.jpg", 
    "course_url": "https://www.udemy.com/agile-retrospectives-kaizen-lean/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-31T17:38:29Z"
}