{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>AntiPatterns provide great insight of real applications. It gives information of common solutions with negative consequences, how to avoid and correct them. It provides better terminology for communication and great understanding within organization to address the problem. You are Software Engineer, Architect or Project Manager, you have to understand the AntiPatterns, so that you can avoid the solutions which have negative consequence and correct them if they are already existing.<br></p>\n\n<p>Design Patterns says know the best practices for software design but AntiPatterns says know the negative solutions to avoid them and refactor them to work correctly. Some developers will definitely going to say that first we should AntiPatterns to avoid them. Then we will learn Design Patterns to know how should we do better design.</p>\n\n\n\n<p>This course provides provides basic understanding of AntiPatterns - What are AntiPatterns, History, Why to study them, Template and Catalog of popular AntiPatterns.</p>\n\n\n\n<p>Each AntiPattern is explained in a simple way with Introduction, Template, Background, General Form, Symptoms and Consequences, Typical Causes, Known Exceptions and Refactored Solutions.</p>\n\n\n\n<p>This course will be expanded soon, some of the AntiPatterns that will be added are-<br></p>\n\n\n\n<ul><li><strong>Spaghetti Code</strong></li><li><strong>Poltergeists</strong></li></ul>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p>Course will be updated with adding new AntiPatterns and existing AntiPatterns will be provided in detail to have good understanding of Software Development AntiPatterns to build the technical strength and shape your career.</p>", 
    "end_date": null, 
    "title": "AntiPatterns : Learn Software Development AntiPatterns", 
    "price": "20.00", 
    "instructors": "Suresh Kumar Srivastava", 
    "commitment": "39 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/641138_75f8_2.jpg", 
    "course_url": "https://www.udemy.com/software-development-antipatterns/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-15T07:28:15Z"
}