{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tAre you a creative or entrepreneur that wishes you could speak tech with your web development team? Sure, you’ve heard about APIs, but maybe you’re not totally sure what they are?  </p>  <p style=\"\">  \tIn this class we’ll learn all about APIs: what they are; and how to get started using them! Later on we’ll look at some code and live data from both Facebook and Twilio.  </p>  <p style=\"\">  \tOne last thing... If you&#039;re new to programming - you might also want to check out my <a href=\"http://www.udemy.com/programming-for-non-programmers/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Programming For Non-Programmers</a>.  </p>  <p style=\"\">  \t<strong style=\"\">Hey Chris, what&#039;s an API?</strong>  </p>  <p style=\"\">  \tHere&#039;s an example: have you ever heard someone say something like, “The NY Times has an API we can use.”? What they are saying is &quot;The NY Times has some data that you can freely access and use in your project.&quot;  </p>  <p style=\"\">  \tIn addition to that, the term API can also refer to apps that write and process data on our behalf. We’ll cover this, and much more!  </p>  <p style=\"\">  \t<strong style=\"\">Who Is this Class For?</strong>  </p>  <p style=\"\">  \tThis class is made for the total beginner. If you’re looking to learn about APIs you’re in the right place. If you’re a developer looking to query some API data, we’ll be providing you with code examples to take home.  </p>  <p style=\"\">  \t<strong style=\"\">For Non-Programmers</strong>  </p>  <p style=\"\">  \tMaybe you&#039;re new to APIs? Or you&#039;ve had one of the IT guys in your office try to explain this to you before, but to no avail? I totally get it, and so I&#039;ve designed this class with you in mind.  </p>  <p style=\"\">  \tWhat I’ve found is that the best way to learn the concepts of programming is to actually write some code yourself. (Much like how we learn a foreign language - you have to use the knowledge). If you’re not a developer, you should still be able to follow along with the code examples because we&#039;ll break down the logic step-by-step. Basically what I’m saying is... that we’ll learn by doing here.  </p>  <p style=\"\">  \t<strong style=\"\">Sign up for this class and you’ll learn:</strong>  </p>  <ul style=\"\">  \t<li style=\"\">What is an API?</li>  \t<li style=\"\">How an understanding of APIs can help cut development time of a project in half</li>  \t<li style=\"\">What APIs are available and worth knowing about?</li>  \t<li style=\"\">How to register a Facebook App so that we can start using the Facebook API</li>  \t<li style=\"\">How to write code to make an API call to Facebook that delivers a user’s “Top 10 Facbook likes”</li>  \t<li style=\"\">How to set up an app with the Twilio API</li>  </ul>  <p style=\"\">  \t<strong style=\"\">This Class Includes</strong>  </p>  <ul style=\"\">  \t<li style=\"\">Over 2 hours of easy to follow video content</li>  \t<li style=\"\">A project designed by me for you to be able to apply your skills </li>  \t<li style=\"\">A quiz  </li>  \t<li style=\"\">The final slide deck</li>  \t<li style=\"\">Code examples for working with the Facebook and Twilio API. All fo the code in this class is written in PHP. The concepts are the same and could easily be applied to Ruby, Python or other languages. </li>  </ul>  <p style=\"\">  \tI’m looking forward to class!  </p>  <p style=\"\">  \t<strong style=\"\">------------------------------------------------------------</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Feedback from my <a href=\"http://www.udemy.com/programming-for-non-programmers/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">Programming For Non-Programmers Series</a>:</strong>  </p>  <p style=\"\">  \t<strong style=\"\">&quot;You taught the class in four hours what took me two years to teach myself.&quot;</strong> - Matt Jared, Capital Factory Austin, X  </p>  <p style=\"\">  \t<strong style=\"\">&quot;I&#039;ve traveled a steep learning curve thanks to Chris&#039; friendly and lucid style of teaching.&quot;</strong> - Charles Best, CEO of DonorsChoose.org  </p>  <p style=\"\">  \t<strong style=\"\">&quot;I wish I had taken this class 5 years ago!&quot;</strong> - Michael Goodwin, UX Designer  </p>  <p style=\"\">  \t<strong style=\"\">&quot;You </strong><strong style=\"\">are the only person who has been able to sufficiently teach me code.&quot;</strong> - Darren Hakimi, Analyst  </p>  <p style=\"\">  \t<strong style=\"\">&quot;You are Articulate and Engaging. Broad and Diverse Range of Topics. That s right bro!!!!! </strong><strong style=\"\">Not easy to address so much in limited time.&quot;</strong> - student feedback  </p>  <p style=\"\">  \t<strong style=\"\">&quot;Informative, digestible, actionable&quot; </strong>- Katherine, Entrepreneur  </p>", 
    "end_date": null, 
    "title": "APIs: Crash Course", 
    "price": "25.00", 
    "instructors": "Christopher Michael", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51204_41de_5.jpg", 
    "course_url": "https://www.udemy.com/learn-apis/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-25T00:27:48Z"
}