{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>&gt;&gt; The most active TOGAF course on Udemy, with an active discussion board, instructor responds to questions, and English closed captions on all of the core lessons &lt;&lt;</strong><br></p>\n\n\n\n\n\n\n\n<p>Course updated often. Refreshed Section 5 and Section 6 with new easier to read slides, and added closed captions to Section 11 in FEB 2016!  UP TO DATE as of MAR 2016. New content added frequently since it was launched. Existing content improved. <strong>3</strong><strong>0 exam sample questions added.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>OVER 687 AWESOME REVIEWS!!! 4.4 STARS OUT OF 5!!! THANK YOU!!!</strong> 8000+ satisfied students! The number 1 TOGAF course on Udemy, by far.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Adeyemi</em> <em>says</em>: <em><strong>\"</strong>I was able to pass both the part 1 and part 2 exams thanks to the extremely good quality of both courses.<strong> It shaved months off my planned study time.\"</strong></em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>Mohammed says: </em><em>\"<strong>When I thought that I need at least 3 months to pass the course, I did it in 2 weeks, thanks to God and then to Scott and his course.</strong>\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>Frank says: </em><em>\"Yesterday I successfully passed my “TOGAF 9 Combined Part 1 and Part 2\" exam. <strong>Additional exam preparation, for added comfort, was achieved through Scott Duffy's online course, thanks Scott.</strong>\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t<em>Chander says: </em><em>\"</em><em>I have taken the OG93 - Combined Exam today, and Passed both. </em><em>Your Course has been greatly helpful.</em> <em><strong>I sincerely Thank you for this Wonderful Course!!</strong></em><em>\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Deepak says: \"A great course on TOGAF certification!!!\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Bhaskara says, \"The course helped me a lot to understand the concepts and memorize it in a very short span of time.\"</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Listen:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>If you look at the job listings, developers and architects with TOGAF experience are in high demand.</strong>  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                          You can get certified as an enterprise architect with the TOGAF 9.1 certification exam (OG0-091), and this course will teach you what you need to know!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                          It <strong>takes training to become an Enterprise Architect</strong>. Much of that comes through on-the-job skills learned working on software projects larger-and-larger in scope. But very definitely there is a very specific way to design software at enterprise scale.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                              The Open Group has defined a standard for this method for almost 10 years now, and over 400 companies and government agencies have been involved in crafting that standard. It is called <em>TOGAF - The Open Group Architecture Framework</em>.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The truth is:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                              This course <strong>helps you become certified in the TOGAF 9.1 specification</strong>. Through learning the Architecture Development Method (ADM), you will become better at designing systems. If you already architect software for a living, learning an official enterprise architecture framework such as this takes you to <strong>the next level of your career</strong>.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You owe it to yourself:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                            If you are a software developer, this is your chance to learn the proper techniques for assessing the requirements of an enterprise, and designing the right solutions for today and tomorrow! While software development is skill any teenager can acquire, and the salaries paid to software developers fall or are frozen, it's those who know the complex skills of designing large software projects that will still be in high demand.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                              Specifically, this course will teach you:  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul>  \t<li>The details of the TOGAF 9.1 Foundation exam (OG0-091), including how to book it, and my experiences taking the exam</li>  \t<li>The basic and core skills of the TOGAF framework</li>  \t<li>The Architecture Development Method (ADM), all of the phases, and the key information to know to pass the exam</li>  \t<li>Other topics covered on the exam, including Architecture Governance, Architecture Capacity, Enterprise Continuum, Capability Assessment and reference frameworks such as TRM and III-RM</li>  </ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                              This course is focused on passing the exam. In person classes for this same exam costs $2,000 and take 2 days of intensive training. This course aims to bridge the gap between that level of in-person training, and self-study.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you've ever tried to read the TOGAF 9.1 specification, or even the official study guides for the exam, you will perhaps agree that they are lengthy and hard to understand. The TOGAF 9.1 spec is <strong>654 pages long</strong>. The official study guide is <strong>265 pages</strong>. Both are written in that same style that many official specifications are written in - both very precise and extremely lengthy.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                                              Watching these lectures, doing the quiz questions, and following up with a reading of the relevant section of the specification will save hours off your self-study time, and will give you the confidence to take the exam and get certified at Part 1!  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>So join me:</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t                                                                Join over <strong>80</strong><strong>0</strong><strong>0 students</strong> studying for the TOGAF 9.1 Part 1 certification test! Many have taken and passed the exam after taking this course! I am confident that this course will save you many, many hours of studying time compared with just reading the 650 page spec yourself. I will personally answer your questions about this material, either privately or in a group discussion, and will point out what you should be focusing on. If you are in any way not satisfied, for any reason, you can <strong>get a full refund from Udemy</strong> within 30 days. No questions asked. But I am confident you won't need to. I stand behind this course 100% and am committed to helping you pass. You won't get that commitment from a book, or from any other TOGAF class on Udemy.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Read the student comments below to discover what type of instructor I am.</strong> I personally answer all questions, help every student who needs, and even update the course with new content to ensure this remains the #1 course on the topic. #1 Udemy, and #1 on the web.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course qualifies for Eight (8) Professional Development Units (PDUs) from the Project Management Institute (PMI), USA.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t    I am a TOGAF Certified architect, and a member of the Open Group's Architecture Forum - helping to define the standard going forward. I am using the TOGAF 9.1 specification under a commercial license.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t            TOGAF is a registered trademark of The Open Group in the United States and other countries.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>", 
    "end_date": null, 
    "title": "Become an Enterprise Architect with TOGAF 9.1 Part 1", 
    "price": "25.00", 
    "instructors": "Scott Duffy, Software Architect", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312662_52f1_8.jpg", 
    "course_url": "https://www.udemy.com/togaf-enterprise-architect/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T04:59:48Z"
}