{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>&gt;&gt; The only course on Udemy goes over the advanced Part 2 study topics in detail, and not just sample questions. &lt;&lt;</strong><br></p>\n\n\n\n\n\n<p><strong><strong>Fully English closed captioned! All slides available for download! All audio available for download! </strong></strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><em>Join more than 4700 students and 162 reviews in this course, and more than 8000 students in my Part 1 course with 687 reviews. </em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>It's possible:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>You can get certified as an enterprise architect with the TOGAF 9.1 certification exam Part 2 (OG0-092), and this course will teach you what you need to know!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>It takes training to become an Enterprise Architect. Much of that comes through on-the-job skills learned working on software projects larger-and-larger in scope. But very definitely there is a very specific way to design software at enterprise scale.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The Open Group has defined a free and public standard for this method for almost 10 years now, and over 400 companies and government agencies have been involved in crafting that standard. It is called <em>TOGAF - The Open Group Architecture Framework</em>.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Listen:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you are a software developer, this is your chance to learn the proper techniques for assessing the requirements of an enterprise, and designing the right solutions for today and tomorrow! While software development is skill any teenager can acquire, and the salaries paid to software developers fall or are frozen, it's those who know the complex skills of designing large software projects that will still be in high demand.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Specifically, this course will teach you:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>The details of the TOGAF 9.1 Certified <strong>Part 2</strong> exam (OG0-092), including how to book it, and my experiences taking the exam</li><li>How to apply advanced concepts of TOGAF</li><li>Every requirement of the exam covered in its own lesson</li><li>The key deliverables of the ADM</li><li>Customizing the TRM and III-RM for use</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is focused on passing the exam. In person classes for this same exam costs $2,000 and take 2 days of intensive training. This course aims to bridge the gap between that level of in-person training, and self-study.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Don't be alone:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>If you've ever tried to read the TOGAF 9.1 specification, or even the official study guides for the exam, you will perhaps agree that they are lengthy and hard to understand. The TOGAF 9.1 spec is 654 pages long. The official study guide is 265 pages. Both are written in that same style that many official specifications are written in - both very precise and extremely lengthy.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>It can be so much easier:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Watching these lectures, watching the sample questions, and following up with a reading of the relevant section of the specification will save hours off your self-study time, and will give you the confidence to take the exam and get certified at Level 2!</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>My promise:</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I am confident that this course will save you many, many hours of studying time compared with just reading the 650 page spec yourself. I will personally answer your questions about this material, either privately or in a group discussion, and will point out what you should be focusing on. If you are in any way not satisfied, for any reason, you can get a full refund from Udemy within 30 days. No questions asked. But I am confident you won't need to. <strong>I stand behind this course 100% and am committed to helping you pass.</strong> You won't get that commitment from a book, or from any other TOGAF class on Udemy.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>This course qualifies for Two (2) Professional Development Units (PDUs) from the Project Management Institute (PMI), USA.</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>I am a TOGAF Certified architect, and a member of the Open Group's Architecture Forum - helping to define the standard going forward. I am using the TOGAF 9.1 specification under a commercial license.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>TOGAF is a registered trademark of The Open Group in the United States and other countries.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>", 
    "end_date": null, 
    "title": "Become an Enterprise Architect with TOGAF 9.1 Part 2", 
    "price": "20.00", 
    "instructors": "Scott Duffy, Software Architect", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/479440_037a_5.jpg", 
    "course_url": "https://www.udemy.com/togaf-part2/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-18T00:41:51Z"
}