{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<em style=\"\">Building the First Application with Google Go</em> is your way into the world of software development. Go has a robust library and advanced techniques. This makes it a great language that can even be understood by people with no experience in programming.  </p>  <p style=\"\">  \t      Take a journey through the concepts presented by the Google Go language! Go is a language with no legacy, well suited for software developers, be it for beginners or experienced users.  </p>  <p style=\"\">  \t  The Google Go language presents fresh patterns of software development. You will learn about the core distinctive features of Go – goroutines and channels, which are used to design concurrent applications. You will gain familiarity with approaches of structuring application code, by breaking it into reusable components like functions, packages, and objects. Object-oriented programming; one of the central paradigms of modern software development, is also covered in this course. It offers the most popular and well-tested patterns for building brilliantly structured applications; the course finishes with creating a production-ready image manipulation program, which is built as a web application.  </p>  <p style=\"\">  \t  The course will help you to start building applications with Google Go right off the bat. Packed with examples, especially with a finished production-ready application from the final section, the course gives you the right vision of what software source code should look like.<strong style=\"\"></strong>  </p>  <h4><strong style=\"\">About the Author</strong></h4>  <p style=\"\">  \t<strong style=\"\">Rostyslav Dzinko</strong> is a software architect who has been working in the software development industry for more than six years. He was one of the first developers who started working with the Go language far earlier than the first official public release of Go 1.0 took place. Rostyslav uses the Go language daily and has successfully used it in production for more than two years, building a broad range of software from high-load web applications to command-line utilities. Rostyslav has a Master’s degree in Systems Engineering and will complete a PhD thesis in a year and a half.  </p>", 
    "end_date": null, 
    "title": "Building Your First Application with Go", 
    "price": "25.00", 
    "instructors": "Packt Publishing", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367934_cb8b_2.jpg", 
    "course_url": "https://www.udemy.com/building-your-first-application-with-go/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-11T09:33:59Z"
}