{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Many companies today are moving to an 'Agile' development and delivery process; having seen the benifits. One of the most common used is Scrum.<br></p><p>New adopters of Scrum create; or look to create new Scrum teams; but most have little starting knowledge on creating or running a team. This can be learnt over time by trial and error but this puts the team at a bad starting point.</p><p>This course has been created from the knowledge and experience I have gained from creating a number of new Scrum Teams in a number of companies. </p><p>In this course we go through points of learning; giving  you the information you need to know up front before starting your team. We discuss team structure; points for planning and working in Scrum and how to learn from each sprint and move forward.</p><p>By taking this course you will not gain time back instead of having months of trial and error. You will know what to expect from your team; you will have answers to the questions they have and you will be able to let them know the expectations. You will also be able to set them up on an expected learning and improvement plan.</p><p>The course includes all roles in the Scrum Team from the Product Owner to the Development Team.</p><p>So, take that first step. Don't spend months loosing time and money. Learn up front now and start your team the right way.</p>", 
    "end_date": null, 
    "title": "Build Your Scrum Team The Right Way", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/633984_42e6_3.jpg", 
    "course_url": "https://www.udemy.com/creating-a-new-agile-scrum-team/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-07T19:49:58Z"
}