{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tEver wonder how you can best analyze data in python? Wondering how you can advance your career beyond doing basic analysis in excel? Want to take the skills you already have from the R language and learn how to do the same thing in python and pandas?  </p>  <p>  \tTHEN THIS COURSE IS FOR YOU!  </p>  <p>  \t<strong style=\"\">By taking the course, you will master the fundamental data analysis methods in python and pandas!</strong>  </p>  <p>  \tYou’ll also get access to all the code for future reference, new updated videos, and future additions for FREE! You&#039;ll Learn the most popular Python Data Analysis Technologies!  </p>  <p>  \tBy the end of this course:  </p>  <p>  \t- Understand the data analysis ecosystem in Python.  </p>  <p>  \t- Learn how to use the pandas data analysis library to analyze data sets  </p>  <p>  \t- Create how to create basic plots of data using MatPlotLib  </p>  <p>  \t- Analyze real datasets to better understand techniques for data analysis  </p>  <p>  \tAt the end of this course you will have learned a lot of the tips and tricks that cut down my learning curve as a business analyst and as a Master’s Student at UC Berkeley doing data analysis. I designed this course for those that have an intermediate programming ability and are ready to take their data analysis skills to the next level.  </p>  <p>  \tYou’ll understand cutting edge techniques used by data analysts, data scientists, and other data researches in Silicon Valley.  </p>  <p>  \tComplete with working files and code samples, over 5 hours with 40+ lectures you’ll learn all that you need to know to turn around and apply data analysis strategies to the data that you work with. You’ll be able to work along side the instructor as we work through different data sets and data analysis approaches using cutting edge data science tools!  </p>", 
    "end_date": null, 
    "title": "Data Analysis in Python with Pandas", 
    "price": "25.00", 
    "instructors": "Bill Chambers", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/403908_a865_5.jpg", 
    "course_url": "https://www.udemy.com/data-analysis-in-python-with-pandas/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-25T23:59:04Z"
}