{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Prolog:</p>\n\n<p><em>Ich hatte mich verirrt. Ich hatte studiert und mich danach hochmotiviert auf den Weg gemacht, um ein wirklich guter Softwareentwickler zu werden, verschlang Fachbücher (einige gute, viele schlechte), las Fachzeitschriften, besuchte UserGroups und lernte alles, was im Trend lag. Trotzdem wurde das Entwickeln im Alltag immer wieder zur Qual. Für jede erdenkliche Situation suchte ich mir das passende Framework und lernte es. Ich verstrickte mich in Abhängigkeiten und verzettelte mich in Sonderfällen. Das frustrierte und war bei weitem nicht das, was ich mir unter guter und leichter Softwareentwicklung vorstellte. Irgendwann dämmerte es mir. Ich fing an zu begreifen, was mir intuitiv schon länger klar war: man muss nicht immer mehr lernen um Profi zu werden – man muss das Richtige lernen und vor allen Dingen das Mindset eines Profis entwickeln. </em></p>\n\n<p><strong><em>Der Weg zum professionellen Softwareentwickler</em> ist ein Reiseführer durch das aufregende Gebiet der modernen, agilen und pragmatischen Softwareentwicklung</strong>, und zugleich die Quintessenz dessen, was ich auf meinem Weg und den Irrwegen gelernt habe. Gemeinsam werden wir uns die Gebiete der Softwareentwicklung anschauen, die wirklich sehenswert sind. Wir lernen Techniken kennen, die es wert sind gelernt zu werden. Wir passieren Sümpfe und dorniges Unterholz, die wir – nach einer kleinen Warnung – jeweils links liegen lassen. </p>\n\n\n\n\n\n<p>Es werden in diesem Kurs nicht nur kleine Einblicke in verschiedensten Techniken gegeben, sondern eine <strong>Haltung </strong>vermittelt, die einen professionellen Entwickler ausmachen.</p>\n\n\n\n\n\n<p>Meine Motivation ist es dir diese Irrwege zu ersparen. Ich möchte dir einen Weg aufzeigen, wie du als Softwareentwickler erfolgreich sein und gleichzeitig Spaß und Leichtigkeit haben kannst. Dies wünsche ich Dir von Herzen.</p>\n\n\n\n\n\n<p><em>Thorsten Diekhof</em></p>\n\n<p><strong class=\"redactor-inline-converted\">Themen die behandelt werden:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Dreyfus-Modell</li><li>Architekturdokumentation</li><li>Clean Code</li><li>Softwarecraftsmanship</li><li>Refactoring</li><li>Prinzipien und Praktiken der objektorientierten Softwareentwicklung</li><li>Entwurfsmuster / Designpattern</li><li>Testgetriebene Entwicklung / TDD</li><li>Softwaredesign</li><li>Agile Softwareentwicklung / SCRUM</li><li>Persönlichkeit eines Profis</li><li>Intuition als Werkzeug</li><li>Bewusstes Lernen</li><li>SMART Methode</li></ul>", 
    "end_date": null, 
    "title": "Der Weg zum professionellen Softwareentwickler", 
    "price": "45.00", 
    "instructors": "Thorsten Diekhof", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718206_1977.jpg", 
    "course_url": "https://www.udemy.com/der-weg-zum-professionellen-softwareentwickler/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T11:34:40Z"
}