{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong style=\"\">SCRUM </strong>es una de las metodologías ágiles más conocidas para la gestión de  proyectos. Las metodologías ágiles se centran es aspectos como la  flexibilidad en la introducción de cambios y nuevos requisitos durante  el proyecto, el factor humano, el producto final, la colaboración con el  cliente y el desarrollo incremental como formas de asegurar los buenos  resultados en proyectos con requisitos muy cambiantes o cuando se exige,  como es habitual, reducir los tiempos de desarrollo manteniendo una  alta calidad.  </p>  <p>  \t<strong style=\"\"><span style=\" color:inherit;\">¿A quién va dirigido?</span></strong>  </p>  <p>  \t  Este curso va dirigido a emprendedores, empresarios y a lideres  de equipo que deseen agilizar sus desarrollos y procesos usando el  framework SCRUM, sin embargo esta no es una limitante pues, puede ser  aplicado en proyectos personales e individuales.  </p>  <p>  \t<span>Obtendrá el conocimiento combinado de metodologías ágiles y prácticas de scrum. Metodologías ágiles son los enfoques más populares en el desarrollo de software, mientras que las prácticas de scrum incluyen desarrollo de software por equipos multi-funcionales y de autogestión, la producción de código de trabajo al final de cada iteración o Sprint. Agile Scrum demuestra la capacidad de un profesional para implementar herramientas de scrum a los empleadores globales.</span>  </p>", 
    "end_date": null, 
    "title": "Fundamentos de SCRUM, metodología ágil gestión de proyectos", 
    "price": "20.00", 
    "instructors": "Pixel Web Pro", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/300660_3720_2.jpg", 
    "course_url": "https://www.udemy.com/fundamentos-de-scrum-metodologia-agil-gestion-de-proyectos/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-15T15:01:02Z"
}