{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course will comprehensively cover the GitHub hosting service as a companion to the Git source control tool, which means no prior knowledge or experience is required. Students will emerge at the end with a very solid understanding and hands-on experience with Git <em>and</em> GitHub.<br></p>\n\n<h4><strong class=\"redactor-inline-converted\">Course Organization</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>The course is divided into four major components:</p>\n\n\n\n\n\n\n\n\n\n<ul><li>Introduction and Setup</li><li>Learning Git Source Control</li><li>All About GitHub</li><li>Bonuses</li></ul>\n\n\n\n\n\n\n\n\n\n<p>Each one of the above components spans multiple sections in this course.</p><p><strong>New!</strong> Closed captions throughout the course!</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Introduction</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>The <strong class=\"redactor-inline-converted\">Introduction</strong> provides a welcome to the course including some useful tips for getting the most out of taking the course and how the course is designed. That is followed by the <strong class=\"redactor-inline-converted\">Core Concepts</strong> which go over some critical theory before diving straight into Git.</p>\n\n\n\n\n\n\n\n<p>After the introduction and core concepts, the first thing we do is a <strong class=\"redactor-inline-converted\">Quick Installation</strong> for both Windows and Mac. The Bonus section has a more comprehensive, step-by-step process for those that prefer it.</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Learning Git Source Control</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>In <strong class=\"redactor-inline-converted\">The Basics</strong>, we walk through all the foundational commands needed to start a new project managed by Git (or enable Git for an existing project) all the way through making commits, including common file operations like moving and deleting files. We also cover how to exclude the wrong files from accidentally being committed and how to review your repository's history.</p>\n\n\n\n\n\n\n\n<p>With a strong foundation in place, we explore some more <strong class=\"redactor-inline-converted\">Advanced</strong> Git topics like comparing differences, branching and merge resolution, tagging special events, saving work in progress, and even a bit of time travel.</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">All About GitHub</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>The main part of this course is all about GitHub. We will explore GitHub indepth from a source control hosting repository perspective.</p>\n\n\n\n\n\n\n\n<p>In <strong class=\"redactor-inline-converted\">Welcome to GitHub</strong> we start off exploring some of the basic features of GitHub by creating a fresh repository and associate our local repository with it. Then, we prepare for the remainder of the course by setting up <strong class=\"redactor-inline-converted\">SSH Authentication</strong>, which we will use from this point forward. After that, we continue looking at the <strong class=\"redactor-inline-converted\">GitHub Repository</strong>, including many of the same operations we performed locally, but done directly within GitHub. Then in <strong class=\"redactor-inline-converted\">GitHub Repository Branches</strong> we dive into how Branches on GitHub and our local system work with each other.</p>\n\n\n\n\n\n\n\n<p>After we have comprehensively covered how GitHub repositories work, we focus on how <strong class=\"redactor-inline-converted\">GitHub Tags and Releases</strong> work and their relationship with local tags in Git. We can then use tags/releases while <strong class=\"redactor-inline-converted\">Comparing Differences</strong> on GitHub.</p>\n\n\n\n\n\n\n\n<p>We start tying things together in <strong class=\"redactor-inline-converted\">Social Coding</strong> where we join other projects on GitHub by <em>forking</em> and then submitting our contributions back using <em>pull requests</em>.</p>\n\n\n\n\n\n\n\n<p>Once part of a team, you might use <strong class=\"redactor-inline-converted\">GitHub Issues</strong> to track defects or enhancement requests.</p>\n\n\n\n\n\n\n\n<p>Sometimes you just need to share small parts of a file or a set of files, but don't want to bother with a full Git repository. That where <strong class=\"redactor-inline-converted\">GitHub Gists</strong> help out -- share just a snip of code or entire files.</p>\n\n\n\n\n\n\n\n<p>Finally, group related GitHub repositories with <strong class=\"redactor-inline-converted\">GitHub Organizations</strong> and manage permissions and access using teams.</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Bonuses</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>The bonuses sections and lectures provide additional information, more comprehensive instructions, or non-critical lectures.</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Course Features</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>All tools have installation and configuration sections to ensure no one is left behind.<br>Presentations provide audio/video training of conceptual ideas. Since few like slide-ware presentations, slide-presentations are kept to a minimum.</p>\n\n\n\n\n\n\n\n<p>Screencasts provide a video of the instructor's computer system with any actions, commands, or screens displayed and narrated. There is nearly 5 hours of screencast based video training in order to step through each command or action in sufficient detail.</p>\n\n<p>All videos are available in high quality 1080p / Full HD resolution for sharp and clear viewing on modern desktops and tablets. </p>\n\n\n\n\n\n\n\n<p>Several attachments and document lectures throughout the course provide supplemental information, illustrations, or other reference material.</p>\n\n\n\n\n\n\n\n\n\n<h4><strong class=\"redactor-inline-converted\">Moving Forward</strong></h4>\n\n\n\n\n\n\n\n\n\n<p>This course will expand periodically to include more topics, supporting materials and bonus content! Some content may be in direct response to student feedback or discussions -- so get engaged with the course discussions feature!<br></p>", 
    "end_date": null, 
    "title": "GitHub Ultimate: Master Git and GitHub - Beginner to Expert", 
    "price": "30.00", 
    "instructors": "Jason Taylor", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/752950_b773.jpg", 
    "course_url": "https://www.udemy.com/github-ultimate/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T00:13:26Z"
}