{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong></strong></p><p><strong></strong><strong></strong><strong></strong></p><p><em></em><strong></strong><strong></strong><strong></strong></p><p><em><strong>Run awesome meetings that boost team performance and turn yourself into confident facilitator along the way!</strong><br></em></p><p><em>## Now more than 1200 happy students! 4.9 average review rating!</em></p><p><strong>Turn Your Meetings Into Valuable Time Savers</strong><br></p><p><strong></strong></p><ul><li>Run appreciated meetings that give results without wasting people's time and energy</li><li>Fix your team: run retrospective meetings the way they were meant</li><li>Learn practical skills and tools to manage your group</li><li>Turn team problems into valuable improvements</li>\n<li>Learn a 5-step method to create super effective retrospective meetings</li><li>Add facilitation skills to your CV</li>\n<li>Deal with problematic people and handle yourself when things heat up</li>\n</ul><p><strong> </strong></p><p><strong>Help Your Team Become More Productive And Engaged With Collaborative Meetings</strong></p><p>Running effective meetings is a crucial skill in any workplace today. It saves time, gives immediate results and is highly appreciated: People know you will make their time well spent. So this is something you need to know. This course shows you how.</p><p>Being able to transform your group into a highly productive team is a dream come true for any organisation and makes your work more fun and rewarding. It also gives you the upper hand in any meeting or when dealing with other people. <br></p><p><strong>Bonus: <em>Exclusive</em> <em>e-book</em> available only for students!</strong> </p><p>Handpicked meeting activities with detailed instructions you can choose from based on what you want to achieve.<br></p><p><strong>## Course Overview ##</strong><br></p><p><strong>Design:</strong> First, you'll learn how to design your meetings with ease using a powerful, <em>proven five-step method</em>. This method guides you, step by step with detailed instructions how to kick off the retrospective meeting all the way to wrapping it up.</p><p><strong>Create:</strong> Next, you’ll focus on how to create<strong> </strong>your meetings and how you can create <em>effective agendas</em> with a clear purpose and goal.</p><p><strong>Run:</strong> Finally, how to run your meetings without wasting people's time and energy. Learn practical tips to manage the group, make team decisions and use professional facilitation tools. Deal with people who dominate and how to get others to speak up. And, of course, how to keep yourself calm and focused during the meeting.</p><p><em>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++</em></p><p><em>\"<strong>Excellent! <strong></strong></strong>This course gives deep insight into how an effective culture can be created and processed. Thumbs up for all practical tips, they will become very useful in my future projects.</em><em>\" </em><br></p><p><em>\"<strong>A Collaboration Kickstarter!</strong> </em><em>Martin is delivering a nice set of tools for anyone in need of collaboration improvements. The videos keep a high quality and they were easy to follow. The attached document is also a nice summarization. This will definitely boost my upcoming meetings!\"</em></p><p><em>\"<strong>Great about fixing teams!</strong> I'm imp</em><em>ressed with all the details about running meetings. I also liked the step by step section where the instructor talks about how to create the meetings, it's clear he knows his stuff. I'm a Scrum master and yes this is really useful. Highly recommended!\"</em></p><p><strong></strong></p><p><em><em>+++++++++++++++++++++++++++++++++++++++++++++++++++++++++</em></em></p><p><strong>Bonus:</strong> Cheat sheet for each section! A nice and compact summary with all important points from the course -- useful when preparing and running your meetings!</p><p>Everything in here is tried and tested, proven by professional facilitators throughout the world. Not many people know about these things, so this is a chance to learn what most people don’t have a clue about! I have yet to meet a team leader, project manager or Scrummaster who uses anything you're about to learn here.<br></p><ul><li><strong>Risk-free: Unconditional 30 days money back guarantee! </strong></li><li>Unlimited lifetime access</li><li>Certificate of Completion</li></ul><p><em><em><br></em></em></p><p><em><em>At the end of this course, you’ll have the skills to create your own awesome meetings that will help you and your team to more productivity and get you started on your journey to becoming an even better meeting facilitator!</em></em><br></p><p><strong>So JOIN NOW and Start Fixing Your Meetings Tomorrow!</strong><strong></strong><br></p>", 
    "end_date": null, 
    "title": "How To Run Effective Agile Scrum Meetings in 5 Easy Steps", 
    "price": "25.00", 
    "instructors": "Martin Wickman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606736_cdaa_3.jpg", 
    "course_url": "https://www.udemy.com/effective-agile-meetings/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-09T06:54:18Z"
}