{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \tI&rsquo;m Scott Dunn. I&rsquo;m a certified Scrum trainer and Agile coach. I do public training, such as the certified scrum master and the certified product owner class, as well as private trainings in companies across the nation.  </p>  <p>  \tIn this class, I will give you and your team enough information to baseline everyone, and let you get going with Scrum and Agile: what it means to be Agile, what Scrum is and how it is Agile, the roles and the meetings in Scrum, and the underpinnings and requirements of Scrum.  </p>  <p>  \tIn the class videos, I try to incorporate my usual engaging style with lots of examples and stories. We&rsquo;ve created an accompanying .pdf handout to give you some walk away notes and resources to dive in deeper on the points that interest you in particular. This video could be used with teams or management to help get everyone on the same page about what it means to be Agile and implement Scrum.  </p>  <p>  \tStudents will fill in blanks and diagrams on the handout as they follow along with the videos. Students will complete several application exercises throughout the course. The video run time is a little over an hour... about 70 minutes. If students do all the exercises, they should be able to finish in less than 2 hours.  </p>  <p>  \tWe&#039;re going to cover all this and more in a one hour baseline overview that I hope is something that gives you a good sense of what Agile is, what it means to be Agile, and how we do Scrum. This course is not just for individuals, but hopefully for teams as well, to iron out some of the problems that they might face going forward.  </p>  <p>  \tI will be circling back to the class discussion area around once a week to respond to discussions and provide additional input. If any student wants to get immediate contact with me, I am available via <strong style=\"\">Google + </strong><a href=\"https://plus.google.com/+Rocketninesolutions/videos\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">https://plus.google.com/+Rocketninesolutions/videos</a><strong style=\"\">,</strong> as well as, <strong style=\"\">email </strong><a href=\"javascript:void(0)\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">scott@RocketNineSolutions.com</a><strong style=\"\"> ,</strong><strong style=\"\"></strong><strong style=\"\">Blog </strong><a href=\"http://scottdunn.blogspot.com/\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">http://scottdunn.blogspot.com/</a> <strong style=\"\">, </strong>and <strong style=\"\">Twitter: </strong><a href=\"http://twitter.com/sdunnrocket9\" class=\"external-link\" target=\"_blank\" rel=\"nofollow noreferrer\" style=\"\">@sdunnrocket9</a><strong style=\"\"></strong>  </p>", 
    "end_date": null, 
    "title": "Introduction to Scrum and Agile", 
    "price": "50.00", 
    "instructors": "Scott Dunn, CST, PMP", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/134992_4b25_7.jpg", 
    "course_url": "https://www.udemy.com/scrum-baseline/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-17T23:22:26Z"
}