{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Recent </strong><strong>Updates</strong>: Resources file with course links. English closed captions added. Re-recorded lesson 3.</p>\n\n<p>Are you feeling <strong>stuck</strong> in your career as a developer, and wondering <strong>what's next</strong>? Are you finding <strong>your salary has reached its limit</strong> in the development field, and want to move up the value chain to earn more? Software architecture is one of the hottest fields in technology, and TOGAF is one of the hottest skills (according to a recent Foote Salary Survey).</p>\n\n\n\n<p>You might find it rewarding to learn software architecture. You still keep the ability to be involved in the technology at a deep level, and make important decisions that affect the future direction of the company, but avoid the problems of managing development teams and moving in a less technical direction.</p>\n\n\n\n<p>In this class, you will learn: </p>\n\n\n\n<ul><li>What is software architecture?</li><li>What is the difference between software design and software architecture?</li><li>What it takes to be a successful software architect?</li><li>The software architecture mindset, and how that differs from the developer mindset</li><li>The qualities of good software</li><li>And an introduction to architecture principles of TOGAF</li></ul>\n\n\n\n<p>So come on inside and learn about what software architecture has to offer. Scott Duffy is a commercial license holder in TOGAF, and licensed to teach these topics. TOGAF is a registered trademark in the United States and other countries.<br></p>\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>", 
    "end_date": null, 
    "title": "Introduction to Software Architecture", 
    "price": "20.00", 
    "instructors": "Scott Duffy, Software Architect", 
    "commitment": "44 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/531898_5502_3.jpg", 
    "course_url": "https://www.udemy.com/software-architecture/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-19T05:00:17Z"
}