{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Welcome to the iRise Beginner course!!</strong>  </p>  <p style=\"\">  \t              This course has over 30 lectures with more than 3 hours of video content providing all the basics of Studio usage to create amazing screen simulations.  </p>  <p style=\"\">  \t              You will learn how to use iRise Studio to elicit and validate requirements and design page layouts, flows, navigation, add logic for dynamic user interaction. You will also learn how to plan for content re-usability using styles, templates and masters and best practices for creating the simulations quickly and efficiently.  </p>  <p style=\"\">  \t              I will recommend to pause the videos and try the concept in your Studio as you progress through the course.  </p>  <p style=\"\">  \t              If you want to learn more advanced concepts of Studio for creating simulations with full data functionality , logic with multiple real world examples, you can checkout my other course: <strong style=\"\">iRise for Advanced Users</strong>(coming soon) which is targeted towards Intermediate and Advanced Users.  </p>  <p style=\"\">  \t<strong style=\"\">What is iRise Studio? </strong>  </p>  <p style=\"\">  \t              iRise Studio is part of a software suite available for windows and mac used to visualize requirements.  You do not have to write lines and lines of requirements any more. You can visualize your requirements into scenarios and simulations quickly and easily.  </p>  <p style=\"\">  \t               Everything in studio is a drag and drop concept. So it is very easy to use and you do not require any coding experience. Requirement Authors can now create better quality of requirements which stakeholders can visualize and interact even before a single line of code is written.  iRise Studio promotes a healthy collaboration with the stakeholders because they can now interact with the simulation and provide better feedback on the content.  </p>  <p style=\"\">  \t               Most of the other wire framing/visual tools do not have the screen interaction capability. But with iRise Studio, you can create screens which look and behave like a real production screen within minutes.  </p>  <p style=\"\">  \t               The content created in iRise can be published on Definition Center which is a repository for collaboration with other authors and reviewers. You can also export the content into interactive document format, word, xml,  to send to reviewers for feedback.  </p>", 
    "end_date": null, 
    "title": "iRise Studio for Beginners", 
    "price": "20.00", 
    "instructors": "Srinivas Yerram", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387734_8b35_2.jpg", 
    "course_url": "https://www.udemy.com/irise-studio-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T15:27:31Z"
}