{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Does the word \"algorithm\" intimidate you? Well, it shouldn't! Algorithms are incredibly powerful programming tools, and once you pick up the basics of sorting algorithms, you'll be on your way in no time.</p><p><strong>Begin Your Algorithm Journey With This Course Designed Specifically for Algorithm Newbies.</strong><br></p><ul><li>Learn the basic sorting algorithms first so you can eventually move on to more complicated algorithms</li><li>Implement the algorithms in Java code to see how they look in practice</li><li>Distinguish between the various features of basic sorting algorithms</li></ul><p><br></p><p><strong>Sorting Algorithms are Your Friends.</strong></p><p>Sorting algorithms are not scary beasts; they are very practical programming tools. They can sort many different data sets: a basic integer array, a database of names, or a deck of cards. Nearly any large program could, and should, implement sorting algorithms.</p><p>That being said, algorithms are very important to software engineers. Let's say you're a video game programmer. You're going to need to be able to sort your hero's inventory or bank. Or, let's say you're a web developer. You're going to want to sort your content in a specific order.</p><p><strong>Content and Overview</strong><br></p><p>This course is designed for the average programmer who has absolutely no experience with algorithms. Although I recommend that you have some programming experience, particularly in Java, I assume no prior knowledge of algorithms.</p><p>You'll go through 8 lectures and 1 hour of content to get your feet wet in these sorting algorithms. Throughout the duration of the course, I'll focus on bubble sort, insertion sort, and merge sort - 3 beginner friendly sorting algorithms.</p><p>I take a two-pronged teaching approach. First, you'll see a definition and visual demonstration of each algorithm. This facilitates the second prong: the code. I'll take you step-by-step through the code implementation, explaining every line I type.</p><p>If you're looking to deepen your programming experience, and you're willing to learn, I recommend this course!</p>", 
    "end_date": null, 
    "title": "Java Sorting Algorithms for Newbs", 
    "price": "20.00", 
    "instructors": "Brendan Campbell", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/709304_fc6f_2.jpg", 
    "course_url": "https://www.udemy.com/java-sorting-algorithms-for-newbs/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-29T04:59:10Z"
}