{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t<strong>                                  You are taking:  </strong>  </p>  <p>  \t<em> Journey of Your Life: Becoming a Successful Product Development Craftsman</em></p><p><em></em><strong>Job-Ready Prototyping The App &amp; System</strong></p>  <p>  \t<em>    My aim as your instructor in this course and all of my related and technical courses, is to teach you to become a practicing and successful Product Development Craftsman or PDC. </em>  </p>  <p>  \t<em>We'll do this in a no-nonsense, practical hands-on way in the shortest time possible. </em>  </p>  <p>  \t<em>All of my courses are fully \"self-contained learning modules.\"</em>  </p>  <p>  \t<em>Train for your destiny. Make a ding in the universe!</em>  </p>  <p>  \t<em>  No prior experience necessary! If you're a pro already, there's things to learn too!  </em>  </p>  <ul>  \t<li>We'll concentrate on creating and refining first and foremost, an advanced PDC mindset and then detailed hands-on 100% prototyping of the app &amp; system. </li><li>Then, we're going to publish from within the design toolset directly and install and run fully as a 100% native iPhone 6 app! WoW!</li>  </ul>  <p>  \t<em>      I use the best practices and lessons-learned over 20+ years of solid industrial-grade development work to make sure you understand and implement what works and what doesn't. </em>  </p>  <p>  \t<em> deliver a very practical and deeply hands-on workshop format that you'll benefit and learn from and love. I promise you!  </em>  </p>  <p>  \t<em>Introductory Pricing! Take Advantage Now. It May Increase Later!</em>  </p>  <p>  \t<em>\"Stay Hungry. Stay Foolish\" </em><em>Steve Jobs</em>  </p>  <p>  \t<em>Ciao!</em>  </p>  <p>  \t<em>Lisa Kristinardottir</em>  </p><p><strong>PLEASE NOTE:</strong> I'll NOT be publishing the rest four (4) courses in this series due to some serious cancer-related issues in my life. I may resume but at this point in my life, it's unlikely. </p><p>Now, I have dedicated my life to working in healthcare and fighting cancer in all its forms as a computational-genomics (CRISPR) specialist and fight the good fight for cancer eradication. My deepest apologies to everyone if this has caused any confusion or inconveniences. </p><p>Because of this reason, I have reduced the price to ONLY $5 forever and there may be more discounts to you from Udemy! Please do take advantage of this as soon as you cna and benefit from this course and resources I have created for you!</p><p>Bless you angels! Lots of love, hugs and kisses! Lis</p>", 
    "end_date": null, 
    "title": "Journey of Your Life (Job Ready - Prototyping)", 
    "price": "20.00", 
    "instructors": "Lisa Kristinardottir", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393522_965c_21.jpg", 
    "course_url": "https://www.udemy.com/journey-of-your-life-volume-1-of-5/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T00:37:54Z"
}