{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "This is a great place to start your programming career or  hobby. This course is best for you:<br style=\"\">........If you have  never programmed before, or    <p style=\"\">........If you are  fairly new to programming, or</p>........If you can  program, but are not familiar with flowcharting and pseudocode techniques.    <p style=\"\"><br style=\"\"></p><p style=\"\">This is a generic course, meaning you will not write source  code in any specific programming language. You will learn to use pseudocode and  flow charts, two major tools that all programmers can use in any programming  language. Pseudocode is simple. You just write out the steps to be taken to  perform any task, no matter how big or small. Flow charts do essentially the  same thing using software that creates a visual chart showing accurately the  flow of the process and the specific steps needed to accomplish your goal.  Specific shapes are used to represent the type of action to be taken. It won’t  be long before you become proficient at using both of these great programmer’s  tools. (Flowcharting software is NOT required for this class. If you have   <a href=\"#\" id=\"_GPLITA_0\" title=\"Click to Continue &gt; by Browse to Save\" style=\"\">Microsoft PowerPoint</a> or Visio, you can use either of those. If not, your   instructor will recommend a number of FREE and affordable software   applications.) <br style=\"\"></p><p style=\"\">Teaching methods: Expect to see mostly 10 to 20 minute video sessions where the instructor presents the topic in a slide show format. Later in the course, there will be Exercises for you to do, with answers supplied. Several handouts will be provided to supplement the lectures. The instructor will answer all of your questions promptly (usually within 24 hours.)<br style=\"\"></p>    <p style=\"\">This course requires no prerequisite knowledge. Everything  is explained in simple, easy to follow steps. In a very short time, you will be  able to take a programming situation and reduce it to a series of steps that  can be transferred to any programming language. Whether you are learning one of  the top 10 languages, like <a href=\"#\" id=\"_GPLITA_1\" title=\"Click to Continue &gt; by Browse to Save\" style=\"\">Java</a>, PHP, Python, JavaScript, C, C++, C# Visual  Basic, Perl, or Lua, or one of the obscure entries on the more than 650  languages listed in Wikipedia&#039;s &quot;List of Programming Languages&quot;, the  skills you learn here will be valuable to you. </p>    <p style=\"\">This course is taught by <strong style=\"\">Richard Vannoy</strong>, a professional programmer and college programming  instructor for over 25 years. </p>  ", 
    "end_date": null, 
    "title": "Learn Flowcharting and Pseudocode. Be a better programmer!", 
    "price": "25.00", 
    "instructors": "Richard Vannoy", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30204_78ec_9.jpg", 
    "course_url": "https://www.udemy.com/flowchartingcourse/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-21T00:51:24Z"
}