{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>Come join us as we explore the world of use cases and use case modeling.  We'll take a deep dive into this part of the UML, looking at actors, use cases, use case diagrams, flows of events, and activity diagrams.  With these powerful tools at your disposal, you'll be able to create requirements artifacts that are invaluable to your team.</p><p>In this course, you’ll learn:</p><ul><li>What a use case is, and how to effectively use them in a project</li><li>What an actor is, and how they can help us understand our users' perspectives</li><li>How to find use cases and actors in your project</li><li>How to build an effective use case diagram</li><li>How to model reusable logic with Includes and Extends relationships</li><li>How to model actor inheritance using Generalization relationships</li><li>What <em>not </em>to do when defining or modeling use cases and actors</li><li>How to write a use case specification, with a description, preconditions, basic and alternate flows of events, and post-conditions</li><li>How to build an activity diagram to give you a picture of the flow</li><li>How use cases fit into the SDLC</li><li>What to do with non-functional requirements</li></ul><p><br></p><p>And through the whole class, we’ll use real world examples and exercises to help reinforce the ideas and give you the chance to practice.  In this short course, you’ll get the skills you need to start applying use cases to your projects right away.</p>", 
    "end_date": null, 
    "title": "Making Sense of Use Cases", 
    "price": "20.00", 
    "instructors": "Luminescence Training", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/763990_4eda_4.jpg", 
    "course_url": "https://www.udemy.com/making-sense-of-use-cases/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-16T04:33:29Z"
}