{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                                                                     Interested in Node.js, but <strong>don't know where to start</strong> and how to find time to learn it properly? Would you prefer to learn in a way that is more interesting than reading books or watching boring screencast videos? <strong>Confused</strong> about how the MEAN stack pieces of MongoDB, Expressjs, Angularjs and Nodejs fit together? How it's even possible to run JavaScript outside of the browser?  </p>  <p>  \t                                                                    Years ago, we were in the same boat, but <strong>we took the long route</strong> of learning from source code, books, blogs and free online documentation. We have put together the best information in the simplest way to help you learn about these systems. Basically, we are helping you to <strong>take a shortcut and save time, frustration and avoid costly mistakes</strong> by using the best practices available.</p>  <p>  \t              This is an online version of our two-day Node Program (nodeprogram dot com). The online course has recorded lectures, lively student discussions, quizzes, exercises, workshops, tutorials in the manual and lots and lots of code examples!  </p>    <p><strong>BONUS: You'll get NodeProgram live recording and Advanced Node live recording!</strong><br></p>  <p><br></p>", 
    "end_date": null, 
    "title": "Node Program: From 0 to Hero with Nodejs and MongoDB", 
    "price": "30.00", 
    "instructors": "Azat Mardan", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/320358_e38b_8.jpg", 
    "course_url": "https://www.udemy.com/nodeprogram/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-15T18:16:44Z"
}