{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "Has notado que hay desarrolladores de Software que trabajan 10 veces más rápido que el promedio?  Lo que le lleva a un desarrollador promedio un día completo de trabajo a ellos les puede llevar menos de una hora terminarlo. No importa si tienen que  Crear Programas, hacer paginas, hacer Diseño Web. Tampoco importa que lenguaje de Computacion usen; puede ser Java, C#, Visual Studio, Angular, Python, java script o incluso C.  La mayoría de esa velocidad en el desarrollo de software se puede atribuir a la técnica. Al igual que un jugador de baloncesto puede ser un mejor tirador por el aprendizaje de las técnicas adecuadas, un desarrollador puede convertirse en un mejor codificador y ofrecer mayor valor al aprender mejores técnicas. Hoy en día de forma más fácil y rápida debido a Internet, los Cursos Online, Google y la cantidad de ejemplos dando vuelta. Incluso estudiar a distancia carreras como ingenieria de sistemas, analista de sistemas, computación, etc.  Hemos estado tomando lo que figura en este libro para las personas que se suman a mi equipo y les enseñamos las técnicas que los hacen rápidos. Después de aprender y trabajar en este marco, la mayoría de mis programadores nuevos son capaces de duplicar su productividad en el primer mes. Muchos triplicar o cuadruplicar su productividad.  Ve a decirle a tu jefe que puede ofrecer el doble de puntos funcionales que lo que haces hoy. Dile a tu jefe que en vez de tener que contratar a ese otro programador, tú puedes lograr que se haga. Tu jefe te amará, y la entrega de ese tipo de valor es que te mantendrá con trabajo e incrementara varias en varias veces lo que ganas! Esa es mi promesa al término de este libro.  Me decidí a armar un libro de todo esto por un par de razones.  •\tEn primer lugar, estoy cansado de heredar proyectos que parecen un choque de trenes cuyo código base es una maraña de cosas y no hay manera de rescatar algo. Hay muchos más proyectos en el mundo que lo que mi equipo puede asumir así que espero que este sencillo enfoque sea una alternativa atractiva a lo que estas acostumbrado a leer.  •\tEn segundo lugar, esperamos que podamos aprender de ti. Los miembros de mi equipo aprenden todos los días el uno del otro. Con su ayuda, podemos aprender más, ser aún mejores desarrolladores y ofrecer más valor a nuestros clientes.  Code Simple!  Nicolas Rossello  ", 
    "end_date": null, 
    "title": "Pareto para Programadores-El eslabon Perdido del seniority 2", 
    "price": 0, 
    "instructors": "Nicolas Rossello", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160046_021a_9.jpg", 
    "course_url": "https://www.udemy.com/pareto-para-programadores-el-eslabon-perdido-del-seniority-mini/", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-08T01:11:04Z"
}