{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \t     Con &quot;Programación Panel View Plus desde Cero&quot; aprenderas  todo acerca de la programación de pantallas de operador de la marca Allen  Bradley, para las plataforma Plus que son propias del software FactoryTalk View en su seria Machine Edition, incluso sin nunca has  programado una pantalla con anterioridad.  </p>  <p style=\"\">  \t     Este curso esta diseñado para que particulares, estudiantes,  profesionistas que con algo o nada de conocimientos ni experiencia en  programación de PLC&#039;s y Pantallas Panel View pueda programar desde cero botones, pantallas de control de procesos, ingresos de datos hacia un PLC, controlar válvulas, motores, arrancar y para procesos, desplegar alarmas visuales al operador, mensajes de alerta, etc.  </p>  <p style=\"\">  \t     Alguna vez te has preguntado como el operador interactua con el controlador PLC en las líneas de  producción de una fabrica, como es posibles crear productos en masa,  miles de productos, llevar un control del mismo ?  </p>  <p style=\"\">  \t     Los ojos del operador en cualquier línea de producción de una fábrica es  una Pantalla Panel View, un  elemento indispensable para llevar a cabo cientos de tareas a la vez y  de manera automática para controlar procesos a nivel industrial.  </p>  <p style=\"\">  \t     Cada sección te lleva a un nuevo nivel de conocimientos.  Comenzamos desde lo más básico que es la instalación del software y  herramientas.  </p>  <p style=\"\">  \t     Hasta cubrir de una manera práctica los comandos más  utilizados y necesarios para realizar la visualización prácticamente de cualquier proceso de una manera amigable y profesional.  </p>  <p style=\"\">  \t     Cada sección cuenta con preguntas que te ayudarán a reforzar los conocimientos adquiridos en cada tema.  </p>  <p style=\"\">  \tAllena Bradley es por hoy una de las marcas más fáciles, rápidas de programar en todos sus equipos, en cuestion de días podras realizar ya programación de Panel View Plus a un nivel profesional, que te ayudarán a brindar los servicios adecuados a tus clientes y que tus proyectos de automatización tengan una calidad inmejorable.  </p>", 
    "end_date": null, 
    "title": "Programación Panel View Plus desde cero", 
    "price": "40.00", 
    "instructors": "Luis Cruz", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/260352_9a0c_8.jpg", 
    "course_url": "https://www.udemy.com/programacion-panel-view-plus-desde-cero/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-13T01:37:43Z"
}