{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t  Curso de <strong style=\"\">refactorización en Java</strong>. </p><p>Utilizando el IDE de Eclipse y múltiples <em style=\"\">plugins</em> aprenderemos a incorporar las actividades de <em style=\"\">refactoring</em> en el proceso de desarrollo del software diario.  Relacionaremos la refactorización  con las actividades del proceso de desarrollo:</p><ul style=\"\"><li style=\"\">pruebas y calidad de las pruebas mediante su cobertura <em style=\"\">(plugin JUnit y Eclemma)</em></li><li style=\"\">control de versiones <em style=\"\">(plugin Git)</em></li><li style=\"\">comprensión de código mediante diagramas UML <em style=\"\">(plugin </em><em style=\"\">ObjectAid)</em></li><li style=\"\">revisión de la calidad del código basada en defectos de código (<em style=\"\">plugin InCode y PMD</em>)</li></ul><p>El aprendizaje se hará de manera progresiva, primero conociendo y aplicando  refactorizaciones aisladas del catálogo de Eclipse mediante pequeños ejemplos de código. Después se presentarán un caso de estudio más avanzado donde se aplicará una secuencia de refactorizaciones con el objetivo de adaptar un código existente con una nueva funcionalidad. En la última sección del curso se presentarán herramientas de detección de <em style=\"\">code smells</em>  que ayuden a incorporar las actividades de refactorización  en proyectos reales de desarrollo software.<br style=\"\"></p><p>La planificación recomendada por el profesor es dedicar cuatro semanas de 6-8 horas de trabajo cada semana.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Refactorizar para mejorar la calidad del código Java ", 
    "price": "20.00", 
    "instructors": "Curso Especialista Universitario Desarrollo avanzado de aplicaciones Java", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/429844_b525_2.jpg", 
    "course_url": "https://www.udemy.com/refactoriza-para-mejorar-la-calidad-del-codigo-java/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T11:47:29Z"
}