{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>Resumo:</strong> este é um curso gratuito preparatório para a certificação <strong>SFC®</strong> da <strong>ScrumStudy</strong>, maior certificadora global em <strong>Scrum</strong>. O curso foi criado pelo professor Frederico Aranha em parceria com a <strong>Site Campus</strong>, sua escola de gestão na internet. Você pode fazer este curso pela plataforma <strong>Site Campus</strong>, também.</p><p>O framework <strong>Scrum</strong>, conforme definido no <strong>Guia SBOK™</strong>, é estruturado de tal forma que apoia o desenvolvimento de produtos e serviços em todos os tipos de indústrias e em qualquer tipo de <strong>projeto</strong>, independentemente de sua complexidade. A partir deste curso gratuito, você entenderá melhor o que é o <strong>Scrum </strong>e conhecerá o <strong>SBOK®</strong> - o guia que irá te ajudar a por o <strong>Scrum </strong>na prática.</p><p>Construímos este curso para te ajudar a ingressar no mundo do gerenciamento ágil de <strong>projetos</strong>. O curso é rápido, mas vai te preparar para a certificação <strong>Scrum Fundamentals Certified - SFC - da ScrumStudy</strong>. Você vai estudar e já pode fazer a prova. O curso conta com um simulado super bem feito para te deixar pronto, assim vai terminar o curso e poderá ir em busca de sua carreira em gerenciamento de <strong>projetos</strong>!</p><p>Seja como desenvolvedor, analista de marketing, dono do produto ou empresário, <strong>Scrum </strong>vai te ajudar a trabalhar em ambientes complexos e a construir equipes altamente eficazes. Formas tradicionais de gerenciamento de <strong>projetos </strong>não atendem demandas atuais de profissionais e organizações, que buscam resultados mais rápidos e, ao mesmo tempo, maior satisfação pessoal.</p><p><strong>E não se esqueça:</strong> <em>você pode fazer este curso por meio da plataforma do <strong>Site Campus</strong>, distribuidora oficial dos cursos do professor Frederico Aranha. <strong>Site Campus</strong> - a sua escola de gestão na internet.</em></p>", 
    "end_date": null, 
    "title": "Scrum Fundamentals Certified: Preparatório Gratuito", 
    "price": 0, 
    "instructors": "Guilherme Calabria Etcheverry, Site Campus, Frederico de Azevedo Aranha", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/481036_7dce_5.jpg", 
    "course_url": "https://www.udemy.com/scrum-fundamentals-certified-preparatorio-gratuito/", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-20T10:02:02Z"
}