{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><p style=\"\">The  business world and the IT world are both faced with changes on a large scale.  Companies try to respond by cutting costs and hunkering down, but that just  risks letting the world pass them by. At the same time, the IT world is trying  to figure out how to cope with a torrent of change caused by cloud computing, SaaS,  social media and consumer IT devices like iPhone, Android, IPad</p>    <p style=\"\"><em style=\"\">Looks like  it’s time&nbsp;to get agile and reinvent ourselves!</em></p>    <p style=\"\">Scrum, the most popular of the Agile methods, is a management framework  within which complex products can be developed. Scrum is derived from work in  knowledge management, complex adaptive systems and empirical process control  theory. It contains influences from observed software development patterns and  the Theory of Constraints.</p>    <p style=\"\">Scrum  provides a platform for people to work together effectively and to make visible  every problem that gets in their way.</p>    <p style=\"\">Many  people say that they find it hard to know how to get started with Scrum. Others  have teams that are following some Agile practices, yet are far from becoming <em style=\"\">hyper-productive</em>.</p>    <p style=\"\">This  course intend to reveal, beside basic methodology foundations and principles, a  way to do better Scrum.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Scrum - An Introductory Course To Agile", 
    "price": "20.00", 
    "instructors": "Brain Concert, RO28876915, J40/8673/2011, Bucuresti, Romania", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/43842_4eee_3.jpg", 
    "course_url": "https://www.udemy.com/scrum-an-introductory-course-to-agile/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-27T12:40:07Z"
}