{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\">  \tThe goal of this course is to provide a refreshing, and yet easily graspable and insightful introduction to Scrum. The course is delivered and structured in a manner that would ensure that you can quickly absorb the information presented here. The structure, and progression of the course material is designed to enable better retention and recall and hence the application of the knowledge and insights in your everyday practice of Scrum.  </p>  <p style=\"\">  \tThe course has seven sections listed below:  </p>  <ul style=\"\">  \t<p style=\"\">  \t\t1.Introduction  \t</p>  \t<p style=\"\">  \t\t2.Core Values  \t</p>  \t<p style=\"\">  \t\t3.Principles  \t</p>  \t<p style=\"\">  \t\t4.Concepts  \t</p>  \t<p style=\"\">  \t\t5.Roles and Artefacts  \t</p>  \t<p style=\"\">  \t\t6.Process  \t</p>  \t<p style=\"\">  \t\t7.Best Practices  \t</p>  </ul>  <p style=\"\">  \tThe course is almost entirely composed of Video lessons interlaced with some exercises designed to encourage some independent enquiry as well as some quizzes as a revision of the key points covered or as a means for informing you of some trivia.  </p>  <p style=\"\">  \tEach section in the course is self-contained, however that said, it does progressively build upon the knowledge areas covered in previous modules. In other words the course is structured and designed in a manner to take the audience from a novice level to a Scrum Practitioner level of proficiency.  </p>  <p style=\"\">  \tTherefore if you are a beginner or are new to Scrum, I would recommend going through the course in sequence, however if you are already experienced in Scrum, you may want to test your grasp of the subject matter by going through the exercises or skipping to any course module to delve into the area you may want to revisit.  </p>  <p style=\"\">  \tThe exercises are also designed to support their use in a group setting, and to serve as discussion points and therefore benefit the team as a whole gain from perspectives of different team members  </p>", 
    "end_date": null, 
    "title": "Scrum - Applying The Art of The Possible", 
    "price": "30.00", 
    "instructors": "Joseph Anthony", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/124732_b1bf_8.jpg", 
    "course_url": "https://www.udemy.com/scrum-art-of-the-possible/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-24T18:19:14Z"
}