{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><em>I want to make this course more assessable to you; and so have lowered the price of this course. Remember, your not just buying the course but you also get my help. I've spent some time helping others in this course (and my others) and will help you too..</em><br></p><p><em>So, go on. Get it now while you're thinking about it.. And enjoy.</em></p><p><em>\"Good overview of Scrum</em></p><p><em>A nice overview of Scrum process described in this course. I enjoyed going through it.\"</em></p><p><em>\"Really intuitive and an easy get to grips with course if you want or need an introduction into Scrum Methodology and Agile Development, this is for you. The instructor expertly breaks down the principles behind the introduction, into 21 very easy to follow steps. This course comes very highly recommended!!\"</em></p><p><strong>These are just a couple of the great reviews this course has received.</strong></p><p>Scrum is a management and control process that focuses on building the software and meeting business needs; it is designed to cut through all the complexity. Project management and teams; using Scrum; are able to deliver working software incrementally using the requirements rather than spending a big percentage of time up front on understanding and planning all requirements before starting on the programming.</p><p>Scrum allows your analysts to create user stories from the requirements that will concentrate on what you need for the next iterations; this allows development to start at the beginning of the project. It also allows any changes in the requirements or scope to be addressed immediately rather than at the end of the development (as would happen in waterfall).</p><p>Scrum itself is a simple framework for effective team collaboration on complex projects.</p><p>This course has been designed to introduce you to Scrum, the elements of Scrum. You will learn what are the different roles in the Scrum Teams; you will learn about Scrum Artifacts (such as what is the Product Backlog) and you will learn about Scrum Reports.</p><p>I'm created this course so that anyone can get to grips with the Scrum process. By the end of this course you will have an understanding of the Scrum process and what you need to accomplish.</p><strong></strong>  <p><strong>12th March 2015</strong> - I've just added a new lecture on Retrospective Planning Resources. In this lecture I talk a little more about Retrospectives and give you a great resource to use when planning yours.</p>", 
    "end_date": null, 
    "title": "Scrum - Start Using Scrum Today", 
    "price": "20.00", 
    "instructors": "Sean McCammon", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/387908_cddf_2.jpg", 
    "course_url": "https://www.udemy.com/an-introduction-to-scrum-methodology-and-agile-development/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-07T19:26:14Z"
}