{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>“Big data\" analysis is a hot and highly valuable skill – and this course will teach you the hottest technology in big data: <strong>Apache Spark</strong>. Employers including <strong>Amazon</strong>, <strong>EBay</strong>, <strong>NASA JPL</strong>, and <strong>Yahoo</strong> all use Spark to quickly extract meaning from massive data sets across a fault-tolerant <strong>Hadoop</strong> cluster. You'll learn those same techniques, using your own Windows system right at home. It's easier than you might think.</p><p>Learn and master the art of framing data analysis problems as Spark problems through over 15 hands-on examples, and then scale them up to run on cloud computing services in this course.</p><ul><li>Learn the concepts of Spark's Resilient Distributed Datastores</li><li>Develop and run Spark jobs quickly using Python</li><li>Translate complex analysis problems into iterative or multi-stage Spark scripts</li><li>Scale up to larger data sets using Amazon's <strong>Elastic MapReduce</strong> service</li><li>Understand how<strong> Hadoop YARN</strong> distributes Spark across computing clusters</li><li>Learn about other Spark technologies, like Spark SQL, Spark Streaming, and GraphX</li></ul><p>By the end of this course, you'll be running code that analyzes gigabytes worth of information – in the cloud – in a matter of minutes.</p><p>We'll have some fun along the way. You'll get warmed up with some simple examples of using Spark to analyze movie ratings data and text in a book. Once you've got the basics under your belt, we'll move to some more complex and interesting tasks. We'll use a million movie ratings to find movies that are similar to each other, and you might even discover some new movies you might like in the process! We'll analyze a social graph of superheroes, and learn who the most “popular\" superhero is – and develop a system to find “degrees of separation\" between superheroes. Are all Marvel superheroes within a few degrees of being connected to The Incredible Hulk? You'll find the answer.</p><p>This course is very hands-on; you'll spend most of your time following along with the instructor as we write, analyze, and run real code together – both on your own system, and in the cloud using Amazon's Elastic MapReduce service. <strong>5 hours of video</strong> content is included, with <strong>over 15 real examples</strong> of increasing complexity you can build, run and study yourself. Move through them at your own pace, on your own schedule. The course wraps up with an overview of other Spark-based technologies, including Spark SQL, Spark Streaming, and GraphX.</p><p>My previous course on MapReduce has received nothing but praise and 5 star reviews, and I've put even more effort into this course on Spark. I hope you enjoy it!</p>", 
    "end_date": null, 
    "title": "Taming Big Data with Apache Spark and Python - Hands On!", 
    "price": "25.00", 
    "instructors": "Frank Kane", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/622414_03f5_3.jpg", 
    "course_url": "https://www.udemy.com/taming-big-data-with-apache-spark-hands-on/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-25T18:10:47Z"
}