{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>  \t                                    In this course you will learn the basics of Test Driven Development. You will learn how to do Problem Domain Analysis, Solution Domain Analysis, Designing Test Cases and Writing Tests First. Learn the Basics of Test Driven Development in Ruby using this Beginner Course. This course will take 4 hours to complete.  </p>  <ul>  \t<li>Practice skills using 7 katas</li>  \t<li>Take 8 quizzes to self-evaluate your understanding</li>  \t<li>Use the downloadable checklists to guide you when coding</li>  \t<li>  \t  \t\t                  Learn 3 different techniques to do Test Driven Development  \t  \t</li>  </ul>  <p>  \t                  You can be more productive if you practice TDD at work. Companies that adopt Test Driven Development are great places to work.  </p>  <p>  \t                  The material used in this course is the result of feedback from students who attended my TDD bootcamps and tutorials. This is a course designed by a developer for developers.  </p>  <p>  \t                      The concepts are first explained in a presentation. Then a coding demo illustrates how to apply the theory in practice. At the end of the lesson an exercise is given to reinforce the material.  </p>  <p>  \t                      You will learn the following concepts:  </p>  <ul>  \t<li>Assertions</li>  \t<li>The structure of a test</li>  \t<li>TDD Cycle</li>  \t<li>Minimal Implementation</li>  \t<li>Starter Test</li>  \t<li>Story Test</li>  \t<li>Next Test</li>  \t<li>Refactoring</li>  \t<li>Obvious Implementation</li>  \t<li>Fake It Till You Make It</li>  \t<li>Triangulation</li>  \t<li>Hiding Implementation Details</li>  </ul>  <p>  \t                  You will be able to attend interviews for companies that demand <strong>TDD skills to get a six-figure salary</strong>. Complete with working files and code samples, you'll be able to work alongside the instructor and will receive a verifiable certificate of completion upon finishing the course.  I have interviewed people and I have seen the common mistakes made by candidates.</p>  <p> No questions asked, <strong>30-day full refund</strong> if you are not satisfied. Enroll in this course now, this course can help you get a better job with <strong>six-figure salary</strong>.  </p><p><strong>Feedback from Jeff Casimir</strong></p><p>Principal, Jumpstart Lab</p><p><strong>Pros:</strong>- </p><ol><li>The actual coding TDD examples for Fizz Buzz and Fibonacci were really well done </li><li>During the coding exercises the refactoring of code was a good illustration of how to improve certainty of test results</li><li>Good overview of the importance of testing</li><li>Each lecture / exercise was only 5-10 minutes providing nice incremental gains in the course</li><li> The Udemy setup and course delivery website was very user friendly<strong></strong></li></ol><p><strong>Cons:</strong>- </p><ol><li>The instructor's delivery was not engaging - students tune out very quickly</li><li>First 61 minutes were very high level and included no actual coding </li><li>Instructors speaking voice was monotone and slow for the entire course no inflection, jokes, or anything to keep your attention </li><li>The audio between segments varied in quality to sometimes low quality not ideal for a $200 course </li><li>Instructor used whiteboard to write notes and diagram concepts during lecture (also wrote in cursive and at least 1 time wrote off viewable screen)</li></ol><p><strong>Summary:</strong></p><p>We wouldn't recommend it for Turing pre-requisite work, but could be valuable supporting material for students in the class.</p><p>LAST UPDATED ON JUNE 19, 2015  </p>", 
    "end_date": null, 
    "title": "The TDD Course for Beginners: Learn by Practicing 7 Katas", 
    "price": "50.00", 
    "instructors": "Bala Paranj", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/281018_3b39_6.jpg", 
    "course_url": "https://www.udemy.com/learn-test-driven-development-in-ruby/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-14T16:39:21Z"
}