{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">إذا بحثت عن الوظائف الشاغرة في أغلب البلاد العربية وخاصة دولتي الإمارات والسعودية ستجد أن أعلي طلبات  للتعيين هي لوظائف مطوري ومصممي البنية الذين يحملون خبرة التوجاف</strong></p>\n\n<p><strong class=\"redactor-inline-converted\">TOGAF developers and architects.</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>هذه الدورة ستعلمك كل ما تحتاجه لتصبح مصمم بنية مؤسسية معتمد بشهادة التوجاف 9.1 </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>TOGAF 9.1 certification exam (OG0-091)</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>كلنا نحتاج للتدريب لنكون مصممي مؤسسات وأغلب هذا التدريب يأتي من خبرات العمل في مشاريع أنظمة معلومات كبيرة. وبالتأكيد يوجد طرق محددة لتصميم البرامج والتطبيقات علي مستوي المؤسسات. ولقد قدمت شركة أوبن جروب معيار لتصميم وتطوير وبناء إطار منهجي لبنية المؤسسات منذ عشر سنوات والذي إشتركت في تصميمه ما يقرب من 400 شركة عالمية وحكومات علي مستوي العالم والذي أطلقت عليه اسم توجاف - إطار البنية من أوبن جروب</p>\n\n\n\n\n\n\n\n\n\n<p><em>TOGAF - The Open Group Architecture Framework</em>.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>والحقيقة هي:ـ</p>\n\n\n\n\n\n\n\n\n\n<p>هذه الدورة ستساعدك علي ان تكون معتمدا لمواصفات توجاف 9.1 وستكون أكثر مهارة في تصميم النظم من خلال فهمك لدورة تطوير البنية</p>\n\n\n\n\n\n\n\n<p>Architecture Development Method (ADM)<br></p>\n\n\n\n\n\n\n\n<p>فإذا كنت تعمل بالفعل في مجال تصميم البرامج فتعلمك إطارا رسميا لتصميم البنية المؤسسية كالتوجاف يجعلك تقفز عدة خطوات علي سلم النجاح والتميز</p>\n\n\n\n\n\n\n\n\n\n<p>فأنت تدين لنفسك :ـ</p>\n\n\n\n\n\n\n\n<p>إذا كنت مطورا للبرامج فالفرصة قد سنحت أمامك لتعلم التقنيات الصحيحة لتقييم متطلبات المؤسسة ، وتصميم الحلول الصحيحة التي تعمل معك اليوم وغدا. وحيث أنه من المعلوم أن مهارات تطوير البرامج يكتسبها أي شخص الآن حتي طلاب المدارس وحيث أصبحت مرتبات مطوري البرامج ثابتة إلي حد ما ، فإن المهارات المعقدة لتصميم مشاريع البرامج الضحمة هي الأكثر طلبا الآن<br></p>\n\n\n\n\n\n\n\n<p>في هذه الدورة ستتعلم:ـ</p>\n\n\n\n\n\n\n\n<ul><li>تفاصيل امتحان التوجاف 9.1 الجزء الأول شاملا كيف تحجز مقعدك للإمتحان </li><li>خبراتنا عند حل الامتحان</li><li>المفاهيم الأولية والمحورية لإطار التوجاف</li><li>منهج تطوير البنية بكل مراحلها ومفتاح الفهم والنجاح في كل مرحلة</li><li>مواضيع أخري عديدة تشمل إدراة البنية ووسطية البنية وتقييم قدرة المؤسسة </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br></p>\n\n<p>الدورة مركزة علي مساعدتك تخطي الإمتحان بنجاح. لو حاولت ان تحضر دورة مشابهة مع أي مدرب وجها لوجه ستدفع حوالي 2000 دولارا امريكيا في دورة لمدة يومين. دورتنا هي الحل الوسط بين حضور دورة مع مدرب وبين أن تستذكر لوحدك بدون أي مساعدة<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>لو حاولت أن تقرأ دليل مواصفات التوجاف 9.1 أو حتي دليل الإستذكار الرسمي للإمتحان فستتفق معنا أن المادة المكتوبة طويلة وصعبة الفهم. فدليل التوجاف <strong class=\"redactor-inline-converted\">654 صفحة</strong>. ودليل الإستذكار الرسمي <strong>265 صفحة</strong>. وكلاهما مكتوب بنفس الإسلوب الذي يكتب به المواد العلمية الجافة - مفصلة جدا وطويلة جدا<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>بمجرد مشاهدتك لمحاضراتنا وحل الأسئلة معنا ومتابعة ذلك بقراءة بضعة صفحات محددة من دليل مواصفات التوجاف فستوفر الساعات والساعات من المذاكرة ، وستحصل علي الثقة في التقدم لإمتحان التوجاف الجزء الأول<br></p>\n\n\n\n\n\n\n\n<p>فإنضم إلينا:ـ</p>\n\n\n\n\n\n\n\n<p>فنحن واثقون أن هذه الدورة ستوفر لك العديد والعديد من ساعات المذاكرة مقارنة بقراءة الـ 650 صفحة. سنرد علي أسئلتك عن المنهج بأنفسنا وسنوضح لك مايجب أن تركز عليه. وإذا لم تعجبك الدورة لأي سبب فيمكنك إسترداد نقودك كاملة من يوديمي خلال 30 يوما بدون أي أسئلة. ولكننا واثقون أنك لن تحتاج هذه الخطوة. فنحن نعرف قدراتنا ونتعهد  أن نساعدك دائما لتخطي الإمتحان بنجاح. وكلنا نعرف انك لا تستطيع أن تحصل علي هذا الدعم من كتاب أو دورة توجاف مؤقتة<br></p>\n\n\n\n\n\n<p>نحن نرد علي جميع أسئلتك ، نساعد ونوجهه كل الطلبة ، ونحدث الدورة كلما أمكن لنكون دائما الدورة رقم 1 عن التوجاف والدورة رقم 1 علي يوديمي والدورة رقم 1 علي الانترنت</p>\n\n\n\n<p>فمرحبا بك معنا وشكرا لإنضمامك إلينا</p><p>Scott Duffy is a TOGAF Certified architect, and a member of the Open Group's Architecture Forum - helping to define the standard going forward. Little Oliver Consulting Services teaches the TOGAF 9.1 specification under a commercial license.</p>\n\n<p>TOGAF is a registered trademark of The Open Group in the United States and other countries.</p>\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. We are also available for questions inside the course discussion board.</p><p><br></p>", 
    "end_date": null, 
    "title": "TOGAF 9.1 Enterprise Architect in Arabic - توجاف الجزء الأول", 
    "price": "30.00", 
    "instructors": "Scott Duffy, Maged Koshty, Software Architect", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/692292_1c1f_2.jpg", 
    "course_url": "https://www.udemy.com/togaf-arabic/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-08T20:20:22Z"
}