{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p><strong>New videos recorded Apr 2016. Part 2 Sample Questions added. With subtitles.</strong><br></p>\n\n\n\n\n\n<p>More than 8000 students have joined my Part 1 course, and more than 4700 students have joined my Part 2 course. More than 850 reviews between the two courses!</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tThis course goes through the <strong>process of studying</strong> for the TOGAF 9 Part 1, Part 2 and Combined exams. I go through what you need to do to prepare for the exam in the weeks leading up to the test, and how to approach the exam itself on the day of the test.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tI also link to the best resources I have found online for studying for this test. I link to free resources, cheap and inexpensive ones, and even blog posts I have found.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tBy the end of this short course, you will know how to approach studying for the exam. I want to be clear that this course does not cover the TOGAF 9 specification itself. This class alone is not sufficient for taking the TOGAF exams. But I do lay out a schedule for you to study over 4-5 weeks that you can follow.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tI am TOGAF 9 Certified, having passed both the Part 1 and Part 2 exams. And I am also a member of the Open Group's Architecture Forum. I hold a commercial license to teach the TOGAF 9 Specification.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tTOGAF is a registered trademark of the Open Group.  </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Thank you for signing up for this course on Udemy. The course will always be up-to-date here and nowhere else. I am also available for questions inside the course discussion board.<br></p>", 
    "end_date": null, 
    "title": "TOGAF 9.1 Certification Exam Strategy", 
    "price": "20.00", 
    "instructors": "Scott Duffy, Software Architect", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/374568_550b_5.jpg", 
    "course_url": "https://www.udemy.com/study-togaf/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-20T17:24:49Z"
}