{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p style=\"\"><strong>JOIN A THOUSANDS OF STUDENTS IN UDEMY'S MOST COMPREHENSIVE AGILE USER STORIES COURSE!</strong></p>THIS COURSE HAS BEEN DESIGNED TO SAVE YOU HUNDREDS IF NOT THOUSANDS OF DOLLARS ON AGILE USER STORY TRAINING AS A PRODUCT OWNER, AGILE TEAM MEMBER OR BUSINESS ANALYST.<p style=\"\"><strong>Three reasons to TAKE THIS COURSE right now!</strong></p><p style=\"\">The unique reasons for taking this course are:</p><ol><li>Complete, Concise, Confident Overview of User Stories - I cover all of the theory and give you examples of how the theory is used in industry.</li><li>Confidence in writing User Stories - In a very simple way, I teach you exactly how the pros write user stories without going into a class room or spending $1000..</li><li>You get to ask me questions and see me respond to every single one of them thoughtfully!</li></ol><p style=\"\">Includes Narration from Ted R. Brown</p><strong>What is a User Story?</strong><p style=\"\">A User Story is the description of a product feature or requirement from from a user's perspective. Based on my experience, it is the simplest way to capture requirements which focus on adding value and help businesses to deliver early return on investment!</p><p style=\"\"><strong>Who should take is course?</strong></p><p style=\"\">Whether you are a product owner, scrum master, business analyst, team member, business stakeholder or simply someone who wants the answer to the question \"what is a user story\", this is the place to start. If you are preparing to become an agile product owner or agile business analyst then this class is for you.</p><p style=\"\"><strong>What will I learn?</strong></p><p style=\"\">In this class you will learn:</p><ul><li>Concise overview of Agile User Stories - Including How to write a user story description, acceptance criteria to capture the detail, the purpose of epics and themes in dealing with large or vague requirements and how to split stories along with the reasons why user stories are favoured over traditional methods of capturing requirements. This includes lectures on the principles that underpin user stories, such as the INVEST principle and the Three Cs formula.</li><li>The facts based on real industry experience and agile expertise - The correct terminology and use of User stories is essential to mastering it. My experience in industry and extensive research into the topic has been used to give you a solid grounding in the most concise way possible.</li><li>Agile Product Owners / Agile Business Analyst preparation - I tell you the exact theory and give you templates to prepare you for writing user stories in the real workd, business or work place without having to do a face to face course saving you hundreds if not thousands of dollars.</li></ul><p style=\"\">The course is video based with no supporting document necessary. I go through key gotchas from the scrum guide.  If you have 3by5 index cards, this is a bonus but you can get started without this.</p><p style=\"\"><strong>How is the course structured?</strong></p><p style=\"\">Each section features an overview of a particular aspect of User Stories such as Principles, How to write a user story description, how to write acceptance criteria, or epics. Examples are included throughout the course. All is based on Agile theory and real world experience so you know that you are learning the facts.</p><p style=\"\">Inspired by God, the Bible, Mike Cohn.</p>", 
    "end_date": null, 
    "title": "User Stories for Agile Scrum+Product Owner+Business Analysis", 
    "price": "20.00", 
    "instructors": "Paul Ashun", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/477958_ae48.jpg", 
    "course_url": "https://www.udemy.com/userstory/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-16T12:24:46Z"
}