{
    "selfpaced": true, 
    "topic_name": [
        "Development"
    ], 
    "description": "<p>This course teaches you how to create Windows Service which are a key component of Windows operating system.</p><p>The course is divided in various sections.</p><p>In section one, you will learn the definition and anatomy of a Windows Service. You will also understand the difference between a Windows Service and other application types like Windows Forms.</p><p>In section two you will create a Windows Service project, and utilize installutil to install or uninstall a service.</p><p>After this you will open the Event Viewer to see the events... generated by your newly born service.</p><p>In section three you will learn how to debug a Windows Service.</p><p>You will also see how to integrate Log4Net logging library into your service project. Its a free &amp; open source library and it lets you generate rolling log file.</p><p>In the next section you will look into a few real world scenarios like a file synchronization service and a periodic data update service. You will also learn how to create an installer project for easy setup and installation of a Windows Service.</p><p>In the final section we are going to create an admin application for a Windows Service. This application will have the ability to start/stop a service and get service status as well.</p><p>Please note that this course will not freeze in time, I will keep adding interesting and useful ideas with the passage of time.</p><p>I learned Windows Service programming the hard way, on my own. You sir! can take advantage of my experience and learn it quickly by joining this course. Sign up and I will see you inside!</p>", 
    "end_date": null, 
    "title": "Windows Service Programming in C# .Net For Coders & Students", 
    "price": "20.00", 
    "instructors": "Naeem Akram", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/600178_cfd8_3.jpg", 
    "course_url": "https://www.udemy.com/windows-service-programming/", 
    "currency": "USD", 
    "subject_name": [
        "Software Engineering"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-02T08:22:11Z"
}