{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course will help you become more productive and reach more goals. Can you stick with it for 40 days? I know you can!</p><p>Goal setting is easy taking the daily action is the hard part. </p><p><strong>There are <u>two</u> obstacles</strong> that are likely preventing you from being a <em>massive</em> action-taker right now: <strong>A lack of clarity, and a lack of motivation</strong>.</p><p>That's it!</p><p>Here's why <em>clarity</em> and <em>motivation</em> matter:</p><ul><li><strong>A confused mind always says <u>no</u>!</strong> If what you need to do each day isn't clear and and understandable to you, your brain is going to create resistance to taking action (you experience a similar restrictive reaction when you're blindfolded and asked to move - it's a form of what is often called '<u>fear of the unknown</u>').</li></ul><ul><li><strong>Without clear reasons <em>WHY</em></strong> you need to take action, you often find yourself <strong>without the fuel and motivation for taking action!</strong></li></ul><p><strong>Without clarity</strong> about what you need to do, <strong>and reasons</strong> for doing them,<strong> your mind easily wanders</strong>, and your heart lacks any kind of motivation for taking meaningful action. As a result, <strong>distractions and procrastination take over</strong> and your ability to produce significant results becomes a fraction of your potential.</p><h6>FLIP THE ACTION SWITCH IN YOUR HEAD FROM 'NO' TO 'YES'</h6><p>No longer will overwhelmingly big tasks paralyze you from taking little to no action. Use <strong>40 Days of Focus</strong> to break these monsters into smaller, bite-sized pieces you WANT to eat!</p><h6>LAUGH AT PROCRASTINATION</h6><p>Take any task you've been putting off, give yourself 30 minutes to get it done, start your timer, and watch what happens. This simple process creates a 'virtual' space in your brain for that task that you feel unexplainably compelled to fill with its completion! </p><h6>SHARPEN YOUR FOCUS</h6><p>Using <strong>40 Days of Focus</strong> daily helps you get into the habit of eliminating productivity-killing distractions so you focus your concentration and energy on the task-at-hand.</p><h6>BUILD UNSTOPPABLE MOMENTUM</h6><p>With each task you complete using <strong>40 Days of Focus</strong>, you build up a momentum that propels you to not only get even more done, but get it done faster and more efficiently than ever!</p><h6>CONTROL YOUR TIME INSTEAD OF IT CONTROLLING YOU</h6><p>Using <strong>40 Days of Focus</strong> helps to become more aware of how and where you spend your time each day. As you become more aware of your habits, you easily discover ways to use your time more productively, and eliminate previously hidden time-wasters. </p><h6>MAKE TIME FOR YOUR DREAMS</h6><p>Are you neglecting your dreams and letting everything else gobble up your limited time, energy, and resources? Use <strong>40 Days of Focus</strong> to <u>make</u> time every day to take even a <em>little</em> action to move you closer to things you want in life!</p><h6>SMASH THOSE NAGGING SMALL GOAL SETTING TASKS WITH A SLEDGEHAMMER</h6><p>You know the kind; they're important, and they need to be done, but they're small and you never seem to find time get them done and cross them off your list. Use <strong>40 Days of Focus</strong>, set aside a measly 30 minutes, and don't just whittle away at your list -<em> smash it to pieces</em>! </p><h6>LIMIT YOUR INTAKE OF 'TIME-SNACKS'</h6><p>Quit checking email, twittering, and updating your Facebook page mindlessly, with no regard for how it's eating-away at your time, then feeling guilty about it all later. Use <strong>40 Days of Focus </strong>to 'allow' yourself a specific amount time to enjoy it as much as you want.</p><p>I look forward to you taking this course, getting focused, defeating procrastination, setting goals you can wait to reach, and increasing your productivity by getting more done in less time.</p><p>Success is NOT an Accident!</p><p>Paul</p>", 
    "end_date": null, 
    "title": "40 Days of Focus to Improve Productivity and Goal Setting", 
    "price": "20.00", 
    "instructors": "Paul Evans", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677194_f404.jpg", 
    "course_url": "https://www.udemy.com/increase-productivity-beat-procrastination-and-improve-goal-setting/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T11:47:56Z"
}