{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you ready to master the strategies used by the Mega Rich to achieve tremendous success? After working with millionaires, multi-millionaires and even billionaires I have discovered certain characteristics and strategies common amongst all of them.</p><p>You will learn how to instill new habits to replace the poor habits that have been causing you to procrastinate and stall on your path to ultimate success. You will be able to create the momentum required to replace those poor habits fast!</p><p>Learn how to value your time and how planning your day will take you so far on your path to success - you will be given an inside view of how the ultra rich plan their time.</p><p>You are going to learn why acting first and perfecting later is so important - the most successful don't wait for everything to be perfect before they act. Most times they act first and tweak later, an essential skill for you to learn and master.</p><p>Find out how important your time is and how the most successful people protect their time. You will be shown how to say no to distractions, interruptions, emails and unwanted phone calls.</p><p>You are covered by a 30 day money back guarantee. Enroll today and start learning the strategies of the Mega Rich</p><p><br></p>", 
    "end_date": null, 
    "title": "Achieve:  Strategies Used By The Mega Rich to Succeed ", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/657492_4198_3.jpg", 
    "course_url": "https://www.udemy.com/success-techniques/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-02T05:30:47Z"
}