{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t             Sonhar e desejar aquilo que queremos para nossas vidas são algumas das experiências mais prazerosas da existência humana. Visualizar um futuro promissor é tão empolgante quanto vivenciá-lo. Mas como podemos colocar em prática nossos melhores pensamentos e conquistar nossos maiores objetivos e metas?  </p>  <p>  \t             Existe uma seqüência ideal para todo o processo decisório. Quem a conhece leva vantagem por utilizar este artifício para conquistar suas maiores aspirações. O Coach <strong style=\"\">Marco Ogê</strong> transformou esta seqüência em uma ferramenta simples e prática que auxilia as pessoas a alcançar objetivos e metas.  </p>  <p>  \t             Essa ferramenta se chama <strong style=\"\">fórmula da transformação</strong>. Nesse curso você aprenderá como utilizar a <strong style=\"\">fórmula da transformação</strong> para colocar seus objetivos e metas em prática.  </p>  <p>  \t      O curso está estruturado em seis sessões:  </p>  <p>  \t      A “Sessão 1: Como aproveitar o curso ao máximo?” é composta pela “Aula 1: Você já ouviu falar em coaching?”, onde há uma breve explicação da metodologia do curso. Pela “Aula 2: Você é mais racional, intuitivo ou emocional?”, na qual você aprenderá sobre algumas estruturas metais. Pela “Aula 3: Você já deixou para amanhã o que você podia ter feito hoje?”, onde você vai descobrir porque a maioria das pessoas adia ações importantes. E pela “Aula 4: Você conhece a seqüência ideal de todo o processo de tomada de decisão?”, na qual você conhecerá a fórmula da transformação que estrutura a seqüência ideal do processo de decisão de forma simples e prática.  </p>  <p>  \t      Na “Sessão 2: Conhecer: o primeiro passo em direção ao seus objetivos e metas”, você começará a utilizar a fórmula da transformação. A sessão é composta por três aulas. Na “Aula 5: Vamos conhecer sua realidade atual?” você definirá um objetivo ou meta a ser alcançado. Na “Aula 6: Vamos listar informações sobre sua realidade atual?” você conhecerá todo o contexto que envolve a sua realidade atual. E na “Aula 7: Vamos fazer um diagnóstico que resume sua realidade atual?” focê vai fazer uma síntese da sua realidade atual.  </p>  <p>  \t      A “Sessão 3: Assumir: o segundo passo em direção aos seus objetivos e metas” é composta por uma única aula. Na “Aula 8: Quem é o responsável pela sua vida?” você vai assumir que é cem por cento responsável por suas ações e vai assumir a liderança dos rumos da sua vida.  </p>  <p>  \t      Na “Sessão 4: Criar: o terceiro passo em direção aos objetivos e metas” você vai exercitar a criatividade. A sessão é composta por três aulas. Na “Aula 9: Vamos gerar ideias?” você vai gerar alternativas viáveis para alcançar seus objetivos ou metas. Na “Aula 10: Vamos visualizar o futuro?” você vai se fortalecer com os sentimentos de imaginar a realidade futura (quando você alcançar seu objetivo ou meta). E na “Aula 11: Você quer, você escolhe, você decide.” você vai aprender a realmente tomar uma decisão de modo a se comprometer a cumprí-la.  </p>  <p>  \t      Na “Sessão 5. Realizar: o quarto passo em direção aos objetivos e metas” você vai operacionalizar o seu objetivo ou meta. A sessão é composta por três aulas. Na “Aula 12: Planeje.” você vai definir os passos para alcançar o seu objetivo ou meta. Na “Aula 13: Implemente.” você vai colocar em prática tudo aquilo que planejou. E na “Aula 14: Acompanhe.” você vai fazer um acompanhamento dos passos que o conduzirão a alcançar o seu objetivo ou meta.  </p>  <p>  \t      Por fim, na “Sessão 6. Sessão de coaching.” você terá uma sessão de coaching de uma hora comigo. Na “Aula 15: Vai ser um prazer conhecer sua história.” eu forneço as diretrizes gerais para você realizar a sessão que será realizada via skype com agendamento prévio de acordo em horário compatível com a sua e com a minha disponibilidade.  </p>", 
    "end_date": null, 
    "title": "Aprenda os passos para alcançar objetivos e metas", 
    "price": "20.00", 
    "instructors": "Marco Ogê Muniz", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/102308_d0a9_7.jpg", 
    "course_url": "https://www.udemy.com/formuladatransformacao/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-06T22:27:58Z"
}