{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>**Updated November 2015**<br></strong></p><p><strong>**30 Day Satisfaction Guarantee**</strong></p><p>Learn to crush procrastination once and for all by utilizing simple-yet-effective methods outlined in this course.</p><p>Do you suffer from too much couch surfing?  Does your day feel like it's spent watching what other people are doing on social media?  Has your to-do list become a never-do list?</p><p>You've come to the right place.</p><p>You'll learn how a 10-minute shift in focus will help you achieve goals and become more than you ever thought possible.  </p><p><em><strong>Change 10 minutes.  Change your life.</strong></em></p><p>Do you wonder why the most successful people are where they are?  They are worried about wasting their most valuable resource!</p><p><strong>No, not money.  Time.</strong></p><p>This course is designed to help you realize that you've been wasting time doing things that aren't important.  More importantly, it's designed to help you realize your potential with the same 24 hours that everyone gets.</p><p><strong>Build lifelong skills to become a productivity genius and never waste time again!</strong></p><ul><li>Utilize 10MIN Method, Pomodoro Technique, and IFI Systems to get on track.</li><li>Break bad habits and develop long-lasting good habits.</li><li>Discover queues why you procrastinate and learn to overcome them. Prioritize or eliminate your daily tasks.</li><li>Create To-Do lists that actually get accomplished.</li> <li>Get more done than you ever thought possible.</li><li>Use the power of positive affirmations to make your day positive and productive</li> </ul><p><strong><br></strong></p><p><strong>Powerful Productive Techniques Await You</strong></p><p>Beating procrastination can only happen when you become conscious of your wasted time. With higher productivity the world can be yours, but you must learn how to avoid procrastination killers! </p><p><em>Effective time management will help you get more things done than you ever thought possible.</em> </p><p><strong><br></strong></p><p><strong>Content and Overview</strong></p><p>Everyone suffers from procrastination at some point in their life. So why do some people live ultra-successful lives while others are stuck being so-so?</p><p>They learn how to overcome their procrastination and form truly effective time management skills that boost their output while also minimizing distractions.</p><p>This course will walk you through effective productivity techniques that are designed to be easy-to-accomplish while still allowing you to fulfill big goals. Take your big goals and discover how the 10MIN Method will break down those goals into straightforward footsteps that will allow you to succeed at any project or task.</p><p><strong><br></strong></p><p><strong>Turn \"impossible\" into I'M making it POSSIBLE with help from this course.</strong></p><p><strong>Complete with both video and written lectures, Become A Productivity Master! will allow you to dream big dreams and allow you methods to achieving things you once deemed impossible.</strong></p>", 
    "end_date": null, 
    "title": "Become a Productivity Master!", 
    "price": "20.00", 
    "instructors": "Michael Naus", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616966_d357_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-become-a-productivity-master/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-20T02:04:18Z"
}