{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>***Updated For <strong>June </strong>2015***</em></strong></p>\n\n<p><strong>This course will give you the motivation you need to push yourself as an entrepreneur. I will motivate you like no other person does. Just take a look at the free preview videos. I believe in my capabilities to motivate and you WILL be motivated! </strong><br><strong></strong></p>\n\n\n\n\n\n<p>We all need motivation in life and it can be tricky to find the right kind of motivation that speaks to us as an entrepreneur. As an Entrepreneurship myself, I have had many days where the going just \ngets tough and I am literally grinding my teeth to make progress. At those times you need the right kind of motivation to remind you that you can indeed get through this! Just check out the preview videos and see just how motivated you will be once you take this course.<br></p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will be inspired and motivated to make some serious changes in your business for the better.</strong></p>\n\n\n\n\n\n<p><strong>FREE BONUS INCLUDED WITH THIS COURSE</strong><br>As an additional\nbonus for taking this course you will also receive the mp3 version of the\ncourse so that you can take the motivation with you wherever you are!</p>\n\n\n\n\n\n<p><strong>Zero Risk</strong><br>There is a 30 day\nmoney back guarantee so you literally have no risk in taking this course.\nSeriously, the 30 refund is even automatic so there is no hassle on your end.\nIf this course sounds like it is for you then give it a go! </p>\n\n\n\n\n\n<p><em>\"We can not solve our problems with the same\nlevel of thinking that created them” </em>- Albert Einstein</p>\n\n\n\n\n\n<p>I will see you\ninside if you are ready to become truly motivated!</p>\n\n\n\n\n\n<p><strong>Ben</strong></p>", 
    "end_date": null, 
    "title": "Business Motivation Mastery: Motivation For Your Business!", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/658382_1f85.jpg", 
    "course_url": "https://www.udemy.com/motivation-for-entrepreneurs/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T01:13:00Z"
}