{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>***Updated For <strong>June </strong>2016***</em></strong><br></p>\n\n<p><strong>Lack of confidence is a multi-faceted menace as it can manifest in many ways such as obsession with your physical flaws, low self-esteem, fear of public speaking, hand sweating, troubled breathing before the opposite sex, painful self-consciousness regarding others’ opinions, fear of being the center of attention, or more generally, the “I am worse than others” feeling. </strong></p>\n\n\n\n\n\n<p>Of course, it is a rare occasion that all these “symptoms” are present in a single case but having even a few of them can negatively interfere with your psychological comfort. But there is good news! No single person comes into this world with inherent fear, anxiety, social uneasiness or awkwardness. These, mildly put, inconveniences are so inevitably given to us by our upbringing and social surroundings - what psychologists call “socialisation”. Your lack of confidence in certain circumstances is the result of unfortunate “socialisation” programming. But don’t worry -anything that has been programmed can be re-programmed, and I am your programmer! </p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of the course you will finally unleash the beast of confidence that has been lying dormant inside you!</strong> </p>\n\n\n\n\n\n<p><em>\"If you have no confidence in self, you are twice defeated in the race of life.” </em>- Marcus Garvey</p>\n\n\n\n\n\n<p>I will see you\ninside when you are ready to transform your confidence! </p>\n\n\n\n\n\n<p><strong>Ben</strong></p>", 
    "end_date": null, 
    "title": "Core Confidence: How To Motivate Yourself Consistently!", 
    "price": 0, 
    "instructors": "Benjamin Hero", 
    "commitment": "34 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/718366_56d8.jpg", 
    "course_url": "https://www.udemy.com/core-motivation-how-to-motivate-yourself-consistently/", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-06T15:12:52Z"
}