{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Creative Writing: 30 Days of Fiction, is ideal for anyone wanting to increase their dedication to writing through daily writing tasks. You don't need to already be writing; beginners would benefit from the course as much as those who have been writing for a while and now find themselves in a creative rut.<br>Each day students will be presented with a writing activity to complete. Some of the activities take longer than other and, like all things, you get back as much as you put in, but setting aside half an hour or so to your daily writing practice. Some of the tasks link on and continue from each other, so it's important that you complete each day in order. <br>The course runs over 30 days, each day there is a video to watch and a creative task to complete, some days there are PDF's to accompany the tasks, but most of the writing should be done in your writer's journal / log or on your personal computer. <br>The tasks are complete in themselves but feel free to use your imagination to expand and connect them where you want to. <br>One of the objectives of the course is to get you thinking creatively and using your own dynamic initiative to write engaging and entertaining fiction. </p><p>If you are looking for ways to increase your daily writing activity or need inspiration and dedication then this might just be the course that you are looking for.</p>", 
    "end_date": null, 
    "title": "Creative Writing : 30 Days of Fiction", 
    "price": "35.00", 
    "instructors": "Annaliese Avery", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/730104_5b90_4.jpg", 
    "course_url": "https://www.udemy.com/creative-writing-30-days-of-fiction/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-16T16:03:12Z"
}