{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>The idea behind this course is to create a new environment that will pull you naturally towards your goals. </p>\n\n<p>The people you spend time with have a huge effect on your motivation and whether you keep old habits or adopt new ones.</p>\n\n<p>The problem many people face when they want to change their life in some way is that their friends, colleagues and family hold them back or make it harder for them to stick to their new habits.</p>\n\n<p>One of the easiest ways to counter these forces is to create a role models wall.</p>\n\n<p>This is something that I have used for years to keep all of my role models top of mind. </p>\n\n<p>It's a simple idea. Find pictures of the faces of each of your role models and start printing them out and posting them on the walls of your bedroom or office.</p>\n\n<p>This course teaches you how to do that, and do it well, but it also takes you through how to choose role models, how to make sure you have role models balanced across the 4 core areas of your life and also how to recognize bias in your role models that may be keeping you blind to certain people.</p>\n\n<p>This course will also show you how to keep your role model images organized in your existing learning project system.</p>\n\n<p>The whole idea of a role model is that they exemplify or model how to play a certain role in life well. </p>\n\n<p>To learn most effectively, you should get clear on what roles you play in the different areas of your life and then get clear on which role (out of the many each of your role models play in their lives) that you want to model.</p>\n\n<p>Nobody is perfect and nobody has every role in their life completely figured out. Part of what you will learn in this course is how to think about potential role models who have certain qualities you want to model but others you definitely <strong>don't </strong>want to model. </p>\n\n<p>You only have so much space in your mind to think about the various people in your life. Use a role models poster wall to start upgrading the people you surround yourself with every day and it will pay off for the rest of your life. </p>\n\n<p>Timothy</p>", 
    "end_date": null, 
    "title": "Create a Role Models Poster Wall", 
    "price": "20.00", 
    "instructors": "Timothy Kenny", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/858648_2c8f_2.jpg", 
    "course_url": "https://www.udemy.com/create-a-role-models-poster-wall-for-modeling/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-24T14:37:07Z"
}