{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\"><li>Have you ever failed in your life?</li><li>Have you ever failed in a relationship?</li><li>Have you ever experienced Failure, Pain, Problems, Difficulties and Suffering?</li></ul>If you answered YES for ANY three questions of the ABOVE then, you are in the right place <br style=\"\">Life has hit everyone very badly at some point of our life time.. Most of the time we hear and read stories about success; about the rewards of success; about the good times etc. Somehow most people do not like to talk about their failures and bad experiences. Some may talk about it only when they finally succeed – by which time, many would have forgotten about them, let alone wanting to talk or write about them. Other reasons could be that somehow on their way to achieving what they want, people may deliberately or otherwise resort to questionable practices which they prefer not mentioned. This book touches on the “other side” of the success story. It is the side from which I sincerely believe many can really learn a thing or two. The world today loves a winner and losers are not tolerated. We have reached the stage where “Nobody should make mistakes” and<br style=\"\">people who make mistakes are punished. It seems if you are not number one or in the top five, you have failed. Ironic as it may seem, but through the ages humans have only learnt through mistakes to reach what they are today. <br style=\"\">The image that successful people are like “Supermen” without making mistakes and possessing no weaknesses is not realistic and may lead to very unhealthy effects. People do need to understand that mistakes and failings are perfectly normal and in fact occur more often in the lives of achievers than in that of non-achievers.", 
    "end_date": null, 
    "title": "Dare To Fail, The Other SIde of The Success Story", 
    "price": "20.00", 
    "instructors": "Jonathan Leong, Loggeswaran Sinnaih", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/469722_8f80_3.jpg", 
    "course_url": "https://www.udemy.com/dare-to-fail-online-workshop/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-07T09:12:53Z"
}