{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">FEAR</strong> is one of the most elemental factors that can either<em class=\"redactor-inline-converted\"> make or break</em> your own success. It can both stop you dead in your tracks and deprive you of your dreams, or you can push through fear to discover the true wealth of success on the other side of it. </p>\n\n<p>When you look objectively at fear, you’ll quickly notice that it only exists in your mind. <em class=\"redactor-inline-converted\">It’s only a thought.</em> You can’t hold fear in your hand. You can’t pick it up off the ground. It’s completely invisible and ONLY based on your own thinking and belief systems. <strong class=\"redactor-inline-converted\"><em class=\"redactor-inline-converted\">Nothing more. </em></strong></p>\n\n\n\n<p>Everyone has unique fears embedded in their own subconscious minds, including yourself. These fears can suck the vitality and happiness out of your life in a hurry. It can also render you paralyzed when trying to push forward to achieve things you desire. </p>\n\n\n\n<p>Fortunately, since fear is only based in your thinking and beliefs, with the right tools, techniques and guidance…<em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">you can defeat your fears once and for all.</strong></em> </p>\n\n\n\n<p>Once you know how to become the MASTER of your fears, not only will you gain amazing control over your subconscious mind (which actually dictates your entire life)…but it’ll also allow you to <strong class=\"redactor-inline-converted\">Develop the Mental Strength of a Warrior</strong> to get everything you want out of life. </p>\n\n\n\n<p>The truth is, every solution to every problem or fear you have in life all begins <strong class=\"redactor-inline-converted\">WITHIN</strong> you, <em class=\"redactor-inline-converted\">not outside of you</em>. The golden keys that will unlock all the success and achievements you’ll ever want in life are right there tucked away within yourself. </p>\n\n\n\n<p>And they good news, once you tap into your own powers to obliterate your fears, and gain the mental toughness and strength of a true warrior, your life will <strong class=\"redactor-inline-converted\">TRANSFORM. </strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Ask yourself right now…</strong></p>\n\n\n\n<p>• Are you sick and tired of letting fear hold you back from the things you want?<br>• Do you feel like your mental fortitude and strength is severely lacking?<br>• Does the thought of change terrify you when you think about making the first step?<br>• Do you find your own thoughts working AGAINST you vs. working FOR you?<br>• Do you have that “gut feeling” that there is more to life than what you have?</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">When you look at your life and your own desires, do you…</strong></p>\n\n\n\n<p>• Want to create a life with more wealth and money?<br>• Want to skyrocket your levels of confidence and courage?<br>• Want to be able to connect better with people on a deeper level?<br>• Want to find more love, more happiness and have more opportunities?<br>• Want to achieve more, gain more recognition, get more rewards, etc?<br>• Want better health, less stress, more love, more sex, more close friends, etc?</p>\n\n\n\n<p>When you’re able to develop the mental strength of a warrior, not only will you be able to achieve just about any goal you want in life…you’ll also be able to do it <strong class=\"redactor-inline-converted\">much quicker and with less resistance</strong> once fear is taken out of the equation. </p>\n\n\n\n<p>Once you can take <em>full control </em>of your own mind, and achieve mental mastery over your fear and negative, self-defeating thoughts and beliefs…<strong class=\"redactor-inline-converted\">the world will be your canvas.</strong> You’ll be able to paint and create the life you want, every single day. </p>\n\n\n\n<p>All you need to make this happen are the right tools and techniques, and that’s exactly what you’ll get in the <strong class=\"redactor-inline-converted\">Develop the Mental Strength of a Warrior </strong>For Success In Life course. </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here’s a quick <u>sneak peek </u>of what you’ll discover inside this course…</strong></p>\n\n\n\n<p>• Learn how to develop unstoppable courage that will help you defeat fear<br>• Discover the real secrets to boost your own confidence and self-esteem<br>• Find out how to tap into your own internal motivation to get what you want<br>• Learn how to shield your mind from the negative chatter that pulls you down<br>• Stop yearning for approval from others and learn how to respect yourself<br>• How to live a life with vitality, integrity, and influence those around you<br>• Discover how to respond to life based on this moment only, not your past<br>• Learn how to take your personal power and achievements to an elite level</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">You have two choices you can make in your life right now…</strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Life Choice #1</strong>: You can continue down the path in life that lets fear hold you back from your dreams, and makes you feel like you’re missing out on the best things in life.</p>\n\n\n\n<p>Or…</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">Life Choice #2</strong>: You can discover all the tips, techniques and tools you need to become the master of your own mind and life with the help of the<strong class=\"redactor-inline-converted\"> Develop the Mental Strength of a Warrior </strong>For Success In Life course. </p>\n\n\n\n<p>You’re only one step away from removing fear from your life, boosting your confidence and self-worth, and FINALLY getting what you always wanted!</p>\n\n\n\n\n\n<p><strong>Enroll in this life-transforming course right now, and at the end of the course, <br>I’ll send you a copy of the book “Develop the Mental Strength of a Warrior” PLUS <br>2 powerful meditation audios that will help clear your mind, decrease stress, <br>and give you the clarity you need to achieve your dreams!</strong></p>\n\n<p>\n\n  </p>", 
    "end_date": null, 
    "title": "Develop the Mental Strength of a Warrior For Success in Life", 
    "price": "50.00", 
    "instructors": "Gregg Swanson", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822208_da93_3.jpg", 
    "course_url": "https://www.udemy.com/develop-the-mental-strength-of-a-warrior/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T19:32:20Z"
}