{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>***Updated For <strong>June </strong>2016***</em></strong></p>\n\n<p><strong>WARNING: CONSTANT ACTION REQUIRED! <br>This course is all about taking action! For each of the 15 days you will be outside doing challenges that will push you to become more fearless and less afraid of what people think.  You will be challenged every single day for the next 15 days. This course is certainly not for everyone!</strong><br></p>\n\n\n\n\n\n<p>If you are tired of being trapped in the fear of what other people think and you truly believe that you can be more then you need to take this course. All of the 15 challenges that I will ask you to do I have personally done myself. So I can tell you from experience that they work. Nobody starts life fearless, we all start afraid and scared about being judged by others. This is the most action oriented course I have ever created and I wholeheartedly believe that it is also one of my most important courses. </p>\n\n\n\n\n\n<p>I will tell you this right now, this course is not for everyone. Some people might find the course too extreme or too challenging. Others are simply too afraid to step outside their comfort zone. I did not make this course for those people. I made the course for you, the person that knows that they have within themselves the power to become more fearless and just need that extra push! It is for those few daring people who are willing to take a chance to better themselves even if it requires stepping out of their comfort zone.<br></p>\n\n\n\n\n\n<p><strong>Guarantee:\n By the end of this course you will become more fearless and care less about what people think of you. <br></strong></p>\n\n\n\n\n\n<p><strong>FREE BONUS INCLUDED WITH THIS COURSE: The Fear Mastery Journal</strong><br>As an additional\nbonus for taking this course you will also receive the Fear Mastery Journal which is a 25 page PDF that you can print out or read digitally that will serve as your companion on this journey. The Fear Mastery Journal was specifically created in order to help you destroy your fear!<br></p>\n\n\n\n\n\n<p><strong>Zero Risk</strong><br>There is a 30 day\nmoney back guarantee so you literally have no risk in taking this course.\nSeriously, the 30 refund is even done automatically so there is no hassle on your end.\nIf this course sounds like it is for you then give it a go! </p>\n\n\n\n\n\n<p><em>\"Thinking will not overcome fear but action will” </em>- W. Clement Stone</p>\n\n\n\n\n\n<p>I will see you\ninside if you are ready to conquer your fear! </p>\n\n\n\n\n\n<p><strong>Ben</strong></p>", 
    "end_date": null, 
    "title": "Fear Mastery: Become Fearless In 15 Days ", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/698136_f2aa_3.jpg", 
    "course_url": "https://www.udemy.com/fear-mastery-become-fearless-in-15-days/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-15T13:04:59Z"
}