{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Get Yourself Motivated is a method of <strong>self-coaching</strong> to help you explore your true and authentic motivations. With the insights gained, you will go on to transform your ability to make the things happen which you would like to have happen - whatever they may be.<br><br>If you ever ponder the question <strong>\"What would you like to have happen?\"</strong> about any aspect of your life then this course is for you. <br><br>The course is based on the pioneering work of David Grove who, whilst counselling people who had experienced trauma, realised that it's possible to gain access to our deepest, non-verbal feelings through <strong>interrogation of our metaphors</strong> and the symbols within them use in everyday language.<br><br>He developed a way of asking <strong>questions about the symbols</strong> we use which avoided any bias or assumptions being introduced into the process. This became known as Clean Language precisely because it does not permit any outside interference.<br><br>James Lawley and Penny Tompkins observed how David worked with symbols and codified his method into the technique we call <strong>Symbolic Modelling.</strong> In this course you will learn to ask yourself Clean Questions and to model the symbols which you uncover. In this way you will explore your own inner or what is often called, psychoactive landscape.<br><br>As you gain more insight, transformation will occur in your thinking and you will gain immense clarity into your ansers to the critically important opening question in Clean Language which is <strong>\"What would you like to have happen?\"</strong><br><br>You will be introduced to examples of the process in action from the key texts on the subject. This will give you a good feel for the way you can ask yourself theses questions and <strong>model your own dynamic thought processes</strong>. Along the way there will be quizzes to test your progress.<br><br>At any point if you get stuck you are free to use the <strong>Send Message</strong> feature and we will get you back on track.<br><br>Simply listen to the examples given which will take about 2 hours and complete the quizzes. After that it's about practice and experimentation. For some people the breakthrough is immediate but as a general rule after <strong>6 sessions of self-coaching something new and exciting will emerge.</strong><br><br>We look forward to working with you when you take this course.<br><br><br><br><br><br><br><br><br><br></p>", 
    "end_date": null, 
    "title": "Get Yourself Motivated", 
    "price": "20.00", 
    "instructors": "Peter Urey", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/656932_922b.jpg", 
    "course_url": "https://www.udemy.com/get-yourself-motivated/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-01T12:45:32Z"
}