{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em><strong>Note: </strong>Mid-year special: </em><em>enroll in this course, and lifetime access to the other two paid Action Courses <strong>free </strong>($49 Resolutions/goals course and $49 AntiStalkers anti-stalking course) via a coupon on J</em><em>uly 1.</em></p>    <p>  \t<strong>      The Motivation Course </strong>- a new online course providing a background in motivation.  When you are a student, you will learn more about how you are motivated, and understand many of the theories about motivational behavior.  </p>  <p>  \t<strong>  The three sections of this motivational course covers: </strong>  </p>  <ol>  \t<li>how our bodies work in terms of motivation (biology),</li>  \t<li> the theories (including Maslow's hierarchy of needs theory), </li>  \t<li>and ways in which we can improve and maintain motivation (tools).</li>  </ol>  <p>  \t            There are short fun quizzes to help you test your knowledge, and to reinforce your learning.  </p>  <p>  \t<strong><em>Updated with bonus material in Feb. 2015 - more bonuses being added, including in April &amp; May! </em></strong>  </p>  <p>  \t    When you take this course, a lasting benefit you can get includes an increased awareness of your motivation.  Simply being more aware can make you make small changes to increase your motivation every day.  Along with awareness comes more knowledge about how motivation actually works - or doesn't - and the tools you can use to keep motivated!  </p>  <p>  \t            You get lifetime access to the course, and regular updates are included.  Enroll now before the next price increase.<strong><em>  See you inside the course! </em></strong>  </p>", 
    "end_date": null, 
    "title": "Get Motivated, Learn Motivational Theory and Find Happiness!", 
    "price": "20.00", 
    "instructors": "Action Courses", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381896_a836_4.jpg", 
    "course_url": "https://www.udemy.com/motivation-course-get-motivated-learn-motivational-theory-maslow-brain/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-01T00:37:49Z"
}