{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em>Setting Goals for Personal and Career Success: Achieve Your Goals and Change Your Life </em>includes all you need to know to set goals based on your life values and do so that you become unstoppable in your pursuit of the life you want. It can be about <strong>life goals</strong> or <strong>career goals</strong>.<br></p><p>OVER 1,000 STUDENTS HAVE ALREADY ENROLLED IN THIS COURSE!<br></p>  <p>  \t      This course will provide you a system for organizing time, <em><strong>goal setting</strong></em> &amp; personal objectives constructed around annual goals. A good system of organization does not guarantee success, unless you also work to transform it into reality. With this course in your hand, the most thrilling part of writing your own eality is just about to start.</p>  <p>  \t      A year, with its 365 days, is an elementary unit of time in our lives - after all, we “measure\" our age in years - therefore, I chose the year as the core of my system of transforming objectives into reality. And as the core of the course<em> is the short goal-setting system transformation into long term fulfillment of lufe and career goals.</em></p>  <p>  \t      You will learn </p><ul><li>how to find your personal mission that will discover ...</li><li>how to set <strong>goals that stick</strong> &amp; will show you ...</li><li>how to write your own story that will in the end help you...</li><li>how to achieve goals more quickly than ever thought possible by making them impossible to miss. </li><li>the improved SMART system to use in career &amp; set yourself up for success</li></ul><p>A productivity mastery it will teach you how to change the way you organize your life and career goals in order to get things done and become successful.</p>  <p>  \t      Good. Let`s start your story.  </p>  <p>  \tAnd - like always - the <strong>never any questions asked 30 day money-back-in-full guarantee</strong> is not just a guarantee. </p><p>It is my personal promise to you that you will succeed ... <strong>just like my thousands other Udemy students.</strong>  </p><p><strong>Thank you for reading this and learning about my course</strong> ... I hope what I will teach you when you will start the course will help you make a huge performance leap! <strong>Click now on TAKE THIS COURSE</strong> to get started!<span></span></p>", 
    "end_date": null, 
    "title": "Goal Setting 2016 Masterclass", 
    "price": "20.00", 
    "instructors": "Florin Rosoga", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/150562_be2e_8.jpg", 
    "course_url": "https://www.udemy.com/1-year-checklist/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-22T04:34:08Z"
}