{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Goal Setting : It is time to set goals you can FOLLOW</strong><strong></strong></p><p>  \t        FORGET ABOUT NEW YEAR'S RESOLUTIONS. They never work !  </p>  <p>  \t                    Let's be honest.  </p>  <p>  \t                    You started this week (or month or year) with very good intentions.  </p>  <p>  \t                    You were going to lose weight, write that book, start that blog and move to paradise.  </p>  <p>  \t                    B-u-t, things have not exactly panned out have they ?  </p>  <p>  \t                    Alright, let's not put ourselves in self-pity prison.  </p>  <p>  \t<strong><em>IT IS FINALLY TIME.</em></strong>  </p>  <p>  \t                    <strong>Time to set realistic and doable goals and passionately follow through with them. </strong>  </p>  <p>In this course, you will learn :</p>  <ul>  \t<li>The secrets of high-achieving people who seem to never miss a beat (and how you can become like them)</li>  \t<li>Why your goals SHOULD NOT be about you &amp; how that will move you faster towards you actually getting things done</li>  \t<li>A simple system that allows you to break down your goals into digestible, actionable steps so that you don't get overwhelmed.</li>  \t<li>Practical strategies to help you FOCUS on accomplishing what matters to you the most. </li>  </ul>  <p>  \t<em>Also included ...</em>  </p>  <p>  \t<strong>A work-book you can print out so you can follow along closely as you go through the video presentations (you can even create a binder to keep track of what you've written and revisit it as and when you need to) + I will be available via the Discussions Section to encourage, motivate and answer any questions you may have.</strong>  </p>  <p>  \t                    I invite you, my friend, to click on the \"Take this Course\" button up there so I can help you finally get \"it\" done.  </p>  <p>  \t<strong>P.S</strong>  </p>  <p>  \t                    There's a 30-day money-back guarantee. So you can take the WHOLE course and ask for your money back and we'll still be friends. It's a WIN-WIN, really.  </p>  <p>  \t<em><strong>* Even if you don't take this course, the accompanying workbook is yours free to keep. Go ahead and download it from the course dashboard.* </strong></em>  </p>  <p>  \t<strong>P.P.S</strong>  </p>  <p>  \t                  I will be adding fresh and exciting content and updates from time to time at no extra charge. Watch out for them.  </p>", 
    "end_date": null, 
    "title": "Goal Setting : It is time to set goals you can FOLLOW", 
    "price": "20.00", 
    "instructors": "Gertrude Nonterah", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/357744_1d31_2.jpg", 
    "course_url": "https://www.udemy.com/quash-your-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-27T12:52:53Z"
}