{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong style=\"\">  OVER 900 SATISFIED STUDENTS HAVE TAKEN THIS COURSE </strong>(Verified)  </p>  <p>  \t                  ----------------------  </p>  <p>  \t<strong style=\"\">  OVER TWO-DOZEN POSITIVE STAR REVIEWS</strong>   </p>  <p>  \t                  ----------------------  </p>  <p>  \t<strong style=\"\">  30 DAYS MONEY BACK GUARANTEE (NO QUESTIONS ASKED</strong><strong style=\"\">)</strong>  </p>  <p>  \t----------------------<br style=\"\">  \t<strong style=\"\"></strong><strong style=\"\">Closed captioning enabled </strong>  </p>  <p>  \t                  ---------------------------------------------------------------------------------------------------------------------  </p>  <p>  \t                              There are two groups of people in the world. One group spends most of their lives struggling to earn a living, and the second much smaller group seem to have everything going their way. Instead of just earning a living, they are working at building and enjoying a fortune. Everything just seems to work out for them. And here sits the much larger group, wondering how life can be so unfair, so complicated and unjust. What&#039;s the major difference between the little group with so much and the larger group with so little?  </p>  <p>  \t                              Despite all of the factors that affect our lives; the country we were born in, the schools we attended, the amount of support we got from our family, none has as much potential power for affecting our futures as our ability to set clearly defined goals  </p>  <p>  \t                              In order to fully utilize the powers in setting goals, you must first truly understand the purpose of a goal and the mechanism that gives a goal such a great pull on our future.  </p>  <p>  \t                              This course will teach you the ancient truth of goal setting. Why and how it works. Understanding of the knowledge of goal setting will unleash a creative force that will enable you design the life you have always dreamed of. The practice of goal-setting is not just helpful; it is a prerequisite for happiness.  </p>  <p>  \t              ----------------------------------------------------------------------------------------------------------------  </p>  <p>  \t<strong style=\"\">See you in class,</strong>  </p>  <p>  \t<strong style=\"\">                - O</strong>  </p>", 
    "end_date": null, 
    "title": "Goal setting ultimate guide", 
    "price": "20.00", 
    "instructors": "Osamede Arhunmwunde", 
    "commitment": "28 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312564_3ea3_4.jpg", 
    "course_url": "https://www.udemy.com/life-by-design/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T01:13:36Z"
}