{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Middle school and high school are the toughest times in a child's life. It's that crucial time when they discover who they are and what they're meant to do with their lives... or succumb to peer pressure, stress, and low self-esteem that sets them up for failure in the future.</p><p> </p><p>But this is where we can help out. This course will take your 12-17 year-old by the hand, guide them, inspire them, and show them how to not just graduate, but to GRADUATE 2 GR8NESS!</p><p> </p><p> Imagine your teen:</p><p> </p><p>- Conquering their fears</p><p> - Developing unbreakable self-esteem</p><p>- Growing up to be strong, confident, and happy</p><p>- Becoming skilled, hardworking, and likeable</p><p>- Inspiring people wherever they go</p><p> - Developing a winning attitude that's second-nature to them</p><p> - And so much more</p><p> </p><p> That's precisely what this course will do for them.</p><p> </p><p>My name is Eric Bailey, the coursemaster. I'm an Activational speaker and mentor who primarily coaches businesspeople, corporations, and entrepreneurs. Now, I'm adapting the same principles that inspire greatness in HUGE corporations... into this high-energy, motivational course for our teenagers: Our future.</p><p> </p><p> GRADUATE 2 GR8NESS is a 52-week Youth mentoring course that helps teenagers DISCOVER their gifts, DEVELOP their strengths, and DELIVER their talents to the world after graduation. The course is full of fun, eye-opening, inspiring activities:</p><p> </p><p> - Inspirational videos</p><p> - Interactive worksheets</p><p> - Eye-opening quizzes</p><p> - In-depth, insightful books</p><p>- Enjoyable podcasts</p><p> - The Global audio hit program for teens, <i>All Good From The Hood</i></p><p> - Special eBooks and audio downloads for teachers and parents</p><p> - A special video: <i>Eric Bailey Live On Stage</i></p><p>- Live Q&amp;A's with youth coach Eric Bailey himself</p><p>- And many more enjoyable activities!</p><p> </p><p>Best of all, GRADUATE 2 GR8NESS is an investment that will set you back <b>less than $2 a week.</b> Enroll your teen now, and watch them rise to greatness – one week at a time!</p>", 
    "end_date": null, 
    "title": "GRADUATE 2 GR8NESS", 
    "price": "50.00", 
    "instructors": "Eric Bailey", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499598_c100_5.jpg", 
    "course_url": "https://www.udemy.com/empowering-teens-to-achieve-gr8ness/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T02:59:09Z"
}