{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course talks about perfection, but not in a way that you can't get there. If you've ever tried to be perfect you know it's the most difficult job in the world, because once you think you arrive at perfection, it's seems like something is missing, and so there we are, off running down the road to next goal or thing that we feel we need in our life that will make it so perfect.</p><p>My name is Paul and i teach the lectures in bite-sized chunks to make the information in the course easy to listen and digest and enjoyable at the same time, but i teach in a style that just tells it as it is. No info overload, take what you need, move on to the next lecture.</p><p>The lectures are all downloadable in MP3 where you can listen to them in your own time and when it suits you.</p><p><strong>Here's what's covered in the course:</strong></p><p>1. Introduction. 2. The Definition Of Perfection. 3. False Comparisons. 4. Make It Easy On Yourself. 5. Will The Real You Please Stand Up? 6 Closing Thoughts.</p><p>In the course i talk about what perfection is and what it isn't, and by changing our view or opinion or perspective about perfection and how it can help us improve our lives all by making a few simple adjustments on the inside that will show up in our daily living.</p><p>If you're the kind of person that feels that you should be further down the road than you are at the moment, or you want to make progress but are fed up with every kind of goal setting technique being thrown in your face but still not helping you, then i would highly recommend signing up for this course.</p><p>Don't forget there's the Udemy 30 day, money-back guarantee if it doesn't do what it says on the tin.</p><p>Hope to see you on the inside! But if it's not for you i do hope you find what you're looking for somewhere else very soon.</p>", 
    "end_date": null, 
    "title": "Help! I'm Not Perfect!", 
    "price": "20.00", 
    "instructors": "Paul Fryatt", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/542872_333c_2.jpg", 
    "course_url": "https://www.udemy.com/help-im-not-perfect/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T07:14:49Z"
}