{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>Where Are You Going? Are you living your life on autopilot or do you want to set the intention and goal to where you want to go?</em></strong></p><p>If you listened to the first course we taught you in how to create and maintain a positive vibration. I took so much time to train you on how to do this because you absolutely <strong>MUST</strong> be in your happy place before you even think about setting an intention or creating goals.</p><p>If you started a journey with no directions and only a vague idea of where you wanted to get to… You’d probably wander around aimlessly… Think about the time wasted, the frustration… Imagine how much LONGER it would take you to reach your destination if your weren’t even sure where you were going… Yet this is how many of us live our lives… And it’s just not worth it!</p><p>Just the same as let’s say you have an appointment on the other side of town, at a location you’d never been to before… And you get into your car without any directions on how to get there… What are the chances that you’d arrive at your destination on time, if at all? Pretty much zero, right?</p><p><strong>What’s the solution to living life on auto-pilot without any goals?</strong></p><p>Before you do anything else, pinpoint the things about your life that you already know you want to change. Yet even if you know what you want to do, getting there without any directions is needlessly hard.</p><p>Without a plan, you’ll most likely spend so much precious time wandering through life… not feeling happy or fulfilled… and really truly wanting something different…. but not knowing how to make that happen. Don’t worry, today we’ll get clear on what you really want, and then comes the exciting part. Yep, then we’ll develop your whole strategy, together.</p><p>You should act on your feelings of love, hope, and faith to take this course now if you want to learn valuable skills to use in your own life and start achieving your goals and purpose!<br></p>", 
    "end_date": null, 
    "title": "How to Set Powerful Intentions and Clear Goals", 
    "price": "35.00", 
    "instructors": "Scott Paton, Louise Armstrong", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/683830_3a9f_2.jpg", 
    "course_url": "https://www.udemy.com/motivation-intention-goals/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-29T04:15:14Z"
}