{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">Is it possible that there are no accidents and coincidences in the universe? That you&#039;re given just what you need...right when you need it?</em></strong>  </p>  <p style=\"\">  \t <br style=\"\">  \t <strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">This course is for you if you have experienced or are experiencing any of the following:</em></strong>  </p>  <p style=\"\">  \t<strong style=\"\"><em style=\"\">-</em>You feel a longing within you to serve in a significant way</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You are unsatisfied with your current job or career path </strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You want closer more fulfilling relationships </strong>  </p>  <p style=\"\">  \t<strong style=\"\">-Your ready for a change in your current lifestyle<br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You have goals and dreams but don&#039;t know how to make them a reality</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You feel stuck where you are and aren&#039;t sure how to break through the obstacles <br style=\"\">  \t</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You don&#039;t have as much money as you would like to accomplish what you desire</strong>  </p>  <p style=\"\">  \t<strong style=\"\">-You feel overworked, undervalued, and are ready to experience a profound change</strong>  </p>  <p style=\"\">  \t<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t        According to a scientific study conducted at the <a href=\"http://www.sciencedaily.com/releases/2009/06/090615144207.htm\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Rush University Medical Center</a>, discovering and following  a greater purpose in life is associated with lower mortality  rates. This is just one study amongst thousands of others that show how  knowing and participating in your purpose/destiny can eliminate  depression, anxiety, and an unsatisfactory lifestyle.  </p>  <p style=\"\">  \t        In this course you will learn how to easily and effortlessly discover and fulfill your destiny. You will be taught specific tools and techniques to discover and align with your purpose,  manifest your desires, and become at peace with who you truly are --an amazing spiritual being. The course includes integrative meditations which bring together relaxing visuals, affirmations, and on screen guidance. These meditations give you the opportunity to relax very deeply and helps to alter negative subconscious beliefs. The back bone of this course incorporates a spiritual outlook on The Law of Attraction that guides you to attract and bring about what you truly want. This course is recommended to be taken  as a 12 week course, with each lesson taking about a week to complete. However, it is only a recommendation and the course can be completed at your own pace.  </p>  <p style=\"\">  \t <em style=\"\">Each lesson contains:</em>  </p>  <p style=\"\">  \t<em style=\"\"> -A 10-20 minute spoken lesson designed to introduce and simplify the main topic.</em>  </p>  <p style=\"\">  \t<em style=\"\"> -A creative workbook to enhance your experience of the lessons topic. The workbook gives you the opportunity to experience the lesson firsthand with powerful questions and activities.</em>  </p>  <p style=\"\">  \t<em style=\"\"> -An Integrative Meditation to guide you into relaxation and inner calm.  While in a relaxed state, you will affirm the information you learned so your subconscious can begin to change it&#039;s negative belief patterns.</em>  </p>  <p style=\"\">  \t        I invite you to consider how this course could change your experience of  life and the understanding of who you truly are.  </p>  <p style=\"\">  \t<strong style=\"\">Why Is It Important To Discover and Fulfill My Destiny? </strong>  </p>  <p style=\"\">  \t        All we ever have is the present moment. We no longer have yesterday and the future is but a glimmer of maybes and what if&#039;s. There is more to life than the everyday routines and the conditioned behavior patterns within you. There are powerful aspects of yourself that give you the opportunity to express your role as a creator in your own life. By taking the first step to discover and fulfill your destiny you are making a statement to the universe that your ready for a change. This one step can make a substantial difference in your lifelong happiness levels, the kind of happiness that comes from within and is unlimited and infinite.  </p>", 
    "end_date": null, 
    "title": "How To Discover and Fulfill Your Destiny", 
    "price": "20.00", 
    "instructors": "Amie Lynn Escher", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66085_5275_9.jpg", 
    "course_url": "https://www.udemy.com/discover-and-fulfill-your-destiny/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-16T21:31:15Z"
}