{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Even if you love your work, career check ups – just like medical check ups – can be hugely beneficial as they can periodically allow you to take on new exciting challenges to keep you growing, avoiding stagnation and staying stimulated, motivated and fulfilled.</p><p>Perhaps you have a great job, others think so too and you get paid well. You are ‘successful' but are starting to get a sense you aren't as happy and fulfilled by your work as you have been in the past. The challenge has gone out of it, your work needs a little revitalisation, or maybe even a complete make-over. Either way, you are after something more. But frustratingly you're not sure what that something is. This is all very normal!</p><p>In a constantly changing economy and work world, leaving your career to fate may not be doing yourself any favours. The good news is you can do something about it starting today! </p><p>No matter how much you currently enjoy your work, proactive career planning:</p><ul><li>Benchmarks your current work fulfillment</li><li>Helps make you even more aware of who you are and what you want</li><li>Puts you back in the 'driver's seat' and helps you make more informed decisions about your future</li><li>Allows you to feel more in control of maximising your work potential and meaning.</li></ul><p>Let’s face it, you spend around a third of your life working. That’s a long time, so why wouldn’t you want to make sure that you enjoy what you do at work as much as possible?</p><p>Successful people fast-track their future by being proactive about their job fulfilment and career planning. </p><p>Why not get started by seeing how fulfilled you are and what you can do to quickly improve it?<br></p><p><em><br></em></p><p><em>Copyright - Please note all video content and downloadable worksheets provided in this course are for single print &amp; individual use only.</em><br></p><p><em><br></em></p>", 
    "end_date": null, 
    "title": "How To Be More Satisfied At Work", 
    "price": "40.00", 
    "instructors": "Ian Hutchinson", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/655912_cbdc_7.jpg", 
    "course_url": "https://www.udemy.com/job-fulfilment/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-30T22:19:55Z"
}