{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>⇉ Watch the promo video to see How To Achieve Any Goal In Life Using These Secret Formulas!</strong><br></p>\n\n<p><strong>⇉ Join Over 100,000+ Students</strong> Who Have Enrolled In My Udemy Courses This Year!</p>\n\n\n\n<p><strong>⇉ 2500+ Five Star Reviews </strong>Shows Students Who Enrolling Are Getting Real Results!</p>\n\n\n\n<p><strong>⇉ This course is MASSIVE!</strong> You receive Over 50+ Lectures and 3+ hours of HD content!</p>\n\n\n\n<p>Would you like to improve your results and instantly start achieving your goals? </p>\n\n\n\n<p>Or perhaps develop better strategies for receiving the things you desire most? </p>\n\n\n\n<p>Then this course is for you!<strong> Click \"Take This Course Now\" For Instant Life-Time Access!</strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>Student Success Testimonials! </strong></p>\n\n\n\n<p><strong>\"I Know What This Course Teaches Is True-I've Proven It-Before Taking The Course</strong></p>\n\n\n\n<p>A number of years ago I decided on a goal. I would say the thing that took the longest for me was \"authentically\" deciding on what goal it was I wanted to achieve. I didn't start on the road to my goal until I felt I wanted to achieve this goal in every cell of my body; that I was convinced this is what I wanted. Then I started in the direction of my goal but I didn't really know what I was doing. I just started with simple little actions and after awhile things just started showing up in my life which took me to the next step/level and to the next. My goal was to start my own business and from the time I started taking action it took me two years to build a business that literally exploded. In taking this course I've now learned \"retroactively\" exactly what steps I unknowingly took to build my business. I did everything this course teaches and my business is proof that it works. And now I'm grateful to the instructor has shown me exactly what I did \"instinctively\" at the time to become a successful entrepreneur. I highly, HIGHLY recommend this course. Just remember...you HAVE to really want what you WANT! It's my experience that knowing what you want to achieve is literally the juice that will fuel the achievement of your goal. \" -Ellie Hud </p>\n\n\n\n<p><strong>\"</strong><strong>Wow, I can't wait to start setting my goals!</strong></p>\n\n\n\n<p>This course really opened my eyes, and I now understand the importance of setting goals to achieve them, what I learned in this course was not taught in business school even with my MBA . I knew to set goals but 95% of the time never achieved those goals. I am confident that I can now set and achieve goals using the formulas taught in this course. I can't wait to accomplish my first goal and share my success on the discussion forum. Thank for a well planned and well delivered useful course on goal setting.\" -Oluseyi Omitoogun</p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><strong>The Benefits You Will Gain From This Course Are Endless!</strong></p>\n\n\n\n<p>My goal for you in this course is to give you the understanding of how to achieve any goal you desire using these secret formulas!  </p>\n\n\n\n<p>I show you throughout this course how we use these formulas through a series of strategies and techniques to achieve real results.</p>\n\n\n\n<p><strong>You Will Learn:</strong></p>\n\n\n\n<ul><li><strong>Two Secret Goal Setting Formulas To Help You Achieve Any Goal In Your Life! </strong></li><li><strong>How To Not Just \"Set Your Goals\" But Actually Achieve Your Goals! </strong></li><li><strong>Understand The Psychology of Goal Achieving </strong></li><li><strong>Learn Natural Laws of The Universe To Accelerate Your Results!  </strong></li><li><strong>Engaging Lectures Shot From All Around The World Using Professional Cameras! </strong></li><li><strong>Free Coaching From Me Personally! </strong></li><li><strong>And so much more!!</strong></li></ul>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p>With the right mindset, understanding, and application of the teachings in this course, you will instantly begin to move towards achieving your goals! </p>\n\n\n\n<p>When I learn something new about goal achieving, I add it to the course <strong>-at no additional cost to you!</strong> This is a course that will continue to add more and more to every aspect of your life.</p>\n\n\n\n<p><strong>In addition to the Udemy 30-day money back guarantee, you have my personal guarantee that you will love what you learn in this course.</strong></p>\n\n\n\n<p>__________________________________________________________________________</p>\n\n\n\n<p><em>What I can't do in this Course..</em></p>\n\n\n\n<p><em>I can't guarantee your success – this course does take work on your part. But it can be done!</em> </p>\n\n\n\n<p><em>I am also not responsible for your actions. You are responsible for 100% of the decisions and actions you make while using this course.</em></p>\n\n\n\n<p><em>__________________________________________________________________________</em></p>\n\n\n\n<p><strong>This course will not remain this price forever! It's time to take action!</strong></p>\n\n\n\n<p>Click the <strong>\"take this course\"</strong> button at the top right now!</p>\n\n\n\n<p><strong>...<em>every hour you delay is costing you money</em>...</strong></p>\n\n\n\n<p>See you in the course!</p>\n\n\n\n<p>Joe Parys</p>", 
    "end_date": null, 
    "title": "How To Achieve Any Goal In Life Using These Secret Formulas!", 
    "price": "30.00", 
    "instructors": "Joe Parys", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/541192_c666_3.jpg", 
    "course_url": "https://www.udemy.com/goalachieved/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-30T13:02:40Z"
}