{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong></strong></em></p>\n\n<p>Hypnosis for to Discover your passion with Guided Hypnosis <br></p><p>was created to give you an excellent experience of what a private hypnosis session with me is like </p>\n\n<p><strong>   </strong></p>\n\n<p>So If you have ever wondered what you really love to do and what you would be truly passionate about. This hypnosis course will help you discover just that by using Hypnosis to tune into the hidden depths of your mind and character where all you major decisions are made to make you feel great, make you laugh or even just to choose the food you enjoy the most.</p>\n\n\n\n<p>then by using Hypnosis natures gift of been able to relax mind and body so that you can focus in like a laser and discover your true passion.</p>\n\n\n\n<p><strong>What I will teach you in this course to discover you true passion in life</strong></p>\n\n\n\n<p>with Hypnosis for to Discover your passion with Guided Hypnosis </p>\n\n<p> 1. You will begin by creating an image in your mind of what you want so that you will know where you are going by having a destination to reach by engaging in your passion.</p>\n\n\n\n<p>2. Learn a secret feel good trigger that will help you through any bad times or set backs on your way.</p>\n\n\n\n<p>3. learn how your mind and body work together with some fun but important lessons that will improve the results of this hypnotherapy session.</p>\n\n\n\n<p>4. Learn how you naturally resist changes even changes that can be very good for you</p>\n\n\n\n<p>5. Learn just how powerful words can be and their effect on you physically even if they are only self talk.</p>\n\n\n\n<p>6. Learn who can and cannot be hypnotized</p>\n\n\n\n<p>7. Learn how you can feel amazing any time you want to</p>\n\n\n\n<p>8. Hypnosis course bonus section with 3 mp3 extra hypnosis session</p>\n\n\n\n<p>A.  Find Your Passion Hypnosis</p>\n\n\n\n<p>B.  Being more assertive Hypnosis</p>\n\n\n\n<p>C.  Creativity Hypnosis</p>\n\n\n\n<p>9. How to use and apply EFT in the bonus section an amazingly powerful technique that can eliminate any limiting bad feelings that have been stopping you from doing what you need to do to enjoy your passion.</p>\n\n\n\n<p><strong>All Files and videos are downloadable for easier access</strong></p>", 
    "end_date": null, 
    "title": "Hypnosis for to Discover your passion with Guided Hypnosis", 
    "price": "20.00", 
    "instructors": "Alan Kirwan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/434004_de11_4.jpg", 
    "course_url": "https://www.udemy.com/discover-your-passion-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T11:44:12Z"
}