{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul style=\"\">  \t<li style=\"\"><em style=\"\">¿Estás cansado o cansada de fijarte objetivos después de vacaciones y abandonarlos a mitad de camino?</em></li>  \t<li style=\"\"><em style=\"\">¿Sueles hacer la famosa lista de grandes propósitos de Año Nuevo pero nunca la cumples?</em></li>  \t<li style=\"\"><em style=\"\">¿Te fastidia darte cuenta de que te propones y comienzas muchas cosas pero no las terminas?</em></li>  \t<li style=\"\"><em style=\"\">¿Dejas tus propósitos a mitad, por imposibles?</em></li>  \t<p style=\"\">  \t\t  Si has respondido que sí a alguna de esas preguntas, ten por seguro que tienes la voluntad y la energía, pero quizá te hace falta un poco de estructura. ¡Nada más!  \t</p>  \t<p style=\"\">  \t\t<em style=\"\"><strong style=\"\">Identifica y Define tus Objetivos</strong></em> surgió de la necesidad de profundizar más en el tema de los Objetivos y ha sido inspirado por mi Curso anterior <strong style=\"\"><em style=\"\">Cápsulas End2End Coaching para el Éxito</em></strong>. Lo he diseñado expresamente como continuación de las Cápsulas y, aunque pasar el primer curso no es condición <em style=\"\">sine quanon</em>, sí es altamente recomendable.  \t</p>  \t<p style=\"\">  \t\t   Este Curso te da la claves para diseñar unos Objetivos de alta calidad mediante el <strong style=\"\"><em style=\"\">Modelo End2End de Fijación de Objetivos</em></strong>, que he diseñado también a propósito de este curso. Mediante el<em style=\"\"> Modelo E2E</em>, comprenderás el valor incalculable que reside en una correcta y detallada fijación de objetivos, entenderás la importancia de la coherencia entre tus objetivos y tu escala de valores, y aprenderás cómo establecer unos objetivos con alta, si no garantizada, probabilidad de éxito.  \t</p>  \t<p style=\"\">  \t\t   ....si quieres asumir la responsabilidad de tu vida y de tu trayecto para alcanzar el éxito, yo te doy la estructura y el conocimiento. Tú pones el aprendizaje y el compromiso.  \t</p>  \t<p style=\"\">  \t\t <em style=\"\"><strong style=\"\">El Éxito es el logro de una serie de objetivos bien estructurados y definidos cuya conjunción resulte en tu anteproyecto hecho realidad.</strong></em>  \t</p>  \t<p style=\"\">  \t\t<em style=\"\">(Visita también el Curso <strong style=\"\"><a href=\"https://www.udemy.com/capsulas-end2end-coaching-para-el-exito\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Cápsulas End2End Coaching para el Éxito</a>,</strong> en el que te proporciono las claves para identificar tu concepto del éxito, cómo ser una persona proactiva y tomar las riendas de tu vida sin &quot;peros&quot;, y conocer en profundidad todas esas barreras que nos ponemos y que nos limitan de forma dañina a la hora de intentar alcanzar lo que queremos).</em>  \t</p>  \t<p style=\"\">  \t\t  Haz click en cualquiera de las clases abajo si quieres <strong style=\"\">más detalles sobre el contenido del curso. </strong>  \t</p>  \t<p style=\"\">  \t\t<a href=\"http://end2endcoaching.es\" target=\"_blank\" class=\"external-link\" rel=\"nofollow noreferrer\" style=\"\">Visita End2EndCoaching &amp; Development para conocernos mejor.</a>  \t</p>  </ul>", 
    "end_date": null, 
    "title": "Identifica y Define Tus Objetivos", 
    "price": "30.00", 
    "instructors": "Esther Roche - Polo", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/85652_0eab_6.jpg", 
    "course_url": "https://www.udemy.com/identifica-y-define-tus-objetivos/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-29T18:01:42Z"
}