{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Any Coach, Counsellor, Therapist or Psychology Student will benefit from watching and learning the coaching processes in this course.</p><p>The course provides you with 4 very powerful personal growth tools to identify your personal values and anti-values. These tools are designed to slow down the thinking process. This helps you to increase wisdom about your past and present behaviours, choices or decisions. You will never have to make another New Years Resolution! Instead you will be able to choose a direction forward that is energised by your own personal values. </p>The teaching is done with a live example of a coach and client working through the five step process. This process also lets you see how a coach works with people and how listening skills are employed to help a person hear themselves more clearly.<p>1. The first step maps your history to identify meanings of significant events. This process gives us a list of personal values and anti-values to work with.</p><p>2. The second step is to prioritise the values according to personal importance and benefit. This is done with a simple and deliberate set of questions which compares each value to the other.</p><p>3. The third step is similar to step two but focuses on the anti-values and how strongly your reaction is when these things happen.</p><p>4. Fourthly, the next tool creates a values driven set of goals and aspirations. This is where the strength, motivation and confidence will come from to accomplish your goals.</p><p>5. The final step of the course turns to providing a micro-strategy template for designing a practical strategy which you can implement to accomplish each chosen goal.</p><p>Worksheets are provided for each process with instructions. After you have seen the process demonstrated live you will be able to use the tools over and over again in your own personal way. </p><p>Anyone who is frustrated with making goals and then losing momentum  will benefit from this course.</p><p>Personal transformation does not happen in two days. Personal growth occurs in a deliberate strategic day by day manner. A person can only <strong>Live Stronger when who you are is underwriting what you want to do.</strong> This course will deepen your understanding of yourself and clarify what direction you will want to take in the future. </p>", 
    "end_date": null, 
    "title": "Live Stronger: Values Driven Action Plan", 
    "price": "50.00", 
    "instructors": "Bill Schuilenberg, RPC, MPCC, MAC", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/678498_3f00_5.jpg", 
    "course_url": "https://www.udemy.com/live-stronger-values-driven-action-plan/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-23T19:08:57Z"
}