{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<em>Most recent update: December, 2015. </em>  </p>  <p>  \t    <strong>Do you want to see your wishes come true?</strong> </p><p>Is it really possible to manifest our dreams?  <strong>YES IT IS!</strong> And is it true that certain techniques like <strong><em>The Vision</em></strong> work on your behalf? </p><p>There are tons of testimonies that proof it and I invite you to listen to some <strong>right NOW in Lecture 24!</strong> But just to mention a few real life examples of what some people have achieved with this technique:</p>  <p>  \t           •Finding an apartment in almost impossible circumstances.  </p>  <p>  \t         •Settling a wonderful loving relationship; a real life love story!  </p>  <p>  \t         •Getting the car of his dreams.  </p>  <p>  \t         •Receiving the money needed to buy a house.  </p>  <p>  \t         •Getting to travel around the world with a tight budget.  </p>  <p>  \t         •Having important projects approved.  </p>  <p>  \t         •Achieving a desired outcome in very difficult circumstances.  </p>  <p>  \t         •Healing from an illness.  </p>  <p>  \t           All these real life examples were conquered through the use of this easy to learn technique called <strong>The Vision Board, </strong>originally known as<strong> \"The Treasure Map\".</strong></p><p>It' an easy to make highly powerful technique to attract into your life your wishes and goals. In this course I will guide you through simple steps to build your own Vision board and empower it! </p>  <p>  \t<strong></strong>     I’m not into promising miracles, magic potions or an “immediate result pill” to take advantage of your desire to meet your wishes and life objectives. So if you are pursuing that fantasy, then this course is not for you. But <em><strong>if you are looking for a practical down to earth guide to help you meet your goals and conquer your dreams within a realistic scenario, then you’ve come to right place! </strong></em>  </p>  <p>  \t<em><strong></strong></em>    As mentioned in the promotional video, <em><strong>The Treasure Map or Vision Board</strong></em> is a technique from <strong><em>The Treasure Series</em></strong>, a “golden chest” not filled with gold, but rather with <em><strong>amazing practical highly effective techniques, all easy to learn and apply, and with the core purpose of procuring people their integral wellbeing, peace and joy.</strong></em> </p><p>I created <strong><em>The Treasure Series </em></strong>based on my more than 20 years of professional and personal experience of research, study and serious practice of the teachings from The New Thought Philosophy and Transpersonal Psychology.  </p>  <p>  \t             I invite you to take the step forward and towards reaching the top of the mountain… and contemplate the beauty of the valley, just as the little worm in the inspirational story <strong><em>“The Power of a Dream”</em></strong>, which you can also listen to right now in Lecture 23.  </p>  <p>  \t  <strong>SEIZE THE OPPORTUNITY NOW!!! </strong> </p>  <p>It's my pleasure and honour to be your Personal Coach!  </p>  <p>  \t           WELCOME!  </p>", 
    "end_date": null, 
    "title": "Make a Powerful Vision Board and Attract What You Want!", 
    "price": "20.00", 
    "instructors": "Gisela Echeverría G.", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381730_c48d_5.jpg", 
    "course_url": "https://www.udemy.com/create-your-own-treasure-map-and-manifest-your-desires/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T18:52:09Z"
}