{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>I have over 1800 students from 99 countries on Udemy.</strong></p><p>What are the secrets of most successful people in any field? Do you think they have not had any failures in life, did they not feel low or down at any point in life? What did they do? How did they sustain the motivation and drive to achieve what they wanted in life? I have shared the secrets to motivation and inspiration in this course. In this course, you are not just going to learn theory, you will receive methods and tools which you can apply systematically and get and stay motivated in life!</p><p><strong>29 lectures, 9 assignments, 9 quizzes, exclusive Energizers and a Guided Meditation for internalization!</strong></p><p>I have included 9 assignments for you to apply your learning. I have included 9 quizzes to make learning fun for you :) So while you will learn some tools they teach in B schools, you will also be able to have a hands on experience in applying methods to have that awesome motivation!</p><p>I have over 21 years of diverse experience, in coaching/ training/ leading/ management/ strategic planning, creativity &amp; innovation, stress management and happiness coaching in large corporations as well as on individual level. I have received several awards in the corporate world for institutionalizing innovation, handling big teams and leading complex programs. I have done MBA from one of the top B schools in India. I am also PMP certified.</p><p>I am excited to share with you some secrets of motivation. This course covers 10 point motivation model to get motivated and achieve goals in any area of life! I look forward to taking this exciting journey with you!<br></p><p><strong>What are the requirements?</strong></p><ul><li>Pen, paper, markers, sticky notes</li><li>MS Office installed on your PC/ laptop for some exercises</li><li>Open mind, drive to learn, assimilate and put to use techniques in the course</li><li>Commitment, sincerity and patience to practice and perfect the techniques learnt in the course </li></ul><p><strong>What am I going to get from this course?: </strong><strong>At the end of the course you will be able to</strong></p><ul><li>Inspire and Motivate yourself and others</li><li>Identify and use intrinsic drivers and extrinsic drives to be self-inspired or self-motivated</li><li>Battle procrastination and win victory over it</li><li>Achieve your goals in financial, emotional, health, relationship areas</li><li>Handle challenging situations and come out as a winner</li><li>Increase your energy, enthusiasm, will power, efficiency and productivity</li><li>Apply a pioneering 10 point motivation model and Transform yourself to gallop towards success</li><li>Lead people by inspiring and influencing them</li><li>Get fully recharged, ready to take on life</li></ul><p><strong>What is the target audience?</strong></p><p><strong></strong><strong>Course should be taken by anyone who</strong></p><p><span></span></p><ul><li>is looking for maximizing his/ her potential of becoming his/ her best</li><li>is lazy or has a habit of procrastinating or lacks motivation</li><li>has a habit of starting something new but giving up too early</li><li>wants to attack challenging situations and come out as winner</li><li>wants to increase their efficiency and productivity</li><li>wants to lead employees</li><li>wants to learn some cool fun exercises to get and stay inspired or motivated</li><li>wants to see an upgraded version of themselves</li></ul><p>You can be a leader or manager in corporate or an entrepreneur or a housewife or a student or anyone who wants to lose weight or start exercising or quit bad habits such as smoking/ alcohol.<br></p><p><strong>This course is not for people who</strong><br></p><ul><li>Are not willing to try new methods and take action on them.</li><li>Think that they know everything about motivation. </li><li>Are not willing or ready to change.</li></ul>", 
    "end_date": null, 
    "title": "Motivation Masterclass: Create desired life with Smart Goals", 
    "price": "20.00", 
    "instructors": "Akanksha Kulkarni", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631172_53d4_2.jpg", 
    "course_url": "https://www.udemy.com/inspiredme-motivatedme-transformedme-successfulme/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T10:40:59Z"
}