{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Are you ready to make 2016 your best year?  Do you want to learn how to get motivated now without procrastination stopping you from setting goals and achieving them?  </strong>You are in the right place because this high quality and interactive course by Empowerment Expert Louise Anne Maurice was created for you and <strong>recently updated May 7, 2016.</strong></p>\n\n<p><strong>Motivation Now: Life Coaching Solutions to Achieve Any Goal i</strong><strong>s right for you if:</strong></p>\n\n\n\n<ul><li>You are currently unhappy with your current situation and see the potential of <strong>setting goals</strong> but you are busy and want the step-by-step guidance for how to easily do this.</li><li>You want the <strong>life hacks;</strong> the quick solutions, samples, strategies and examples on <strong>setting and achieving goals</strong> that you’ll follow plus have been tested and proven to work.</li><li>You would like to <strong>receive life coaching to get motivated and stay motivated</strong> that will inspire you to succeed but you don't have hundreds or thousands to spend.  </li><li>You would like to know how you can <strong>write simple goals in the shortest amount of time </strong>possible that can be followed.</li><li>You have currently set goals and are ready to discover why you lack <strong>motivation</strong> or continually <strong>procrastinate</strong>, even though you really want to achieve your goals.</li><li>You are committed to learning the <strong>simple short-cuts to success </strong>and following through with what you’re about to learn.</li></ul>\n\n\n\n<p>******************************************************************************************************************</p>\n\n\n\n<p><strong>Why take Motivation Now: Life Coaching Solutions to Achieve Any Goal?</strong></p>\n\n\n\n<ul><li>This is why you are here because you want to stop live a life with no regrets.</li><li>Now keep this in mind. Every piece of advice, strategy and short-cut to motivation, setting goals, achieving goals, how to stop procrastinating and stay motivated has been tested; none of this is theory.</li></ul>\n\n\n\n<p>******************************************************************************************************************</p>\n\n\n\n<p><strong>What is covered in</strong> <strong>Motivation Now: Life Coaching Solutions to Achieve Any Goal?</strong></p>\n\n\n\n<ol><li>Discover the formula to get motivated Within Seconds</li><li>Learn how to set goals that keep you motivated</li><li>Uncover your unique way to achieve goals in less time</li><li>Walk away with the secrets to stop procrastinating for good</li><li>Stay motivated to achieve your goals</li><li>Learn the life hacks; my 5 short-cuts to motivation, setting goals, achieving goals, ending procrastination and staying motivated for success.</li><li>You receive insights that only a professional with my background can give you.</li><li>You get the inside track on what you need to do at every stage of the process.</li><li>You go from having no goals or motivation to having an entire plan mapped out for you that is easy and simple to follow; which means you will implement. When you implement, you are successful.</li></ol>\n\n\n\n<p>*****************************************************************************************************************</p>\n\n\n\n<p><strong></strong></p>\n\n\n\n<p><strong>How does Motivation Now: Life Coaching Solutions to Achieve Any Goal benefit you?</strong></p>\n\n\n\n<ul><li>You get insider tips and tricks plus the life coaching necessary to develop professional and financial goals; most people struggle with this area.</li><li>I share with you what to do and what not to do based on my experiences having worked with thousands and thousands of clients over the past 25 years.</li><li>More important and what I share in this course; I understand how to set goals that motivate you and set you up for success. I am a certified life coach but I created this course based on my own personal set-backs and frustrations.</li><li>If that’s something you would like to achieve, you have selected the right course to take. If you complete this entire course and implement everything you learn you will have goals in each area of your life and the exact short-cuts for achieving those goals with ease.</li><li>Remember, it doesn’t matter if you are new to goal setting or already in full swing but just stuck in procrastination, I’ve been there and I can show you exactly what you need to do to make your goals a reality.</li></ul>\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n<p><strong>When Can You Take </strong><strong>Motivation Now: Life Coaching Solutions to Achieve Any Goal?</strong><strong></strong></p>\n\n\n\n<ul><li>What are you waiting for? If you’re looking for a course to learn <strong>how to get motivated now without procrastination stopping you from setting goals and achieving them</strong>, then look no further.</li><li>Start learning right now or take the course when it is convenient for you! The course can be accessed 24-7 from most devices with an internet connection.</li><li>Once a member of the course, you receive lecture updates, advice and coaching guidance for life; <strong>NO EXTRA COST TO YOU.</strong></li><li><strong>REMEMBER</strong>: If you are not completely satisfied, you can get a full money back refund, so long as you request it within 30 days of purchase – No questions asked.</li><li>Click on the <strong>\"Take This Course\"</strong> button and start learning instantly</li></ul>\n\n\n\n<p>***************************************************************************************************************</p>\n\n\n\n<p>Still not convinced? Make sure you watch some of the <strong>FREE PREVIEWS</strong> available to learn more about the course and more about me your instructor. Plus you can check out some of the reviews. Here is just one of the many examples:</p>\n\n\n\n<p><strong>What people are saying about Motivation Now: Life Coaching Solutions to Achieve Any Goal </strong><strong>created by Empowerment Expert Louise Anne Maurice?</strong></p>\n\n\n\n<p><em>“I have taken a few of Louise’s courses but I really enjoyed the energy of this course. I have struggled to achieve goals I have set for myself and now I know why. Thank you, I can stop beating myself up! I felt very much at peace as Louise gently guided me to set goals that motivate me to follow them and then gave me the incredibly fun way to achieve them. I laughed at the procrastination section because it described me to a tee. Very entertaining yet inspiring!”</em></p>\n\n\n\n<p>*****************************************************************************************************************</p>", 
    "end_date": null, 
    "title": "Motivation Life Hacks: Goal Setting System to Achieve Goals", 
    "price": "20.00", 
    "instructors": "Louise Anne Maurice", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/631764_3de3_16.jpg", 
    "course_url": "https://www.udemy.com/life-hacks-motivation-procrastination-goal-setting-success/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-05T21:58:48Z"
}