{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Motivation</strong> is easier to find and maintain, then you may think.  In this course, I will walk you through a brief, 7-Step process, that will allow you to instantly find motivation to achieve your <em>true</em> goals. </p>\n\n<p> <strong>The 7-Steps only take about 20-30 minutes to finish</strong>.  If you <strong>watch the video</strong> above, check out the reviews, previews and description below, then you will get a more clear picture of how this course will help you.</p>\n\n\n\n\n\n\n\n\n\n<p>What most people don't realize about motivation is that it shouldn't be something you have to try and \"muster up\".  This course will teach you the secret that professional athletes and world class performers have known about motivation for years.  </p>\n\n\n\n\n\n\n\n\n\n<p>It will reveal the common pitfalls and misunderstandings about motivation and goal setting and tells you exactly how to avoid those.  You will also learn a bit about beliefs as well as how to change limiting beliefs that zap your motivation and stop you from achieving your goals.  </p>\n\n\n\n\n\n\n\n\n\n<p><strong>Here are some brief facts:</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>*Course Up to Date as of 6/21/16*</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>*9,600+ Students</strong> in <strong>152 Countries</strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>*110+ Reviews </strong>(<em>Overall Rating: 4.7</em>)</p>\n\n\n\n\n\n\n\n\n\n<p>Here's what a few students, who have <strong><em>already made the decision</em></strong> to take this course, had to say after finishing:<br></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"Awesome!!! Very Surprising Course...</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Wow! I really liked this course. So tired of courses that are all fluff. This one just gets right to it. I really like the part about beliefs and the overall premise of the course. Is it possible to give a 6 star review? Plus, Ken is a very responsive and engaging teacher. Can't wait to see what he puts out next.\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>-Roszel Fletcher</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"This is not your ordinary course. </em></p>\n\n\n\n\n\n\n\n\n\n<p><em>Ken has really developed a unique, straightforward guide to quickly motivate yourself so you can accomplish whatever you set out to do. This is one of those courses that can truly change your life and how you do things.\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><em><strong>-Christine Evans</strong></em></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"Clear and to the Point.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>If you've read any of the many self-improvement, self-development books out there, you'll be only too aware that they often contain a lot of filler.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>This course contains zero filler. In a short, simple series of exercises, Ken presents a powerful technique for clarifying what you're trying to achieve. Very worthwhile.\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>-Sam Pollard</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"One word to describe this course \" AWESOME\".  Congratulations Ken! If your intention was to help people, let me tell you that you \" did it \". I liked this course because it goes straight and to the point. This is not a simple course, it´s a daily guide that will get your dreams come to true.\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>-Manuel Heredia</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"What an EYE-OPENER! You're going to love this course in it's power and simplicity.</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>There are too many courses and books out there about how to achieve your goals, and they can make it so complicated and time consuming. Ken makes it simple to get right to the heart of things and find your clarity NOW. I used each step and already know how to move forward and what was stopping me! I'm adding this course to my personal development toolbox and will use it often. I'll just go through it each time I want to add a new goal or objective. Take this course today!\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>-Lan Anders</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"A special kit you need to accomplish your goal. It is true! You can find your motivation in less than 20 min. It is an exclusive method developed by Ken, it is not an ordinary motivation course you can find in marketplace. Ken is here to help, a highly responsive and friendly instructor!\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>-Shane Lim</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><em>\"Practical and Insightful</em></p>\n\n\n\n\n\n\n\n\n\n<p><em>This is one of the best courses on Udemy on goal-setting! If you simply devote some time to the course you'll have a chance to go through all the steps in the interesting process of self-discovery. The course is very well structured and presented. I highly recommend it!\"</em></p>\n\n\n\n\n\n\n\n\n\n<p><strong><em>-</em></strong><strong><em>Gulnara Emirali</em></strong></p>\n\n\n\n\n\n\n\n\n\n<p><strong>What You Will Learn:</strong></p>\n\n\n\n\n\n\n\n\n\n<ul><li>Why People Struggle with Motivation &amp; How to Avoid Those Same Mistakes</li><li>Realize the Difference Between the Surface &amp; Deep Structure of Your Goals and Why That's Important for Goal Achievement</li><li>How to Avoid Self-Sabotage &amp; Procrastination</li><li>Discover the Secret to Taking Massive Actions Toward Your Goals</li><li>Learn the Meaning of a Clear Definite Purpose &amp; How to Benefit from It</li><li>Discover the Purpose of All Goal Achievement</li><li>Understand the Difference Between Beta &amp; Alpha Brainwave States and How They Affect Your Motivation</li><li>Discover the Gateway to the Subconscious Mind</li><li>Use 3 Safe &amp; Effective Ways to Change Your Inner State at Will for Instant Motivation</li><li>Identify and Formulate Your Goals Quickly &amp; Correctly to Avoid Analysis Paralysis</li><li>Discover the 'Why' Behind Your Goals to Build Powerful &amp; Last Motivation</li><li>Why Associating Peace of Mind to Money Is a Bad Idea</li><li>How to Avoid Reaching Goals but Remaining Unfulfilled</li><li>How to Use ‘Resourceful States’ for Motivation and Goal Achievement</li><li>Learn How The \"Goal Domino Effect\" Can Potentially Change Your Entire Life</li><li>Discover What Your Goals Say About Who You Really Are</li><li>Discover the Biggest Barrier to Visualizing and Correctly Using the Power of Your Subconscious Mind</li><li>How to Easily Create Vivid Mental Imagery and Visualizations for Maximum Motivation</li><li>How Peak Performer's &amp; Creative Geniuses Brains Are Different from Average People and How You Can Be Like Them</li><li>How to Create Powerful States of Motivation for Your Goals at Will</li><li>How to Use 'Mental Icons' for On-Going Motivation When Times Get Tough</li><li>Discover a Secret and Profound Truth About Your Brain</li><li>Realize the Real Truth About Your Desires</li><li>Find out Why Pro-Athletes Visualize Before Performing and How It Can Help Your Motivation</li><li>How To \"Try on\" a Future Outcome, Like an Outfit, Before Putting in the Work to Achieve It</li><li>Discover the Real Secret to Fast and Lasting Motivation</li><li>Uncover the Skills, Habits and Behaviors You Would Need to Achieve Your Goals in Life</li><li>Find out What You Would Have to Do Different to Achieve Your Goals</li><li>How to Use the 1% Winner's Edge to Massively Change Your Life</li><li>How to Build Rapid Momentum &amp; Steady Motivation to Achieve Your Goals</li><li>How to Easily Build Confidence to Achieve Your Goals</li><li>How to Avoid Losing Motivation Toward Your Goals</li><li>Find out the Key Difference Between Peak Performers &amp; Average Performers</li><li>How to Avoid Allowing Your Goals to Become a Source of Guilt &amp; Pain</li><li>How to Re-Fuel Your Motivation When It Starts to Die Down</li><li>Learn the Goal Success Formula</li><li>How to Avoid Chasing Empty Dreams and Living on Autopilot</li><li>Find out the Disgusting Truth About Some Olympic Gold Medal Winners</li><li>Discover What Everyone Ought to Know About Their Feelings</li><li>Identify Which Character Traits Would Help You Reach Your Goals</li><li>Find out What Changes You Would Need to Make to Reach Your Goals</li><li>The Importance of Getting of the Fence</li><li>Find out What Is Stopping You from Achieving Your Goals</li><li>Learn the Truth About Your Beliefs</li><li>Discover the Biggest Problem with Overcoming Challenges and How to Avoid It</li><li>How to Make Certain Challenges Dissolve Effortlessly</li><li>A Simple Way to Convert Your Fears into Strengths</li><li>Discover the Hidden Truth About Your Fears</li><li>How to Stop Accidentally Strengthening Your Fears &amp; Slowing Your Motivation</li><li>How to Weaken Your Fears</li><li>The #1 Productivity Secret That Is Hidden in Plain Sight</li><li>Discover Why You Haven't Already Achieved Your Goals</li><li>How You Can Control Your Negative Beliefs</li><li>Identify Your Limiting Beliefs and Mental Blocks</li><li>Learn a Simple System for Prioritizing &amp; Choosing Your Goals</li><li>Discover the Truth About Success \"Secrets\"</li><li>How to Focus for Deep Motivation and Productivity</li><li>Find out What a Man Who Spent 40 Years Studying Success Has to Say About the Meaning of Success</li><li>Learn the Key to Maintaining Focus on Your Goals</li><li>Depression and Anxiety Are Strangers When You Focus on This</li><li>How to Effectively Schedule Your Day</li><li>How to Avoid Distractions</li><li>A Simple Trick to Inspire Your Brain to Find Motivation &amp; Fast, Creative Solutions</li><li>What Almost No One Realizes About Their Goals</li><li>Discover the Biggest Obstacle to Making Huge Changes in Your Life</li><li>Find out Why People Don't Stay Motivated for Long Term Goals</li><li>How to Easily Build the Habit of Success</li><li>How to Train Yourself to Be Successful Automatically</li><li>Find out the Reality of Success and Goal Achievement</li><li>How to Avoid Information Overload</li><li>How to Establish the Pattern of Follow Through</li><li>How to Avoid The \"Shiny Object Syndrome\"</li><li>How to Overcome Worrying About Making Mistakes</li><li>How to Build up Your Confidence for Goal Achievement</li><li>Forget the To-Do List - This Is What Top Performers Use to Plan Their Day</li><li>How to Avoid Letting Other People's Agendas Monopolize Your Time</li><li>How Top Performers Think About Their Day and How You Can Use This Same Technique for Peak Productivity</li><li>How to Establish a More \"Global View of Your Day\" to Be More Effective</li><li>A Simple Tool That Will Help You to Become More Effective and Productive</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Why You Should Take This Course:</strong><br></p>\n\n\n\n\n\n\n\n\n\n<ol><li>Increased Short-Term &amp; Long-Term Motivation</li><li>Greater Clarity on Your Direction in Life</li><li>More Mental Discipline</li><li>Enhanced Creativity</li><li>Design Your Own Lifestyle</li><li>Overcome Limiting Beliefs</li><li>Avoid Common Motivation Mistakes</li><li>Better Organizational Skills</li><li>Learn to Think and Behave Like a Champion</li><li>Ensure That You Live a Fulfilling Life</li><li>Avoid Procrastination</li><li>Avoid Self-Sabotage</li><li>Set &amp; Achieve Goals Properly</li><li>Greater Self-Confidence</li><li>Overcome Your Fears</li><li>Avoid Depression &amp; Anxiety</li><li>Greater Control Over Your Emotions &amp; Thoughts</li><li>Become More Productive</li><li>Establish Success Habits</li><li>Ability to Use Your Mind Effectively for Goal Achievement</li></ol>\n\n\n\n\n\n\n\n\n\n<p><strong>What Should I Do Now?</strong></p>\n\n\n\n\n\n\n\n\n\n<p>Give the course a chance to help you find motivation, achieve your goals and live the lifestyle you want by enrolling today. You <em>can</em> truly change your life. I'm looking forward to seeing you on the inside if you choose to enroll.</p>\n\n\n\n\n\n\n\n\n\n<p>Even if you've tried things that haven't worked in the past, it doesn't mean that you won't change your life this time.</p>\n\n\n\n\n\n\n\n\n\n<p>I invite you to notice that every moment that you're not aligned with your core desires is time wasted pursuing someone else's dream.</p>\n\n\n\n\n\n\n\n\n\n<p>So you can, breath, relax, <strong>enroll in the course now</strong> and <strong>begin to live the life you deserve</strong>!</p>", 
    "end_date": null, 
    "title": "Motivation Mastery:  How to Get Motivated Fast", 
    "price": "25.00", 
    "instructors": "Ken Wells", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/508338_20ba_3.jpg", 
    "course_url": "https://www.udemy.com/crystal-clarity/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-21T18:59:20Z"
}