{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Jeder Mensch hat <strong>Ziele</strong>. Diese umzusetzen und sich damit in seiner <strong>Persönlichkeit weiterzuentwickeln</strong> ist manchmal gar nicht so einfach.</p>\n\n<p>Oftmals wissen wir sehr gut, worin es sich lohnt Zeit, Ehrgeiz und vielleicht auch Geld zu investieren. Aber manchmal scheinen wir einfach zu schwimmen, sind ziellos und scheinen im Leben gar nicht mehr weiterzukommen. </p>\n\n\n\n<p>Wenn das passiert, stellt sich natürlich gar kein <strong>Erfolg</strong> mehr ein und die <strong>Lebensfreude</strong> bleibt auf der Strecke. Hinzu kommt, dass die <strong>Motivation</strong> dann noch <strong>Ziele zu erreichen</strong> und etwas in seinem Leben zu ändern gegen Null tendiert.</p>\n\n\n\n<p>Mit meinem Kurs “<strong>Motiviert Ziele erreichen</strong>” möchte ich euch Strategien an die Hand geben, wie ihr nicht nur motiviert bleibt sondern auch mit der <strong>richtigen Zielplanung</strong>  und einem <strong>Kriterienkatalog</strong> eure <strong>Ziele umsetzt und schließlich erreicht</strong>. </p>\n\n\n\n<p>Es kommt dabei nicht nur auf die richtige <strong>Zielformulierung</strong> an. Wichtig ist auch, dass ihr eure Ziele aufschreibt und noch wichtiger, dass ihr sie in kleine Teilziele herunterbrecht. </p>\n\n\n\n<p>Denn nur, wer die <strong>Regeln der Zielsetzung</strong> beherrscht, bleibt auch motiviert, wenn es einmal schwierig wird und die Motivation zu fehlen scheint. </p>\n\n\n\n<p>In dem Kurs zeige ich euch Strategien, die ihr sofort anwenden könnt, um wieder <strong>motiviert eure Ziele zu verfolgen</strong> oder aber eure Ziele so anzupassen, dass sie zum Gesamtbild, zum großen Ganzen passen. </p>\n\n\n\n<p>Es geht in diesem Kurs auch nicht nur um die großen Ziele. Mit der Methode, die ich euch hier zeige, könnt ihr sowohl euer <strong>Lebensziel festlegen</strong> und schließlich umsetzen als auch kleine Ziele in die Tat umsetzen. Es ist gar nicht schwer, es gilt “nur” die richtigen Werkzeuge zu kennen und diese auch zu nutzen.</p>\n\n\n\n<p>Wer sich kein Ziel setzt, ist auf die Dauer unzufrieden und fühlt sich immer unmotivierter. Daher ist es für das eigene Leben, die <strong>mentale Gesundheit</strong> und die <strong>Entwicklung seiner Persönlichkeit</strong> wichtig, seine Ziele zu kennen, festzulegen und umzusetzen.</p>", 
    "end_date": null, 
    "title": "Motiviert Ziele erreichen", 
    "price": "20.00", 
    "instructors": "Monja Wessel, Online Lernen SimpleLife Stories", 
    "commitment": "42 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/852848_cea9.jpg", 
    "course_url": "https://www.udemy.com/motiviert-ziele-erreichen/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-18T09:22:37Z"
}