{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em><strong>***Updated For <em>June </em>2016***</strong></em><br><strong></strong></p>\n\n<p><strong>I want to motivate you like no person has ever done before! In this course you will become more motivated to attain any goal that you desire! Yes, I mean ANY goal! </strong><br></p>\n\n\n\n\n\n<blockquote> <em>\"Wow, it's rare to see a course delivered with such passion! Hero \ncertainly gives it to you straight with regard to the mindset you must \nhave to achieve your goals in life. If you don't get fired up by what he\n says, then quite frankly, you must be dead! If you suffer from \nprocrastination (like me), I would thoroughly recommend listening to \nthis course to get you moving.\" </em><strong> - Paul Wilson (student) </strong> </blockquote>\n\n\n\n\n\n<p> I truly believe in my power to motivate and pump people up to go and chase their big dreams and goals. Please go and check out the two free preview videos to check yourself. Whether\n you are a man or a woman, if you are looking to <strong></strong>become more motivated in life then this course is exactly what you need.<br></p>\n\n\n\n\n\n<p><strong>Guarantee: \nBy the end of this course you will become more motivated to attain your goals. Yes, it is that simple. <br></strong></p>\n\n\n\n\n\n<blockquote> <em>\"I have only watched a preview and the first clip of 2:31 minutes and I \ncan honestly say I am heartbroken.  I have used so many excuses to not \ndo what I dream of doing and just seeing Benjamin and Hearing the first \ntwo clips has already shown me that I have been deceiving myself.  I can\n only be honest and say that I have tears in my eyes because of the \nlevel of authenticity he is portraying and not hiding behind excuses \nthat I hide behind.  I don't know how I came across his material but I \nthank God that I did for truly I do anticipate this being the foot up my\n a_ _ that I need in order to propel me to the next level.  Thank you \nBenjamin Hero thy Good and Faithful Servant!\" </em><strong> - Mitchell Brice (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong></strong></p>\n\n\n\n\n\n<p><strong>FREE BONUS INCLUDED WITH THIS COURSE</strong><br>As an additional bonus for taking this course you will also receive the mp3 version of the course so that you can take the motivation with you wherever you are!</p>\n\n\n\n\n\n<blockquote> <em>\"Without a doubt Benjamin comes across as the most passionate person ever\n and it is quite infectious.  Definitely made me smile through the \nlectures.\" </em><strong> - Suzanne Reece (student) </strong> </blockquote>\n\n\n\n\n\n<p><strong> Zero Risk </strong><br>There\n is a 30 day money back guarantee so you literally have no risk in \ntaking this course. Seriously, the 30 refund is even automatic so there \nis no hassle on your end. If this course sounds like it is for you then \ngive it a go. </p>\n\n\n\n\n\n<p><em> \"We can not solve our problems with the same level of thinking that created them” </em>- Albert Einstein</p>\n\n\n\n\n\n<p>I will see you inside if you are ready to become truly motivated!<br><strong>Ben</strong><br></p>", 
    "end_date": null, 
    "title": "Motivation Mastery: Get Instant Motivation To Do Anything! ", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/643422_8814_2.jpg", 
    "course_url": "https://www.udemy.com/best-motivation/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-17T17:07:22Z"
}