{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Motivation for Success: 6 Steps to Perform Under Pressure will introduce you to the concept and process of the REPEAT Model (<strong>R</strong>oute <strong>T</strong>o <strong>E</strong>xceptional <strong>P</strong>erformance <strong>E</strong>ach <strong>A</strong>ctual <strong>T</strong>ime) that in no time at all you will be able to apply to all aspects of your work, career, sport, business and personal life to deliver an exceptional performance just when you need it often under extreme pressure. This outcome often ensures success and achievement in everything that you want.</p><p><strong>Master Your Motivation Quickly &amp; Easily For Your Success &amp; Wellbeing For Every Important Event Or Situation To You</strong>.</p><ul><li>Handle stress, pressure &amp; adversity</li><li>Learn a unique model to apply easily</li><li>Fire up your motivation every time</li><li>Improve physical &amp; psychological wellbeing</li><li>Put yourself in the very best position to succeed</li><li>Develop mental toughness for FREE ongoing</li></ul><p><strong>The REPEAT model is a 6 Step approach towards triggering your challenge state in motivational terms that allows you to face pressure and opportunity with the correct mindset, wired for success that you can start to apply today with simple strategies and actions we have laid out for you to follow. </strong></p><p>Motivation for Success: 6 Steps to Perform Under Pressure material has been applied for many decades within very high performing professions and proven to work consistently. All strategies are underpinned by performance science and have been shown to be highly effective when the individual is under pressure to deliver the goods when needed.</p><p>To have this <strong>ability to thrive under pressure</strong> will make you a stand out candidate for job roles, promotion, success at sport, a career in the military, starting your own business or even turning you life around from unemployment. You will become <strong>mentally tough</strong> and have unlimited amounts of confidence; have total control over what you need to have and to focus only upon what you can succeed in and not what you can't, whilst keeping mental demands in check and balance.</p><p>The course is broken down into 12 sections each including a training module and a summary of the training. It is supported by a 20 page workbook and a 37 page narrative that are downloadable for you to read if you wish offline. </p><p>It has been designed to follow a natural pathway from no knowledge through to looking at and planning your future potential. You will learn the process and the easy to apply tactics to develop your mind and motivation. </p><p><strong>The Route To Exceptional Performance Each Actual Time</strong> (REPEAT) is introduced and touches upon simple neuroscience principles and how they affect our performance. Moving through self awareness and how this helps you to choose the correct state for success. You will learn to change your thinking and to reduce pressure upon yourself whilst building extra mental resources to help you thrive through anything.</p><p>Motivation for Success: 6 Steps to Perform Under Pressure will finish by you having a better understanding of you and how you are feeling and thinking and what you can do about it to help you achieve when something is important to you. There are also some very essential improvements here for your mental and physical health without drugs, therapy or any other intervention apart from what you have learned. </p><strong></strong>", 
    "end_date": null, 
    "title": "Motivation For Success: 6 Steps To Perform Under Pressure", 
    "price": "20.00", 
    "instructors": "Geoff and Elizabeth Greenwood FCCA MBA MSc", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565054_5cf8_2.jpg", 
    "course_url": "https://www.udemy.com/the-science-of-success-motivation-achievement-performance/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T11:05:28Z"
}