{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Stop Procrastinating and Start Achieving- Discover the Powerful </p><p>Steps That Will Help You Leave the World of Excuses and Create Your </p><p>Perfect Lifestyle</p><p><br><br><strong>Your Dream Life Wants You to Take Action NOW. Today!</strong></p><p><br>Do you ever feel like your life is happening so fast that you slowly</p><p> forget about your dreams, goals and ambitions? Do you sometimes feel </p><p>like you could do more and be happier if you only had “more luck” or </p><p>were slightly “more motivated”?</p><p><br><br>If so, then this motivational course will be the inspirational gate </p><p>that leads you to an amazing new way of successful living. You are just </p><p>about to explore the best motivational techniques that will help you get</p><p> excited, stay motivated, move forward and keep on track so that you can</p><p> achieve personal success the way you want (even if you don't feel that motivated now).</p><p><br><br>But, more importantly, you will become more focused, confident and responsible for your life. </p><p>You will unleash unlimited inner motivation and create an ultimate vision for your life. You will finally embrace the joy and fulfillment that the process of reaching your goals and living your life</p><p> by design offers you. </p><p><br><br>The motivational techniques that you are just about to dive into are</p><p> universal- they can help you reach all kinds of goals (health, fitness,</p><p> finances, work, lifestyle---you name it!). </p><p><br><br><br><strong>Let’s face the truth... </strong></p><p><br>Each day you don't take action is another day you wasted your </p><p>potential. Most people aren’t living, they are surviving. They don’t </p><p>want to create their own lives. </p><p><br><strong>But you want to live YOUR DREAM. You want to be in charge, right? So get busy living the life you want!</strong></p><p><br>Get busy NOW.</p>", 
    "end_date": null, 
    "title": "Motivation-Get and Stay Motivated!", 
    "price": "20.00", 
    "instructors": "Marta Tuchowska", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/514462_7663_9.jpg", 
    "course_url": "https://www.udemy.com/motivation-success/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-29T09:36:33Z"
}