{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>How do they do it?</strong> What is the secret behind the success of a <strong>Bill Gates</strong>, <strong>Angela Merkel</strong>, <strong>Elon</strong><strong> Musk</strong>, or the lady down the street who runs a highly profitable family business and the classroom teacher that masterfully calms a group of rowdy students? You may be thinking why not ask them, but there is a catch...<em>They Probably Don't Know</em>...but I do and soon you will too. <em></em></p><p>How do I know? Because I have been researching and teaching about motivation for <strong>over 30 years</strong>, all over the globe, giving presentations and conducting workshops to help people like you become more successful. I am a university professor who specializes in motivational science, including <strong>writing the leading text \"Motivation for Learning &amp; Performance</strong><strong>.</strong>\" As I reveal in the course, one of the most interesting aspects of motivation is that few people really understand their own motives and I can tell you why.</p><p>This course is about making you one of those few people that are highly self-aware about their own motives, as well as someone who can cultivate optimal motivation in others. When you take my course you will learn evidence-based strategies and techniques you can use to become what I call a \"Motivation Detective,\" spotting the correct clues to solve motivational riddles. By the end of the course you will amass a wealth of practical and applied strategies to enhance motivation in the self and others. You will master how to use knowledge of motivation to achieve success.  You will learn the important interaction among beliefs, motivations, and behaviors, the key pitfalls to avoid, and you will gain the power to develop and implement scientifically-based strategies to improve learning and performance.</p><p>In the course you will learn about motivational misconceptions and the theories that explain motivation. You will meet a number of motivational leaders that I have interviewed, from an international poker player that won millions, to a Hall of Fame football star, to the most famous white-collar criminal in the world, who is still behind bars. You will also learn about how to analyze motivational clues, and at the end of the course I provide you a 5-step plan you can use to create long lasting motivational change.  Along the way there are a number of quizzes to help reinforce your knowledge along with a host of additional resources provided in downloadable materials to use after the course is completed.</p><p>When you sign up for my course you are actually receiving almost the same, high-quality information that I teach my students at the University of Central Florida. They spend a lot of money registering for my semester-long course in pursuit of a college degree, but here on Udemy you will get the same access to me just like my students, for just a fraction of the typical university cost. </p><p>Motivation for Learning and Performance is exactly as the title states. When you take my course <strong>you will walk away with a certificate as a Motivational Detective</strong>, ready to use what you have learned to enhance your own learning and performance, as well as the motivation of your peers, family, co-workers, classmates, or with whomever you choose to share your motivational expertise.</p><p><br></p>", 
    "end_date": null, 
    "title": "Motivation for Learning and Performance", 
    "price": "50.00", 
    "instructors": "Dr. Bobby Hoffman", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/558900_f54b_3.jpg", 
    "course_url": "https://www.udemy.com/motivation/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-19T20:11:28Z"
}