{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>É mais fácil encontrar motivação </strong>e manter-se motivado do que você imagina. Neste curso, eu lhe apresento um <strong>processo simples de sete passos</strong> que o ajudará a encontrar motivação e alcançar suas metas.  Para completar os sete passos você precisa de apenas <strong>30 minutos</strong>.  Se você assistir o vídeo acima, e der uma olhada nas avaliações e nas aulas disponíveis, você terá uma boa ideia de como este curso pode lhe ajudar. </p>    <p>Este curso é no momento o <strong>Curso n° 1 em Motivação</strong> na udemy!</p>    <p>O que a maioria das pessoas não percebe sobre motivação é que motivação não deve ser algo que a gente precisa trabalhar pra encontrar.  Este curso o ensinará o segredo que atletas profissionais e performers de alto nível tem usado por décadas pra se manterem motivados.  </p>    <p>Você verá também quais são as armadilhas e os mitos sobre motivação e definição de objetivos, e aprenderá como se manter longe deles.  Nós discutiremos o que são crenças limitantes e como transformar esses pensamentos que podem destruir sua motivação e impedir que você alcance seus objetivos.  </p>  <p>Alguns fatos recentes:</p>  <p><strong>A versão original deste curso, em inglês, já tem:</strong></p>  <p><strong>* 4.859 alunos em 127 países</strong></p>  <p><strong>* 88 avaliações de 5 estrelas -- o curso n° 1 em Motivação na udemy</strong></p>  <p>Veja o que estes alunos disseram depois de terminar o curso:</p>  <p>“Maravilhoso!!!  Um curso supreendente...  Realmente adorei o curso.  Estava cansada de cursos que são cheios de lero-lero, este curso vai direto ao assunto.  Gostei muito da seção sobre as crenças e a ideia geral do curso.  É possível dar uma avliação de 6 estrelas?  Além disso, Ken é um professor que se preocupa com os alunos.  Mal posso esperar pra ver seus próximos cursos!” <strong>-Roszel Fletcher</strong></p>      <p>“Este é não é um curso como os outros.  O Ken Wells desenvolveu um guia único, um processo que realmente funciona para se encontrar motivação rapidamente e seguir para ancançar o que a gente quiser.  Este é um daqueles cursos que pode transformar sua vida e a maneira como você lida com as coisas no geral.” <strong>-Christine Evans</strong></p>      <p>\"Uma palavra pra definir este curso – FANTÁSTICO.  Parabéns Ken!  Se sua intenção era ajudar as pessoas, deixa eu lhe dizer, você conseguiu!  Eu gostei deste curso porque vai direto ao ponto.  Não é um curso simples, é um guia diário para ajudá-lo a transformar seus sonhos em realidade. “ <strong>-Manuel Heredia</strong></p>    <p><strong>Faça este curso e...</strong></p>  <p><strong></strong></p>  <ul><li>Aprenda o motivo pelos quais as pessoas tem dificuldade em se manterem motivadas e como evitar cair nas mesmas armadilhas</li><li>Aprenda a diferença entre estrutura superficial e estrutura profunda dos seus objetivos e porque é importante distinguir entre as duas antes de sair em busca das suas metas</li><li>Supere a procrastinação e dê o primeiro passo da direção dos seus objetivos</li><li>Aprenda a importância de se ter um propósito claro e definido e como se beneficiar dele</li><li>Descubra a finalidade de todo o processo de busca de metas</li><li>Aprenda a diferença entre ondas cerebrais beta e alpha e como elas afetam sua motivação</li><li>Descubra como chegar ao portal do seu subconsciente</li><li>Aprenda três maneiras eficazes para transformar seus estado mental e conseguir, sempre que quiser, uma dose instantânea de motivação</li><li>Aprenda a identificar e formular suas metas rapidamente e corretamente</li><li>Descubra os reais motivos por trás das suas metas e como esse motivos podem produzir motivação duradoura</li><li>Entenda por que colocar paz de espírito dependendo de dinheiro não é uma boa ideia</li><li>Saiba como evitar a possibilidade de não se sentir satisfeito mesmo depois de alcançar seus objetivos</li><li>Aprenda como o Efeito Dominó pode transformar sua vida</li><li>Descubra o que seus objetivos dizem sobre você</li><li>Descubra o maior obstáculo para visualizar e usar de maneira eficiente o seu subconsciente</li><li>Aprenda como criar imagens vívidas e visualizações para adquirir motivação máxima</li><li>Aprenda como atletas, performers e pessoas criativas usam suas mentes de maneira diferente e como podemos aprender com eles</li><li>Como usar ícones mentais para alimentar sua motivação a qualquer momento</li><li>Descubra a verdade nua e crua sobre seu cérebro</li><li>Descubra a verdade sobre seus desejos</li><li>Descubra o porque atletas profissionais usam visualização antes de eventos e como isso pode ajudá-lo a se manter motivado</li><li>Como \"testar\" um resultado futuro, e ver se isso é realmente algo que você quer investir seu tempo e energia</li><li>Descubra o maior segredo para uma motivação rápida e duradoura</li><li>Descubra os comportamentos, hábitos e técnicas que você precisa adquirir a fim de alcançar seus objetivos</li><li>Descubra o que você precisa fazer diferente para buscar suas metas</li><li>Como usar o conceito de 1% de vantagem do vencedor</li><li>Como construir um impulso rápido e motivação contínua para alcançar suas metas</li><li>Como produzir maior confiança e alcançar seus objetivos</li><li>Como evitar perder motivação na direção de suas metas</li><li>Aprenda a diferença principal entre performers de sucesso e performers de nível mediano</li><li>Aprenda como evitar que suas metas se transformem em motivo de dor e culpa</li><li>Aprenda a alimentar sua motivação quando ela começa a diminuir</li><li>Aprenda a fórmula para o sucesso das suas metas</li><li>Aprenda como evitar sair em busca de metas que não são realmente importantes pra você</li><li>Aprenda como evitar viver no piloto automático</li><li>Descubra o que todo mundo deveria saber sobre suas emoções e sentimentos</li><li>Aprenda a identificar quais os traços de personalidade que você precisa desenvolver para alcançar suas metas</li><li>Descubra quais as mudanças de vida que você precisa realizar antes de alcançar suas metas</li><li>Evite ficar em cima do muro</li><li>Descubra o que o está impedindo de alcançar seus objetivos</li><li>Aprenda a verdade sobre suas crenças</li><li>Saiba qual o maior desafio para se superar obstáculos e como evitá-lo</li><li>Aprenda a dissolver rapidamente seus desafios</li><li>Aprenda uma maneira eficaz de se transformar seus medos em pontos-forte</li><li>Aprenda a verdade sobre seus medos</li><li>Saiba como evitar reforçar seus medos, que diminuem sua motivação</li><li>Aprenda como enfraquecer seus medos</li><li>Aprenda o segredo n° 1 de produtividade que está escondido bem em frente aos nossos olhos</li><li>Descubra as razões pelas quais você ainda não alcançou seus objetivos</li><li>Aprenda como controlar seus pensamentos negativos</li><li>Identifique suas crenças limitantes e bloqueios mentais</li><li>Aprenda um sistema simples para priorizar e escolher suas metas</li><li>Descubra a verdade sobre os \"segredos\" do sucesso</li><li>Aprenda a focar sua energia em motivação profunda e produtividade</li><li>Descubra o que um homem que passou 40 anos estudando motivação tem a dizer sobre o significado do sucesso</li><li>Aprenda a chave para manter o foco nos seus objetivos</li><li>Aprenda a evitar distrações</li><li>Aprenda a lidar com motivação e deixe lá fora qualquer possibilidade de depressão e ansiedade</li><li>Aprenda o que quase ninguém sabe sobre seus objetivos</li><li>Descubra o maior obstáculo para se conseguir grande transformações na sua vida</li><li>Descubra como treinar a si mesmo a ser uma pessoa de sucesso, automaticamente</li><li>Descubra a verdade sobre sucesso e como alcançar suas metas</li><li>Aprenda a aumentar sua autoconfiança e alcançar seus objetivos</li><li>Aprenda como evitar se sobrecarregar com informação</li><li>Aprenda como estabelecer um caminho para percorrer com sucesso</li><li>Aprenda como evitar a \"síndrome do objeto dourado\"</li><li>Aprenda como superar o medo de cometer erros</li><li>Deixe de fazer listas do que você ainda precisa fazer, e ao invés disso, faça como performers de sucesso - organize seu dia</li><li>Evite que problemas de outras pessoas monopolizem seu tempo</li><li>Aprenda a estabelecer uma visão mais global do seu dia e a ser mais produtivo</li><li>Aprenda uma ferramenta simples que vai ajudá-lo a ser mais eficiente na busca dos seus objetivos</li></ul><p><strong>Por que você deve fazer este curso:</strong></p>  <ol><li>para maior motivação a curto e longo-prazo</li><li>para maior clareza sobre o que você está buscando</li><li>para disciplina mental</li><li>aumento da criatividade</li><li>para planejar seu próprio estilo de vida </li><li>para evitar pensamentos limitantes</li><li>para evitar os erros mais comuns para se manter motivado</li><li>para desenvolver melhores técnicas de organização</li><li>para aprender a pensar e se comportar como um campeão</li><li>para garantir uma vida bem-sucedida</li><li>para evitar procrastinação</li><li>para evitar auto-sabotagem</li><li>para se alcançar objetivos plenamente</li><li>para mais autoconfiança</li><li>para superar seus medos</li><li>para evitar depressão e ansiedade</li><li>para obter maior controle sobre suas emoções e pensamentos</li><li>para ser mais produtivo</li><li>para estabelecer hábitos de sucesso</li><li>para usar sua mente de maneira eficaz para que você alcance suas metas</li></ol><p><strong>Por que aprender comigo (Ken Wells)?</strong></p><ul><li>Eu já superei enormes obstáculos na minha vida usando as mesmas ferramentas que apresento neste curso</li><li>Tenho mais de 6.280 alunos, de 127 países</li><li>Mais de 144 avaliações (a grande maioria são \"5 estrelas\")</li><li>Nossos cursos são #1 nas suas categorias</li><li>Venho estudando e praticando técnicas para sucesso em performance por mais de 12 anos</li><li>Minha técnica de ensino é simples, direta e proporciona maneiras diferentes para você começar imediatamente</li><li>12 anos de sucesso em áreas altamente competitivas (esportes, negócios)</li><li>Certified Mental Strength Coach</li><li>Aulas curtas, diretas, tiro tudo que é supérfluo.  Em aulas de 5 minutos, são 5 minutos de conteúdo!</li></ul>                  <p><strong>O que eu devo fazer agora?</strong></p>  <p>Dê uma chance a este curso, que pode lhe ajudar a encontrar motivação, alcançar suas metas e viver a vida que você deseja. Você pode realmente transformar sua vida.  Espero te ver ali dentro do curso depois que você se inscrever.</p><p>Mesmo que você tenha tentado outros métodos no passado, que não funcionaram, isto não significa que você não conseguirá mudar sua vida desta vez.</p><p>Ao final do curso você terá maior clareza, inspiração e motivação para viver a vida que você realmente quer. </p><p>Eu o convido a ver que cada minuto em que você não está alinhado com seus desejos intrínsecos é tempo que você está perdendo buscando os sonhos de outra pessoa, não os seus.</p><p>Então, respire, relaxe,<strong> inscreva-se neste curso agora e comece a viver a vida que você merece!</strong></p>  <p><br></p>  <p><strong></strong></p>", 
    "end_date": null, 
    "title": "Motivação: encontre real motivação para alcançar suas metas", 
    "price": "20.00", 
    "instructors": "Ken Wells, Luciane Cardassi", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/620446_9ced_3.jpg", 
    "course_url": "https://www.udemy.com/motivacao-encontre-real-motivacao-para-alcancar-suas-metas/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-23T16:27:24Z"
}