{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>En el Curso Avanzado Motivación Personal Imparable descubrirás los secretos para crear una gran Motivación Personal constante, que no se apague ante los primeros obstáculos.</p><p><strong>Alcanza Tus Sueños Mediante La Ciencia De La Motivación</strong></p><p>La auto-motivación ha sido investigada por la ciencia a través de los años y el resultado de los estudios más importantes ha sido plasmado en este curso de una manera fácil de entender y didáctica, para que puedas implementarlo desde hoy.</p><p>Básicamente la Motivación Personal se ha reducido a una fórmula que puedes empezar a implementar en tu vida, cuando sientas que necesitas ánimo y ese impulso para iniciar lo que deseas, sin caer en la pereza o la procrastinación.</p><p><strong>Una Poderosa Habilidad En Tus Manos</strong></p><p>Muy posiblemente la motivación es el secreto de los emprendedores modernos.</p><p>Cuando dos personas se disponen a llevar a cabo la misma actividad, <em>el que tenga mayor motivación</em> terminará obteniendo los mejores resultados, en menos tiempo y con menor esfuerzo.</p><p>Si quieres triunfar en el mundo de hoy, evidentemente necesitarás motivación. Sin embargo muchos se conforman con ver videos \"motivacionales\" y conformarse con el famoso \"Tú puedes\", \"Sigue adelante\", \"No te rindas\", que lo único que hace es desmotivarte más cuando las cosas no salen como lo esperas.</p><p><strong>Contenido Y Visión General Del Curso</strong></p><p>Motivación Personal Imparable está diseñado para que puedas ir paso a paso descubriendo la maravillosa ciencia de la motivación, y sobre todo, implementando ejercicios prácticos simples pero poderosos, en tu vida.</p><p>Mediante un esquema teórico-práctico, el autor brinda los conceptos y los razonamientos detrás de cada descubrimiento científico relativo a la motivación humana, y posteriormente concluye de qué manera se puede implementar dicho conocimiento.</p><p><strong>En el módulo 1</strong> descubrirás por qué ha sido difícil motivarte a ti mismo para lograr lo que quieres y de qué manera puedes revertir ese proceso anti-motivación. Adicionalmente, conocerás los errores más comunes que cometen las personas al querer obtener motivación.</p><p>Por otra parte, <strong>en el módulo 2</strong> verás la fórmula de la motivación con sus 4 variables y cómo se relacionan entre ellas, aumentando o disminuyendo el término general (la motivación) en diferentes situaciones. Verás ejemplos numéricos específicos y cómo calcularlo en tu vida.</p><p>Particularmente <strong>en el módulo 3</strong>, luego de contar con la fórmula, recibirás las 27 técnicas de motivación que están pensadas para mejorar las 4 diferentes variables de la ecuación, aumentando, por lo tanto, tu motivación al máximo.</p><p><strong>Adicionalmente</strong>, cuentas con la sección de Bonos de Regalo que incluye dos materiales que complementan perfectamente el resto del curso, para que puedas lograr mejores resultados aún más rápido.</p><p>Al finalizar el curso, contarás con las mejores herramientas para crear una motivación personal interna sólida y fuerte que no se desvanezca con el tiempo. Una motivación similar a la que tenemos los seres humanos por respirar, que ante la dificultad se hace más fuerte.</p>", 
    "end_date": null, 
    "title": "Motivación Personal Imparable", 
    "price": "20.00", 
    "instructors": "Juan Sebastian Celis Maya", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/611006_ed66_2.jpg", 
    "course_url": "https://www.udemy.com/motivacion-personal/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-13T20:04:16Z"
}