{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Do you wonder why and how some people can have so much success in life?</strong></p><p><strong style=\"\">If you are a teenager would you like to know what your future can be, and learn exactly how to achieve it?</strong></p><p><strong style=\"\">Maybe you are a bit older, and have always had a picture of your ideal life? You too can learn exactly how to achieve it.</strong></p><p>Anyone, at any stage in their life, can create a future that they desire. So many people don&#039;t  have it because of fear. If you had the desire (a <strong style=\"\">WHY</strong> big enough to make you <strong style=\"\">CRY</strong>), and had the tools to guide you and teach you how to live that life, you would do anything you could to succeed.</p><p>This course will reveal to you a solid step by step process that will get you your <strong style=\"\">WHY.</strong></p><p><strong style=\"\">How will you achieve this?</strong></p><ul style=\"\"><li>By learning how to be totally committed to yourself</li><li>Understanding your mind</li><li>Designing your future</li><li>Creating specific goals and actions that will embed positive habits</li></ul><span></span><p></p><p>This is <strong style=\"\">NOT</strong> a personal development course that will leave you wondering how to move forward, and have you forget about it in a week.</p><p>This course <strong style=\"\">WILL </strong>give you powerful tools that you can and will use every day for the rest of your life.... The more committed you are, the more achievements you will have.</p>", 
    "end_date": null, 
    "title": "NLP - How To Create Your Future", 
    "price": "20.00", 
    "instructors": "Hamish Bayston, Kelly Rankin", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/482856_28d9_3.jpg", 
    "course_url": "https://www.udemy.com/create-your-future/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-22T04:37:37Z"
}