{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In the first course in his “Writers’ Therapy” series, author and writing coach Dave Fox explored writer’s block – what causes it and how to fix it. Now he’s back with a follow-up workshop that explores <strong><em>time management and distraction management for </em></strong><strong><em>writers</em></strong><strong>,</strong> and for people who want to be writers, who struggle to find the time they need to fulfill their writing dreams.</p>  <p>We’re living in a hyper-distracted world. So many different things are competing for our attention: family and friends, work or school, phone calls, Facebook and <em>so much</em> more. Many of these distractions are things we want in our lives, but they make it difficult to find the time we need to pursue our writing goals. This course teaches you how to manage those things – how to gently talk to the people in your life who don’t understand your need to write, how to shut out electronic distractions and interruptions, how to discover your optimum writing environment, how to build writing time into your schedule, and how to <strong><em>become a much more productive writer.</em></strong> </p>  <p>This course also tackles the age-old problem of procrastination – why we do it, how we do it, and how to <em>stop</em> doing it – because, hey, we all procrastinate sometimes, but if we learn to catch ourselves and do it less, we’ll get a lot more writing done. </p>  <p>If you’re a writer, or you’d like to be one, Dave offers solid advice, proven tips, and techniques you can use <em>right away,</em> to help you write more and <strong><em>finish those writing projects you’ve been talking about and dreaming about for a long time!</em></strong></p>  <p>Do Dave’s methods work? They’ve worked for him. He has published two bestselling travel books (with a third one on the way) as well as hundreds of magazine and newspaper articles – and he has done this with a major (medically diagnosed) case of Attention Deficit Disorder! He has learned to thrive as an independent freelance writer in spite of his easily distracted brain. The techniques Dave uses to focus on his writing and be super productive will work for <em>anybody</em>, regardless of whether or they have ADD/ADHD. </p>  <p>We are <em>all</em> feeling distracted these days. We can’t eliminate distractions from our lives, but we can learn to manage them and do lots of great writing in spite of them. Dave teaches this energizing workshop with a mix of strategies, encouragement, humor, and a splash of tough love, to help you <strong><em>take control of your time and get more written.</em></strong></p>  <p><strong><em>This course also includes a special guest appearance with Andy Bombeck, son of the iconic American humor writer, Erma Bombeck.</em> </strong>Dave talks with Andy via Skype about how his mother built her wildly successful career – writing more than a dozen books, and more than 4,000 newspaper columns – at home, while raising three kids. </p>  <p>If you struggle with writer’s block and insecurities about your writing, course number one in this series will help you become a more confident writer. If you struggle to find the time, the environment, and the focus you need to <em>just sit down and write</em>, then <em>this</em> course will help you discover and create those things in your life. <strong><em>You’ll learn how to get a lot more written – and how to let go of that writing angst that gets in so many people’s way.</em></strong></p>", 
    "end_date": null, 
    "title": "Psychology of Writing 2: Defeat Distractions and Write More!", 
    "price": "20.00", 
    "instructors": "Dave Fox", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/725356_691c_2.jpg", 
    "course_url": "https://www.udemy.com/writers-therapy-2-finding-and-creating-time-for-writing/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T10:21:45Z"
}