{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tDear Friend,  </p>  <p>  \t<strong style=\"\"><span>Do you set goals and New Year’s Resolutions every year but never achieve them?</span></strong>  </p>  <p>  \t<strong style=\"\">Do you want to Make more money, get in shape, lose weight, quit smoking, get out of debt?</strong>  </p>  <p>  \tWhether it’s a personal or business goal, it’s easy to get fired up and begin striving to achieve goals that you’ve set. At some point, weeks or months later you look back and realize that your motivation has waned and your plan of action has stalled. You haven’t move any progress towards your goal. Life has gotten in the way yet again.  </p>  <p>  \t<strong style=\"\">Would you like to Know How to Achieve all the Goals That You Set?</strong>  </p>  <p>  \tIn this course, you will learn the <strong style=\"\">SMART </strong>method of goal setting, and how to use it to plan and execute goals in a step-by-step fashion.  </p>  <p>  \t<strong style=\"\">You&#039;re about to learn:</strong>  </p>  <ul style=\"\">  \t<li><span>How to use the SMART goal setting system to create meaningful and achievable goals</span></li>  \t<li><span>How to create an action plan for maximum achievement and success</span></li>  \t<li><span>How to develop clear concise steps to follow that will guarantee success</span></li>  \t<li><span>How to use time management tools to increase productivity and help you stay on track</span></li>  \t<li><span>How to avoid setting unrealistic goals</span></li>  \t<li><span>Learn the 4 surefire ways to fail at reaching your goals and how to avoid them</span></li>  \t<li><span>How to eliminate the negative self-talk and change it into positive thoughts</span></li>  \t<li><span>How to stay motivated when things don&#039;t go as planned</span></li>  \t<li><span></span><span>Receive <strong style=\"\">SUPPLEMENTAL </strong>and <strong style=\"\">BONUS </strong>materials at the end of the course that will help you achieve goal setting success even faster</span></li>  </ul>  <p>  \t<span>Come join me, as we take this journey together, and make this your <strong style=\"\">BEST YEAR EVER!</strong></span>  </p>", 
    "end_date": null, 
    "title": "SMART Goal Setting Made Simple: A Step-by-Step Success Guide", 
    "price": "20.00", 
    "instructors": "Lifecademy Courses", 
    "commitment": "43 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/404060_5c8b_2.jpg", 
    "course_url": "https://www.udemy.com/smart-goal-setting-made-simple/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-26T03:51:33Z"
}