{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">Great Course </strong>- </em><em style=\"\">The course contains lot of tools and techniques which will definitely drives towards setting of goal which is single most virtue for successful living. thanks... - <strong style=\"\">Anusha (Student)</strong></em></p><p><em style=\"\"><strong style=\"\">It leads you somewhere.</strong>..</em><em style=\"\">Most people just act for the sake of it. That&#039;s wrong. If you don&#039;t know where you are going, you won&#039;t be able to walk that way. Once you know where you&#039;re going you can put all of the necessary effort needed into achieving that goal and THIS COURSE is your perfect companion to do so. Trust Boomy to lead the way and you&#039;ll find your own in a heartbeat.- <strong style=\"\">Max (student)</strong></em></p><p>  \t<strong style=\"\">****Updated For 2015****</strong>  </p>  <p>  \t<strong style=\"\">Join Over 3800 Students!</strong>  </p>  <p>  \t<strong style=\"\">Have you ever wondered how ordinary people achieve extraordinary results?</strong>  </p>  <p>  \t  Can you also join the elite 3% of the society that go from one level of accomplishment to another? Do you think success is only for some people? Can you imagine living the life you really want?  The good news is that you can create the future you want by starting today.  There are some simple rules to follow that will set you on the pathway to the success destination you desire for your life!  </p>  <p>  \t  I have revealed what you need to do in a few easy to follow steps within this Goal Setting and Daily Planning Course!  </p>  <p>  \t<strong style=\"\">I have structured the course in 3 parts </strong>  </p>  <ul style=\"\">  \t<li>Part 1 – Details important elements about goal setting with examples </li>  \t<li>Part 2 – Introduces my “Unique&quot; daily planner template </li>  \t<li>Part 3 – Pulls the parts together with the Unique Template to action your goals</li>  </ul>  <p>  \t  It you want to achieve the success you have always dreamed about; have a better life for you and your family, wake up and be excited every morning because you love what you do and if you want a purposeful life; then this course is for you!  </p>  <p>  \t  In this easy to follow step by step guide I have also included my unique daily planner that will revolutionise your goal setting efforts and turbo charge your desire to succeed.  </p>  <p>  \t  You know there are no short cuts in this course neither is it for those looking for the get rich quick schemes.  </p>  <p>  \t  What I am teaching you are proven techniques that have worked for success achievers from all works of life and I know will work for you if you take action!  </p>  <p>  \t<strong style=\"\">Highlight include: </strong>  </p>  <ol style=\"\">  \t<li>How to write and achieve your life goals </li>  \t<li>How Goal Setting really works </li>  \t<li>The secrets to successful goal setting </li>  \t<li>Goal setting techniques </li>  \t<li>What can hinder you from actualizing your goals  Using a daily template</li>  </ol>  <p>  \t  It is time to get on the right path to change your future forever by enrolling on this life-transforming course – now!. This course comes with a <strong style=\"\">30 Day Money Back Guarantee</strong> so you start on the winning side from the moment you enroll.  </p>  <p>  \t<strong style=\"\">Benefits of this course include:</strong>  </p>  <ul style=\"\">  \t<li>Increasing your financial base </li>  \t<li>Creating the future you want </li>  \t<li>Enjoying an extremely productive &amp; purposeful life </li>  \t<li>You will become much more fulfilled </li>  \t<li>Becoming an all-round super achiever</li>  </ul>  <p>  \t  Al future update and additions are also free to you. Future price increases will not affect you either.  </p>  <p>  \t<strong style=\"\">So why delay another minute, why postpone the future you desire. – Enroll Now!</strong>  </p><p><strong style=\"\">This course comes Life Time access Plus a 30 Day Money Back Guarantee. </strong></p>", 
    "end_date": null, 
    "title": "Smart Goal Setting: How to Create The Future You Want Today", 
    "price": "50.00", 
    "instructors": "Boomy Tokan", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/373968_a9e3_3.jpg", 
    "course_url": "https://www.udemy.com/goal-setting-start-creating-the-future-you-want-today/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-19T15:36:58Z"
}