{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li>     Have you ever looked on your life and felt stuck as if it was a dead end job?</li><li>     You worry that time is passing by while you feel helpless to change anything.</li><li>     Or maybe it feels as though your life was setup to fail from the very start?</li></ul>\n\n\n\n\n\n<p>After all… you look around and see plenty of people succeeding and getting what they want in life. Yet for other people life seems like an endless struggle.\n\n  </p>\n\n<p><strong class=\"redactor-inline-converted\">Well I have discovered 1 truth about successful people. And how they are different.</strong>\n\n  </p>\n\n<p>And it has nothing to do with:\n\n  </p>\n\n<ul><li>     Being born lucky</li><li>     Having rich parents</li><li>     Having a high IQ</li></ul>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">I believe that it all comes down to your DAILY HABITS</strong></p>\n\n\n\n<p>here are good habits and bad habits. The good habits always produce success and they don’t get outdated.<br></p>\n\n<p>Here’s a famous quote from Aristotle: <em>“We are what we repeatedly do. Excellence then, is not an act, but a habit”</em>.\n\n  </p>\n\n<p>Successful people have better habits than average people. That’s why the rich get richer and the poor get poorer. The successful are stuck on a loop that leads to success.</p>\n\n<p>I have created this training to shed some light on the habits that are common among all successful people.\n\n  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What You'll Learn:</strong></p>\n\n<p>You will learn proven strategies of success\n\n  </p>\n\n<p>You will learn positive habits that successful people use to earn more money, get more enjoyment in life, develop fulfilling relationships and achieve their goals.\n\n  </p>\n\n<p>And you’ll discover practical methods that you can use to deal with failure, to face your fears and develop more confidence in your abilities.\n\n  </p>\n\n\n\n\n\n\n\n<p>Now I have included some preview lessons for you to check out. So that you know what to expect from this video series.<br></p>\n\n<p>I want to take the risk off your decision. Either you like it or your money back.\n\n  </p>\n\n<p>And I believe in this training you will learn practical methods that you can use instantly to enrich your life and set yourself up for success.\n\n  </p>\n\n<p>And form success habits that will last a lifetime.\n\n  </p>\n\n<p>To get started click <strong>“Take this course”.</strong></p>", 
    "end_date": null, 
    "title": "Success Habits: How to get confident, earn money, enjoy life", 
    "price": "20.00", 
    "instructors": "Tom Wiztek", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/866186_f5c4.jpg", 
    "course_url": "https://www.udemy.com/success-habits-how-to-get-confident/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-01T20:52:25Z"
}