{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Mude você…</strong></p><p>Por qual momento você está passando agora? Felicidade, dúvida ou tristeza? Como anda sua vida? Como andam suas vendas? Seus resultados? Você REALMENTE fez algum planejamento no começo do ano, se fez, ainda lembra qual? Conseguiu atingir esta meta? Quer saber, não importa a resposta de nenhuma destas perguntas, pois se você está ganhando mais, vai querer ainda mais, se continua igual, gostaria de melhorar e se o ano piorou, daria tudo para MUDAR. Sim, esta é a palavra chave, a única constância que existe na vida é a MUDANÇA. E é exatamente sobre isso que eu quero falar com você… por isso peço para que você feche os olhos por vinte segundos apenas e pense em tudo que você leu aqui até agora, analise a sua vida. <strong>É sério mesmo, feche os olhos…</strong> <strong>Você realmente fechou?</strong></p><p>Sim, eu sei que muita coisa podia ser diferente, eu também tenho estes sentimentos quase todos os dias. Também sei que existe uma crise, que vivemos em um país de condições adversas e não vou ser arrogante ou cretino para dizer que a culpa é sua. É difícil, eu sei, não são apenas atitudes, mas uma soma de fatores ao longo da vida, de coisas que não aconteceram. Acredite, a culpa não é sua, muita coisa aconteceu sem você ter idade ou conhecimento para tal, mas tudo bem, o que importa é que agora as coisas podem mudar.<strong> Você não está lendo este texto? Então existe um sentimento de mudança em você.</strong></p><p>A mudança é um sentimento revolucionário, que altera a própria realidade, algo tão importante para você quanto para mim. <em>O seu crescimento pessoal altera tudo a sua volta e o próprio mundo, no momento que você deseja realmente mudar, esquecer o passado, não se preocupar com o futuro e prosperar AGORA</em>, aí sim você terá interesse em aprender e evoluir. Esta minha conversa com você é sobre como posso te ajudar, para você me ajudar e assim ajudar todo o mercado imobliário. Simples, com a mudança de pensamento, com o foco em desevolvimento e o desejo de ser MAIS</p><p><strong>Não existe prosperidade sem mudança, não existe pessoa de sucesso sem entender que o mundo MUDOU e que ele MUDA cada dia mais rápido.</strong> Porém, não são só dificuldades, o aprendizado constante vai te trazer resultado para todos os aspectos da sua vida e vai te ensinar a viver bem não importe o que. A ignorância é o seu pior inimigo e ao derrotá-la, você naturalmente irá cada dia mais… fazer parcerias, trabalhar em rede, frequentar congressos, cursos e palestras, vender mais e ser mais feliz. Hoje é o seu dia, todo dia é, amanhã o sol vai nascer para te dar mais uma chance e você irá brilhar junto a ele. Me dê a mão, deixa eu te guiar, te fazer MAIS, vamos ao topo. Lá não existe derrota, só um milhão de chances e oportunidades.</p>", 
    "end_date": null, 
    "title": "Sucesso Pessoal", 
    "price": "50.00", 
    "instructors": "Roberto Pantoja", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733488_27af_4.jpg", 
    "course_url": "https://www.udemy.com/treinamento-motivacional/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T23:24:53Z"
}