{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t                        Succeed through Me Management is a unique system, designed by the creator of this course.<br style=\"\">  \t  This system applies one fundamental management skill:  reaching targets.  By the time you finish this course, you&#039;ll learn <strong style=\"\">how to apply fundamental management principles to your life</strong> in order to achieve your <strong style=\"\">goals</strong>.  </p>  <p>  \t                        If you don’t have what you want because you don&#039;t know where to begin, start here.  This course may well launch you onto path to success.  </p>  <p>  \t<strong style=\"\">The system is simple on purpose</strong>.  I believe in <strong style=\"\">simplicity to achieve clarity</strong>. <br style=\"\">  \t  In my workshops, people have told me that moving forward was made so easy with the clarity my presentations provided.  The mind operates much better when clarity reigns over thought processes.  People find solutions more easily and are able to think and create momentum.  </p>  <p>  \t                    I provide participants with practical <strong style=\"\">tools and ideas </strong>to get them started then . . . the hope is that participants will continue to adjust the system to suit them.  </p>  <p>  \t                The intention is that people will take these fundamentals tools and re-create them to suit themselves once they have worked with the materials provided.  </p>  <p>  \t  Managing your life your way means exactly what it says, however, we all need a place to start.  <strong style=\"\">This course provides the way to begin your journey.  </strong>  </p>  <p>  \t                    Wants and desires are great.  Setting goals in writing is wonderful but most of us have no idea where to start realizing those dreams.  </p>  <p>  \t                 I give you <em style=\"\"><strong style=\"\">practical tools</strong></em> with which to do it.  Work with the tools and get underway to making your wants a reality.  Eventually, you&#039;ll develop your own style.  </p>  <p>  \t<strong style=\"\">If you&#039;re looking for a magic bullet, you won&#039;t find it here but you will find help to get you going.<br style=\"\">  \t</strong>  </p>  <p>  \t                        Management is not “one size fits all” but a series of successes and missteps on a course towards a specified target.  Expect that getting what you want has no direct process but, like a ship at sea, your journey will be filled with obstacles, detours, changes to course and, finally, success.  </p>  <p>  \t<strong style=\"\">Manage your dreams so they come true – start here.  </strong>  </p>", 
    "end_date": null, 
    "title": "The Missing Link Between Setting and Achieving Goals", 
    "price": "20.00", 
    "instructors": "Lorraine Arams", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385982_435f_5.jpg", 
    "course_url": "https://www.udemy.com/succeed-through-me-management/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T20:08:05Z"
}