{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Course Updated 22 January 2016<br></strong></p><p><strong>Why are 16,560 students wanting me to mentor them in 37 Udemy courses? 16,560 students have started learning from me since August 7th 2015. Shouldn't you find out why?</strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p><strong></strong></p><p>Are you sincerely COMMITTED To vastly improving your current circumstances and results?<br></p><p>Do you have a DEEP yearning to start getting your dreams and your goals?</p><p>Take this course to get a mindset change to propel you into finally getting your dreams and goals.</p><p>What You Will Get From This Course?</p><p>I grew up in a small village in South Africa. As a person of Indian background, the government at the time wanted people of the same \"color\" to stay in the same areas and attend the same schools. I remember vividly not being able to eat in certain restaurants or go clothes shopping in certain stores due to the \"Whites Only\" law. This experience gave me a burning desire to become someone, to mark my position in this world.</p><p>I will share my experiences and my mindset change that has resulted in me now being an in demand platform speaker and best selling author. I advise a number of high profile celebrities who have been featured on Miss USA, The Apprentice, Miss Universe, BET, WWE, CNN, ESPN, USA Today, Wall Street Journal, NBC, CBS, Fox, ABC, Entrepreneur Magazine and numerous other television shows and radio stations around the world</p><p>You will learn the Goal Maker techniques that I have learnt  and continue to use every day.</p><p>You will get the understanding and desire to also make your mark on the world (no matter how big or small you choose!) BUT you will be pushed to take action (MASSIVE ACTION!)</p><p>If you are 100% committed to change your life, then take this course and implement every single aspect into your business and life!</p>", 
    "end_date": null, 
    "title": "The Goal Maker - Goal Setting Techniques That Propel You", 
    "price": "20.00", 
    "instructors": "Nikhil Parekh", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588058_fa10_2.jpg", 
    "course_url": "https://www.udemy.com/goalgetter/", 
    "currency": "USD", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T03:32:40Z"
}