{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>\t<strong class=\"redactor-inline-converted\">Women Helping Women to Succeed!  Key Skills for an Empowered and Satisfying Life</strong>  </p>\n\n<p>  \t<strong class=\"redactor-inline-converted\">By women and for women, </strong>this course pulls together lectures to help you:  </p>\n\n\n\n\n\n<ul>  \t<li>Boost your confidence and self-esteem so you      start with a foundation for success</li>  \t<li>Learn      leadership skills to implement in the workplace, at home or in your own      business.</li>  \t<li>Take      care of yourself in the midst of taking care of so many others</li>  \t<li>Develop      hands-on business skills if you're engaged in your own business or others</li>  \t<li>Learn social media and web      development insights.</li><li>Take up a new hobby.</li>  </ul>\n\n\n\n\n\n<p>This course demonstrates how vibrant, passionate women from across the globe can collaborate and produce an informative online training program to inspire and empower other women. </p><p>We've developed over 50 courses individually and we're excited to bring some of that expertise and knowledge to other women in this free course. </p><p>Check out our bios to see the range and depth of knowledge of your <strong>5-star instructors. </strong></p><p>We also invite you to join our women's only Facebook group,<strong> \"Women Helping Women to Succeed.\"</strong></p>\n\n\n\n\n\n<p>  \t  This course celebrates our commonalities, diversity and strengths, it taps into our areas of expertise and aims to give you a taste of what's possible both as individuals and as a team.  </p>\n\n\n\n\n\n<p>    </p>", 
    "end_date": null, 
    "title": "Women Helping Women to Succeed", 
    "price": 0, 
    "instructors": "Denise Fletcher, Kristen Palana, Lisa Cain, PhD, Deborah Wojcicki, Kellie Edwards, Jacqueline Seidel, Leap  Training Institute, Snehal Wagh, Majo Jacinto, Barrett Clemmensen Powell, Teresa L Greenway, Anneke Camstra, Angelika Davey, Jacqui Malpass, Sarah Simpson, Sharon Ramel, Mary Cummings", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/430238_9f67_2.jpg", 
    "course_url": "https://www.udemy.com/woman-to-woman-empowering-women-globally-for-success/", 
    "subject_name": [
        "Motivation"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-23T19:46:25Z"
}