{"selfpaced": false, "topic_name": ["Business Analytics and Intelligence"], "description": "\n\n                    \n                    \n                    \r\nIn a digital world, data has gone ‘big’ – ushering in the age of the zettabyte. This course shows you how big data equals business opportunity. Find out what ‘big data’ means and where it comes from – including ordinary transactions and social interactions. See how smart businesses use data to target their offerings and get ahead of market trends. Consider how marketing data can be based on false assumptions such as the ‘last click myth’.\r\nConsider the promises and threats of big data for organisations and individuals, such as the capacity of data to track a customer along the pathway to purchase; and the issues of democracy and privacy that arise when data is collected and used.\r\nWhat will I learn?\r\n\r\nDefine big data and outline ways in which it is remapping the future of marketing:\r\n\r\nDefine the measurement units of big data\r\nRecognise different types of data\r\nProvide examples of where big data is created\r\n\r\nIdentify the basic attributes of big data:\r\n\r\nCategorise data according to its level of refinement\r\nProvide examples of data analytics that achieve refinement\r\nOutline positive and negative social impacts of data proliferation\r\n\r\nOutline business challenges and opportunities in managing and using big data:\r\n\r\nDistinguish between brand-centric and customer-centric uses of data\r\nIdentify the key stakeholders within organisations in data management\r\nProvide examples of targeted data acquisition for marketing benefit\r\n\r\nOutline ways in which effective marketing can exploit big data\r\n\r\nDefine media attribution and outline its importance to marketing strategy\r\nList some common tools in the marketing toolkit, and outline their purposes\r\n\r\nProvide examples of marketing strategies that can capture trackable data in order to improve the quality of attribution.\r\n\r\nThis course requires approximately 2 - 4 hours of study per week, but can vary depending on the student. This includes watching videos, and taking quizzes and assessments.\r\nIf you pass this course you'll receive a Certificate of Achievement. While this certificate isn't a formal qualification or credit, you can use it to demonstrate your interest in learning about this area to potential employers or educational institutions.\r\nWhere could this lead me?\r\nIf you're wondering what your future could look like in this area, here are some potential careers you could head towards.\r\n\r\nBusiness or Commercial analyst\r\nLearning analyst\r\nAnalytics and Customer insights\r\nAnalytics consultant\r\nMarketing &amp; Analytics manager\r\n\r\n\n\n                                            Syllabus\n                        \r\n\r\n\r\n\r\nMODULE 1: INTRODUCTION TO BIG DATA\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 2: BIG DATA AND MARKETING\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 3: PRINCIPLES OF MARKETING WITH BIG DATA\r\n\r\n \r\n \r\n\r\n\r\n\r\nMODULE 4: BIG DATA AND PREDICTIVE MARKETING\r\n\r\n\r\n\r\n\n                                    ", "end_date": "2016-02-08T00:00:00Z", "title": "Big Data for Better Performance", "price": 0, "instructors": "Bud Keegan", "institution_name": [], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.open2study.com//node/1777", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Open2Study"], "start_date": "2016-01-11T00:00:00Z"}