{"selfpaced": false, "topic_name": ["Business Analytics and Intelligence"], "description": "\n\n                    \n                    \n                    This is the fourth course in the Data Warehouse for Business Intelligence specialization. Ideally, the courses should be taken in sequence.  In this course, you will gain the knowledge and skills for using data warehouses for business intelligence purposes and for working as a business intelligence developer. You’ll have the opportunity to work with large data sets in a data warehouse environment and will learn the use of MicroStrategy's Online Analytical Processing (OLAP) and Visualization capabilities to create visualizations and dashboards. \n\nThe course gives an overview of how business intelligence technologies can support decision making across any number of business sectors. These technologies have had a profound impact on corporate strategy, performance, and competitiveness and broadly encompass  decision support systems, business intelligence systems, and visual analytics. Modules are organized around the business intelligence concepts, tools, and applications, and the use of data warehouse for business reporting and online analytical processing, for creating visualizations and dashboards, and for business performance management and descriptive analytics.\n\n                                            Syllabus\n                        Decision Making and Decision Support SystemsModule 1 explains the role of computerized support for decision making and its importance. It starts by identifying the different types of decisions managers face, and the process through which they make decisions. It then focuses on decision making styles, the four stages of Simon’s decision making process, and common strategies and approaches of decision makers. In the next two lessons, you will learn the role of  Decision Support Systems (DSS), understand its main components, the various DSS types and classification, and how DSS have changed over time. Finally, in lesson 4, we focus on how DSS supports each phase of decision making and summarize the evolution of DSS applications, and on how they have changed over time.  I recommend that you go to Ready Made DSS sites and use some of DSS that are listed for various types of decisions. You will need to install MicroStrategy Desktop to analyze three stand-alone offline dashboards in a peer evaluated exercise.Business Intelligence Concepts and Platform CapabilitiesNow that you understand the conceptual foundation of decision making and DSS, in module 2 we start by defining business intelligence (BI), BI architecture, and its components, and relate them to DSS.  In lesson 2, you will learn the main components of  BI platforms, their capabilities, and understand the competitive landscape of BI platforms. In lesson 3, you will learn the building blocks of business reports, the types of business reports, and the components and structure of business reporting systems . Finally in lesson 4, you will learn different types of OLAP and their applications, and comprehend the differences between OLAP and OLTP. You will need to use MicroStrategy Desktop to create effective and compelling data visualizations to analyze data and acquire insights into business practices in a peer evaluated exercise. \nData Visualization and Dashboard DesignThis module continues on the top job responsibilities of BI analysts by focusing on creating data visualizations and dashboards. You will first learn the importance of data visualization and different types of data that can be visually represented. You will then learn about the types of basic and composite charts. This will help you to determine which visualization is most effective to display data for a given data set, and to identify best practices for designing data visualizations. In lesson 3, you will learn the common characteristics of dashboard, the types of dashboards, and the list attributes of metrics usually included in dashboards. Finally in lesson 4, you will learn the guidelines for designing dashboard and the common pitfalls of dashboard design. You will need to use MicroStrategy  Desktop Visual Insight to design a dashboard for a Financial Services company in a peer evaluated exercise. Business Performance Management SystemsThis module focuses on how BI is used for Business Performance Management (BPM). You will learn the main components of BPM as well as the four phases of BPM cycle and how organizations typically deploy BPM. In lesson 2, you will learn the purpose of Performance Measurement System and how organizations need to define the key performance indicators (KPIs) for their performance management system. In lesson 3, you will learn the four balanced scorecards perspectives and the differences between dashboards and scorecards. You will also be able to compare and contrast the benefits of using balanced scorecard versus using Six Sigma in a performance measurement system. Finally in lesson 4, you will learn the role of visual and business analytics (BA) in BI and how various forms of BA are supported in practice. At the end of the module, you will apply these concepts to create a dashboard, blend it with external data sets, and explore various visualization capabilities to find insights faster in a peer evaluated exercise.BI Maturity, Strategy, and Summative ProjectModule 5 covers BI maturity and strategy. You will learn different levels of BI maturity, the factors that impact BI maturity within an organization, and the main challenges and the potential solutions for a pervasive BI maturity within an organization. The last lesson will focus on the critical success factors for implementing a BI strategy, BI framework, and BI implementation targets. Finally, in your summative project, you will use MicroStrategy visual analytics capabilities to analyze KPIs for a fast food company to find the causes for problems .\n                                    ", "end_date": "2016-07-25T00:00:00Z", "title": "Business Intelligence Concepts, Tools, and Applications", "price": 0, "instructors": "Jahangir Karimi", "institution_name": ["University of Colorado System"], "commitment": "", "subject_name": ["Business & Management"], "course_url": "https://www.coursera.org/learn/business-intelligence-tools", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-20T00:00:00Z"}