{"selfpaced": false, "topic_name": ["Calculus & Mathematical Analysis"], "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nHow does the final velocity on a zip line change when the starting point is raised or lowered by a matter of centimeters?  What is the accuracy of a GPS position measurement?  How fast should an airplane travel to minimize fuel consumption? The answers to all of these questions involve the derivative. \n\nBut what is the derivative?  You will learn its mathematical notation, physical meaning, geometric interpretation, and be able to move fluently between these representations of the derivative.  You will discover how to differentiate any function you can think up, and develop a powerful intuition to be able to sketch the graph of many functions.  You will make linear and quadratic approximations of functions to simplify computations and gain intuition for system behavior.  You will learn to maximize and minimize functions to optimize properties like cost, efficiency, energy, and power.  \n\nLearn more about our High School and AP* Exam Preparation Courses\n\nCalculus 1B: Integration\n\nCalculus 1C: Coordinate Systems &amp; Infinite Series\n\nThis course was funded in part by the Wertheimer Fund.\n\n*Advanced Placement and AP are registered trademarks of the College Board, which was not involved in the production of, and does not endorse, these offerings.\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                            Syllabus\n                        Abridged Syllabus\r\nLimits\r\n\r\nLimit Laws\r\nContinuity\r\nIntermediate Value Theorem\r\n\r\nDifferentiation\r\n\r\nIntroducing the Derivative\r\nRules for differentiation of all known functions\r\nApproximations\r\n\r\nApplications of Differentiation\r\n\r\nCurve Sketching\r\nOptimization\r\nRelated Rates\r\n\n                                    ", "end_date": "2015-09-01T00:00:00Z", "title": "18.01.1x: Calculus 1A: Differentiation", "price": 0, "instructors": "David Jerison", "institution_name": ["Massachusetts Institute of Technology"], "commitment": "6-10 hours", "subject_name": ["Mathematics"], "course_url": "https://www.edx.org/course/calculus-1a-differentiation-mitx-18-01-1x", "duration": "13 weeks", "language_name": ["English"], "provider_name": ["edX"], "start_date": "2015-06-02T00:00:00Z"}