{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Poetry lives in any reader, not necessarily in performance by the poet or a trained actor. The pleasure of actually saying a poem, or even saying it in your imagination—your mind’s ear—is essential. That is a central idea of “The Art of Poetry,” well demonstrated by the videos at favoritepoem.org: the photographer saying Sylvia Plath’s “Nick and the Candlestick,” the high school student saying Langston Hughes’ “Minstrel Man.” Those readers base what they say about each poem upon their experience of saying it.\n\nThe course is demanding, and based on a certain kind of intense reading, requiring prolonged, thorough— in fact, repeated—attention to specific poems.\n\nThe focus will be on elements of the art such as poetry’s historical relation to courtship; techniques of sound in free verse; poetry and difficulty; kidding and tribute—with only incidental attention to “schools,” jargons, categories, and coteries.\n\nLearners are encouraged to think truly, carefully and passionately about what the poem says, along with how the poem feels in one’s own, actual or imagined voice. As Robert Pinsky says, in the Preface to Singing School: “this anthology will succeed if it encourages the reader to emulate it by replacing it . . . create your own anthology.” In a comparable way, this course hopes to inspire a lifelong study of poetry.\n\n                                    ", 
    "end_date": "2016-05-10T00:00:00Z", 
    "title": "ARPO222x: The Art of Poetry", 
    "price": 0, 
    "instructors": "Robert Pinsky", 
    "institution_name": [
        "Boston University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/art-poetry-bux-arpo222x-0", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-03-29T00:00:00Z"
}