{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    This literature course will explore Upton Sinclair’s 1906 novel The Jungle, which portrays the exploitation of immigrants in the industrial USA of the early 20th century. However, this novel is most remembered for its depiction of health violations and unclean conditions in the American meatpacking industry.\nThese findings were based on an investigation Sinclair did as a journalist..  Sinclair spent several weeks gathering information while working in the meatpacking plants of the Chicago stockyards for the newspaper Appeal to Reason. The Jungle was first published in serial form in 1905 in the newspaper. A film version of the novel was made in 1914, but it has been lost.\nThe novel highlights working class poverty, the lack of social support, harsh living and working conditions, and a bleak outlook for the working poor. This is contrasted with the corruption of those in power.\nParticipants in this course will read, discuss, and write about the text and its influence. As in most book clubs, the focus will be on lively discussion. Course materials will include background information for understanding the text, as well as vocabulary and language support. Assessment will include quizzes and short writing assignments.\n\n                                    ", 
    "end_date": "2016-11-07T00:00:00Z", 
    "title": "ColWri3.7x: \"The Jungle\" by Sinclair: BerkeleyX Book Club", 
    "price": 0, 
    "instructors": "Maggie Sokolik", 
    "institution_name": [
        "University of California, Berkeley"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/jungle-sinclair-berkeleyx-book-club-uc-berkeleyx-colwri3-7x-0", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-10-03T00:00:00Z"
}