{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Ce MOOC sera consacré au genre littéraire et médiatique de la fantasy. Il permettra d'approfondir un goût aujourd'hui largement partagé grâce de nombreuses œuvres à succès (Harry Potter, Le Seigneur des Anneaux, Game of Thrones...). On y présentera l'ampleur et la diversité thématique et historique de la fantasy : influence des mythes, héritage du Moyen Âge, grands auteurs du XIXe au XXIe siècle, romans, films ou jeux visant les enfants, les adolescents ou les adultes. Les cours seront assurés par une équipe de spécialistes du domaine, toutes rattachées à l'Université d'Artois.\n\n                                            Syllabus\n                        Semaine 0 : Présentation du MOOC et définition de la fantasy (toute l'équipe)Semaine 1 : Histoire de la fantasy (Anne Besson)Mythes et légendes, à l'origine de la fantasy ?Naissance de la fantasy : l'Angleterre victorienneTolkien et les InklingsLa fantasy traverse l'AtlantiqueLe succès contemporainLa fantasy en France, la fantasy françaiseSemaine 2 : La fantasy pour la jeunesse (Isabelle Olivier)La fantasy « pour la jeunesse » : une redondance ?Les métamorphoses du conte en fantasy pour la jeunesseLes archétypes, stéréotypes et les évolutions de la fantasy pour la jeunesse aujourd’huiDeux cycles marquants en fantasy pour la jeunesse : Harry Potter et A la croisée des mondesLes autres mondes de la fantasy pour la jeunesse, entre évasion et révolutionSur l’immersion fictionnelle en fantasy pour la jeunesse : représentations et enjeuxSemaine 3 : Moyen Âge et fantasyÉpopée (Emmanuelle Poulain-Gautret)Fantasy historique, médiévale, épique - les cadres de la sociétéFaire la guerre - équipements et combatsFigures héroïques: héros et constellations héroïques, idéologie, initiationMerveilleux (Myriam White-Le Goff)Héroïnes : amoureuses, fées ou sorcières ?Surnaturel, merveille et magieReligion et spiritualitéSemaine 4 : Fantasy urbaine et romance paranormale (Isabelle-Rachel Casta)Un cadre, une temporalité, des codes: un nouveau merveilleuxAncêtres prestigieux, contemporains flamboyants : notre « legendarium »!Aimer... pour l’Eternité: car Love never diesUn cas d’école: Le Fantôme de l’opéra, dans tous ses étatsLa « bit-lit » et ses avatars : Buffy, Angel, Vampire Diaries...De Dracula aux \"star-crossed lovers\": vers une Renaissance?Semaine 5 : La fantasy dans les médias (Anne Besson)Les mondes secondaires, une construction multimédiatiqueL'illustration, média historique de la fantasyLe jeu de rôles - Donjons et DragonsFantasy et jeu vidéoLa fantasy au cinémaFantasy et séries télévisées\n                                    ", 
    "end_date": "2016-03-08T00:00:00Z", 
    "title": "Fantasy, de l'Angleterre victorienne au Trône de fer", 
    "price": 0, 
    "instructors": "Isabelle-Rachel Casta and Anne Besson", 
    "institution_name": [
        "Université d'Artois"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/univartois/35001S02/session02/about", 
    "duration": "5 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-02-02T00:00:00Z"
}