{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Identificar los aportes claves de la obra de Gabriel García Márquez\n\nEn este curso usted podrá identificar los aportes narrativos del escritor colombiano Gabriel García Márquez a la literatura universal a través del estudio de tres de las grandes obsesiones del autor: el poder, la historia y el amor.\n\nUsted tendrá la oportunidad de gozar de la lectura de las siguientes obras: La increíble y triste historia de la cándida Eréndira y su abuela deslamada (1972), El Otoño del patriarca (1975), Crónica de una muerte anunciada (1981), El amor en los tiempos del cólera (1985), El general en su laberinto (1989) y Del amor y otros demonios (1994).\n\nAl estudiar de forma cronológica estas obras publicadas después de Cien años de soledad (1963), usted reconocerá la evolución narrativa de García Márquez.\nAdicionalmente, usted tendrá la oportunidad de profundizar en diferentes temas como: la novela del dictador, las particularidades de la nueva novela histórica, las influencias literarias del autor, el tema de la vejez, entre otras.\n\nProfundizar en el universo de Gabriel García Márquez\n\nFinalmente, al profundizar en el universo narrativo de García Márquez después de Macondo, usted se dejará seducir por la riqueza de su lenguaje y entenderá por qué este escritor es considerado uno de los grandes genios literarios de todos los tiempos.\n\nA través del estudio de estas obras usted:\n\nValorará la obra de Gabriel García Márquez \nApreciará la forma en que evoluciona \nDesarrollará la capacidad de relacionar sus diferentes obras \nIdentificará algunos de los elementos centrales de su obra\n\n\nEste curso también estará disponible en Inglés a partir del 30 de Mayo del 2016. Para mayor información y para inscribirte por favor visita la página del curso.\n\nThis course is also running in English, starting 30 May 2016. To find out more and enrol, visit the course page.\n\n\n                                    ", 
    "end_date": "2016-07-25T00:00:00Z", 
    "title": "Gabriel García Márquez: entre el poder, la historia y el amor", 
    "price": 0, 
    "instructors": "Andrea Junguito and Hugo Ramirez", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/gabriel-garcia-marquez?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "8 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}