{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    This free online course will introduce you to some of Hans Christian Andersen’s most popular fairy tales, help you analyse the themes in these, and give you the possibility to discuss the author’s cross-cultural importance today, as the inspiration behind many popular books and movies.\n\nInterpret Hans Christian Andersen’s fairy tales with experts from his birthplace\n\nYou will learn with experts from the HC Andersen Center at the University of Southern Denmark – an internationally renowned research institution located in the writer’s birthplace, Odense.\n\nEach week, these experts will guide a discussion, analysis and interpretation of one or more of Hans Christian Andersen’s fairy tales, including:\n\n\n  The Tinderbox\n  The Travelling Companion\n  The Little Mermaid\n  The Snow Queen (the inspiration for Disney’s Frozen)\n  The Story of a Mother\n  The Red Shoes\n\n\nNew English translations of the fairy tales will be used. You can download them from this website  .\n\nYou will explore the themes of each story, and investigate how they both conform with and digress from the patterns of the traditional folk tale.\n\nThe fairy tale genre became very popular in the period of literary history to which Hans Christian Andersen belongs, Romanticism, when childhood was discovered as an age that is important in its own right. What Hans Christian Andersen did with this genre is absolutely unique - there are no other writers of fairy tales like him.\n\nThrough the course, you will understand how Hans Christian Andersen’s authorship developed. From the rewriting of old folk tales via self-invented fairy tales to his so-called new fairy tales characterized by a modern approach.\n\nExplore Hans Christian Andersen’s enduring, universal appeal\n\nHans Christian Andersen grew from humble beginnings, to achieve fame and acknowledgement as an artist in both Europe and America while he was still alive. After his death, he became famous in Asia and all other parts of the world.\n\nThe majority of Hans Christian Andersen’s 157 fairy tales have been translated into at least 150 languages. They do not only create a fantasy world for children, but also explore universal, sinister and more adult themes such as death, grief and loss.\n\nThrough this course, you will discover why his stories have such an enduring and universal appeal - for both children and adults.\n\n\n                                    ", 
    "end_date": "2016-05-30T00:00:00Z", 
    "title": "Hans Christian Andersen’s Fairy Tales", 
    "price": 0, 
    "instructors": "Torsten Bøgh Thomsen, Johannes Nørregaard Frandsen, Jacob Bøggild and Ivy York Möller-Christensen", 
    "institution_name": [
        "Hans Christian Andersen Centre"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/hans-christian-andersens-fairy-tales?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-04-18T00:00:00Z"
}