{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nHUM 2.4x. The fourth of five modules in The Ancient Greek Hero in 24 Hours, “Hours 16-21: The Hero in Tragedy” finds us in the world of high classical poetry in drama, as brought to life in three tragedies of Aeschylus, two of Sophocles, and two of Euripides. We see here the Greek hero as best known to us from the perspective of world literature. The medium of drama makes heroes seem more familiar to us, since we think we know drama better than we know other verbal arts such as epic and lyric, but, by the time we finish analyzing the seven classical tragedies that we will be reading, we will see that the traditions of hero cult, infused into the verbal art of drama, cast an altogether new light on tragedy, defamiliarizing for us not only the heroes illuminated by this art but also the art itself. We will see, then, maybe for the first time ever, that the ancient Greek hero of tragedy was not at all like us – even less like us than the hero of epic or lyric. The male and female heroes of drama were larger than life, far more so than we may ever have imagined, reaching levels of both nobility and debasement that challenge our sense of equilibrium in the cosmos. As our close readings of our seven chosen tragedies will show, there was a disequilibrium in myths about heroes in the remote past, and this disequilibrium could be compensated only by experiencing the equilibrium of rituals in the immediate present – rituals culminating in the drama of heroic tragedy.\n See other courses in this series:Module 1, “Hours 1-5: Epic and Lyric”Module 2, “Hours 6-11: Signs of the Hero in Epic and Iconography”Module 3, “Hours 12-15: Cult of Heroes”Module 5, “Hours 22-24: Plato and Beyond”\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2014-11-19T00:00:00Z", 
    "title": "HUM2.4x: The Ancient Greek Hero in 24 Hours (Hours 16-21): The Hero in Tragedy", 
    "price": 0, 
    "instructors": "Gregory Nagy", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "5-8 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/ancient-greek-hero-24-hours-hours-16-21-harvardx-hum2-4x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-10-22T00:00:00Z"
}