{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nHUM 2.5x. The fifth and final module in The Ancient Greek Hero in 24 Hours, “Hours 22-24: Plato and Beyond” challenges the idea that Socrates was a hero, just as Plato’s Socrates himself challenges that same idea. And yet, as we will see from reading Plato’s Apology of Socrates and Phaedo, the idea of the hero is very much present in Plato’s works – just as it persists in works beyond Plato, whether or not these works adopt Plato’s project of trying to substitute philosophy for literature (especially for poetry). Just as poetry serves as a primary representative for the idea of the hero, we will discover though our close readings that the philosophical prose of Plato likewise represents this same idea - though now the hero is no longer some superhuman human. Rather, the real hero now becomes the word of philosophical dialogue, which is brought back to life much as a cult hero is brought back to life ever time a heroic life is narrated or dramatized. In Plato’s works, the narration and the dramatization show not the life of the hero but the life of the word that survives the speaker of the word, provided that the word engages in dialogue – a philosophical dialogue that contemplates the eternal truths of the cosmos. \n    See other courses in this series:Module 1, “Hours 1-5: Epic and Lyric”Module 2, “Hours 6-11: Signs of the Hero in Epic and Iconography”Module 3, “Hours 12-15: Cult of Heroes”Module 4, “Hours 16-21: The Hero in Tragedy”\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2014-12-10T00:00:00Z", 
    "title": "HUM2.5x: The Ancient Greek Hero in 24 Hours (Hours 22-24): Plato and Beyond", 
    "price": 0, 
    "instructors": "Gregory Nagy", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "5-8 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/ancient-greek-hero-24-hours-hours-22-24-harvardx-hum2-5x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-11-12T00:00:00Z"
}