{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    *Note - This is an Archived course*\n\nHUM 2.3x. The third of five modules in The Ancient Greek Hero in 24 Hours, “Hours 12-15: Cult of Heroes” explores the vast variety of perspectives brought to bear on the idea of the ancient Greek hero in the versatile medium of prose, as exemplified by authors as varied as Herodotus, the so-called father of history, and Philostratus, an intellectual from a post-classical period who was prodigiously well-versed in classical and pre-classical lore about cult heroes.\n\nIn Homeric poetry the idea of hero cult is implicit even though characters like Odysseus are not explicitly identified as cult heroes. The situation is different, however, in the poetry attributed to Hesiod, where the very idea of a cult hero is precisely outlined and illustrated, especially in the myth about the five generations of humankind. As we will see from the lively prose narratives of such learned and captivating authors as Herodotus and Philostratus, the mystique of cult heroes, both male and female, enthralled their adoring worshippers, who treasured the exotic stories of epiphanies and miracles that were linked with the places made sacred by the felt presence of heroes residing in the mother earth that concealed their bodies. We will even get the chance to read and analyze an eyewitness prose account of an actual initiation into the mysteries of a hero cult. This prose account brings home to us the seriousness of personally experiencing such an initiation, and it shows the emotional impact of making contact with the consciousness of superhuman forces that inhabit the mystical world of hero cult.\n\nSee other courses in this series:Module 1, “Hours 1-5: Epic and Lyric”Module 2, “Hours 6-11: Signs of the Hero in Epic and Iconography”Module 4, “Hours 16-21: The Hero in Tragedy”Module 5, “Hours 22-24: Plato and Beyond”\n\nHarvardX pursues the science of learning. By registering as an online learner in an HX course, you will also participate in research about learning. Read our research statement to learn more.\n\nThis is a past/archived course. At this time, you can only explore this course in a self-paced fashion. Certain features of this course may not be active, but many people enjoy watching the videos and working with the materials. Make sure to check for reruns of this course.\n\n                                    ", 
    "end_date": "2014-11-05T00:00:00Z", 
    "title": "HUM2.3x: The Ancient Greek Hero in 24 Hours (Hours 12-15): Cult of Heroes", 
    "price": 0, 
    "instructors": "Gregory Nagy", 
    "institution_name": [
        "Harvard University"
    ], 
    "commitment": "5-8 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/ancient-greek-hero-24-hours-hours-12-15-harvardx-hum2-3x", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2014-10-08T00:00:00Z"
}