{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Turn back if you would see your shores again.Do not set forth upon the deep,for, losing sight of me, you would be lost.-Paradiso, Canto II, lines 4-6\n\nJoy is the business of Paradiso, that much is clear; but could there be a more mysterious word in the whole realm of human imagination than “Joy?” “Joy” boggles the human imagination because it asks us to follow the vector of hope to its maximal extension and intention, until it arrives at that point which Dante locates “nel mezzo,” at the very center of everything, at that point where every centripetal and centrifugal force of both the physical universe of energy and the symbolic universe of creative imagination and meaning first arise and finally return.\n\nFrom beginning to end, the Pilgrim’s progress through Paradiso is enabled and guided by his enactment of the role to which he consented in the climactic episode of the Purgatorio in the garden of the Earthly Paradise. Now leaving Earth behind and beneath, the Pilgrim is transformed into the disciple; specifically, the disciple of Beatrice. She now becomes his true path, la diritta via, along which he gradually discovers the Joy that Christianity identifies as the hope of Resurrection.\n\nDante’s Paradiso maps the physics of freedom, tracing a universal history of meaning. Just as there is a physics of matter and energy, there is a physics of freedom governing the evolutionary history of hope which directs the human search for meaning in every person’s life and in all human culture. In this universe, meaning functions as does light in the physical universe, acting as its absolute measure and enforcing its most basic law—the law of relational identity, where “all are responsible to all for all.” Like the principle of relativity in the physics of energy, relational identity means that each personal existence has historical reality only in relation to all other personal identities.\n\nAlmost everyone agrees that the poetry of the Paradiso is sublime. Sublimity, however, is a highly rarefied and strenuously acquired taste. This is why Dante himself warns us in the second canto of the Paradiso that unless we have become used to eat the “bread of Angels,” we should turn back and not attempt to follow him on this final leg of his journey, and we as modern-day readers might well be tempted here to turn back as the Pilgrim himself was tempted in the second canto of the Inferno. But to paraphrase Virgil’s response then, which both encouraged and challenged, “Why be so afraid to reach for what your heart most hopes for; where else do you have to turn?”\n\nIn this course, you will be asked to participate in learning activities on both edX and on MyDante, an innovative platform for deep reading that emphasizes mindfulness and contemplative reading habits\nas key to deriving lasting meaning from poetic texts. The pedagogical approach of the course goes beyond mere academic commentary on the poem as literature; it introduces the reader to a way of thinking about the meaning of the poem at a personal level.  This module is the third of three modules that compose the full course. A module on the Vita Nuova and Inferno will launch on October 15, 2014, and a module on Purgatorio will launch in February 2015. This course features Robert and Jean Hollander's contemporary translations of Dante Alighieri's Inferno, Purgatorio, and Paradiso, permission courtesy of The Knopf Doubleday Publishing Group, a division of Random House LLC. The print editions contain valuable notes and commentary which are highly recommended as companions to the course materials.\n \n\n                                    ", 
    "end_date": "2015-07-15T00:00:00Z", 
    "title": "HUMX423-01x: The Divine Comedy: Dante's Journey to Freedom, Part 3 (Paradiso)", 
    "price": 0, 
    "instructors": "Frank Ambrosio", 
    "institution_name": [
        "Georgetown University"
    ], 
    "commitment": "8-10 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.edx.org/course/divine-comedy-dantes-journey-freedom-georgetownx-humx423-01x", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-06-10T00:00:00Z"
}