{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Laura Ingalls Wilder’s novels have inspired generations of readers of all ages. Unlike most fiction for young readers published during the Great Depression, Wilder’s Little House books have never gone out of print. While they are uniquely American, they seem to cross cultural boundaries, and have been translated into dozens of languages, from German and French to Indonesian and Japanese.\r\nYet Wilder’s work is also at the center of controversy. Who actually wrote the Little House series? How did Wilder’s personal life influence the direction and content of her fiction? Are the books a reliable and sensitive representation of the pioneer experience in the American West?\r\nThis course is designed to explore these issues and more. It will expand your understanding of the literary themes, style, and historical underpinnings of Wilder’s Little House series. You’ll gain insight into complex issues at the heart of contemporary Wilder scholarship: the question of authorship; Wilder’s depiction of American Indians and the frontier; the ethical ambiguities underlying autobiographical fiction and memoir.\r\nAt the end of this eight-week course, you’ll emerge with a clearer understanding of Wilder’s contribution to American children’s literature.\n\n                                    ", 
    "end_date": "2016-08-29T00:00:00Z", 
    "title": "Laura Ingalls Wilder: Exploring Her Work and Writing Life", 
    "price": 0, 
    "instructors": "Pamela Smith Hill", 
    "institution_name": [
        "Missouri State University"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.canvas.net/browse/missourisu/courses/laura-ingalls-wilder-1", 
    "duration": "12 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Canvas.net"
    ], 
    "start_date": "2016-06-06T00:00:00Z"
}