{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    ¡Bienvenidos al curso Leer a Macondo!\n\nGabriel García Márquez es un escritor colombiano que ganó el premio Nobel de Literatura en 1982 y ha sido reconocido como uno de los escritores más importantes del siglo XX. Sus obras han sido traducidas a más de 35 idiomas, han sido adaptadas para televisión y cine y han inspirado múltiples obras de arte.\n\nExplore 5 de las primeras obras del autor, que están relacionadas con Macondo.\n\nEl principal objetivo de este curso es explorar las contribuciones literarias de Gabriel García Márquez a la literatura universal a través de cinco de sus primeras obras, todas con una fuerte relación con Macondo, un pueblo inspirado en Aracataca, el lugar de nacimiento del autor en Colombia. Ante todo, usted tendrá la oportunidad de gozar de la lectura y el análisis de las siguientes obras:\n\n\n  La hojarasca (1955),\n  El coronel no tiene quien le escriba (1961),\n  La mala hora (1962),\n  Los funerales de la Mamá Grande (1962) y\n  Cien años de soledad (1967).\n\n\nAl entrar en el universo narrativo de García Márquez, usted se dejará seducir por la riqueza de su lenguaje y logrará identificar las obsesiones del autor. A través del estudio de estas obras usted:\n\n\n  Valorará la obra de Gabriel García Márquez\n  Apreciará la forma en que evoluciona\n  Desarrollará la capacidad de relacionar sus diferentes obras\n  Identificará algunos de los elementos centrales de su obra\n\n\nEste curso está dirigido a personas que disfrutan de la literatura y no requiere ningún tipo de conocimiento previo.\n\nAprenda acerca de Gabriel García Márquez acompañado de profesores experto de Bogotá, Colombia\n\nSus guías para este curso son profesores de literatura de la Facultad de Artes y Humanidades de la Universidad de los Andes, Colombia, expertos en el análisis de la obra de Gabriel García Márquez, quienes le brindarán una perspectiva única acerca de la narrativa de este autor.\n\n¡Esperamos que sea una experiencia enriquecedora y que disfrutemos juntos de las obras de Gabriel García Márquez!.\n\n\n                                    ", 
    "end_date": "2016-10-10T00:00:00Z", 
    "title": "Leer a Macondo: La obra de Gabriel García Márquez", 
    "price": 0, 
    "instructors": "Andrea Junguito and Hugo Ramirez", 
    "institution_name": [
        "Universidad de los Andes"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/macondo-es-gabriel-garcia-marquez?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-29T00:00:00Z"
}