{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Gabriel García Márquez is a Colombian writer, who won the Literature Nobel Prize in 1982. He has been recognised as one of the world’s leading writers in the second half of the 20th century.\n\nHis works have been translated into many languages, been adapted for TV and film, and inspired many subsequent works of art.\n\nExplore five works set in the fictional village of Macondo\n\nThe main goal of this course is to explore the literary contributions of Gabriel García Márquez to world literature, through five of his first few works. These are set in (or near) the fictional village of Macondo - a town inspired by the author’s birthplace, Aracataca. We will study:\n\n\nLeaf Storm - La Hojarasca\nNo One Writes to the Colonel - El Coronel No Tiene Quien Le Escriba\nIn Evil Hour - La Mala Hora\nBig Mama’s Funeral - Los Funerales de la Mamá Grande\nOne Hundred Years of Solitude - Cien Años De Soledad\n\n\nStarting from a close reading of the texts, we will study different narrative dimensions such as:\n\nthe author’s life in relation to his oeuvre;\nthe idiosyncratic use of language;\nand the role of time and space in Garcia Marquez’s poetics.\n\nYou will discover why he won international fame with 100 Years of Solitude, which remains a classic today.\n\nLearn with Gabriel García Márquez experts from Bogotá, Colombia\n\nYour guides for this course are experts in analysing the works of Gabriel García Márquez, from the Department of Literature at Universidad de los Andes in Colombia’s capital, Bogotá.\n\nThe department trains writers, editors and teachers, and will bring you a unique perspective from Gabriel García Márquez’s native land.\n\n\n                                    ", 
    "end_date": "2016-10-10T00:00:00Z", 
    "title": "Reading Macondo: the Works of Gabriel García Márquez", 
    "price": 0, 
    "instructors": "Camilo Hernandez, Andrea Junguito, Adolfo Caicedo and Hugo Ramirez", 
    "institution_name": [
        "Universidad de los Ande Colombia"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/macondo-gabriel-garcia-marquez?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "6 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-08-29T00:00:00Z"
}