{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Why do we continue to read and perform Shakespeare’s works around the world today? How were his plays performed and printed 400 years ago, and how has our conception of Shakespeare changed over the centuries?\n\nAs part of the Shakespeare400 consortium of events, marking 400 years since his death, King’s College London has partnered with Shakespeare’s Globe and the British Library to explore how Shakespeare’s works continue to delight audiences around the world.\n\nJoin academics, curators, publishers, actors, musicians and theatre directors, as we find out more about Shakespeare’s early modern world and consider his construction as a global icon today.\n\nGo behind-the-scenes at The Globe\n\nWe will take you on to the stage of the Globe Theatre, to find out about performance practices both in the present day capital and in Early Modern London.\n\nWe’ll meet practitioners at the Globe and we’ll step into the world of the early modern actor to examine the processes and conditions that were at the heart of the Shakespearean playhouse.\n\nExplore rarely-seen priceless manuscripts\n\nThe British Library has given us exclusive access to some some priceless manuscripts and early printed texts in their archives. We’ll also discover how the early modern book trade shaped the journey of Shakespeare’s text from stage to page.\n\nShare your own insights with other learners\n\n‘Global Shakespeares’ is one of the key themes which we will explore on the course. When you join Shakespeare: Print and Performance, you will become part of a diverse international learning community, and we will draw on everyone’s experiences of Shakespeare to enrich our discussion.\n\n\n\n                                    ", 
    "end_date": "2016-10-03T00:00:00Z", 
    "title": "Shakespeare: Print and Performance", 
    "price": 0, 
    "instructors": "Gordon McMullan and Sarah Lewis", 
    "institution_name": [
        "King's College London"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "http://www.futurelearn.com/courses/shakespeare?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-05T00:00:00Z"
}