{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    Why just write poems when you can write better ones? This course is built on the notion that the most exciting writing begins after the first draft. It is specifically for folks who believe that writing poems just to express oneself is like using the Internet just for email. After all, poetry can change the way you and your readers think of the world and its inhabitants; it can break new ground for language; turn a blank sheet of paper into a teeming concert of voices and music.\n\nThough any of us may have the potential to make that happen, having an understanding of how several tools of poetic composition can be used (and audaciously “mis-used”) gives you more ways to try (and if we do this right, we might surprise ourselves most of all). \n\nWe'll cover key poetic terms and devices by studying poems by a handful of modern and contemporary poets and then get a chance to try our own hand at writing new poem drafts from a select number of prompts. Throughout the course you will have the opportunity to workshop your poem drafts and get feedback on your work, working towards a more polished poem.\n\n                                            Syllabus\n                        Introduction and the Poetic LinePoetry orchestrates its music, arguments, tensions, and environment via arrangements of language into lines and stanzas. This week we’ll address the importance of the line break, perhaps the most conspicuous, signature tool in the poet’s toolkit. Do you break more for sound, for sense, visual effect, shape, a mix of several? We’ll participate in several line break exercises and remix found poems. Also: prepare for your first quiz and a fun first writing prompt. Abstraction and ImageAbstraction doesn’t mean “deep,” and image doesn’t mean “picture.” Images are typically understood as anything you can literally touch/taste/see/hear/smell, and abstractions are those things for which we have symbols (a clock for “time,” a heart for “love”) but no image. Abstractions and images may fill our poems, but how can you tell what’s what, and how can you leverage them to compelling ends? This week we’ll work at finding new symbols to replace clichéd ones for abstractions and we’ll work at crafting images that do more than add furniture to a poem, but create systems of relationships, moods, and even style. Metaphor and Other Formulas of DifferenceMost of us think of simile and metaphor, personification and other similar figures of speech as being about similarities between objects, concepts, and entities. But the juice in these formulas comes from how different the two things being compared seem to be. This is why writing: “the shark moved like a fish” is, alone, a lot less interesting than saying “the shark moved like a squad car.” We’ll talk about how playing with difference via juxtaposition can create a range of poetic effects. Then you’ll write a poem built of one robustly developed or several contrasting juxtapositions. \n\nWe'll end this module with yet another quiz, and our first poetry workshop -- facilitated through a peer assessed assignment.RhymeThis week we’ll explore how rhyme leverages patterns of sameness and how we can estrange similarity for compelling poetic effects. We’ll check out examples of “rhyme”—sonic, visual, conceptual—from outside of poetry too. RhythmAll spoken language has rhythm, the trick is working the rhythm in such a way that drives your poem toward the effects you’re after. Maybe you want a fluid, seductive, propulsive rhythm. Perhaps something that halts or stutters. We’ll use traditional western concepts of meter as a means to open the door to this discussion, but we may leave them at the door upon entry. Sharpened Poetry: Revision StrategiesWhen you revise a poem, you are not trying to dull the emotional flash of your first draft. You must, instead, intensify it. In this, our final week, we’ll discuss the difference between revision and editing, the art of reading your own work critically, and the beauty of drafts. For your final peer review, you’ll turn in (and in turn, assess) a revision of one of the poems from the preceding 5 modules.\n                                    ", 
    "end_date": "2016-08-01T00:00:00Z", 
    "title": "Sharpened Visions: A Poetry Workshop", 
    "price": 0, 
    "instructors": "Douglas Kearney", 
    "institution_name": [
        "California Institute of the Arts"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/poetry-workshop", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-20T00:00:00Z"
}