{
    "selfpaced": true, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #2 in Subjects\n                                                                    &gt; Humanities\n                                                                                                    &gt; Literature\n                                                            \n                            \n                                                \n                    \n                    \n                    Over 8 weeks, we will encounter and discuss one long poem, Percy Shelley's Prometheus Unbound.  \r\nShelley wrote this as a lyrical drama, most likely intending its performance primarily to be in the minds of his readers. Marcia Hepps, Peter Schwarz and Jim Schlatter of the Unbinding Prometheus team are producing an abridged  live concert performance at Kelly Writers House at the University of Pennsylvania on September 18th, 2014.  This course will make use of the performance video to consider and discuss aspects of the performance of Shelley's work.  Additionally, Unbinding Prometheus is also producing a complete, unabridged studio recording of the entire poem. Our MOOC students will thus be able to utilise a complete, multi-part audio-video-text alignment to assist their studies.  \r\nOur video-recorded lessons are various. About half consist of a mix of short lectures, interviews and conversations with literary critics and scholars, poets, as well as philosophers, actors, directors, historians, and groups of students. \r\nAnother half are collaborative close seminar readings by the Unbinding Prometheus seminar group, led by Eric Alan Weinstein.  These offer sample models of readers' engagement with, and interpretations of, this unique and  powerful poem. \r\nFinally, twice a week there will be opportunities to participate in live, global, online seminars where you get to join us, and become part of our course's shared video content. You do not need to participate in these live events if you would prefer not to---but we gently encourage you to do so. They're fun!\n\n                                            Syllabus\n                        Unbinding Prometheus is a seven unit course, spread over seven weeks. Our eighth week is reserved for students who would like to write an essay (four days), and peer review essays by their fellow students (three days). The course is broken down as follows:\r\n21st of November: Introduction to the course, Percy Shelley and to Prometheus Unbound\r\n28th of November: Close reading of the first half of Act I\r\n5th of December: Close reading of the second half of Act I\r\n12th of December: Close reading of Act II\r\n19th of December: Close reading of Act III\r\nDecember 26th:  Close reading of Act IV\r\nJanuary 2nd: Conclusion, Overview and Recap of Course\r\nJanuary 9th: 8th week, additional time to write an essay, and peer review three essays by your colleagues (500-1100 words). \r\nEach week, we will have a series of questions to guide our mutual inquiry.\n                                    ", 
    "end_date": "2015-02-27T00:00:00Z", 
    "title": "The Great Poem Series: Unbinding Prometheus", 
    "price": 0, 
    "instructors": "Eric Alan Weinstein", 
    "institution_name": [], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.openlearning.com/courses/percyshelley-unbindingprometheus", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "OpenLearning"
    ], 
    "start_date": "2015-01-02T00:00:00Z"
}