{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    東坡詞如秋夜的星光、月色，既遙遠又親近。我們以愉悅的心情展讀《東坡詞》，徜徉於〈水調歌頭〉、〈江城子〉、〈定風波〉與〈念奴嬌〉等作品裡，如晤故人，自能心領神會，除了可以看見天才駕馭技巧的藝術表現，更可貼近東坡的內在世界，親切感受一個偉大心靈的躍動，以豐富我們的生命境界，讓我們知曉如何在人情世界中尋得心靈的安頓。\n\n                                            Syllabus\n                        課程資訊本課程由臺灣大學劉少雄教授講授，旨在帶領大家賞讀東坡詞，兼顧作家與文體、情感與形式等多重詮釋面向，讓我們更了解東坡為詞的文學與人生意義，進而深入體察東坡的情意世界及其詞的美感特質。課程以影片的教學為主， 並搭配每週問題討論以及課後作業。第一週：詞體與人情─東坡填詞的動因及其詞的特質從文體的意義談起，進而論述詞作為一種抒情文體的特性與美感特質。有了這些認知，我們才能體會文學形式與作家情感的關係，並據此以探討東坡填詞的內在因素，同時理解其「以詩為詞」的重要意義。第二週：詞情的深化─東坡「淚」與抒情自我的顯現以東坡的早期詞——杭州時期作品——為講授重點。自杭州的詞樂環境、人情風光到東坡此時的宦途失意、悲歡情思，逐次辨析東坡早期詞的創作歷程，理解他如何由寫景酬唱到遣情入詞。而送別詞和思鄉詞的佳作也讓我們見到了東坡詞中抒情自我的顯現。第三週： 詞境的開拓─由〈江城子〉到〈水調歌頭〉以東坡由杭州到密州途中及密州時期的作品為主體，見其自我紓解的努力與詞境的開拓。透過〈沁園春·赴密州早行馬上寄子由〉、〈永遇樂·孫巨源以八月十五離海州⋯⋯〉，論述東坡清婉、雄豪詞風之形成；探析「十年生死兩茫茫」、「老夫聊發少年狂」兩首〈江城子〉，見其豪婉風格的確立；最後以〈水調歌頭〉為例，談東坡清曠詞風的出現。第四週：時空的感喟─由〈永遇樂〉到〈洞仙歌〉概論東坡密州徐州詞的時空意識，就時間、空間與自我的關係，分析東坡詞境的衍變。詳析〈永遇樂〉詞篇，體會其「古今如夢，何曾夢覺」的感嘆。簡述「烏臺詩案」，談論此案在東坡生命歷程的意義。本講的最後，則透過選讀〈洞仙歌〉，進一步體察東坡於黃州時期的時空意識。第五週：文體的抉擇─由〈念奴嬌〉到〈赤壁賦〉如何在自由與限制之中找到平衡？如何在變與不變之間覓得人生的定理？本講選讀東坡元豐五年的詞作〈念奴嬌〉、賦作前後〈赤壁賦〉，透過他對同一主題（赤壁）以不同文體（詞、賦）書寫的選擇，一則探索其情理掙扎、生命體悟，一則辨析文體抉擇的內外關係，從而了解文體的深切意義。第六週：行旅的省思─由定風波到定風波本講以〈蝶戀花〉、〈南歌子〉、〈寒食詩〉、〈定風波〉、〈浣溪沙〉、〈鷓鴣天〉、〈定風波〉等作品，依序帶領大家隨著東坡經歷人生的風雨晴陽，走過生命的幽暗深谷，觀察他如何在行動中體悟生命意義，在日常的行旅之中逐漸安定了心靈，悟得了「此心安處」的生命歸宿。第七週：詠物與抒情─在物我交感中體證詞情的深度本講主述東坡的詠物名篇：〈卜算子〉、〈雨中花慢〉、〈水龍吟〉、〈賀新郎〉、〈西江月〉，觀其詠物擬人、寫景述情，物事人情，若即若離，創立了新的抒情美典。從而體會東坡如何以詩的比興之法賦詞詠物，拓寬詞的內容，深化詞的抒情特性，更提升了詞的意境，並對後世影響深遠。第八週：飄蕩與回歸─在人情世界中尋得心靈的安頓詩詞的欣賞不只是瞭解意義，更是一種感動的歷程。我們讀東坡作品，讀到一種情理跌宕的姿態、一種生命境界的開拓，並深切體會此乃緣於對生命的熱愛與敬意。在課程的最終篇，我們將承續前面七講的脈絡，體會東坡文學中的悟境——如何在變與不變之中找到人生的定理？如何化解離情與鄉愁，尋覓真正的人生歸宿？且讓我們跟著東坡走一趟回家的路。\n                                    ", 
    "end_date": "2016-08-15T00:00:00Z", 
    "title": "東坡詞 (Ci Poetry of Su Dong Po)", 
    "price": 0, 
    "instructors": "劉少雄 Siu-Hung Lau", 
    "institution_name": [
        "National Taiwan University"
    ], 
    "commitment": "3-5 hours", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/su-dongpo", 
    "duration": "9 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}