{
    "selfpaced": false, 
    "topic_name": [
        "Literature"
    ], 
    "description": "\n\n                    \n                    \n                    不管是赞同还是反对，卡尔 • 马克思（1818-1883）已经成为我们这个时代人类共有的精神财产。法国解构主义思想家雅克 • 德里达（1930-2004）因此宣称：“全世界的男男女女们，不论愿意与否，甚至知道与否，他们今天在某种程度上都是马克思和马克思主义的继承人。” \n本课程将在一种当代视野中简要勾画马克思的思想历程，进而以《1844年经济学哲学手稿》、《共产党宣言》、《资本论》这三种著作为中心，在比较的视野中阐发理解马克思的方法，展现马克思的思想世界及其当代影响。\n\n学习者将主要通过观看教学视频（每一讲含5-8段教学视频，每段教学视频8-16分钟左右）、阅读教辅材料（原著节选、期刊论文），并结合相关作业练习以及测试的形式进行自学。\n\nWhether approving or not, Karl·Marx(1818-1883) has become the common spiritual wealth of human in our time. Therefore, as Jacques Derrida said: ‘Whether they wish it or know it or not, all men and women, all over the earth, are today to a certain extent the heirs of Marx and Marxism.’\nThe course will briefly delineate Marx’s thought process in a contemporary view, and center on these three core works of Marx :‘Economic and Philosophical Manuscripts of 1844’ , ‘the communist manifesto’ and ‘Capital’, to interpret and understand Marx’s method in a comparative perspective, showing Marx’s thoughts and its contemporary influence.\n\n                                            Syllabus\n                        欢迎学习《理解马克思》从这里开始学习。本课程将在一种当代视野中简要勾画马克思的思想历程，进而以《1844年经济学哲学手稿》、《共产党宣言》、《资本论》这三种著作为中心，在比较的视野中阐发理解马克思的方法，展现马克思的思想世界及其当代影响。马克思：“改变世界”的思想家（上）作为思想家的马克思是他的时代的产物。时代的潮流推动他的前进，让他一步步走向德国思想的最前沿，进而走向欧洲大陆思想发展的最前沿，实现自己的思想蜕变，创立历史唯物主义。马克思：“改变世界”的思想家（下）作为“改变世界”的思想家，马克思的思想在政治经济学批判过程中走向成熟。病痛迟滞了《资本论》第二卷、第三卷的面世，但没有阻止晚年马克思的思想脚步。作为伟大的理论合作与友谊的典范，马克思恩格斯在很多方面都存在必须承认的差异。《1844年经济学哲学手稿》：一个被放弃的传奇《1844年经济学哲学手稿》在1932年的出版，引发了“青年马克思”问题的争论。但手稿的写作并未完成，批判私有财产的“异化劳动”也在历史唯物主义中消逝了。重读手稿有助于马克思思想发展及其当代价值的科学理解。有助于马克思思想发展及其当代价值的科学理解。\n《共产党宣言》的由来《共产党宣言》是1789年《人权宣言》之后最重要的单篇政治文献。只有回到1789年至1848年那个“革命的年代”、回到马克思改变世界的探索历程，《共产党宣言》的形成及其基本理论才能得到恰当的理解。《共产党宣言》的昨天与今天在不断“征服”世界的历程中，《共产党宣言》确立了自己的历史地位，也改变了中国。时间的流逝让《共产党宣言》许多具体结论已然过时，但它激励出来的乌托邦理想依旧在指引人类前行。当代视野中的《资本论》作为马克思毕生智慧的理论结晶，《资本论》依然具有不可磨灭的当代价值和现实生命力，能够为我们理解当代资本主义的财富分配不平等、经济危机、金融危机和生态危机等重大现实问题，提供科学的理论指南。\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "理解马克思", 
    "price": 0, 
    "instructors": "张 亮, 周 嘉昕 and 孙 乐强", 
    "institution_name": [
        "Nanjing University"
    ], 
    "commitment": "", 
    "subject_name": [
        "Humanities"
    ], 
    "course_url": "https://www.coursera.org/learn/ma-ke-si", 
    "duration": "7 weeks", 
    "language_name": [
        "Chinese"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-05-30T00:00:00Z"
}