{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>In this training course for 3D Modeling in Photoshop, an expert trainer &nbsp;will show you how to use the 3D tools in Adobe Photoshop to create and render high-quality 3D models and animations. Photoshop is not just for editing photos any longer, the 3D tools that you have at your fingertips will allow you to quickly and easily create 3D models, and this video tutorial will show you how!</p><p>The course starts your Photoshop 3D training by showing you how to setup your workspace, and walking you through the camera and view controls, which are essential for building models. This computer based training course covers almost all of the 3D tools that are available to you in Photoshop, such as; creating 3D meshes using presets, using tools suck as deform, taper, inflate and shear to extrude objects. The training explains how to work with 3D text and setting and changing environments and scenes. You will learn how to add textures, adjust colours and shine, and how use lighting with your models. You will combine Photoshop Video functions with 3D functions to create animation, learn where to get third party models, and how to use them, and finally, you will learn how to render and export your projects.</p><p>By the completion of this video training course for 3D modeling in Adobe Photoshop, you will be fully capable of creating amazing models using the tools that Adobe provides to you in Photoshop. You can create, animate, render and share your models with friends, family and the world! Working files are included, allowing you to follow along with the author throughout the lessons.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "3D Modeling in Photoshop - An In Depth Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42759_ade0_7.jpg", 
    "course_url": "https://www.udemy.com/learning-3d-modeling-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-21T15:43:24Z"
}