{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t             Il Video Corso \"<strong>3Ds Max - La Grande Video Guida</strong>\" rappresenta una risorsa indispensabile per imparare facilmente <strong>3Ds Max</strong>, l'applicazione grafica 3D utilizzata nel campo della <strong>modellazione</strong>, del <strong>rendering</strong>, dell'<strong>animazione</strong> e del <strong>design</strong>. Si comincia con l'interfaccia utente e i comandi per creare forme (Shape) sia bidimensionali che tridimensionali in particolar modo si svilupperà completamente il comando <strong>Linea (Spline)</strong> in quanto fondamentale per la modellazione di base e le modifiche ai progetti 3D. In rassegna poi tutti i comandi per modellare gli oggetti a livello di struttura (Vertice, Spigolo e, sopratutto, Poligono). Si conoscerà completamente il <strong>Material Editor</strong> per essere in grado di creare e gestire qualsiasi materiale, poi, la gestione completa <strong>delle luci e delle ombre</strong>, tutti i paramenti fondamentali per ottenere un <strong>Render foto-realistico</strong> e, infine, il capitolo <strong>Animazione</strong> sviluppato come nessuno mai, dove si affronta il movimento degli oggetti a partire dalla base per proseguire con la parte avanzate gestita dalla <strong>Track View,</strong> spiegata in ogni suo dettaglio: dalle barre degli strumenti, alla gestione completa delle <strong>curve di animazione</strong>.  </p>\n\n<p>  \t          Gli argomenti del Video Corso sono sviluppati completamente con la spiegazione dei comandi e di tutti i sotto comandi con esempi pratici di utilizzo.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>  \t          In questo Video Corso ci sono numerosi video tutorial nell'ambito architettonico e meccanico, che spiegano le migliori tecniche di modellazione per realizzare, in tempi molto rapidi, modelli 3D anche molto complessi.  </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Con l’acquisto di questo Video Corso avrete accesso a tutto il materiale didattico a <strong>tempo indeterminato (per sempre) su ogni piattaforma: pc, tv, tablet, smartphone...</strong>, proprio come un canale on-demand e avrete, inoltre, la <strong>possibilità di scaricare</strong> i disegni di esempio in formato GIF e, inoltre<strong>,</strong><strong> </strong><strong>tutte le Video Lezioni del corso in </strong><strong>formato Alta Definizione</strong> in questo modo diventeranno davvero vostre e le avrete sempre disponibili e consultabili in ogni momento, indipendentemente dal collegamento Internet.</p>\n\n\n\n\n\n\n\n\n\n<p><strong>Una volta terminato il Corso si ottiene il certificato di completamento!</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>  \tIl prezzo del video corso è IVA compresa.  </p>", 
    "end_date": null, 
    "title": "3Ds Max - La Grande Video Guida - 3D - Animazione e Render", 
    "price": "50.00", 
    "instructors": "Gelindo Parisotto", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/250028_4b76_5.jpg", 
    "course_url": "https://www.udemy.com/3ds-max-la-grande-video-guida/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-25T09:25:05Z"
}