{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">Aprende a diseñar tu curso de diseño con poderosas herramientas sin pagar un dolar por licencia.</strong></p><p style=\"\">Al final de este curso obtendrás <strong style=\"\">poderosas herramientas</strong> de arquitectura y diseño en tu computadora que solo el 1.74% de la población conoce y utiliza.</p><p style=\"\">Este curso esta diseñado para Arquitectos, no Arquitectos, diseñadores, modeladores, profesionales, no profesionales, amantes del diseño, la arquitectura, fotografia, modelado etc. </p><p style=\"\">No es necesario tener experiencia previa en herramientas Tecnologicas y/o de diseño.</p><p style=\"\">Con estas herramienta podras <strong style=\"\">diseñar, bosquejar, modelar en 3D y 2D, modificar</strong> todos tus trabajos sin necesidad de un pago por <strong style=\"\">licencia</strong>.</p><p style=\"\">Conseguiras mas herramientas para realizar <strong style=\"\">los mejores diseños</strong> del mercado.</p><p style=\"\">Obtendras un sistema rapido, confiable, moderno, libre <strong style=\"\">sin necesidad de modifica</strong>r nada en tu equipo actual.</p><p style=\"\">Con la facilidad de la virtualización no necesitaras desinstalar nada de tu maquina esto significa que podras interactuar con tu maquina y tu Universo diseño de<strong style=\"\"> manera directa y facil.</strong></p><p style=\"\">Tendras una maquina virtual<strong style=\"\"> personalizada</strong> con herramientas de diseño y arquitectura.</p><p style=\"\">Tendras un sistema operativo<strong style=\"\"> libre</strong> dentro de tu sistema operativo interactuando con tus herramientas tradicionales.</p><p style=\"\">Usaras herramientas usadas por los <strong style=\"\">mejores diseñadores</strong> en un espacio personalizado solo para ti, sin necesidad de pagar un dolar por licencias.</p><p style=\"\">Tendras la posibilidad de personalizar mas tu Universo de Diseño <strong style=\"\">libre.</strong></p>", 
    "end_date": null, 
    "title": "5 pasos para tener tu estudio de diseño sin pago de licencia", 
    "price": "20.00", 
    "instructors": "Diego Coral Calpa", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/500116_a00e_2.jpg", 
    "course_url": "https://www.udemy.com/5-pasos-para-tener-tu-estudio-de-diseno-sin-pago-de-licencia/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-12T16:18:31Z"
}