{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t Curso de Photoshop CC para principiantes en el que se ven los aspectos más importantes del programa.  </p>  <p style=\"\">  \t El curso esta orientado a personas sin conocimiento de Photoshop o con conocimientos básicos, que quieran aprender bien a utilizar el programa.  </p>  <p style=\"\">  \t El curso esta dividido en diferentes secciones para facilitar el buen entendimiento de los explicado.  </p>  <p style=\"\">  \t Empezamos por la descripción de cada una de las herramientas que tiene la barra de herramientas y realizando un ejemplo con cada una para practicar.  </p>  <p style=\"\">  \t Seguimos aprendiendo como utilizar las capas para poder tener todo bien ordenado. Vemos los diferentes tipos de capas y como administrarlas. También vemos como aplicar efectos a las capas.  </p>  <p style=\"\">  \t Aplicamos ajustes a nuestras imágenes viendo diferentes ejemplos de que ajuste aplicar a cada imagen, como modificar la luz y el color.  </p>  <p style=\"\">  \tY terminamos el curso con el apartado de máscaras de capa para poder ocultar o visualizar partes de la capa o el ajuste que tenga aplicado. Utilizamos diferentes tipos de máscaras, de pixeles, vectoriales, de recorte.  </p>  <p style=\"\">  \tAprende bien como utilizar Photoshop para editar tus imágenes.  </p>", 
    "end_date": null, 
    "title": "60 Videotutoriales de Photoshop CC. Aprende paso a paso", 
    "price": "20.00", 
    "instructors": "Gonzalo Pasquin", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/187750_067a_4.jpg", 
    "course_url": "https://www.udemy.com/60-videotutoriales-de-photoshop-cc-aprende-paso-a-paso/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-24T11:41:45Z"
}