{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">About  This Adobe Premiere Pro CS6 tutorial</strong></p><p>In this training course for Adobe Premiere CS6, expert author Jeff  Sengstack introduces you to the powerful tools that are available to you in  this video editing software from Adobe. Designed for the beginner, this Adobe Premiere Pro CS6  tutorial begins  with the basics, and gradually teaches you everything you need to do to create  high-quality video projects.</p><p>You begin by learning what a video production workflow actually is, and  how you are going to utilize this. You will learn about non-linear editing, and  how to setup Premiere Pro to suit your own needs. As you progress through this  computer based training course, you will learn how to create projects, edit  them, add video and audio transitions, and even add video effects. Jeff  introduces you to other editing concepts such as color correction, compositing,  effect animation, adding titles and graphics, working with audio and much much  more! Of course, you will also learn how to export and share your projects with  the world.</p><p>        </p><p>By the conclusion of this video based Adobe Premiere Pro CS6 tutorial, you will be  comfortable creating visual masterpieces with your own video using the powerful  non-linear tools that Premiere provides for you. Working files are included to  allow you to work alongside the author throughout this Adobe Premiere Pro CS6  tutorial.&nbsp;</p>  ", 
    "end_date": null, 
    "title": "Adobe Premiere Pro CS6 Tutorial - MasterClass Training", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23520_6a6d_10.jpg", 
    "course_url": "https://www.udemy.com/adobe-premiere-pro-cs6-master-class/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-24T11:42:42Z"
}