{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em style=\"\"><strong style=\"\">Have you ever wanted to make cool motion graphics or add professional titles and lower thirds to your videos? </strong></em>The truth is that you can do this with no experience. Many sites sell inexpensive After Effects templates that can really spice up your videos.</p><p>I&#039;ve been professionally creating motion graphics for years. But sometimes, it&#039;s easier to just use a template that someone else has created. <em style=\"\">Why spend hours re-creating something that is already out there?</em> Yet editing these templates can be daunting if you&#039;ve never opened After Effects before.<strong style=\"\"> </strong><strong style=\"\">This course is for you.</strong></p><p><strong style=\"\">What will you be able to do after taking this course?</strong></p><ul style=\"\"><li>Open an After Effects project and navigate the program</li><li>Edit and customize templates with your own text, photos, video, and graphics</li><li>Export the template to use in other video projects or for immediate online sharing</li></ul><p><strong style=\"\">This course includes:</strong></p><ul style=\"\"><li>A step-by-step video guide to working with After Effects templates</li><li>A free video titles template to use in this course and for your own projects</li><li>Bonus tutorials that show how to edit a variety of templates including slideshows</li><li>A teacher that is always available to help! <em style=\"\">Just send me a message!</em></li></ul><p>If you&#039;re ready to improve your videos, enroll now! You will be editing After Effects templates in under an hour!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe After Effects Templates for Beginners", 
    "price": 0, 
    "instructors": "Phil Ebiner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/467836_fa87.jpg", 
    "course_url": "https://www.udemy.com/how-to-use-after-effects-templates/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-05T02:16:26Z"
}