{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Adobe Photoshop CC 2015 made some huge update in the latest edition. So this course is made completely from the scratch for the beginner. Also if you know previous version of Photoshop, by getting this course you will have understand latest feature in Photoshop CC 2015. This course main focus is to explain and work with every tools in Photoshop to make you a professional designer or master in design where you can unleash your creativity.</p> <ul><li>In the first section you will know the workspace, canvas, image size/resize and Camera raw plugin.</li><li>You will know how to mastery in layers. The Layer, Layer panel, Layer composing and blending mode.</li><li>How to move object and crop inside the documents. </li><li>Editing image Non-destructively by using smart object, Adjustment layer, layer mask and smart filter.</li><li>Understanding move, crop and perspective crop tool</li><li>Learn completely the power of selection tools. The Marquee tool, Elliptical marquee tool, Lasso tool, Polygonal lasso tool, Magnetic lasso tool, Magic wand tool and Selection tool</li><li>Learn completely the power and art of healing and retouching tool for image. The Spot healing brush tool, Healing brush tool, Patch tool, Content aware move tool, Clone stamp tool, Dodge tool, Burn tool and Sponge tool. </li><li>Learn completely to make vector based shape. The Rectangle tool, round Rectangle tool, ellipse tool, polygonal shape tool and custom shape tool. </li><li>Learn the typography in Photoshop completely. Exploring the type tool, Character and paragraph, Creating wrap text and Adding layer style. </li></ul> <p>Beside this, also you will learn the art of photo manipulation, you will learn to create tinder mobile app design, you will learn art of retouching a model image and you will learn to make a Glossy text style by applying layer style. </p><p>So if you want to be a professional designer, take this course with latest version of Adobe Photoshop. </p>", 
    "end_date": null, 
    "title": "Adobe Photoshop CC 2015: From Zero to Mastery", 
    "price": "20.00", 
    "instructors": "Infinite Education", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/591796_f795_10.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cc-2015-from-beginner-to-be-a-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-24T12:27:14Z"
}