{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>In this Adobe Audition CC training course from Infinite Skills you will learn how to import, edit and enhance audio like a pro. Audition CC adds new features that makes editing your audio easier and faster than ever before! This tutorial is designed for the beginner, and no previous Audition experience is required.</p><p>The course takes you through Audition CC step by step, with each lesson building on the one previous. The training uses hands-on examples combined with well designed working files to build your knowledge in incremental stages, each topic is explained in detail making it easy to learn new concepts and absorb information even for absolute beginners.</p><p>Some of the topics that are covered in this Adobe Audition video training are; understanding the Audition workflow, importing and recording audio, editing audio, adding audio effects, working with noise reduction and restoration effects, using diagnostic tools, stretching time, changing pitch, building multitrack sessions, and of course, saving and exporting your finished product.</p><p>Once you have completed this Audition CC video tutorial, you will have the confidence and skills you need to import, edit, clean, enhance and export high-quality audio projects. Working files are included, allowing you to follow along with the author throughout the lessons.</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Adobe Audition CC Tutorial - Audition Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58835_76ef_7.jpg", 
    "course_url": "https://www.udemy.com/adobe-audition-cc-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-07T17:20:43Z"
}