{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t              This series was created (and illustrated) by <a href=\"http://www.geigerfoto.com\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Joshua Geiger</a> and narrated by <a href=\"http://adobecertifiedinstructor.net\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Penny LaLiberte</a>, an <strong style=\"\">Adobe Certified Instructor</strong>.  </p>  <ul style=\"\">  \t<li><strong style=\"\">51 HD Video Lessons (1080p)</strong></li>  \t<li><strong style=\"\">4+ Hours of Video Lessons</strong></li>  \t<li><strong style=\"\">40+ Downloadable Illustrator Files</strong></li>  </ul>  <p>  \t              Illustrator is a vital tool for anyone who wishes to produce high-quality, useable artwork for a variety of mediums. Illustrator produces 100% vector artwork allowing for unlimited scalability. Over the 51 videos in this series, you will become very familiar with the most used tools, effects and options available to us when creating our artwork.  </p>  <p>  \t               Over the 11 sections and 51 videos, we&#039;ll start with introducing the student to the interface and navigation so that the student has a strong foundation for moving forward into dissecting the other wonderful attributes of Illustrator including Effects, getting creative with text &amp; type,  in-depth coverage of the Appearances panel and some of the super creative things you can do using simple shapes with a variety of effects and transformations applied to them including transparency, blurring, shadows and some other tricks you&#039;ll have to see to believe! This course is about teaching the tools, and introducing unique ways to use them to your creative advantage.  </p>  <p>  \t                Be sure to download the 41 supplied files to follow along with the lessons. Examine the artwork included to find creative ways to achieve some really cool, complex styles! Enjoy!! :D  </p>", 
    "end_date": null, 
    "title": "Adobe Illustrator: Creativity Completely Uncovered", 
    "price": "30.00", 
    "instructors": "Joshua Geiger", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/143602_8eea_7.jpg", 
    "course_url": "https://www.udemy.com/adobe-illustrator-creativity-completely-uncovered/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-07T21:03:22Z"
}