{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This innovative product from Adobe Press and video2brain combines interactive video and a full--color printed reference to teach the fundamentals of Adobe After Effects CS6. Experienced instructors Todd Kopriva and Angie Taylor present 10 hours of high quality HD video, complete with lesson files. This course will not only show you the basics of After Effects, it also teaches you what you&#039;ll need to know to take your skills to the next level. The presenters will give you an overview of the workflow and the user interface, and then you will learn how to bring assets into After Effects. They&#039;ll explain how to configure After Effects for optimum performance, focusing on the global performance cache and persistent disk cache features added in After Effects CS6. You’ll learn a range of compositing features, including the new variable-width masks and 3D camera tracker features introduced in After Effects CS6, as well as basic masking and color keying. You will discover how to troubleshoot and avoid common problems, and then how to create finished movie files.<br style=\"\"></p><p style=\"\"><strong style=\"\">Steps for Certification</strong>:  </p><p style=\"\">1.  Register with Certiport to take the&nbsp;Visual Communication with Adobe Photoshop  Adobe Certified Associate exam. This exam is typically offered multiple times a  year. To sign up to take the exam go to the Certiport test-locator  website:&nbsp;<a href=\"http://www.certiport.com/Locator\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://www.certiport.com/Locator</a></p><p style=\"\">2.  At the Certiport test-locator website, enter your location, select the type of  Program (Adobe Certified Associate), select the version (CS6) and select the  exam (Visual Communication with Adobe Photoshop). Click Search. A list of  nearby test centers will appear, and you will have to either call the center or  show up in person to register to take the exam.</p><p style=\"\">3.  &nbsp;Study the required material to pass the Visual Communication with Adobe  Dreamweaver Adobe Certified Associate exam. This Adobe Photoshop CS6 course  teaches you the concepts and skills covered in the Visual Communication with  Adobe Photoshop&nbsp;Certified&nbsp;Associate exam, and will help put you in a  great position to succeed in the exam. (Note: While this course is  comprehensive in regards to covering material on the exam, we do recommend  using other aids to guide your study.)</p><p style=\"\">4.  &nbsp;Pass your exam!</p><p style=\"\">                  </p><p style=\"\">5.  &nbsp;Wait for your certificate to arrive, and use your new credentials to spruce  up your resume and improve your future prospects.</p>  ", 
    "end_date": null, 
    "title": "Adobe Photoshop CS6", 
    "price": "50.00", 
    "instructors": "Peachpit Press", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49266_ab64_4.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-10T18:24:47Z"
}