{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>Are you looking to master Photoshop CS6 and learn the secrets of professional image editing ?</p>  <p>Would you like to be taught by one of the World&#039;s leading trainers and learn how to really leverage the power of Photoshop CS6 ?</p>  <p>This course is without doubt the most comprehensive learning resource on Photoshop CS6 available. Covering over 13 hours of content, each topic is broken down into a series of simple to follow stages. The lessons are clearly presented and use an unique teaching method that boosts learning and aids retention, it&#039;s never been this easy to learn Photoshop.</p>  <p>Right from the start, you will learn professional image editing and photo correction techniques that really are used by the pros. The course starts by building a solid understanding of the fundamentals of image editing. Once the basics of Photoshop have been outlined, the course moves on to cover more advanced topics, with each passing lesson your knowledge of Photoshop will expand as the author shows new tools and the creative way they can be employed to great effect. The only pre-requisite for this course is the desire to learn and create stunning digital imagery.</p>  <p>You will quickly learn how to leverage advanced features like curves, layers and masks to produce amazing digital imagery. By the conclusion of this course, you&#039;ll have developed the skills and creative insight to use Photoshop CS6 to a very high level, you will be an expert of digital imagery.</p>  <p></p>  <p><strong style=\"\">Course objectives:</strong></p>  <ul style=\"\">  <li>Learn about the new tools in Photoshop CS6 ; see how to build workflows that take full advantage of the new tools</li>  <li>Learn how to get organized with your images, and use Adobe Bridge to increase your workflow.</li>  <li>Learn the basics of the application layout and how all the functions interact with each other.</li>  <li>Understand the primary core tools of Photoshop CS6 and how they can be combined to cover almost 85% of all editing tasks.</li>  <li>Learn the basics of color control, learn how to correctly set up your editing environment to accurately output color.</li>  <li>Learn the power of layers and how to use simple but highly effective techniques for none destructive editing</li>  <li>Learn the principles of image correction and master and build an understanding of which tools to use in any given situation to perform the perfect correction, from basic contrast to advanced levels and curves.</li>  <li>Master the art of selection, learn how to use selections, masks and channels to isolate an area for correction with pin-point precision, from simple shapes to masking out hair.</li>  <li>Learn the power of blending modes, adjustment layers and layer styles, these are the powerhouse tools used by the pros to create truly amazing images</li>  <li>Learn how to use Photoshop filters to add effects and adjustments.</li>  <li>Learn the power of actions, see how you can carry out batch edits on 100s of images in seconds.</li>  </ul>  <p>&nbsp;</p>  <p>All this and a whole lot more is covered in great detail. To help improve the learning experience and increase retention, we also provide detailed working files that allow you to follow along with the instructor and replicate what&#039;s being taught. If you want to master Photoshop CS6 at your own pace, this is the training course for you.</p>  <p>&nbsp;</p>", 
    "end_date": null, 
    "title": "Adobe Photoshop CS6 Tutorial. Self-Paced and Easy to Follow", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/18438_d46f_10.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-photoshop-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-05-23T18:05:50Z"
}