{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Adobe InDesign CC training course shows you how to use InDesign CC from the ground up - no experience required. InDesign CC is a desktop publishing application that allows you to design, layout and publish documents. This tutorial will show you how to use the tools and features available to you in this industry standard publishing software from Adobe.<br style=\"\"><br style=\"\">The course starts off by introducing you to the new InDesign CC interface. He shows you how to set up your workspace and preferences to make your workflow efficient. As you work through each of the lessons in this video tutorial, you will learn how to layout your document with pages, add and manage objects, insert and format text, create styles, add tables and work with graphics. This training video covers all of the basic functions that you will need to create and publish amazing documents. You will learn how to work with color, swatches fills and strokes, add effects such as bevel and emboss, and even prepare your document for printing.<br style=\"\"><br style=\"\">Once you have completed this computer based training course for Adobe InDesign CC, you will have a comprehensive understanding of how to create and publish your projects using the tools and techniques available in InDesign. Working files are included, allowing you to follow along with the author throughout the lessons.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe InDesign CC Tutorial - Beginners to Advanced Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/71308_fd34_9.jpg", 
    "course_url": "https://www.udemy.com/adobe-indesign-cc-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-29T20:17:45Z"
}