{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">Hier finden Sie die besten Lösungen für alle Anwendungsbereiche von Photoshop CC. Zuerst zeigt Ihnen der beliebte Digitalkünstler Pavel Kaplun, wie Sie schwierige Freisteller und komplexe Korrekturen in den Griff bekommen und eigene Composings erstellen. Dann erklärt Ihnen der Adobe-Experte Orhan Tançgil alles zu Farbmanagement und Ausgabe. Zudem finden Sie in diesem Training viele Tipps, wie Sie den Photoshop-Workflow mit Aktionen, Skripten und Shortcuts effizienter gestalten.</p><p style=\"\">- Profi-Tipps von Pavel Kaplun und Design-Experte Orhan Tançgil</p><p style=\"\">- Farbmanagement, Automatisierung, Freistellung, 3D, Kanäle, Filter und mehr</p><p style=\"\">- Mit komplettem Composing-Workshop von Pavel Kaplun</p><p style=\"\">Pavel Kaplun ist einer der bekanntesten Digitalkünstler und Fotografen in Deutschland. Mit seinen humorvollen, skurrilen Composings hat er bereits mehrere Preise gewonnen und begeistert seit Jahren die Photoshop-Community als Trainer und Künstler. Gemeinsam mit seiner Frau Olga hat er das Kreativstudio »Kaplun &amp; Kaplun GbR« gegründet und bietet dort Werbekampagnen und Workshops zu Fotografie und digitaler Bildbearbeitung an. Sein umfangreiches Wissen und Können gibt er in Fachbüchern und Video-Trainings weiter, immer mit einer guten Portion Augenzwinkern.<br style=\"\"></p><p style=\"\">Orhan Tançgil ist Designer und Experte im Bereich Digital Desktop Publishing. Als Herstellungs-Spezialist berät er Firmen bei Design und Gestaltung und gibt Schulungen im Bereich DTP. Seine neue Leidenschaft gilt dem iPad und der Gestaltung von E-Magazinen speziell für das iPad und mobile Endgeräte. In seinen Trainings versteht er es, DTP-Themen und komplexe Inhalte anschaulich zu vermitteln. Orhan Tançgil ist Adobe Certified Instructor für InDesign, Photoshop und Illustrator.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe Photoshop CC für Fortgeschrittene", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/455236_449b.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cc-fur-fortgeschrittene/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-23T23:25:26Z"
}