{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is  presented to all students who undertake these Photoshop Elements 10  Tutorials/Course.</h5><p style=\"\"><p style=\"\">Because of the advanced technology in today&#039;s cameras, it&#039;s never been  easier to take high quality photos, and so many! But once it&#039;s time to put your  images on your computer, the problems begin. What&#039;s the best way to organize  them? How do you prepare them for online publishing or to print? Photoshop  Elements 10 is Adobe&#039;s latest answer for home and small business customers, packing  many of it&#039;s most useful high-end tools in one affordable program. But you have  to know how it works to get results! <strong style=\"\">In  these hands-on Photoshop Elements 10 tutorials</strong>&nbsp; from InfiniteSkills, you will learn how to  organize, edit and share your images with ease. You&#039;ll learn how to remove red  eye, fix color issues, and do many of the things previously only possible in  the full version of Photoshop costing hundreds of dollars. Led by multimedia  expert and author Jerron Smith, you&#039;ll get practical advice on how to use  Photoshop Elements to clear the digital clutter, streamline your workflow, and  get fantastic results in your final, edited photos.</p><p style=\"\"><p style=\"\"><strong style=\"\">What You Will Learn in the  Photoshop Elements 10 tutorials</strong></p>    <p style=\"\">- How to apply professional image editing and correction techniques to  your digital and</p>    <p style=\"\">scanned photos.</p>    <p style=\"\">- How to prepare and optimize images to be printed, shared online and  backed up on</p>    <p style=\"\">remote storage devices.</p>    <p style=\"\">- How to work with layers, brushes and drawing tools to accomplish basic  graphic design</p>    <p style=\"\">tasks.</p>    <p style=\"\">- How to sort and organize large collections of photos based on custom  keywords and</p>    <p style=\"\">information already embedded in digital images.</p>  <p style=\"\"><strong style=\"\">Who Should Take This Course</strong></p>    <p style=\"\">- Amateur and home photographers looking to improve the quality of their  images and</p>    <p style=\"\">their workflow techniques.</p>    <p style=\"\">- Small business owners and real estate / sales personnel who rely on  high quality images</p>    <p style=\"\">for their work with clients and customers.</p>    <p style=\"\">- Anyone who wants to know how to get full Photoshop-quality results  using a program</p>    <p style=\"\">that costs a fraction of the price.</p>  <p style=\"\"><strong style=\"\">What People Are Saying</strong></p>    <p style=\"\"><em style=\"\">&quot;This course was great. I thought  since Elements was already pretty easy to use, I</em></p>    <p style=\"\"><em style=\"\">wouldn&#039;t learn much. But these videos  brought my capabilities to an entirely new level.&quot;</em></p>    <p style=\"\"><em style=\"\">-J Stratlin</em></p>  <p style=\"\"><em style=\"\">&quot;I really got a lot out of these  videos because of the way Jerron uses examples, instead of</em></p>    <p style=\"\"><em style=\"\">speeding through menus everything was  clearly laid out in steps onscreen. Thank you.&quot;</em></p>    <p style=\"\"><em style=\"\">-Donica Waverly</em></p>  <p style=\"\"><em style=\"\">&quot;Just what I needed...a very nice  look at the main tools...with cool sections on camera raw</em></p>    <p style=\"\"><em style=\"\">and panoramic merging that gave me more  options even when shooting.&quot;</em></p>    <p style=\"\"><em style=\"\">-Ryan Schutto</em></p>&lt;/p&gt;&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Adobe Photoshop Elements 10 Made Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15104_fd2c_9.jpg", 
    "course_url": "https://www.udemy.com/photoshop-elements-10/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-12T18:59:13Z"
}