{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t This Photoshop for Photographers training course from Infinite Skills teaches you advanced techniques aimed specifically towards photographers to touch up, correct, and enhance digital and scanned images. This course is designed for users that already have a basic working knowledge of Adobe Photoshop.  </p>  <p>  \t <br style=\"\">  \t You will start by learning how to organize your images, and then review some basic photographic techniques. This course will show you how to reduce digital noise through filters, channels, and the raw plug-in. You will then learn how to fix your images using the tools in Photoshop, including the clone tool and healing brush. This video tutorial will cover topics such increasing image sharpness, removing distortion and correcting perspective, and working with multiple images. You will learn creative blur effects, how to create custom lighting effects, and how to convert an image to black and white. This course will teach you how to enhance your portraits, adjust the image with curves, using dodging techniques, and more. Finally, the author leaves you with some of his tips and tricks, including adding a decorative border, saving custom formats, and aging an image.<br style=\"\">  \t <br style=\"\">  \t Once you have completed this computer based training course, you will have learned a number of techniques that can be applied to your photographic images. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Adobe Photoshop CC For Photographers ", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/186466_597e_6.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cc-for-photographers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-21T14:38:18Z"
}