{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This critically acclaimed training program from Adobe Press and video2brain combines exceptional quality HD video and a printed reference to teach the fundamentals of Flash Professional CS6 as well as the basic principles of rich media design. Structured around the objectives of the Adobe Certified Associate exam “Rich Media Communication Using Adobe Flash Professional CS6”, the product includes 10 hours of video, complete with lesson files. Experienced instructor Joseph Labrecque presents all the foundational features in Flash Professional CS6 through workable examples. The student gains a solid understanding of the tools so they can continue along any path: animation, gaming, application and mobile development, or working with premium video solutions. Joseph starts with a survey of all major application interface elements, asset creation and manipulation, and document properties and file types. He continues with a deep look into the Flash Library and the use of different symbol types across projects to exploit robust animation techniques using the timeline. Next, he explores the inclusion of sound and video, the ActionScript programming language, and application development for mobile devices. Finally, Joseph demonstrates testing and debugging applications before compiling and publishing onto a variety of platforms.<br style=\"\"></p><p style=\"\"><strong style=\"\">Steps for Certification</strong>:  </p><p style=\"\">1.  Register with Certiport to take the&nbsp;Rich Media Communication with Adobe Flash  Adobe Certified Associate exam. This exam is typically offered multiple times a  year. To sign up to take the exam go to the Certiport test-locator  website:&nbsp;<a href=\"http://www.certiport.com/Locator\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://www.certiport.com/Locator</a>&nbsp;</p><p style=\"\">2.  At the Certiport test-locator website, enter your location, select the type of  Program (Adobe Certified Associate), select the version (CS6) and select the  exam (Rich Media Communication with Adobe Flash). Click Search. A list of  nearby test centers will appear, and you will have to either call the center or  show up in person to register to take the exam.</p><p style=\"\">3.  &nbsp;Study the required material to pass the Rich Media Communication with  Adobe Flash Adobe Certified Associate exam. This Adobe Flash CS6 course teaches  you the concepts and skills covered in the Rich Media Communication with Adobe Flash&nbsp;Certified&nbsp;Associate  exam, and will help put you in a great position to succeed in the exam. (Note:  While this course is comprehensive in regards to covering material on the exam,  we do recommend using other aids to guide your study.)</p><p style=\"\">4.  &nbsp;Pass your exam!</p><p style=\"\">                  </p><p style=\"\">5.  &nbsp;Wait for your certificate to arrive, and use your new credentials to  spruce up your resume and improve your future prospects.</p>  ", 
    "end_date": null, 
    "title": "Adobe Flash Professional CS6", 
    "price": "50.00", 
    "instructors": "Peachpit Press", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49904_6cdb_4.jpg", 
    "course_url": "https://www.udemy.com/flash-professional-cs6-learn-by-video/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-15T18:39:55Z"
}