{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.<span id=\"pastemarkerend16136\"></span></h5>    <p>In this Adobe Illustrator CS6 training course, an expert author and trainer guides you through the tools and techniques that are available to you in this vector graphics editor from Adobe Systems. Used by professionals around the world, Illustrator can be a mystifying program, but this course breaks it down into easy-to-understand sections that even an absolute beginner with Illustrator can understand.</p>    <p>This tutorial starts out with a tour of the Illustrator interface, and an explanation of vector art. Once you have a grounding in the basic navigation, the course quickly takes you into applying Illustrator tools for selections, color management, shapes, fills, strokes, as well as anchors and paths. You will learn about creating and managing vector based shapes, using the pen tool, working with effects and layers, working with masks and images, and much, much more.</p>    <p>By the completion of this video based tutorial for Adobe Illustrator CS6, you will fully understand the difference between vector and raster art, and how to create high-quality vector images using the variety of tools provided to you in Illustrator CS6. Working files are included to allow you to work with the same files that the author uses throughout this video training course.<span id=\"pastemarkerend64536\"></span><br style=\"\">  </p>  ", 
    "end_date": null, 
    "title": "Adobe Illustrator CS6 Tutorial - Training Taught By Experts", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21477_2754_7.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-illustrator-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-20T00:16:37Z"
}