{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This critically acclaimed training course from Adobe Press and video2brain combines interactive video and a printed reference to teach the fundamentals of Premiere Pro CS6 as well as the basic principles of video editing. Structured around the objectives of the Adobe Certified Associate exam “Video Communication Using Adobe Premiere Pro CS6”, the product combines 15 hours of video, complete with lesson files. Experienced instructor Maxim Jago introduces core non-linear editing techniques as a first step to using advanced edits, with special effects, complex timelines, titles, clean audio and music. By the end of this course, the student will be able to work with multiple media types, create sequences and output to multiple formats using Premiere Pro CS6. Maxim walks the student through the complete editing process using Premiere Pro CS6, including importing media, using clips and markers, adding transitions, correcting color, and compositing. New features get special treatment, like stabilizing footage without visiting After Effects, applying effects via adjustment layers, and streamlined trimming using JKL dynamic trimming, which allows you to play your edits and adjust the timing of your cuts in a single step.<br style=\"\"></p><p style=\"\"><strong style=\"\">Steps for Certification</strong>:  </p><p style=\"\">1.  Register with Certiport to take the&nbsp;Video Communication with Adobe Premiere  Adobe Certified Associate exam. This exam is typically offered multiple times a  year. To sign up to take the exam go to the Certiport test-locator  website:&nbsp;<a href=\"http://www.certiport.com/Locator\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://www.certiport.com/Locator</a>&nbsp;</p><p style=\"\">2.  At the Certiport test-locator website, enter your location, select the type of  Program (Adobe Certified Associate), select the version (CS6) and select the  exam (Video Communication with Adobe Premiere). Click Search. A list of nearby  test centers will appear, and you will have to either call the center or show  up in person to register to take the exam.</p><p style=\"\">3.  &nbsp;Study the required material to pass the Video Communication with Adobe  Premiere Adobe Certified Associate exam. This Adobe Premiere CS6 course teaches  you the concepts and skills covered in the Video Communication with Adobe Premiere&nbsp;Certified&nbsp;Associate  exam, and will help put you in a great position to succeed in the exam. (Note:  While this course is comprehensive in regards to covering material on the exam,  we do recommend using other aids to guide your study.)</p><p style=\"\">4.  &nbsp;Pass your exam!</p><p style=\"\">                  </p><p style=\"\">5.  &nbsp;Wait for your certificate to arrive, and use your new credentials to  spruce up your resume and improve your future prospects.</p>  ", 
    "end_date": null, 
    "title": "Adobe Premiere Pro CS6", 
    "price": "50.00", 
    "instructors": "Peachpit Press", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49577_3728_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-premiere-pro-cs6-learn-by-video/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-12T21:46:26Z"
}