{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Infinite Skills  Adobe Acrobat XI training course will show you that Acrobat is more than just PDF viewing software. In addition to reading PDFs with Acrobat 11, you can create, manipulate, print and manage files using a powerful set of tools. This Acrobat video tutorial is designed for the beginner, and you do not require any previous Acrobat experience to get the most from this training.<br><br>The course starts with a quick tour of the Acrobat interface, showing you how to access the tools you will be using throughout the course. You will then explore how to create PDFs through Acrobat and other programs. This training course also teaches you how to edit PDFs from right within Acrobat 11, how to combine files, add multimedia, insert 3D content and even how to add backgrounds and optimize your files. Acrobat contains powerful collaboration tools, and the course will show you how to take full advantage of this. Finally, you will learn how to combine files into a portfolio and create bookmarks in your PDFs.<br><br>By the time you have completed this Adobe Acrobat XI tutorial, you will be comfortable with the tools and techniques that are available to you to manage and manipulate your PDF files. You will discover that Acrobat is indeed, MORE than just a PDF viewing application! Working files are included, allowing you to follow along with the author throughout the lessons.<br></p>", 
    "end_date": null, 
    "title": "Adobe Acrobat XI Tutorial - Learn Acrobat XI The Easy Way", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/62385_5d4c_9.jpg", 
    "course_url": "https://www.udemy.com/acrobat-xi-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-26T14:57:29Z"
}