{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This critically acclaimed product from Adobe Press and video2brain combines exceptional quality HD video and a printed reference to teach the fundamentals of Dreamweaver CS6 as well as the basic principles of web design. Structured around the objectives of the Adobe Certified Associate exam &#039;Web Communication Using Adobe Dreamweaver CS6&#039;, the product includes 13 hours of video, complete with lesson files. Experienced instructor David Powers shows you how to build modern, standards-compliant websites using Dreamweaver CS6. David starts with a quick overview of what Dreamweaver is used for, then goes into the nuts and bolts of HTML: the language that governs the appearance of web pages, and how web pages are assembled and connected to create an entire web site. He shows you how to add text to a page, then to add images and hyperlinks. To add visual sophistication to the design, David introduces Cascading Style Sheets (CSS) and shows how to add special effects to objects, like rounded corners and drop shadows. Further topics include multimedia (video, audio, and Flash), tables, forms, and managing large sites with many pages. Finally, David shows how to use Media Queries to make your site look good on any screen, from a desktop to a tiny mobile device.<br style=\"\"></p><p style=\"\"><strong style=\"\">Steps for Certification</strong>:  </p><p style=\"\">1.  Register with Certiport to take the&nbsp;Web Communication with Adobe  Dreamweaver Adobe Certified Associate&nbsp; exam. This exam is typically  offered multiple times a year. To sign up to take the exam go to the Certiport  test-locator website:&nbsp;<a href=\"http://www.certiport.com/Locator\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">http://www.certiport.com/Locator</a>&nbsp;</p><p style=\"\">2.  At the Certiport test-locator website, enter your location, select the type of  Program (Adobe Certified Associate), select the version (CS6) and select the  exam (Web Communication with Adobe Dreamweaver). Click Search. A list of nearby  test centers will appear, and you will have to either call the center or show  up in person to register to take the exam.</p><p style=\"\">3.  &nbsp;Study the required material to pass the Web Communication with Adobe  Dreamweaver Adobe Certified Associate exam. This Adobe Dreamweaver CS6 course  teaches you the concepts and skills covered in the Web Communication with Adobe  Dreamweaver&nbsp;Certified&nbsp;Associate exam, and will help put you in a  great position to succeed in the exam. (Note: While this course is  comprehensive in regards to covering material on the exam, we do recommend  using other aids to guide your study.)</p><p style=\"\">4.  &nbsp;Pass your exam!</p><p style=\"\">                  </p><p style=\"\">5.  &nbsp;Wait for your certificate to arrive, and use your new credentials to spruce  up your resume and improve your future prospects.</p>  ", 
    "end_date": null, 
    "title": "Adobe Dreamweaver CS6", 
    "price": "50.00", 
    "instructors": "Peachpit Press", 
    "commitment": "13 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/49548_5237_2.jpg", 
    "course_url": "https://www.udemy.com/adobe-dreamweaver-cs6-learn-by-video/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-12T17:35:33Z"
}