{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5 style=\"\">A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p style=\"\">Adobe Acrobat Professional is the perfect tool for professional document creation and distribution, from official forms to scanned copies and customer surveys. In addition to the security and reproduction quality offered by PDFs, Acrobat now includes a full suite of data collection and collaboration options that this course will cover step by step.</p>  <p style=\"\">In this Adobe Acrobat X video training course, expert author and trainer Michael Hoffman will show you how you can create documents, forms, add interactivity, collaborate and publish your work for everybody to view. Starting with a review of the interface and toolbars, this video tutorial will teach you to get the most out of Adobe Acrobat X. But this is much more than a rundown of product features. You&#039;ll learn exactly how Acrobat fits into a professional business environment, with tips on workflow and productivity that can save you time and frustration. By the conclusion of this video training course on Adobe Acrobat X, you will be fully capable of creating, editing, and sharing your documents in PDF form. The author has included extensive project files to allow you to work alongside him as you learn.</p>", 
    "end_date": null, 
    "title": "Adobe Acrobat X Professional Tutorial - Learn The Easy Way", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/10320_8e60_9.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-acrobat-x/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-10-13T02:41:37Z"
}