{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this training course for Adobe Photoshop Elements 11, expert Andy Anderson teaches you about the tools and techniques that are available in this powerful software used for managing and editing your photos. More than just the basic photo organizer it once was, Elements includes tools to manage, edit and enhance your digital photographs.<br style=\"\"><br style=\"\">You will start learning Elements 11 in this tutorial from the very basics, with no prior knowledge assumed. Andy starts by showing you where all your tools and panels are located, and how to access them. You will learn how to import your images to the organizer and how to use that to find your images quickly and easily. Some of the techniques and tools covered are - cropping, straightening, whitening teeth, removing red-eye, color balancing, working with layers, working with camera RAW files, filters, adding text, distortion, and much, much more - over 12 hours of video based training in all!<br style=\"\"><br style=\"\">By the end of this training course, you will have a clear understanding of how to use the powerful tools available to you in Photoshop Elements 11 to organize, manage and manipulate your digital image library. Extensive working files are included to allow you to work with the same source files the author does throughout the training course.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Elements 11 Tutorial Video - Infinite Skills", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/25946_adf3_7.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-photoshop-elements-11/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-04T07:39:07Z"
}