{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Mit diesem Training vertiefen Sie Ihr Photoshop-Wissen. Der Digitalkünstler Pavel Kaplun zeigt, wie Sie schwierige Freisteller und Korrekturen in den Griff bekommen. Der Design-Profi Orhan Tançgil erklärt Ihnen alles zu Farbmanagement und Ausgabe und gibt Ihnen Tipps, wie Sie den Photoshop-Workflow mit Aktionen, Skripten und Tastaturbefehlen effizienter gestalten. Das Training für alle, die mit Photoshop richtig durchstarten wollen.</p>\n\n<ul><li>Photoshop-Know-how von Pavel Kaplun und Orhan Tançgil\n</li><li>Farbmanagement, Automatisierung, Composing, Filter und mehr\n</li><li>Komplettworkshop für Composings – für eigene digitale Kunstwerke\n</li></ul>\n\n\n\n<p><br>Pavel Kaplun ist einer der bekanntesten Digitalkünstler und Fotografen in Deutschland. Mit seinen humorvollen, skurrilen Composings hat er bereits mehrere Preise gewonnen und begeistert seit Jahren die Photoshop-Community als Trainer und Künstler. Sein umfangreiches Wissen und Können gibt er in Fachbüchern und Video-Trainings weiter, immer mit einer guten Portion Augenzwinkern.<br></p>\n\n\n\n<p>Orhan Tançgil ist Designer und Experte im Bereich Digital Desktop Publishing. Als Herstellungs-Spezialist berät er Firmen bei Design und Gestaltung und gibt Schulungen im Bereich DTP. In seinen Trainings versteht er es, DTP-Themen und komplexe Inhalte anschaulich zu vermitteln. Orhan Tançgil ist Adobe Certified Instructor für InDesign, Photoshop und Illustrator.</p>", 
    "end_date": null, 
    "title": "Adobe Photoshop CS6 für Fortgeschrittene", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/823166_97e7.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cs6-fuer-fortgeschrittene/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T20:46:20Z"
}