{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Get started with real world tracking and compositing techniques with Adobe After Effects!</strong></p>\n\n<p>This intermediate course will cover some simple tracking and compositing techniques such as image replacement in moving footage, enhancing an actor's face by removing and cleaning up their pimples/acne, removing objects from your scene and tracking/compositing things onto objects that move in your footage. <strong>It will take you from the very beginning of opening After Effects, creating a composition, importing footage, opening Mocha AE for tracking, sending data back to After Effects and performing your composite into your footage.</strong></p>\n\n\n\n<p>Your instructor for this course is Will Bartlett. He has been using After Effects since 2006 for commercials, feature films, and animated creative projects. He is the founder of an established video production company in Toronto Canada, and has been the Visual Effects Supervisor and Lead Visual Effects Artist on dozens of projects including feature films and television commercials.</p><p>Our team will be available to answer any questions as well as help you with any issues you may come across while making your way through the course. Just reach out in the comment section.<br></p>\n\n<p>Even if you don’t have After Effects you can still take advantage of this course by downloading a free 30 day trial from Adobe, on their website. All you need to do is create a free account with them, it only takes a minute and you will then be able to start downloading After Effects.\n</p>\n\n<p>Get started now with Adobe's visual effects program to enhance your footage today!</p>", 
    "end_date": null, 
    "title": "Adobe After Effects CC: Motion Tracking & Compositing Basics", 
    "price": "20.00", 
    "instructors": "OVC Masters", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842392_b209_2.jpg", 
    "course_url": "https://www.udemy.com/after-effects-motion-tracking/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-07T23:07:41Z"
}