{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t\tThis Adobe InDesign CS6 training course from O&#039;Reilly Media teaches you how to use this powerful digital and print layout software. With the introduction of amazing new digital layout features, InDesign CS6 really is the industry standard when it comes to not only traditional media layouts, but also EPUB and other digital standards.  \t</p>  \t<p>  \t\tStarting with the absolute basics, this course assumes you have no prior knowledge in InDesign. This video based training begins with how to setup preferences and work in the InDesign interface. You will learn how to start you layout and begin adding text and objects to your design. As you continue on you cover features such as formatting your text, working with tables and graphics, adding color and effects, and even making your layout interactive. Finally you cover eBooks and how InDesign can expedite creating your EPUB publications, as well as publishing or printing your layouts.  \t</p>  \t<p>  \t\tBy the time you have completed this computer based training course for Adobe InDesign CS6 you will have a deep understanding on how to utilize the powerful tools and techniques available to you in this software to create your own high-quality layouts. Working files are included to allow you to work with the same files that the author uses throughout the training course.  \t</p>  &lt;/p&gt;", 
    "end_date": null, 
    "title": "Adobe InDesign CS6 Tutorial - Beginners to Advanced Training", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "13.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23161_1f53_9.jpg", 
    "course_url": "https://www.udemy.com/adobe-indesign-cs6-beginners-to-advance-masterclass/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-18T14:29:32Z"
}