{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Com a tecnologia que temos hoje a nossa disposição, tornou-se mais fácil e rápido o registro de acontecimentos através da captura de áudio e vídeo. Mas não basta somente registrar o momento, precisamos também saber como apresentá-lo de forma agradável e intuitiva.</strong>  </p>  <p style=\"\">  \t      Atualmente podemos observar o rápido crescimento de canais de comunicação que se utilizam de vídeos para comunicar, alguns desses canais são bem produzidos outros nem tanto, e isso faz a diferença na quantidade de visualizações que um canal pode ter. Outro setor que carece de profissionais são as filiais locais de emissoras de televisão, que muitas vezes apresentam material mal produzido e finalizado.  </p>  <p style=\"\">  \t      Utilizaremos durante o curso o <strong style=\"\">Adobe Premiere CC 2014.1</strong> que é uma das ferramentas mais utilizadas na produção audiovisual e que a cada ano recebe novos recursos para facilitar a vida de quem trabalha constantemente com ela. Neste curso você irá aprender desde a <strong style=\"\">criação básica de um projeto, transições e efeitos até correção de cor e estabilização de cenas</strong>. Passo a passo você conhecerá como o programa funciona e o que precisará fazer para tirar total proveito de seus recursos.  </p>  <ul style=\"\">  \t<li style=\"\">  O curso parte do princípio de que você não possui, ou possui pouco conhecimento sobre o tema.</li>  \t<li style=\"\">Os conhecimentos aqui obtidos poderão ser aplicados tanto em suas produções pessoais quanto em trabalhos profissionais.</li>  \t<li style=\"\">O material audiovisual utilizado nas aulas poderá ser baixado para acompanhamento do curso. </li>  </ul>", 
    "end_date": null, 
    "title": "Adobe Premiere Essencial", 
    "price": "20.00", 
    "instructors": "Renilgliton Michel Zalotti", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/363268_c4b9_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-premiere-essencial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-04T19:12:16Z"
}