{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis Adobe Photoshop Elements 12 training course, from Infinite Skills teaches you about the useful tools and techniques that are available to you in this powerful photo managing and editing software. This course is designed for the absolute beginner, meaning no prior Photoshop Elements experience is required.  </p>  <p>  \t<br>  \tYou will begin with an introduction to the program, including learning to work with the tool options, navigating in expert mode, and working with gestures. You will learn how to import your images from external devices, files, and folders. This video based training course teaches a number of photo editing tools and techniques, such as cropping and straightening images, utilizing layers, manipulating images, working with Raw image files, adding text, and more! Finally, Andy will show you numerous ways to output images, including saving images for the web, saving files for quality and portability, creating and printing greeting cards, and printing images through Shutterfly.<br>  \t<br>  \tBy the completion of this computer based training course, you will have a clear understanding of how to use the many tools available in Photoshop Elements 12 to effectively organize, manage, and manipulate your digital image library. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Elements 12 Tutorial Video - Infinite Skills", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/112878_48b1_9.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-elements-12/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-30T17:49:09Z"
}