{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This Adobe Premiere Pro CC training course teaches you how to import video, edit it, add effects and transitions, and then export your video projects. You will learn the tools and techniques that Premiere Pro has to offer you, and how to apply them to everyday editing scenarios. Designed for the absolute beginner, no previous editing experience is required in order for you to get the most out of this Premier Pro CC tutorial.<br style=\"\"><br style=\"\">You will start with the basics in Premier CC. Step by step, the course introduces you to the different tools you will use in your video editing, and how to apply them. Extensive working files are included with this video tutorial, allowing you to follow along with each lesson using the same files the author does. Some of the topics you will learn about are; importing and managing assets, adding and arranging clips, trimming, adding transitions, working with video effects, the use of layering, animating clips, using the titler, audio edits and effects, and of course, how to export your finished project.<br style=\"\"><br style=\"\">By the time you have completed this Adobe Premiere Pro CC video tutorial, with over 18 hours of lessons, you will have a comprehensive understanding of the tools and techniques available to you in this video editing software. You will be able to apply what you have learned to your own projects, and create outstanding movies for professional or personal use!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Adobe Premiere Pro CC Tutorial - MasterClass Training", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58838_2d7c_8.jpg", 
    "course_url": "https://www.udemy.com/adobe-premiere-pro-cc/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-07T17:50:02Z"
}