{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p><strong style=\"\">Course Duration 9.5 Hours</strong></p>  <p><strong style=\"\">If you&#039;re into Digital Photography, you need to master Adobe Lightroom - Let us show you how.</strong></p>  <p>This Adobe Photoshop Lightroom 4 training course &nbsp;takes you through the features and functions of this comprehensive software for both the professional and amateur photographer. Designed for the beginner, you do not require any prior experience working with Adobe Lightroom to take advantage of this tutorial.<br style=\"\" /><br style=\"\" />You will begin by touring the Lightroom interface, and become familiar with the tools and features that are available to you. You will them move on to cover features such as basic and advanced catalog organization, tethering, manipulating your images, geo-coding images, working with modules such as Develop and the Book Module, and so much more. You will learn to create slide shows, print and publish your images, and even export them to use with other Adobe Suite products.<br style=\"\" /><br style=\"\" />By the conclusion of this video based training course on Adobe Photoshop Lightroom 4, you will have a clear understanding of the features and functions at your fingertips, and how to utilize them within the software. Working files are included to let you work alongside the author as he proceed through this software video tutorial.</p>", 
    "end_date": null, 
    "title": "Adobe Photoshop Lightroom 4 Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20355_fb3e_8.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-photoshop-lightroom-4/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-29T19:06:47Z"
}