{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Image retouching has become a norm for almost all industries that are looking to produce sharp and crisp images with a lot of meaning and depth. Rightly though, not all images will have the perfect lighting, angle and even color and in such times to get the image to convey what you want, Photoshop has become an important tool.</p>\n\n<p>Even with the Photoshop basics down, you can’t produce bright images like the professionals? Well, then this course is your savior. In this course, you will learn how to get your photos to look perfect like those of professionals. </p>\n\n\n\n\n\n<p>You will learn not only how to retouch photos but also a few important Adobe Photoshop extensions that can help enhance your Photoshop usability. You will also learn how to adjust the lighting of photos based on the segment they belong to.</p>\n\n\n\n\n\n<p>The course has been designed by professionals to share their experience on the different Adobe tips and tricks for more efficient retouching of photos. You will learn how to Retouch Beauty shots including how to accentuate certain aspects of the body such as skin, eye depth and color, teeth whiteness, lips color, body retouching and even hair selecting.</p>\n\n\n\n\n\n<p>For the times when you don’t have hours to spend on photo retouching, you will also learn how to quickly retouch images for men, women and other subjects. </p>\n\n\n\n\n\n<p>In addition to retouching, you will also learn how to adjust the lighting of images for different segments such as beauty, fashion, portrait, creative, product, etc. That’s not all, the course will also cover major Adobe Extensions (Lightroom, Bridge and Camera Raw) that can definitely help boost your photo editing skills.</p>\n\n\n\n\n\n<p>This course is dedicated to help you become one of the best editors on the market with this advanced course. From basic retouching to more advance photo manipulation, this course will teach you everything you need to become a professional photo editor.</p>\n\n\n\n\n\n<p>So, what are you waiting for? Let’s us make you a Photoshop maestro!</p>", 
    "end_date": null, 
    "title": "Advance Photoshop Techniques for Designers", 
    "price": "20.00", 
    "instructors": "Eduonix Learning Solutions", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/645606_afe3_3.jpg", 
    "course_url": "https://www.udemy.com/advance-photoshop-techniques-for-designers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-20T08:48:42Z"
}