{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This Advanced Acrobat XI training course shows you how to take your documents to the next level in Adobe Acrobat. Acrobat is more than just a tool for creating and reading PDF files. This software is a collaborative tool that provides a seamless and automated environment for almost any document management need you may have. This advanced course deals mainly with &nbsp;is designed for users that already have a basic working knowledge of Acrobat XI.<br style=\"\"><br style=\"\">This video tutorial covers some of the more advanced and security features in Adobe Acrobat XI. You will learn methods of securing your PDFs using password protection and using certificate encryption. You will learn how to create and sign your PDF, and certify signed document validity. This course also covers how to use actions, and create custom actions. This training video includes a chapter on professional print handling, from color management to pre-flighting and problem correction. Finally, you will learn how to handle sensitive information through hidden content removal, redaction and Bates Numbering for legal documents.<br style=\"\"><br style=\"\">Once you have completed this Advanced / Security Acrobat training course, you will have a clear understanding of how to more effectively use the features that Acrobat has to offer your document management process. Working files are included, allowing you to follow along with the author throughout the lessons.<br style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Advanced Adobe Acrobat XI", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/66974_9e72_9.jpg", 
    "course_url": "https://www.udemy.com/advanced-adobe-acrobat-xi/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-19T18:56:27Z"
}