{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">***********************************************************************************************************</strong></em></p><p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Message from the Instructor: </strong>I am an active instructor who cares about his students. I read and respond to all email and pertaining to this course and even your personal projects.</em></p><p><em><strong>-Ronnie</strong></em></p><p>************************************************************************************************************</p><p>With its ultra-fast functionality and flexible interface, Affinity Designer has quickly become a must-have app in the world of graphic design.<br></p>\n\n<p>\t<strong class=\"redactor-inline-converted\">Enhance Your Graphic Design Skills and Speed Up Your Workflow by Learning the Basics of Affinity Designer </strong>  </p>\n\n\n\n<ul>\t<p>\t\t ·Create stunning vector illustrations<br>\t\t ·Master the essential principles and features of Affinity Designer.<br>\t\t ·Step-by-step instructions of the tools and techniques<br>\t\t ·Transform your own hand-drawn ideas into vivid digital graphics.<br>\t\t ·Learn simple creative techniques to design a finished piece of vector art.<br>\t\t ·Acquire exclusive free content, including sketches, brushes, and textures. \t</p>  </ul>\n\n\n\n<p>\t<strong class=\"redactor-inline-converted\">Affinity Designer Chosen by Apple as the Runner-Up for 2014 App of the Year</strong>  </p>\n\n\n\n<p>\t Affinity Designer has impressed critics and users alike, emerging as a viable, cost-efficient alternative to more established programs such as Adobe Illustrator.   </p>\n\n\n\n<p>\t Affinity Designer's versatility makes it an ideal program for a wide range of graphic design and vector illustration projects, including website graphics, icons, UI design, marketing materials, concept art, and more.</p>\n\n\n\n<p>\t<strong class=\"redactor-inline-converted\">Contents and Overview</strong>  </p>\n\n\n\n<p>\t Created with the beginner in mind, this course will also prove useful for experienced graphic designers looking to transition away from Illustrator or other vector graphic design programs. Combining detailed instruction with real world examples and interactive projects, this course will reveal to you the full creative potential of Affinity Designer.</p>\n\n\n\n<p>\t ·<strong class=\"redactor-inline-converted\">Learn the Essentials: </strong>Moving at a steady, step-by-step pace, you will learn how to use Affinity Designer's various tools and features to create stunning vector graphics, starting with a study of common graphical and illustrative terminology before moving on to more advanced topics, such as Selecting and Manipulating Vectors using the Affinity Design Interface, and Illustrating your first character drawing.<br>\t<br>\t ·<strong class=\"redactor-inline-converted\">Use Your Own Work: </strong>During the interactive exercises, you are free to use your own work. You may also use the complementary original sketches supplied by the instructor.<br>\t<br>\t ·<strong class=\"redactor-inline-converted\">Vector Art Project: </strong>The final section of the course will walk you through the creation of an original piece of vector art from start to finish.<br>\t<br>\t ·<strong class=\"redactor-inline-converted\">Free Content: </strong>By taking this course, you will automatically gain access to exclusive free content to enhance and inspire your own projects, including free brushes, textures, color palettes, and sketches.</p>\n\n\n\n<p>\t After completing this course, you will have a detailed understanding of the tools and techniques available in Affinity Designer that can help to make you a faster, smarter, better graphic designer.</p><p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">Message from your Instructor: </strong>I am an active instructor who cares about his students. I read and respond to all email and pertaining to this course and even your personal projects.</em></p>", 
    "end_date": null, 
    "title": "Affinity Designer: The Complete Guide to Creating Vector Art", 
    "price": "30.00", 
    "instructors": "Ronnie McBride", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/329286_8825_7.jpg", 
    "course_url": "https://www.udemy.com/the-beginners-guide-to-affinity-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-28T20:12:30Z"
}