{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>While Adobe Creative Suite is still the industry standard in the creative world, it's sky high subscription fees are far beyond the budgets of most aspiring designers. Luckily, Affinity Designer is quickly rising up the ranks to provide some serious competition. Much more affordable than its predecessor and equally as versatile, there has never been a better time to get to grips with this innovative new program. </p><p><b>Learn Affinity Designer by Examples</b></p><p>Master the tools and user interface of Affinity Design</p><p>Gain an understanding of the overall process of designing graphics</p><p>Build up a foundation of knowledge for using similar design programs</p><p>Use real world examples to familiarise yourself with the software</p><p><b>Course Overview</b></p><p>Ideal for graphic designers, web designers and artists, this course includes 17 lectures and over 3 hours of content. Suited for both complete beginners or those who already have experience with similar software such as Adobe, the course will show you how the Affinity Designer user interface works through creating real world projects. </p><p>You'll learn how to use the various tools of Affinity Designer in a hands-on environment; and not just vector graphics – you'll learn how to manipulate images, design logos and icons, create graphic illustrations, combine images, render images for all media types too, and finally export your work for the web, print, and app development. </p><p>By learning Affinity Designer by example, you'll gain an in-depth understanding of not only the tools used within the program, but design principles and practices as a whole, which you can then apply to design projects on almost any other platform.</p><p><b>About Affinity Designer</b></p><p><b> </b></p><p>Affinity Designer is the fastest, most efficient and arguably the best vector graphic design software to come along in recent years. More affordable and more specialised than Adobe Creative Suite, it's ideal for working on websites, UI design, concept art, illustrations and icons, and all kinds of graphics. Made by designers for designers, it's packed full of intuitive features and was even bestowed the honour of an Apple Design award in 2015.</p>", 
    "end_date": null, 
    "title": "Affinity Designer For Beginners", 
    "price": "20.00", 
    "instructors": "Stone River eLearning", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/362638_a24b_2.jpg", 
    "course_url": "https://www.udemy.com/affinity-designer-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-03T23:22:44Z"
}