{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso aprenderemos a manejar el entorno 3d que incluye adobe en el after effects, una auténtica pasada. After Effects le permite entregar efectos visuales cinemáticos y gráficos en movimiento más rápido que nunca con la nueva caché de rendimiento global. Amplíe su creatividad con texto integrado y extrusión de formas, nuevas opciones de calado de máscaras y un rastreador de cámara en 3D rápido y fácil de usar.  </p>  <p>  \t Este curso es impartido por Ricardo Pérez, técnico Superior en Telecomunicaciones y Sistemas Informáticos y con Carrera Superior en Medios Digitales en la escuela Trazos. Tiene mas de 7 años de experiencia en el mundo de la postproducción y el diseño digital, trabajando en grandes proyectos como la película Manolete, la cadena de televisión Cuatro o la empresa Airbus y su filial Airbus Military en el diseño y postproducción de presentaciones de productos como el A330.  </p>  <p>  \t  Otras empresas con las que ha colaborado son: CANAL +, TELECINCO, DIVINITY,<br>  \t  DISNEY CHANNEL, ONO, REAL MADRID, IBERIA, OINK, ORANGE, RENFE, Canal CAZA y PESCA, Canal IBERALIA, VAV, Canal CASTILLA LA MANCHA, NAUMANNI, CÍRCULO DE LAS BELLAS ARTES, 2BROTHERS productions, EVOLUTION CG, WARNER BROS, LOREAL, ASTOR, GEOX, PIXMANÍA, VODAFONE, UNILEVER, CHIVAS, COCACOLA.  </p>  <p>  \t En este curso cubriremos los siguientes temas:  </p>  <ul>  \t<li>Cómo crear materiales en Photoshop</li>  \t<li>Animación de los diferentes elementos</li>  \t<li>Ajustes e iluminación de la escena</li>  \t<li>Etalonado</li>  \t<li>Partículas y texturas finales</li>  \t<li>Render de la escena</li>  </ul>", 
    "end_date": null, 
    "title": "After Effects 3D", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/177570_95a1.jpg", 
    "course_url": "https://www.udemy.com/after-effects-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-05T23:36:06Z"
}