{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t Con este curso podrás ampliar tus conocimientos sobre Adobe Illustrator mediante el uso de varias técnicas y ejemplos prácticos.  </p>  <ul>  \t<li>Veremos el proceso  de vectorización de imágenes en Adobe Illustrator, con el que  aprenderás a generar trazados de diversa complejidad a partir de imágenes reales, creando ilustraciones vectoriales de gran impacto en muy poco tiempo. </li>  \t<li>Veremos otro ejemplo de creación de formas translúcidas con Adobe Illustrator, con el que aprenderás a generar diferentes formas con aspecto semitransparente, jugando tanto con la transparencia de las formas como con los modos de fusión y los degradados, para generar un aspecto semisólido en tus ilustraciones. </li>  \t<li>Con la creación de motivos sin costuras con Adobe Illustrator aprenderás a crear motivos personalizados que podrás aplicar a los rellenos y los contornos de las formas que desees, independientemente de su tamaño, sin que se aprecien los puntos de unión de las celosías. </li>  \t<li>También verás como crear pinceles de acuarela con Illustrator, aprendiendo a diseñar pinceles personalizados para tus proyectos, creando con ellos un sutil y bello efecto de pintura translúcida que hará que tus trazos se fundan entre sí simulando el color de una acuarela. </li>  \t<li> Por otro lado, mediante una práctica de creación de lazos 3D con Adobe Illustrator, aprenderás a crear una ilustración compleja combinando diferentes trazados así como rellenos de degradado para simular la textura del satén y de las sombras sobre una superficie. </li>  \t<li> Para terminar, veremos cómo crear un sencillo personaje tipo cartoon usando únicamente formas prediseñadas como elipses, rectángulos y triángulos y aplicándoles diversas transformaciones y deformaciones para alterar sus líneas ajustándolas al modelo usado como referencia. </li>  </ul>  <p>  \tEste curso es impartido por Victoria Vázquez, técnico en Diseño gráfico y en Infografía, cursó máster en 3D y animación digital. Experta en creación de contenidos para la formación por la Universidad de Salamanca, lleva más de 5 años trabajando como editora de contenidos multimedia y formadora para diferentes consultoras.  </p>", 
    "end_date": null, 
    "title": "Amplía tus conocimientos en Adobe Illustrator", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/188666_6310_3.jpg", 
    "course_url": "https://www.udemy.com/amplia-tus-conocimientos-en-adobe-illustrator/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-25T19:24:35Z"
}