{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This Anime Studio Pro 9 training course shows you to how apply the tools in this software to create professional quality animations. Anime Studio has a revolutionary bone rigging system that combines with super realistic animation which allows you to achieve amazing results, and this tutorial will show you how!<br style=\"\"><br style=\"\">Designed for the absolute beginner, you do not need any prior experience in Anime Studio, or animation, in order to learn how to use this software. The course begins with a quick tour of the interface to let you get familiar with the palettes and layout of the program, and then quickly moves onto applying those tools. You will cover drawing in Anime Studio Pro, creating and controlling bones, rigging, animation, and adding special effects. It all comes together with a project that you will work through with the author, applying each of the techniques he has taught, and learning even more along the way. Working files are included, allowing you to follow along with the author throughout the lessons.<br style=\"\"><br style=\"\">By the completion of this video tutorial for Anime Studio Pro 9 from Smith Micro, you will be comfortable with the location and application of the tools available in this software. You will be able to create and animate your own projects for professional or personal use, and be confident in your ability to make those animations amazing!<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Anime Studio Pro 9 Tutorial - A Practical Training Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/58640_9868_8.jpg", 
    "course_url": "https://www.udemy.com/anime-studio-pro-9/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-06T18:09:40Z"
}