{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  En éste curso aprenderás a crear contenido dinámico e interactivo en HTML5 sin necesidad de programar o escribiendo muy poco código de forma fácil. Edge Animate es una herramienta muy intuitiva con una interfaz similar a Flash o After Effects con la cual podrás generar contenido basado en estándares (HTML5, CSS3 y JS) el cual puede ser visto en cualquier dispositivo de escritorio o móvil.  </p>  <p style=\"\">  \t  El curso inicia cubriendo desde los aspectos más básicos de la aplicación pasando por 4 talleres prácticos y finalizando con aspectos como responsive design y publicación a diferentes formatos.  </p>  <p style=\"\">  \t  En todos los talleres he incluído el uso de snippets de código y las escritura manual del mismo (muy fácil) para que tengas una idea clara de la capacidades de Edge Animate cuando combinas sus herramientas gráficas con el código.  </p>  <p style=\"\">  \t  Aunque te recomiendo ver el curso en orden, también puedes ver directamente los talleres prácticos y revisar en los primeros capítulos los conceptos de los cuales tengas dudas. Las secciones que lo requieren tienen archivos para descarga con los cuales podrás replicar los ejercicios y talleres de este curso.  </p>  <p style=\"\">  \tA éste curso le estaré agregando permanentemente todas las novedades agregadas por Adobe para mantenerlo actualizado a las últimas capacidades y características d<span style=\"\">e Edge Animate.</span>  </p>  <p style=\"\">  \tSi deseas contratar éste u otro curso para un grupo empresarial o universidad de forma presencial u online puedes contactarme desde el sitio web de Xpert o por mensaje privado desde mi perfil de Udemy.  </p>  <p style=\"\">  \t<strong style=\"\">Última actualización</strong>: Junio de 2014 (<span style=\"\">Edge Animate CC 4.0</span><span style=\"\">)</span>  </p>", 
    "end_date": null, 
    "title": "Animación e Interactividad HTML5 con Adobe Edge Animate CC", 
    "price": "40.00", 
    "instructors": "Marlon Ceballos", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36433_c02c_9.jpg", 
    "course_url": "https://www.udemy.com/edge-animate/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-16T16:27:34Z"
}