{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Last course update:</strong> June 10th</p>\n\n<p>This course teaches you step by step how you can move your Sketch 3 and Photoshop designs and prototypes from static images to animated, and interactive user experiences that you'll be able to play with and give to your clients and users to try, like the Apple, Facebook, Twitter and other thousands of companies are doing.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>My name is Adria Jimenez, and I am an engineer and designer passionate about technology, design, and excellent products. During my life, I've worked in several multinational companies where I've learned how to create curated and beautiful web and mobile applications, and recently I created several courses to teach others what I've learned.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This is one of my most favorite topics, so I carefully created this course for anyone who wants to boost their design or UX career, learning how to move from static wireframes or designs to animated and interactive prototypes that you can show to your team or clients.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What are you getting with the course?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Lifetime access</li><li>HD video lessons</li><li>Step by step guides</li><li>Prototype challenges with solutions</li><li>Downloadable materials and exercises</li><li>Knowledge quizzes</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><br><strong>What I'll be able to do at the end?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>By the end of the course, you'll be able to create animated prototypes from your wireframes or designs that will provide interaction with the user, showcasing how to use certain features of your app without even touching a line of code.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>As soon as you gain knowledge with the tool, we are going to go one step further creating full interactive prototypes that you'll be able to see directly on your phone, and not only that, the course has challenges that will help you learn and progress further in your career while you also have fun.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Who is the ideal student?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The ideal student for this course is an existing UX or designer who already knows how to wireframe or design applications but who wants to advance one step forward in his or her career and wants to be able to show or test animations or interactions with clients or users.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>The only requirement for taking this course is to have an Apple computer and to be open to learning new cool stuff.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>See you inside the course and see how quick your designs and wireframes improve.</p>", 
    "end_date": null, 
    "title": "Animate Designs Sketch 3 and Photoshop and add Interaction", 
    "price": "35.00", 
    "instructors": "Adria Jimenez", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/670978_ed30_2.jpg", 
    "course_url": "https://www.udemy.com/animate-ideas-design-better-apps/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-16T09:06:52Z"
}