{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Este curso abarcará el uso del programa Robot Structural Analysis Professional para el modelaje, cálculo y diseño de elementos estructurales en estructuras de hormigón armado y naves industriales de acero.</p><p>En un curso dirigido a arquitectos, ingenieros civil y técnicos del área que deseen profundizar en el uso de Robot para calculo de estructuras civiles según las normativas más reconocidas a nivel mundial y en el lenguaje de su preferencia. </p><p>Trataremos las herramientas de creación de la estructura (vigas, columnas, losas, muros, entre otros). Veremos como realizar el cálculo de casos de carga modales y sísmicos, así como la utilización de normas aplicables a las cargas sísmicas y espectros de diseño personalizados. Estudiaremos en general el flujo de trabajo para el diseño de elementos de concreto armado, verificando la armadura requerida por cálculo en columnas, vigas y losas de planta. De la misma manera veremos de cerca las potentes herramientas de RSA para el detallado de elementos estructurales de concreto armado de forma individual o combinada. Revisaremos como introducir los parámetros normativos en los planos de detallado y colocación del acero de refuerzo de columnas, vigas, losas, muros y fundaciones directas aisladas, combinadas o corridas.</p><p>En este curso aprenderás a utilizar las herramientas de RSA para el diseño de conexiones metálicas, creando vistas esquemáticas, generando notas de cálculo y resultados según normas internacionales. </p><p>Este curso está planeado para culminarse en aproximadamente una semana, dedicando unas dos horas al días para la realización de los ejercicios que estaremos desarrollando juntos a lo largo del curso, Pero tu puedes andar a la velocidad que te sientas cómodo. </p><p>A lo largo del curso estaremos desarrollando dos ejemplo prácticos que nos servirán en cada caso para ver las herramientas de modelaje y diseño de edificios de concreto y acero respectivamente. </p><p>Si te apuntas en este curso te garantizamos que serás mucho más eficiente y preciso al momento de ejecutar proyectos de estructuras, además de adentrarte en el uso de una herramienta de diseño con muchas prestaciones, siendo altamente profesional y eficiente. </p>", 
    "end_date": null, 
    "title": "Aprende Robot Structural Analysis Professional", 
    "price": "50.00", 
    "instructors": "Felix Garofalo", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/563576_f05b.jpg", 
    "course_url": "https://www.udemy.com/aprende-robot-structural-analysis-professional/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-24T11:34:43Z"
}