{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Update auf Version 1.3<br></strong>Jetzt sind die Bedienkonzepte von Cinema4D, Modo, Blender, 3dsmax und Maya enthalten. Fast 50 Minuten mehr Inhalt. </p><p><strong>Der 3D Markt ist ziemlich unübersichtlich geworden. </strong></p><p>Es gibt mittlerweile so viele tolle Tools. 3dsmax,maya, cinema, modo, mudbox, zbrush und viele andere. Da wird es schwierig sich zu entscheiden, welches Tool man wirklich braucht. Da ist es extrem schwierig einen Überblick über den 3D Markt zu bekommen.</p><p>Dieser Kurs wird Ihnen hier helfen.</p><p><strong>Lassen Sie sich durch den Dschungel im 3D Bereich führen</strong>. Lassen Sie sich alle 3D Tools auf dem Markt kurz in seinen Bedienkonzepten und Möglichkeiten vorstellen.</p><p><strong>Sie werden einen perfekten Überblick in diesem Bereich erhalten.</strong></p><p>Die 3D Tools werden in V1.0 in den Bereichen Sculpting, Painting, UV-Layout, und Partikelsimulation noch einmal näher betrachtet, damit sie den Funktionsumfang der 3D Tools besser beurteilen können.</p><p>In weiteren Versionen werden die Unterschiede zum Bereich Modeling, Lighting und Rendering unter die Lupe genommen. Weitere 3D Tools werden in Zukunft behandelt.</p><p><strong>Der Kurs ist für folgende Zielgruppen geeignet:</strong></p> <ul><li>Alle Interessierten die einen Einstieg in 3D finden wollen und nicht wissen, womit sie beginnen sollen.</li><li>Grafiker, die keine Ahnung von 3D haben und trotzdem einen perfekten Überblick haben wollen.</li><li>Fotografen um zu sehen was im 3D Bereich alles möglich ist.</li><li>3D Artisten, welche über den Tellerrand schauen wollen.</li><li>3D Artisten, welche wissen wollen, ob sich ein Umstieg auf andere 3D Tools lohnen könnte.</li><li>3D Artisten, welche wissen wollen, was es noch alles an Tools in dem Bereich gibt.</li></ul> <p><strong>Dieser Kurs ist nicht statisch, sondern er wird weiterwachsen. Regelmäßige Updates werden diesen Kurs erweitern. Auch vorhandene Filme werden verbessert, angepasst oder auch ausgetauscht um die Qualität stetig zu steigern.</strong></p><p>Wenn es wichtige Änderungen in den einzelnen Tools gibt, wird der Kurs ein Update erhalten.</p><p>In Zukunft werden auch Plugins zu den einzelnen Softwarepaketen hinzukommen. </p><p>Dieser Kurs ist einzigartig und in deutscher Sprache. In Zukunft wird dieser Kurs auch in englischer Sprache erscheinen. </p><p>Seien Sie dabei und bringen Sie sich auf den neuesten Stand im 3D Markt und staunen Sie was es alles schon in diesem Sektor gibt.</p><p>V1.0 hat eine Laufzeit von über 6 Stunden</p>", 
    "end_date": null, 
    "title": "Auf dem neuesten Stand im 3D Bereich V1.3", 
    "price": "30.00", 
    "instructors": "Andreas Fülscher", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/464842_58e8_4.jpg", 
    "course_url": "https://www.udemy.com/auf-dem-neuesten-stand-im-3d-bereich-version1/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-01T09:39:16Z"
}