{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5 style=\"\">An Innovative AutoCAD Tutorial</h5> <p style=\"\">This is a tutorial that will help you learn the AutoCAD program quickly and effectively. All the lessons are video recorded and they will guide you step by step, demonstrating how to work with the program. Into your hands, we give you 6,5 hour video teaching material created by a design engineer!</p> <h5 style=\"\">What is AutoCAD?</h5> <p style=\"\">AutoCAD 2D software is a common CAD design tool used by professionals around the world. The program is used in different industrial and business areas, such as nterior design, architecture, mapping, surveying, manufacturing, electronics, landscaping, and electrical, mechanical, or environmental engineering. It enables 2D design, drafting and documantation. The AutoCAD 2D course prepares to work in the environment of 2D Computer-Aided Design/Drafting</p> <h5 style=\"\">Learn AutoCAD with No Secrets</h5> <p style=\"\">The course is constructed to satisfy the needs of beginners as well as more advanced users. For this course you need to have one of the 2006-2010 AutoCAD versions. If you have never worked with AutoCAD, a logical sequence of lessons will enable you to quickly remember all its features. Since the layout of 2009 AutoCAD version is different, the tutorial takes this difference into account and both a new and old AutoCAD layouts are discussed. More advanced AutoCAD users will surely appreciate examples that demonstrate how to organize the work with many drawings by, for example, organizing layers, grouping items, creating styles, moving items form one drawing to the other, printing and creating your own libraries.</p> <h5 style=\"\">Is This Course for Me?</h5> <p style=\"\">This course is designed both for the beginners and more advanced AutoCAD users. The instructor starts with the basics, such us moving, copying, scaling, grouping items, and working on layers. He demonstrates how to make a floor plan and print it. Next, he teaches you to make an engineering drawing and to effectively use other essential AutoCAD features like attributes and tables. The course ends with a short introduction to 3D designing. Clear instructions and video illustration of all the steps help you acquire all necessary skills in no time.</p>  ", 
    "end_date": null, 
    "title": "AutoCAD Tutorial", 
    "price": "20.00", 
    "instructors": "TutorialBay productions", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/8874_ea34_3.jpg", 
    "course_url": "https://www.udemy.com/autocad-tutorialbay/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2011-07-31T21:46:28Z"
}