{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this Autodesk Inventor 2016 Essential training course,<strong> Expert author Asif Ahmed, <em>(</em></strong><strong><em>Autodesk Inventor Expert)</em> </strong>will teach you how to create sketch, parts, assembly and drawing file using the variety of tools in Autodesk Inventor. This course is designed for the absolute beginner, meaning no previous experience with Autodesk Inventor is required. If anyone wants to fill up his/her gap in Autodesk Inventor, then this is also right course for them.</p><p style=\"\"><strong><em>Follow along with our expert instructor in this training course to get:</em></strong></p><p style=\"\">Concise, informative and broadcast-quality Autodesk Inventor Essential training videos delivered to your desktop.</p><p style=\"\"><strong>7.0+ hours of HD video tutorials</strong></p><p style=\"\"><strong>Over 125 individual video lectures</strong></p><p style=\"\"><strong>Exercise files</strong>– to help you become proficient with the material.</p><p style=\"\">The ability to learn at your own pace with our intuitive, easy-to-use interface</p><p style=\"\">A quick grasp of even the most complex Autodesk Inventor 2016 essential subjects because they're broken into simple, easy to follow tutorial videos.</p><p style=\"\"> Once you have completed this computer based training course, you will be fully capable of using these tools and techniques to create your own drawing and get control perfectly using this 3D modeling software. Working files are included, allowing you to follow along with the author throughout the lessons. </p><p style=\"\">In this Autodesk Inventor 2016 Essential training video tutorial series, you'll quickly have relevant skills for real-world applications.</p><p style=\"\"><strong><em>We will cover the following essential topics</em></strong></p> <ul><li><strong><em>Sketch</em></strong></li> <li><strong><em>Part</em></strong></li> <li><strong><em>Assembly</em></strong></li> <li><strong><em>Drawing</em></strong></li></ul>", 
    "end_date": null, 
    "title": "Autodesk Inventor 2016 Essential training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/528224_530e.jpg", 
    "course_url": "https://www.udemy.com/autodesk-inventor-2016-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-15T01:28:12Z"
}