{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this 4 Hours Course, we will be having deep view into the most important retouching technique, Dodge and Burn. </p><p>Dodging and Burning is the term that exist from the traditional Photography. Now, the basic idea behind Dodging and Burning is manipulating the level of the exposure to ''clean'' the skin as well as contour the object to give it more 3D perspective.</p><p>Possible You have heard about the Dodge and Burn. The idea behind dodging and burning isn't complicated, and it's widely used in these days photography. However in retouching we are bringing dodging and burning into another level. That was the main reason why this course was made.</p><p><strong>Dodging and Burning is only one Non destructive technique used in Retouching. Learning this technique brings your skills to the new level of retouching, and allows you to achieve non destructive results You can see in Beauty Posters or Magazines.</strong></p><p><strong>In this course, we are going to work on the real examples step by step, just to make sure, students will not miss practical information about dodging and burning. </strong></p><p>To make sure even beginners could follow, in the first part of the course You can find basic information about Dodging and Burning. As well as we are going to take care about some useful information like Brush settings, or differences between mouse and tablet.</p><p>After all of the Basics You need to know we will start working on the real examples. You are going to learn both main Dodge and Burn techniques - Grey Layer as well as Curve Adjustment Layer Dodging and Burning.</p><p>Marcin</p>", 
    "end_date": null, 
    "title": "Beauty of Dodge & Burn in Photoshop", 
    "price": "30.00", 
    "instructors": "Marcin Mikus", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/721706_f61d_3.jpg", 
    "course_url": "https://www.udemy.com/dodgeburn/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-09T12:01:48Z"
}