{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Beginners guide to phtoshop - Pet portraits in Photoshop</strong><br>In this beginners guide to photoshop, we will be compositing two images together and framing our shot. During this course I will be showing you lots of techniques from merging two images of two dogs into one shot, this is tricky as dogs have fur meaning we will have to mask out in great detail to get acceptable results.</p><p><em>\"I hope you have fun learning Photoshop\"</em><br></p><p><br><strong>During this course we will look at the following</strong><br></p><ul><li>Getting our images into and out of Photoshop</li><li>Using Adobe Bridge to bring in RAW images and adjustments within Bridge</li><li>We will look at selections tools</li><li>We will use layer masking to work non distructively and give us more control</li><li>I will be showing you how to make image adjustments with levels and curves</li><li>FInally we will produce a grey scale image and a combination of colour and grey</li></ul><p><strong>What will I be able to do after the course</strong><br></p><ul><li>You will be able to work qucker and more confidently within Photoshop</li><li>Understand core principals of retouching within Photoshop</li><li>Who is this course for?</li><li>This course is for anyone who is keen to learn quickly skills you need in Photoshop</li><li>This course is for beginners to intermediates</li></ul><p><strong>How are my courses?</strong></p><p><em>\"I pride myself on covering my subject in detail pointing out potential problem before they happen, and my no nonscence approach gets you up to speed extremely quickly\"</em><br></p>", 
    "end_date": null, 
    "title": "Beginners guide to Photoshop - Pet portraits in Photoshop", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743458_feb8.jpg", 
    "course_url": "https://www.udemy.com/beginners-guide-to-photoshop-pet-portraits-in-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T11:43:01Z"
}