{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t This Crystal Reports Tutorial for Beginners Training Video teaches you how to use this powerful enterprise-level business intelligence software. You will learn how to connect to your data sources, design reports, and distribute your reports as required.  </p>  <p>  \t You start by learning the basics of creating a report - making a connection to a database, selecting your tables and views, adding fields, and finally, saving your report. From there, using audio and video training techniques in this computer based training course, this course teaches you how to format your report, and deal with special field data such as dates, non-data items, and sorting your data. You will continue to learn the features of Crystal Reports 2013 &amp; 2011 with subjects such as filtering your data, grouping reports together, and using parameters. Finally, you will explore some more advanced features such as formula fields, using the report wizard, linking data tables, and distributing your report via email, Excel, and more. As a bonus, this course has included a chapter on how to use the Workbench, included with Crystal Reports.  </p>  <p>  \t By the conclusion of this Crystal Reports video based training course for Crystal Reports 2013 &amp; 2011, you will be fully capable of connecting to your data source, and creating rich, informative reports, and distributing these reports. Working files are included, to allow you to work alongside the author as he teaches you the software.  </p>  <p>  \t Take this ultimate Crystal Reports Tutorial for Beginners course right now and learn Crystal Reports basics.  </p>  <p>  \t &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Beginners Crystal Reports 2013 & 2011 Tutorial Video", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/42952_b748_7.jpg", 
    "course_url": "https://www.udemy.com/beginners-crystal-reports-2011/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-02-22T15:20:30Z"
}