{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Once you have learned the basics in CAD drawing, you will have a skill that will last you a lifetime. </strong>  </p>  <p style=\"\">  \t    Here&#039;s what a recent student on the course,<strong style=\"\"> Cady Dodds, </strong>a carpenter designer/maker who runs<strong style=\"\"> Perfect Space Carpentry</strong>, had to say in an email to me:  </p>  <p style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">&quot;The course has been great for me, first step towards electronic drawing.  </strong>  </p>  <p style=\"\">  \t<strong style=\"\">      I  sat down this afternoon and drew up 2 elevations for a client, some  wardrobes and storage. Although basic I think quite acceptable and took  me about 2 hours or so, and after a bit of fettling I got them to print.  So I am very pleased.&quot;  </strong>  </p>  <p style=\"\">  \tThis was Cady&#039;s first ever CAD drawing. The 2 hours it took him, will soon become an hour.<strong style=\"\"> </strong>The time savings CAD offers you have to be experienced to be believed. What&#039;s more, you can send your finished drawing to anyone, anywhere in the world, as a PDF file which they can open to view and print. Its an unbeatable technology, using FREE software!<br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t        Here are some of the things the course teaches you to do:  </p>  <ul style=\"\">  \t<li style=\"\"> how to <strong style=\"\">set up the CAD screen</strong> to draw more quickly and easily</li>  \t<li style=\"\">how to use a few <strong style=\"\">basic tools</strong> to maximum effect, and build even complex drawings using <strong style=\"\">simple techniques</strong></li>  \t<li style=\"\">how to <strong style=\"\">re-use existing drawings</strong> to create new ones, in a <strong style=\"\">fraction</strong> of the time</li>  \t<li style=\"\">how to <strong style=\"\">dimension your finished drawings in minutes</strong> using powerful CAD tools</li>  \t<li style=\"\">how to output your drawings as finished <strong style=\"\">scale plans</strong>, either printed or as <strong style=\"\">PDF files</strong></li>  </ul>  <p style=\"\">  \t<br style=\"\">  \t                 Using a <strong style=\"\">project based</strong>, step by step method I show you how to draw a complete set of elevations of an Apothecary&#039;s Chest.  </p>  <p style=\"\">  \t                A PDF version of the plans of the chest are provided to download for reference, and sequential versions of the relevant CAD files for you to work on as you progress through the course are also included. These files are prepared with a range of dimension scales to make it much easier to output your finished drawing, and can be re-used as templates in the future.  </p>  <p style=\"\">  \t            The course has 3 main sections  </p>  <ul style=\"\">  \t<li style=\"\">Customising the workspace, where you learn how to streamline the CAD screen and tools to get the most out of them</li>  \t<li style=\"\">The project, where you learn through step by step video lectures, how to draw a complete set of woodworking plans</li>  \t<li style=\"\">Dimensioning, scales and output, where you learn how to add dimensions to the finished plans and output the drawing to print or as a PDF file</li>  </ul>", 
    "end_date": null, 
    "title": "CAD for Woodworkers: makes it easy to draw woodworking plans", 
    "price": "20.00", 
    "instructors": "Simon Rodway", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/151524_3323_6.jpg", 
    "course_url": "https://www.udemy.com/cad-for-woodworkers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-23T18:16:16Z"
}