{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p></p><p><strong>¿Qué es Camtasia?</strong><br></p><p><span>Camtasia, m</span><span>ás que un grabador de pantalla simple, Camtasia nos ayuda a crear videos profesionales con facilidad.&nbsp;Usar Camtasia para grabar la actividad en pantalla, personalizar y editar el contenido, agregar elementos interactivos, y compartir tus vídeos con cualquier persona, en casi cualquier dispositivo.</span></p><p><span><strong>¿Qué aprenderé con este curso?</strong></span></p><ul><li><span>En este curso aprenderás a como elaborar tus propios Video tutoriales, editar videos, audio, agregar efectos de transición, importar imágenes, zonas resaltantes, crear cuestionarios de preguntas, que te servirán para elaborar &nbsp;productos o herramientas para mostrar o compartir, como por ejemplo: la creación de materiales de trabajo que puedes usar en aulas de clases para con tus alumnos.</span></li></ul><p><span><strong>¿Quién debe seguir el curso?</strong></span></p><ul><li>Está orientado hacia todo tipo de profesionales sobre todo en la docencia y estudiantes.<br></li><li><span>Es una buena herramienta para su aplicación en las TIC&#039;s.</span><br></li></ul><p><strong>Sobre la ayuda del Instructor</strong></p><p>Cualquier consulta que tengan sobre los temas que se han tocado en el curso, serán atendidas con mucho gusto, siempre pensando en que el usuario pueda sacarle el máximo provecho al curso.</p><p></p>  ", 
    "end_date": null, 
    "title": "Camtasia Studio 8", 
    "price": "20.00", 
    "instructors": "Carlos Loayza Reyes", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/51342_ef05_8.jpg", 
    "course_url": "https://www.udemy.com/camtasia-studio-8/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-25T21:31:46Z"
}