{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h4>Confused About Camtasia (for Mac)?</h4>  <h4>Let me show you how to:</h4>  <ul style=\"\">  \t<li>Easily edit your videos with the little known preset formula. Do it once – use it for ALL of your videos!</li>  \t<li>Position yourself as The Authority in your field with easy to create professional looking videos.</li>  \t<li>Captivate and engage your audience so they keep coming back to buy from you.</li>  \t<li>Get your family and friends to be AMAZED with your awesome videos</li>  </ul>  <p>  \t                This course has 7 easy to digest videos (and 1 bonus) that are short enough for you to learn Camtasia well and start creating your videos in one afternoon.  </p>  <p>  \t                You will also learn my preset formula to create one branded-to-you edited preset to use for ALL of your videos. You will see how this technique will speed up the process of video creation and facilitate your life.  </p>  <p>  \t                This course is structured in easy to understand quality videos (also created using Camtasia) and with timestamps along each video so you can EASILY find what you are looking for and review the material at anytime.  </p>  <p>  \t                -Why take this course?  </p>  <p>  \t                Unlikely many other courses out there (that are great as well), in this course you will learn well and fast JUST what you need to create high professional looking videos easily and quickly. Take a morning or afternoon to learn and you will see how fast you will create OUTSTANDING videos from now on.  </p>", 
    "end_date": null, 
    "title": "Camtasia for Mac: Easily Create Professional Looking Videos", 
    "price": "20.00", 
    "instructors": "Vitoria Castro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/304698_1c80_12.jpg", 
    "course_url": "https://www.udemy.com/camtasia-for-mac/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-21T10:40:13Z"
}