{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>3,000+ Students have already enrolled with 60+ Five-Star Ratings!</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>Are you spending <strong>valuable time and money</strong> trying to create your own images for your business, brand, or social lifestyle? Would you like to learn how to <strong>gain attention</strong> from your audience with <strong>stunning graphics</strong> in an affordable way? Do you want to know how experts <strong>save precious time</strong> by using pre-made layouts and templates?</p>\n\n<p><strong>What this course is about:</strong></p>\n\n<p>This Canva Course is designed to help any entrepreneur, solopreneur, business owner, marketer, advertiser, or social media expert gain the advantage by using <strong>FREE</strong> online software, called Canva, to create killer graphics and images. <em>Canva Course: Beginner's Guide to Canva for Graphic Design</em> teaches you everything you need to know about how to use Canva to launch yourself steps ahead of the competition when it comes to visual media.</p>\n\n<p><strong>What you will learn in this course:</strong> </p>\n\n<p>In these lessons, you will learn all of the basics of Canva so that you can get up and running quickly. Within an hour, you will already have all of the tools you will need to create amazing visual graphics. These lessons include the following:</p>\n\n<ul><li>Creating and setting up your account.</li></ul>\n\n<ul><li>Navigation around Canva's interface.</li></ul>\n\n<ul><li>Selecting pre-made layouts and templates.</li></ul>\n\n<ul><li>Adding artwork, images, text, and backgrounds.</li></ul>\n\n<ul><li>Sharing your designs for social media platforms.</li></ul>\n\n<ul><li>Downloading and printing your designs.</li></ul>\n\n<ul><li>Plus free updates and additions to the course in the future!</li></ul>\n\n<p><strong>What you don't want to do:</strong></p>\n\n<p><strong></strong>Wait too long to enroll! This course is going to have evergreen updates added in the future, and the price will raise once the course meets certain milestones. The best thing to do is to enroll now so that you can lock in the price and receive all future updates for free. If you are still uncertain, you can always receive a full refund within 30 days of purchase through Udemy!</p>\n\n<p>++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++</p>\n\n<p>If you enjoy this course and want to learn more about the principles and theory behind great graphic design, than be sure to check out these other courses:</p>\n\n<p><strong>Canva Course: Graphic Design Theory in Social Media Intro</strong></p>\n\n<p><strong>Canva Course: Graphic Design Theory in Social Media Volume 1</strong></p>\n\n<p><strong>Canva Course: Graphic Design Theory in Social Media Volume 2</strong></p>\n\n<p>So whether you are working on your next eBook, creating presentation slides for your next corporate event, providing useful information on social media platforms, or need to create some killer branding material, this course is for you.</p>\n\n<p>Jeremy Deighan</p>\n\n<p><em>p.s. I am here for my students and I always welcome any feedback, questions, discussions, or reviews on my courses. Please visit my profile to see how you can contact me in the most convenient way for you!</em></p>", 
    "end_date": null, 
    "title": "Canva : Beginner's Guide", 
    "price": "20.00", 
    "instructors": "Jeremy Deighan", 
    "commitment": "35 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/501652_b4ff_6.jpg", 
    "course_url": "https://www.udemy.com/create-stunning-images-with-no-graphic-design-experience/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-14T05:35:59Z"
}