{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>**LETZES UPDATE: DEZEMBER 2015**</strong><br></p><p><strong>„Warum muss man viel Geld investieren und Designkenntnisse haben, um visuellen Content zu erstellen?“</strong></p><p>Diese Frage hatten sich die Macher von<strong> Canva</strong> gestellt. Das Ergebnis ist Canva. Ein <strong>Kostenloses online Tool</strong>, wo Sie mit Leichtigkei<strong>t ansprechende Grafiken</strong> erstellen können. Dabei ist das Tool für eine breite Zielgruppe. Angefangen bei der Marketing Expertin, die Facebook Seiten betreut, bis hin zum Unternehmer der seine Visitenkarten selber erstellen möchte.</p><p>Das Geheimnis von Canva ist eine <strong>intuitive Benutzeroberfläche</strong> mit einer Vielzahl von fertig designten Vorlagen. Diese dienen Ihnen als Grundlage, um aus Ihrem Thema eineüberzeugende Grafik zu erstellen.</p><p>Mehrere Monate habe ich mich mit diesem Tool auseinandergesetzt und ein<strong> umfassendes Videotraining</strong> entwickelt. Dabei ist es mir wichtig, das Sie nicht nur die Funktionen lernen, sondern noch mehr mitnehmen Aus diesem Grund enthält das Training verschiedene praktische Projekte, wo Sie mir sozusagen über die Schulter schauen.</p><p>Ich erkläre Ihnen meine konzeptionellen Gedanken und beschreibe meine Schritte zum fertigen Produkt. Das Training beinhaltet insgesamt 16 Lektionen und hat eine Laufzeit von über 1,5 Stunden. <br><br>Ich freue mich, Sie in dem Kurs begrüßen zu dürfen.<br><br></p>", 
    "end_date": null, 
    "title": "Canva für Nicht-Designer:  Ansprechende Grafiken erstellen", 
    "price": "20.00", 
    "instructors": "Florian Lapiz", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/543036_9336_6.jpg", 
    "course_url": "https://www.udemy.com/canva-deutsch/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-02T11:24:39Z"
}