{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Join over 1400 students</strong> in this action packed video course on car design sketching using Adobe Photoshop and a Wacom tablet.<br></p><p>Are you just starting out with sketching cars in Photoshop? Or are you an automotive design or industrial design student or professional? This course will help you improve your sketching skills which is of great value when building a professional portfolio. I'll walk you through each step of the design sketching process from initial line work to the final render and give you an insight to how it's done in the design industry.  </p>  <p>  \t                                                                                                                          <em>The course is divided into <strong>4 lectures</strong>.</em>  </p>  <p>  \t                                                                                                                        In <strong>lecture 1</strong> we go over two different techniques on how to get the proportions of the car down. The reason for this is because without correct proportions from the start, it might end up looking like a toy car.  </p>  <p>  \t                                                                                                                          In <strong>lecture 2</strong> we'll make the car come alive by rendering and sculpting the design. I'll walk you through the basic tools and brushes used for this.  </p>  <p>  \t<strong>                                      Lecture 3</strong> is about adding the details such as parting lines for the door, import wheels from a picture and refine the reflections and highlights.  </p>  <p>  \t                                                                                                                          In the final <strong>lecture 4</strong> we'll add color to the design and I'll show you the difference between using a couple of layer modes to get the result that you want. You will also learn a trick to make the final image really stand out and feel crisp and sharp.  </p>  <p>  \t                                                                                                                          As a <strong>bonus lecture</strong> you'll get  </p>  <p>  \t<strong>1,</strong> The brush set that I use for Photoshop  </p>  <p>  \t<strong>2,</strong> The original .psd file so you can open it up on your computer and see the layer structure and what goes in every layer.  </p>  <p>  \t<strong>3,</strong> <strong>Two additional lectures</strong> on how to sketch a car from an upper side POV. This is important to learn and used often, especially for automotive design students.  </p>  <p>  \t<strong>Bonus lecture 2</strong>  </p>  <p>  \t                                                      Downloadable this .pdf with a step by step walk through on the techniques used to sketch a car in side view using markers and pens.  </p>  <p>  \t<strong>Bonus lecture 3  \t</strong>  </p>  <p>  \t                              Having problems sketching wheels? Not anymore! Check out this bonus video lecture on how to sketch wheels and get them right in perspective. This will help your sketch tremendously and will make the vehicle look planted on the ground.</p>  <p>  \t                                                                                    Click the \"take this course\" button at the top right, now.. <em>And have your own car design rendered 2 hours from now</em></p>", 
    "end_date": null, 
    "title": "Car Design Sketching: Render a Car in Photoshop", 
    "price": "30.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/350268_efeb_26.jpg", 
    "course_url": "https://www.udemy.com/design-sketching-car-side-view/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-19T00:14:55Z"
}