{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">About the Course:</strong></p><p style=\"\"><em style=\"\">Certified SolidWorks Associate (CSWA) with Confidence</em>, is a self-paced learning course that prepares participants to confidently take and pass the CSWA certification exam. Participants of this course will learn the essential skills in SolidWorks 3D design software, required to handle the CSWA certification exam. This course is originally a classroom-based, instructor-led course that prepared hundreds of students for the CSWA exam. This tried-and-tested course, is now available as a self-paced online course, so that more students can benefit from it, at a fraction of the cost. This course not only provides you with high quality content, taught by certified experts, it also leads into industry recognized certification, the <em style=\"\">Certified SolidWorks Associate (CSWA)</em> certification.</p><p style=\"\">Please note that, this is <strong style=\"\"><em style=\"\">NOT A BEGINNER&#039;S</em></strong> course. Before taking this course, you should already have a basic understanding of 3D parametric modeling in SolidWorks. You should already know how to model basic parts, assemblies and drawings in SolidWorks. Participants that wish to learn foundations of SolidWorks, may sign-up for another course on Udemy, <em style=\"\">Becoming a Certified SolidWorks Associate for Beginners</em>.</p><p style=\"\"><strong style=\"\">Why should I take this course?</strong></p><p style=\"\">SolidWorks 3D design software is a widely adopted, and the best-in-class 3D computer aided design (CAD) software, that is used in design, engineering, research and education fields. Whether you are an industry professional, wanting to become more productive in 3D design and manufacturing; or a student, who wants to pick up industry-relevant skills, and be more employable; or a hobbyist, who wants to realize your creative ideas for 3D printing and other prototyping technologies, this course, is for you.</p><p style=\"\">This course not only provides tried and tested training methodology in 3D CAD/CAM/CAE technologies, it guides you in attaining an industry recognized certification – the Certified SolidWorks Associate (CSWA).</p><p style=\"\">The Certified SolidWorks Associate (CSWA) Preparation Course, is originally, a 10-hour instructor-led training programme, that has been converted into a self-paced learning course, with the objective of making it Affordable, Accessible, and Value-Adding to learners. This course is developed and taught by Chevy Kok, a Certified SolidWorks Instructor, who has directly trained and certified hundreds of students, in physical, instructor-led courses. You have the guarantee that you are learning from the best in the field!</p><p style=\"\"><strong style=\"\">What are the highlights in the course?</strong></p><p style=\"\">By taking this course, you get to participate in a blended learning experience, which features the following benefits:</p><ul style=\"\"><li style=\"\">Self-paced learning (anytime, anywhere learning).</li><li style=\"\">Access course materials on Udemy website or iOS and Android apps.</li><li style=\"\">Blend of video instruction, quiz questions, and hands-on practice exercises.</li><li style=\"\">Understand best practices from the best in 3D design</li><li style=\"\">Learn on the latest version of the SolidWorks 2015 software..</li><li style=\"\">Periodic course updates with practice exercises.</li></ul>", 
    "end_date": null, 
    "title": "Certified SolidWorks Associate (CSWA) with Confidence", 
    "price": "35.00", 
    "instructors": "Chevy Kok", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/473324_f6a1.jpg", 
    "course_url": "https://www.udemy.com/solidworks-associate/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-11T05:22:30Z"
}