{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\r\n\t <strong>DOMANDE? Scrivimi qui: </strong>http://bit.ly/domandefb oppure a marco.toscano.90 at gmail.com\r\n</p>\r\n<p>\r\n\t <strong>VAI IN FONDO ALLA PAGINA PER VEDERE TUTTA LA STRUTTURA DEL CORSO E MOLTI VIDEO GRATUITI.</strong>\r\n</p>\r\n<p>\r\n\t   Si tratta del primo corso in italiano dedicato a come Impaginare Un Libro Con InDesign in maniera professionale dalla A alla Z.\r\n</p>\r\n<p>\r\n\t   Se stai scrivendo il tuo primo libro e vorresti capire come impaginarlo, oppure come creare il file ePub allora devi sapere che questo &egrave; studiato anche per questo tipo di obiettivo.\r\n</p>\r\n<p>\r\n\t <strong>L'obiettivo &egrave; quello di mettere in condizione di produrre un libro con InDesign chiunque (che al contrario di quanto si cerca di far credere &egrave; molto pi&ugrave; semplice di quanto si immagini) cos&igrave; che possa creare o migliorare i propri progetti e il proprio business.</strong>\r\n</p>\r\n<p>\r\n\t <em><strong>In altre parole: un corso di InDesign VELOCE da assimilare, economico e che va subito al punto.</strong></em>\r\n</p>\r\n<p>\r\n\t <strong>5 Cose Che Devi Sapere Su Questo Corso</strong>\r\n</p>\r\n<ol>\r\n\t<li><strong>Pubblica in formato elettronico:</strong> Ti spiego come esportare il tuo libro in ePub.</li>\r\n\t<li><strong>Basta imperfezioni:</strong> Imparerai a pulire il testo velocemente.</li>\r\n\t<li><strong>Testo come i professionisti:</strong> Usa gli stili di paragrafo come un professionista.</li>\r\n\t<li><strong>Mai pi&ugrave; Stop:</strong> Velocizza il flusso di lavoro con i miei consigli.</li>\r\n\t<li><strong>Verifica Senza Errori:</strong> La verifica preliminare prima di fare errori. </li>\r\n</ol>", 
    "end_date": null, 
    "title": "Come Impaginare Un Libro In InDesign", 
    "price": "50.00", 
    "instructors": "Marco Toscano", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/116136_cb16_6.jpg", 
    "course_url": "https://www.udemy.com/come-impaginare-un-libro-in-indesign/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-06T16:42:27Z"
}