{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">    This Comic-Style says good-bye to reality and the everyday portrait picture we see all the time. Extremely big heads, bright colors, big eyes, slim bodies, and a plastic body look are the key elements of this very unique comic style.  </strong>  </p>  <p>  \t      This exceptional workshop inspired many German photoshoppers in the last years. Now, for the first time, Gabor Richter presents his Comic-Style in English! Take part in a journey where you learn to transform a „normal“ picture into an extraordinary Comic-Style picture. I will show you, in 50 videos and using many different pictures and techniques, how I create my Comic-Style pictures. The goal of this workshop is that you will be able to create your own Comic-Style picture to excite not only your friends and relatives, but also the world wide community out there on the internet.  </p>  <p>  \t      In this training, I will not leave anything out. I will share all my secrets with you using simple techniques and simple language. In this video workshop, I will not show only one picture from A to Z. I will show many pictures and explain how to apply my techniques in different situations:  </p>  <ul style=\"\">  \t<li>More than 4.5 hours of video material</li>  \t<li>50 single vides</li>  \t<li>9 Chapters</li>  \t<li>32 RAW files inclusive for you to practice (not for commercial use)</li>  </ul>  <p>  \t      Due to my many years of experience with Photoshop and as trainer, I’m sure you can learn a lot in this training, and you will have a lot of fun watching it.  </p>", 
    "end_date": null, 
    "title": "Comic-Style: the Cartoon Training for Photoshop", 
    "price": "50.00", 
    "instructors": "Gabor Richter", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/415038_2b7e_8.jpg", 
    "course_url": "https://www.udemy.com/comic-style/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-06T14:41:33Z"
}