{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this <strong style=\"\">Corel Painter 2015 Essential Training</strong> course, <em style=\"\">GURasis Anand</em> will teach you the usage of core tools and exploring the interface of the new Corel Painter 2015. You will learn about the tools and their workings in Painter. This course is <strong style=\"\">designed for the absolute beginner</strong> without any experiance required either of Corel Painter or painting itself.</p><p>You will start by downloading and installing Corel Painter 2015 trial. Then, you will be learning to get around the interface of painter 2015 and working with files and best practices for a more efficient workflow in Corel Painter. You will learn to navigate painter effectively and finding tools faster. From there, GURasis will teach you about brushes and their controls and how to use cloner brushes. You will learn about using Color tools and Painter 2015 Shortcuts. You will learn to work in layers.</p><p>Once you have completed this Corel Painter 2015 training course, you will be fully capable of using the tools and brushes in Painter to create your own digital artwork. </p><p>Topics Covered:</p><ul style=\"\"><li>Exploring Interface of Corel Painter 2015</li><li>Brushes and Brush Controls</li><li>Corel Painter 2015: Color tools</li><li>Corel Painter 2015: Shortcuts</li><li>Working in Layers</li><li>Setting up and customizing Corel Painter 2015</li></ul><p>This Course is part of another larger course taught by <em style=\"\">GURasis</em> named &quot;<em style=\"\">Learn to Paint a digital Portrait from a Photograph</em>&quot;.</p><p>You can save the time GURasis has spent exploring and learning the techniques used by today&#039;s professionals of The Digital Art by taking this course.</p><p>Join the <strong style=\"\">PlexStreet</strong> Student Community, <em style=\"\">ENROLL NOW!</em></p>", 
    "end_date": null, 
    "title": "CP101x - Corel Painter 2015 Essential Training", 
    "price": "20.00", 
    "instructors": "Gurasis Anand, PlexStreet Studio, PlexStreet Academy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/512744_bfe5_3.jpg", 
    "course_url": "https://www.udemy.com/corel-painter-2015/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-27T12:42:24Z"
}