{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Make your video projects more awesome today, by adding creative composite techniques in After Effects!  Learn to use the creative potential of split screens:  combining multiple layers of video and still images to create interesting combined, or composite, visual effects.  </p><p>There are so many ways in which we can manipulate images, video footage, and really exploit the potentials of multiple layers and pre-compositions in After Effects.   In this course, media designer Natasha Collette introduces technical skills, workflows, and professional tips and tricks that will not only introduce you to the fun and creativity of split screens, but will enhance your entire After Effects skill set.</p><p>The course is structured around four main “Projects”, each of which has been carefully designed to demonstrate particular concepts and give students hands-on experience applying new knowledge.  By the end of the course, you’ll have a better understanding of some approaches to incorporating split screens to add vibrancy, visual interest and a professional “polish” to your video, motion graphics, or animation work.  We’ll explore using shapes, masking, track mattes, parenting, pre-compositions, cameras, and some basic AE expressions that you can begin to use immediately.  These are all transferable skills and knowledge, which you can begin to apply into projects that you are already working on, or are inspired to start now!  Downloadable media files are included for each project, to encourage you to jump right in and start building in After Effects.  </p><p>You’ll need access to Adobe After Effects to fully benefit from this course.  The tutorials have been created with Adobe After Effects CC 2015, but earlier versions of the software (CS 4, 5, 6) will work.  </p><p>For the beginner level student, we introduce every basic feature of After Effects that you will need in order to complete the included tutorial projects.  Clear instructions allow you to follow along step-by-step.  For students with a little more experience, you’ll refine your existing After Effects skills, learn new techniques, and gain more proficiency and confidence.  And, for everyone, this course will encourage you to be imaginative, giving you some new approaches and more creative freedom in your OWN work.</p>", 
    "end_date": null, 
    "title": "Creative Split Screens in After Effects - PART 1", 
    "price": "20.00", 
    "instructors": "Natasha Collette", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743976_effd.jpg", 
    "course_url": "https://www.udemy.com/creative-split-screens-in-after-effects-part-1/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T19:07:32Z"
}