{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Update 12/28/2014: </strong>Added copyright lecture + new quiz  </p>  <p>  \t    Trending topics are all over the place on social media nowadays. And while they seem trivial, trends are actually opportunities in disguise for individuals and organisations. They can get your message heard, <strong style=\"\">drive traffic</strong> to your website or blog, <strong style=\"\">increase</strong> followers and even better: <strong style=\"\">sales</strong>.  </p>  <p>  \t    To accomplish this I’ve created a <strong style=\"\">well rounded</strong> and <strong style=\"\">easy to follow</strong> course for creating attention grabbing content in the king of all graphics-editing software: <strong style=\"\">Photoshop</strong>.  </p>  <p>  \t    In this course we’ll be discussing the ingredients for creating <strong style=\"\">effective content for Twitter and Facebook</strong> and you’ll learn tools and techniques to create great images in Photoshop. And when you&#039;re done with the final chapter, you&#039;ll be an expert in saving your creations for the web.  </p>  <p>  \t<strong style=\"\">Made for Mac and Windows</strong> users and infused with a plethora of time-saving keyboard shortcuts, this course is <strong style=\"\">your best entry</strong> in the fast growing field of <strong style=\"\">social media marketing</strong>.  </p>  <p>  \t    This course is <strong style=\"\">taught by</strong> an <strong style=\"\">Adobe Certified Expert</strong> and <strong style=\"\">freelance trainer</strong> with <strong style=\"\">years of training experience</strong> and will be <strong style=\"\">updated and supported through time</strong>. Your faith in this course is an <strong style=\"\">investment in your own growth</strong> and one that will only become more and more valuable as time passes.  </p>  <p>  \t    A list of some of the topics:  </p>  <ul style=\"\">  \t<li>learn the ingredients for creating effective social media images</li>  \t<li>  \t<p>  \t\t    understand how to create brush patterns, an advanced technique  \t</p>  \t</li>  \t<li>get to know smart objects and why they will change your workflow<br style=\"\">  \t</li>  \t<li>  \t<p>  \t\t    get comfortable with saving images for the web  \t</p>  \t</li>  \t<li>  \t<p>  \t\t    two projects, created for this course and explained from A to Z  \t</p>  \t</li>  \t<li>  \t<p>  \t\t    and much more!  \t</p>  \t</li>  </ul>  <p>  \t    Whether you&#039;re a startup, a non-profit organisation or a seasoned business, this course will teach you skills in image editing, content creation and social media marketing that will take your venture(s) to the world of web 2.0.  </p>  <p>  \t    This course includes the exercise files you need to follow along, and it targets people that are novice/beginners in the topic of social media marketing and use of Adobe Photoshop.  </p>  <p>  \t    It is structured in such a way that we&#039;ll begin slow and add some complexity as we go through the different lessons.  </p>  <p>  \t    So, are you ready to start learning? Let’s go.  </p>", 
    "end_date": null, 
    "title": "Creating Social Media Content in Adobe Photoshop", 
    "price": "20.00", 
    "instructors": "Mimo Ramli", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/325018_4208.jpg", 
    "course_url": "https://www.udemy.com/creating-social-media-content-in-adobe-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-22T17:51:11Z"
}