{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t <strong style=\"\">Does this sound familiar?</strong>  </p>  <p>&quot;I don&#039;t have the time to learn by trial and error, I want to learn fast&quot;<br style=\"\"></p><p>&quot;I&#039;m overwhelmed by all the available training out there, I need a solid course that will give be everything I need to hit the ground running&quot;</p><p>&quot;Every time I run Pro Tools, I get overwhelmed, and go back to Fruity Loops, I need a course to get me out of this loop:)&quot;<br style=\"\"></p><p>  \t&quot;I need someone to show me things that I won&#039;t be able to pick up by myself&quot;</p>  <p>  \t    &quot;I want a course to give me the confidence and knowledge needed to use Pro Tools like a pro&quot;  </p>  <p>  \t          &quot;I am after a simple, jargon-free way to learn Pro Tools&quot;  </p>  <p>  \t          &quot;I need answers to my questions on the spot&quot;  </p>  <p>  \t          &quot;I have no recording experience and I would like a pro to show me where to start from&quot;  </p>  <p>  \t          &quot;I would like to have control over my projects and know how to organise my workflow&quot;  </p>  <p>  \t <strong style=\"\"> If the answer is YES! then this course is for you.</strong>  </p>  <p>  \t           The objective of the Jump Start series is to get you comfortable using Pro Tools and give you solid foundations. You will know where things are and will no longer be frustrated and default back to Fruity Loops or Garage band. And best of all you can ask as many questions as you like! It&#039;s just like having your own private instructor.  </p>  <p>  \t <strong style=\"\">What if you don&#039;t have Pro Tools yet?</strong>  </p>  <p>  \t         You can download the 30-day Pro Tools free trial from the Avid website. You will only need to buy an iLok to download the demo license on.</p>  <p>  \t <strong style=\"\">A few things you need to know about Pro Tools and this course before you start:</strong>  </p>  <p>  \t         When you take the decision of buying and using Pro Tools, it might be very confusing to know which training to follow or where to start from! Knowing how to use Pro Tools features and producing great music tracks are two different things. Beware! Pro Tools is a bit like a shiny Porsche:) It&#039;s tempting to hop in, put the pedal to the metal, after all the great features are there to use. However, it can be easy to go down a path where you won&#039;t be using the features appropriately and in a way that truly won&#039;t help you achieve your goals.</p>  <p>  \t                                    The Jump Start series aims to provide you with the help you need to understand the fundamentals while also learning how to best apply Pro Tools features in the context of the work you do. The objective of this series is to get you confident in bringing to life your audio and music production ideas. It is this skill of understanding exactly where things are and how to properly use them in context that will set you apart from the crowd.</p>  <p>  \t                                    In this first course, we will work together on a simple project in which you will be creating an electronic music track using loops that you can find and download from the “course materials&quot; section of the &quot;Creating your first session&quot; lecture. The idea is to first start with a collection of loops and end up with a full track. I will also show you how to record your own loops. You will need about two hours to complete this course. </p><p>I will be working on Pro Tools 11 but you can use any other version and you will still be able to complete this course without any problem. Just so you&#039;re able to see what I&#039;m seeing, it&#039;s safer to work on Pro Tools 9 or on any later version. If you have an earlier version of Pro Tools, it&#039;s fine, things might look different, there will be minor changes that you will experience but besides that there is nothing to worry about. I will also be using a MAC throughout the course. If you&#039;re using a PC, everything will be the same except for the shortcuts. But don&#039;t worry, I will teach you shortcuts on both systems.</p>  <p>  \t                                       In all cases if you&#039;re confused, please send me your questions, and I will be more than happy to help you out.  </p>  <p>Enjoy the course and am looking forward to helping you master Pro Tools in no time.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Create your first electronic music track with Pro Tools", 
    "price": "35.00", 
    "instructors": "Carole Issa", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/119198_b411_10.jpg", 
    "course_url": "https://www.udemy.com/pro-tools-jump-start-volume1/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-13T10:32:44Z"
}