{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t     This course will show you how to create puzzle pieces of any size or shape using Adobe Illustrator and Photoshop.  </p>  <p>  \t You will learn how to create a square puzzle template in Adobe Illustrator, then we go on to creating a circle puzzle template in Adobe Illustrator and import the template into Adobe Photoshop where we break it up into pieces, apply effects and export the individual puzzle pieces, which we then batch re-size and rename for use in your standard and retina iPad project.  </p>  <p>  \t     Recommend for anyone that has purchased CartoonSmart.com &#039;s Story Tellers Kit and would like to know how to create puzzle pieces the easy way or anyone that would like to have an easy to use reference on how to create puzzle pieces or templates for use in their latest project or App.  </p>  <p>  \t     Create puzzles quickly and easily with minimum effort and without having to use the pen tool or purchase expensive limited plug-ins.  </p>  <p>  \t     Use the shape tools, line tool and shape builder in Illustrator.  </p>  <p>  \t Use Photoshop&#039;s trim and save for web tools.<br style=\"\">  \t <br style=\"\">  \t Preparing your images for use in your project or App.<br style=\"\">  \t <br style=\"\">  \t Learn how to create a re-size action.<br style=\"\">  \t <br style=\"\">  \t Batch rename in Photoshop, adding -ipadhd extension to your images with minimum effort.  </p>  <p>  \t    This course is just over an hour long and includes examples for creating a square template and a complete circle puzzle, and also includes templates for a triangle, a star and an ellipse, and includes the working Photoshop and Illustrator files.  </p>", 
    "end_date": null, 
    "title": "Creating Puzzle Pieces with Illustrator and Photoshop", 
    "price": "20.00", 
    "instructors": "Shane Hogan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118098_190b_7.jpg", 
    "course_url": "https://www.udemy.com/creating-puzzle-pieces-with-illustrator-and-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T10:10:47Z"
}