{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Adobe InDesign (ID) es una aplicación para la composición digital de páginas desarrollada por la compañía Adobe Systems y dirigida a diseñadores gráficos y maquetadores profesionales. Presentada en 1999, su objetivo era constituirse en la alternativa a QuarkXPress. Este curso es impartido por Victoria Vázquez, técnico en Diseño gráfico y en Infografía, cursó máster en 3D y animación digital.</span>  </p>  <h4>¿Qué voy a aprender?</h4>  <p>  \tAprenderás a utilizar Adobe InDesign para la creación de prototipos de experiencia de usuario, agregándoles interactividad y movimiento a tus diseños, mientras aprendes a utilizar las herramientas y opciones que te ofrece InDesign para este propósito, como la utilización de guías, cuadriculas, estilos, junto con la creación de figuras vectoriales, y muchas cosas más.  </p>  <h4>¿A quién va dirigido?</h4>  <p>  \tEste curso va dirigido tanto a diseñadores, como a usuarios que deseen crear prototipos de experiencia de usuario con alta fidelidad.  </p>  <p>  \tImpartido por Carlos Uzcátegui, <span>Graduado en el año 1990 del Art Institute of Fort Lauderdale, en Estados Unidos, José M. Ramos ha ejercido su vocación como profesional creativo por más de 20 años. </span><span>Es experto certificado en Adobe InDesign, InCopy, Illustrator, Photoshop, Acrobat Pro y Dreamweaver. Además desde el 2009 es miembro activo del programa Adobe Community Professionals.</span>  </p>", 
    "end_date": null, 
    "title": "Crea prototipos para experiencia de usuario con InDesign", 
    "price": "30.00", 
    "instructors": "Pixel Web Pro", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284632_1ebc_2.jpg", 
    "course_url": "https://www.udemy.com/crea-prototipos-para-experiencia-de-usuario-con-indesign/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T16:59:30Z"
}