{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">LEARN BY DOING. A CREATIVE, HANDS-ON APPROACH.</strong><br style=\"\">  </p>  <p>  \t            In this practical, step-by-step tutorial course, you will learn key tools in Photoshop by creating 7 dynamic images. From start to finish, I will walk you through the process of starting with plain, normal photos, and guide you as we transform them into awesome masterpieces together.  </p>  <p>  \t<strong style=\"\">7 FUN PROJECTS OVER 7 DAYS.</strong>  </p>  <p>  \t              Rather than teach you a bunch of scattered concepts, I find that most people get a sense of fulfillment and satisfaction from creating a work from start to finish, and learning along the way. If you learn best by rolling up your sleeves and working in a project-based fashion, then this course is especially for you. Conquer a project a day in this course, and you will find that by the end of a week, you will know much more about Photoshop than when you started.  </p>  <p>  \t<strong style=\"\">THE PROJECTS YOU WILL COMPLETE:</strong>  </p>  <p>  \t<strong style=\"\">Warm Up Project 1:</strong> Take a standard nature photo and make it eye-catching and vibrant.  </p>  <p>  \t<strong style=\"\">  Warm Up Project 2:</strong> Learn how to integrate texture into your photo for a creative effect.  </p>  <p>  \t<strong style=\"\">Project 3: </strong>Take an ordinary afternoon photo, and turn it into a breathtaking sunset.  </p>  <p>  \t<strong style=\"\">  Project 4: </strong>Give a female model a digital, fun, stylish makeover.  </p>  <p>  \t<strong style=\"\">Project 5: </strong>Take an average sport photo and transform it into a dramatic and gritty scene. Then, we add some rain for good measure!  </p>  <p>  \t<strong style=\"\">Project 6: </strong>Turn a plain field into a convincing alien scene that is out of this world.  </p>  <p>  \t<strong style=\"\">Project 7</strong>:Transport a sleek, stunning car from the showroom to the wilderness, and then turn day into night.  </p>  <p>  \t              Let&#039;s roll up our sleeves and get to work!  </p>", 
    "end_date": null, 
    "title": "Crush Photoshop In A Week - Learn By Doing", 
    "price": "30.00", 
    "instructors": "Chamira Young", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/398210_4f8b_2.jpg", 
    "course_url": "https://www.udemy.com/crush-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-19T17:18:24Z"
}