{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>El curso de <strong>Affinity Designer en español</strong> se crea con la idea de hacer conocer esta potente herramienta al <em class=\"redactor-inline-converted\">público de habla hispana</em>. Por ese motivo el curso empieza de cero, de lo más básico. Trataré que el alumno, cualquier alumno, que acceda al curso se sienta cómodo desde un primer momento con la aplicación y hacer una progresión natural en su aprendizaje. Al final del curso todos podrán crear proyectos espectaculares. Si yo pude, con mi ayuda ustedes también podrán.<br></p>\n\n\n\n<p><em>Este curso va dirigido a todo aquel que tenga interés por el diseño gráfico, el dibujo vectorial o todo aquel que se haya propuesto crear gráficos ya sea para un entorno profesional o por afición.</em></p>\n\n\n\n\n\n\n\n<p>Así que no tengan miedo y apueste ahora por un mundo, el del diseño gráfico que esta en todos lados. Se han fijado alguna vez en la cantidad de diseños que vemos cada día, en todos los aspectos de nuestra vida, el cartel de una tienda, una tarjeta de visita, el logotipo del bote de champú, pues esos diseños los realizó alguien como usted o como yo. Sólo necesitaba la herramienta necesaria y Affinity Designer lo es, y con la ayuda de este curso usted aprenderá a dominarla.</p>\n\n\n\n<ul><li>Trabajar con capas</li><li>Proyectos gráficos en 3D</li><li>Crear carteles y logotipos</li><li>Combinar nuestro proyecto con otras aplicaciones de Affinity</li></ul>\n\n\n\n<p>Es una aplicación que crece día a día y que por tanto me obliga a mi como conductor del curso, como profesor, a ir actualizando periódicamente no solo con novedades, sino también con modificaciones en aspectos que ya están en uso. Lo que desde un principio describiremos como <em class=\"redactor-inline-converted\">un curso vivo</em>.</p>\n\n\n\n\n\n\n\n<p>El <strong class=\"redactor-inline-converted\">Contenido del Curso</strong> se basará esencialmente en <em class=\"redactor-inline-converted\">documentos en video</em>, aunque también puede contener alguna <em class=\"redactor-inline-converted\">lección de audio</em> cuando trate de exponer una experiencia propia y que crea que pueda ser interesante conocer por parte del alumno. También contendrá la documentación necesaria para seguir el curso, como puede ser algún ejemplo en imágenes realizadas por mi para tal propósito.</p>", 
    "end_date": null, 
    "title": "Curso de Affinity Designer en español", 
    "price": "25.00", 
    "instructors": "Alexandre Pan", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/828614_d44c_3.jpg", 
    "course_url": "https://www.udemy.com/curso-de-affinity-designer/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-21T21:47:15Z"
}