{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Objetivo do Curso:</strong></p><p>Aprender um programa complexo como Autodesk AutoCAD pode parecer uma tarefa difícil no início, mas vamos ajudá-lo a quebrar essa barreira em sua vida. <br></p><p>Aprenda a desenvolver projeto 2D no Autocad. Independente da sua versão do Software, o Curso de Autocad do básico ao avançado tem o propósito de ensinar aos alunos na Prática a criar Projetos 2D de acordo com as normas ABNT de desenho Técnico para aprovação da planta baixa na prefeitura, projetos arquitetônicos e de engenharia civil em geral. O aluno pode tirar as dúvidas com o professor por e-mail sempre que for necessário¹. </p><p>O foco do curso é o treinamento na prática, ensinamos os principais comandos do Software Autocad aplicado a um Projeto real, o aluno aprende passo a passo assistindo as aulas. Estude conosco e comprove nosso diferencial de ensino. </p><p><strong>Por que aprender AutoCAD?</strong></p><p>AutoCAD é um software usado por muitos engenharia e empresas científicos. Há sempre uma necessidade de alguém que pode transformar um conceito em um projeto real para mais tarde ser fabricado ou construído. Ao fazer este curso, você poderia abrir-se a novas oportunidades. </p><hr><p><strong>Requisitos para fazer o curso: </strong>Noções de Informática.</p><hr><p><strong>Benefícios em fazer este curso na Escola de Software:</strong></p><hr><ul><li>Suporte do Professor em caso de dúvidas.<br> </li><li>Impulsionar e Acelerar sua carreira (Temos parceria com as principais agências de emprego para indicação de seu Currículo)<br> </li><li>Formação Profissional com Certificado</li></ul><ul><li>Certificado Válido como Cursos Extra-Curriculares, Curso de Extensão, Atividades Complementares para cumprimento de carga horária para conclusão de cursos de graduação.<br> </li><li>Desenhar projetos arquitetônicos 2D ou Planta Baixa para aprovação na Prefeitura.<br> </li><li>Estudar no conforto de sua casa, escritório ou em qualquer lugar.<br> </li><li>Preço único, sem mensalidade.<br> </li><li>Assistir às vídeo aulas todas as vezes que tiver dúvidas.<br> </li><li>Estudar no seu tempo.</li></ul><p><strong>Público alvo:</strong> Engenheiro Estrutural, Arquitetos, Design, Engenheiro Civil, Mestre de Obras, Técnico em Edificações e atividades afins</p><p><strong>Objetivo do Curso:</strong> O Objetivo do Curso de Autocad é ensinar a fazer na Prática desenhos técnicos e arquitetônicos de acordo com as Normas ABNT, no final do Curso o aluno dominará os principais comandos do Software assim como o desenvolvimento de qualquer planta baixa 2D para Prefeitura, Obras de Execução, Implantação, Etc.</p><hr><p><strong>Cronograma das Aulas do Curso Autocad na Prática em Vídeo Aulas Online e DVD</strong></p><hr><p>No Curso o Professor explica de forma dinâmica e detalhada ao aluno os principais comandos do Software Autocad, fazendo um projeto Real, conforme o professor vai fazendo a planta ele vai explicando para que serve cada comando, assim não cança o aluno, pois ele vai fazendo junto com o professor, o processo de aprendizado é muito rápido, em pouco tempo você saberá utilizar um Software Complexo como o Autocad, pois passamos todas as dicas e melhores práticas de desenvolvimento de projetos arquitetônicos, caso o aluno tenha dúvida pode recorrer a qualquer momento ao professor por Email e as perguntas são rapidamente respondidas.</p><hr><p>- Apresentação do Autocad, Interface do Autocad<br>- Criação de um projeto a partir de um desenho <br>- Comandos de Desenho<br>- Comandos de Visualização<br>- Object Snap<br>- Inserir Blocos e Objetos nos Projeto<br>- Cotas, Dimensionamento, Medidas, Textos<br>- Criar Hachuras <br>- Criação de Paredes, Portas e Janelas<br>- Criação de Layers<br>- Configuração do Layout: Folhas do Projeto <br>- Ploter: Impressão Model Space e Papel Space: Configurar ploter/impressora e tamanho da folha para imprimir/plotar um desenho.<br>- Criar um layout para impressão/plotagem do desenho, com carimbo em uma folha (tamanho padrão ABNT), determinando várias escalas e detalhes; <br>- Salvar o Desenho em PDF</p><p><strong>MÉTODO E MATERIAL DIDÁTICO COMPLETO:</strong></p><ul><li>Vídeo aulas Online em alta qualidade HD digital</li><li>Vídeo aulas extras online (conteúdo personalizado, conforme necessidade do aluno)</li><li>Exercícios</li><li>E-book: apostilas digitais com dicas e truques</li></ul><p><br><br><br><br><br><br>  </p>", 
    "end_date": null, 
    "title": "Curso de Autocad 2D na Prática", 
    "price": "20.00", 
    "instructors": "Escola de Software Claudio M. Antonio", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/144920_af07_4.jpg", 
    "course_url": "https://www.udemy.com/curso-autocad-online/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-10T02:52:02Z"
}