{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  En este curso conoceremos tres técnicas diferentes que, combinadas entre sí, nos permiten la clonación de personas en un mismo plano-secuencia, con un resultado muy realista.  </p>  <p>  \tEl software de edición Adobe® Premiere® Pro combina un rendimiento increíble con una interfaz de usuario atractiva y rediseñada y un conjunto de nuevas y fantásticas funciones que incluyen el Estabilizador de deformación para estabilizar las secuencias, el recorte dinámico de la línea de tiempo, la edición multicámara ampliada, las capas de ajuste y mucho más...  </p>  <p>  \tEste curso lo imparte Jesús Hidalgo. Jesús cuenta con más de 20 años de experiencia en diseño gráfico, fotografía profesional y grabación, edición y postproducción de vídeo. Ha ejercido su profesión como freelance en España, Francia, Rusia, Italia, Brasil... para finalmente fundar “emotions”, desde donde nos ofrece soluciones inte- grales de imagen, comunicación y vídeo para Pymes y Grandes Cuentas. En su dilatada trayectoria profe- sional ha colaborado con empresas tan prestigiosas como Canal+, Marca, Actualidad Económica, Higashi Nishi, Estudio Mariscal, Globo Brasil, 40 principales, así como entidades gubernamentales, entre ellas el Excmo. Ayuntamiento de Sevilla y la Diputación de Cáceres.  </p>", 
    "end_date": null, 
    "title": "Cómo clonar personas en Premiere Pro", 
    "price": "25.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/184924_a697_2.jpg", 
    "course_url": "https://www.udemy.com/como-clonar-personas-en-premiere-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-19T00:39:07Z"
}