{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Last course update:</strong> June 10th 2016 new lessons added<br></p>\n\n<p>My name is Adria Jimenez, and I am an engineer and designer passionate about technology, design and excellent products with years of experience working in big and small projects.</p>\n\n\n\n\n\n\n\n<p>During last year, I’ve tried different approaches to keep my designs (Sketch, Photoshop, and images) under control and backed up.</p>\n\n\n\n\n\n\n\n<p><strong>First of all, I had several requirements:</strong></p>\n\n\n\n\n\n\n\n<ul><li>Keep <strong>design versions</strong> enabling me to go back in time like I do in Mac Time Machine</li><li>Ability to completely <strong>change</strong> any design at any time without losing my early progress</li><li>Have <strong>backup </strong>of my designs</li><li>Make my designs<strong> shareable</strong> with my colleagues so they could collaborate on my ideas</li><li>Cheap or ideally <strong>free</strong> to use</li><li><strong>Simple</strong> folder structure</li><li><strong>Easy</strong> to use</li><li><strong>Future</strong> proof</li></ul>\n\n\n\n\n\n\n\n<p>As you can see, it is something basic if you are a freelancer or work with a small team of people. I tried several online services like Dropbox and some other offline inventions like having my complex set of folders, or multiple copies of files but at the end nothing worked as I wanted or it created much overhead.</p>\n\n\n\n\n\n\n\n<p><strong>Finally, I found a solution</strong> and it worked so great that I decided to teach other designers like you how to replicate and benefit from my workflow.</p>\n\n\n\n\n\n\n\n<p><strong>What are you getting with the course?</strong></p>\n\n\n\n\n\n\n\n<ul><li>Proven working workflow</li><li>Lifetime access</li><li>HD video lessons</li><li>Step by step guides</li><li>Knowledge quizzes</li></ul>\n\n\n\n\n\n\n\n<p><strong>What you'll be able to do at the end?</strong></p>\n\n\n\n\n\n\n\n<p>By the end of the course, you'll be able to use my refined workflow to keep your designs organized and versioned.</p>\n\n\n\n\n\n\n\n<p>You’ll benefit from the ability to know at each point in time what did you do and why did you do it, and not only that. You’ll be able to go back in time to recover a particular design at a given point in time, all of that while having just one design file instead of multiple copies of it.</p>\n\n\n\n\n\n\n\n<p>As soon as you get used to this workflow you will not believe how you have been so long without doing your daily work like this.</p>\n\n\n\n\n\n\n\n<p><strong>Who is the ideal student?</strong></p>\n\n\n\n\n\n\n\n<p>The ideal student for this course is someone who works with design files, either Photoshop, Sketch or any other tool. There is no limitation in the tool to use.</p>\n\n\n\n\n\n\n\n<p>It can be either working on big projects with a lot of other people or something small, personal projects or a freelancer.</p>\n\n\n\n\n\n\n\n<p>See you inside the course, learn the new workflow and change the way you work forever.</p>", 
    "end_date": null, 
    "title": "Design Versioning - Version control for designers", 
    "price": "45.00", 
    "instructors": "Adria Jimenez", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/715494_c405_4.jpg", 
    "course_url": "https://www.udemy.com/version-control-for-designers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T11:52:45Z"
}