{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\r\n\t  Scribus (<a href=\"http://scribus.net/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">http://scribus.net</a>) is similar to Adobe InDesign, QuarkXPress, and MS Publisher, but Scribus is free, open source and available to anyone around the world. This is a savings of roughly $700.00 or $50/month as compared to using alternatives.\r\n</p>\r\n<p>\r\n\t Learn desktop publishing using free Scribus to create business cards, brochures, flyers, full size posters, newsletters, magazine publications, and even books.  Personally, I use Scribus to create GIMP Magazine, several brochures, certificates, calendars, design proposals, awards certificates, business cards and several other professional looking documents.\r\n</p>\r\n<p>\r\n\t<strong>  THIS COURSE INCLUDES:</strong>\r\n</p>\r\n<ul>\r\n\t<li>RUNNING TIME: 5hr 51min of step-by-step video tutorials with voice instruction</li>\r\n\t<li>LANGUAGE: English</li>\r\n\t<li>PLATFORM: Windows, Mac and Linux</li>\r\n\t<li>ASPECT RATIO: 16:9 widescreen</li>\r\n\t<li>FILE FORMAT: HD 720 WMV</li>\r\n\t<li>COURSE INDEX: 40-page interactive PDF including table of contents, resources, definitions, index and more</li>\r\n\t<li>VIDEOS: 32 instructional videos</li>\r\n\t<li>EXERCISES: 19 exercise and four demonstration folders, approximately 100 files, totalling roughly 300 MB</li>\r\n\t<li>COURSE NOTES: 94-page printable course notes PDF, plus an interactive PDF format</li>\r\n\t<li>SUPPORT: Basic email support provided</li>\r\n\t<li>UPDATES: Course updates provided as digital download.  This includes minor updates and you will be notified by email with a digital download link of any updates, new exercises etc. And this is included in the cost of the course purchase.</li>\r\n\t<li>SPECIAL FEATURES: Steve Czajka, the managing editor for GIMP Magazine, provides a review of self-publishing an international magazine. This review covers the major steps to start up a magazine, build a following via social media, and provide amazing content. Steve shares the publishing workflow procedures that GIMP Magazine utilizes for each issue of the publication, typography style guides and several design considerations to creating a clean and appealing magazine layout. Check out Steve&rsquo;s design portfolio at http://flickr.com/steveczajka</li>\r\n</ul>\r\n<p>\r\n\t   And all 134 pages of this course was authored using Scribus in addition to all screens used in the video production.\r\n</p>\r\n<p>\r\n\t  Watch a short video that describes this course, and provides two tutorials to create a magazine cover, and calendars in Scribus.(<a href=\"http://www.youtube.com/watch?v=XoHecQCn8hM\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\">http://www.youtube.com/watch?v=XoHecQCn8hM</a>)\r\n</p>", 
    "end_date": null, 
    "title": "Desktop Publishing Using Scribus (like Adobe InDesign)", 
    "price": "50.00", 
    "instructors": "Steve Czajka", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/138636_4d07_6.jpg", 
    "course_url": "https://www.udemy.com/desktop-publishing-using-scribus-like-adobe-indesign/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-12-27T19:44:44Z"
}