{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  Con este curso de Adobe Digital Publishing Suite aprenderás a crear con las nuevas herramientas de InDesign atractivos documentos completamente interactivos que podrán ser comercializados en diferentes appstores, distribuidos digitalmente y cargados en dispositivos como tablets y smartphones con sistema operativo Android e iOs.  </p>  <p>  \t Adobe InDesign (ID) es una aplicación para la composición digital de páginas desarrollada por la compañía Adobe Systems y dirigida a diseñadores gráficos y maquetadores profesionales. Presentada en 1999, su objetivo era constituirse en la alternativa a QuarkXPress.  </p>  <p>  \t Este curso es impartido por Victoria Vázquez, técnico en Diseño gráfico y en Infografía, cursó máster en 3D y animación digital. Experta en creación de contenidos para la formación por la Universidad de Salamanca, lleva más de 5 años trabajando como editora de contenidos multimedia y formadora para diferentes consultoras.  </p>  <p>  \t En este curso cubriremos los siguientes temas:  </p>  <ul style=\"\">  \t<li>Consideraciones de diseño</li>  \t<li>Crear documentos</li>  \t<li>Folios</li>  \t<li>Artículos y esquemas</li>  \t<li>Elementos interactivos</li>  \t<li>Hipervínculos</li>  \t<li>Proyección de diapositivas</li>  \t<li>Panorámica</li>  \t<li>Audio y video</li>  \t<li>Contenido web</li>  \t<li>Recorrido y zoom</li>  \t<li>Marco desplazable</li>  \t<li>Secuencia de imágenes</li>  \t<li>Adobe Content Viewer</li>  </ul>", 
    "end_date": null, 
    "title": "Digital Publishing Suite", 
    "price": "20.00", 
    "instructors": "Trazos_TV Videoformación online especializada en diseño digital", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/173732_8a0f_2.jpg", 
    "course_url": "https://www.udemy.com/digital-publishing-suite/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-27T09:35:22Z"
}