{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn Digital Art Fundamentals with Corel Painter. This course is designed to help you observe your design surroundings and appreciate the aesthetics that make it. In other words the principles and elements of good design is what we shall explore in this course.<br></p>    <p><strong>Projects</strong></p>  <p>After we cover these principles and elements, we will then move on and work on a practical project at the end of this course. We will look at the design brief, research and reference, planning for production and pre-visualization to Finished Artwork.</p>    <p><strong>Who Should Take This Course</strong></p>  <p>This course is designed for anyone who enjoys digital art, from photographers, graphic and web designers, animators and more. Whether a beginner or even an intermediate user, you will gain a vast on skills taking this course. </p>    <p><strong>Prerequisites</strong></p>  <p>There are no skill prerequisites for this course. You are expected to have access to a copy of Corel Painter in any version, though we will be using Painter 2015 in this course, no prior Painter skills are required.</p>    <p><strong>What am I going to get from this course?</strong></p>  <p>         •       Quick orientation with Corel Painter   </p>  <p>         •       Composing with paint and imported content        </p>  <p>         •       Introduction to lighting tools in Corel Painter </p>  <p>         •       Proportion in Composition  </p>  <p>         •       Mixing Fonts     </p>  <p>         •       Properties of Line      </p>  <p>         •       The Art of Simplification     </p>  <p>         •       What is Light Logic and Radiosity</p>  <p>+ more...</p>    <p><strong>What is the target audience?</strong></p>  <p>Photographers, graphic and web designers, animators and anyone loving digital arts. </p>", 
    "end_date": null, 
    "title": "Digital Art Fundamentals using Corel Painter", 
    "price": "50.00", 
    "instructors": "Corel Corporation", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562628_c112_4.jpg", 
    "course_url": "https://www.udemy.com/digital-art-fundamentals-using-corel-painter/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T13:44:13Z"
}