{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      En éste curso grabado por un &quot;Adobe Certified Expert - Muse&quot; aprenderás a crear sitios web multi-screen (para desktops, tablets y smartphones) basados en estándares actuales (HTML5, CSS y JavaScript) y sin necesidad de escribir una sola línea de código.  </p>  <p style=\"\">  \t      El curso cubre desde los aspectos más básicos hasta los más avanzados de la aplicación y finaliza con un taller práctico donde crearemos un sitio web que se verá correctamente en cualquier dispositivo y el cual será publicado en un hosting independiente y en el servicio donde incluso mostraremos cómo configurar un dominio personalizado.  </p>  <p style=\"\">  \t      Aunque te recomiendo ver el curso en orden, también puedes ver directamente los talleres prácticos y revisar en los primeros capítulos los conceptos de los cuales tengas dudas. Las secciones que lo requieren tienen archivos para descarga con los cuales podrás replicar los ejercicios y talleres de este curso.  </p>  <p style=\"\">  \t      A éste curso le estaré agregando permanentemente todas las novedades agregadas por Adobe para mantenerlo actualizado a las últimas capacidades y características de Adobe Muse.  </p>  <p style=\"\">  \t  Si deseas contratar éste u otro curso para un grupo empresarial o universidad de forma presencial u online puedes contactarme desde el sitio web de Xpert o por mensaje privado desde mi perfil de Udemy.  </p>  <p style=\"\">  \t<em style=\"\"><strong style=\"\">Última actualización de este curso: Agosto 13 de 2014</strong></em>  </p>", 
    "end_date": null, 
    "title": "Diseña sitios web en HTML5 con Adobe Muse CC sin programar", 
    "price": "50.00", 
    "instructors": "Marlon Ceballos", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36437_04b2_7.jpg", 
    "course_url": "https://www.udemy.com/adobe-muse/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-16T16:56:54Z"
}