{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t Ditch Auto is about taking your camera and your mind out of Automatic mode to gain more control over the photos you take. After producing <a href=\"https://www.udemy.com/ditch-auto-start-shooting-in-manual/\" target=\"_blank\" class=\"external-link\" rel=\"nofollow\" style=\"\">Ditch Auto: Start Shooting In Manual</a>, feedback suggested that I do a workflow course. This is the first of many workflow courses to come.  </p>  <p>  \t Despite our best efforts, not all of our photos will turn out golden right from the camera. It is often that we have to run a photo through Lightroom and even Photoshop to give it that look we were looking for when we took the photo in the first place. The photo we will be editing in this course is a photo of my good friend&#039;s Subaru Impreza STI. The car is nice, but the lighting situation for this photo was not. The sun was almost gone and I had to stretch my camera just to get the shot. The result, was not a photo I was very proud of but I knew had potential if I just spent some time on it.  </p>  <p>  \t In this course I take a photo and edit it completely in Adobe Lightroom and Adobe Photoshop. You will learn my complete workflow for bringing an image back to life.  </p>  <p>  \tIn this course I cover:  </p>  <ol style=\"\">  \t<li>Importing of images into Adobe Lightroom</li>  \t<li>Image Adjustment Settings in Lightroom</li>  \t<li>Repair of Underexposed and Noisy Images</li>  \t<li>How to bring back detail in the image</li>  \t<li>Opening a photo in Photoshop from Lightroom</li>  \t<li>Editing and Cleanup in Photoshop</li>  \t<li>Sky Replacement</li>  \t<li>Returning to Lightroom to Color Correct</li>  \t<li>Watermarking</li>  \t<li>Image Export</li>  </ol>  <p>  \tYou will need Adobe Lightroom and Photoshop to follow along with this course. Thankfully, you can now get both of these applications through Adobe Creative Cloud for as little as $9.99 per month. The benefit of Adobe&#039;s Creative Cloud is that you never have to pay full price for Adobe software and you get all of the updates and upgrades for free. I like their new subscription model because it allows me to have the latest software without having to drop at least $1,000 each year.  </p>  <p>  \tMy goal is to help you become a solid Lightroom and Photoshop user and editor so you can get the most detail and definition out of your photos.  </p>  <p>  \tThis course is for you or someone you know who struggles with Lightroom and/or Photoshop. If you have ever taken a photo that just didn&#039;t pop but you knew had potential, this course is for you.  </p>", 
    "end_date": null, 
    "title": "Ditch Auto: Editing Workflow in Lightroom & Photoshop", 
    "price": 0, 
    "instructors": "Jerad Hill", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/120654_39ef_5.jpg", 
    "course_url": "https://www.udemy.com/ditch-auto-editing-workflow-in-lightroom-photoshop/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-16T00:22:19Z"
}