{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>PICK UP SOME COOL GRAPHIC DESIGN IDEAS!</strong> If you're into creating some <em>snazzy</em> images for social media marketing using Photoshop, or even just learning a little bit about Photoshop ... get yourself enrolled. <em><strong>You will have me on video—in the bottom right portion of your screen—guiding &amp; instructing you</strong></em> as we look at some neat ways to make stunningly attractive graphics<strong>—hassle free. </strong>  </p>  <p>  \t<strong>         In this course, we will examine:</strong>  </p>  <ol>  \t<li><em>Basic tools and layout while starting an image to get your feet wet<br>  \t</em></li>  \t<li><em>Using Photoshop Patterns for cool effects<br>  \t</em></li>  \t<li><em>Using Photoshop &amp; brush settings for maximum attractiveness<br>  \t</em></li>  \t<li><em>Using several Photoshop tools together to create Photoshop images you can share on your social networks (e.g. facebook, Pinterest, Instagram &amp; twitter.)</em></li>  </ol>  <p>  \t                       For more than 15 years, I have used these techniques in my various web design projects, ranging from internet web design, shopping cart product graphics, logo design &amp; trademark design, kindle book cover design, kindle book graphics, PowerPoint presentation design, electronic greeting card design, etc.  </p>  <p>  \t<strong>       What if you were to take 30-60 minutes to walk through some Photoshop techniques with me?</strong> Might they possibly enhance your efforts in your own projects? What about that next job interview? Could you possibly use one or more of these E-Z Photoshop techniques to <em>wow</em> your next employer?  What if you used their company logo married to a photo of yourself on a cool background, created with a Photoshop pattern idea we cover in this course?  </p>  <p>  \t                   Looking back some years, once I was hired because when I submitted my resume, I broke from the \"norm\" and took a chance. I mean, how relevant is a resume when it's overlooked and passed over? This is why I believe <strong><em>sweet looking images</em></strong> can make an impact!  </p>  <p>  \t                   During my interview, my lead cover page was brought out as a topic of discussion. With smiles and laughs from the Director of IT, it was clear my efforts had achieved my primary objective of getting noticed and interviewed. The cover page contained several Photoshop images. They were all created using techniques I will share with you in this course.  </p>  <p>  \t                  One snapshot was for a clever and catchy web site I had put together as one of my own projects. What caused me to stand out—after God's favor of course—was this lead cover page which displayed my unique creativity and personality. Well, people want to see <strong><em>your </em></strong>unique abilities and ideas as you share <em><strong>your</strong></em> visual communications, as well!</p>  <p>  \t<strong>Use just a handful of design tools &amp; techniques to  capture more attention </strong>in your social media networks, your hobbies and your web design projects. Unleash your creativity using visual communications and Adobe Photoshop in this cool, new course!  </p>", 
    "end_date": null, 
    "title": "E-Z Photoshop Techniques for Social Media Marketing", 
    "price": 0, 
    "instructors": "Jeff Zahorsky", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/259002_bee7_12.jpg", 
    "course_url": "https://www.udemy.com/e-z-photoshop-techniques/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-10T13:41:37Z"
}