{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tAdobe Audition (anteriormente conocido como Cool Edit Pro) es un editor de audio multiplataforma comúnmente utilizado en producción de vídeo, audio, música y juegos. Los usuarios pueden trabajar en modo Multipista para construir elaboradas estructuras de audio, o en la interfaz de Forma de onda para aplicar múltiples efectos, editar y mezclar pistas, ajustar proyectos y llevar a cabo restauración de audio.<br style=\"\">  \t<br style=\"\">  \tAudition CS6, la más reciente versión al momento de esta descripción, incluye nuevas características como el estiramiento de clips en tiempo real, alineación automática de voz y automatización de parámetro. Está disponible como producto individual, como parte de CS6 Production Premium, o a través de Adobe Creative Cloud.  </p>  <p>  \t<span>En este curso de Audition CS6 verás todas las características necesarias  de este programa y podrás editar sonido de forma profesional, corregir  audios, sea música, diálogos, u otros efectos de sonido. </span>  </p>  <p>  \t<span>I</span><span>niciaremos  cubriendo cómo importar, registrar y administrar los archivos de audio,  desde la extracción de audio y la importación de vídeo, a la creación de  una nueva sesión multi pista desde cero. Luego nos sumergimos  profundamente en la edición, reparación y limpieza de archivos de audio,  utilizando la forma de onda y editores multi pista, además de la  frecuencia espectral.</span>  </p>", 
    "end_date": null, 
    "title": "Edita y crea audios profesionales con Adobe Audition CS6", 
    "price": "20.00", 
    "instructors": "Pixel Web Pro", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/284506_8c64_2.jpg", 
    "course_url": "https://www.udemy.com/edita-y-crea-audios-profesionales-con-adobe-audition-cs6/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-20T14:53:03Z"
}