{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Course description</strong><strong></strong><br></p><p>Thanks to this course, you in the shortest possible time will discover the principles of operation in Autodesk Inventоr, you will be able to create your own 3D model of a high complexity.</p><p><strong>Build a strong foundation in Autodesk Inventor with this tutorial for beginners.</strong><strong></strong><br></p><ul><li>Interface review and program settings</li><li>Work with 2D sketch</li><li>Operation Extrude and Revolve</li><li>Loft, Sweep and Coil</li><li>Task with Parts</li><li>A concept of the Project, Parametric Part</li><li>Analysis of the stress of the Part</li><li>Creating an Assembly</li><li>Operation with the Assembly</li><li>Creating Drawings</li></ul><p><strong>A Powerful Skill at Your Fingertips </strong><strong></strong></p><p>The video course is designed both for people who are just beginning to explore three-dimensional design, and for experienced engineers looking to improve their skills thanks to the advice of professionals.<br></p><p>Just repeat everything that happens on your screen in real time, and You will learn how to use the program, and most importantly understand what is digital prototyping and what is their advantage compared to conventional drawings!<br></p><p><strong>Content and Overview</strong><br></p><p>It has been more than 25 years since Autodesk for the first time came out on the CAD systems market (Computer-Aided Design). Since that time a lot has changed in the industry.<br></p><p>Powerful technology of digital prototypes is changing the view of professionals on design, allowing them to build the entire workflow around a single digital model (prototype). </p><p>What is a digital prototype? Digital prototype is a virtual engineering sample of a ready–made product and is used for the optimization and validation purposes. </p><p>The basis for such technologies is Autodesk Inventоr.</p><p>Autodesk Inventоr allows you to create structures and mechanisms of varying complexity in a short time, with a clarity of creation process. </p><p>There is no longer any need to imagine everything in your head, thinking about how your product will look like when it is ready. You can see it on the monitor before you publish drawings and send them to production. </p><p>In addition, you will be able to perform a calculation of mechanism, and find the appropriate materials.</p><p>Forget about counting small parts and components of assembly – the software will do it for you and will create a finished specification automatically!</p><p>The first time you start a new software always raises the question: Where to begin? It is important to choose the correct path at the very beginning, in order to avoid the follow-up errors.<br></p><p>With this book you will understand where to begin your work and how to create parts and assemblies in the most rapid and correct way. </p><p>Thanks to this book, you in the shortest possible time will discover the principles of operation in Autodesk Inventоr, you will be able to create your own 3D model of a high complexity.<br></p><p><strong>If you want to learn how to make a 3D design in Autodesk Inventor</strong><strong>...</strong><br></p><p>So, if you want to learn how to make a 3D design in Autodesk Inventor, how to carry out your work better, and as quick as possible, how to be competitive in the modern labor market, this course is for you! </p>", 
    "end_date": null, 
    "title": "Engineering Design in Autodesk Inventоr", 
    "price": "20.00", 
    "instructors": "Dmytro Zinoviev", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/705808_7cf1_2.jpg", 
    "course_url": "https://www.udemy.com/inventror/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-24T15:36:32Z"
}