{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Have you been hoping to get going on Photoshop AND Final Cut Pro X, but you are too overwhelmed or intimidated?</strong><br></p><p>Join Dr. YouTube as he tames these wild beasts right before your very eyes! In a short time, you'll be diving into both Photoshop CS6 AND Final Cut Pro X with confidence - and creating your own viral works!</p><p><strong>Course Launched 1/29/16</strong></p><p>Robert Scot (aka Dr. YouTube) presents an easy-to-follow plunge into the world's finest creative tools - Photoshop and Final Cut Pro X - including how to's on every tool you'll need to get rolling.</p><p>Robert speaks in plain language and his love for the software makes every lecture a joy.</p><p>In Photoshop, you'll learn everything you need to know about the graphics, text, and editing tools to get you working - AND playing!</p><p>In the Final Cut Pro X portion of the course, Robert teaches you how to work with your clips, graphics, text, and objects to create slick professional videos, with sound and video effects and smooth transitions.<br></p><p>Get ready to create your own viral video - with all the most popular features and effects!</p><p>Another great feature of this course … Robert Scot is a full-time Udemy instructor, with 10 course on Udemy. He prides himself on being available on the Discussion Board for very quick response to any questions or difficulties a student might experience.</p>", 
    "end_date": null, 
    "title": "Enjoy Adobe Photoshop & Final Cut Pro: The Basics", 
    "price": "30.00", 
    "instructors": "Robert Scot", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/743802_78a6_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-basics-and-final-cut-pro-x-basics-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T17:20:52Z"
}