{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p></p><p><strong>About the course:</strong></p><p>InDesign offers many options to incorporate images in your <strong>print and interactive layouts</strong>. With this course you can learn everything you need to know from placing images into your documents to advanced composition techniques.<br></p><p><strong>The course includes:</strong></p><ol><li>18 instructional video tutorials</li><li>Quizzes about the techniques learnt in each section</li><li>Exercise files used in the course to help follow along and practice</li><li>Essential Skills for Designers &amp; Career Guide PDF</li><li>Design Terminology PDF</li><li>Useful Keyboard Shortcuts PDF</li><li>Collection of Useful websites for Designers PDF</li><li>Certificate of completion</li></ol><p><strong>How long will the course take to complete?</strong></p><p>This course will take&nbsp;<strong>only 2 hours to complete</strong>, but it will take some time to put all the techniques into practice.</p><p><strong>How the course is structured?</strong></p><p>The course is structured into&nbsp;<strong>18 videos</strong>, each explaining a technique for working with images in InDesign. It is recommended to watch the videos in order of the outline but you can also choose to watch them individually. After each section you can take Quizzes to revise the crucial techniques and definitions learnt on the way.</p><p><strong>Why take this course?</strong></p><p>Easy. If you want to get a job as a designer either being employed or freelancing, you have to know how to work with images in InDesign. This course will make you very confident about this essential skill for designers.&nbsp;This course is for you if you are planning to take your InDesign skills to the next level and want to become a Pro in no time.</p><p></p>  ", 
    "end_date": null, 
    "title": "Essential Skills for Designers - Images in InDesign", 
    "price": "20.00", 
    "instructors": "Martin Perhiniak", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/53430_2243_9.jpg", 
    "course_url": "https://www.udemy.com/images-in-indesign/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-05-11T17:49:43Z"
}