{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>'ESSENTIALS:  Adobe Illustrator for Merch by Amazon' is an Illustrator course for creating graphic designs for Amazon's newest platform for content creators, Merch by Amazon. This course is aimed at the intermediate, specifically those who finished 'Basic: Adobe Illustrator for Merch by Amazon' Udemy course.   </p><p>Although this course is aimed at the intermediate designer and user who completed the prior Udemy course (Basic: Adobe Illustrator for Merch by Amazon), it is not required for the lessons.   There is much to be learned here for anyone with Adobe Illustrator.</p><p>This course covers all the Essentials you will need to create great looking T-shirt designs.   You will learn to vectorize a photo with Image Trace, basic shapes (squares, circles, stars and more),  easy color matching, aligning objects, and stacking object above or below other objects.    And that's not all---  this course has my take on Typography in Illustrator.    Learn how to make compelling, fun, and complex effects for text in Illustrator.   I'll show you how to make whacky flowing text with the Touch Type Tool, multiple strokes (outlines), gradient fills, drop shadows, outer glow, text warping (transform), and rotating mandalas.    </p><p> Learn how to outshine the competition on Merch by Amazon!<br></p>", 
    "end_date": null, 
    "title": "Essentials: Adobe Illustrator for Merch by Amazon", 
    "price": "50.00", 
    "instructors": "Merch Maniacs", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/780328_74d6_2.jpg", 
    "course_url": "https://www.udemy.com/essentials-adobe-illustrator-for-merch-by-amazon/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-02T20:27:15Z"
}