{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><p>In this Flash training course with Flash CS6  Tutorials, experienced trainer and author Geoff Blake introduces you to Flash,  and how you can use it for your design projects. Flash is a multimedia platform that can be used for  everything from playing movies, to creating animations, to creating fully  interactive games. </p>    <p>You will start with the absolute basics in  this Flash training video, getting comfortable with the interface and tool  locations within the software. You will quickly delve into working with the drawing tools, playing with  shapes and colors, and how to manage objects. You will learn how to work with  text, create and manage symbols and how to work with the Flash CS6 library. As  your knowledge grows, Geoff introduces you to the power of animation within  Flash using keyframes, timelines, tweening and more. This video tutorial closes  out with a short tutorial on ActionScript, and how to publish your projects  from Flash CS6.</p>    <p>By the conclusion of this computer based  Flash training course for Adobe Flash CS6, you will be fully comfortable with  the basic tools and techniques in Flash, and capable of creating and publishing  dazzling Flash projects! Working files are included to allow you to work  alongside the author as he covers each subject throughout this Flash training  course.</p>    <p>Take this Flash Training course and learn  from Flash CS6 Tutorials.</p>&lt;/p&gt;  ", 
    "end_date": null, 
    "title": "Flash CS6 Tutorial - An Essential Guide For Web Developers", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "9 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23975_e013_8.jpg", 
    "course_url": "https://www.udemy.com/learning-flash-cs6-an-essencial-guide-for-web-developers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-31T17:35:33Z"
}