{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  In this course, attendees will learn how to <strong style=\"\">create a collage in Photoshop CS5</strong> using their own images.  They&#039;ll also <strong style=\"\">learn six different enhancements</strong> they can use to <strong style=\"\">customize their collage</strong>, and they&#039;ll learn many s<strong style=\"\">kills and techniques in Photoshop</strong> along the way ... skills they can use in <em style=\"\">all </em>of their future Photoshop projects.  Structured so attendees can <strong style=\"\">follow along every step of the way</strong>, and pause between lectures to implement what they just learned on a collage of their own, this course is designed to make working in Photoshop <strong style=\"\">FUN</strong>!  </p>  <p style=\"\">  \t  So if you&#039;ve always wanted to learn how to <strong style=\"\">get creative</strong> and make some fun collages in PhotoShop ... this is <strong style=\"\">the perfect course for you!</strong>!!  </p>  <p style=\"\">  \t The best part?  It&#039;s <strong style=\"\">not just dry theory and instruction</strong>.  You&#039;ll <strong style=\"\">finish up this course with a completed collage of your own </strong>... and know how to create many more unique and varied collages, so this <strong style=\"\">isn&#039;t just a one project course</strong>.  This course will <strong style=\"\">open up a whole world of possibilities</strong> for you!  And ALL of the <strong style=\"\">skills</strong> you learn will prove invaluable to you in future courses ... <strong style=\"\">text, fonts, brushes, layers, images, clipping masks, transform, grouping, file format, and so much more!</strong>  </p>", 
    "end_date": null, 
    "title": "Fun With Photoshop: Turn Your Photos Into Striking Collages", 
    "price": "25.00", 
    "instructors": "Tina L. Scott", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/145382_96c7_9.jpg", 
    "course_url": "https://www.udemy.com/fun-with-photoshop-turn-your-photos-into-striking-collages/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-11T00:34:24Z"
}