{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Photoshop</strong> - very unusual program! It is on everyone&#039;s lips, its all want to learn, but at the same time, it is so complex that only a few possess it.  </p>  <p style=\"\">  \t    And the main problem is that people simply do not know how to approach it and how to study it!  </p>  <p style=\"\">  \t    For some reason, many people think that Photoshop can be explored at random, as any simple program or the remote control for the TV.  </p>  <p style=\"\">  \t    The man, not knowing the basics, starting to poke all the necessary and unnecessary tools receives the output complete nonsense and starts to get upset because of this.  </p>  <p style=\"\">  \t    Have you ever wondered why people do not give a driver&#039;s license until they pass a theoretical course and then do not consolidate their knowledge of driving practice?  </p>  <p style=\"\">  \t    The answer is simple: all and so it is clear that without appropriate training people not leave and can not only ruin your own car, but also cause damage to someone else.  </p>  <p style=\"\">  \t    The same is the case with any complicated computer program, such as for example Photoshop or 3DS Max.  </p>  <p style=\"\">  \t    Without theoretical training and practical exercises to catch something here!  </p>  <p style=\"\">  \t  But with my help, I will help you learn the basics of Photoshop.  </p>  <p style=\"\">  \t  So let&#039;s start learning =)  </p>", 
    "end_date": null, 
    "title": "Fundamental principles of working with Photoshop", 
    "price": "20.00", 
    "instructors": "Artem Vasilenko", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234344_d17e_2.jpg", 
    "course_url": "https://www.udemy.com/fundamental-principles-of-working-with-photoshop-and-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-30T23:10:25Z"
}