{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Learn the GIMP from the Ground Up</strong>  </p>  <p>  \t  In this course I&#039;ll show you how to use the Gnu Image Manipulation Program (GIMP), a free Photoshop like program, to produce professional looking, high quality graphics on a budget. The course uses the creation of book covers for self-publishing as the basis for demonstrating the use of the program. The techniques demonstrated can be used to create stunning graphics for any purpose including display on the Web.  </p>  <hr style=\"\">  <p>  \t<em style=\"\"><strong style=\"\">GIMP Easily Explained:</strong> <br style=\"\">  \t   Excellent course with detailed explanations on how to use GIMP to create fabulous book covers. Thank you! <br style=\"\">  \t   -Maria Oquendo </em>  </p>  <hr style=\"\">  <p>  \t  This course provides material suitable for the absolute beginner and includes information on how to install all required tools and resources.  It then goes on to show you how to use those components to produce unique, professional looking, and high quality graphics suitable for use as book covers for self-publishing.  The course includes information on graphic composition that can be used to cause the most important elements of your image stand out.  </p>  <p>  \t<strong style=\"\">Note:</strong> I demonstrate the use of the GIMP on a PC running Microsoft Windows 7. If you&#039;re a Linux or Mac user, the GIMP is also available to you, and information in this course beyond installation is fully applicable.  </p>  <p>  \t<strong style=\"\">Sell More of Anything with Professional Looking Graphics</strong>  </p>  <p>  \t  Though you shouldn&#039;t judge a book by its cover, the truth is that most people do exactly that.  Why not produce the best impression you can by displaying stunning graphics mixed with text.  Whether you&#039;re selling books or some other product, graphics that can capture the customer&#039;s attention will give you a leg up in differentiating yourself from your competition.  </p>  <p>  \t<strong style=\"\">This Course Includes Everything You Need to Know to Become Proficient with the GIMP</strong>  </p>  <p>  \t  This course includes 29 lectures, over two hours of material, divided into the following major categories of information:  </p>  <ul style=\"\">  \t<li>Installing, staring, and stopping the GIMP</li>  \t<li>GIMP window layout</li>  \t<li>Creating a simple book cover</li>  \t<li>Working with layers and selections</li>  \t<li>Loading fonts and using text effects</li>  \t<li>Buying and manipulating inexpensive images</li>  \t<li>Creating colored boxes</li>  \t<li>Using layer masks</li>  \t<li>Stroking a path</li>  \t<li>Putting it all together</li>  </ul>  <p>  \t<strong style=\"\">Learn to Create Stunning Book Covers and More</strong>  </p>  <p>  \t  Why focus on book covers? The course benefits from having a specific focus and I&#039;m the most familiar with using the GIMP to create book covers.  Besides, you only need to know the fundamentals of using the GIMP to produce book covers. Don&#039;t worry, you can still create amazing images for the Web and beyond using the basics of the GIMP.  </p>  <hr style=\"\">  <p>  \t<em style=\"\"><strong style=\"\">A Great Cover Course</strong> <br style=\"\">  \t   Bite sized lessons that are clear and concise on how to use The GIMP to create ebook covers for the KINDLE. Very easy to follow. <br style=\"\">  \t   -Bronwyn Wilson</em>  </p>  <hr style=\"\">  <p>  \t  This course uses a combination of presentation slides and screen capture to show you how to use the GIMP to produce book covers specifically.  </p>  <p>  \t  Expect to spend several days to weeks digesting all the information provided in this course.  </p>  <p>  \t<strong style=\"\">Start Today!</strong>  </p>  <p>  \t  Silly as it may seem, your book cover is the first characteristic of your book that is likely to distinguish you from the crowd. Why not spend some time learning how to produce a quality, professional looking book cover for your self-published work using free tools and inexpensive professional quality images?  </p>", 
    "end_date": null, 
    "title": "GIMP for Beginners: Book Covers and Free Graphic Design", 
    "price": "20.00", 
    "instructors": "Author/Publisher Brian Jackson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/254128_b9d4_7.jpg", 
    "course_url": "https://www.udemy.com/using-the-gimp-to-create-professional-quality-book-covers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-02T00:53:14Z"
}