{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>The main objective of the course \"GIMP Tutorial: Become а Designer With The Essential Guide\" is to assist in the study of free GIMP graphics editor, as well as to inform users of the existence of simple, free software alternatives.</p>\n\n<p>This course will turn out to be very useful for designers, bloggers, journalists or simply for those who are dealing with image editing.</p>\n\n\n\n\n\n<p><strong>You will find out exactly how to:</strong></p>\n\n\n\n\n\n<ul><li>Work with the basic tools and options;</li><li>Create an outstanding effects on photo very fast and of a good quality;</li><li>Create various and interesting logos;</li><li>With the help of different patterns you can make marvelous graphic.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What will I learn after this course? Will it be helpful for me?</strong></p>\n\n\n\n\n\n<ul><li>I’m offering about 20 lectures of sequential lessons and design tutorials;</li><li>You will find out how to start work with GIMP;</li><li>It will be incredibly easy for you to edit photos, create logos or to improve any image in GIMP;</li><li>Easy to use deign will help you on your path of creating perfect graphics and images. </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Who can apply for this course?</strong></p>\n\n\n\n\n\n<ul><li> Every person who is interested in creating graphics and pictures of a good quality, I may even say professional; </li><li>All who want to learn about filters and easy ways to edit photos and create other design elements;</li><li>Self-published authors; </li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Summing up I can say that this course will be your tool in creating perfect book covers, editing images and graphics. For those who are just beginning to work with their web-site or want to come up with memorable photos GIMP will be a fabulous solution. And what is also important the price of this program is FREE and you do not have to overpay.</p>", 
    "end_date": null, 
    "title": "GIMP Tutorial: Become а Designer With The Essential Guide", 
    "price": "20.00", 
    "instructors": "Denis Fursenko", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/783974_7e10_2.jpg", 
    "course_url": "https://www.udemy.com/gimp-tutorial-become-designer-with-the-essential-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-06T12:37:56Z"
}