{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>If your using After Effects you need to take this course on Green Screening</strong><br></p><p>Green screening is commonly used now days and pretty easy to do once you know the basic, in this course we will look at a simple set up to get great results keying in After Effects.</p><p>This course is for everyone from special effects to presentations these skills will help you out and make your presentation and movies even better!!</p><p>As well as showing you my techiniques for Green Screening I will also show you a few special effects that can easily be created in After Effects!</p><p><strong>Creating Lightening:</strong> In this tutorial I will show you my technique for Green Screening and also show you how to track movement and attac h a lightening effect to the tracks!</p><p><strong>Demons Eyes:</strong> In this scary tutorial you will speed through the learnt green screening techniques and move straingt on to a more advanced form of tracking, the end goal will be to create scary Demon eyes!!</p><p><strong>Whos it for?</strong></p><ul><li>Beginners</li></ul><p><strong>What will I learn?</strong></p><ul><li>Green screening and lighting setups</li><li>Green Screen techniques in After Effects</li><li>Motion Tracking using the native tracker and more advanced techniques with Mocha</li><li>Special Effects</li><li>The use of comps</li><li>Importing anf exporting</li><li>Loads more...</li></ul><p>I hope you enjoy this course very much it was great fun to do!!<br><em><strong>Also sorry for the subject matter ME!!!! feel free to use you own :)</strong></em></p>", 
    "end_date": null, 
    "title": "Green Screen Keying Techniques with Adobe After Effects CC", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/779260_d5dd.jpg", 
    "course_url": "https://www.udemy.com/green-screen-keying-techniques-with-adobe-after-effects-cc/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-01T19:38:43Z"
}