{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Luego de más de 50 ediciones del curso HDE presencial en distintas ciudades (Buenos Aires, Ushuaia, Río Grande, Santiago de Chile), ya está disponible la versión ONLINE.</p><p>Se trata de 32 videos super explicativos de las herramientas básicas de Photoshop e Illustrator y archivos \"tarea\" que puedes descargar.</p><strong>En que puede ayudarte el curso</strong><p>Está dirigido a emprendedores y bloggers pero esto no es excluyente. Lo puede hacer cualquier persona que esté interesada en aprender las herramientas básicas de Illustrator y Photoshop.</p><p>El curso empieza desde cero, no es necesario tener conocimientos previos de diseño ni de estos softwares, solo un buen manejo de la computadora. Nada se da por sabido en este curso y el avance es super progresivo.</p><p>Vas a aprender a hacer recortes simples y complejos de imágenes, editar (en toda la foto o solo en un sector) sus colores, brillo, saturación, intensidad, desenfocarlas, pasarlas a blanco y negro, etc.</p><p>Agregar textos, formas y logos a esas imágenes. Generar marcas de agua. Jugar con las transparencias.</p><p>Realizar diseños en Illustrator desde cero, manejar formas vectoriales existentes, crear algunas simples. Generar transparencias, degradados, motivos/patterns, pinceles y ditintos trazos.</p><p>Entender las calidades y modelos de color que se necesitan para web y para impresión.</p><p>Guardar los archivos en distintos formatos, calidades y tamaños para usar en diferentes medios.</p><p>¿Usar JPEG o PNG? ¿Pasar el diseño a curvas? ¿hacer un PDF de varías páginas? ¿A que se refieren con documento \"en alta\"?</p><p>Todas esas preguntas y muchas más tendrán respuesta en Herramientas de Diseño para Emprendedores ONLINE.</p>", 
    "end_date": null, 
    "title": "Herramientas de Diseño para Emprendedores", 
    "price": "50.00", 
    "instructors": "Cecilia Escamilla Gigirey", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385008_9513_4.jpg", 
    "course_url": "https://www.udemy.com/herramientas-de-diseno-para-emprendedores/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-04T18:31:48Z"
}