{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p class=\"PIN_1373392449256_hazClick\" style=\"\"></p><p style=\"\">The Stylish Ladies Illustration Tutorial.&nbsp;</p><p style=\"\">Session 1: The Basics</p><p class=\"PIN_1373392449256_hazClick\" style=\"\">In this first session you will learn the basics of vector illustration with Flash, which is a very simple approach to drawing, even for non-artists. To illustrate, I use a mouse (nothing fancy like a Wacom or Cintiq), and rarely view the actual vector points making up the illustration. Instead I teach simple techniques to mold shapes. This one hour session covers step-by-step how to illustrate a basic head, and this portion of the course is free.</p><p style=\"\">Session 2: The Body</p><p style=\"\">This two hour tutorial focuses on illustrating a clothed body. Initially we look at some simple clothing choices to avoid working with the finer points of illustrating the female form (i.e. a big dress). After that I will design a more realistic body in silouhette, to use as the basis for a fully shaded illustration. That piece is drawn over the course of an hour, in real time, using symbols for parts that could be animated later.</p><p style=\"\">Session 3: Hair Styles and Head Turns</p><p style=\"\">In this 90 minute session, we look at tips to illustrate hair and turn the head. The part on head turns should be particularly useful to any Flash or vector artist, since I demonstrate some interesting ways to start from a front view and methodically convert all the way over to a side view.</p><p style=\"\">Session 4: Expressions, hands, and feet.</p><p style=\"\">In this 97 minute session, we gather together various &quot;components&quot; of the body to use in our final session. To make drawing a full pose easier, we can create libraries of body parts and facial expressions to copy and paste into later projects. You are welcome to use my source files in your future projects as well.</p><p style=\"\">Session 5: Final pieces.</p><p style=\"\">In this three hour session, we draw three final poses, focusing primarily on clothing techniques and shading. Each pose is a separate one hour video.</p><p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "How to Draw Stylish Ladies with Adobe Flash", 
    "price": "20.00", 
    "instructors": "Justin Dike", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64600_9f3c_4.jpg", 
    "course_url": "https://www.udemy.com/drawladies/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-09T17:47:56Z"
}