{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this course you will learn how to create your own beautiful eBook covers using (Gimp) a free software program, so this course is ideal for writers, designers and anyone who wants to learn how to create stunning eBook covers.</p><p>The course length is 58 minutes and is structured in a way that is easy to follow and assumes that you are completely new to Gimp. You will receive videos, PDF files and (Bonus) 2 templates with 2 videos that will show you how to create two 3D eBook covers using Gimp.</p><p>Once you download Gimp, you will be able to follow along at your own pace as we create 4 eBook covers together. You will discover that you don't need expensive software or designers to create stunning eBook covers, you can do it yourself. All you need is the right tools and some inspiration.</p><p>Also included are two bonus videos for students who already have PowerPoint installed on their PC's. I will also briefly show you an inexpensive software program that I've been using for years to create logos, web graphics and eBook covers. In addition to the above I have also included a link to a website I use to find images that are free to use in commercial projects.</p><p>This course is definitely for you if you want to quickly learn how to create your own eBook covers using free software and save money on designers and software.</p><p>The investment in this course will save you time, money and will give you the freedom to design your own stunning eBook covers. This course is easy to follow along and shows you step by step how you can design eBook covers that look beautiful and professional. All you need is the willingness to learn, some practice and you will soon be an expert at creating stunning eBook covers yourself. </p>", 
    "end_date": null, 
    "title": "How to create your own eBook covers", 
    "price": "20.00", 
    "instructors": "Aloysius De Klerk", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/585690_67d9.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-your-own-ebook-covers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-17T18:57:05Z"
}