{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">You have seen Google adsense use them, infolinks, Yahoo and more advertising platforms and now here is how you can create yours.</strong></p><p style=\"\"><strong style=\"\"></strong>In this course you are going to learn how to create the so famous and really important file format<strong style=\"\"> THE G I F</strong>.</p><p style=\"\">why gifs? if google, yahoo are using them to advertise then its gold, Gif animations are fast, grab attention easly and quickly and very lit, in fact litter than a lot of image formats.</p><p style=\"\"><strong style=\"\">How are you going to create them?</strong></p><p style=\"\">very simple, i cover that in a few videos and the rest, well their a lot of ways to create gif ads the first way you will learn is the standard way, most used and likely what you will be using most of the time, but their is that time when u want a gif from a video, may be just a segment from a video of your cute cut doing funny things on video and you want to share it on your twitter, Google plus or imgur dot com and uploading a video may not get it viral as it would be, you just want people to look have a laugh and share with out having to wait for the video to buffer, or wait till flash player installs or updates, well i will show you how to create .gifs from video files, so take this course and start making  your blog or website go viral with your crazy awesome and funny gifs.</p><p style=\"\">________________________________________________________________________</p><p style=\"\"><strong style=\"\">internet marketing</strong></p><p style=\"\">is your need online advertising? its covered, you will learn about good banner design for advertising and most popular dimensions for banner ads and where to place them.</p><p style=\"\">remember gifs  are image formats and any device that is capable of displaying images should be able to display gif animations, and so should different kinds of browsers so you are covered with compatibility issues.</p><p style=\"\"><strong style=\"\">Making money online</strong></p><p style=\"\">almost every website, blog you will see some kind of advertisement and 70% of search ads is likely to be gif banner ads, so that means if people are advertising that much with gifs, their is need for people who make such ads and if you look around very well their are a lot of people willing to pay good money for the skill, so take this course and may be you could be a few dollars richer from attaining a new skill</p><p style=\"\"><br style=\"\"><strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "how to create animated banner ads for internet advertising", 
    "price": "20.00", 
    "instructors": "businge ismail", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/459474_bad6_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-create-animated-banner-ads-for-internet-advertising/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-26T06:31:27Z"
}