{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Over 500 students enrolled!</strong></p><p><strong style=\"\">Have you wanted to quickly learn how to use Photoshop?</strong>  </p>  <p>  \t          This course will guide you step-by step to exploring how to use Photoshop to create the images you want...fast! In a little over 2 hours, you can be on your way to using the power of Photoshop and creating your own powerful images. This course is geared towards students new to Photoshop who want to build a firm foundation upon which to use this powerful program.</p>  <p>  \t  You will start at the beginning learning about the environment of Photoshop. Next, you will learn how to access the tools to maximize creating a project. Then, I will delve into working with Photoshop in specific applications such as: how to color correct a photos and how to &quot;heal&quot; a photo and make it look like new. You will also learn about the specific photographer tools to enhance any photo or image.  </p>  <p>  \t    As well, you will learn about the power of using layers to create and organize your images. And you will learn how to create different documents such as a sign and business card and then save it the correct way for a commercial  or online printer.  </p>  <p>  \t        You will learn all of the basic tools in Photoshop including:  </p>  <ul style=\"\">  \t<li style=\"\">How to create a document</li>  \t<li style=\"\">How to use layers with ease</li>  \t<li style=\"\">How to create type and add effects.</li>  \t<li style=\"\">How to quickly and easily straighten a scanned photo</li>  \t<li style=\"\">How to easily to correct and enhance photos</li>  \t<li style=\"\">How to use the History tool so you don&#039;t lose your work</li>  \t<li style=\"\">How to use use the tools photographers use</li>  \t<li style=\"\">How to adjust a layer image quickly and easily</li>  \t<li style=\"\">How to set up a business card</li>  \t<li style=\"\">How to correctly save a file for a commercial printer to maximum results</li>  \t<li style=\"\">and much more!</li>  </ul>  <p>  \t<strong style=\"\">If you want to be on the fast track to learning Photoshop, then this course is for you!</strong>  </p>  <p>  \t<strong style=\"\">Click on the &quot;Take this Course&quot; button and learn the basics of Photoshop now!</strong>  </p>", 
    "end_date": null, 
    "title": "How to Master Photoshop Like a Pro – For Beginners", 
    "price": "20.00", 
    "instructors": "Dave Lappin", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/383436_4a1c.jpg", 
    "course_url": "https://www.udemy.com/photoshop-basics-how-to-use-photoshop-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-02T20:45:58Z"
}