{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>You’re here because you want to be a published author. You have an idea and don’t know where to take it.</p>\n\n\n\n<p>I’m here to teach you all you need to know in order to make that dream a reality! I love helping people and that’s why I developed this course. And for a limited time, I’m selling this course the lowest legally possible price at UDEMY!\n\n  </p>\n\n\n\n\n\n<p>Welcome to the “<strong>How I Created THIS Book in Less than 12 Hours!</strong>”\n\n  </p>\n\n\n\n<p>Join the millions of people who have self-published their own books. Why not you?\n\n  </p>\n\n\n\n<p>My name is Nick Nebelsky and I have published four books using this simple method. In this course, you’ll learn how to maximize your time, money, and enjoyment on your road to authorship.  \n\n  </p>\n\n\n\n\n\n<p><strong>It’s time to STOP PROCRASTINATING</strong> and do something about it! Nothing happens if you only dream about it. <u>You have to take ACTION!</u> This course will help you \n\n achieve your dream of holding your book in print form and selling it on Amazon, \n\n Barnes &amp; Noble, and more. \n\n  </p>\n\n\n\n\n\n<p>This course is designed for you. It’s a simple to use, step-by-step, and fool-proof. If you’re not completely satisfied, I’ll refund your money; no questions asked unless you have advice on how to make it better. Then, I’m all ears! However, if you’re happy and you know it, CLAP YOUR HANDS! \n\n  </p>\n\n\n\n\n\n<p>You’ll follow along step-by-step, as we’ll publish a book together! There’s a FAQ in the back (hey that rhymes) where I’ll answer the most often-asked questions. Or you can email me anytime! If problems arise (they almost always do), you’ll be ready to tackle them with CONFIDENCE!\n\n  </p>\n\n\n\n\n\n<p>Don’t get left behind! Believe me, I’ve been there. I’m here to help you finish what you started!\n\n  </p>\n\n\n\n\n\n<p>Join the millions of students who are self-publishing today. Don’t let your fear stop you. I’m here to help you!</p>\n\n<p>This awesome course gives the average student not just a chance, but a solid course of action to publish their own book. But there's so much more than that. The instructor provides over 25 years experience as a backdrop to getting things done faster and more efficiently. By creating a book as he teaches, the author shows the student the trials and challenges that they could face AND HOW TO AVOID THEM. </p>\n\n\n\n<p>You'll learn how to use fantastic software and how to print a book that will impress your family and one that you can sell to readers all across the world. </p>\n\n\n\n\n\n<p>As a bonus, you'll also get your book into Kindle to reap the rewards of passive income. Amazon has created some wonderful tools to help you achieve success as a Kindle author and I'll show you step by step how to achieve success!</p>\n\n\n\n\n\n<p>As much as I'd like to share some ideas about writing your book, I'll have to leave that for another course.</p>\n\n\n\n\n\n<ul><li>Assemble your assets (i.e., text, graphics, illustrations)</li><li>Next, you’ll Build your book.</li><li>Learn about copyright, ISBNs, barcodes, and more</li><li>Distribute Your Book!</li><li>Pre-Market Your Book</li><li>Save You Money!</li><li>Ultimately Help YOU PUBLISH YOUR OWN BOOK!</li></ul>", 
    "end_date": null, 
    "title": "How I Created THIS Book in Less than 12 Hours!", 
    "price": "20.00", 
    "instructors": "Mr. Nicholas Nebelsky", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/565346_845f_6.jpg", 
    "course_url": "https://www.udemy.com/how-to-self-publish-your-book-for-nincompoops/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-26T18:18:19Z"
}