{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Illustrator CC for beginners and no previous Illustrator experience required.  In this Illustrator training course, you will learn everything you need to know about using Illustrator and all the tools available.  Plus, I'll show you the same time saving techniques I use for a fast and productive workflow.  </p><p><strong>RAVE REVIEW!  This testimonial (from my Lightroom course) sums up all the courses I provide...</strong></p><p>\"<em>The content of the course is perfectly structured and expertly delivered. The flow of the content builds knowledge and skills in a logical fashion. Chris has a really good presentation style. Of key importance, when students ask questions, Chris answers them in a thorough and comprehensive manner. Highly recommended. Regards.</em>\" ~ Mick</p><p>The course starts of with the basic foundations and proceeds to more advanced tools.  A course worksheet is included.  Use to follow along with and practice what you learn.  Stuck?  No problem, I'm available for continued discussions relating to the course material.  Throughout the course, I encourage students to practice what they learn and post their work in the discussion area for any type of feedback (or additional questions).<br></p><p>What will you learn?  Here is a list of just some of the Chapters in this course on mastering Illustrator CC...</p><ol><li>The Pen tool</li><li>Be More Productive</li><li>Color Management</li><li>Image + Masks</li><li>Anchors + Paths</li><li>Creating Vector Shapes</li><li>Effects + Appearance Panel</li><li>Typography</li><li>Output</li><li>Image Trace</li><li>an much more...</li></ol><p><br></p><p>Once you've completed this comprehensive course of Adobe Illustrator CC, you'll be comfortable with the tools, how to apply them and have the skill set for a fast and productive workflow.<br></p><p>Plus, this course will be updated when Adobe Illustrator CC releases new features.  Stay up to date on all the latest revisions at no additional cost!</p><p><br></p><p>At some point, the Udemy system will ask you for a review about this course. Please understand that it is Udemy asking and not me (Chris Parker, your instructor). I do not agree with asking for a review so early (it's out of my control) in the course and ask that if you're not ready to give a review, please do so only when you're ready. I appreciate all feedback and use it to improve my courses.</p><p>I Hope your enjoying the course thus far. Please contact me anytime for additional questions/support. I'm here to help you achieve your learning goals and looking forward to your success.</p><p>Yes, I really do care AND answer ALL questions. :)</p>", 
    "end_date": null, 
    "title": "Illustrator CC - Master Adobe Illustrator CC the Essentials", 
    "price": "50.00", 
    "instructors": "Chris Parker", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/741100_fb90_3.jpg", 
    "course_url": "https://www.udemy.com/illustrator-cc-tutorial-adobe-illustrator-cc-the-essentials/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-25T15:24:47Z"
}