{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">BECOME A MASTER IN PHOTOSHOP COMPOSITING - NO JOKE</strong>  </p>  <ul style=\"\">  \t<li>Brand New Retouching Course <em style=\"\">&quot;Just launched 10th October 2014&quot;</em></li>  \t<li><span>Over 2+ Hours of retouching lessons</span><em style=\"\"> &quot;Start learning the Secrets&quot;</em></li>  \t<li><em style=\"\">All Lessons include step by step in video instructions!</em></li>  \t<li>Includes all raw &amp; psd files which you can profit from - <em style=\"\">Instantly!</em></li>  \t<li>Would be good to have an average knowledge about Ps</li>  \t<li>Full &amp; free lifetime access to the complete course</li>  \t<li>All future &amp; additional lectures will always be <em style=\"\"><strong style=\"\">&quot;for free&quot;</strong></em></li>  </ul>  <hr style=\"\">  <p>  \t<strong style=\"\">ARE YOU NEW OR STRUGGLING WITH COMPOSITING TECHNIQUES?</strong>  </p>  <ul style=\"\">  \t<li>AND MASSIVELY WANT TO IMPROVE IT?</li>  \t<li>AND DO IT EASILY AND INSTANTLY?</li>  \t<li>AND BE ABLE TO APPLY IT TO YOUR OWN IMAGES?</li>  </ul>  <p>  \t<strong style=\"\">--------------------------- ” <em style=\"\">Then this course is for you </em>” -------------------------------</strong>  </p>  <p>  \t        What This Course Entails:  </p>  <p>  \t        I will teach you how to get into advanced compositing, so don’t worry if you don’t have prior experience with compositing or other skills. Follow my lead and I’ll teach you to be good at it! <em style=\"\">“I Promise You”</em>  </p>  <p>  \t        All my retouching instructions form part of a comprehensive guide that can help you to accomplish your goals by applying these techniques. During all the lessons you get to eavesdrop as I work, giving you all insight as to how I work and what I do.  </p>  <hr style=\"\">  <p>  \t<em style=\"\"><strong style=\"\">The idea is to teach you how to become a master in photoshop compositing. Be it for your own work, or for a client. My aim is to teach you all the tricks, techniques &amp; secrets to overcome this difficult task! </strong></em>  </p>  <hr style=\"\">  <p>  \t        Whether you have previous experience with photoshop or not, it doesn&#039;t matter. Apply your knowledge for an hour a day and you could be making huge improvements or even extra cash, <em style=\"\">as a retoucher just like me</em>.  </p>  <p>  \t<em style=\"\"><strong style=\"\">&quot;And I&#039;m not kidding when I say that you need no previous compositing experience! &quot;You just need to Practice your eye and the techniques&quot;</strong></em>  </p>  <p>  \t        All future extra lectures and upgrades are always included for free. Unconditional Udemy 30 day money-back guarantee - that&#039;s my <em style=\"\">personal promise of your success!</em>  </p>  <p>  \t        You&#039;ll learn  </p>  <ol style=\"\">  \t<li>How to master your Photoshop compositing skills &quot;I promise you&quot;</li>  \t<li>How to build, shoot and light such a complex image.</li>  \t<li>How to build a complete background from 4 exposures</li>  \t<li>How deep edge a subject and build him / her back into another image &quot; This is a ver technical step&quot;</li>  \t<li>How to build on base plate &quot;Final image&quot; out of 3 main concepts</li>  \t<li>How to do suttle skin retouching and warping</li>  \t<li>How to do advanced light control &amp; build new light</li>  \t<li>How to do advanced color grading and image moods</li>  \t<li>How to apply graphic elements into an image</li>  \t<li>How to apply dodge &amp; burn techniques on humans and the overall image</li>  \t<li>How to do very complex structuring and layer adjustments</li>  \t<li>30 new retouching techniques &quot;Some are very complex, but can be learned after time&quot;</li>  </ol>  <p>  \t        ... and much, much more!  </p>  <hr style=\"\">  <p>  \t<strong style=\"\">Intrigued yet? Then keep reading!</strong>  </p>  <p>  \t        As with all my courses: the initial low price will increase shortly. This one is currently $45 and it will next upgrade to $65 so join in now! &quot;<em style=\"\">You will have unlimited lifetime access at no extra cost &quot;</em>Not just that; all future additional lectures, bonuses, etc in this course are always free.  </p>  <p>  \t        There&#039;s an unconditional, no-questions-asked full 30-day money-back guarantee! I&#039;m known for always offering support on Udemy, so feel free to shout out if you&#039;re stuck or need assistance. <em style=\"\"><strong style=\"\">&quot;I&#039;m here to help&quot;</strong></em>  </p>  <p>  \t<strong style=\"\">One final note:</strong>  </p>  <p>  \t        My goal is to teach you how to overcome this complex task, so don&#039;t stress about not having done photoshop compositing work before. <em style=\"\">&quot;I do my best to make it simple, informative &amp; fun&quot;</em>  </p>  <hr style=\"\">  <p>  \t<em style=\"\"><strong style=\"\">I&#039;ve crammed all my 4 years, of photoshop knowledge into this course!</strong></em>  </p>  <hr style=\"\">  <p>  \t        After going through this course you&#039;ll be able to apply your new compositing skills to <em style=\"\">retouch any complex images and make some extra cash along the way</em>.  </p>  <p>  \t        All you have to do is click on the <strong style=\"\">&quot;take this course&quot;</strong> button on the top right corner. You have nothing to lose. In fact, you&#039;ve got a lot to gain.  </p>  <p>  \t        Thank you,  </p>  <p>  \t        Manni  </p>", 
    "end_date": null, 
    "title": "Instagramer II - Become A Master In Photoshop Compositing", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/308248_251c.jpg", 
    "course_url": "https://www.udemy.com/instagramerii/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-26T09:57:59Z"
}