{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      This course is designed to teach you all about Photoshop Selections and Selections only! Because enough with the &quot;overviews&quot;, &quot;crash courses&quot; and &quot;basics&quot;! It&#039;s easy to go from beginner to expert by focusing on one area at a time, going into depth and giving it your full attention - which is precisely what you&#039;ll be doing with the help of this tutorial and the upcoming ones!<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Learn the ins and outs of one of Photoshop&#039;s most powerful features: Selections!</strong><br style=\"\">  \t<br style=\"\">  \t      • Learn all of the main selection tools and several advanced methods of selecting<br style=\"\">  \t      • Become acquainted with the multiple ways in which you can easily manipulate selected content<br style=\"\">  \t      • Learn how to adapt to specific situations and instantly reach for the most appropriate tools <br style=\"\">  \t      • Gain a better understanding of Photoshop and some of its core principles<br style=\"\">  \t<br style=\"\">  \t      Photoshop is an essential part of any artists&#039; world, whether you&#039;re aiming to be a photographer, a designer, a graphic artist or anything even remotely art-related. It&#039;s a powerful, fascinating piece of software, but it&#039;s about as vast as it is amazing which is why learning its secrets can feel rather overwhelming. You can try to go over all of its features and functionalities in one quick breath but understanding its full power overnight is a pretty impossible task and, frankly speaking, it doesn&#039;t really do it justice - there&#039;s just so much to know and talk about when it comes to Photoshop!<br style=\"\">  \t<br style=\"\">  \t      This here tutorial is aimed at beginners or users of lower intermediate level and it focuses on one specific area of Photoshop - Selections! By dedicating a full tutorial to this topic, you can be sure that, by the end of it, you&#039;ll have far more than a basic understanding of what selections mean and you&#039;ll, in fact, be able to use these features to an advanced level.<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Contents and Overview</strong><br style=\"\">  \t<br style=\"\">  \t      This course contains 16 lectures providing a comprehensive approach to Photoshop selections. You&#039;ll learn about the multiple selection tools and methods at your disposal, you&#039;ll understand how to distinguish between selections and their contents and how to bend both of them to your will, you&#039;ll become acquainted with core principles and techniques that apply all throughout Photoshop.<br style=\"\">  \t<br style=\"\">  \t      By the end of this tutorial you&#039;ll be capable of applying selections to any situation: from swapping your roommate&#039;s head with a poodel&#039;s in their family photo, to positioning your company&#039;s logo on an elegant new business card. The sky&#039;s the limit!<br style=\"\">  \t<br style=\"\">  \t<strong style=\"\">Note: The simple PSD file used in this tutorial is available for download in the second lecture (<em style=\"\">What are selections?</em>) if you wish to follow along with the lectures.</strong>  </p>", 
    "end_date": null, 
    "title": "Introduction to Photoshop - Selections", 
    "price": "20.00", 
    "instructors": "Mary Elliott", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/380772_a1af_3.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-photoshop-selections/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-30T11:23:42Z"
}