{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  This <strong style=\"\">introduction to Adobe InDesign CC training course </strong>will start with the <strong style=\"\">absolute basics</strong> of the software, I slowly build your knowledge up and introduce you to all the tools <strong style=\"\">Adobe InDesign CC</strong> has to offer. After watching and following along with all the videos you will be proficient and confident to begin to produce your own <strong style=\"\">multiple page documents</strong> and export them for multiple on-line and print use. I also show you how to add <strong style=\"\">interactive elements</strong> to your finished <strong style=\"\">PDF files.</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Adobe InDesign</strong> is a versatile desktop publishing application that gives you pixel-perfect control over design and typography.<strong style=\"\">Create elegant and engaging pages</strong> for <strong style=\"\">print, tablets</strong>, and other screens. You can easily adapt layouts to look great on a variety of page sizes, orientations, or devices.  </p>  <p style=\"\">  \t  The course is structured in a very easy to follow manner with short video lectures and excercises to complete. I have my own software training studio and have been teaching <strong style=\"\">Adobe products for over 10 years now</strong> so let me guide you from being a novice to a an absolute wizz!  </p>", 
    "end_date": null, 
    "title": "Learn InDesign CC from scratch", 
    "price": "20.00", 
    "instructors": "Mark Williams", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/154094_2d14_9.jpg", 
    "course_url": "https://www.udemy.com/learn-indesign-cc-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-28T14:03:39Z"
}