{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">In this training course for Adobe After Effects CS6, an expert trainer &nbsp;introduces you to this powerful, non-linear visual effects software from Adobe. This tutorial is designed for the beginner, with no previous experience in After Effects required.<br style=\"\"><br style=\"\">Your lessons begin with an overview of what After Effects is, and what it can do. You will explore the workspace, and how that is used in your workflow. You then jump head first into creating your first project, and importing assets. Once you are are comfortable with the interface and basics of managing your project, this computer based training course teaches you how to use features such as layers, adding and animating text, working with shapes, using paint tools and masks as well as animating objects. You learn how to apply effects and transitions, how to use expressions, about tracking motion, how to work in 3D space, and finally, saving and exporting your project.<br style=\"\"><br style=\"\">With over 15 hours of training in this video tutorial, but the time you have completed it, you will have a deep understanding of the fundamentals of After Effects CS6 and how to apply what you have learned to your own projects. Extensive working files and assets are included to allow you to work alongside the author using the same files he is throughout the training, allowing you to reproduce the same results on your own.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "Learning Adobe After Effects CS6 - Tutorial Video", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/30195_3916_9.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-after-effects-cs6-the-essential-guide/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-20T22:54:22Z"
}