{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>What is Photoshop Action?</strong><br></p>  <p>  \t                                              An <em>action</em> is a series of tasks that you play back on a single file or a batch of files—menu commands, panel options, tool actions, and so on. For example, you can create an action that changes the size of an image, applies an effect to the image, and then saves the file in the desired format.  </p>  <p>Actions can include steps that let you perform tasks that cannot be recorded (for example, using a painting tool). Actions can also include modal controls that let you enter values in a dialog box while playing an action.  </p>  <p>  \t                                              In this course i'll show you how to create photoshop actions<strong> By Creating 5 Projects</strong> !  </p>  <p>  \t<strong>Project 1 - Create a HD Qulity Image Retouch action</strong>  </p>  <p>  \t                                  Into our 1st project we'll create a Image retouch action which make any image look like a HD Image.  </p>  <p>  \t<strong>Project 2 - Create a 3D Image Action</strong>  </p>  <p>  \t                                  Into our 2nd project we'll create a 3d image action which make any image look like a 3d image.  </p>  <p>  \t<strong>Project 3 - Create a Hand Sketch Image Action</strong>  </p>  <p>  \t                                  Into our 3d project we'll create a Hand Sketch Image Action which make any image look like a Pencil Sketch potrate.  </p>  <p>  \t<strong>Project 4 - Create a Oilpaint Image Effect Action</strong>  </p>  <p>  \t                                  Into our 4th project we'll create a Oilpaint image Effect Action which make any image look like a oil painted.  </p>  <p>  \t<strong>Project 5 - Create a Glowing Text Action</strong>  </p>  <p>  \t                                  Into our 5th project we'll create a Glowing Text Action which give us a nice glowing text effect.  </p>  <p>  \t  ...and after these projects end i'll show you <strong>how to sell these actions for profit</strong>.  </p>  <p>  \t<em>There is nothing to lose in these course but you <strong>Learn Some Solid Skill.</strong></em>  </p>", 
    "end_date": null, 
    "title": "Learn To Create Photoshop Actions and Sell Them For Profit", 
    "price": "20.00", 
    "instructors": "Somenath Sen", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/393932_518f_14.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-create-photoshop-actions-and-sell-it-for-profit/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-14T13:11:06Z"
}