{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>ADOBE LIGHTROOM – START EDITING PHOTOS LIKE A PRO</strong>  </p>  <ul>  \t<li>MORE THAN <strong>390</strong> STUDENTS HAVE ENROLLED ALREADY</li>  \t<li>Over 80 Lightroom Lessons <em>\" Edit photo's like a pro\"</em></li>  \t<li>6+ 5 Star Reviews from a really happy &amp; satisfied student</li>  \t<li>No Prior Lightroom knowledge needed<em> \"Guaranteed\"</em></li>  \t<li>Full &amp; free lifetime access to the complete course</li>  \t<li>All future &amp; additional lectures will always be free of charge</li>  \t<li>No illustrator or other software is needed \"<em>You only need </em><em>Lightroom\".</em></li>  \t<li>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</li>  </ul>    <p>  \t<strong>ARE YOU STRUGGLING WITH ADOBE LIGHTROOM?</strong>  </p>  <ul>  \t<li>AND WANT TO LEARN IT EASILY AND INSTANTLY?</li>  \t<li>AND WANT TO KNOW ALL THE IN AND OUT'S?</li>  \t<li>AND WITH NO PRIOR LIGHTROOM KNOWLEDGE!</li>  </ul>  <p>  \t<strong>--------------------------- \" <em>Then this course is for you </em>\" -------------------------------</strong>  </p>    <p>  \t<strong>What This Course Entails:</strong>  </p>  <p>  \t    I will teach you how to get into Adobe Lightroom from A to Z, so don't worry if you don't have <strong>prior experience with </strong><strong>Lightroom</strong>. Follow my lead and I'll teach you to be good at it! <em>“Guaranteed\"</em>  </p>  <p>  \t<strong>All my Lightroom instructions</strong> form part of a comprehensive guide that can help you to accomplish your goals by applying these skills. During the lesson you get to eavesdrop as I work, giving you some insight as to how I work and what I do.  </p>    <p>  \t    The idea is to teach you how to use and work with Adobe Lightroom <strong><em>\"Anyone can do it, you just need to know the simple steps! \"</em></strong>  </p>    <p>  \t    Whether you have <strong>previous experience with Lightroom or not</strong>, it doesn't matter. Apply your knowledge for half an hour a day and you could be making huge improvements or even extra cash, just like me.  </p>  <p>  \t<em>\"And I'm not kidding when I say that you need nothing but Lightroom!\"</em>  </p>  <p>  \t<strong><em>All future extra lectures</em></strong> and upgrades are always included for <strong>free</strong>. Unconditional Udemy 30 day money-back guarantee - that's my <em>personal promise of your success!</em>  </p>  <p>  \t    You'll learn:  </p>  <ol>  \t<li>How to work with Lightroom \" Getting Started\"</li>  \t<li>How to work with the library module</li>  \t<li>You will learn how to work with Develop module &amp; Tools</li>  \t<li>You will learn creative editing techniques in the library module</li>  \t<li>You will learn how to work with Map module</li>  \t<li>You will learn how to work with Book module</li>  \t<li>You will learn how to work with Slideshow module</li>  \t<li>You will learn how to work with Print module</li>  \t<li>You will learn how to work with Web module</li>  \t<li>You will learn how to use Lightroom - Shortcuts &amp; Tips &amp; Tricks</li>  \t<li>You will learn how to export your images &amp; save all</li>  \t<li>You will learn how to work with the complete lightroom interface - Become a advanced lightroom user</li>  \t<li>You will learn all necessary fundamentals of lightroom</li>  \t<li>Teaching you different develop \" EDITING \" methods</li>  \t<li>You will learn how to do different develop methods \"Techniques\"</li>  </ol>  <p>  \t    ... and much, much more!  </p>  <p>  \t<strong></strong>  </p>    <p>  \t<strong>Intrigued yet? Then keep reading!</strong>  </p>  <p>  \t    As with all my courses: the initial low price will increase after time. This one is currently <strong>$80</strong> and it will soon upgrade <strong>to $99</strong> so join in now! \"<em>You will have unlimited lifetime access at no extra cost\" </em>Not just that; <strong>all</strong> <strong>future additional lectures</strong>, <strong>bonuses</strong>, etc in this course are always free.  </p>  <p>  \t    There's an unconditional, no-questions-asked full 30-day money-back guarantee! I'm known for always offering support in <strong>Udemy,</strong> so feel free to shout out if you're stuck or need assistance. <em>\"I'm here to help\"</em>  </p>  <p>  \t<strong>One final note:</strong>  </p>  <p>  \t    My goal is to teach you Adobe Lightroom from A to Z, so don't stress about not having worked in Ligghtroom before. <em>\"I do my best to make it simple, fun &amp; informative\"</em>  </p>    <p>  \t<em>I've crammed all my Lightroom knowledge into over<strong> 80+ Lightroom lessons!</strong></em>  </p>    <p>  \t    After going through this course you'll be able to apply your new <em>Lightroom skills to edit anything and make some extra cash along the way</em>.  </p>  <p>  \t    All you have to do is click on the <strong>\"take this course\"</strong> button on the top right corner. You have nothing to lose. In fact, you've got a lot to gain.  </p>  <p>  \t    Thank you, Manni  </p>", 
    "end_date": null, 
    "title": "Learning Adobe Lightroom - Start Editing Photos Like a Pro ", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/26942_c7ac_6.jpg", 
    "course_url": "https://www.udemy.com/lightroom4course/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-17T08:08:43Z"
}