{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t              The focus of this course is to <strong style=\"\">use a Finite Element Method software, to analyze runway&#039;s behavior under static load</strong> and face different issues related to airliners and runway pavements.  </p>  <p style=\"\">  \t              After the introductive Section 1, we&#039;ll face the Section 2, during which we&#039;ll focus on two famous civil airplanes, the Airbus <strong style=\"\">A380</strong> and the Boeing <strong style=\"\">777,</strong> and an important part of them, the <strong style=\"\">landing gear</strong>. Important because landing gear is the contact between airplane and pavement.  </p>  <p style=\"\">  \t              We&#039;ll understand this interaction and <strong style=\"\">the pavement answer to airplane loads</strong>.  </p>  <p style=\"\">  \t              The Section 3 will focus on: aerodrome pavements, in particular runways pavements; what ICAO states about them in relation to airplane compatibility; the differences between two classical stratigraphy, the rigid pavement and the flexible one; the variables that affect the runways design.  </p>  <p style=\"\">  \t              The key purpose of Sections numbers 2 and 3 is to give us a better perspective on the <strong style=\"\">interaction airplane – runway</strong>, understanding the physical behavior both of the wheels and, above all, of the pavements, also through <strong style=\"\">the footprints</strong>: what are they; how we calculate their shapes and dimensions.  </p>  <p style=\"\">  \t              And all this will lead us into Section 4, last section, which is really to cap off and pull together all the issues that we looked at: the Finite Element Method.  </p>  <p style=\"\">  \t              We will not discuss the theoretical aspects of the F.E. Method. Instead, we will conduct a <strong style=\"\">practical analysis, step-by-step, towards the construction of simple models of pavements</strong>, in particular the rigid concrete pavements. I also prepared some <strong style=\"\">exercises </strong>to test the use of the FEM and a set of <strong style=\"\">questions </strong>for Sections 2,3,4.  </p>  <p style=\"\">  \t              You are probably wondering how much mathematics is used in this course? Only basic mathematics, regardless of whether you&#039;re a student or a technician, you can easily follow this course. And even if you&#039;re not in the airport sector, you can use this course to learn Finite Element Models and use it as an approach and method for applying the FEM to any other issue.  </p>  <p style=\"\">  \t              In conclusion, we will achieve the following <strong style=\"\">goals</strong>:  </p>  <ol style=\"\">  \t<li style=\"\">Distinguish the runway stratigraphy and its materials.</li>  \t<li style=\"\">Analyze the vertical loads induced by the airplane with reference to the landing gear configurations.</li>  \t<li style=\"\">Learn to use a Finite Element Method software for building and analysis of the pavement&#039;s mathematical model.</li>  </ol>", 
    "end_date": null, 
    "title": "Learn to use F.E. Method for stress analysis of the runways", 
    "price": "20.00", 
    "instructors": "Enzo Bonvino", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/367218_e105_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-use-fe-method-for-stress-analysis-of-the-runways/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-10T10:07:23Z"
}