{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>How to Edit HDR Photos Like a Pro</h5>  <p>  \t          Learn how I use Photoshop &amp; Photomatix to create photos that have been featured on Apple and The Washington Post.  </p>  <p>  \t             Do you get really frustrated when your images don&#039;t come out the way you want them to look?  </p>  <p>  \t                  Do you ever feel like you aren’t harnessing the true power of Photoshop or HDR software?  </p>  <p>  \t                  Do your photos end up looking too grungy?  </p>  <p>  \t                  I’m Angela Pan, a professional Landscape Photographer from Washington DC that specializes in HDR. My work has been featured in Apple, The Washington Post, ABC, NBC and the TravelChannel..  </p>  <p>  \t                  I will teach you everything I know about editing HDR photos (learnt from reading tons of books and attending expensive photo workshops) in this 1 hour, 13 videos course.  </p>  <h5>Awesome HDR Skills You’ll Learn in this Course:</h5>  <p>  \t             - Spotting Imperfections in your Photos  </p>  <p>  \t             - Crop like a Pro: Drastically Improve your Composition by Knowing What to Remove  </p>  <p>  \t             - HDR De-Ghosting: Get Rid of the Pesky Blurriness caused by Moving Objects  </p>  <p>  \t             - Nik Color Efex Pro: The Secret Weapon to Photos w/ Amazing Color and Detail  </p>  <p>  \t             - Leverage the Power of Adobe Bridge to Simplify how you Work  </p>  <ol>  \t<li>Tone Mapping - Color Saturation</li>  \t<li>Tone Mapping - Luminosity</li>  \t<li>Tone Mapping - Details Contrast</li>  \t<li>Tone Mapping - Lighting Adjustments</li>  \t<li>Tone Mapping - Smooth Highlights</li>  \t<li>Tone Mapping - White Point</li>  \t<li>Tone Mapping - Black Point </li>  \t<li>Tone Mapping - Gamma </li>  \t<li>Tone Mapping - Temperature</li>  \t<li>How to use Adobe Bridge</li>  \t<li>How to Get Rid of Dust Spots</li>  \t<li>Cropping</li>  \t<li>Nik Color Efex Pro - Contrast</li>  \t<li>Nik Color Efex Pro - Color </li>  \t<li>Levels, Curves and Color Balance</li>  \t<li>Getting Rid of Noise</li>  \t<li>Sharpening your Image</li>  </ol>  <h5>A Video Course is WAY Better than Reading a Book (esp. when you’re Editing Photos)</h5>  <p>  \t             Courses are so much better than book learning when it comes to photography, and here’s why:  </p>  <ul>  \t<li>Screen Capture so you can follow along and see exactly what I’m doing (instead of trying to follow in a book, then switching back/forth to your computer)</li>  \t<li>Skimming a Big BORING Book Sucks - this video course gets to the good stuffwithout leaving any of the important stuff out.</li>  \t<li>You can Ask Me Questions - if you get stuck, you can actually contact me via comments/emails and I’ll get back to you.</li>  \t<li>Seeing it Happen is Wayyy Cooler - when you’re watching me edit photos in ‘real-life’, and see them go from blah-to-AWESOME, it will get you super-excited to apply these techniques to your own photos</li>  </ul>  <p>  \t             Here’s a complete list of everything we’ll cover:  </p>  <ol>  \t<li>How to Envision your Final Results</li>  \t<li>Reduce Noise</li>  \t<li>Reduce Chromatic Aberrations</li>  \t<li>Selective Deghosting</li>  \t<li>Tone Mapping - Strength</li>  </ol>  <h5>100% Self-paced Video Course</h5>  <p>  \t                Follow me on your own time, at your own pace and on your own computer as I walk you through using Photoshop, Photomatix and Nik Color Efex Pro to edit your HDR photos.  </p>  <p>  \t                And...if you get stuck, you can contact me via the Comments section or Email.  </p>  <h5>Course Materials</h5>  <ul>  \t<li>Videos that walk you through how to use Photoshop, Photomatix and Nik Color Efex Pro to edit your HDR photos.</li>  \t<li>Sample Photos I use in the videos so you can follow along</li>  \t<li>Coupon Codes for Photomatix</li>  </ul>  <h5>Length of time it will take to complete the course</h5>  <ul>  \t<li>Over 13 lectures and an hour worth of content!</li>  </ul>  <h5></h5>", 
    "end_date": null, 
    "title": "Learn Advanced HDR Editing with Photoshop and Photomatix", 
    "price": "35.00", 
    "instructors": "Angela B. Pan", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/75184_a034_10.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-edit-hdr-photos-like-a-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-07T14:02:34Z"
}