{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\"><em style=\"\">Learn Photoshop: Create Gorgeous Art</em></strong><strong style=\"\"><em style=\"\"> in 2 Days</em></strong> is for anyone who wants to learn Adobe Photoshop, create digital art, or add a powerful skill to their resume. In as little as 2 days you can learn everything you need to know in Photoshop to create gorgeous art and add this money-making skill set to your resume.</p><p style=\"\">--------------------------------------------------------------------------------</p><p style=\"\">5 Star Review: &quot;</p><p style=\"\"><em style=\"\">&quot;I loveddd this class! Very clear yet thorough ... I learned many wonderful skills that I know will help me along my photoshop learning journey :-) Thank you Cat for putting this together and for the wonderful textures/pictures you shared with us. Much love! xoxoxox&quot; - Monica</em></p><p style=\"\">--------------------------------------------------------------------------------</p><p style=\"\">Photoshop is the number one photo-editing software in the world. Not only can you edit photos with it, you can create amazing artwork with it, and even do graphic design. People who use Photoshop include photographers, graphic designers, game designers, artists and illustrators, ad designers, surface and pattern designers, web masters, and more. Millions of people make a living from knowing how to use Photoshop.</p><p style=\"\"><strong style=\"\"><em style=\"\">Learn Photoshop: Create Gorgeous Art</em><em style=\"\"> in 2 Days</em></strong> includes 2 beautiful collage projects that will walk you step-by-step through the process of creating your own unique digital art. Both projects include portraits of vintage movie stars, textures, bokehs, and abstract backgrounds for use in your collage. </p><p style=\"\">In as little as two days you can create your own digital artwork and have the Photoshop skills and confidence to create lots more. And you&#039;ll have a collection of over 200 public domain, copy-right free images to use over and over.</p><p style=\"\"><strong style=\"\">Included in the course:</strong> </p><ul style=\"\"><li style=\"\">Over 40 vintage portraits of  movie stars from the 1920s</li><li style=\"\">Over 200 bokehs, textures, and abstract backgrounds</li><li style=\"\">70 videos, lectures and PDF downloads</li></ul><p style=\"\"></p><p style=\"\"><strong style=\"\">Knowledge/skill sets you will acquire: </strong></p><ul style=\"\"><li style=\"\">layers</li><li style=\"\">blend modes </li><li style=\"\">filter gallery </li><li style=\"\">destructive and non-destructive editing </li><li style=\"\">saving formats </li><li style=\"\">DPI and digital sizes </li><li style=\"\">drop shadow </li><li style=\"\">masking </li><li style=\"\">loading brushes and patterns </li><li style=\"\">making your own brushes and patterns </li><li style=\"\">and so much more. </li></ul><p style=\"\"><strong style=\"\">Tools you will learn:</strong> lasso, marquee, move, magic wand, text, brush, clone stamp, and many more</p><p style=\"\"><strong style=\"\">Why I am qualified to teach you Photoshop:</strong> I have been using Adobe Photoshop for over 20 years. I have used Photoshop in my career as a: photojournalist, graphic designer, fine art photographer, freelance artist, and web master. You can see some of my digital artwork on Fineartamerica, do a search for Cat Whipple to see my Photoshop artwork. (I would leave a link here but it&#039;s not allowed.)</p><p style=\"\">--------------------------------------------------------------------------------</p><p style=\"\"><em style=\"\">5 Star Review: &quot;Perfect for the beginning digital artist. Cat Whipple shows how to use Photoshop to create art without getting bogged down in overly technical details of the software. I certainly hope that she will follow up with an intermediate level digital collage course.&quot; - Lisa</em></p><p style=\"\">--------------------------------------------------------------------------------</p><p style=\"\"><strong style=\"\">Learn Adobe Photoshop in as little as two days.</strong> Acquire powerful creative skills. Gain highly marketable and employable skills. Enroll in the course today and become a Photoshop pro. </p><p style=\"\"><strong style=\"\"><em style=\"\">Learn Photoshop: Create Gorgeous Art</em><em style=\"\"> in 2 Days</em></strong> offers a 100% money back guarantee if you are not happy with this course. The 30-day refund is backed and dispersed by Udemy, no questions asked.</p>", 
    "end_date": null, 
    "title": "Learn Photoshop: Create Gorgeous Art in 2 Days", 
    "price": "20.00", 
    "instructors": "Cat Whipple", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/38002_dfe3_7.jpg", 
    "course_url": "https://www.udemy.com/digital-collage-in-photoshop-tutorials-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-24T22:11:31Z"
}