{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t    Adobe Photoshop CC is the industry standard software program for bitmap editing in all fields of development and design, from game, web and app development to fashion design and beyond. This course will teach you everything you need to become comfortable and proficient in the use of all the key tools available in Photoshop CC and CS6. Progressing through a string of lesson reinforcing mini projects, you will learn the function of each tool, lesson by lesson, including a practical application that makes the benefit of learning the tool clear and instant.  </p>\n\n<p>  \t    This Photoshop CC and CS6 course includes extensive coverage of:  </p>\n\n\n\n\n\n<ol>  \t<li>The move tool</li>  \t<li>All of the marquee selection tools</li>  \t<li>All three lasso selection tools</li>  \t<li>Magic wand and quick selection tools</li>  \t<li>Crop tool, perspective crop tool, slice tool and select slice select tool</li>  \t<li>Eye dropper tool, color sampler tool, Ruler tool and note tool</li>  \t<li>Spot healing brush, healing brush, patch tool, content aware move tool and red eye tool</li>  \t<li>Brush, pencil, color replacement and mixer brush tools</li>  \t<li>Clone stamp and pattern stamp tool</li>  \t<li>History brush and art history brush tools</li>  \t<li>Eraser, background eraser and magic eraser tools</li>  \t<li>Gradient and paint bucket tools</li>  \t<li>Blur, sharpen and smudge tools</li>  \t<li>Dodge,  burn and sponge tools</li>  \t<li>Pen, freeform pen, add anchor point, delete anchor point and convert point tools</li>  \t<li>The various text tools</li>  \t<li>Path selection and direct selection tools</li>  \t<li>All of the vector tools</li>  \t<li>Hand &amp; Rotate view tools</li>  \t<li>Zoom tool</li>  \t<li>Color swatches</li>  \t<li>Quick mask mode</li>  \t<li>Standard and full screen mode toggles</li>  </ol>\n\n\n\n\n\n<p>  \t    You will also learn how to work with all of the most important panes, including:  </p>\n\n\n\n\n\n<ol>  \t<li>Layers</li>  \t<li>Navigator</li>  \t<li>Actions</li>  \t<li>Adjustments</li>  \t<li>Brush</li>  \t<li>Brush presets</li>  \t<li>Channels</li>  \t<li>Character</li>  \t<li>Character Styles</li>  \t<li>Paths</li>  \t<li>Color</li>  \t<li>Swatches</li>  \t<li>Styles</li>  </ol>\n\n\n\n\n\n<p>  \t    In just a few short hours of exciting and enjoyable instruction, you will have mastered the fundamentals of Adobe Photoshop CC and/or CS6!  Here is what just 2 students had to say in his review: </p>\n\n\n\n<p>\"I really enjoyed this course I learned a lot, Thank you. This course is <br>really a great course for those wishing to get a start using Photoshop. <br>Richard made this course easy to follow and understand as he shows you <br>the basics.\"<br>Mark</p>\n\n\n\n<p>\"Very easy to follow along. I'm very impressed. I'd recommend this course to anyone looking to learn photoshop CS6\"<br></p>\n\n<p>Zaldy Padilla<br></p>\n\n\n\n<p>So what are you waiting for, it's time to learn Adobe Photoshop CC and CS6 Basics! Let's get started!</p>", 
    "end_date": null, 
    "title": "Learn Adobe Photoshop CC and CS6 Basics from Scratch", 
    "price": "20.00", 
    "instructors": "Richard Sneyd", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/369042_72bc_9.jpg", 
    "course_url": "https://www.udemy.com/learn-adobe-photoshop-cs6-from-scratch-in-just-3-hours-zero-to-hero/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-13T03:16:48Z"
}