{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>UPDATE 2015 June 6:</strong> Added a<strong></strong> lecture about creating mandalas in Inkscape! It is a fun way to learn the benefits of creating a repeating design in Inkscape! <strong> </strong></p><p><strong>  \t    Over 2200 students! Thank you! </strong>  </p>  <p>  \t         Please share your works created after taking the course in the discussions!  </p>                             The course is teaching everything one should know to work efficiently  with the free and open source graphic design program Inkscape. As a free program, there are plenty of short  tutorials about Inkscape, but not a comprehensive video tutorial like this was made before!                           These lessons are not for solving individual tasks (like how to create a banner, how to draw a fish etc.) but rather going through all the tools one can need to understand and use Inkscape on an amateur or even professional level! Apart from sharing the tools, I also give my tricks and tips I developed myself as a designer working with Inkscape for years.  <p>  \t                       There are 30 lectures of varying length, and .svg files are provided where needed, so students can learn and experiment.   \t  \t                       This is how the course is built up:  </p>  <ol>  \t<li>In the first set of lectures we go through the basic tools, and understand how Inkscape works.</li>  \t<li>Then the more complex tools follow, and we create more elaborate designs.</li>  \t<li> Then I'm sharing some illustration tips and tricks, that will make for clever and outstanding illustration.</li>  \t<li>And in the final lessons we create a Christmas card together, using all the tools and knowledge acquired during the course.</li>  </ol>  <p>  \t                       Have fun and ask when you need help! New videos will be added to the course upon request!  </p>", 
    "end_date": null, 
    "title": "Learn Inkscape now - create vector graphics for free! ", 
    "price": "30.00", 
    "instructors": "István Szép", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/292196_ae4a_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-use-inkscape/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-02T08:08:19Z"
}