{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong style=\"\">ADVANCED RETOUCHNG TECHNIQUES COURSE:</strong></p><p>In this course I am giving to you all the best I&#039;ve got over 3 years career as a Photoshop Instructor. I prepared this course for everyone who wants to know more about retouch, and wants to know the best techniques to retouch their images.</p><p>If You were looking through Youtube you probably noticed that videos there cannot answer all of your questions about retouch. That&#039;s why I made this course for People like You.</p><p>Or maybe You think You are pretty good with retouch but would like to polish your retouching skills and got some of the new tricks and techniques that will be helpful for You?</p><p>By the fact I included every possible step and techniques that help you to achieve the desire look. This course will be perfect for You!</p><p><strong style=\"\">What is this Course about?</strong></p><p>This course take portrait retouching to the absolutely next level. It&#039;s not only about basic skin retouch. It&#039;s about the whole process with tons of retouching details.</p><p>I cover all advanced retouching techniques like complete guide on frequency separation (which going to give you new point of view on this technique), shaping the face. And what&#039;s the most important I do not skip retouching the details!</p><p>This course is for people who knows some basic about photoshop, and wants to get more advanced knowledge about program and portrait retouching.</p><p><strong style=\"\">What This Course Include?</strong></p><p>- Whole process of basic skin retouch so You will be able to retouch the skin and hair.</p><p>- Shaping the face to make it sharpen and with a perfect shape.</p><p>- Full lip retouch which shows how to retouch, fix the color and contours of the lips.</p><p>- Complete Eyes retouch which shows You how to make the eyes bigger, how to retouch them, as well as how to sharpen and brighten them up!</p><p>- Nails Retouch.</p><p>- Complete Dodge &amp; Burn guide which shows You how to do global and local Dodge &amp; Burn in the right way.</p><p>- Sharpening Lesson.</p><p>- And at the end of the course You will learn how to create simple final Adjustments!</p><p>Enjoy the Course!</p><p>Marcin</p>", 
    "end_date": null, 
    "title": "Learn Advanced Retouching Techniques in Photoshop", 
    "price": "20.00", 
    "instructors": "Marcin Mikus", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527166_448f_2.jpg", 
    "course_url": "https://www.udemy.com/retouching/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-13T01:08:45Z"
}