{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tThis  training class provides the critical fundamentals of learning Avid Media Composer from the ground-up. </p><p style=\"\">It is recommended that you have a recent version of Avid Media Composer installed. Avid offers a  30 day fully functional trial if you do not own an active license.<br style=\"\"> </p>  <p style=\"\">  \tThis training represents a culmination of 20+ years experience of using Avid Media Composer.  Each lesson has been methodically scripted and presents specific concepts at an easy to learn pace.  </p>  <ul style=\"\">  \t<li style=\"\">Practice media is provided so you can follow along.</li>  \t<li style=\"\">Special rights to use REAL movie footage from the short-film Legacy. </li>  \t<li style=\"\">Support is provided via &#039;Udemy&#039;s&#039; Question/Answer forum.</li>  \t<li style=\"\">Quizzes after each section to help you review critical concepts.</li>  \t<li style=\"\">Special lecture descriptions are available for each lesson to enhance the instruction.</li>  \t<li style=\"\">Extra <strong style=\"\">bonus</strong> lessons on specific Media Composer effects are available.</li></ul><ul style=\"\">  </ul>  <p style=\"\">  \t<strong style=\"\">* Please note:</strong>  There are a few <strong style=\"\">bonus</strong> lessons that require Avid FX, and Boris Continuum.  Depending on the version of Avid Media Composer that you are running you may not have these third party plug-ins.  This online training <strong style=\"\">does not require</strong> these plug-ins, but if you have access to them, please enjoy the free bonus lessons.  </p>", 
    "end_date": null, 
    "title": "Learn Avid Media Composer", 
    "price": "50.00", 
    "instructors": "John Lynn", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/50134_528c_7.jpg", 
    "course_url": "https://www.udemy.com/avid-media-composer-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-04-16T23:39:43Z"
}