{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>High End Beauty</strong> Images are desired product in advertisement of luxurious products as well as in Fashion and Beauty magazines. In this course You will learn the best techniques for High and Beauty Retouch, which are going to place Your retouching skills on a totally new level.</p>\n\n<p><strong>So first of all what is High End Beauty Retouch?</strong></p>\n\n<p>The most advanced form of retouching which requires a lot of retouching practice. One retouch usually takes at least few hours of very detailed work. In such a retouch it's very important to not destroy the skin texture. That's why we cannot smudge or soften the skin, but instead of this, we need to use more advanced techniques, to make image beauty, clean, dynamic, and keep the skin texture. </p>\n\n<p>There's few concept's of beauty. As a retoucher You need to know one thing - Image is not becoming beauty by the fact we create fake skin or remove all of the spots. The beauty is at the point when we remove all of the bad things, but keep the things that are beauty - the beauty comes from what stays in the image.</p>\n\n<p>To make great beauty retouch, You need to use the right techniques, which let You save some of the time, and give perfect results. Mentioned techniques You can find in this video course.</p>\n\n<p>-------------------------------------------------------------------------------------------------------------</p>\n\n<p>If You are here - You are probably someone who is into Photoshop and retouching. And it's quite possible that You are a person who was wondered how to get that perfect magazine cover look.</p>\n\n<p>You might want to get into high end Beauty Retouch or You might be a person who has been doing it for a while and just want to get some of new techniques, or maybe improve Your current skills. If You are any of these person You are in the right place. In this 6 Hours course I am going to show You techniques that going to push You into totally new level in Photo retouching. </p>\n\n<p>In this course I am going to share with You all of the secrets and techniques I am using to get the perfect look. During few hours of my workflow You'll get the skills that going to make You the best in Your field.</p>\n\n<p>-------------------------------------------------------------------------------------------------------------</p>\n\n<p><strong>Advanced High End Beauty Retouch Course:</strong></p>\n\n<p>In this course I am giving to you all the best I've got over 3 years career as a Photoshop Instructor. I prepared this course for everyone who wants to know more Beauty Retouch, and wants to know the best techniques which let You to get perfect magazine covers look!<br></p>\n\n<p><strong>What This Course is about?</strong></p>\n\n<p>I cover all advanced beauty retouching techniques like complete guide on frequency separation (which going to give you new point of view on this technique), You will learn how to shape the face. and do professional retouch using Dodge &amp; Burn Technique. And what's the most important I do not skip retouching any details so You will learn every single step of the retouching process.</p>\n\n<p>This course is for people who knows how does the Photoshop work, and have a bit of experience with the Program. If You are hungry of knowledge and want to retouch images like a world class retoucher - this course is for You.</p><p>We are working on portrait image step by step, and You are going to learn very detailed portrait retouching techniques pushing up amazing look of Your images.</p>\n\n<p><strong>What This Course Include?</strong></p>\n\n<p>- Whole process of basic skin retouch so You will be able to retouch the skin and hair.</p>\n\n<p>- Shaping the face to make it sharpen and with a perfect shape.</p>\n\n<p>- Full lip retouch which shows how to retouch, fix the color and contours of the lips.</p>\n\n<p>- Complete Eyes retouch which shows You how to make the eyes bigger, how to retouch them, as well as how to sharpen and brighten them up!</p>\n\n<p>- Nails Retouch.</p>\n\n<p>- Complete Dodge &amp; Burn guide which shows You how to do global and local Dodge &amp; Burn in the right way.</p>\n\n<p>- Sharpening Lesson.</p>\n\n<p>- And at the end of the course You will learn how to create simple final Adjustments!</p>\n\n<p><strong>What else?</strong></p>\n\n<p>Except the knowledge, You are going to get the lifetime access into <strong>Resources and Actions</strong> that going to speed up Your Workflow.</p>\n\n<p>Enjoy the Course!</p>\n\n<p>Marcin</p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Learn Advanced High End Beauty Retouching in Photoshop", 
    "price": "30.00", 
    "instructors": "Marcin Mikus", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/582982_4a0a_2.jpg", 
    "course_url": "https://www.udemy.com/beauty-retouching/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-14T12:18:48Z"
}