{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t     You open up Photoshop and decide that you want to try and draw some mechs. You get started only to find that they&#039;re not turning out the way you wanted, and you really wish it just looked more professional. How should I get started? What brushes should I use? All of these questions run through your head as you try to figure out why it just isn&#039;t looking like how you imagined. <br style=\"\">  \t <br style=\"\">  \t     Having the ability to watch someone go through each step of the process and explain why they are doing each step would be great. It would help to eliminate some of your major questions that have been holding you back. You just want to have someone show you how to get started, and what steps should be taken to get great results. <br style=\"\">  \t <br style=\"\">  \t     This course will take you step by step through the process of designing and creating your own mech concepts from scratch. By the end of the course you will have a professional level understanding of the core concepts and techniques used in creating mech concept art. If you want to improve as an artist and really take your art to the next level, this course will teach you the skills to get there. So lets get down to the dirty work and start learning how to draw mechs inside of Photoshop.<br style=\"\">  \t<br style=\"\">  \t//Also included in the conclusion chapter is the final PSD photoshop document so you can destruct and look at things at your own pace.  </p>", 
    "end_date": null, 
    "title": "Learn to draw Mechs: Photoshop", 
    "price": "20.00", 
    "instructors": "Bradley Wascher", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/239846_27f4_4.jpg", 
    "course_url": "https://www.udemy.com/learn-to-draw-mechs-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-09T05:43:32Z"
}