{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  In the 12-hour Learn Dreamweaver CS6 video training course, discover how to easily and quickly design your website using this popular web development software. Your professional trainer will teach you the basics and guide you through more advanced features such as adding web content including images, text, multimedia, tables, and links.  </p>  <p style=\"\">  \t  The course continues with tips on how to publish and manage your website. Also included are sections covering some of the programming languages used for websites as well as helpful videos that outline new features, keyboard shortcuts, and other Dreamweaver tools.  </p>  <p style=\"\">  \t  This is a beginner level course for those being introduced to Dreamweaver and website design for the first time. It’s taught at a casual pace so that learners have plenty of time to absorb the information.  </p>  <p style=\"\">  \t  Plus, when you sign up for our class, you’ll also get these <strong style=\"\">3</strong><strong style=\"\"> BONUSES </strong>in addition to the 40 online course videos:  </p>  <ol style=\"\">  \t<li style=\"\"><strong style=\"\">An online quiz (40 questions)</strong> - to test what you&#039;ve learned.</li>  \t<li style=\"\"><strong style=\"\">12 hours of downloadable MP3s to play on your favorite audio device</strong> - to help you learn in the car, while you walk, or in the gym.</li>  \t<li style=\"\">A certificate of completion to tell everyone you&#039;ve aced the course.</li>  </ol>  <p style=\"\">  \t  Where else can you find so many extra tools to help you learn Dreamweaver CS6?!?!  </p>  <p style=\"\">  \t  So start learning today. Because being a technology dinosaur isn’t going to get you a promotion or raise!  </p>  <p style=\"\">  \t<strong style=\"\">IMPORTANT:</strong> This course is for absolute beginners. If you&#039;re looking for a fast paced course, consider another course.  </p>  <p style=\"\">  \t  All of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.  </p>", 
    "end_date": null, 
    "title": "Learn Adobe Dreamweaver CS6 - For Absolute Beginners", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/29942_1dcf_3.jpg", 
    "course_url": "https://www.udemy.com/learn-adobe-dreamweaver-cs6-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-11-17T23:43:19Z"
}