{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this Adobe After Effects CC training course from Infinite Skills you will learn how to get the most out your post-production effects and compositing with this powerful software from Adobe. Designed for the beginner, you will learn how to use After Effects CC from the ground up, no previous experience is necessary!<br style=\"\"><br style=\"\">You will start this video based tutorial with an overview of the After Effects workflow, and a tour of the interface to become familiar with the location of the tools you will use. The course then immediately gets you working hands-on with projects; importing video, importing assets, creating and arranging your layers and working with text. You will learn how to work with shapes, and techniques for using the paint tools. The course introduces you to masks, matts and stencils, and distorting and animation using Puppet Tools. As you continue through the After Effects CC training you will learn how to apply effects and transitions, track motion, stabilize video, and work within 3D space. An amazing new feature to After Effects CC is the ability to bring in Cinema 4D scenes as layers using the Live 3D Pipeline, and Jeff will show you how!<br style=\"\"><br style=\"\">Once you have completed this Adobe After Effects CC video tutorial, you will have a solid grasp on how to apply the tools in this visual effects software to your own video projects. Working files are included, allowing you to follow along with the author throughout the lessons.</p>", 
    "end_date": null, 
    "title": "Learning Adobe After Effects CC Tutorial Videos", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "16.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61188_4fb2_9.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-after-effects-cc-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-20T19:52:49Z"
}