{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Learn how to become a digital artist in Corel Painter. In this Painter course, you'll learn what it means to be a digital artist. The skills you will learn here will help you to use Painter more confidently or to build a portfolio of work to impress your potential future employer, or even as a nice hobby, why not?<br><strong></strong></p>    <p><strong>Projects</strong></p>  <p>After we cover the gist of what it means being a digital artist we will then move on and work on a final project at the end of this course to bring it all together using cool Painter brushes and have lots of fun as we explore and develop our own final art piece.</p>    <p><strong>Who Should Take This Course</strong></p>  <p>This course is designed for anyone who enjoys digital art, from photographers, graphic and web designers, animators and more. Whether a beginner or even an intermediate user, you will gain vast skills taking this course. </p>    <p><strong>Prerequisites</strong></p>  <p>There are no skill prerequisites for this course. You are expected to have access to a copy of Corel Painter in any version, though we will be using Painter 2015 in this course, no prior Painter skills are required.</p>    <p>What am I going to get from this course?</p>  <p>         •       Particles and jitter brushes</p>  <p>         •       Advanced brush parameters</p>  <p>         •       Reference images</p>  <p>         •       Color sets and the color mixer</p>  <p>         •       Wardrobe details</p>  <p>         •       Temporal palette</p>  <p>         •       Customizing workspaces</p>  <p>         •       Special effects</p>  <p>+ more...</p>    <p><strong>What is the target audience?</strong></p>  <p>Photographers, graphic and web designers, animators and anyone loving digital arts. </p>", 
    "end_date": null, 
    "title": "Learn to Become a Digital Artist using Corel Painter", 
    "price": "50.00", 
    "instructors": "Corel Corporation", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/562626_08d0_3.jpg", 
    "course_url": "https://www.udemy.com/learn-to-become-a-digital-artist-using-corel-painter/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-23T13:43:32Z"
}