{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t        In the 12-hour Learn Dreamweaver Creative Cloud (CC) video training course, you will discover how to easily and quickly design your first website using this popular web development software.  </p>  <p>  \t  Your professional trainer will teach you the basics of creating a web page that includes text, images, and hyperlinks.  </p>  <p>  \t  Learn how to customize the design and content of your web pages. You’ll also find out how to use essential features in Dreamweaver such as previewing your pages before they are published, and designing for multiple screens.  </p>  <p>  \t  The comprehensive course continues with tutorials discussing how to publish and manage your website, and practical tips for quickly editing your pages before they are published.  </p>  <p>  \t  This beginner level course is intended for those who are just being introduced to Dreamweaver and website design. It’s taught at a casual pace so that learners have plenty of time to absorb the information.  </p>  <p>  \t        This course includes:  </p>  <ol style=\"\">  \t<li>Exercise files</li>  \t<li>An optional quiz to test what you’ve learned</li>  \t<li>Certificate of completion</li>  </ol>  <p>  \t        IMPORTANT: This course is for absolute beginners. If you&#039;re looking for a fast paced course, consider another course.  </p>", 
    "end_date": null, 
    "title": "Learn Adobe Dreamweaver CC - For Absolute Beginners", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/287924_9dd1_2.jpg", 
    "course_url": "https://www.udemy.com/dreamweaver-cc-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-26T03:59:33Z"
}