{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A&nbsp;Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>    <p>In this Adobe Audition CS6 training course we take you through the use of this audio editing software from Adobe. Narrated by an &nbsp;experienced Adobe Certified Instructor This video training course is designed for beginners, and no previous Audition experience is required.<br style=\"\">  <br style=\"\">  Starting with the basics of Audition CS6, covering audio fundamentals such as what sound is, and how Audition handles digital audio. The course then moves to the Audition workflow; importing your audio, editing it, creating multi-track sessions, and exporting the final product. Each of the workflow steps are covered step by step, with every new training video adding to what came before it. The course also covers Audition CS6 effects such as reverb, and echo. Finally, you will learn how to identify, and remove unwanted noise from your audio clips.<br style=\"\">  <br style=\"\">  By the conclusion of this video tutorial on Adobe Audition CS6, you will be familiar with all the various tools at your disposal as well as techniques you can use to clean, edit and export your audio files. Working files are included to allow you to learn with the same files that the author uses in his training.<br style=\"\">  </p>", 
    "end_date": null, 
    "title": "Learning Adobe Audition CS6 The Easy Way", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23840_5663_7.jpg", 
    "course_url": "https://www.udemy.com/learning-adobe-audition-cs6-the-easy-way/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-29T19:50:03Z"
}