{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t This Autodesk Maya 2014 training course from Infinite Skills introduces you to the core features of Maya. This course is designed for the absolute beginner, and even if you have never worked in Maya before you will quickly understand and become familiar with the basics of creating 3D models in Maya.  </p>  <p>  \t In this video tutorial, you will learn the basic concepts of modeling, animation and rendering in Maya 2014. This course not only shows you how to access the tools in the Maya interface, but also how to apply them. You will create projects throughout this Maya 2014 tutorial that will reinforce how to apply the modeling tools. You will learn how to create models using different tools and techniques, how to texture or shade your models, how to rig them and how to animate your models. Finally, the training course shows you how to render your finished product using Mental Ray.<br>  \t <br>  \t Once you have completed this Autodesk Maya 2014 video tutorial, you will be familiar with the core Maya 2014 concepts including modeling, shading, animating and rendering your projects. You will be capable of creating your own models in Maya, applying the knowledge that Todd has taught you in this training course. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Autodesk Maya 2014 - A Practical Hands On Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/81872_9663_9.jpg", 
    "course_url": "https://www.udemy.com/autodesk-maya-2014/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-21T19:49:58Z"
}