{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t  This course is designed to teach you the ins and outs of Photoshop, even if you have little to no experience with it, to create profitable web designs that help you stand out from the competition.  </p>  <p>  \t  Learn how to make your workflow more efficient so you can spend less time completing projects and more time getting more clients to increase your freelancing profits.  </p>  <p>  \t<strong style=\"\">Master Photoshop Techniques to Create Extraordinary Websites and Boost Your Freelancing Income</strong>  </p>  <ul style=\"\">  \t<li>Adobe Photoshop Tools</li>  \t<li>Using Photoshop to Create Website Designs from Scratch</li>  \t<li>Finding Freelance Web Design Projects</li>  \t<li>Tips for Efficient Workflows</li>  </ul>  <p>  \t<strong style=\"\">Work More Efficiently, Acquire More Clients, and Make More Money</strong>  </p>  <p>  \t  This is a comprehensive course that will guide you through all the basic and advanced tools used to design a website from scratch in Photoshop. You&#039;ll see the actual design process in action, rather than solely focusing on theory.  </p>  <p>  \t  What makes this course different is the fact that it goes beyond design to also teach you how to earn a living designing websites. In a few weeks, you can implement strategies to make your workflow more efficient, differentiate yourself from the competition, and earn more money as a web designer.  </p>  <p>  \t<strong style=\"\">Contents and Overview</strong>  </p>  <p>  \t  This course is aimed at teaching website designers, including beginners, what it takes to earn more money from fewer projects by working more strategically.  </p>  <p>  \t  In addition to step-by-step walkthroughs that teach you how to efficiently apply tools in Photoshop to your projects, you&#039;ll receive 50+ premium PSD files and other materials to help you further develop your skills.  </p>  <p>  \t  After mastering how to design websites using Photoshop, you&#039;ll also learn how to be a more profitable freelancer. You&#039;ll receive tips to help you outsmart other designers and get the best projects. This means you can earn more money on each project and take on fewer clients overall. Strategies like this will help you have a better work-life balance.  </p>  <p>  \t<strong style=\"\">Please note: the resources folder is at the end of the course, in the last lecture. In that archive you will find all the files: the exercise, the grid system and the premium resources.</strong>  </p>", 
    "end_date": null, 
    "title": "Learn Photoshop, Web Design & Profitable Freelancing", 
    "price": "35.00", 
    "instructors": "Cristian Doru Barin", 
    "commitment": "18 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/35844_fc34_7.jpg", 
    "course_url": "https://www.udemy.com/learn-how-to-make-money-with-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-12T15:23:50Z"
}