{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \tThis Corel Painter X3 training course from Infinite Skills teaches you the fundamental tools and techniques that are available to you in this widely used pixel-based painting program. This course is designed for the absolute beginner, meaning no prior Corel Painter experience is required.  </p>  <p style=\"\">  \tYou will begin with the basics as the course introduces you to the Painter desktop and the useful tools and commands in the program. You will learn the different brush controls, such as dab, stroke, and method, as well as advanced controls and custom variants. The course will show you the different effects available in the effects menu, selection tools and commands, and how to work with text. Once you have learned the basics in this video tutorial, you will begin to create projects in a variety of styles. Follow along with the course as it teaches you to create a watercolor still life, a pastel portrait, an abstract painting, humorous caricatures, and much more!<br style=\"\">  \t<br style=\"\">  \tBy the completion of this computer based training course, you will have a clear understanding of how to use the many tools and techniques available in Corel Painter X3 to create your own works of art. You will have learned about the advanced techniques and new features in this program and how to apply them to your creations. Working files are included, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Learning Corel Painter X3 -  Be Creative With Painter", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118194_6a8f_10.jpg", 
    "course_url": "https://www.udemy.com/corel-painter/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T14:29:21Z"
}