{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Design is a big part of my life. Ever since I was a kid, I've always been fascinated by design sketching and especially marker sketching. I mean, who doesn't love to draw and sketch stuff right?</p>\n\n<p>Hi, my name is Marouane, I’m an industrial designer and founder of TheSketchMonkey, a community for designers. Sketching is something I’ve been doing for as long as I can remember and it has taken me on a journey all over the world - from my native country of Sweden to designing cars in Italy all the way to my current location, South Florida. </p>\n\n\n\n<p><strong>In this 4,5 hour video course, you will learn the marker sketching techniques that I’ve learned over the years as a designer.</strong></p>\n\n\n\n<p>Inside Marker Madness you will learn how to use markers to visualize your ideas on paper. From early pencil outlines to complete design renderings. <strong>We'll talk about what to think about when sketching with markers, what tools you should use to really complement the markers, the different sketching and stroke techniques for a smooth final result, how to blend markers and what to think about when adding highlights. </strong></p>\n\n\n\n<p>You’ll also learn a detailed step by step walk through of a car rendering where you can literally watch over my shoulder as we go from early outlines to a full blown color render and much much more!</p>\n\n\n\n<p><strong>This course is for you who want to improve your analog sketching skills</strong> - maybe you are an industrial designer just like me or a complete beginner who wants to dive into the world of marker sketching.  </p>\n\n\n\n<p>If you have any questions or feedback what so ever about the course or a specific lecture, please make sure you write it in the discussions forum. <strong>All feedback is more than welcome, since that's what I'm going to use to expand this course over time.</strong></p>\n\n\n\n<p>Thank you for your interest in my course. I’m excited to show you all of this and I hope you are too! </p>\n\n\n\n<p>Click \"take this course\" right now, grab a pen and paper and let’s get the creative juices flowing!</p>", 
    "end_date": null, 
    "title": "Marker Sketching: Master Design Sketching with Markers", 
    "price": "50.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/724872_78c4_9.jpg", 
    "course_url": "https://www.udemy.com/marker-sketching-learn-design-sketching-with-markers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T00:32:28Z"
}