{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<p>  \t\t<span style=\" color:rgb(74, 74, 74);\">In this Adobe Photoshop CC training course, you will learn how to use the worlds most popular graphics and photo editing software. This training is designed for the absolute beginner, and you will learn Photoshop from the ground up, with no prior experience required</span>  \t</p>  \t<p>  \t\t<span style=\" color:rgb(74, 74, 74);\"></span>  \t\t<p>  \t\t\t<br style=\"\">  \t\t\t   This training course breaks down the features and tools of Photoshop CC into easily understood parts, increasing your ability to understand and retain the information. You will learn how to: create and manage color in an image, utilize layers in Photoshop and work with filters. Val shows you how to use tools such as dodge and burn, the magic wand, brushes, cloning and healing, and even Type in Photoshop. In this Photoshop CC tutorial, you will learn more than can be possibly listed here!<br style=\"\">  \t\t\t<br style=\"\">  \t\t\t   By the time you have completed this video based training for Adobe Photoshop CC, you will be familiar with the tools available to you in this graphics editing and creation software, and how to apply them to your own projects. Working files are included, allowing you to follow along with the author throughout the lessons.  \t\t</p>  \t\t<p>  \t\t\t<span style=\" color:rgb(74, 74, 74);\"></span>  \t\t\t<p>  \t\t\t\t<br style=\"\">  \t\t\t\t   This training course breaks down the features and tools of Photoshop CC into easily understood parts, increasing your ability to understand and retain the information. You will learn how to: organize your files using Adobe Bridge, work with Camera Raw images, create and manage color in an image, utilize layers in Photoshop and work with filters. Andy shows you how to use tools such as dodge and burn, the magic wand, brushes, cloning and healing, and even Type in Photoshop. With almost 13 hours of instruction in this Photoshop CC tutorial, you will learn more than can be possibly listed here!<br style=\"\">  \t\t\t\t<br style=\"\">  \t\t\t\t   By the time you have completed this video based training for Adobe Photoshop CC, you will be familiar with the tools available to you in this graphics editing and creation software, and how to apply them to your own projects. Working files are included, allowing you to follow along with the author throughout the lessons.  \t\t\t</p>  \t\t\t<p>", 
    "end_date": null, 
    "title": "Master Photoshop CC in 2015", 
    "price": "40.00", 
    "instructors": "Val Cilic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/311950_d7e3_3.jpg", 
    "course_url": "https://www.udemy.com/learn-photoshop-cs6-basics/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-02T05:18:07Z"
}