{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>NOTE:This is the latest Course updated in March 2016!!</strong></p><p><strong>Hi,Thanks for checking out my course!</strong></p><strong>Adobe Photoshop CC </strong>is the most important tool for graphic designers and we bring together a course crafted for easy understanding and quick assimilation. This course starts with basic design introduction and follow it up with tools like Selection tools, manipulation tools , creation tools and workspace tools. You will also learn professional design principles and tips and tricks to get you started on photoshop. This practical course focus on the most important photoshop techniques and follows an unique task based pedagogy which is great for beginners and intermediate learners alike.<p>In this course , we will teache you advanced techniques aimed specifically towards photographers to touch up, correct, and enhance digital and scanned images. This course is designed for users that already have a basic working knowledge of Adobe Photoshop.</p><p>Once you have completed this computer based training course, you will have learned a number of techniques that can be applied to your photographic images. Working files are included, allowing you to follow along with the author throughout the lessons.<br></p><p>Let's get started!</p>", 
    "end_date": null, 
    "title": "Master Creature Design Techniques in Adobe Photoshop (Pro)", 
    "price": "20.00", 
    "instructors": "Star Technology Base", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/786242_4b95.jpg", 
    "course_url": "https://www.udemy.com/master-creature-design-techniques-in-adobe-photoshop-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-08T15:34:11Z"
}