{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Let me show you how easy it is to get started with Photoshop. How simple and fast you can make your pictures perfect.<br style=\"\"></p><p>My Masterclass Fast Guide takes you step-by-step through all the basics and more. If you want some advanced stuff you'll get that, too.</p><p><strong>What are the requirements?</strong><br></p><ul><li>All you need to get started is to have a copy of Adobe Photoshop CC or CS6. </li><li>It doesn't matter if you're on a PC or Mac. </li><li>Also, having basic knowledge of your computer would be required so that you can save files and find them.</li></ul><p><strong>Is this course for me?</strong><br></p><p>This course is targeted towards beginners as well as users who have used Photoshop in the past but found it too complex and confusing and are looking for an easier way to learn how to accomplish tasks using Adobe Photoshop. You don't need any knowledge of Photoshop to start the course. I will explain everything as we move along the lessons.<br> </p><p>Choose how and where you want to learn. At home, in the garden, on your travels or in the office.</p><p><strong>What am I going to learn in this course?</strong></p><ul><li>Cropping Images</li><li>Straightening Images</li><li>Best practices for resizing images</li><li>How to edit/enhance images</li><li>Adjusting tonal range of images</li><li>How to work with text</li></ul><p>The course will give you more confidence as a Photoshop user and will help you become a Photoshop power user. Every lesson is a step-by-step process guiding you through complexities of image editing in Photoshop CC.<br></p>", 
    "end_date": null, 
    "title": "Master Photoshop in Easy Steps", 
    "price": "25.00", 
    "instructors": "Marek Mularczyk", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604664_80a7_6.jpg", 
    "course_url": "https://www.udemy.com/master-photoshop-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-07T09:39:02Z"
}