{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;People thought my Photoshop purchase was a joke&mdash;that is, until they saw the results!&quot;</em></strong><br style=\"\">  </p>  <p style=\"\">  \tAre you new to Photoshop Elements 10? Do you want to improve your images to look spectacular? In our Learn Photoshop Elements 10 video training course, you&rsquo;ll learn how to turn your photos into masterpieces. Follow along as your instructor guides you through the Photoshop Elements 10 interface and introduces you to its enhanced features. Learn basic techniques, in addition to the advanced features. Get ready to make your photos look amazing and impress your friends and family members.  </p>  <p style=\"\">  \tAll of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.<span id=\"pastemarkerend51499\" style=\"\"></span>  </p>  <p style=\"\">  \t<strong style=\"\">What people are saying:</strong>  </p>  <p style=\"\">  \t<em style=\"\">I once purchased a similar product from an other supplier,to learn Paint Shop Pro. It was awful &ndash; a man speaking very fast. He sounded like Huckleberry Hound! Learn Adobe Photoshop Elements 10 Training Tutorials- 12 Hours, from Simon Sez IT is GREAT. It is spoken in a clear understandable plain ENGLISH at a really nice pace. Thank you Simon Sez IT. I LOVE IT!</em><br style=\"\">  \t <strong style=\"\">- James B.</strong> <strong style=\"\"><br style=\"\">  \t </strong>  </p>  <p style=\"\">  \t<em style=\"\">Between &lsquo;41 and &lsquo;71 I was a Pilot in the RAF and during that time flew 16 different types of aircraft.   From Tiger Moth&rsquo;s to B 29&rsquo;s.   Now aged 90 I have found the computer more complicated than any aircraft I flew.   That is until I started to receive your tutorials. <br style=\"\">  \t </em><strong style=\"\">- Garry. G </strong>  </p>  <p style=\"\">  \t<em style=\"\">Excellent service and brilliant set of instructions for learning Adobe Photoshop Elements 10 program. Would be really stuck without it. Highly recommended!</em><br style=\"\">  \t <strong style=\"\">- Eric L.</strong>  </p>  <p style=\"\">  \t<em style=\"\">The only software program I had purchased is your training tutorial on Elements 10. I have several books and other video tutorials and I find yours to be the best of the group. When I require any tutorials in the future, and I am sure that I will, I will look to see if you have made a tutorial on the subject first since I am certain that will be the only one I will need.</em><br style=\"\">  \t <strong style=\"\">- Seymour T.</strong> <span id=\"pastemarkerend3036\" style=\"\"></span>  </p>", 
    "end_date": null, 
    "title": "Master Photoshop Elements 10 the Easy Way - 12 Hours", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "12 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/20548_c87c_5.jpg", 
    "course_url": "https://www.udemy.com/photoshop-elements-10-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-02T23:38:07Z"
}