{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><em style=\"\">&quot;People thought my Photoshop purchase was a joke—that is, until they saw my photos!&quot;</em></strong>  </p>  <p style=\"\">  \t     Are you new to Photoshop Elements 12? Do you want to improve your images so they look spectacular? Now you can. That’s because,<strong style=\"\"> you don’t have to take ‘<em style=\"\">the perfect shot</em>’ anymore to get incredible results!</strong> In our Learn Photoshop Elements 12 online training course, you’ll discover how to turn your photos into masterpieces.  </p>  <p style=\"\">  \t     Watch as your professional trainer shows you how to navigate the Adobe Photoshop Elements 12 interface and gets you introduced to its enhanced features. Learn basic techniques for photo correction in addition to more advanced topics. Discover practical tips and tricks for retouching and enhancing images such as correcting skin blemishes and teeth color, clearing red eyes, using filters, fixing lighting exposure, and much more.  </p>  <p style=\"\">  \t     Get ready to make your photos look amazing and to impress your family and all of your friends!  </p>  <p style=\"\">  \t     All of our videos are high-definition videos, therefore, they are <strong style=\"\">best viewed with the HD setting on</strong>, and the videos enlarged.  </p>", 
    "end_date": null, 
    "title": "Master Adobe Photoshop Elements 12 the Easy Way - 14 Hours", 
    "price": "20.00", 
    "instructors": "Simon Sez IT", 
    "commitment": "14.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/118286_96ad_5.jpg", 
    "course_url": "https://www.udemy.com/learn-adobe-photoshop-elements-12-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-11T17:30:34Z"
}