{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis Adobe Photoshop Lightroom 5 training course from Infinite Skills guides you through the features of this comprehensive photography software designed for amateur and professional photographers alike. This training course is intended for beginners, meaning no prior knowledge or experience with Adobe Lightroom is required to take advantage of this tutorial.  </p>  <p>  \t<br>  \tAdobe Photoshop Lightroom 5 is designed for photographers, giving them the ability to organize, process, import, and manage their photography libraries. You will begin the training course by touring the Lightroom 5 interface, and learning how you can modify the Lightroom working area to best suit your needs. From there, you will follow along with Andy as he teaches you features such as creating and exporting a catalog, tethering, customizing grids and guides. You will learn to work in different modules including the library, map, and book. You will end the tutorial by learning how to export your work in a variety of formats for both print and web. <br>  \t<br>  \tBy the end of this video based training course on Adobe Photoshop Lightroom 5, you will have gained the knowledge and practical skills needed in order to successfully apply the tools and concepts to your own projects. Working files are included in this computer based training course for Adobe Photoshop Lightroom 5, allowing you to follow along with the author throughout the lessons.  </p>", 
    "end_date": null, 
    "title": "Mastering Adobe Lightroom 5 - A Definitive Tutorial", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "10 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/88080_49cf_10.jpg", 
    "course_url": "https://www.udemy.com/adobe-lightroom-5-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-04T14:00:28Z"
}