{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">What is the course about?</p><p style=\"\">This exciting Maya Tutorials for Beginners course is about learning the UV Unwrapping Tools in  Autodesk Maya particularly in organic models such as humans, creatures, fantasy  characters etc.</p><p style=\"\">What kind of learning materials are included?</p><p style=\"\">1. A series of video tutorials.</p><p style=\"\">2. A downloadable ZIP file that contains a Maya project file  that consists of the scene files and a huge checker bitmap.</p><p style=\"\">How long to complete these Maya tutorials for beginners?</p><p style=\"\">More than 2 hours to view the video tutorials and to UV  unwrap the 3D model.</p><p style=\"\">How is the course structured?</p><p style=\"\">It is mainly a hands-on learning experience whereby you UV  unwrap the dinosaur while viewing the videos. The series of video tutorials  flows in an orderly manner to lead you from basic concept of UV to actually UV unwrapping a digital  dinosaur. You can jump start to your preferred UV unwrapping stage at any time.  What you need to do is to simply make use of that particular Maya scene files  to work on.</p><p style=\"\">Lastly, have a wonderful JuRaSsic UV Unwrapping experience!</p><p style=\"\">                                        </p><p style=\"\">Take this Maya  Tutorials for Beginners course and learn how to make digital dinosaur in  2 hours using UV  Unwrapping Tools in Autodesk!</p>  ", 
    "end_date": null, 
    "title": "Maya UV Unwrapping a Digital Dinosaur in 2 hours", 
    "price": "45.00", 
    "instructors": "Isaac Yap", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/27511_f72e_5.jpg", 
    "course_url": "https://www.udemy.com/maya-uv-unwrapping-a-digital-dinosaur-in-2-hours/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-10-23T05:16:34Z"
}