{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"><strong style=\"\">---------- MASSIVE UPDATE 7/30/2015 --------------------------------------------------</strong></p><p style=\"\"><strong style=\"\">Double the content is now being added! </strong></p><p style=\"\"><strong style=\"\">---------- UPDATED 5/21/2015 --------------------------------------------------------------</strong></p><p style=\"\"><strong style=\"\"></strong></p><p style=\"\"><strong style=\"\">----------    UPDATED 4/14/2015    --------------------------------------------------------------</strong></p><p style=\"\">Rob Percival will take you into Xcode and teach you how to implement actual designs into x-code. You will be one step closer to becoming a full functioning front end designer!</p><p style=\"\">------------------------------------------------------------------------------------------------------- </p><p style=\"\">  \t      Learn the basics of user experience, app design, and tools you will need to build the most beautiful and user friendly mobile apps on the app or google play store using Sketch 3.  </p>  <p style=\"\">  \t<strong style=\"\">Build a strong foundation in Sketch 3 and user experience design with this tutorial for beginners. </strong>  </p>  <ul style=\"\">  \t<li style=\"\">Sketch 3 Introduction &amp; Tools</li>  \t<li style=\"\">Sketch School 101: A deep dive into Sketch 3</li>  \t<li style=\"\">UX research and design with best practices.</li>  \t<li style=\"\">Build one of the most user friendly and beautiful apps on the app store.</li>  </ul>  <p style=\"\">  \t<strong style=\"\">Learn a new skill that can change your life. </strong>  </p>  <p style=\"\">  \t      Sketch 3 gives everyone the ability to build professional looking designs with zero experience. You must either have a Mac, or be running the OS X environment on your windows computer. Sketch 3 is free for 30 days.  </p>  <p style=\"\">  \t      You will become a full fledged mobile app designer by the end of this course, and will have the skills to design anything. You will even be able to export your work for implementation into actual mobile app development.  </p>  <p style=\"\">  \t      Mobile app designers are averaging over $100k a year(U.S. numbers)  </p>  <p style=\"\">  \t<strong style=\"\">Content and Overview </strong>  </p>  <p style=\"\">  \t      This course is great for people with zero design experience, or experienced designers that want to learn and master Sketch 3. With more content than any other Sketch course, you will learn app design fundamentals and establish a great understanding of the concepts behind user centered design. Additional resources, quizzes, and assignments will be given through out the course to continually test your knowledge.  </p>  <p style=\"\">  \t      Starting with an introduction to the Sketch 3 interface, we will quickly dive straight in to designing our first mobile app screen. By learning by doing, you will establish a strong understanding of the basic sketch features and tools.  </p>  <p style=\"\">  \t      With these basics mastered, the course will take you through what we call Sketch School 101, and UX School 101. In these sections, you will learn everything required to master Sketch 3, as well as the basic fundamentals of user experience research and application.  </p>  <p style=\"\">  \t      Then it is time to apply our knowledge and newly acquired skills to creating our own app, from idea, to researching, to mocking up, to designing, and finally prototyping and deployment of assets to developers.  </p>  <p style=\"\">  \t      Students completing the course will have the knowledge to create beautiful and usable apps that leave people with a smile on their face.  </p>  <p style=\"\">  \t      Complete with image downloads and sketch files, you will be able to work alongside the author as you complete each step to achieving a verifiable certificate of completion upon finishing the course.  </p>", 
    "end_date": null, 
    "title": "Mobile App Design In Sketch 3: UX and UI Design From Scratch", 
    "price": "30.00", 
    "instructors": "Rob Percival, Andrew Eddy", 
    "commitment": "16 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381850_d819_10.jpg", 
    "course_url": "https://www.udemy.com/the-complete-design-course/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T22:42:02Z"
}