{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Join with <strong>more than 5700 students</strong> that already started creating animated prototypes.</p>\n\n<p>\t Designers should build the future and the best way to do it is to be fast, react and adapt. Learn how the new prototype work, they shouldn't be static anymore, that's why you need to learn interactions and animations for your prototypes.</p>\n\n\n\n\n\n\n\n<p>\t Doing your prototypes interactive will lead you to improve your collaboration with the product owners and the engineers as you'll be able to react and adapt without effort, even for your user tests.</p>\n\n\n\n\n\n\n\n<p>\t You'll learn how to animate your prototypes as I do to present them to my clients so they get a better understanding of how the app or the website will look like.</p>\n\n\n\n\n\n\n\n<p>\t This course is mainly focused on getting you more productive with the prototypes and also is focused on how to present your static designs in a way that are fully interactive, so they provide an accurate and realistic visualization of your final application or website.</p>\n\n\n\n\n\n\n\n<p>\t I've been asked many times how to start with rapid prototyping and how to easily integrate static prototype with user interactions and flows, animations and effects that's why I decided to create this course, to let people like you to be more productive and to go to the next step in your work.</p>\n\n\n\n\n\n\n\n<p>\t You'll learn the pieces that lead you to create compositions to show your animated interactions, designs and animations.</p>\n\n\n\n\n\n\n\n<p>\t The course is structured in small and easy to follow parts that will introduce you to Quartz Composer and will cover the different needs a designer or a UX can have while designing animated interactions. Finally, the course will provide you some step by step examples with downloadable content that you'll be able to view, download and play. The course is so easy to follow that if you don't like it, your money will be refunded within 30 days without any question.</p>\n\n\n\n\n\n\n\n<p>\t This course is mainly oriented to user interaction profiles, designers, animators and also for engineers that are looking to improve their skills and speed in prototype creation. The course also covers the basics of Quartz Composer so anyone looking to create any kind of animation is also welcome as the course will help them to understand and use this tool too.</p>\n\n\n\n\n\n\n\n<p>\t Developers can also benefit from the course because coding and tweaking animations in the code can be a real pain, so you'll learn how you can easily tweak and change things on the fly without code.</p>\n\n\n\n\n\n\n\n<p>\t Nowadays a lot of powerful companies like Apple, Facebook or Twitter are no longer using plain prototypes and sketches, they are already using rich interactions and animations so they can later show with much more detail to their animators, engineers or product owners. Start now improving your design and prototyping speed and skills by joining this course.</p>\n\n\n\n\n\n\n\n<p><strong>Course updates:</strong></p>\n\n\n\n\n\n\n\n<p><strong>Updated on 9th June</strong> new lessons updated</p>\n\n<p><strong>Updated on 22nd April</strong> new lessons added to the course to fix the latest updates</p>\n\n\n\n\n\n<p><strong>Updated on 20th January</strong> new resources added to the course</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 21st December</strong> new lectures added to the course</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 22nd September</strong> quizzes updated to reflect latest QC changes</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 20th September</strong> new lesson added</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 11th May</strong> Support for the new patches added</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 17th February</strong> Lesson regarding the animations has been recorded again to support the changes in Quartz Composer</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 26th December</strong> All the quiz questions now have a link to the lesson where you can learn more about it.</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 10th October</strong> New lessons added to boost your sales with animations for your landing pages.</p>\n\n\n\n\n\n\n\n<p><strong>Updated on 25th September</strong> Added new workflows to improve your animation prototyping skills with Quartz Composer.</p>", 
    "end_date": null, 
    "title": "Mobile and Web Rapid Prototyping - interaction, animation", 
    "price": "35.00", 
    "instructors": "Adria Jimenez", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/241916_b21a_9.jpg", 
    "course_url": "https://www.udemy.com/learn-quartz-composer-origami/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-12T05:58:21Z"
}