{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Course updated on 9th June</strong></p>\n\n<p>Join more than <strong>700 students</strong> in this course to learn how to easily and quickly prototype, add interaction and animate your mobile and web designs with <strong>Facebook Origami</strong> and <strong>Quartz Composer</strong> without coding.</p>\n\n\n\n\n\n<p>This course teaches you step by step how you can use Origami to create prototypes and add animation to your designs. If you already tried to read the documentation on the website and you find it quite confusing, then this course is for you.</p>\n\n\n\n\n\n<p>With this step by step course with the full explanation of how you can use the different patches and how you can combine them to create the animation or the interaction, you were looking for. All the lessons include downloadable material that you can download and play with.</p>\n\n\n\n\n\n<p>Forget about other tools or coding, Origami and Quartz Composer are the tools to use if you are a visual person.</p>\n\n\n\n\n\n<p><strong>Learn how to use quickly Origami by following my method</strong> and be ready to create designs, interactions and animations fast and in a very easy way.</p>\n\n\n\n\n\n<p>Join the new era of designers, start showing your designs with interactions and animations and look at your clients reaction!</p>\n\n\n\n\n\n<p>The course includes all you need to know from beginning to end.</p>\n\n\n\n\n\n<p>This course is targeted for designers, UX, freelancers, developers or all kind of people that would like to design, prototype or add interaction in an easy and up to date way.</p>\n\n\n\n\n\n<p>Don't lose more time with static designs and join the animation and interaction era.</p>", 
    "end_date": null, 
    "title": "Origami 2.0 add interaction and animation to your designs", 
    "price": "45.00", 
    "instructors": "Adria Jimenez", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/442916_63cf.jpg", 
    "course_url": "https://www.udemy.com/origami-quartz-composer-animation/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-03-09T17:25:08Z"
}