{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Have you ever grabbed the pen tool, clicked and clicked but couldn’t understand what this tool is really about?</p>\n\n<p>Have you ever thought ”Why isn’t this working?”\n\n  </p>\n\n<p>And aren’t you tired of all those tutorials that just tell you that if you click like this you’ll get this and if you click like that you will get something else? \n\n  </p>\n\n<p>Now you have the opportunity to <strong class=\"redactor-inline-converted\">finally learn the Pen Tool</strong> the right way.\n\n  </p>\n\n<p>So if you’re:\n\n  </p>\n\n<ul><li>just starting out and want to set yourself on the right track to professional graphic design,</li><li>or you’ve been around for a while, but got finally fed up with the pen tool, ‘cause you’ve found it too difficult to learn,</li></ul><ul><li>or you are really into creating your custom, beautiful typefaces and illustrations,</li></ul>\n\n\n\n\n\n<p>you’ve found the right course for you.\n\n  </p>\n\n<p>Because in here you will find <strong class=\"redactor-inline-converted\">only the practical skills</strong> required to use the Pen Tool professionally and effortlessly.\n\n  </p>\n\n<p>But you will get more than that: say goodbye to all your frustrations and disappointment you can often get when watching tutorials that get you nowhere. \n\n  </p>\n\n<p>This is an <strong class=\"redactor-inline-converted\">in-depth course</strong> that will make you use the Pen Tool and its siblings with a smile, not because you feel you have to. \n\n  </p>\n\n<p>And as always you are totally covered by a <strong>100% 30-day money back guarantee</strong> should you have any second thoughts.\n\n  </p>\n\n<p>So the only risk here is you spending more hours on trying to make the Pen Tool work like you expect it to.\n\n  </p>\n\n<p>So hop onboard and join the happy community of students who have already experienced my teaching method: simple, straight to the point and with a smile.\n\n  </p>\n\n<p>See you inside!</p>", 
    "end_date": null, 
    "title": "Pen Tool : Master Pen Tool In Illustrator and Photoshop", 
    "price": "20.00", 
    "instructors": "Adobe Certified Expert Dawid Tuminski", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822648_b3b3_4.jpg", 
    "course_url": "https://www.udemy.com/pen-tool-pen-magnetic-pen-tool-illustrator-photoshop-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-15T08:49:55Z"
}