{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Hi, I'm Marouane, industrial designer originally from Stockholm, Sweden, now living and working in South Florida. <strong>Welcome to my class on perspective sketching!</strong></p>\n\n<p><br><strong class=\"redactor-inline-converted\">What's the course about? </strong><br>Many of us have seen the conventional way of sketching in perspective. Whether it's 2-point or 3 point perspective, they ALL follow certain rules. In this class, <strong class=\"redactor-inline-converted\">I'm going to show you a completely different way of perspective sketching that I think you will like.</strong> We are also going to cover how to unblock a sketchers block and boost your creativity.<br><br>I like to get to the point as quickly as possible and when it comes to sketching. I like to jump right into sketching the product or object instead of setting up an entire grid system of perspective guidelines. <br><br>I want to show you a technique I've been using for years now. Something I call \"Cloud sketching\". <strong class=\"redactor-inline-converted\">It's about turning your sketches and designs into \"clouds\" on the paper, capture the proportions and perspective with the help of ellipses and simple geometries.</strong> No grid system necessary. </p>\n\n\n\n<p><br>Once this is done, we can start to add the details and really design our \"cloud\" into whatever we intended it to be. Sounds strange? It will all make sense inside the course, I promise.</p>\n\n\n\n<p><br><strong class=\"redactor-inline-converted\">Who is this course for?</strong><br>This course is for anyone interested in drawing or sketching. <strong class=\"redactor-inline-converted\">It suits beginners who are just starting out with drawing as well as experienced designers and artists.</strong> I think there's something in this class for everyone, if you keep an open mind.<br>Thank you for taking interest in my course, I hope to see you inside.</p>\n\n\n\n<p><br>Your instructor,<br>Marouane<br></p>", 
    "end_date": null, 
    "title": "Perspective Sketching the Easy Way: From Coffee Cups to Cars", 
    "price": "40.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/805670_6e2c_3.jpg", 
    "course_url": "https://www.udemy.com/perspective-sketching/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-27T22:24:00Z"
}