{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Photoshop is the most powerful software for every Photographer, Retoucher and most of graphic designers. Once You learn it, it'll will bring Your work to the new level.</p><p>This course allows You to learn it fast, and understand the most common techniques in photoshop for universal work.</p><p>In this 5 hours long course, I will show you everything you need to know about photoshop for your future work. You will learn about the most common tools and know which tools are the best for the specific tasks. You will learn about amazing Plug-in like camera raw, and then jump straight into the layers - the most important thing to understand in Photoshop. </p><p>I will share with You the techniques that going to make your photoshop work quicker and much more fluent. Except the theoretical knowledge this course is giving you, the biggest value of this lecture is its practical background. All of the work - weather it's selection tools, retouching tools, layers and adjustments I am going to show You this on the real work examples.</p><p>My mission is to learn You simple and creative techniques in Photoshop, to show You different ways of resolving your problems or doubts - just to achieve desire results by You.</p><p>By the end of this class You will be much more confident about photoshop, and I am sure it'll bring you some of the creative ideas, for your very own work. And the appearing future problems - won't be really a problems.</p><p>Take the control of Your work now!</p><p>Marcin,</p><p><br></p>", 
    "end_date": null, 
    "title": "Photoshop Explained! - Complete Photoshop CC Course", 
    "price": "20.00", 
    "instructors": "Marcin Mikus", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/603600_14e7.jpg", 
    "course_url": "https://www.udemy.com/photoshopessentials/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-05T23:26:21Z"
}