{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Das Photoshop-Training für Fotografen! Maike Jarsetz zeigt Ihnen, wie Sie mit Photoshop noch bessere Bilder erhalten. Setzen Sie da an, wo Lightroom aufhört: Professionelle Beautyretusche, Perspektivkorrekturen, Freistellung und Fotomontage, Modellieren mit dem Verflüssigenfilter und vieles mehr. Für alle Foto-Genres bietet die Profifotografin jede Menge Praxistipps: Porträt, Architektur, Landschaft, Stilllife und mehr. Im Mittelpunkt stehen alle Aufgaben, die Fotografen an eine gute Bildbearbeitung stellen – hier lernen Sie, wie Sie Ihre Bilder auf den Punkt bearbeiten. Mit vielen Praxistipps zu HDR, Bildlooks und RAW-Entwicklung mit Camera Raw.</p><p>- Der Photoshop-Kurs für alle Fotografen – Tipps und Tricks von der Expertin</p><p>- Techniken für alle Foto-Genres: Porträt, Stilllife, Architektur, Natur und mehr</p><p>- Wenn Lightroom an die Grenzen kommt: Beautyretusche, Perspektivkorrektur, Digitale Chirurgie, Fotomontage...</p><p>Maike Jarsetz ist ausgebildete Fotografin und arbeitet als selbstständige Trainerin, Designerin und Beraterin im Bereich Fotografie und Fotodesign für namhafte Firmen wie Adobe, Wacom und Data Color. Zu ihren Kunden zählen unter anderem Firmen wie Digital Vision, Getty Images sowie Druckereien, Agenturen und Fotografenverbände. 2010 initiierte sie zum ersten Mal die Hamburger Photoshop- und Lightroom-Tage. Maike Jarsetz ist Adobe Certified Expert für Photoshop.<br></p>", 
    "end_date": null, 
    "title": "Photoshop für Fotografen – Der Weg zu perfekten Fotos", 
    "price": "40.00", 
    "instructors": "Rheinwerk Verlag", 
    "commitment": "11 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/695012_dc7a.jpg", 
    "course_url": "https://www.udemy.com/photoshop-fuer-fotografen-der-weg-zu-perfekten-fotos/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-11T18:26:24Z"
}