{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>December 2015: ANOTHER HOUR OF CONTENT ADDED! This covers the newest version of Photoshop - CC 2015.1</strong><br><strong></strong></p><p><strong>NEW! ONE HOUR OF CONTENT ADDED IN NOVEMBER 2015.</strong><strong></strong><strong></strong><br></p><p>Photoshop for beginners is an absolute must-have for everybody who works with a computer. This course teaches you how to use Photoshop with confidence in all sorts of situations <strong>without having any previous knowledge of the program</strong>.</p><p>The content breaks down Photoshop into easy to understand sections and the difficulty is progressive: we start with the basics and work our way up. Everything you learn is based on real world cases with exercices, quizzes, and attachments included for every lecture.</p><p><strong>Course features:</strong></p><ul><li>Learn by working on real world cases, no boring theory;</li><li>Massively improve your Photoshop skill level and speed;</li><li>Work along with me - all the required materials are attached to every lecture;</li><li>Excellent sound and video quality recorded at Full HD 1920x1080!</li><li><strong>All future updates will be available for free!</strong></li></ul><p>At the end of this course you can expect to have a strong graps of Photoshop's tools, interface, selections options, lots of image manipulation and enhancement techniques, working with layer styles and much more!</p><p>The training material is based on the latest version of Photoshop, yet all the content is version independent. This means you can easily follow along even though you may have an older version of the program (the minimum is CS4).</p><p><strong>Some of the covered topics:</strong></p><ul><li>How to get Photoshop and the differences between each version</li><li>Layers and the layers panel explained inside and out</li><li>Great, effective tips on how you can speed up your workflow</li><li>Moving around freely in Photoshop: zooming, switching through tabs, importing, exporting images, the works;</li><li><strong>Working with text</strong> in all sorts of ways, from creative effects to serious typography</li><li><strong>Image manipulation and enhancement</strong>: whiten teeth, remove blemishes, color correction, creative effects, lighten images, sharpen colors, adjust silhouettes, and much, much more</li><strong></strong><li><strong>Selections</strong>: from simple cases all the way up to complex images that need to be cut out perfectly – all the selection tools will be covered: the marquee tool, the lassos, the quick selection tool, the magic wand, everything!</li><li>Working with <strong>shapes</strong>: master them to gain Illustrator-like freedom</li><li><strong>Smart Objects</strong> – everything you need to know about them</li><strong></strong><li><strong>Brushes</strong>: how to get them, how to use them and when not to use them</li><li>Cropping, masking, layer styles, resizing an image and much, much more.</li></ul><p>I've succesfully taught more than 40,000 students so you have my guarantee that you'll love the content, the audio &amp; video quality, the pace of the material, and you'll finally learn Photoshop by having fun!</p>", 
    "end_date": null, 
    "title": "Photoshop for beginners", 
    "price": "20.00", 
    "instructors": "Cristian Doru Barin", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/527858_b368_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-14T08:11:00Z"
}