{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">Photoshop Professor Notes - Adobe Camera Raw &amp; Bridge</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Understanding the Raw Workflow ...</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Section 1</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 1: Adobe Camera Raw: A Brief Overview</strong>  </p>  <p style=\"\">  \t  Understanding what Camera Raw is or what a Raw file is and why it is different from a JPEG file important to know especially since you have spent all that money on a camera that is capable of shooting in that file format. A JPEG file is processed in side the camera at the moment you take the picture and because this file format is a compression format, you loose some of the quality right away. Shooting in the Raw format maintains all of the image quality but requires that you process the images on your computer. One of the major benefits of shooting Raw is that you can re-process that file again and again, differently each time without ever changing or destroying the original Raw file. Another benefit is if you shoot a traditional bride &amp; groom and for some reason you over expose the bride’s dress, in JPEG that dress is blown out and the detail can never be retrieved but in Raw, we can recover up to 2 full f-stops of over exposure revealing the previously post details in the bride’s dress.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 2: Understanding the difference Between 8-bit Images and 16-Bit Images</strong>  </p>  <p style=\"\">  \t  Our cameras capture Raw files in either 12 or 14-bit and Photoshop can process these images in 16-bit mode which allows us to work with much more detail than just 8-bit mode. What does that mean to you? Well, the over exposure scenario presented in the previous lecture is one example and another is that you can shoot in dimly lit places and actually end up with a decent looking image. The dim photo can be brought back to life (lightened up significantly) in the same manner as the over exposed file can be recovered. This means that you can shoot in hockey arenas and school gyms and get much much better results than ever before.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 3: The Camera Raw Interface</strong>  </p>  <p style=\"\">  \t  The Camera Raw interface can be somewhat daunting at first look but understanding what all those buttons and sliders are for and the proper order to use them in can and will take any fear out of using it. Not all sliders are needed for all images and once you figure out which sliders you need, you’ll be in and out in no time.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 4: Adobe Camera Raw: The Camera Calibration Tab</strong>  </p>  <p style=\"\">  \t  This should be one of the first tabs rather than one of the last tabs ... In my humble opinion, the choices made here effect every other choice you make regarding adjusting your images and probably should be the first tab or maybe even in the Workflow Options dialog box.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 5: Adobe Camera Raw: Explaining the Differences Between Process version 2012, 2010 &amp; 2003</strong>  </p>  <p style=\"\">  \t  In this lecture I show you how far we’ve come in processing digital images. What this means to is that in a few years from now when newer versions of the software are on the market, you can revisit some of your favorite images and because the software is better, you’ll be able to process the image(s) with better results. It just keeps getting better and better every time or at least we hope.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 6: Adobe Camera Raw: Setting Your White Balance</strong>  </p>  <p style=\"\">  \t  Okay, let’s get into this White Balance stuff. By default, the very first time you open your image in Adobe Camera Raw, the White Balance option in the drop down is always set to “As Shot”. Which means whatever your camera was set to. If you happen to have set the incorrect White Balance setting, this is where we can change this.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 7: Adobe Camera Raw: The Basics - Part 1 of 2</strong>  </p>  <p style=\"\">  \t  If you happen to have set the incorrect exposure in your camera when out shooting we can fix that here in the Basics Tab as long as the mistake was not too terribly off. In this first portion of the Basics Tab we can also adjust contrast as well.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 8: Adobe Camera Raw: The Basics - Part 2 of 2</strong>  </p>  <p style=\"\">  \t  In this second section of the Basics Tab we have the opportunity to adjust the colour by play with the Vibrance and Saturation of your image so if you think your image is lacking in eye popping colour, then this is one place to fix that.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 9: Adobe Camera Raw: The Tone Curve Tab</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>If the Contrast slider in the Basics Tab doesn’t give you the contrast that you are looking for then you can make further adjustments, lightening or darkening your image using this Tone Curve Tab. You may find that you never have to use this Tab at all. It all depends on how you shoot and the make and model of your gear.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 10: Adobe Camera Raw: The The Details Tab - Part 1 of 3</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>The Details Tab is where you can reduce that awful digital noise that tends to show up when you really under expose your pictures. You can also sharpen the details in your photos by playing with the sharpen sliders.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 11: Adobe Camera Raw: The The Details Tab - Part 2 of 3</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>In this details tab we go over a few examples of how best to use these sliders to either sharpen your images or attempt to get rid of the digital noise.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 12: Adobe Camera Raw: The The Details Tab - Part 3 of 3</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>I spend three lectures on this topic because I feel that there is so much potential to ruin your images if not used properly. Your images will look amazing and all of your friends and family will ask you what kind of camera you are now using ....  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 13: Adobe Camera Raw: The HSL/Greyscale Tab</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Have you ever wanted to work on just the reds and oranges in that sunset photo to make all of your friends envious of your photos? Yes, you have. How about making those blue eye bluer or green eyes greener. This is the place to do that kind of thing. You can even make your image a black and white image and then go back and play with the colour sliders to make the image even more dramatic.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 14: Adobe Camera Raw: The Split Toning Tab</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Split toning is a throw back from the wet darkroom days where you could add a cool tone to say the shadows or add a warm tone to the highlights or do both. In order to tone your photographic prints you would have to use some very strong smelling chemicals in a well ventilated room. Doing it in the digital darkroom, Photoshop, takes all of the health risks out of the equation.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 15: Adobe Camera Raw: The Lens Correction Tab</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>Have you ever taken a close up photo of people with your lens set to “wide angle” and then noticed that the people on the ends are distorted? Well, you can get rid of most if not all of that distortion here.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 16: Adobe Camera Raw: The Effects Tab</strong>  </p>  <p style=\"\">  \t  In this Effects Tab you can add a vignette to your photos. You can also add some grain to your images for that retro look and feel.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 17: Adobe Camera Raw: The Presets Tab</strong>  </p>  <p style=\"\">  \t<strong style=\"\"></strong>The Presets Tab is where you create those “one click does all” buttons. Say  you find that you always sharpen a certain amount and that you always move e noise reduction slider to the same spot, well if this is something you do over and over again, why not create a Preset which contains both of these adjustments so all you would have to do is select your images and click the preset, once, to apply both the sharpening and noise reduction to all of your selected images. This is a real time saver.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 18: Adobe Camera Raw: The Snapshots Tab</strong>  </p>  <p style=\"\">  \t  Have you ever played with an image and you get to the point that you think you are done and then decide to play around some more? Sure you have. And I am sure you have wanted to go back to the previous “look” to compare this to that. Well, snapshots is the way to do that and here is where we talk all about it.  </p>  <p style=\"\">  \t<strong style=\"\">Section 2</strong>  </p>  <p style=\"\">  \t<strong style=\"\">An In-depth look at Adobe Camera Raw’s Editing Tools</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 1: Adobe Bridge: Importing Your Images</strong>  </p>  <p style=\"\">  \t  We all have our own method of importing the images from our digital cameras which is either to attach our camera to our computer and download from the camera or copy the images from our CF or SD Card to our Pictures folder and go from there. But what if I were to show you a way to to do this more efficiently with a small helper application that comes with Bridge? Would you use it? Sure you will.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 2 through 6: Adobe Camera Raw: The Editing Tools - Part 1 - 5</strong>  </p>  <p style=\"\">  \t  Have you ever wanted to make an adjustment to just one small area in your Raw file? Have you ever wanted to make the same change in many places in your image? Up until now all of the adjustments we have made have been what we call global adjustments - in other words, the complete image has been affected. Now you will learn how to make selected adjustments with ease. After learning this, you may never need to go into Photoshop for basic editing ever again.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 7: Adobe Camera Raw: Saving and Exporting Your Raw Files</strong>  </p>  <p style=\"\">  \t  This lecture deals with the many options that are available to us for saving our files. Frankly many of the options are confusing at first but after this lecture you’ll have a better understanding of the differences we are given.  </p>  <p style=\"\">  \t<strong style=\"\">Section 3</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Using Bridge and Automating Your Workflow</strong>  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 1: Adobe Bridge: Folder Management</strong>  </p>  <p style=\"\">  \t  If you are like a lot of digital photographers whether you are a casual shooter or pro shooter, I know you have images all over your computer. This lecture discusses some options to help you clean up the clutter.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 2: Adobe Bridge: Working with Collections</strong>  </p>  <p style=\"\">  \t  Have you ever wished you could only see the important images in your folder as opposed to every single one including the ones you don’t like as much as the good ones? Well, learning how to effectively use Collections will help you work through the many hundreds or even thousands of images you take.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 3: Adobe Bridge: Adding Metadata</strong>  </p>  <p style=\"\">  \t  Metadata is information. Information about you the photographer. It is important to add this so people know who owns the image(s) and how to get in touch with you. Even if you are not a pro, you need to add this info sooner rather than later.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 4: Adobe Bridge: Importing Keywords</strong>  </p>  <p style=\"\">  \t  Information abut your images like names and events. Adding this information when you first import your images is probably the most difficult task to force yourself to do but yo really should do it. If this is done at the beginning of the lifecycle of your images, you will save lots of time in the future when trying to locate a specific image.  </p>  <p style=\"\">  \t<strong style=\"\">Lecture 5: Adobe Bridge: Automating Using Image Processor</strong>  </p>  <p style=\"\">  \t  Have you ever wished that you could just get a whole folder worth of images processed in just a few clicks? If so, this is the lecture for you.  </p>", 
    "end_date": null, 
    "title": "Photoshop Professor Notes - Adobe Camera Raw and Bridge", 
    "price": "35.00", 
    "instructors": "John Warren", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/44677_9318_10.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cs6-adobe-camera-raw-and-bridge/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-04T11:55:45Z"
}