{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  Photoshop is one of the best tools, so learn it with this Photoshop Web Design Tutorial!    </p><p style=\"\">I have been using  Photoshop since version 3 and every time it gets better and better. I have  created litterally thousands of designs and over that time I have found that  there are number of key skills and tools us web designers use in almost every  design. This is why I created, along with the team at Web Courses, a series of  screencast tutorials ideal for beginner web designers who wants to Learn Web Design with Photoshop.</p>  1. The Power of File and New      <br style=\"\">      <p style=\"\">In this lesson, you will learn how to open a new document and apply the settings you need to set up before you start designing in Photoshop.</p>  <br style=\"\">    2. Changing, Using and Installing Brushes      <br style=\"\">      <p style=\"\">A look at paintbrushes. The different types of brushes that you can use as well as installing some new brushes, so you can do some really nice affects on your design.</p>  <br style=\"\">    3. The Key to Custom Shapes      <br style=\"\">      <p style=\"\">Shapes is something we use a lot when we&#039;re designing a web page. It&#039;s used to make the layout and lots of other elements on the screen. We get used to this really useful tool in this lesson.</p>  <br style=\"\">    4. The Core of Photoshop, Layers and Groups      <br style=\"\">      <p style=\"\">Layers are the most important part of Photoshop, as they allow you to make changes to specific areas on the screen. You can further group these layers together to make it more manageable when you&#039;re designing.</p>  <br style=\"\">    5. The Shortcuts to Moving and Resizing      <br style=\"\">      <p style=\"\">In this lesson we&#039;re going to be looking at how to move layers around the screen and how to resize them using the free transform tool, something you will use a lot in your designs.</p>  <br style=\"\">    6. Getting the Most from Zooming and Panning      <br style=\"\">      <p style=\"\">We are going to look at how to look around your design and see the details by using the zoom tool. So in this lesson we look into two very important features of using Photoshop daily, zooming and panning.</p>  <br style=\"\">    7. Creating Cool Effects with Blending Modes      <br style=\"\">      <p style=\"\">Blending modes are when you have two layers interacting with each other and effects are different things you can apply to single layer, things like shadows, inners shadows, gradients etc.</p>  <br style=\"\">    8. Text, Love it or Hate it      <br style=\"\">      <p style=\"\">Texts are one of the trickiest things in Photoshop, reason being that its not really made to do it. So in this lesson, we&#039;re going to find easy ways to work with Photoshop and texts.</p>  <br style=\"\">    9. Clean Web Page Design using Photoshop      <br style=\"\">      <p style=\"\">We are going to be creating a webpage design in Photoshop. We are going to use grids to organize everything and get things in line and various other tricks to make the perfect web page.</p>", 
    "end_date": null, 
    "title": "Photoshop for Web Design Beginners", 
    "price": 0, 
    "instructors": "Mr Carl Heaton", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/15639_13f2_6.jpg", 
    "course_url": "https://www.udemy.com/photoshop-for-web-design-beginners/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-03-28T19:25:54Z"
}