{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>High End</strong> Retouching is one of the most time consuming work in Photoshop. You can see results of such a work in magazines, billboards with a main destination to promote desired product.</p>\n\n<p>In this course we are going to learn High End retouching on hair level. Hair retouch is slightly different than skin, it requires a lot of precise work as well as way of using specyfing retouching tool is slightly different. From my own education experience I know how many people were asking about hair retouching, that is why I decided to come with this course focused on Hair - which are the biggest struggle for every photographer and retoucher.</p>\n\n<p>In This Photoshop Retouching course You are going to learn all basic retouching tools, and after that we are going to adjust these retouching tools to the specific tasks for hair retouching. I am going to show You how to use healing brush and clone stamp for hair retouching.</p>\n\n<p>After this You will learn some other experimental techniques to apply totally new hair to You image, as well as how to adjust colors and shadows of the hair in such a cases.</p>\n\n<p>Walking through Dodge &amp; Burn process we are going to end up this course with Color adjustments which are going to give to final punch to Your images!</p>\n\n<p>Enjoy the course!</p>\n\n<p>Marcin</p>", 
    "end_date": null, 
    "title": "Photoshop CC: High End Hair Retouching in Photoshop", 
    "price": "20.00", 
    "instructors": "Marcin Mikus", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/840384_5a77.jpg", 
    "course_url": "https://www.udemy.com/high-end-hair-retouching/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-05T12:52:24Z"
}