{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis is Volume 2 of 5 in my “Photoshop - Beginners to Intermediate” series. I have developed this series over many years of teaching at both the College and University levels in a variety of departments including the Multimedia Program, Graphic Design Program, the Fashion Program, and the Creative Photography Programs both daytime and evening diploma and certificate programs. These courses in Adobe Photoshop (Volumes 1 through 5), start right at the very beginning assuming that the learner has no experience in using the application.  </p>  <p>  \tFirst of all, why would you ever need to make a selection? Well, if you have ever wanted to make a change in your image on a specific part of the image, one of the easiest ways to do that is with a selection. You see, selections allow you to isolate areas that you want to make a change in and protect the other areas from that change. Learning how to use all of the selection tools properly will allow you to make these changes to your images so your viewers won’t know you did anything to your image.  </p>  <p>  \t<strong style=\"\">Lecture 1: The Rectangular and Elliptical Marquee Tools</strong>  </p>  <p>  \t Knowing how to use these selection tools will assist you in making great selections. Have you ever wanted to make a selection of a square object in your image(s) but were not successful? Knowing how to modify the Rectangle Marquee selection in order to create a perfect square is just one thing you’ll learn in this volume. have you ever wanted to enhance or modify the moon (or any other circular object) in one of your images? Knowing how to modify the Elliptical Marquee selection tool will allow you to make these changes in an undetectable way to your viewers.  </p>  <p>  \t<strong style=\"\">Lecture 2: The 3 Lasso Style Selection Tools</strong>  </p>  <p>  \tProbably one of the most often used selection tools is the Lasso Tool. The main Lasso Tool is what we call a “free hand style” drawing tool. Just click and drag around the area that you want to change. But what if you wanted to select an object that has straight lines and curved lines? Or what if your hands are not as steady as you would like but you still need to make a selection - try the magnetic lasso tool.  </p>  <p>  \t<strong style=\"\">Lecture 3: The Selection Brush and the Magic Wand Tools</strong>  </p>  <p>  \tThe Selection Brush is relatively new to Photoshop. Not everybody fully understands how to use this selection tool, but you will. the Magic Wand Tool is probably the absolute most used selection tool in Photoshop. In this lecture I will show you how to fully use it for amazing results.  </p>  <p>  \t<strong style=\"\">Lecture 4: Adding to and subtracting from a Selection</strong>  </p>  <p>  \tWhat if your selections are not perfect on the first attempt and you need to add some more to the selection or take away some of it. This lecture will teach how to modify your selections by adding some more to your current selection or by taking away some of the stray areas that should not be part of the selection.  </p>  <p>  \t<strong style=\"\">Lecture 5: Modifying your Selections</strong>  </p>  <p>  \tMore on modifying your selections. Creating that transitional edge between the part that is selected and the part that you want to protect from your changes is critical to making believable enhancements. What if your selection is the right shape but it is too large or too small. You will learn how to manage these situations with your selections in this lecture.  </p>  <p>  \t<strong style=\"\">Lecture 6: The Refine Edge Feature</strong>  </p>  <p>  \tYears ago we had this great feature in Photoshop called the Extract Tool which would allow us to extract say a person from an image so we place that person in another image easily. Well, that tool has been replaced by the Refine Edge Tool and it is really amazing to use. As it’s name indicates, it allows you great flexibility in refining the edges of your selections.  </p>  <p>  \t<strong style=\"\">Lecture 7: Making Selections Based on Colour</strong>  </p>  <p>  \tA quick and easy way to make selections in your images can be to base that selection on colour. In this lecture you will learn how to say, select a blouse or pair of slacks in order to change their colour or brightness making that selected object either darker or lighter.  </p>  <p>  \t<strong style=\"\">Lecture 8: Select and Fill in Just One Click</strong>  </p>  <p>  \tThe paint bucket tool has had a bit of a facelift in recent versions of Photoshop and understanding how and when to properly use this selection tool in what you will learn in this lecture.  </p>", 
    "end_date": null, 
    "title": "Photoshop Professor Notes - Volume 2 -  Great Selections", 
    "price": "20.00", 
    "instructors": "John Warren", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169418_ad74_4.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cs6-making-great-selections/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T03:44:53Z"
}