{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong style=\"\">Photoshop Professor Notes - Volume 3</strong>  </p>  <p>  \t<strong style=\"\">Understanding Layers ...</strong>  </p>  <p>  \tThis is Volume 3 of 5 in my “Photoshop - Beginners to Intermediate” series. I have developed this series over many years of teaching at both the College and University levels in a variety of departments including the Multimedia Program, Graphic Design Program, the Fashion Program, and the Creative Photography Programs both daytime and evening diploma and certificate programs. These courses in Adobe Photoshop (Volumes 1 through 5), start right at the very beginning assuming that the learner has no experience in using the application.  </p>  <p>  \tAs a fundamental concept of Photoshop since version 3 (not CS3 but version 3), Layers are probably one of the most flexible ways to work in Photoshop as far as editing our images is concerned.  </p>  <p>  \t<strong style=\"\">Lecture 1: Let’s look at some Layers - An Overview of Layers</strong>  </p>  <p>  \tIf you don’t already know what Layers are in Photoshop, this lecture will enlighten you to the fact that Layers are an integral part of any photoshop image and are used extensively in creating collages, montages and in scrapbooking projects. For example, if you wanted to type some text in your image, such as “Happy Birthday” or “Congratulations”, you would do this on a separate layer from the image itself.  </p>  <p>  \t<strong style=\"\">Lecture 2: An In-depth look at Layers</strong>  </p>  <p>  \tIn this lecture we explain what the different kinds of layer there are in Photoshop. As  mentioned in Lecture 1, there are Type Layers as well as Adjustment Layers. Along with Adjustment Layers come Layer Masks. Layer masks help you hide portions of a layer.  </p>  <p>  \t<strong style=\"\">Lecture 3: Creating New Layers</strong>  </p>  <p>  \tAs with anything in Photoshop, there are approximately half a dozen ways to do something as this goes for getting new Layers into your image. Depending on what you are working on, you’ll want to choose one of the many ways there are to get that  new layer into your image file.  </p>  <p>  \t<strong style=\"\">Lecture 4: Drag ’n Drop and Copy ‘n Paste Layer Contents </strong>  </p>  <p>  \tThese are two methods used to bring parts of other images into your main image. They both have their pros and cons and understanding which method to use with the task at hand is really important. You’ll learn all of the ins and outs here.  </p>  <p>  \t<strong style=\"\">Lecture 5: Layer Groups</strong>  </p>  <p>  \tWhen you are working on a project that includes many layers in your image file, things can get a bit messy and disorganized but with Layer Groups we can keep a handle on this.  </p>  <p>  \t<strong style=\"\">Lecture 6: Adjustment Layers</strong>  </p>  <p>  \tSince you already kind of understand what Layers in Photoshop are, then moving on to adjustable layers should be a smooth transition. If you performed an adjustment to a normal layer and for example say you made a change to lighten the image using Levels, then these adjustments would be permanent because you made the adjustment to the actual pixels in that layer. If you used Adjustment Layers, which are basically mathematical calculations floating above your image, then you could go back and make more changes for as many times as you wish. Nothing is permanent with Adjustment Layers.  </p>  <p>  \t<strong style=\"\">Lecture 7: layer Styles</strong>  </p>  <p>  \tLayer Styles are the cool effects that you can apply to aspects of your image. say for example you did create that text I mentioned earlier, “Happy Birthday”. Well with Layer Styles you could add a drop shadow and a stroke to that text. There are others that can be applied as well and ... just like so many other things in Photoshop, these layer Styles are completely editable forever and a day.  </p>  <p>  \t<strong style=\"\">Lecture 8: Layer Masks</strong>  </p>  <p>  \tLayer Masks are very very cool. They offer a way to hide and show portions of a layer or for that matter a complete layer. All adjustment layers come with white layer masks by default. You paint with black on that Layer Mask to hide portions. Unlike using the Eraser tool which permanently removes the pixels, painting with black on layer masks only temporarily hides those pixels because you can just as easily paint back over that area with white to reveal those pixels again.  </p>  <p>  \t<strong style=\"\">Lecture 9: Layer Opacity and Fill Settings</strong>  </p>  <p>  \tLearning the differences between these two settings will make a large difference in your approach to designing your layouts in Photoshop. When I ask students if they know the difference between the two or to explain the differences, they go blank. It’s not difficult and once explained, it makes perfect sense. This is one of those topics that is better explained visually than with words.  </p>", 
    "end_date": null, 
    "title": "Photoshop Professor Notes - Volume 3 - Understanding Layers", 
    "price": "20.00", 
    "instructors": "John Warren", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169416_26d8_4.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cs6-understanding-layers/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T03:44:01Z"
}