{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">The idea behind <strong style=\"\">Photoshop Flyer Design Secrets</strong> is simple. You will learn how to use Photoshop to create designs that people pay for. The goal is to teach you how to use the tools to create the designs that you want to create.<br style=\"\"></p><p style=\"\">You will learn how to use Photoshops Tools, Menus, and Layers to create designs for print and web. You&#039;re going to learn the importance of image resolution and how to make designs of all sizes, from business card size up to poster size with ease. You will also learn how to use Photoshop&#039;s powerful selection tools to make accurate selections around complex images, even hair!</p><p style=\"\">This course contains video tutorials on how to use the tools and interface as well as a special section on how to create accurate selections in your images. Students will also learn how to use Photoshops &quot;Color Modes&quot; and how to make sure documents are &quot;Print Ready&quot;.</p><p style=\"\">In addition to the basic tutorials there are also several design walk-throughs in which the student gets to virtually look over the teacher&#039;s shoulder as he creates designs from scratch! You&#039;ll get to take advantage of the instructors 18 years of experience using Photoshop as a design tool.<br style=\"\"></p><p style=\"\">As a paid student of the course you will receive the <strong style=\"\">Flyer Design Secrets Revealed Industry Guide E-Book</strong> that is full of tips, tricks and resources for Photoshop designers, and includes: <br style=\"\"></p><ul style=\"\"><li style=\"\">Wholesale printing resources, <br style=\"\"></li><li style=\"\">Tips on finding images and illustrations, <br style=\"\"></li><li style=\"\">Learning how to use the right fonts, <br style=\"\"></li><li style=\"\">Understanding printers marks<br style=\"\"></li><li style=\"\"> &quot;The Money Making Flyer Design Formula&quot; that will teach you how to make a profit on every flyer you design for others!<br style=\"\"></li></ul>", 
    "end_date": null, 
    "title": "Photoshop Flyer Design Secrets", 
    "price": "25.00", 
    "instructors": "Keith Young", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/23427_1cbb_4.jpg", 
    "course_url": "https://www.udemy.com/photoshop-flyer-design-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-22T17:41:14Z"
}