{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Photoshop CC &amp; 6.  Master Adobe Photoshop CC &amp; be more productive, guaranteed (Photoshop for beginners). Everything you need to know about Adobe Photoshop CC is included in this extensive, 11+ hour training course. This training course is designed for beginners. You will learn Photoshop CC (works with Photoshop 6 too) from the ground up and no prior experience is required.</p><p><strong>RAVE REVIEW!  This testimonial (from my Lightroom course) sums up all the courses I provide...</strong></p><p>\"<em>The content of the course is perfectly structured and expertly delivered. The flow of the content builds knowledge and skills in a logical fashion. Chris has a really good presentation style. Of key importance, when students ask questions, Chris answers them in a thorough and comprehensive manner. Highly recommended. Regards.</em>\" ~ Mick</p><p><em>Please note;  This course was launched in January of 2016. Over 700 students signed up in the first month.  Plus, this course already has 10, 5 star reviews!</em><br></p><p>Follow along with the included files and learn how to edit like a pro. Plus, each lesson is broken down into small segments to help you stay focused.</p><p><strong><em>You will learn and master...</em></strong></p><ul><li>Adobe Camera Raw - everything you need to know to edit your photos like a pro</li><li>Layers - learn how to use layers and take your creativity to the next level</li><li>Being more productive - a must for a fast and productive workflow</li><li>Photoshop basics - a solid foundation for your journey with Photoshop CC</li><li>Adobe Bridge - to organize and streamline your workflow</li><li>Working with color in Photoshop CC - a must for a fast productive workflow</li><li>Layer styles - how to style your layer elements for added creativity</li><li>Blending modes - I refer to these as “creative modes”. Learn how these can take your creativity to the next level</li><li>Adjustment Layers - a must for a fast productive workflow</li><li>Vectors - how to create vectors in Photoshop CC</li><li>Clone + Heal - 2 exceptional tools for re-touching your photos, like a pro</li><li>Crop, Straighten + Perspective - 3 more tools for editing your photos</li><li>Convert to B&amp;W - Learn how to properly convert like a true artist</li><li>Photoshop Filters - How to use and apply Filters for extra creativity</li><li>Actions - increase your productivity by learning how to make your own actions. Plus, tips and techniques for running your actions</li><li>Levels + Curves - 2 tools that pros use to edit</li><li>Brushes - all about brushes to help you master your editing. Plus, creative techniques too.</li><li>Typography - time saving tips and techniques for applying text to your documents</li><li>Output - what you need to know before outputting your files</li><li>Selection Techniques - learn all the tools for making selections and know which ones to use when</li><li>Edit like a pro - covering all the tools to edit directly in Photoshop, like a pro</li></ul><p>plus, much, much more… as a photographer and graphic designer for the past 25 years, I’ll share with you additional time saving tips and techniques to get the most out of Photoshop CC. </p><p><em><strong>RAVE REVIEWS</strong></em></p><p><strong>by May Ann Reyes</strong></p><p><em>A+++ Tutorial. Recommended! </em></p><p><em>Every lecture discussed very well. It will help every student to become more creative and more productive. It is worth watching. Give it a try fellow learner :)</em></p><p><strong>by That Coder Guy</strong>,</p><p><em>Great course!</em></p><p><em>This is an amazing course and I recommend it for anyone who needs a basic understanding of photoshop.</em></p><p><strong>by Carrie-Anne Rouse</strong> </p><p><em>Great course!</em></p><p><em>Thank you so mush, really enjoyed this course, Helps me a great deal</em></p><p><strong>by David Burlison</strong></p><p><em>Wonderful learning experience </em></p><p><em>Chris has taught me a lot in this course. I highly recommend it.</em></p><p><strong>by Jane Craiglee</strong></p><p><em>Comprehensive </em></p><p><em>Good introduction. Some problems with sound quality from lecture 49 onwards. </em><strong>(Student feedback.  This issue was fixed within the hour).</strong></p><p><strong>by Jason Lozon</strong></p><p><em>Photoshop Master!!!! </em></p><p><em>Super informative and very easy to follow. I couldn't stop once i got started. Will be looking for more courses from this professor. Thany you soooo much!!!!</em></p><p><strong>and much more...</strong></p><p>Once you’ve completed this course, you will have basic knowledge of Photoshop CC and all the tools available at your disposal. Adobe Photoshop CC is the worlds leading graphics editing and creation software. You’ll learn everything you need to know about this software to streamline your workflow and be more productive. Plus, you’ll know all the tools available to help you fulfill your creative vision. Learn faster by doing. Working files are included so you can follow along and practice the techniques given.</p><p>Plus, lifetime updates. When Photoshop is updated, the course will be updated too (no extra fee). Now that Adobe has switched to a subscription base they will be updating the software more than in the past.  Adobe has said there will be anywhere from 2-3 new updates per year.</p><p>I highly encourage student participation too.  Have a course related question?  I love questions and ask that any questions are posted in the discussion forum.  This way other students can learn from your question too.  Plus, I'd love to see how you applied what you learned.  Post some before and after files in the discussion forum just for fun or ask for CC.  I'll answer any questions as quickly as possible.</p><p>I'm working on the course to make it even better.  Have a suggestion?  If so, please send me a private message and I'll try to implement as soon as possible.</p><p><br></p><p>At some point, the Udemy system will ask you for a review about this course. Please understand that it is Udemy asking and not me (Chris Parker, your instructor). I do not agree with asking for a review so early (it's out of my control) in the course and ask that if you're not ready to give a review, please do so only when you're ready. I appreciate all feedback and use it to improve my courses.</p><p>I Hope your enjoying the course thus far. Please contact me anytime for additional questions/support. I'm here to help you achieve your learning goals and looking forward to your success.</p><p>Yes, I really do care AND answer ALL questions. :)</p>", 
    "end_date": null, 
    "title": "Photoshop CC, Master Photoshop For Beginners  ", 
    "price": "50.00", 
    "instructors": "Chris Parker", 
    "commitment": "11.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/697570_8598_4.jpg", 
    "course_url": "https://www.udemy.com/master-adobe-photoshop-cc-6-be-more-productive/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-14T22:00:04Z"
}