{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Join 2600++ students and start using Photoshop Actions and Plugins!</strong></p>\n\n<p><strong></strong><em>Latest: Bonus lecture about Conditional Actions was added!</em></p>\n\n\n\n<p>This course is designed to help you spend less time editing pictures. We will learn how to automate repeatable routine operations in Adobe Photoshop by creating actions, installing helpful plugins and running them for the set of pictures.<br>We will start with basics: how to open and create action in Photoshop and how to run your action for the package of 10, 100 or 1000 pictures.  It will be the great starting point, and you will achieve great results immediately in Section 2. Then we will go deeper with actions – we will learn how to edit, save and load them. We will discuss why some of your actions may not work and why you get mistakes with some of the default Adobe actions. <br>Another great topic of this course is Adobe Photoshop plugins. We will learn how to find and install the most helpful of them. I will show you my favorite plugins that help me to correct skin, color and remove noise in automatic mode without creating and drawing layer mask.<br>And finally we will create some helpful actions together. All actions and pictures from this course, you will find in downloadable materials of Lecture 2. And don’t forget to create your own actions, try different approaches and master your skills. At the end of this course you will be able to create more and more complex actions, run them automatically and save tons of time!<br></p>", 
    "end_date": null, 
    "title": "Photoshop Actions and Plugins: automate your work!", 
    "price": "20.00", 
    "instructors": "Diana Kot", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/636946_8dd4_6.jpg", 
    "course_url": "https://www.udemy.com/make-adobe-photoshop-work-while-you-rest/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-10T21:13:38Z"
}