{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong></strong>  </p>  <p>  \t<strong>BEAUTY RETOUCHING – HOW TO GET THE PERFECT LOOK</strong>  </p>  <ul>  \t<li>More than 850 Students have enrolled already</li>  \t<li>Over 25+ Beauty Retouching lessons<em>\" Making Photoshop Fun &amp; Easy \"</em></li>  \t<li><em>All Lessons include step by step in video instructions!</em></li>  \t<li>35+ 5 Star Reviews from really happy &amp; satisfied students</li>  \t<li>Includes all raw &amp; psd files which you can profit from - <em>Instantly</em></li>  \t<li>No Prior Photoshop knowledge needed<em> \"Guaranteed\"</em></li>  \t<li>Full &amp; free lifetime access to the complete course</li>  \t<li>All future &amp; additional lectures will always be free of charge</li>  </ul>    <p>  \t<strong>Please Note: All Students to my \"Photoshop High End Beauty Retouching - Retouch Like a Pro\" course here on Udemy get full access to this course for free!</strong>  </p>    <p>  \t<strong>ARE YOU STRUGGLING WITH BASIC BEAUTY RETOUCHING?</strong>  </p>  <ul>  \t<li>AND MASSIVELY WANT TO IMPROVE IT?</li>  \t<li>AND DO IT EASILY AND INSTANTLY?</li>  \t<li>AND BE ABLE TO APPLY IT TO YOUR OWN IMAGES?</li>  \t<li>AND WITH NO PRIOR RETOUCHING KNOWLEDGE?</li>  </ul>  <p>  \t<strong>--------------------------- \" <em>Then this course is for you </em>\" -------------------------------</strong>  </p>    <p>  \t<strong>What This Course Entails:</strong>  </p>  <p>  \t                I will teach you how to get into Beauty Retouching, so don't worry if you don't have <strong>prior experience with Photoshop</strong> or other plugins. Follow my lead and I'll teach you to be good at it! <em>“Seriously\"</em>  </p>  <p>  \t<strong>All my </strong><strong>retouching instructions</strong> form part of a comprehensive guide that can help you to accomplish your goals by applying these techniques. During all the lessons you get to eavesdrop as I work, giving you some insight as to how I work and what I do.  </p>    <p>  \t<em>    The idea is to make basic beauty retouching look good and real!  </em>  </p>    <p>  \t                Whether you have <strong>previous experience with photoshop or not</strong>, it doesn't matter. Apply your knowledge for half an hour a day and you could be making huge improvements or even extra cash, just like me.  </p>  <p>  \t<em>\"And I'm not kidding when I say that you need nothing but Photoshop!\"</em>  </p>  <p>  \t                All future extra lectures and upgrades are always included for free. Unconditional Udemy 30 day money-back guarantee - that's my <em>personal promise of your success!</em>  </p>  <p>  \t                You'll learn  </p>  <ol>  \t<li>How to perfect intermediate level of beauty retouching</li>  \t<li>How to take your beauty retouching skills from basic to intermediate</li>  \t<li>Learn how to do quick but really good and clean skin retouching</li>  \t<li>Learn how to use dodge &amp; burn methods for basic beauty retouching</li>  \t<li>How to refine and be pixel perfect with beauty retouching</li>  \t<li>How to create a high key look in Photoshop</li>  \t<li>How to create a beauty glow look in Photoshop</li>  \t<li>How to retouch or touch-up make and color</li>  \t<li>How to create unique color grades</li>  \t<li>How to do final touch-ups, looks &amp; styles</li>  \t<li>How to use Photoshop in order to retouch your personal beauty work</li>  \t<li>How to tweak and adjust facial expressions / optimizing the body</li>  \t<li>How to be applying new skin and understand all advanced beauty tools</li>  </ol>  <p>  \t                ... and much, much more!  </p>    <p>  \t<strong>Intrigued yet? Then keep reading!</strong>  </p>  <p>  \t                As with all my courses: the initial low price will increase shortly. This one is currently <strong>$45</strong> and it will soon upgrade <strong>to $65</strong> so join in now! \"<em>You will have unlimited lifetime access at no extra cost\" </em>Not just that; <strong>all</strong> <strong>future additional lectures</strong>, <strong>bonus</strong><strong>es, etc</strong> in this course are always free.  </p>  <p>  \t                There's an unconditional, no-questions-asked full 30-day money-back guarantee!  </p>  <p>  \t                I'm known for always offering support on <strong>Udemy,</strong> so feel free to shout out if you're stuck or need assistance. <em>\"I'm here to help\"</em>  </p>  <p>  \t<strong>One final note:</strong>  </p>  <p>  \t                My goal is to teach you Beauty Retouching, so don't stress about not having worked in Photoshop before. <em>\"I do my best to make it simple, informative &amp; fun\"</em>  </p>    <p>  \t<em>    I've crammed all my basic beauty retouching knowledge into this course!  </em>  </p>    <p>  \t                After going through this course you'll be able to apply your new beauty retouching skills to <em>retouch any beauty images and make some extra cash along the way</em>.  </p>  <p>  \t                All you have to do is click on the <strong>\"take this course\"</strong> button on the top right corner. You have nothing to lose. In fact, you've got a lot to gain.  </p>  <p>  \t                Thank you,  </p>  <p>  \t    Manni  </p>", 
    "end_date": null, 
    "title": "Photoshop Beauty Retouching - How To Get The Perfect Look", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19582_d73c_13.jpg", 
    "course_url": "https://www.udemy.com/beauty-retouching-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-15T12:50:39Z"
}