{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A&nbsp;Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>    <p>Training Course Duration: 5 Hours - 55 Lessons</p>    <p>In this Photo Restoration training course from Andy Anderson, you will learn the art of restoring photos, using Adobe Photoshop. Andy is an Adobe Photoshop expert, and his entertaining teaching style makes learning what can be a complex topic, easy and fun. This video tutorial is designed for someone who already understands the basic tools of Adobe Photoshop, and wants to learn how to specifically apply those tools to restoring photos.</p>    <p>Andy starts this tutorial with the setting up your workspace. You quickly move on to learn some basic techniques for straightening your photo, removing red-eye and moving from grayscale to color. As you progress, you learn how to reassemble torn pictures, remove scratches, clean up stains, correct exposure, correct color, and repair and remove details. You will even discover how to add details to your pictures! Finally Andy introduces you to some finishing touches, such as vignetting and creating matts for your images.</p>    <p>By the conclusion of this computer based training video, you will be comfortable with the tools used in Photoshop to restore images, and have a clear understanding of how to correct and fix your own images. Working files are included to allow you to use the same files the author uses throughout this training course on Photo Restoration With Photoshop.<span id=\"pastemarkerend41867\"></span></p>  ", 
    "end_date": null, 
    "title": "Photo Restoration with Photoshop Tutorial ", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/22461_400a_9.jpg", 
    "course_url": "https://www.udemy.com/master-photo-restoration-with-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-08-07T23:27:46Z"
}