{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">*Don&#039;t let the price fool you.  This is a very valuable course.  After you are done with this course you should feel comfortable joining any intermediate or advanced level Photoshop courses on Udemy.</p><p style=\"\">*Voucher for $5 dollar Photoshop courses (intermediate and advanced) included with this course.<br style=\"\"></p><p style=\"\">*30 day money back guarantee (no questions asked)</p><p style=\"\"><strong style=\"\">Why This Course?</strong><br style=\"\"></p><p style=\"\">Maybe you&#039;ve been eyeing a sweet Udemy course about photo retouching, or perhaps digital painting, but your concerned because they are for intermediate skill level, and you know NOTHING about Phtoshop.  Well, you&#039;ve come to the right place!  Whether you are hoping to eventually be able to enhance your family photos, or to become a graphic design master, it doesn&#039;t matter, we all need to know the basics first.  That is why this course cuts through the crap, and focuses on Photoshop essentials, the stuff we all need to know regardless of the project.</p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">Photoshop CC Quick Start</strong> is meant to introduce you to the software very quickly, and give you a foundation that you can build on.  With these basic skills, and the ability to confidently navigate the UI and tool palettes, you will be able to expand your horizons into various different fields that use Photoshop.</p><p style=\"\"><strong style=\"\"></strong><strong style=\"\">From the instructor:</strong><br style=\"\"></p><p><em style=\"\">“I have spent much of my professional career learning new software packages. From this, I know that the best way to learn is by familiarizing yourself with the UI, and then diving into a real world project, answering real questions and solving real problems.&quot;</em> </p><br style=\"\"><p style=\"\">Different areas of expertise that you can specialize in after taking this course:</p><ol style=\"\"><li>Photo editing</li><li>Photo retouching</li><li>Matte Painting</li><li>Fine art digital painting</li><li>Texture artist for 3d (Film, video games, architecture, etc)</li><li>Illustration</li><li>Graphic Design</li><li>UI Design (mobile apps, web pages, video games)</li><li>And more...</li></ol><p style=\"\">Photoshop is a very powerful program, so the learning curve can be a bit steep.  That is why this course cuts right to the essentials.  In just two hours you will be ready to explore on your own with a good understanding of the core functionality of Photoshop CC.  </p><p style=\"\">*Voucher for $5 dollar Photoshop courses (intermediate and advanced) included with this course.</p><p style=\"\"><strong style=\"\">Project Files Included</strong></p><p style=\"\">Put your skills to the test with the provided files.  Also, explore some real professional projects to learn by example.  Here are the practice files I have so far:</p><ol style=\"\"><li>Enhance a basic portrait</li><li>Practice the basics of digital coloring / painting on one of my illustrations</li><li>More to come!</li></ol><p style=\"\"><strong style=\"\">Join Today</strong><br style=\"\"></p><p style=\"\">Join today for lifetime access to the lectures and project files (including all future additions).  You&#039;ll never regret learning Photoshop.</p><span class=\"redactor-invisible-space\" style=\"\"><strong style=\"\"></strong></span>", 
    "end_date": null, 
    "title": "Photoshop CC: The Essentials of Photoshop In Just 2 hrs", 
    "price": "20.00", 
    "instructors": "Adam Zollinger", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/433710_1cce_3.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cc-introduction-tutorial-quick-start/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-27T03:31:19Z"
}