{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><em>Join over 1000 successful students in this course!</em></p>  <p><strong>Looking to master your design sketching skills</strong> or maybe you want to get an introduction to basic sketching techniques? Are you struggling to learn industrial design sketching from books and other mediums that leaves you to figure it all out yourself? Whether you're just starting out, or if you are an industrial design student or professional and want to crush it with your sketching, this course is for you. </p><p><strong>The course will help you improve your sketching skills using simple techniques that anyone can learn.</strong> <strong>Use these techniques to build a professional portfolio, get internships at design studios or land a position as an industrial designer.</strong> I'll walk you through each step of the process from initial line work to the final render and give you an insight to how it's done in the design industry.</p><p><em><strong>Photoshop Design Sketching is the complete course for learning how to design products in Photoshop. From basic sketching exercises to advanced rendering aimed towards industrial design, it's all here.</strong></em></p>  <p>  \tThe reason I created this course is to give you an interactive experience and guide you through your learning process. I will always be available to answer any questions you might have in the course forum so that you can get your sketching to the next level as fast as possible. I won't leave you hanging! </p>  <p>  \t                                  <strong>Here's some of what you will learn:</strong>  </p>  <ul>  \t<li>understand design sketching better</li>  \t<li>use Photoshop to present design proposals</li>  \t<li>understand what analog and digital tools to use as a designer</li>  \t<li>improve your line quality</li>  \t<li>sketch better ellipses</li>  \t<li>understand perspective in an easy way using \"cloud sketching\"</li>  \t<li>use parallel lines for shading</li>  \t<li>quickly explore shapes to find a design you like with this technique</li>  \t<li>use line weight and understand it</li>  \t<li>understand lightning and shading</li><li>a trick to unblock your sketchers block (we all have them some days)</li>  \t<li>add any texture to any surface and make it look real</li>  \t<li>visualize lights and LEDs</li>  \t<li>sketch transparent material easily</li>  \t<li>sketch matte and shiny surfaces and understand the difference</li>  \t<li>develop a complete design proposal from early ideation sketches to final presentation renders</li>  </ul>  <p>  \t                                  I <strong>guarantee</strong> it will take your design sketching to the next level if you are willing to put in the time to complete the course. You have to have the right mindset before starting the course and really take time to focus and disconnect the noise around you.  </p>  <p>  \t  If you feel something is missing or wasn't covered enough, just let me know in course forum. I will update the course on a regular basis and add new lectures <em>based on your feedback and needs.</em>    </p>  <p>  \t                                        Should you complete the course and feel this wasn't for you, don't worry, simply ask for a <strong>refund within 30 days and you'll get your money back no questions asked. </strong>  </p>  <p><em><strong>So what are you waiting for?</strong> Click \"Take this course\" in the top right, join me and hundreds of students today and start sketching your own beautiful designs in no time.</em></p>", 
    "end_date": null, 
    "title": "Photoshop Design: Sketch like an industrial designer", 
    "price": "50.00", 
    "instructors": "Marouane Bembli", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/385234_96a2_19.jpg", 
    "course_url": "https://www.udemy.com/photoshop-design-sketching/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-05T01:11:45Z"
}