{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>2007 habe ich angefangen Live Vorführungen in verschiedenen Unternehmen und Buchhandlungen zu geben. Die Resonanz war riesig und ich bin mittlerweile davon überzeugt, das keine Verfilmung eines Handbuchs gewünscht wird, sondern der Einsatz von Werkzeugen auf dem Weg zum Ziel viel wichtiger ist.</p>\n\n<p>Deshalb habe ich das Photoshop \"Mystic\" Live Composing aufbereitet und stelle es hier auf Udemy zur Verfügung. Dieses Tutorial habe ich in 2007 aufgenommen, deshalb ist die Qualität hier und da noch zu verbessern, deshalb ist es auch Gratis.</p>\n\n\n\n\n\n<p>Wie der Name es schon sagt, es ist keine Anleitung nach dem Handbuch, sondern eine Problem -&gt; Lösung -&gt; Ziel Variante. Zum Beispiel:</p>\n\n\n\n\n\n<p>Problem: \"Ich möchte Wolken erstellen\", Lösung: \"So baut man einen Wolkenpinsel und wendet diesen an\" Ziel: \"Der Wolkenhimmel ist erstellt\" </p>\n\n\n\n\n\n<p>Das ist das Verfahren mit dem ich meine Kurse und auch meine Workshops gestalte. Was in meinen Workshops bestens funktioniert, wird in meinen Videokursen nicht schlechter sein</p>\n\n\n\n\n\n<p><strong>Wir bauen also ein vollständiges Composing!</strong></p>\n\n\n\n\n\n<p>Dazu erstellen wir, in rund 4 Stunden, eine Szene Mit Mauer, Hintergrund Fussboden und Interieur. Werfen Licht und Schatten, stellen Objekte Frei und fügen diese in die Szene ein. Wir verändern die Farbstimmung, benutzen digitale Schminke und Machen Body-Modifications. Zu guter letzt wird auch noch jede Menge Blut Digital hergestellt.</p>", 
    "end_date": null, 
    "title": "Photoshop \"Mystic\" Composing", 
    "price": 0, 
    "instructors": "Frank Schatz", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/855124_4eb1_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-mystic-composing/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-20T16:22:06Z"
}