{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t  En este curso de Photoshop avanzado vemos con profundidad todos los tipos de capas que dispone photoshop y como hacer que cualquier cambio que realicemos sea editable en el tiempo.  </p>  <p style=\"\">  \t  Esta creado con la versión CS5 de Photoshop, pero podrías utilizar otras versiones como CS3, CS4 o CS6, ya que son técnicas que se utilizan desde hace varias versiones.  </p>  <p style=\"\">  \t El curso esta dividido en 6 áreas de estudio por las que vamos incrementando la curva de complejidad.  </p>  <ol style=\"\">  \t<li style=\"\">Repaso de lo que son las capas</li>  \t<li style=\"\">Trabajar con objetos inteligentes, nuevo en photoshop</li>  \t<li style=\"\">Crear y administrar las máscaras de capa para poder tener partes de la imagen bien aisladas</li>  \t<li style=\"\">Administración y uso de las capas de ajustes para tener ajustes editables en cualquier momento.</li>  \t<li style=\"\">Trabajar con máscaras vectoriales para tener un control de las curvas y rectas de la selección</li>  \t<li style=\"\">y para finalizar, terminamos con el uso de las máscaras de recorte que nos facilitan el uso de una máscara para varias capas</li>  </ol>  <p style=\"\">  \t Como puedes ver, es un curso muy completo en el que se tocan todos los aspectos relacionados con las capas y sus máscaras  </p>  <ol style=\"\">  </ol>", 
    "end_date": null, 
    "title": "Photoshop CS5 Avanzado. Máster en capas y sus máscaras", 
    "price": "20.00", 
    "instructors": "Gonzalo Pasquin", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/170532_8c5e_2.jpg", 
    "course_url": "https://www.udemy.com/photoshop-cs5-avanzado-master-en-capas-y-sus-mascaras/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T18:34:35Z"
}