{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \tThis is Volume 1 of 5 in my “Photoshop - Beginners to Intermediate” series. I have developed this series over many years of teaching at both the College and University levels in a variety of departments including the Multimedia Program, Graphic Design Program, the Fashion Program, and the Creative Photography Programs both daytime and evening diploma and certificate programs. These courses in Adobe Photoshop (Volumes 1 through 5), start right at the very beginning assuming that the learner has no experience in using the application.  </p>  <p>  \t<strong style=\"\">Lecture 1: Navigating the Document Window</strong>  </p>  <p>  \tKnowing how to effectively and efficiently navigate around your image files (the document window) will allow you to zoom in and zoom out and focus on specific areas of interest in your images.  </p>  <p>  \t<strong style=\"\">Lecture 2: Setting Up Our Preferences</strong>  </p>  <p>  \tSetting Photoshop up for success allows us to fine tune how the application performs. Photoshop is factory set for very generic purposes and not set up for photography.  </p>  <p>  \t<strong style=\"\">Lecture 3: Setting Up Photoshop’s Colour Settings</strong>  </p>  <p>  \tChanging these default factory settings will allow your images to look clearer, cleaner and more vibrant in ways your friends, family and coworker’s images won’t because they aren’t aware of these issues.  </p>  <p>  \t<strong style=\"\">Lecture 4: Creating a New Document</strong>  </p>  <p>  \tThere are a number of ways to create new documents and knowing these little secrets will allow you to create your masterpieces faster like creating a new image file with the same attributes as your currently open file.  </p>  <p>  \t<strong style=\"\">Lecture 5: Arranging Panels and Groups</strong>  </p>  <p>  \tLearning how to arrange and then rearrange Photoshop’s Panels and Panel Groups allows you to work on your images with less clutter in the application’s interface.  </p>  <p>  \t<strong style=\"\">Lecture 6: Creating a Custom Workspace</strong>  </p>  <p>  \tLearning to modify Photoshop’s workspace so that only the tools and panels that you use most frequently are showing can help you work more efficiently.  </p>  <p>  \t<strong style=\"\">Lecture 7: Learn how to use the Colour Head’s Up Display (HUD)</strong>  </p>  <p>  \tThe Colour Head’s Up Display is just a fancy name for a really cool way to select existing colours in your image. Why is this important you ask? Well, for one thing, if you ever want to type some text over your image and you want to use a colour that already is in your image, using the HUD is quick and easy to do.  </p>  <p>  \t<strong style=\"\">Lecture 8: An Introduction to File Size and Resolution</strong>  </p>  <p>  \tFile size and resolution can be one of the biggest hurdles to wrap your head around for the average person. Getting a handle on this topic can greatly assist you if you ever wanted to create a montage or collage of any kind where you bring one or more images together for a birthday or anniversary collage.  </p>", 
    "end_date": null, 
    "title": "Photoshop Professor Notes - Volume 1 - Setting Up Photoshop", 
    "price": "20.00", 
    "instructors": "John Warren", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/169424_85c2_3.jpg", 
    "course_url": "https://www.udemy.com/adobe-photoshop-cs6-getting-started/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-21T03:47:50Z"
}