{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>Create your digital masterpiece using Pixlr Editor</strong>  </p>  <p>  \t                        It has never been easier to take a picture. As well as printing your pictures, you can share them, tweak them, and create photographic masterpieces. Editing images and photos is an important part of that process. Most photo editing software packages are either too expensive or your computer is not available at the time you want to edit your photo.  </p>  <p>  \t<strong>    Pixlr is a free online image editor</strong><strong>. </strong>It<strong> </strong>isn’t Photoshop but for a tool that works entirely within your browser, it replicates a remarkable percentage of Photoshop’s most important image-editing tools, and does it very, very well.  </p>  <p>  \t                    Pixlr combines paint tools with image design and works in your browser. You can also use it for several different purposes, including creating an image from scratch, as well as layering images over each other. You can also make use of a variety of effects, filters and level adjustments, define your own brushes, utilities such as resizing and cropping, drawing right onto a blank canvas and a host of other features. All this will help you <strong>to radically transform all your photographs</strong>.  </p>  <p>  \t              Pixlr responds to practically the exact same keyboard shortcuts as Photoshop, and is very easy to use. You can use Pixlr to:  </p>  <ul>  \t<li>Edit photos uploaded from a computer.</li>  \t<li>Start with a blank canvas or upload from the Cloud (all you need is to paste in an image URL).</li>  \t<li>No matter where your images are stored, you&#039;ll be able to edit them in Pixlr.</li>  \t<li>Pixlr comes with complex layer support that allows for several blending modes and layer styles.</li>  \t<li>If you don&#039;t have Photoshop handy and need to do some image editing in your browser, Pixlr is a really fantastic alternative.</li>  </ul>  <p>  \t<strong><br>  \t</strong>  </p>  <p>  \t<strong>What equipment do you need for this course?</strong>  </p>  <p>  \t      Pixlr Editor is built in Flash and you need to have the Flash plug-in to get it to work, however, 98% of all computers have flash so you are probably set and it will work on any computer, MAC or Windows as long as the computer is running the Flash plugin. Since the Pixlr editor is Flash-based, how it runs depends on what kind of computer you have. If it is lagging you can try to shut down other web pages that might be running Flash ads or close other software on your computer that is taking a lot of CPU.  </p>  <p>  \t      You also need an internet connection, and a browser - Internet Explorer, Firefox, Chrome or Safari.  </p>  <p>  \t<strong>Course Structure</strong>  </p>  <p>  \t<strong>Section 1:</strong>An exploration of the Pixlr menus, tools and user interface. A look, also at the diverse ways of getting images into the editor, saving them locally and to Cloud services like Facebook and Flickr.  </p>  <p>  \t<strong>Section 2:</strong><strong></strong>How to make adjustments to an image. This covers resizing, cropping, rotating images, using the menu options like colour balance, curves, levels to improve and edit an image. An introduction to layers in Pixlr and how to use layers and layer masks to manage, edit and composite an image.  </p>  <p>  \t<strong>Section 3:</strong>An exploration of Pixlr&#039;s selection tools. How to use the Lasso, Marquee, Magic Wand selection tools to edit an image.  </p>  <p>  \t<strong>Section 4:</strong><strong></strong>An exploration of Pixlr&#039;s editing tools. How to use the Pencil, Paint Bucket, Clone Stamp, Brush and Gradient tools to edit an image.  </p>  <p>  \t<strong>Section 5:</strong><strong></strong>An exploration of Pixlr&#039;s blending tools. How to use the Dodge, Burn, Smudge, Pinch and Bloat, Sharpen, Spot heal and Red Eye Reduction tools to edit an image.  </p>  <p>  \t<strong>Section 6</strong>: How to use special filters and effects to edit and enhance an image.  </p>  <p>  \t<strong>Section 7:</strong><strong></strong>All the rest of the tools - How to use text, text styles, drawing shapes and lines, Colour Replacement tool and how to remove the background from an image to make it transparent.  </p>  <p>  \t<strong>Section 8</strong>: Projects to test your skills.  </p>  <p>  \t  Each section has a number of projects and exercises to consolidate the skills covered in that section. Projects such as creating a banner for a website using layers, blending images together, creating an artistic double exposure, creating custom brushes, restoring and retouching photographs - common tasks you need to do in editing photos and creating your own images.  </p>  <p>  \t<strong>Section 9: Pixlr and the Cloud</strong>  </p>  <p>  \t  A look at the other Pixlr apps: Pixlr Express and Pixlr-O-Matic and how to connect Pixlr to Google Drive.  </p>  <p>  \t<strong>Materials included in the course</strong>  </p>  <p>  \t53 Lessons. Each lesson covers a tool or combination of tools and shows you how to use those tools to edit, enhance or create an image. The images used in the videos are provided as a Download so you can follow along with the video and reproduce the same result. The majority of lessons also have worksheets to assist in reproducing the task in the video. There are also projects to test your understanding of the tools and processes explored in that section.  </p>  <p>  \t<strong></strong>  </p>", 
    "end_date": null, 
    "title": "Pixlr Power: How to use the Pixlr Editor", 
    "price": "25.00", 
    "instructors": "Michele Berner", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/148696_99f9_6.jpg", 
    "course_url": "https://www.udemy.com/pixlr-power/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-01-18T10:34:04Z"
}