{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      Welcome to 3DTraining.com&#039;s Quick Start Video Series: If you are a beginner or industry professional new to Autodesk Inventor these videos will give you a quick overview of the software to help you decide if you seriously want to pursue a career in 3D.  </p>  <p style=\"\">  \t      In this project-based course you will learn:  </p>  <p style=\"\">  \t      路Autodesk Inventor&#039;s Core Interface and Navigation  </p>  <p style=\"\">  \t      路Introduction to Inventor&#039;s unique Project Workflow  </p>  <p style=\"\">  \t      路Digitally proto-type a plastic gear and build the design&#039;s mold apparatus  </p>  <p style=\"\">  \t     路Run a dynamic moldflow simulation &amp; analysis  </p>  <p style=\"\">  \t      After this course, you will have created your own basic proto-type that walks you through step by step how to work on a project from start to finish such as digital proto-typing, building a mold design and running a dynamic moldflow simulation.  </p>  <p style=\"\">  \t      Included in this course is a link to download the 30 day trial version of Inventor (Courtesy of Autodesk) and approx 60 minutes of training video provided by 3DTraining.com. The average student will complete this course in approximately 2-4 hours.  </p>  <p style=\"\">  \t      And if you enjoy your experience working in the software and you are interested in professional training to find work in this field visit our site and sign up for a free one hour intro class for more information.  </p>  <p style=\"\">  \t      Also when you visit our site, don&#039;t forget to check out our company news page to see how the 3DTraining.com&#039;s unique training methodology has helped our students launch a successful career in the 3D industry.  </p>", 
    "end_date": null, 
    "title": "Plastic Gear & Mold Design using Autodesk Inventor", 
    "price": 0, 
    "instructors": "3DTraining .com", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/234388_e430_6.jpg", 
    "course_url": "https://www.udemy.com/inventor_3dtraining_quickstart/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-31T01:10:52Z"
}