{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\r\n\t <strong>APRENDE EDICION DE VIDEO FACIL Y RAPIDO CON EL UNICO PROGRAMA # 1 ENTRE LOS PROFESIONALES A NIVEL MUNDIAL! PREMIERE PRO CS6</strong>\r\n</p>\r\n<p>\r\n\t <strong>Crea Grandes Historias Con Todos Tus Videos… En Unas Cuantas Horas Podrías Estar Editando Como Todo Un Profesional…!</strong>\r\n</p>\r\n<p>\r\n\t <strong><br>\r\n\t </strong>\r\n</p>\r\n<p>\r\n\t   Adobe Premiere Pro CS6 se ha convertido rápidamente en el programa editor #1 preferido por profesionales en todo el mundo. En esta nueva versión se han añadido nuevas características las cuales superaran todas tus expectativas! Entre las nuevas mejoras se encuentran la posibilidad de agregar mejores efectos especiales, aun mas fácil,  con funciones de apariencia avanzada, las cuales  antes se veían únicamente en programas como After Effects.\r\n</p>\r\n<p>\r\n\t   Premiere Pro CS6 ha logrado combinar nuevas funciones, siendo este la solución completa para edición de video profesional. En este tutorial iniciaremos desde lo básico a avanzado, conociendo todo lo nuevo de su interfaz mejorada y como esta luce más limpia comparada a versiones anteriores [Este cambio lo notaras de inmediato]\r\n</p>\r\n<p>\r\n\t   Continuando con este tutorial avanzaremos a temas de personalización enfocándonos a su apariencia en detalle. Entenderemos que configuraciones son las correctas al momento de crear una nueva secuencia, y de igual manera entenderemos como trabajar con diferentes tipos de media, incluso importandolos desde otros programas como Photoshop. Más adelante nos enfocaremos a temas avanzados en donde estudiaremos cómo aplicar diferentes tipos de efectos, transiciones, como añadir títulos, como trabajar con audio y como configurar múltiples formatos de salida, incluyendo DVD o Blu-ray. De igual manera conoceremos los formatos de salida en alta definición [HD] y cómo utilizar todo proyecto finalizado para ser reproducido en nuestra PC o compartirlos a través de las redes sociales, entre otros.\r\n</p>\r\n<p>\r\n\t <strong>ESTE TUTORIAL INCLUYE 15 MODULOS CON MAS DE 6 HORAS DE ENTRENAMIENTO</strong>\r\n</p>", 
    "end_date": null, 
    "title": "Premiere Pro CS6: Aprende cómo editar vídeos", 
    "price": "20.00", 
    "instructors": "Omar Castañeda", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/223160_a11b.jpg", 
    "course_url": "https://www.udemy.com/premiere-pro-cs6-aprende-como-editar-videos/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-05-19T18:32:49Z"
}