{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<h5>A Verifiable Certificate of Completion is presented to all students who undertake this course.</h5>  <p>In this Pro Tools 10 video training course, expert Joe Godfrey takes you through the ins and outs of composing, mixing and editing with this powerful audio production software. This tutorial is designed for the beginner; no previous Pro Tools experience is required. You will learn from the ground up, building on what you are taught from chapter to chapter, until you are comfortable using the tools and techniques available to you.</p>  <p>In this training course, you will work with the spoken word, apply sound effects, work with music tracks, and explore sound design. You will create music, work with video, as well as learn the Pro Tools interface, and about DSP (digital sound processing) concepts. This video tutorial also covers workflow tips, and techniques for saving and archiving your files. You will learn through the application of these tools in real, in-software, examples - this is not simply a video version of the Pro Tools manual!</p>  <p>By the completion of this video tutorial for Pro Tools 10, you will be capable of creating, editing and sharing music tracks created in this powerful, industry standard software for audio professionals. Working files are included to allow you to work alongside the author throughout the training.</p>", 
    "end_date": null, 
    "title": "Pro Tools 10 Tutorial - Makes Learning Pro Tools Easy", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/21041_c3cc_9.jpg", 
    "course_url": "https://www.udemy.com/learning-pro-tools-10/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-07-11T23:20:28Z"
}