{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t      En este curso conocerás todo lo necesario para poder <strong style=\"\">crear redes de tuberías de alcantarillado sanitario o pluvial utilizando las herramientas que AUTOCAD CIVIL 3D incorpora</strong>.  </p>  <p style=\"\">  \t      Conocerás la forma de crear un dibujo de la red de alcantarillado sanitario partiendo sólo de la información de elevaciones del terreno.  </p>  <p style=\"\">  \t      Y, a partir de aquí, podrás <strong style=\"\">definir, paso a paso, la ubicación de bocas de visita o pozos de inspección, tuberías o colectores y lograr establecer, utilizando las reglas de piezas de civil 3D, sus parámetros característicos</strong>, como pendientes, y profundidades de rasante.  </p>  <p style=\"\">  \t      Aprenderás a <strong style=\"\">crear los perfiles longitudinales de los colectores de la red y lograrás dominar, de forma progresiva, la proyección de piezas y objetos en ellos</strong>, aprendiendo a ajustar a partir de puntos específicos, las elevaciones de rasante de tuberías y estructuras.  </p>  <p style=\"\">  \t      Adicionalmente revisarás los aspectos relativos a la<strong style=\"\"> creación de tamaños de piezas a partir del catálogo que el programa incorpora</strong>, siendo posible de esta manera adaptar la plantilla de dibujo a la normativa aplicable en tu país.  </p>  <p style=\"\">  \t<strong style=\"\">Las 12 clases que conforman este curso representan casi 3 horas de información específica</strong> y, <strong style=\"\">pese a estar realizadas en la versión 2015 de CIVIL 3D, son completamente compatibles con las versiones anteriores, desde la 2010</strong>, así que no hay excusas para empezar a aprender lo relativo a redes de tuberías con AUTOCAD CIVIL 3D.  </p>  <p style=\"\">  \t<em style=\"\">Tutoriales al Día – CIVIL 3D ya tiene más de 4 años ofreciendo en su sitio WEB detallados tutoriales, artículos y manuales relacionados con el uso de esta poderosa herramienta de diseño en ingeniería.</em>  </p>  <p style=\"\">  \t<em style=\"\">El contenido está cuidadosamente preparado por ingenieros civiles con amplia experiencia no sólo en el uso del AUTOCAD CIVIL 3D sino también en las distintas áreas de aplicación del programa.</em>  </p>", 
    "end_date": null, 
    "title": "Redes de Tuberías con Autocad Civil 3D", 
    "price": "25.00", 
    "instructors": "Aula Virtual Tutoriales al Día", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/333144_925e_2.jpg", 
    "course_url": "https://www.udemy.com/redes-de-tuberias-con-autocad-civil-3d/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-01T01:10:30Z"
}