{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>كورس ريفيت ميب الاصدار 2016 بالعربية</p><p>سأقوم في هذا الكورس بإيضاح كيف يشارك الريفيت في مشاريع البيم وما هي أهم أدواته وكيفية استخدامها. ثم سأقوم بشرح واجهة المستخدم بالبرنامج وكيفية الوصول لها بسهولة وأهم إضافات أوتوديسك للإصدار 2016 وبعدها سنتعرف على كيفية استخدام ملفات العمل الموجودة للتمرين على معظم فيدوهات الكورس خطوة بخطوة. كما سأقوم بشرح أهم أدوات التعديل والعمل الموجودة بالبرنامج. ثم كيف نعمل على مشروع ما بداية من ربطه بالمبنى المعماري وتعريف حدوده لتهيئته لعمل الحيزات والمناطق ثم حساب الأحمال الحرارية (تبريد وتسخين) ونهاية بعمل الطوابق والأسقف المزيفة. وأيضا سنتعرف على كيفية عمل نموذج من ملفات أوتوكاد ثنائية الأبعاد. ثم سأنتقل لفصل الأحمال حيث حسابات الأحمال الحرارية بداية بتقسيم المبنى لحيزات ثم تجميعها لمناطق مرورا على الانواع المختلفة للمبنى والحيزات وكيفية تحديدها وكيفية اختيار جداول الإشغال والتعديل فيها أو عمل جداول جديدة ثم تحديد مكان المشروع ونوع الخدمة للمبنى ثم اجراء الحسابات وأيضا طريقة تصدير المبنى بحيزاته لبرنامج الهاب في حالة استخدام برنامج آخر لحساب الأحمال الحرارية. ثم بعدها سأتعرض لكيفية استخدام البرنامج في تصميم أنظمة الميكانيك، الصحي والكهرباء. ثم سنتعرف على الإصافة الحديثة لاصدار 2016 وهي عمل القطع المخصصة او استيرادها من البرامج الأخرى المخصصة لعملها. وبعدها سنتعرف على كيفية فحص الأنظمة المصممة من خلال الأدوات المخصصة لذلك بريفيت ميب باصداره 2016. ثم ننتقل إلى الجدولة وسنتعرف على ميزاتها الكثيرة مثل عمل حصر للمعدات، المواسير ولوازمها، عمل تسعير للصاج، حصر الصاج عن طريق سماكة لوح الصاج، عمل قائمة للشيتات، عمل جدول للوح التوزيع. ثم سأتعرض لإجراءات من شأنها تسهيل العمل على المشروع ثم تهيئته للطباعة أو العرض. وبعدها ساتحدث عن مشاركة الفريق لملف مركزي واحد وكيفية العمل عليه وما الطريقة المناسبة لفتح المشاركة وعمل مجاميع للعمل ذات خصوصية لصاحبها فقط وكيفية حفظ الملفات المركزية والمحلية وأيضا كيفية تتبع تواريخ العمل على الملف ثم كيفية استعادة الملف المركزي إذا حدثت فيه مشكلة. و في آخر فصل بالكورس سأنتقل إلى بيئة الفاميلي وكيفية عمل فاميلي خاصة باستخدام الادوات المخصصة لذلك. </p><p>\"هذا الكورس تم عمله للمبتدئين، ولا يتطلب معرفة سابقة بالبرنامج.\"</p>", 
    "end_date": null, 
    "title": "Revit MEP 2016", 
    "price": "50.00", 
    "instructors": "Samaah Sultaan", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/716252_574e.jpg", 
    "course_url": "https://www.udemy.com/revit-mep-2016/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-04T23:11:07Z"
}