{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\"></p><p style=\"\"><p style=\"\"><strong style=\"\">Create Top Notch Udemy Courses - Tutorials - Videos</strong></p>    <p style=\"\">Want to learn how to make a video for course, tutorials, or videos (including  greenscreen) with easy to use and affordable software?</p>    <p style=\"\">Screencasting software allows you to record your  computer&#039;s on screen movements, and if you&#039;re a Mac user, ScreenFlow 4 is a  must have program.&nbsp; </p>    <p style=\"\">In this Screenflow tutorial course, you&#039;ll learn everything you need to know to  start creating stunning screencasts. </p>    <p style=\"\"><strong style=\"\">Part  1</strong> Covers screencasting basics, how to plan, and what equipment  you need to produce high quality videos.</p>    <p style=\"\"><strong style=\"\">Part  2</strong> Takes a deep dive into the software.&nbsp; Learn how to get started, how to record,  edit, and share your videos.</p>    <p style=\"\"><strong style=\"\">Part  3</strong> Will show you how you can use video in your screencasts. You&#039;ll  learn how to greenscreen, add lower thirds, b-roll, and import footage captured  on video cameras.</p>    <p style=\"\">Finally, there are bonuses which will show you free  and alternative screen recording options, how to use keynote, and how to record  videos directly from the Internet. </p>    <p style=\"\">This is a must watch how to make a video course for anyone  who wants to learn how to create an online product, tutorial, or video using an  affordable editing solution.</p>    <p style=\"\">Take this ultimate Screenflow Tutorial course right  now and learn how  to make a video.</p>&lt;/p&gt;<p style=\"\"></p>  ", 
    "end_date": null, 
    "title": "Screencasting: Tutorials | Courses | Videos | Made Easy ", 
    "price": "30.00", 
    "instructors": "Amani Channel", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/36021_5bd2_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-screencast/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-01-14T00:57:17Z"
}