{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this Siemens NX 10 Essential training course,<strong> Expert author Asif Ahmed, <em>(Siemens NX Expert)</em> </strong>will teach you how to create sketch, parts, assembly and drawing file using the variety of tools in Siemens NX. This course is designed for the absolute beginner, meaning no previous experience with Siemens NX is required. If anyone wants to fill up his/her gap in Siemens NX, then this is also right course for them.</p><p><strong><em>Follow along with our expert instructor in this training course to get:</em></strong></p> <ul><li>Concise, informative and broadcast-quality Siemens NX 10 Essential training videos delivered to your desktop.</li> <li><strong>8.0+ hours of HD video tutorials</strong></li> <li><strong>Over 139 individual video lectures</strong></li> <li><strong>Exercise files</strong>– to help you become proficient with the material.</li> <li>The ability to learn at your own pace with our intuitive, easy-to-use interface</li> <li>A quick grasp of even the most complex Siemens NX 10 essential subjects because they're broken into simple, easy to follow tutorial videos.</li></ul><p><br></p> <p><strong><em>After completing this course you will be able to - </em></strong></p> <ul> <li>Make any simple and intermediate 3D CAD model in part environment. </li> <li>Create assembly from parts and use all essential tools in assembly environment.</li> <li>Create drawing for manufacturing or presentation.</li> <li>You will get depth idea about parametric CAD system.</li> </ul> <p>Once you have completed this computer based training course, you will be fully capable of using these tools and techniques to create your own drawing and get control perfectly using this 3D modeling software. Working files are included, allowing you to follow along with the author throughout the lessons.</p><p>In this Siemens NX 10 Essential training video tutorial series, you'll quickly have relevant skills for real-world applications.</p><p><strong><em>We will cover the following essential topics</em></strong></p><ol><li><strong><em>Sketch</em></strong></li><li><strong><em>Part</em></strong></li><li><strong><em>Assembly</em></strong></li><li><strong><em>Drawing</em></strong></li></ol>", 
    "end_date": null, 
    "title": "Siemens NX 10 Essential Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/594926_7cee_2.jpg", 
    "course_url": "https://www.udemy.com/siemens-nx-10-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-27T12:31:17Z"
}