{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Tü</strong><strong>rkiyenin En Kapsamlı İlk ve Tek Türkçe Sketch 3 Eğitim Seti</strong><br></p><p>Tasarım, sadece nasıl göründüğü ya da nasıl hissettirdiği değildir. Tasarım, nasıl çalıştığıdır.</p><p>Steve Jobs</p><p><strong>Sıfırdan Sketch 3 öğrenin.</strong></p><p><strong>Bilgi:</strong> Bu kurs için önceden herhangi bir bilgiye sahip olmanıza gerek yoktur.</p><p>Sürekli güncellenen içerik.</p><p><strong>Neden Sketch 3?</strong></p><p>Sketch 3 modern ve hiper vektörel başarılı bir uygulama. Bu uygulamayı Google, Dropbox, Twitter, Facebook ve diğer birçok ünlü teknoloji şirketleri ve küçük işletmelerin en iyi tasarımcıları tarafından kullanılır. Şu an itibariyle Sketch 3 en iyi tasarımcılar tarafından dünya çapında en iyi seçenek olarak kabul edilir. Photoshop ve Illustrator inanılmaz araçlar olsa da, başka amaçlar için oluşturulmuş ve daha sonra UI ve UX tasarımı için kullanılmaya başlandı. Bu onları öğrenmek için daha karmaşık ve bazen daha az etkili (varlıklar verilirken veya ekranlar ve varlıkları bir sürü proje yönetimi gibi) yapar. Tasarım uygulaması için tamamen yeni olan ya da sadece Adobe geçmek istiyorum olsun, Sketch 3 muhtemelen şu an öğrenmek için en iyi uygulama. </p><p><strong>Yeni bir beceri hayatınızı değiştirebilir!</strong></p><p>Sketch 3 ile herkes hiçbir tecrübeye sahip olmaksızın profesyonel görünümlü tasarımlar oluşturabilecek. Ya bir Mac bilgisayara sahip olmanız ya da windows sanal makinede OS X çalıştırabiliyor olmanız gerekmektedir. Sketch 3, 30 gün boyunca ücretsizdir.<br><br>Bu dersin sonunda tam teşekküllü bir mobil uygulama tasarımcısı olacaksın. Kursun sonunda öğrendikleriniz ile herhangi bir tasarımı yapabiliyor olacasınız.</p><p>Mobil uygulama tasarımcıları Amerika'da yıllık ortamalama 100.000$ kazanmaktadırlar.</p><p><strong>İçindekiler ve Genel Bakış</strong><br></p><p>Özenle hazırlanmış video dersler ile Sketch 3'ün temellerine kısa sürede aşına olup kendi tasarımlarınızı geliştirebileceksiniz</p><p>Kolay kavrayabileceğiniz sade bir dil ile anlatım mevcut. Sketch 3'ün temellerini anlayacak ve sizde aynı anda geliştirme yapabileceksiniz.</p><p>Ders materyalleri düzenli olarak güncellenmektedir ve tüm bilgilere bir ömür boyu erişim iznine sahip olacaksınız.</p><p><strong>Kurs Güncellemeleri:</strong><br></p><p><strong>- Şuan bir güncelleme bulunmamaktadır.</strong></p>", 
    "end_date": null, 
    "title": "Sketch 3 Eğitim Seti", 
    "price": 0, 
    "instructors": "Abdullah ŞAHİN", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/607634_d529_4.jpg", 
    "course_url": "https://www.udemy.com/sketch-3-egitim-seti/", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-10T05:15:54Z"
}