{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">This SketchUp training course &nbsp;teaches you how to use this 3D modeling program designed for architects, engineers, designers. SketchUp comes in two versions, a free and paid version. This tutorial can be used with either version, and is designed for the absolute beginner. No prior experience with 3D modeling programs, or SketchUp specifically, is required.<br style=\"\"><br style=\"\">You will start by exploring the user interface for SketchUp, getting familiar and comfortable with navigating and where the tools are located. The course utilizes many Ruby scripts, which are provided in the working files, and he will show you how to install and use the scripts throughout the course. Some of the functions that you will be taught throughout this tutorial include; working with lines and shapes, how to make faces and surfaces, drawing edges, scaling your models, working with layers and using the architectural tools. You will also learn how to style your work, use color and texture on your models, create walkthrough animations and finally, how to export your work to share and present it.<br style=\"\"><br style=\"\">By the completion of this computer based video course for SketchUp, you will be comfortable using the tools within the software to create and share 3D models. This video tutorial includes working files, allowing you to follow along with the author throughout the lessons.<br style=\"\"></p>", 
    "end_date": null, 
    "title": "SketchUp Tutorial Video - A Practical Course", 
    "price": "50.00", 
    "instructors": "Infinite Skills", 
    "commitment": "7.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/64945_c526_7.jpg", 
    "course_url": "https://www.udemy.com/sketchup-tutorial/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-11T13:35:02Z"
}