{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\"><strong style=\"\"></strong></strong>  </p>  <p id=\"main-section\" style=\"\">  </p>  <p style=\"\">  \t  This is a course by an award-winning visual storyteller for storytellers.  Just about everyone has a smartphone, and whether you&#039;re a writer, photographer, editor, blogger, or content producer you can use your smartphone to tell visual stories. Have you tried to?  Did the video come out the way that you planned?   If not, you&#039;ve arrived at the right Udemy course.  </p>  <p style=\"\">  \t The future is now, and you should be using your smartphone to capture, edit, and share stories. Professionals storytellers like Neal Augenstein, Nick Garnett, and Jeremy Jojola know all about it, and so does vlogger Steve Garfield who actually scooped CNN by using his Nokia smartphone.  </p>  <p style=\"\">  \t  You don&#039;t need expensive editing software, or even a high end camera, because if you have an iPhone you can do everything with apps.  It&#039;s all in your pocket.  Do you want to learn how to connect a microphone to your device, use a tripod, or quickly edit your video?  Then take a moment and watch the free videos below.  </p>  <p style=\"\">  \t In this course you&#039;ll learn:  </p>  <ul style=\"\">  \t<li style=\"\">How to use your Android or iOS device to capture high quality audio</li>  \t<li style=\"\">How to use professional production techniques with your mobile device</li>  \t<li style=\"\">How to use a tripod with a variety of iOS devices</li>  \t<li style=\"\">How to shoot, edit, and post videos quickly with your iPhone</li>  \t<li style=\"\">Storytelling techniques including interviewing and writing</li>  \t<li style=\"\">Demos of iMovie, FiLMiC PRO, and other mobile apps </li>  </ul>  <p style=\"\">  \t  I&#039;ve worked in broadcast news, and video production all my career, and I&#039;ve watched how mobile technology is transforming the news business.  Your phone can be used to tweet headlines, share photos, but let&#039;s face it, nothing is more powerful than video.  </p>  <p style=\"\">  \t This course is designed for all levels of storytellers.  There is something here for everyone.  If you own a smartphone, you&#039;ll learn how to capture stunning images, and how to create and share stories just like the pros.  </p>", 
    "end_date": null, 
    "title": "Smartphone Storytelling: The Complete Mobile Video Guide ", 
    "price": "20.00", 
    "instructors": "Amani Channel", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/84118_0aed_6.jpg", 
    "course_url": "https://www.udemy.com/mobilejournalism/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-26T19:22:35Z"
}