{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this SolidWorks 2016 Essential training course,<strong> Expert author Asif Ahmed, Certified SolidWorks Expert (CSWE) </strong>will teach you how to create sketch, parts, assembly  and drawing using the variety of essential tools in SolidWorks. This course is designed for the absolute beginner, meaning no previous experience with SolidWorks is required. If anyone wants to fill up his/her gap in SolidWorks, then this is also right course for them.</p><p><strong><em>Follow along with our expert instructor in this training course to get:</em></strong></p><p>·Concise, informative and broadcast-quality SolidWorks Drawing Essential training videos delivered to your desktop.</p><p><strong>8.5+ hours of HD video tutorials</strong></p><p>·<strong>Over 146 individual video lectures</strong></p><p>·11 <strong>practice exercises </strong>- to test what you've learned in SolidWorks<br></p><p>·<strong>Exercise files</strong>– to help you become proficient with the material.</p><p>·The ability to learn at your own pace with our intuitive, easy-to-use interface</p><p>·A quick grasp of even the most complex SolidWorks 2016 Essential subjects because they're broken into simple, easy to follow tutorial videos.</p><p><br></p><p>Once you have completed this computer based training course, you will be fully capable of using these tools and techniques to create your own drawing and get control perfectly using this 3D modeling software. Working files are included, allowing you to follow along with the author throughout the lessons. 4 quizzes is also added to evaluate your skill after learning this course.</p><p>In this SolidWorks 2016 Essential training video tutorial series, you'll quickly have relevant skills for real-world applications.</p>", 
    "end_date": null, 
    "title": "SolidWorks 2016 Essential Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/421580_2a26_5.jpg", 
    "course_url": "https://www.udemy.com/solidworks-2016-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-14T02:16:52Z"
}