{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this SolidWorks 2015 Parts Essential training course, <strong>expert author Asif Ahmed, Certified SolidWorks Expert (CSWE)</strong> will teach you how to create parts using the variety of tools in SolidWorks. This course is designed for the absolute beginner, meaning no previous experience with SolidWorks is required. If anyone wants to fill up his/her gap regarding SolidWorks parts topic, then this is also right course for them.<br></p><p style=\"\"><em><strong>Follow along with our expert instructor in this training course to get:</strong></em></p><p style=\"\">·Concise, informative and broadcast-quality SolidWorks Parts Essential training videos delivered to your desktop.</p><p style=\"\"><strong>·5.5 hours of HD video tutorials</strong></p><p style=\"\"><strong>·Over 89 individual video lectures</strong></p><p style=\"\"><strong>·An online quiz (30 questions) - to test what you've learned in SolidWorks Parts topics</strong></p><p style=\"\"><strong>·Exercise files</strong> – to help you become proficient with the material.</p><p style=\"\">·The ability to learn at your own pace with our intuitive, easy-to-use interface</p><p style=\"\">·A quick grasp of even the most complex SolidWorks Parts Essential subjects because they're broken into simple, easy to follow tutorial videos</p><p style=\"\">You will start by learning basic and intermediate 3D features, such as extruded and revolved features, lofts, circular patterns, reference geometry and so on. This video tutorial will then cover how to make configuration in part level and teach you what is design intent and what is the best way to design a 3D part. Then this course will also cover lots of intermediate topics such as face fillet, variable fillet, full round fillet, multi-body etc. Then, you will learn how to work with advanced tool such as dome, wrap, indent, intersect, boundary boss. Finally, this course will cover few advanced topic such as advanced pattern type, advanced reference type, equation, advanced loft type, advanced swept type etc.<br style=\"\"><br style=\"\">Once you have completed this computer based training course, you will be fully capable of using these tools and techniques to create your own 3D models using this 3D modeling software. Working files are included, allowing you to follow along with the author throughout the lessons. One quiz is also added to evaluate your skill after learning this course.</p><p style=\"\">In this SolidWorks Parts Essential training video tutorial series, you'll quickly have relevant skills for real-world applications.</p><p style=\"\"><em><strong>We will cover the following topics</strong></em></p><ul><p style=\"\">·Sketch Based Feature such as extrude, revolve, sweep etc.</p><p style=\"\">·Applied Based feature such as fillet, chamfer, shell etc.</p><p style=\"\">·Mirror options with advanced capability</p><p style=\"\">·Pattern tools such as linear, circular, varying, curve driven, fill etc.</p><p style=\"\">·Making references such a plane, axis etc.</p><p style=\"\">·Curves tools such as composite, project, intersection etc.</p><p style=\"\">·Basic rule to make a part including design intent concept</p><p style=\"\">·Evaluation Tools such as measure, mass properties tools etc.</p><p style=\"\">·Configurations in a part using 3 different way</p><p style=\"\">·Advance capability of fillets such as variable fillet, face fillet etc.</p><p style=\"\">·Power of Sweep tools using advanced option</p><p style=\"\">·Advance capability of other important features</p><p style=\"\">·Using Loft tools to create more complex shape</p><p style=\"\">·Other useful features such as wrap, dome, indent etc.</p><p style=\"\">·Working with multi-body</p><p style=\"\">·Advanced Pattern tools such as sketch driven, table driven etc.</p><p style=\"\">·Making advanced references such as axis, plane point etc.</p><p style=\"\">·Understanding equation</p></ul>", 
    "end_date": null, 
    "title": "SolidWorks 2015 Parts Essential Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/418470_efa3.jpg", 
    "course_url": "https://www.udemy.com/solidworks-2015-parts-essential-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T17:28:59Z"
}