{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this SolidWorks 2016 Advanced Part training course, <strong>expert author Asif Ahmed, Certified SolidWorks Expert (CSWE)</strong> will teach you how to create complex part using the advanced part tools in SolidWorks. This course is designed for beginner and intermediate user. If anyone wants to fill up his/her gap regarding SolidWorks advanced part topic, then this is also right course for them.</p>\n\n<p><em><strong>Follow along with our expert instructor in this training course to get:</strong></em></p>\n\n<p>·Concise, informative and broadcast-quality SolidWorks Advanced Part training videos delivered to your desktop.</p>\n\n<p><strong>·4.0 hours of HD video tutorials</strong></p>\n\n<p><strong>·Over 74 individual video lectures</strong></p>\n\n<p><strong>·Exercise files</strong>– to help you become proficient with the material.</p>\n\n<p>·Theability to learn at your own pace with our intuitive, easy-to-use interface</p>\n\n<p>·A quick grasp of even the most complex SolidWorks part subjects because they're broken into simple and easy to follow tutorial videos.</p><p>You will start by learning intermediate part tools, such as advanced extrude, advanced fillet, swept, loft and so on. This video tutorial will then cover how to make complex pattern, and teach you what is multibody part and what is the best way to<br>design in 3D part using multibody part environment. Then this course will also<br>cover lots of advanced topics such as boundary, dome, wrap etc. Then, you will<br>learn how to create and manage configuration and many more advanced topics etc. </p>\n\n<p>Once you have completed this computer based training course, you will be fully<br>capable of using these tools and techniques to create your own complex 3D part<br>using this 3D modeling software. Working files are included, allowing you to<br>follow along with the author throughout the lessons.</p>\n\n<p>In this SolidWorks Advanced Part training video tutorial series, you'll quickly have<br>relevant skills for real-world applications.</p>", 
    "end_date": null, 
    "title": "SolidWorks 2016 Advanced Part Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/790960_bbc0.jpg", 
    "course_url": "https://www.udemy.com/solidworks-2016-advanced-part-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-12T23:55:59Z"
}