{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this SolidWorks 2016 Advanced Assembly Training course, <strong>expert\nauthor Asif Ahmed, Certified SolidWorks Expert (CSWE)</strong> will teach you how to manage complex\nassembly using the variety of tools in SolidWorks. This course is designed for\nintermediate users, meaning previous experience with SolidWorks assembly is\nrequired. If anyone wants to fill up his/her gap regarding SolidWorks assembly\ntopic, then this is also right course for them.</p>\n\n\n\n\n\n<p><strong><em>Follow along with our expert instructor in\nthis training course to get:</em></strong></p>\n\n\n\n<p>Concise, informative and broadcast-quality SolidWorks Parts\nEssential training videos delivered to your desktop.</p>\n\n\n\n<p><strong>4.0+ hours of HD video tutorials</strong></p>\n\n\n\n<p><strong>Over 66 individual video lectures</strong></p>\n\n\n\n<p><strong>Exercise files</strong> – to help\nyou become proficient with the material.</p>\n\n\n\n<p>The ability to learn at your own pace with our intuitive,\neasy-to-use interface</p>\n\n\n\n<p>A quick grasp of even the most complex SolidWorks 2016 Advanced\nAssembly Training subjects because they're broken into simple, easy to follow\ntutorial videos.</p>\n\n\n\n<p>You will start by learning top down assembly method topics such\nas in-context feature, external reference, virtual parts and so on. This video\ntutorial will then cover how to apply assembly level features including weld\nbead, hole series, belt chain etc. Then this course will also cover lots of\nintermediate topics such as advanced mate type, handling sub-assembly, apply\nmechanical mates and so on. Then, you will learn how to work with advanced\npattern tool such as curve driven, chain driven, sketch driven pattern and so\non. Finally, this course will also cover few advanced topic such as assembly\nconfiguration, fixing mate error etc.</p>\n\n\n\n<p>\n\nOnce you have completed this computer based training course, you will be fully\ncapable of using these tools and techniques to create your own complex assembly\nand get control perfectly using this 3D modeling software. Working files are\nincluded, allowing you to follow along with the author throughout the lessons.\nOne quiz is also added to evaluate your skill after learning this course.</p>\n\n\n\n<p>In this SolidWorks 2016 Advanced Assembly Training video\ntutorial series, you'll quickly have relevant skills for real-world\napplications.</p>", 
    "end_date": null, 
    "title": "SolidWorks 2016 Advanced Assembly Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/810220_20cb.jpg", 
    "course_url": "https://www.udemy.com/solidworks-2016-advanced-assembly-training/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-01T17:41:18Z"
}