{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>In this SolidWorks 2015 Sheet Metal Essential training course, <strong>expert author Asif Ahmed, Certified SolidWorks Expert (CSWE) </strong>will teach you how to work in the SolidWorks Sheet Metal environment. This course can be used to help you prepare for the Sheet Metal Certification, and is designed for users that already have a fundamental understanding of SolidWorks.<br></p><p style=\"\"><br style=\"\"> You will start by learning how to create a Sheet metal part, then jump into learning about essential feature such as base flange, edge flange, miter flange, bend table, and bend allowance and so on. From there, Asif will teach you how to convert solid body to sheet metal part. This video tutorial will also cover how to make custom design library feature such as cut, forming tools etc. You will also learn how to control bend note and export DXF or DWG format of flat pattern.</p><p style=\"\"><strong><em>Follow along with our expert instructor in this training course to get:</em></strong></p><p style=\"\">Concise, informative and broadcast-quality SolidWorks 2015 Sheet Metal Essential training videos delivered to your desktop.</p><p style=\"\"><strong>3.0 + hours of HD video tutorials</strong></p><p style=\"\"><strong>Over 49 individual video lectures</strong></p><p style=\"\"><strong>An online quiz (20 questions)</strong> - to test what you've learned in SolidWorks Sheet Metal topics</p><p style=\"\"><strong>Exercise files</strong>– to help you become proficient with the material.</p><p style=\"\">The ability to learn at your own pace with our intuitive, easy-to-use interface</p><p style=\"\">A quick grasp of even the most complex SolidWorks 2015 Sheet Metal Essential subjects because they're broken into simple, easy to follow tutorial videos.</p><p style=\"\"><br style=\"\"> Once you have completed this computer based training course, you will have an in-depth understanding of how to create Sheet Metal parts in the latest version of SolidWorks. Working files are included, allowing you to follow along with the author throughout the lessons.</p><p style=\"\">In this SolidWorks 2015 Sheet Metal Essential training video tutorial series, you'll quickly have relevant skills for real-world applications.</p>", 
    "end_date": null, 
    "title": "SolidWorks 2015 Sheet Metal Essential Training", 
    "price": "30.00", 
    "instructors": "Asif Ahmed", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/417844_0617.jpg", 
    "course_url": "https://www.udemy.com/solidworks-2015-sheet-metal-essential/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-10T00:27:12Z"
}