{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<strong>LEARN THE SECRETS OF PHOTOSHOP DESIGN &amp; MAKE MONEY</strong>  </p>  <ul>  \t<li>MORE THAN <strong>750</strong> STUDENTS HAVE ENROLLED ALREADY</li>  \t<li>50+ PHOTOSHOP LESSONS <em>\" Making Photoshop Design Fun &amp; Easy \"</em></li>  \t<li>LATEST COURSE UPDATE - 23 February<em> 2016</em></li>  \t<li>10+ 5 Star Reviews from really happy &amp; satisfied students</li>  \t<li>NEW! Now includes all PSD files &amp; Fonts, and 2 free font library links</li>  \t<li>No Prior Photoshop knowledge needed<em> \"Guaranteed\"</em></li>  \t<li>All future &amp; additional lectures will always be free of charge</li>  \t<li>No illustrator or other software is needed \"<em>You only need Photoshop\"</em></li>  </ul>    <p>  \t<strong>ARE YOU STRUGGLING WITH SIMPLE DESIGN STUFF</strong>  </p>  <ul>  \t<li>AND MASSIVELY WANT TO IMPROVE?</li>  \t<li>AND DO IT EASILY AND INSTANTLY?</li>  \t<li>AND WITH NO PRIOR PHOTOSHOP KNOWLEDGE?</li>  </ul>  <p>  \t<strong>--------------------------- \" <em>Then this course is for you </em>\" -------------------------------</strong>  </p>    <p>  \t<strong>What This Course Entails:</strong>  </p>  <p>  \t                    I will teach you how to get into <strong>Photoshop Design</strong>; so don't worry if you don't have <strong>prior experience with Photoshop</strong> or other Plugins. Follow my lead and I'll teach you to be good at it! <em>“Seriously\"</em>  </p>  <p>  \t<strong>All my design instructions</strong> form part of a comprehensive guide that can help you to accomplish your goals by applying these skills. During the lesson you get to eavesdrop as I work, giving you some insight as to how I work and what I do.  </p>    <p>  \t<em>The idea is to make designing fun and easy! </em><strong><em>\"Anyone can do this\"</em></strong>  </p>    <p>  \t            Whether you have <strong>previous experience with designing or not</strong>, it doesn't matter. Apply your knowledge for half an hour a day and you could be making huge improvements or even extra cash, just like me.  </p>    <p>  \t<em>\"And I'm not kidding when I say that you need nothing but Photoshop!\"</em>  </p>    <p>  \t<strong>All future</strong> extra lectures and upgrades are always included for <strong>free</strong>. Unconditional Udemy 30 day money-back guarantee - that's my <em>personal promise of your success!</em>  </p>  <p>  \t                    You'll learn  </p>  <ol>  \t<li>How to create / open a new canvas \"To get started\"</li>  \t<li>How to work with only the needed Photoshop tools</li>  \t<li>How to create simple designs and get them done quicker</li>  \t<li>How to create your own custom design shapes</li>  \t<li>A secret to getting your designs to look simple and effective</li>  \t<li>The 2 secrets of getting amazing font libraries for free</li>  \t<li>What you must do get more ideas and creative designs</li>  \t<li>How to create amazing shapes / objects with no artistic or \"design skills\" whatsoever</li>  \t<li>How to design fun, corporate, feminine or even crazy Brands \"Logos\"</li>  \t<li>How to create a business card out of your design \"Print Ready\"</li>  \t<li>How to create amazing badges from scratch</li>  </ol>  <p>  \t                    ... and much, much more!  </p>    <p>  \t<strong>Intrigued yet? Then keep reading!</strong>  </p>  <p>  \t                    As with all my courses: the initial low price will increase shortly. This one is currently <strong>$49</strong> and it will soon upgrade <strong>to $60</strong> so join in now! \"<em>You will have unlimited lifetime access at no extra cost\"  </em>Not just that; <strong>all</strong> <strong>future additional lectures</strong>, <strong>bonuses</strong>, etc in this course are always free.  </p>  <p>  \t                    There's an unconditional, no-questions-asked full 30-day money-back guarantee!I'm known for always offering support in <strong>Udemy,</strong> so feel free to shout out if you're stuck or need assistance. <em>\"I'm here to help\"</em>  </p>  <p>  \t<strong>One final note:</strong> My goal is to teach you how to design anything, so don't stress about not having worked in Photoshop before. <em>\"I do my best to make it simple &amp; fun\"</em>  </p>    <p>  \t<em>I've crammed all my design knowledge into over<strong> 13+ hours of</strong> <strong>tutorial lessons!</strong></em>  </p>      <p>  \t            After going through this course you'll be able to apply your new design skills to <em>Photoshop anything and make some extra cash along the way</em>.  </p>  <p>  \t                    All you have to do is click on the <strong>\"take this course\"</strong> button on the top right corner. You have nothing to lose. In fact, you've got a lot to gain.  </p>  <p>  \t                    Thank you, Manni  </p>", 
    "end_date": null, 
    "title": "Start Designing with the Secrets to Photoshop Design.", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "15 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249998_4483_12.jpg", 
    "course_url": "https://www.udemy.com/the-secrets-of-photoshop-design/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-25T07:36:59Z"
}