{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t<span>Does your book tell a story? </span>  </p>  <p>  \t<span>  We are ready to show you how to create a great book using Indesign with Adobe Indesing.   Elevated Seo and Web Design has a cover with chains.  Haha don&#039;t be chained down to your desk get out and see the world.</span>  </p>  <p>  \tSo, What&#039;s your story?  </p>  <p>  \t Tell it through a digital interactive Booklet that represents your business with class.  Better yet, print this book and make a great first impression.  </p>  <p>  \tNot only with these books make a great leave behind you can use them to help you sell!  Really, help you sell, you say?   Yeah, that&#039;s correct.  Use your book to tell your story, selling with a story.  You can be walked through these step by step classes that will show you all the things you need to know about creating a book.  This book is a walk through your business.  </p>  <p>  \tThe truth; this is a great course, and it&#039;s not just about sales, NO.  It&#039;s about InDesign.  Adobe InDesign.   We use the tool to create a book, and we use the book to show you the Tool InDesign.  </p>  <p>  \tThis will help you get your brand marketing message across to the masses and to whom ever you show this to. Prospect, friend or current client they won&#039;t be able to say no, not only that.  This Story board will inspire.  </p>  <p>  \tAre you inspired yet, we want to share inspiration.  Always trying to do better and attract more clients we are taking our marketing to another level to share our story using this Storyboard method.  </p>  <p>  \tWe don&#039;t cover what to do with your booklet after you make it nearly as in-depth as actually creating a good book with a creative storytelling and a compelling message that flows across the business identity.  </p>  <p>  \tThe business identity, branding, story-boarding, these are all creative talents that help you to show your true colors and help you tell your story.  Jump on for a fun ride as we dive into the Elevated story, Do SEO super heroes exist?  </p>  <p>  \tWe are thrilled to help you along in discovering your true talents and telling your story and sharing your message.  Please join a great group of students as we embark on this journey together!  </p>  <p>  \tSee you on the inside.  </p>", 
    "end_date": null, 
    "title": "Storyboard Booklet: Telling your story and learning indesign", 
    "price": "20.00", 
    "instructors": "Andrew Boehm", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/285536_82ee_3.jpg", 
    "course_url": "https://www.udemy.com/creating-a-book-with-indesign/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-08-21T22:41:43Z"
}