{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>Tired of paying too much for graphic software that underperforms? Do you struggle to make those perfect graphics for a project? Introducing The Guide To Free Powerful Graphic Editing Software Tools! Being able to create &amp; edit graphics is a vital skill needed to run your business. This course will cover several free software tools that will help you with editing your graphics. You will learn about: Gimp, Paint.net, Pic Monkey &amp; More!</p>\n\n<p>You could hire somebody and hope they know what they are doing!  Or spend endless hours going through the outdated public videos! Or you can take control, harness your skills, and create beautiful graphics! Update your site, YouTube channel, Facebook, Project, or anything else!<br></p>\n\n\n\n<p>I’m Serving over 9,000 students daily! Across more than 130 countries! With more than 150 five star reviews! This course is updated frequently! I will answer all of your questions! There is even a no questions asked 30 day money back guarantee! When you enroll in this course you have instant lifetime access which includes every update and the ability to reach out to me for help! It is time for you to position yourself for success! Just click the “Take This Course” button now and I will see you on the inside my friend!</p>\n\n\n\n<p><strong>I last updated this course on 12APR2016!</strong></p>\n\n\n\n\n\n<p><strong>UPDATE - 12APR2016: </strong>I updated the intro and outro sections of the course!</p>", 
    "end_date": null, 
    "title": "The Guide To Free Powerful Graphic Editing Software Tools!", 
    "price": "20.00", 
    "instructors": "Success Academy, Steve Dougherty", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/818124_8705_3.jpg", 
    "course_url": "https://www.udemy.com/the-guide-to-free-powerful-graphic-editing-software-tools/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-10T20:36:08Z"
}