{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "  \t  \t\t  \t  \t  \t\t<p style=\"\">  \t\t\t<span style=\"\">Stephen Wells covers his process of sculpting, poly painting, and baking normal maps step-by-step for this Next-Gen Orc Head model. You will learn about various tools and workflow aspects of ZBrush and work your way through the sculpting process and become more familiar with the ZBrush interface and the use of its more powerful features. We&#39;ll start with the very basic level of the orc head, then get it ready for sculpting in ZBrush, and really lay down the details as we flesh the character head out. You&#39;ll learn a very thorough pipeline for creating a great looking asset!</span></p>  \t\t<hr style=\"\" />  \t\t<p style=\"\">  \t\t\t<span style=\"\"><u style=\"\"><strong style=\"\">More about the Instructor:</strong></u></span></p>  \t\t<p style=\"\">  \t\t\t<span style=\"\">Stephen Wells is an expert 3D modeler for characters, props, vehicles, weapons and environments and have created both high and low polygon assets for game productions. He has over 20 years experience in creating a variety of game assets for several different genres (fantasy, sci-fi, combat, superheroes, horror, etc) using 3ds Max, Maya, Photoshop, Zbrush, Mudbox, Topogun, and XNormal.&nbsp;As an enthusiastic instructor, he loves creating video tutorials on a wide variety of subjects including Zbrush, 3DS Max, Topogun, Roadkill, and many more to help students better their skillsets.</span></p>  \t    ", 
    "end_date": null, 
    "title": "The Complete Orc Bust Sculpting Course with ZBrush", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "7 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/83318_a0b0_4.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-the-complete-orc-bust-sculpting-course-with-zbrush/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-25T00:25:58Z"
}