{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "  \t  \t\t  \t  \t  \t\t<p style=\"\">  \t\t\t<span style=\"\">In this Complete Beginner&#39;s course, we cover the absolute basics of getting you started using Maya with a focus on games, starting from the absolute first time opening the software - all the way through modeling, unwrapping, and texturing your first game asset! We&#39;ll start off with some basic introductions to the UI and software, and dive right in to many of the common tools you&#39;ll need for game asset modeling.</span></p>  \t\t<p style=\"\">  \t\t\t<span style=\"\">&quot;Learn by doing&quot; as we take you through the complete process of modeling our military style radio prop, unwrap the asset, and cover basic texturing techniques for the asset. If you&#39;ve ever wanted to learn the important features of Maya for Games, but weren&#39;t sure where to go, this course has you covered!</span></p>  \t\t<p style=\"\">  \t\t\t&nbsp;</p>  \t\t<p style=\"\">  \t\t\t<span style=\"\"><u style=\"\"><strong style=\"\">About the Instructor:</strong></u></span></p>  \t\t<p style=\"\">  \t\t\t<span style=\"\">Justin Harrison is a Character and Technical Animator with more than 7 years experience in the game development industry. Currently, he is working for Molten Games in Del Mar, CA on an unannounced title. Previously he has worked for for both Activision and Sony on titles such as The Bourne Conspiracy, Ghostbusters: The Game, as well as Transformers: War for Cybertron to name a few. Justin holds a BFA in Digital Art and Animation from the College for Creative Studies, and has a generalist skill set that ranges from artistic modeling and asset creation, to motion capture and keyframe animation, to technical rigging and character setup.</span></p>  \t    ", 
    "end_date": null, 
    "title": "The Complete Beginner's Guide to Maya for Games", 
    "price": "20.00", 
    "instructors": "3dmotive LLC", 
    "commitment": "8 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/82552_e189_6.jpg", 
    "course_url": "https://www.udemy.com/3dmotive-the-complete-beginners-guide-to-maya-for-games/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-23T06:16:53Z"
}