{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>After Effects is the professional compositing tool of choice learn it today</strong></p><p><strong></strong>Get started with Adobe After Effects, this course aims to give you a solid foundation for future development in Adobe After Effects.</p><p>Create stunning special effects and adjustments to your footage or images using this truly fantastic piece of software, if your already familar with Photoshop you will find this software quite easy to pick up, I say quite easy however there is loads of new things to learn!</p><p><strong>The foundations</strong></p><p><strong></strong>This course aims to get you ready for more intermendiate/advanced courses, I have tried to only concentrate on the concepts and methodology behind After Effects with this new toolset of skills it will be easier for you to work through more advanced topics in the future or develop your own new ideas.</p><p><strong>The Course</strong></p><p><strong></strong>During this course we will look at the following, spending more time on the essentials!</p><ul><li>Importing and exporting footage and images</li><li>Looking at how compositing works</li><li>How to Key or cut out images and footage using Keyers, Mask and a quick look at rotoscoping</li><li>Applying adjustments to our media</li><li>Applying effects to our media</li><li>Looking at and changing the composition settings</li><li>How the time line and set keys work</li></ul><p>And a few more things besides :)</p><p><strong>Whos the course for?</strong></p><p><strong></strong>This course is especially for beginners to After Effects<strong></strong></p><p><strong>What do I need?</strong></p><p><strong><strong></strong></strong>A copy of CS6 or up how ever most backdated version should work as I use pretty basic things during the course</p><p><strong>Where do I go from here?</strong></p><p><strong></strong>With this course completed you should be ready to move on to intermediate projects, udemy has lots!! or follow my next training in the series...</p><p><strong>Final Thoughts</strong></p><p>I know your going to love this course and After Effects it is truly amazing what you can do only limited by your imagination!</p><p>Go have fun...<strong></strong><br><strong></strong></p>", 
    "end_date": null, 
    "title": "The Essential Beginners Course to Adobe After Effects CS6", 
    "price": "20.00", 
    "instructors": "David Newton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/753654_48aa.jpg", 
    "course_url": "https://www.udemy.com/the-essential-beginners-course-to-adobe-after-effects/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-05T18:32:51Z"
}