{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>\t<strong style=\"\"> THE BIGGEST &amp; MOST POPULAR PHOTOSHOP COURSE ON UDEMY </strong>  </p>  <ul style=\"\">\t<li>MORE THAN <strong style=\"\">117000</strong> STUDENTS HAVE ENROLLED ALREADY</li>\t<li><strong style=\"\">110+</strong> PHOTOSHOP LESSONS <em style=\"\">\" Making Photoshop Fun &amp; Easy \"</em></li>\t<li>LATEST COURSE UPDATE - <em style=\"\">20 August 2015</em></li>\t<li><strong style=\"\">500+</strong> 5 Star Reviews from really happy &amp; satisfied students</li><li>All Work Materials are provided &amp; ready for you to download</li>\t<li><strong style=\"\">No Prior</strong> Photoshop knowledge needed<em style=\"\"> \"Guaranteed\"</em> </li>\t<li>Full <strong style=\"\">lifetime access</strong> to the complete course</li>\t<li>All future &amp; additional lectures will always be free of charge</li>\t<li><strong style=\"\">No</strong> illustrator, plugins or other software is needed \"<em style=\"\">You only need Photoshop\"</em></li>  </ul>    <p>\t<strong style=\"\">ARE YOU STRUGGLING WITH ADOBE PHOTOSHOP?</strong>  </p>  <ul style=\"\">\t<li>AND MASSIVELY WANT TO IMPROVE?</li>\t<li>AND DO IT EASILY AND INSTANTLY?</li>\t<li>AND WITH NO PRIOR PHOTOSHOP KNOWLEDGE?</li><li>AND WITH MY WORKING FILES?</li>  </ul>  <p>\t<strong style=\"\">--------------------------- \" <em style=\"\">Then this course is for you </em>\" -------------------------------</strong>  </p>    <p>\t<strong style=\"\">What This Course Entails:</strong>  </p>  <p>\t I will teach you how to get into photoshop, so don't worry if you don't have <strong style=\"\">prior experience with photoshop</strong> or other plugins. Follow my lead and I'll teach you to be good at it! <em style=\"\">“Seriously\"</em>  </p>  <p>\t<strong style=\"\"> All my photoshop instructions</strong> form part of a comprehensive guide that can help you to accomplish your goals by applying these skills. During the lesson you get to eavesdrop as I work, giving you some insight as to how I work and what I do. You will also be able to download all my work files and work along with the exact same files.</p>  <p>\t The idea is to make photoshop fun and easy! <em style=\"\"><strong style=\"\">\"Anyone can do this\"</strong></em>  </p>  <p>\t Whether you have <strong style=\"\">previous experience with photoshop or not</strong>, it doesn't matter. Apply your knowledge for half an hour a day and you could be making huge improvements or even extra cash, just like me.</p>  <p>\t<em style=\"\">\"And I'm not kidding when I say that you need nothing but photoshop!\"</em>  </p><p><strong style=\"\"><em style=\"\">What other say about this course: By<em style=\"\"> Ivan Synerd</em> </em></strong></p><p><em style=\"\">This course gave me more than I ever imagined I would get. I learned how to use Photoshop from start to finish all the way! \"Thank You\" Not only how to Retouch images, but also loads of techniques, great PS tip's and workflows. I watched most of his free youtube videos, but this course offers way more then his youtube channel. I really like how Manni literally teaches step by step what to do and how to do it. I only wish I had found this course earlier. Definitely recommend it. Thank you for the life skills Manni!</em></p>  <p>\t All future extra lectures and upgrades are always included for free. Unconditional Udemy 30 day money-back guarantee - that's my <em style=\"\">personal promise of your success!</em>  </p>  <p>\t You'll learn</p>  <ol style=\"\">\t<li>How to become a photoshop expert \"Guaranteed\"</li>\t<li>How to improve your photoshop skills dramatically</li>\t<li>Understand all photoshop basics and go beyond</li>\t<li>Learn more than 50+ different photoshop techniques</li>\t<li>How to get work done, quicker in photoshop</li>\t<li>How to go beyond the level of intermediate photoshop user</li>\t<li>How to use photoshop in order to retouch Cars</li>\t<li>How to use photoshop in order to retouch Portraits</li>\t<li>How to use photoshop in order to retouch Beauty &amp; Fashion</li>\t<li>How to use photoshop in order to retouch your personal work</li>\t<li>How to create amazing color casts and color grades</li>\t<li>How to install, work and understand photoshop plugins</li>\t<li>Learn about photoshop secrets techniques \" More about this in my Photoshop secrets course\"</li>  </ol>  <p>\t ... and much, much more!</p>    <p>\t<strong style=\"\">Intrigued yet? Then keep reading!</strong>  </p>  <p>\t As with all my courses: the initial low price will increase shortly.\"<em style=\"\">You have unlimited lifetime access at no extra cost\"</em>  </p>  <p>\t Not just that; <strong style=\"\">all</strong> <strong style=\"\">future additional lectures</strong>, <strong style=\"\">bonuses</strong>, etc in this course are always free. There's an unconditional, no-questions-asked full 30-day money-back guarantee!</p>  <p>\t I'm known for always offering support in <strong style=\"\">Udemy,</strong> so feel free to shout out if you're stuck or need assistance. <em style=\"\">\"I'm here to help\"</em>  </p>  <p>\t<strong style=\"\">One final note:</strong> My goal is to teach you photoshop, so don't stress about not having worked in photoshop before. <em style=\"\">\"I do my best to make it simple &amp; fun\"</em>  </p>  <p>\t I've crammed all my knowledge about photoshop into over<strong style=\"\"> 100 photoshop</strong> <strong style=\"\">tutorials!</strong> After going through this course, you'll be able to apply your new skills to <em style=\"\">photoshop anything and make some extra cash along the way</em>.</p>  <p>\t All you have to do is click on the <strong style=\"\">\"take this course\"</strong> button on the top right corner. You have nothing to lose. In fact, you've got a lot to gain.</p>  <p>\t Thank you, Manni</p>", 
    "end_date": null, 
    "title": "The Platform's Biggest & Most Popular Photoshop Course", 
    "price": "20.00", 
    "instructors": "Manfred  Werner", 
    "commitment": "27.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/16799_e077_16.jpg", 
    "course_url": "https://www.udemy.com/photoshoptraining/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-04-24T07:34:27Z"
}