{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong>Note:This is the latest course updated in March 2016.Don't worry about Adobe Photo CC.You can download it from Lecture 3 and Lecture 4.</strong></p><p><strong>Thanks for checking out my course!</strong></p><p>This course is without doubt the most comprehensive learning resource on Photoshop CS6 available. Each topic is broken down into a series of simple to follow stages. The lessons are clearly presented and use an unique teaching method that boosts learning and aids retention, it's never been this easy to learn Photoshop.</p><p>Right from the start, you will learn professional Digital Painting and photo correction techniques that really are used by the pros. The course starts by building a solid understanding of the fundamentals of image editing. Once the basics of Photoshop have been outlined, the course moves on to cover more advanced topics, with each passing lesson your knowledge of Photoshop will expand as the author shows new tools and the creative way they can be employed to great effect. The only pre-requisite for this course is the desire to learn and create stunning digital imagery.</p><p>You will quickly learn how to leverage advanced features like curves, layers and masks to produce amazing digital imagery. By the conclusion of this course, you'll have developed the skills and creative insight to use Photoshop CS6 to a very high level, you will be an expert of digital imagery.</p><p>Let's get started!</p>", 
    "end_date": null, 
    "title": "The Complete Digital Painting Course With Adobe PhotoShop", 
    "price": "20.00", 
    "instructors": "Star Technology Base", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/793572_843e.jpg", 
    "course_url": "https://www.udemy.com/the-complete-digital-painting-course-with-adobe-photoshop/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-15T13:09:41Z"
}