{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>This course’s orientation is NOT primarily ‘how to use’ PaintShop Pro. Our main focus is based around the business of creativity, with the software being used purely as a preference over other editing suites.</p>  <p>The course is more about an attitude than a way of working too, presenting a series ‘pre-commercial advisories’, for Students who are looking to excel in the world of design. By the end of the course, we will feel that we’ve done a good job if our Students have learned how to make complex considerations, prior to making a single mark on paper, or indeed the screen.</p>  <p>By the time our Students have finished, they won’t just understand the best way to apply their craft, but how to construct it in such a way, that they can communicate moods, messages and complex undertones within their compositions.</p><p>At the end of this course, Students will have learned how to implement valuable thought processes whilst producing a piece of design, setting them apart from the generic efforts of their contemporaries </p><p>Aspects learned in this course are inclusive of, but not limited to:  </p><ul><li>Gaining extended familiarity with PaintShop Pro.</li></ul><ul><li>Using well considered ‘details’ to make a piece successful.</li></ul><ul><li>Applying Design theorem and established principles </li></ul><ul><li>Developing advanced conceptual thinking in order to make your design ‘stand out’.</li></ul>", 
    "end_date": null, 
    "title": "Thinking Like an Art Director with PaintShop Pro", 
    "price": "50.00", 
    "instructors": "Corel Corporation", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675770_93f3_2.jpg", 
    "course_url": "https://www.udemy.com/thinking-like-an-art-director-with-paint-shop-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-20T17:10:41Z"
}