{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p><strong></strong></p>\n\n<p><strong>Last UPDATED on 7<sup>th</sup> June 2016</strong>---------------------------------------------------------------------</p>\n\n\n\n\n\n<ul><li>\n\n\n\nLecture Added: Using Layer Comps for UI Design (Lecture 31)</li></ul>\n\n<p><strong>Upcoming Lectures</strong> ---------------------------------------------------------------------------------------------------------------------</p>\n\n\n\n\n\n<p>UI Design Career Guide<strong> (Coming Soon)</strong></p>\n\n\n\n\n\n<p>=====================================================================</p>\n\n\n\n\n\n<p>Do you think that UI Designers use Photoshop in the same way as other Designers?</p>\n\n\n\n\n\n<p>Do you know what are the basic concepts, settings and tools UI Designers know and you don’t?</p>\n\n\n\n\n\n<p><strong>So if you want to learn Photoshop for UI Design and upgrade your confidence and Skill levels in Photoshop; this course is for YOU. </strong>This course is equally<strong> good for Beginners and Experts </strong>so don’t worry if you haven’t used Photoshop before.</p>\n\n\n\n\n\n<p>Most of us don’t know the basic settings, shortcuts, tools and extension we need in Photoshop to become a UI Designer, we make same mistakes and keep on wasting time online searching for different settings and answers to common UI Design issues and problems.</p>\n\n\n\n\n\n<p><strong>What you will learn?</strong></p>\n\n\n\n\n\n<ul><li>This course will cover in detail about all the basics      of Photoshop for UI Design. </li><li>Course core focus is UI Design so you can apply all this      knowledge to Landing Page design, Web App or Mobile App Design</li><li>This course will cover all the Common Shortcuts, tools      and Secret Extensions to increase speed and efficiency in Photoshop</li><li>Learn about basics of Light and Shadow concepts in UI      Design</li><li>How to use patterns and Gradients in UI Design</li><li>Learn how User Interface Designers use Photoshop in      their daily routines</li><li>Get to know how to create and use guides using      Photoshop Extensions</li><li>Learn how to install and use Photoshop Extensions for      UI Design purpose</li><li>Learn how to use Gradients and color overlays to create      Modern Header designs</li><li>Know about all the plugins and extensions used by UI Designers use all the time</li><li>Learn how to create and use Grids in Photoshop</li><li>Learn to design IOS Iphone App using Photoshop</li><li>Image Editing techniques for removing background</li><li>Image color adjustment basics for UI Designers</li></ul>\n\n\n\n\n\n<p><strong>Course Structure</strong></p>\n\n\n\n\n\n<ul><li>More than 20 Practice Examples and design Challenges to      get you better at UI Designing</li><li>Quizzes to test your knowledge of Photoshop regarding      UI Design</li></ul>\n\n\n\n\n\n<p><strong>Student Request Lecture Series</strong></p>\n\n\n\n\n\n<p>A lot of lectures are added on weekly basis on the request of my current students so join in and request any design problem or anything new you want to learn</p>\n\n\n\n\n\n<ul><li>How to Install Photoshop ZXP extensions in CC2015 (Student Request Lecture)</li><li>Dribbble Styled Dashboard Graphs and Stats Design Exercises (Student Request Lectures)  </li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><strong>Take This Course Now </strong>and Start your career as a UI Designer</p>", 
    "end_date": null, 
    "title": "UI Design in Photoshop from Scratch - Become Top UI Designer", 
    "price": "20.00", 
    "instructors": "Muhammad Ahsan Idrisi", 
    "commitment": "8.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/381524_7136_15.jpg", 
    "course_url": "https://www.udemy.com/learn-photoshop-for-ui-design-from-scratch/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-31T09:32:55Z"
}