{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">NEW CONTENT ADDED: Updated September 2014!</strong><br style=\"\">  \t<strong style=\"\"></strong>  </p>  <p style=\"\">  \t<strong style=\"\">If you are not happy with this course you can get a refund within 30 days. No questions asked!</strong><br style=\"\">  </p>  <p style=\"\">  \t        This complete VFX course is designed with the beginner in mind who would like to either enter a career in Visual Effects or create their own visual effects at home. This course will teach you what you need to know to land a job as a Digital Compositor as well as cover the fundamentals of compositing for those looking to add effects to their own videos or films.  </p>  <p style=\"\">  \t                     Digital Composting is a vast and extensive subject and it can be hard for those starting out to know what areas they should be proficient in to make it in the industry. It doesn&#039;t need to be overwhelming and difficult. I will show you what is important to know and what you can learn on the job. You will save time and avoid covering topics which can be confusing and unnecessary.  </p>  <p style=\"\">  \t                     This course will train you on the core fundamentals and skills that employers are looking for when hiring a new compositor. Here you will learn what you need to get your foot in the door.  </p>  <p style=\"\">  \t              Visual Effects are often an expensive pipe-dream for smaller smaller makers on a budget so if you are looking to create your own visual effects then this course will allow you to take your films to that next level.  </p>  <p style=\"\">  \t                    Topics include:  </p>  <ul style=\"\">  \t<li style=\"\">The VFX Pipeline</li>  \t<li style=\"\">What is Nuke?</li>  \t<li style=\"\">How to use the Nuke interface</li>  \t<li style=\"\">Compositing Theory</li>  \t<li style=\"\">Scene Setup</li>  \t<li style=\"\">Rotoscoping</li>  \t<li style=\"\">Color Correction</li>  \t<li style=\"\">Transformation &amp; Tracking</li>  \t<li style=\"\">Keying</li>  \t<li style=\"\">Retiming Footage</li>  \t<li style=\"\">Rendering</li>  </ul>", 
    "end_date": null, 
    "title": "VFX Digital Compositing in Nuke: A Beginners Guide", 
    "price": "20.00", 
    "instructors": "Blake Muir", 
    "commitment": "15.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/61956_8a69_4.jpg", 
    "course_url": "https://www.udemy.com/nuke-vfx/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-25T07:45:07Z"
}