{
    "selfpaced": true, 
    "topic_name": [
        "Design"
    ], 
    "description": "<p>  \t         Hi... Chances are... If you&#039;ve seen more that one online tutorial in the last 8 yrs... then you already know the sound of my voice!  </p>  <p>  \t          My name is Stephen Luc, I&#039;m a member of the Empoweria team. I&#039;ve been a Video Course Creation Pro for the last 8 Years.  </p>  <p>  \t          You may even be one of the over 1000 students taking one of the two courses I have put on Udemy through Empoweria in the last two months!  </p>  <p>  \t          ...It&#039;s been a wonderful journey serving thousands of customers some here on Udemy and others from my own membership website! Over the years, I have also enjoyed watching my customers build $4-6 figures using private label rights videos I have made!  </p>  <p>  \t          The popularity of my video courses have also given me the chance to work behind the scenes with many of the top marketers on some of the biggest launches online!  </p>  <p>  \t          This popularity has brought me a lot of work creating videos, and it has forced me to develop my own formula for creating high quality video tutorials at record speed to keep up with demand! <br style=\"\">  \t<br style=\"\">  \t          This may sound crazy but since 2005, I have PERSONALLY CREATED OVER 2500 videos and over 140+ unique video training products!<br style=\"\">  \t<br style=\"\">  \t          Talk about a FRENZY OF VIDEO TUTORIAL PRODUCTION! <br style=\"\">  \t<br style=\"\">  \t          Most importantly to some, is the fact that my video courses have gone on to generate hundreds of thousands of dollars in sales for myself and the people who I have made them for! <br style=\"\">  \t<br style=\"\">  \t          I&#039;ve searched and searched, so I feel pretty confident that I&#039;ve got something special here that no other video developer in our industry has - because I&#039;ve seen no one else come close to these numbers! <br style=\"\">  \t<br style=\"\">  \t          For instance, recently I created 75 video training course with each video running between 5-20 minutes in just 3 weeks! These videos alone earned over $100,000!  </p>  <p>  \t          The demand for video tutorials has simply skyrocketed in the last few years! <br style=\"\">  \t<br style=\"\">  \t          Now you can take advantage of my 8 yrs of experience - as I divulge every trick, tip, and video creation secret that I have uncovered in making over 2,500 successful videos in the 17 video, video course!  </p>  <p>  \t          In less than 2 hours you&#039;ll be making video tutorials like a PRO! <br style=\"\">  \t<br style=\"\">  \t          The 17 are broken up into 5 sections covering the &quot;Video Philosophies&quot; I have developed over the years - all the way to explaining the mechanics and tricks I use to render videos more quickly than you&#039;ve ever thought possible! <br style=\"\">  \t<br style=\"\">  \t          If you have a passion for teaching, and yearn to create top notch tutorial videos, quickly and for profit, then this Udemy Video Course is for YOU!  </p>", 
    "end_date": null, 
    "title": "Video Creation Fast Track", 
    "price": "20.00", 
    "instructors": "Promote Labs, Inc Team, Stephen Luc", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/74340_23be_8.jpg", 
    "course_url": "https://www.udemy.com/video-creation-secrets/", 
    "currency": "USD", 
    "subject_name": [
        "Design Tools"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-08-06T05:20:46Z"
}