{"selfpaced": true, "topic_name": ["Higher Education"], "description": "\n\n                    \n                    \n                    College can be confusing and intimidating, but U101 can help. If you were just admitted to college and are nervous about what the next step in life might look like, this course is for you. If you are the parent of a newly admitted college student and curious about what college life is like, this course is also for you. \n\nWhile your specific college will, no doubt, provide additional orientation material, we wanted to give some basic information about what life might be like at a large American University. You might be years away from college or enrolled right now; either way, U101 has some excellent advice from college students, professors, administrators, and staff.\n\nAt the conclusion of the course, learners should:\n1. Understand the basics of how colleges and universities operate. \n2. Identify and describe what faculty are looking for in college-level academic work. \n3. List some effective study strategies. \n4. Identify some strategies for exploring and selecting a major. \n5. Identify the various types of grants and scholarships available and describe the steps involved in applying to these.\n6. Discuss the college life, with special attention to the benefits/limitations of living on or off campus. \n7. Identify some strategies for getting the most out of campus life activities (investigating student clubs, fraternities, sororities, etc.).\n\nThe course is divided into 4 weeks/8 lessons, which provide an overview of the different aspects of college life. If you were just watching the videos and looking at some of the links, the whole course would take about 4-5 hours. \n\nWeek 1\nLesson 1. Welcome to U101!\nLesson 2. Understanding the Nature of College\n\nWeek 2\nLesson 3. Succeeding as a Student\nLesson 4. Building Your Major\n\nWeek 3\nLesson 5. Financing Your Education\nLesson 6. Living On and Off Campus\n\nWeek 4\nLesson 7. Getting Involved in Campus Life\nLesson 8. Conclusion\n\nPlease join us for a short exploration of modern American Colleges. Hopefully, this course can help demystify your upcoming college experience.\n\n                                            Syllabus\n                        Welcome to U101!Welcome to University 101. This short course will help you get the most out of your college experience. We want to help incoming undergraduates understand their universities. This opening module lays out what the course is and how you will navigate this online space. Understanding the Nature of College   Now that we have discussed the basic approach in this course, we can dive into the material. A good place to start would be understanding how the university operates. Modern universities are large, complex organizations employing thousands of different teaching and researching faculty, all of who have slightly different roles. College isn’t simply larger than high school, it is structured differently. Succeeding as a StudentYou’re coming to college to get an education. Classes will take up a significant amount of your time, so we should discuss some strategies for success. As discussed in the last module, high school differs significantly from college. Incoming freshmen are often most worried about the classes. You have much more flexible time, but that time needs to be filled with self-directed study. In this unit, we’ll talk a bit about how understanding these classes and studying effectively for them. Building Your EducationOne of your big questions at college is, “What should I major in?” This module will tackle this question head on. In all honesty, what you major in matters less than how you prepare yourself to be an expert in an area. This requires you to move beyond simply your major and take ownership of your intellectual and professional development during your college years.Financing Your EducationPaying for college is a challenge. This module will talk about some strategies for budgeting your money while at college and all the options available to you for funding. There are so many different resources out there to help you pay for college. Regrettably, these are so broad that students remain unaware of them. This module should direct you to some of the most fruitful areas for finding funding. Living On and Off CampusAre you going to live on-campus or off? There are strengths and benefits to doing both. This module will talk to some students about their experiences living on and off campus. Wherever you live while at college, odds are that you will experience homesickness at some point. This is entirely natural. We’ll talk a bit about why this happens and identify a few strategies for effectively dealing with homesickness. Getting Involved in Campus LifeGoing to your classes is probably the most important thing you’ll do during your time here. But it won’t be the only thing. Campus clubs and groups offer you a great opportunity to experience new things and ideas during your time here. They can introduce you to lifelong friends and enrich your education in untold ways. This module will talk about some options for getting involved in campus life. ConclusionHere we are at the end of this online orientation. Thank you for participating. This module will recap the key themes from the course and help you figure out what to do next as you prepare to enroll in college. Good Luck!\n                                    ", "end_date": "2015-11-29T00:00:00Z", "title": "U101: Understanding College and College Life", "price": 0, "instructors": "Dr. Matt McGarrity and First Year Programs", "institution_name": ["University of Washington"], "commitment": "", "subject_name": ["Education & Teaching"], "course_url": "https://www.coursera.org/learn/college-life", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2015-11-01T00:00:00Z"}