{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>Are you struggling to get photography clients? </p><p>Do people seem interested in your services but don't seem to be booking?</p><p>I know how you feel, I've been there.</p><p>Leads would come in the door but they would end up telling me I was \"too expensive\" or \"they'd think about it.\"</p><p>Then I learned about 7 persuasion principles that completely changed my life and business.</p><p>My name is Ben Hartley and I want to teach you how to grow your photography business using persuasion triggers.</p><p><strong>Why am I qualified to teach this course?</strong></p><ul><li>I built photography business from zero to 400k/yr</li><li>My work has been featured on CreativeLive, The Today Show, and The Huffington Post</li><li>Voted #1 wedding photographer in Ohio by the Fearless Photographers organization</li></ul><p><span style=\"\"><br></span></p><p><strong>These 7 psychological tricks can be applied to ANY photography business to INCREASE your bookings and revenue.</strong></p><p>This course is broken down into 7 videos, with each video following the same structure.</p><p>First we'll define the persuasion trigger each video is about.</p><p>Next I'll provide an example of this trigger outside of the photography industry.</p><p>Then I'll give an example of how I implemented that persuasion trigger within my own wedding photography business to book more clients and increase my revenue.</p><p>Enjoy!</p><p><br></p>", 
    "end_date": null, 
    "title": "7 Tricks To Instantly Book More Photography Clients", 
    "price": 0, 
    "instructors": "Ben Hartley", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/604144_0768_3.jpg", 
    "course_url": "https://www.udemy.com/book-more-photography-clients/", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-06T18:17:17Z"
}