{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><em>LATEST: Course Update - November 2015</em><span></span></p><p>  \t      All right! So you're a pretty good photographer. You're friends, family and relatives tell you so. You're asked to cover many family functions and possibly may be asked to do some of their portraits.  </p>  <p>  \t      You've even wanted to give wedding photography a go and thought about it for some time but didn't know where to start. Well, fear not!  </p>  <p>  \t      With the proper training and knowledge, you have a great opportunity for being able to make a pretty good income in doing what you love to do. With this course, I'll take you step by step from the beginning stages.  </p>  <p>  \t      You'll learn not only about the equipment that is important but how to get the most from the equipment you are using. You'll also learn to see and use light as I show you what to look for.  </p>  <p>  \t      You'll also get a behind the scenes look as I discuss and show you how we document the wedding story. Then by adding the necessary beautiful classic portraits along with a touch of romance and adventure, the wedding story becomes complete. The result is a collection of beautiful images that now need to be showcased and I'll show you how.  </p>  <p>  \t      With over 12 hours of instruction, here's some of what is covered:  </p>  <p>  \t      1. Camera Bodies, Lenses, Flash Units, &amp; More - Learn about some of the camera bodies I have used and use today for wedding photography along with some current recommendations.  </p>  <p>  \t      2. Understanding Lens Speed &amp; Focal Length - Learn how the characteristics of the lens affect your photographs and use it to your advantage.  </p>  <p>  \t      3. The Lens - Final thoughts - What if you were on a tight budget and are limited to lens choices, what would they be? Here I discuss several lenses that I recommend for wedding photography and show the type of images they produce.  </p>  <p>  \t      4. Making The Most From On-Camera Flash - In this segment, you'll learn the many uses of on-camera flash along with the many accessories that can help you get the most from your flash.  </p>  <p>  \t      5. The Double Light Advantage - See the different ways a second light can be used to add not only impact but dimension to your images.  </p>  <p>  \t      6. Other Must-Have Accessories - Here we take a look at some camera accessories and learn how they can make your photographic life so much easier while getting great results.  </p>  <p>  \t      7. Getting Creative With Shutter Speed - Learn how shutter speed can affect your images and what you can do to minimize or eliminate blur caused by camera shake. You'll also learn about the effects that can be achieved when ambient light is mixed with flash. We also take a look at getting creative with rear curtain sync.  </p>  <p>  \t      8. The Wedding Story Documentary - Here I talk about the documentary style of wedding photography and its importance. However, by adding two additional styles, the wedding story now becomes complete and adds a touch of elegance &amp; romance.  </p>  <p>  \t      9. Pre-Ceremony Photographs -  15 different lectures show how to cover a rehearsal dinner, pre-ceremony photos of the bride, the groom, processional and detail photos. The many emotional sides of the wedding processional continue with images and discussion. I also point out the advantage of using a zoom lens to capture a wide focal length range. No need to change lenses here.  </p>  <p>  \t      10. Indoor &amp; Outdoor Wedding Ceremonies -  Here I discuss many different ceremony photographs you may have the opportunity to photograph. We also talk about tough lighting situations and the many photo possibilities as the bride &amp; groom prepare to walk out after the ceremony. As we look at outdoor weddings, I point out how to look for light to your advantage. Also discussed and shown, is the importance of using a lens that can take you from a wide focal length to telephoto in a second.  </p>  <p>  \t      11. Altar Return Photographs - More on altar return photos as I discuss lighting and the use of proper natural posing, making the altar return photos fun, yet done in a timeless classical style.  </p>  <p>  \t      12. Outdoor Portraits After Wedding - In this segment I show and explain how you can get some of the most beautiful photographs of their wedding day, their outdoor wedding portraits.  </p>  <p>  \t      13. Finding The Light - Here I show the first thing I do when I enter an outdoor location, what to look for and make the best of the light that is available.  </p>  <p>  \t      14. On-Location Portraits After Wedding - When doing wedding portraits on-location, there are many things that you can do to help you possibly get award winning images for the bride &amp; groom. In part 1, I discuss the equipment I use, what to look for and even talk about and show you how a little adjustment in posing can make the difference between a good photograph and a great one.  </p>  <p>  \t      15. Photographing The Reception -  I talk about how receptions can vary from region to region and show images as I talk about some of the things that take place at the wedding reception. Here I start with the introduction and the many photo possibilities available.  As the wedding reception approaches the end, photo coverage continues with images that lead us to completion of the bride &amp; groom's beautiful wedding story.  </p>  <p>  \t      16. Preparing &amp; Showing Your Images - Now that you've completed photographing your wedding and of course, you've done a great job! Here I talk about the important steps that you should take to not only safeguard your images but to make your workflow more efficient.  </p>  <p>  \t      17. Creative Effects Filters &amp; Enhancements - Here we take a look at the process of fine-tuning and enhancing some of your images and we start with one of my favorite filters. Using some of these filters and enhancements can set you apart easily from amateur to experienced professional. It also puts you more in demand for the bride &amp; grooms looking for high caliber wedding photography.  </p>  <p>  \t      18. Choosing a Wedding Album Style - See some of the most beautiful weddings albums made and two important reasons you must use albums like these in your wedding packages.  </p>  <p>  \t      19. The Ideal Wedding Dream Team - Learn why you must put together a wedding team and how this benefits you in several ways.  </p>  <p>  \t      20. Booking Your First Wedding - Several ways you can go about booking your very first wedding and once you have a few weddings under your belt, what you can do to turn your bookings into a snowball effect.  </p>  <p>  \t      21. Handling Your Competition and Much More!  </p>  <p>  \t      Take this course today. Someone has to not only photograph the many weddings that are out there but if done properly you can earn a very good income.  </p>", 
    "end_date": null, 
    "title": "A Crash Course In Wedding Photography", 
    "price": "25.00", 
    "instructors": "Photofonz Media", 
    "commitment": "12.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/160698_2cbc.jpg", 
    "course_url": "https://www.udemy.com/a-crash-course-in-wedding-photography/", 
    "currency": "USD", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-09T21:58:51Z"
}