{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>My passion is photography and I've been in the photography business for a long time now, over 4 decades. And in this course, I'd like to share with you the many things that I've learned and experienced in my great wedding photography adventure. And it really has been an adventure.</p>\n\n<p>And just in a nutshell,  so you know where I'm coming from, and please understand, I am saying this not to brag but, just so you know that I've been there and not someone who just read a book, took a course, did some research on the business of wedding photography and try and tell you how to do it.</p>\n\n\n\n<p>As they say, I've walked the talk for many years and I've built a very successful wedding and portrait photography business. And along the way I've won many accolades and earned my degrees for my photography, along with many ribbon &amp; trophy awards and Epcot displays.</p>\n\n\n\n\n\n<p>But, enough about me. You can read by full bio in the profile section. </p>\n\n\n\n\n\n<p>So, you’re probably wondering, what this course can do for you. Well, since I've been involved in the many aspects of running a wedding photography business starting part time in our apartment, then built a home studio that was very successful that we expanded into a commercial shopping center location for 20 more years.</p>\n\n\n\n\n\n<p>Then to make a long story short, sold my PA studio, moved to NC and pretty much started over on a smaller scale and came full circle as we renovated a home studio, that included a camera room, sales room and office. So, I’ve been there &amp; back.</p>\n\n\n\n\n\n<p>And now that I've recently retired from the business of wedding photography, I'm able to devote my time to train other photographers who also have the passion and share some very valuable information with you.</p>\n\n\n\n\n\n<p>This course is about making money in the business of wedding photography, not f stops, or apertures. Much of the information in this course will not be found in text books or photography classes.</p>\n\n\n\n\n\n<p>With over 2.5 hours of instruction, here's some of what I reveal to you:</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">1. Getting Starting With No Experience</strong> / NO Experience! No Problem - Every great photographer started somewhere. In this segment I reveal how you can start even with no experience.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">2. Start Your Business, Virtually Stress-Free </strong>- Once you gain experience, consider this as your next step in the business of wedding photography.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">3. Taking Your Next Step As A Shooter</strong> - This method may be for those who want to be paid reasonably well, without major hassles and big demands on your time.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">4. A Look At Two Ways For You To Run Your Business</strong> - Here we discuss the two possible ways for you to build &amp; run your business.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">5. Using Leverage In Your Business</strong> - I reveal the method I use to attract people who are looking to learn photography in exchange for their assistance.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">6. What's Expected of Assistants</strong> - Learn what your assistants need to do to make you look good.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">7. Your 2nd Shooter/Main Photographer Sub-Contract Agreement</strong> - Here we discuss some of the things you need to look at legally that can also help run your photo operation more smoothly.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">8. Building Your Foundation</strong>  -  Use these Low Cost Methods/Promotions to Build Your Business.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">9. Building Your Foundation For a Great Business</strong> (Part 1 Logos &amp; Low Cost Advertising Pieces)</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">10. Building Your Foundation For a Great Business</strong> (Part 2 A Look at More Advertising Pieces)</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">11. Using Smartphones &amp; Tablets for Advertising</strong> - Use your smartphone or tablet as a way of getting FREE advertising.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">12. Let The Public Know You Exis</strong>t - Here we discuss more opportunities of getting your name in front of potential clients.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">13. A Story &amp; Lesson in Loyalty</strong> - Why loyalty is another factor in building a business with a solid foundation.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">14. An Important Lesson I learned in Starting Over</strong> - After selling my PA studio, we moved to NC. We decided to buy a home in Cary, NC and renovate it to include a home studio with a camera room, office and sales room. This is where I want to share with you an important lesson I learned in starting over in the wedding photography and portrait business.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">15. Book More Brides Using This simple Sales Method</strong> - Here I discuss how I came across a way to book more weddings using this simple technique.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">16. Sales Letters That Book Weddings</strong> - In this segment I share with you the sales letters I used to book weddings when we moved and started over in North Carolina. You can spend thousands of dollars to hire a copywriter to write letters like this or you can use the letters I'm about to show you.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">17. An Introduction To Packaging But First!</strong> - First we start off with what to do if you are new to wedding photography and how to book your first wedding or two if you feel uncomfortable charging big bucks for your services. Then we flow into wedding packages and the psychology behind them.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">18. Packaging &amp; Perceived Value</strong> - Here we explore what value a name has on your wedding photography packaging and how to make it work to your advantage.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">19. Extending Your Packages to New Levels</strong> - Here's a look at what I discovered when I extended my packing line even further. Then we take a look at two different scenarios you may run into with bookings and how it relates to your packaging.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">20. Packaging Design &amp; Pricing</strong> - A look at how we design our packages - Here's where we start off with a certain amount of profit, then build the package around that.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">21. High End Package Design &amp; Pricing</strong> - Packaging Your High End Services To Clients - As we continue with designing our packages, we take a look at Packaging &amp; Pricing Your High End Services To Clients.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">22. Contract Wording and Payment Policies</strong> - Here we take a look at what information you may want to put into your contract. Then we also talk about using payment policies that insures you get paid for your services.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">23. Putting Studio Policies In Your Contrac</strong>t - By putting these studio policies in our contract, it helped to make our operation run more smoothly.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">24. Handling Wedding Cancellations</strong> - Sooner or later it's going to happen, a wedding cancellation. Here's what you can do about it.</p>\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">25. Show Your Appreciation</strong> - There are several things you can do to show appreciation to your clients. Here are some of the ways I say \"thank you\".</p>\n\n\n\n\n\n<p><strong>And much more.</strong></p>\n\n\n\n\n\n<p>Even if you have some experience in running a wedding photography business, one or two good ideas from this course can help make you many times more than what you paid for this course.</p>\n\n\n\n\n\n<p>And if your new to wedding photgphy and would like to earn a nice income doing just a small number of weddings per year, then this course could save you years of frustration and aggravation with trial &amp; error and put you on the path to making a good income quickly.</p>\n\n\n\n\n\n<p>I truly believe that wedding photography is still very much an art form and a very good income can be derived if one knows how to properly run it as a business. Whether you plan on doing just a few weddings per year or many, consider taking this course to help you get started in the exciting and adventurous business of wedding photography. Enroll today!</p>", 
    "end_date": null, 
    "title": "A Guide to Running a Successful Wedding Photography Business", 
    "price": "40.00", 
    "instructors": "Photofonz Media", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/842420_fdc5.jpg", 
    "course_url": "https://www.udemy.com/a-guide-to-running-a-successful-wedding-photography-business/", 
    "currency": "USD", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-08T00:40:24Z"
}