{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p>LATEST COURSE UPDATE:  November 2015</p><p>  \t    Getting beautiful outdoor and on-location photographs of not only the bride and groom but the wedding party is an important part of the wedding day. When you learn these techniques, your portraits will not only stand out from the competition but you’ll give the bride and groom such a beautiful addition to their wedding story that will be cherished by them and their families the rest of their lives.  </p>  <p>  \t    Please note that this course is part of my “ A Crash Course in Wedding Photography” and contains some of the exact same content as is in the complete course.  </p>  <p>  \t    This 87 minute course starts with a brief discussion on equipment, then, more importantly, goes into great detail about lighting. It reveals how important lighting is to great photography, what the first thing to look for is when arriving at a location. By finding the right light, then learn how to use light to your advantage.  </p>  <p>  \t    By looking at the many images shown and discussed in this course, you’ll learn some new set ups and posing techniques as well as how a slight refinement can make a drastic improvement in the portrait.  </p>  <p>  \t    Take this course if you would like to take your portrait photography to a higher level.  </p>", 
    "end_date": null, 
    "title": "Outdoor & On-Location Portraits After The Wedding", 
    "price": "20.00", 
    "instructors": "Photofonz Media", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/336862_b0e5.jpg", 
    "course_url": "https://www.udemy.com/outdoor-on-location-portraits-after-the-wedding/", 
    "currency": "USD", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-05T20:44:09Z"
}