{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p style=\"\"><strong><em>Thinking of starting a wedding photography business but you're not quite sure where to start?</em></strong></p><p style=\"\"><strong><em>Confused about pricing, marketing, sales, wedding albums, etc.?</em></strong></p><p style=\"\">If so, you're not alone.</p><p style=\"\">This course will take you through a proven, step-by-step system to start a profitable, sustainable wedding photography business.</p><p style=\"\"><strong>You'll learn:</strong></p><ul><li>how to smartly spend on the gear you need</li><li>how to build a starter portfolio</li><li>how to book your first wedding</li><li>how to set up your business infrastructure</li><li>how to build a fantastic website and blog that bring in customers</li><li>how to build wedding packages for maximum profit</li><li>know when to raise (or lower) your prices</li><li>how to market your business</li><li>social media tips</li><li>how to sell wedding albums</li><li>best practices</li></ul><p>I'll take you by the hand and lead you step-by-step through the entire process of getting a wedding photography business started. If you have any questions, my goal is to answer them within 24 hours whenever possible.</p><p><strong>What the course will not cover: </strong> This is <em><strong>not</strong></em> a course on the art and technique of photography (lighting, composition, posing, etc.)! While that's an important topic for another day, this course is focused like a laser beam on the <em><strong>business</strong></em> of wedding photography.</p><p><strong>Who is the course for? </strong> The course is for students just starting or thinking of starting a wedding photography business. I take nothing for granted and start from the very beginning. However, it's also a good primer on the basics of running a photography business and I'm sure even intermediate level photographers will pick up useful tips.</p><p><strong>What are the course requirements?</strong>  I'd suggest that students come to this course with a basic photography kit (camera, lenses, flash) and a good understanding of basic photography: how to take sharp, well-exposed, and well-composed photographs. </p><p>We all need to start somewhere. But why struggle on your own? Take this course and give your wedding photography business a head start!</p>", 
    "end_date": null, 
    "title": "Start a Profitable Wedding Photography Business", 
    "price": "20.00", 
    "instructors": "Laurence Kim", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/546910_a3d8_2.jpg", 
    "course_url": "https://www.udemy.com/start-a-profitable-wedding-photography-business/", 
    "currency": "USD", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-06T16:49:08Z"
}