{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong style=\"\"><em style=\"\">Are you satisfied with the money you&#039;re making with wedding photography?</em></strong></p><p><em style=\"\"><strong style=\"\">Are most of your wedding clients buying albums?</strong></em></p><p><em style=\"\"><strong style=\"\">Are you getting additional album revenue after the wedding?</strong></em></p><p><em style=\"\"><strong style=\"\">Do you hate selling?</strong></em></p><p>Here&#039;s the bad news: the average wedding photographer leaves $500 to $1,500 on the table with <em style=\"\">every single wedding </em>by not knowing how to sell albums and get additional album revenue after the wedding.</p><p>Now for the good news: you can make back that lost income very quickly by putting in place a proven system to sell albums. </p><p><strong style=\"\">That&#039;s what this course delivers: a proven, step-by-step system to sell more albums and get additional album sales after the wedding. </strong></p><p>And the best part of this system is that you won&#039;t be using any distasteful sales techniques.</p><p>There&#039;s no asking for the order. No bait-and-switch deception. No hard sales pitches. </p><p>The system works great even if you&#039;re an introvert or simply hate selling.</p><p>I spent 15 years in sales and marketing before I launched my photography business in 2006. Unlike most photographers - who are obsessed with cameras, lenses and photography technique - I have always been obsessed with <strong style=\"\"><em style=\"\">business</em></strong>. From day one I was experimenting with marketing, pricing and sales to find out how to make the most money I possibly could with wedding photography.</p><p>Using this system I went from earning $0 on my first wedding to averaging <em style=\"\">over $5,000</em> per wedding within my first <em style=\"\">2 years</em> in business.</p><p>In this course I will show you <em style=\"\">exactly</em> how to get more album revenue. You&#039;ll learn:</p><ul style=\"\"><li>important album pricing principles</li><li>how to sell more album packages</li><li>album design principles</li><li>how to price your albums</li><li>how to get your clients to buy more album pages (without selling)</li><li>album best practices</li></ul>There&#039;s no fluff and no padding in this course. It&#039;s not a minute longer than it needs to be for you to learn the system. I&#039;ll walk you <em style=\"\">step-by-step</em> through the entire album sales process. Nothing will be left to guesswork. And if you have any questions that are not answered in the course, I&#039;ll be there to answer them in the discussion section of the course. Every wedding you book without using the methods in this course is <em style=\"\">costing you money!</em> So don&#039;t delay and please enroll now.", 
    "end_date": null, 
    "title": "Wedding Photography Album Sales Mastery", 
    "price": "20.00", 
    "instructors": "Laurence Kim", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/529482_0876.jpg", 
    "course_url": "https://www.udemy.com/wedding-photography-album-sales-mastery/", 
    "currency": "USD", 
    "subject_name": [
        "Wedding Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-16T13:48:37Z"
}