{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>The best way to learn the art of photography is by watching a master artist at work.</strong> In National Geographic Photography: Adventure &amp; Wildlife—eight lectures taught by four top National Geographic photographers who represent the gold standard of photography—you’ll gain unprecedented access to true masters, watching and learning from them as they work. </p>\n\n<p>Follow Cory Richards, National Geographic Adventurer of the Year (2012), as he shares tips on how to reveal the human element and culture of a locale by using techniques including silhouette, leading lines, scope, and anticipation. </p>\n\n<p>Travel to some of the most incredible locations on and under Earth with Stephen Alvarez, a photographer who specializes in subterranean spaces and extreme terrain, as he shares advice for lighting difficult locations. </p>\n\n\n\n<p>Steve Winter, who was named Photographer of the Year (2008) and Wildlife Photojournalist of the Year (2012), shares essential tricks for capturing once-in-a-lifetime, emotion-filled images of elusive animals, from selecting the right shutter speed to anticipating an animal’s behavior. </p>\n\n\n\n<p>National Geographic photographer and Great Courses favorite instructor Joel Sartore provides insight into building meaningful photo essays and explores the key ingredients of a great photograph: good light, good composition, and a moment. </p>\n\n<p>Beyond revealing professional secrets, this course provides a toolbox overflowing with techniques you’ll put into practice every time you lift your camera.</p>", 
    "end_date": null, 
    "title": "National Geographic Photography: Adventure & Wildlife", 
    "price": "40.00", 
    "instructors": "The Great Courses, Cory Richards, Stephen Alvarez, Steve Winter, Joel Sartore", 
    "commitment": "4.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/822286_fcf9_2.jpg", 
    "course_url": "https://www.udemy.com/national-geographic-photography-adventure-wildlife/", 
    "currency": "USD", 
    "subject_name": [
        "Wildlife Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T22:08:11Z"
}