{
    "selfpaced": true, 
    "topic_name": [
        "Photography"
    ], 
    "description": "<p><strong>Wildlife photography</strong> is among filming&#039;s greatest challenges. At its best, it occurs in wild places and conditions, deals with shy subjects, offers no possibility for shooter-subject communication or direction, and seldom allows &quot;scheduling&quot; for best conditions. Even so, it&#039;s not simply random; proper knowledge helps you achieve consistent success in this highly-rewarding pursuit.</p><p>This course shows both <strong>still photographers</strong> and <strong>videographers how to get close to living, wild subjects</strong> in their natural habitats. The author&#039;s 35 years of professional wildlife photography experience are broken into simple and inexpensive ways to help you jump-start your own exciting portfolio. You&#039;ll learn to find wildlife &quot;hotspots&quot;; how to build and use natural or portable blinds; how to use animals&#039; senses and behaviors to photographic advantage; game calling techniques; and how to use animal migrations and life cycles for better pictures. You&#039;ll learn tricks that produce <strong>immediate and stunning results.</strong></p><p>This is not a camera class, though equipment considerations are discussed as needed. <strong>This class is unique</strong> in providing <strong>real tips</strong> for engaging the natural world on its own terms. You&#039;ll quickly discover that such knowledge is far more valuable than owning expensive gear. In fact, using this information may allow surprisingly good imagery with even point-and-shoot cameras.</p><p>Whether your interest is making money through publication, sharing through programs, or simply to satisfy your favorite hobby, this wildlife course pays for itself many times over. Take it and make your own great wildlife pictures!</p><p><br></p>\r\n", 
    "end_date": null, 
    "title": "Wildlife Photography: How To Get Close", 
    "price": "50.00", 
    "instructors": "Mike Blair", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/46816_606e_2.jpg", 
    "course_url": "https://www.udemy.com/wildlife-photography-how-to-get-close/", 
    "currency": "USD", 
    "subject_name": [
        "Wildlife Photography"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-03-21T12:36:18Z"
}