{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>As a leader, changing your mind has always been perceived as a weakness. Not anymore. In a world that’s changing faster than ever, successful leaders realize that a genuine willingness to change their own minds is the ultimate competitive advantage.  Today’s leaders need to be <strong><em>persuadable</em></strong>.</p>\n\n<p>In this course, business consultant Al Pittampalli will draw on evidence from social science and cognitive psychology to show you how humility and radical open-mindedness can become powerful leadership assets.  You’ll learn why the traditional leadership paradigm that prioritizes confidence, consistency and conviction might no longer work in today’s fast-moving world.</p>\n\n\n\n\n\n<p>Having worked for organizations ranging from NASA to Hertz to IBM, Al has hands-on experience coaching leaders to become more persuadable.  In this course, he’ll teach you about 3 clear advantages that persuadable leaders possess. Then he’ll walk you through 5 specific “power practices” that you can adopt in your own daily life and work to become a more agile, accurate and growth-minded leader. Finally, you’ll learn how persuadability is a critical element of social change.  He’ll share examples of how a willingness to change one’s mind has been an essential part of social movements ranging from gay marriage to civil rights to women’s rights to Indian independence.  Distilling cutting edge research, Al will give you actionable advice to become a more results-oriented leader who moves quickly to let the best ideas prevail.</p>", 
    "end_date": null, 
    "title": "+Acumen Presents: Al Pittampalli on Persuadable Leadership", 
    "price": "40.00", 
    "instructors": "+Acumen Courses, Al Pittampalli", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/770678_3b61.jpg", 
    "course_url": "https://www.udemy.com/al-pittampalli-on-persuadable-leadership/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-22T16:16:10Z"
}