{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course, 5 Decision-Making Techniques, is part of a series which also includes Introduction to Problem-Solving and Decision-Making for Business. And, is basically the part that completes the circle as it was originally designed in the more extended Problem-Solving and Decision-Making Strategies course</p><p>This course gives you the most effective and <strong>popular tools for decision-making</strong>: </p><ol><li>nominal group technique</li><li>return on investment technique</li><li>devil's advocate technique</li><li>plus-minus-interesting analysis and </li><li>ease-and-effect technique.</li></ol><p>The course You will have 2 hours of video content that includes examples and exercises and quizzes to test your knowledge. Everyone will benefit from the course, professionals, business men and women, students, or simply the curious ones.</p><p>It's all about providing a practical framework for improvement and for creating positive habits in decision-making,This time by giving you the tools of techniques that you can use when appropriate to improve your decision-making effectiveness and achieve success.</p><p>I encourage you to include these tools in your decision-making practice and use them until they become a habit, one that will make your professional and personal life easier and more productive.</p><p>The course comes with a 30 days no question asked money back guarantee. Just, go ahead, press that \"Take the Course\" button, and see you inside learning about the decision-making tools and techniques Or, if you are not yet decided, try the free preview and decide later.</p><p>Thank you!</p>", 
    "end_date": null, 
    "title": "5 Decision-Making Techniques for Success", 
    "price": "20.00", 
    "instructors": "Sorin Dumitrascu", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/588442_970b_2.jpg", 
    "course_url": "https://www.udemy.com/5-decision-making-techniques-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-20T14:10:27Z"
}