{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t      I'm going to help you increase your influence. <strong>This is a completely new way to think about how you interact with people and the impact you have on those around you.</strong>  </p>  <p>  \t And you can learn this method in seven basic steps.  </p>  <p>  \t    Whether you are in the business world, dating situations or the social scene you have to master the impact you have on the world.  </p>  <p>  \t     My goal is to you make you more memorable, influential and charismatic.  </p>  <p>  \t<strong>Our Approach:</strong>  </p>  <p>  \t  My teaching method can be summed up in three bullets:  </p>  <ul>  \t<li>Heavily Science Based</li>  \t<li>Entertainment + Education = Edutainment (I love to make up words)</li>  \t<li>Tactical and Actionable </li>  </ul>  <p>  \t    I take a science based approach to influence. These aren't tricks or gimmicks. They are steps based on years of research out of academic institutions and peer-reviewed journals.  </p>  <p>  \t    Although I have a lot of science, I have a cheeky sense of humor. So I promise, the course will surprise and entertain you.  </p>  <p>  \t  I kept this course concise, compact and actionable because you're busy and you want change NOW! I got you.  </p>  <p>  \t <strong>The Seven Steps of Influence:</strong>  </p>  <ol>  \t<li>Turn People On</li>  \t<li>Be Emotionally Horny</li>  \t<li>Let's Get Physical</li>  \t<li>Once Upon a Time...</li>  \t<li>Get Naked</li>  \t<li>Favor Me?</li>  \t<li>Get Contagious</li>  </ol>  <p>  \t   I mean, come on...with titles like that how could you not take this course?  </p>  <p>  \t <strong>How This Course Will Change Your Life:</strong>  </p>  <p>  \t     When you walk into a room, people will remember you.  </p>  <p>  \t     When you introduce yourself, people will want to know your name.  </p>  <p>  \t     When you meet someone, they will want to do business with you.  </p>  <p>  \t <strong>Let's Banish:</strong>  </p>  <ul>  \t<li><strong></strong>Awkward Moments</li>  \t<li>Not Feeling Worthy</li>  \t<li>Low Self-Esteem</li>  \t<li>Dreading Events</li>  \t<li>Being Boring</li>  </ul>  <p>  \t <strong>What People Are Saying About Us:</strong>  </p>  <p>  \t  \"This is one of the most exciting courses I have taken on Udemy! I love Vanessa's style and energy.\"  </p>  <p>  \t  --Tara Zweibeck  </p>  <p>  \t   \"There are no scenarios in which Vanessa's courses are not helpful. Her teaching is dynamic, engaging and informative. She is clearly passionate about her field and that enthusiasm is infectious. I'm hooked!\"  </p>  <p>  \t   --Jennifer Gentile  </p>  <p>  \t   \"I feel like I have a super power after taking Vanessa's course. Her blend of science and self-help is fricking brilliant. Thank god I found her work.\"  </p>  <p>  \t   --Dave Halpreen</p>", 
    "end_date": null, 
    "title": "7 Scientifically Proven Steps to Increase Your Influence", 
    "price": 0, 
    "instructors": "Vanessa Van Edwards, Science of People", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/192004_bf26_5.jpg", 
    "course_url": "https://www.udemy.com/7-scientifically-proven-steps-to-increase-your-influence/", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-03-31T23:44:41Z"
}