{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Como seduzir…</strong></p><p>Vender é uma arte, uma arte muito difícil e que poucas pessoas têm as habilidades necessárias. Sim, é complicado encontrar alguém que saiba realmente vender a si mesmo, mas quando você encontra… têm sempre as mesmas características, sabe muito bem como conquistar pessoas, como atrair qualquer mulher ou homem para o seu lado. E exatamente isso que você vai aprender aqui, como seduzir uma mulher ou um homem, heee… um cliente.</p><p>Todos homens e mulher de sucesso são sedutores e mestres na arte da conquista. A venda nada mais é do que seduzir seu cliente, transformar um estranho num amigo e assim oferecer um produto ou serviço. Aprenda a vender a si mesmo, a ser amado, a ter todos os homens ou mulheres aos seus pés com a arte da sedução. Um curso que faz uma analogia perfeita entre a arte da conquista e a arte de vender, aqui você irá aprender a fazer as duas coisas… Aproveite!</p><p><strong>Vendedor de sucesso</strong></p><p>Seja um profissional mais requisitado, que consegue prospectar mais clientes, que sabe exatamente o que o seu cliente gosta de escutar.</p><p>Ao desenvolver estas habilidades, você receberá em dobro, terá uma vida profissional mais atraente e um vida pessoal mais feliz, um conhecimento perfeito para ganhar novos clientes, ter mais amigos, se aproximar da sua família ou encontrar um um novo amor. Decida o que fazer com o que irá aprender qui.</p>", 
    "end_date": null, 
    "title": "A Arte da Conquista", 
    "price": "30.00", 
    "instructors": "Roberto Pantoja", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/733144_9b71_2.jpg", 
    "course_url": "https://www.udemy.com/curso-a-arte-da-conquista-seducao/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-18T19:06:41Z"
}