{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<ul><li><em>This course is written and <strong>presented by a medical doctor with 20 years' experience</strong> in self-improvement training, coaching and counseling.  \t</em></li></ul>\n\n<ul><li> <em> It has been recorded and produced on a <strong>studio quality level</strong>.</em>  </li></ul>\n\n<ul><em></em><li><em>  By enrolling in this course, you will get a lifetime access to the current content, as well as, <strong>BONUS MATERIAL</strong> .  </em></li><em>  \t</em><li><em>No risk involved! Watch our </em><strong><em>PREVIEW VIDEOS</em></strong></li><li><strong><em><strong></strong></em></strong><em>Over <strong>10000 happy students</strong> enrolled in our courses!</em></li><li><em>Over <strong>500 TOP reviews!</strong></em></li></ul>\n\n<p><br></p>\n\n<p>Have you ever had the feeling that others were not listening to you or were not reacting to the message you were conveying?</p>\n\n<p>Do you find yourself agreeing to do something even though you feel the urge to refuse? </p>\n\n<p>Would you like to stand up for your rights without degrading others? If so, you have come to the right place.</p>\n\n<p>My name is Roy Naraine. I’m a medical doctor and an<strong> Award Winning Udemy Instructor</strong> with over <strong>20 years of experience in self-improvement training</strong>. During this time I have helped an eclectic mix of corporate executives to boost their power of assertiveness.</p>\n\n<p> In this course, I will take you on a journey to make you understand how to communicate in a strong and confident way. </p>\n\n<ul><li>You will learn how to control your emotions, manage your verbal and non-verbal message and influence others. </li><li>You will learn how to say No without embarrassing people or destroying their dignity. </li><li>By using the tools I provide, you will be able to improve your relationship with others and earn their respect and admiration. </li></ul>\n\n<p>However, you do not have to take my words for granted. We have included a number of free, preview videos. Watch them and confirm that the power of Assertiveness is the tool you need to improve the quality of your life. <strong>Enroll now</strong> and see you in the first section.</p>\n\n<p><br></p>\n\n<p>Thank you and all the best.<br></p>", 
    "end_date": null, 
    "title": "Assertiveness Mastery - Boost Your Confidence & Self-Esteem", 
    "price": "25.00", 
    "instructors": "Dr. Roy Naraine, Adam Naraine", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/663978_fbd2.jpg", 
    "course_url": "https://www.udemy.com/assertiveness-mastery-boost-your-confidence-self-esteem/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-08T18:04:20Z"
}