{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">WARNING: This Course May Not be for You. </strong>  </p>  <p style=\"\">  \t              Unless you are part of the select group of people who want world-class communication strategies — but also crave deeper, lasting change — this course is not for you. <br style=\"\">  \t<br style=\"\">  \t                                    I move quickly, am occasionally inappropriate, repeat ideas you may have heard but needed to be reminded of, invite you to reconsider the uncomfortable and tend to provoke deep self-reflection in my students.  </p>  <p style=\"\">  \t<br style=\"\">  \t<em style=\"\"><strong style=\"\">But I do it all in a simple, fun and entertaining way. </strong></em><br style=\"\">  \t<br style=\"\">  \t                                     And so you know, this course is unconventional; it is part strategy, part coaching, part inspirational story, and part self-development. All that follows is inspired by experience, backed by research and now waiting for you. <br style=\"\">  \t<br style=\"\">  \t                      Still, if you are interested in remaining <em style=\"\">normal</em> in your communications, go elsewhere; this is not a band-aid course.  If, on the other hand, you are interested in becoming the exception—  i.e, exceptional and bold—then this is a good place to start.  <br style=\"\">  \t<br style=\"\">  \t                                    As Robert Frost says, “Freedom lies in being bold”. <br style=\"\">  \t<strong style=\"\"><br style=\"\">  \t                                    Note:</strong> Included you will find a balanced mix of video, audio, picture voiceovers, on-screen text videos and engaging pdf exercises to do on your own.  </p>  <p style=\"\">  \t<strong style=\"\">MORE CONTENT TO BE ADDED OVER THE NEXT WEEKS/MONTH/S. THANK YOU  </strong>  </p>", 
    "end_date": null, 
    "title": "Black Belt Communication: Verbal Skills for a Bolder New You", 
    "price": "25.00", 
    "instructors": "Eugene Vassilas", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/371100_3317_5.jpg", 
    "course_url": "https://www.udemy.com/black-belt-communication/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-12-16T00:38:02Z"
}