{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>INCLUDES ALL THE MATERIAL IN LITE VERSION PLUS 1,5 HOURS OF EXTRA MATERIAL ON:</p>\n\n<li>CURIOSITY: HOW TO START WITH A STORY</li><li>VISUALIZATION: HOW TO MAXIMIZE THE ATTENTION OF THE LISTENER</li><li>PSYCHOLOGICAL REWARD MECHANISMS</li><li>USE OF AUTHORITY TO GAIN CREDIBILITY</li><li>UNIQUE INSIGHT INTO THE USE OF BODY LANGUAGE AND FACIAL EXPRESSIONS</li><li>+MORE</li>\n\n\n\n\n\n\n\n<p><em>Learn the most important one-on-one skill that dominates your daily life.</em></p>\n\n\n\n\n\n<p><strong>How do you keep people engaged during a dialogue? </strong>\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>What you say matters to the extent your audience is paying attention \nto you. In an age of unlimited distractions, you need to be a master at \nkeeping the interest of your listener.\n</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is about the art and science of building engaging \nconversations with people. It teaches both the theory and practice on \nhow to draw attention, grab interest and hook your listeners to you \nwhile you are speaking. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is for anyone who can benefit from having more <strong>inspirational</strong>, <strong>stimulating</strong>, <strong>engaging</strong>, <strong>in</strong><strong>-</strong><strong>depth</strong>, <strong>focused </strong>and <strong>impactful </strong>conversations with their colleagues, friends, business prospects, relationships and new acquaintances.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>Based on insights from human psychology, organizational behavior, \nmotivation science, reward systems, sociological thinking as well as \nfrom the corporate work environment, recruitment and job interviews, <em>this\n course offers a dense, well-researched and carefully structured \ncurriculum that crams years of experience and observations into an easily consumable knowledge pack. \n</em></p>", 
    "end_date": null, 
    "title": "Communicate Like a Leader: How to Get People to Listen - Pro", 
    "price": "20.00", 
    "instructors": "Ozan Dagdeviren", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/821720_b92e_5.jpg", 
    "course_url": "https://www.udemy.com/how-to-get-people-to-listen-to-you/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-14T06:53:58Z"
}