{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Note:This is the latest course updated in April 2016.Nowadays,People who having strong communication skills enjoy one of the top-paying jobs,with an average of 100,000 according to Glassdoor and Indeed.</strong></p>\n\n<p>Strong communication skills are extremely important both in your private and in your business life.  Whether we're speaking to other people, engaging with a group or even delivering a presentation. Competent communicators will often enjoy more rewarding relationships with others.</p>\n\n<p>Perfect communication skills are critical for virtually everything we do.However,many people are afraid of speaking in public, but effective oral communication is a key skill in business. In this course,i will help you sound more confident, use body and language to better express ideas, and overcome anxiety. In the last chapter of the course, all these concepts are brought together in two real-world coaching exercises that will help you see the techniques in action.</p>\n\n<p>Our course is designed to make it easy for everyone to master Communicating skills. It has been divided in to following main sections :</p>\n\n<ul><li><strong>Organizing your thoughts</strong></li><li><strong>Communicate with greater confidence in every area of your life.</strong></li><li><strong>Breathing more properly<br></strong></li><li><strong>Using your body to reinforce speech<br></strong></li><li><strong>Use stories to communicate better and connect with people.</strong></li><li><strong>Handling nervousness<br></strong></li><li><strong>Integrating voice modulation, eye contact, and hand gestures into a powerful and engaging communication style</strong></li></ul>\n\n<p>This amazing Course will help you quickly master all the difficult concepts and will the learning will be a breeze. So let's get started.<br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Communication Skills : Communicating With Confidence", 
    "price": "20.00", 
    "instructors": "Jeff Ancell", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/819792_e590.jpg", 
    "course_url": "https://www.udemy.com/communication-skills-communicating-with-confidence/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-12T13:19:44Z"
}