{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><span style=\"\"><strong style=\"\">Resumo</strong></span></p>    <p style=\"\"><span style=\"\">A forma como você descreve a sua empresa em reuniões e em ligações telefônicas é crucial para gerar boas vendas e convencer o cliente a comprar do seu negócio. O curso irá desvendar de forma simples e descontraída esse assunto, oferecendo um passo a passo de como montar a argumentação de vendas do seu produto ou empresa. Serão abordados os seguintes tópicos:</span></p>    <p style=\"\"><strong style=\"\">Introdução</strong><br style=\"\">   Quais são os principais motivos que fazem as empresas perderem clientes e porquê é importante uma linha de argumentação boa na hora de vender.</p>    <p style=\"\"><strong style=\"\">Conhecimento do negócio e clientes</strong><br style=\"\">   Qual é o seu posicionamento no mercado e como o cliente enxerga e sente a sua solução em relação à concorrência ou outros problemas dele.<strong style=\"\"></strong></p>    <p style=\"\"><strong style=\"\">Regra dos três minutos</strong><br style=\"\">   Assim como num relacionamento interpessoal, os três primeiros minutos de conversação são essenciais para despertar o interesse do cliente. Então, o que fazer? </p>    <p style=\"\"><strong style=\"\">Kiss! Keep it simple, stupid!</strong><br style=\"\">   Um passo a passo para como deixar a sua argumentação breve e fácil de ser compreendida. </p>    <p style=\"\"><strong style=\"\">Use a memória do cliente</strong><br style=\"\">   Como em somente uma frase economizar minutos de conversa e ainda tornar a idéia mais fácil e persuasiva para o cliente utilizando exemplos.</p>    <p style=\"\"><strong style=\"\">Explique em Loops</strong><br style=\"\">   A seu projeto ou produto deve ser explicado em &quot;voltas&quot; para resumir e facilitar a interpretação do cliente. Nesse módulo, aprenda como fazer isso passo a passo e veja também um estudo de caso.  </p><p style=\"\"><strong style=\"\">Validando a argumentação com clientes</strong><br style=\"\">   Como ter certeza que o seu discurso colou? Que o cliente entendeu e ficou interessado em comprar? Aprenda a validar. </p>    <p style=\"\"><strong style=\"\">Treinando a equipe e atualizando o discurso</strong><br style=\"\">   Como conscientizar a equipe e treiná-los para usar o discurso todos os dias e como realizar uma melhoria contínua do material que você criou.</p>  ", 
    "end_date": null, 
    "title": "Como montar uma argumentação persuasiva", 
    "price": "20.00", 
    "instructors": "Alessio Alionço", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/65011_7e11_5.jpg", 
    "course_url": "https://www.udemy.com/13-passos-para-a-argumentacao-de-vendas-perfeita/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-07-11T21:12:03Z"
}