{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">La perfilación psicológica es una materia que lleva perfeccionando durante siglos. Consiste en la habilidad de conocer todas las materias que la componen para poder leer de manera perfecta a una persona. Mediante el lenguaje corporal, el lenguaje verbal, los rasgos de personalidad o superficie, e incluso la detección de mentiras, podremos conocer, la psicología, la personalidad, los pensamientos, sentimientos y emociones de una persona.</p><p style=\"\">Es algo que nos puede resultar muy útil en nuestro trato con las personas, tanto en nuestra vida social, como laboral, e incluso en nuestra vida sentimental y familiar.</p><p style=\"\">Aunque no es una tarea sencilla, a lo largo de los diferentes temas que componen este curso, mostraremos las habilidades necesarias para poder leer a las personas de una manera exitosa.</p><p style=\"\">Conoceremos muchas materias que muchas veces hemos visto, y que seguro que hemos querido aprender. ¿quién no ha oído hablar sobre el significado de las miradas o de los saludos?</p><p style=\"\">Leer a una persona incluso nos puede hacer ver si alguien nos está mintiendo, una habilidad, que nos será de gran ayuda en nuestra vida diaria.</p><p style=\"\">Por lo tanto, en este curso conoceremos todas y cada una de las materias y habilidades necesarias para poder leer a una persona o hacer perfiles psicológicos exactos.</p>", 
    "end_date": null, 
    "title": "Como Hacer un Perfil Psicológico de una Persona", 
    "price": "20.00", 
    "instructors": "Luis Prieto", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/475104_363f_4.jpg", 
    "course_url": "https://www.udemy.com/como-hacer-un-perfil-psicologico-de-una-persona/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-13T16:08:00Z"
}