{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tAlexander Nastasi setzt sich seit Jahrzehnten mit dem Thema Energien auseinander. Ob es um die Energetisierung von Wasser oder um die Reinigung von Wohnräumen geht, weiß er, wie es geht und wie man schnell die gewünschten Effekte erzielen kann. Im Mai 2012 erschien sein Buch \"Der Fluch\", das er als Minianleitung zum Schutz vor energetischen An- und Übergriffen herausgegeben hat.  </p>  <p>  \tVom ersten Tag an hatte es einen großen Erfolg am Markt und zeigte, dass eine einfach zu verstehende Anleitung zum Schutz auf dem deutschen Markt gefehlt hat. In diesem Kurs geht es genau darum:  </p>  <p>  \tWie kann ich erkennen, dass ich Opfer eines Fluchs, eines energetischen An- und Übergriffs wurde und wie kann ich ihn unterbinden und mich erfolgreich davor schützen?  </p>  <p>  \t<strong>Dieser Kurs ist in drei Teile untergliedert:</strong>  </p>  <p>  \tDen Erklärungen vermittelnden ersten Teil, in dem es darum geht, Zusammenhänge zu erkennen.  </p>  <p>  \tDen zweiten praktischen Teil, in dem Sie erfahren, wie Sie mit verschiedenen Möglichkeiten gegen einen Angriff vorgehen können und den dritten Teil, in dem es um den Schutz von Gebäuden, Fahrzeugen, aber auch Angriffe auf Firmen geht.  </p>  <p>  \tIm <strong>Extra</strong> am Schluss stellt der Autor seine weiteren zu diesem Thema passenden Bücher und Kurse vor und zeigt Wege der Kontaktaufnahme. Es besteht nach Durchlaufen des Kurses die Möglichkeit, Unterstützung per Skype / Telefon zu erhalten. Diese Energiearbeit ist nicht im Kurspreis enthalten und wird separat berechnet. Auch können Firmen eine entsprechende Dienstleistung buchen. Informationen dazu im Video \"Abschlussvideo\".  </p>", 
    "end_date": null, 
    "title": "Der Fluch - Schutz bei Flüchen, Energiezaubern, Liebeszauber", 
    "price": "20.00", 
    "instructors": "Julia Und Alexander Nastasi", 
    "commitment": "5.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/319444_2763_2.jpg", 
    "course_url": "https://www.udemy.com/der-fluch-schutz-bei-fluechen-energiezaubern-liebeszauber/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-14T12:42:14Z"
}