{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Ever \nneeded to emcee for an event, yet not know the first thing about being an event \nhost or a master of ceremonies (MC)?<br></p><p>Public \nspeaking itself is widely regarded as the number one fear of people across age, \ncultures and genders... and the additional pressure of taking the role of an \nevent host as an MC (aka emcee), at important \nevents such as a weddings/ roadshows/ seminars/ conferences/ recitals/ parties/ company-D&amp;D by your family/manager/boss does little to ease the jitters.</p><p>Over \nthe last 10 years, we've helped thousands of people overcome their fears of \npublic speaking, and hundreds more become effective emcees with little or no \nhosting experience.</p><p><strong>The Shy Speakers' Guide</strong> to Effective Emceeing (Fundamentals) is THE course to help you go from being a zero, to \nbecoming a hero on stage.</p><p>More than surviving, <strong>speaking well on stage </strong>also has the following benefits:</p><ul><li><strong>Elevates your credibility</strong> (because you sound like you know what you're doing)</li><li>Helps you <strong>be more visible to important people</strong> </li><li><strong>Opens up more opportunities </strong>for you (because people know who you are)</li><li><strong>Builds your confidence</strong> even further (because you know what you can do)</li><li>Helps you <strong>increase your income</strong> (because good speakers are hard to find!)</li><li>Helps you <strong>increase your income</strong> (because you can charge other people as a pro)</li></ul><p>Developed and taught by <strong>actual professional speakers</strong>, <strong>public speaking trainers</strong> and <strong>emcee</strong> <strong>coaches</strong>, we have helped hundreds of new emcees get started, and many more turn professional in the course of their careers.<br></p><p>The trainers have taught at some of the best educational institutions in the world, spoken at hundreds of events, and have experience helping others do the same. Now, they have condensed their years of experience to help people like you take the stage, and own it!</p><p>In \nthis course, you will discover some of the super, key skills of what it takes \nto be an effective emcee at events. Whether you are a total newbie, or if \nyou have experience hosting events, and are thinking about formalizing and \nenhancing your skills to take them to the next level, this course is for \nyou!</p><p><strong>What are you waiting for?</strong> Join us, to speak up, stand out, shine on stage now!</p>", 
    "end_date": null, 
    "title": "Effective Emceeing (Basic) The Shy Speakers' Guide", 
    "price": "50.00", 
    "instructors": "Gary Guwe, Joshua Sim", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/661028_f79d.jpg", 
    "course_url": "https://www.udemy.com/effective-emceeing-basic/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-05T12:35:04Z"
}