{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Getting your message across is harder today than it has ever been. More information, more distractions and shorter attention spans provide competition for every message you create. It is hard for us to listen, and we jump from one thought to the next very quickly. This jumpy and sporadic listening behavior reminds me of the squirrels I see in my yard. They are constantly moving and seem fidgety and unfocused. The only thing that seems to gain and hold their interest is an acorn. </p><p>Through my years of experience in research and teaching, I have found that squirrels are like today’s audience, but research has shown us a way to get their attention and keep it.  More effective and efficient communication leads to better collaboration, sales calls and peer interaction. Communication is the cornerstone of effective leadership. If you cannot get your message across clearly and concisely, it is difficult to lead others and impact decision-making.</p><p>Participants in this course will learn how to be persuasive in short segment communication by gaining an understanding of how to apply the five essential elements of persuasion to various business settings. Since most of today’s interaction is in short time frames, not long presentation format, we will be learning the art and science of short, persuasive messages. This course provides an easy and practical strategy to help get you message across.</p><p>This course is unique due to the emphasis we place on education plus experience. The difference is that our teaching and coaching is based on academically sound theories of communication and persuasion. This rigorous research, coupled with over 20 years of experience teaching to both corporate clients and Wharton MBA students, ensures that the theories support practical application and the use of communication in everyday situations.</p><p><br></p>", 
    "end_date": null, 
    "title": "Engaging Short Attention Span Audiences", 
    "price": "50.00", 
    "instructors": "Dr. Patricia Scott", 
    "commitment": "40 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/736948_f446_4.jpg", 
    "course_url": "https://www.udemy.com/engaging-short-attention-span-audiences/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-21T16:26:33Z"
}