{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Ever wonder why some people are more successful than others? </strong>Are they so much smarter? Are they work 20 hours per day?<br style=\"\"></p>  <p>  \t      It is their skill set that is different from others. <strong style=\"\">Successful people use some techniques that makes them more productive, happier, focused, confident, organized, etc. </strong>  </p>  <p>  \t<strong style=\"\">AND NOW YOU CAN LEARN SOME OF THOSE TECHNIQUES!</strong>  </p>  <p>  \t            If you want to <strong style=\"\">improve your professional and personal life</strong> you should learn skills I teach here.  </p>  <p>  \t<strong style=\"\">This is basic course designed to help you form new habits and acquire new knowledge. I designed this course to be easy understandable and to the point. </strong>  </p>  <p>  \t<strong style=\"\"></strong>   You will learn about:  </p>  <p>  \t<strong style=\"\">Goals setting (we will learn why we need to set them in the first place and also how to set them easily)</strong>  </p>  <p>  \t<strong style=\"\">Positive Mindset (I will show you why is positive mindset so important for everything you do)</strong>  </p>  <p>  \t<strong style=\"\">Public Speaking (You will be introduced to public speaking and I will tell you secret about public speaking anxiety)</strong>  </p>  <p>  \t<strong style=\"\">Time management (Effective time management is crucial for this society we all live in)</strong>  </p>  <p>  \t            All of the above skills are a <strong style=\"\">MUST</strong> for anyone who is serious about achieving SUCCESS.  After you put in the practice things you learn here, you will take control of your life.  </p>  <p>  \t            Learning and using these skills will help you to <strong style=\"\">be more organized, confident, more productive and positive.</strong> You will be able to <strong style=\"\">present your ideas to larger groups of people</strong> and beat speech anxiety.  </p>  <p>  \t<strong style=\"\">When you start applying these techniques, your career will get a huge boost. </strong>  </p>  <p>  \t          Successful people always stand out with some unique skill set. That skill set is usually their competitive advantage. These four skills you will be introduced with in this course are, in my opinion the most <strong style=\"\">important</strong> ones <strong style=\"\">you can master</strong>.  </p>", 
    "end_date": null, 
    "title": "Entrepreneur from Bedroom - 4 skills you need for success", 
    "price": "20.00", 
    "instructors": "Danilo Stojkovic", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/346878_22bd_2.jpg", 
    "course_url": "https://www.udemy.com/master-skills-for-success/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-17T02:22:57Z"
}