{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Do you want to make an amazing impression on everyone you meet?</strong></p><p>It doesn’t matter if you’re walking into a social scene or if you’re stepping into the boardroom to make a pitch to a room of CEOs and investors…</p><p>If you aren’t at the top of your game during the first impression, you’re sunk.</p><p>It doesn’t matter how compelling you are later, research shows that if you don’t make a good first impression you won’t even get a chance.</p><p><em>Has that ever happened to you? You hesitate or freeze up and the best of your personality doesn't shine through?</em></p><p><em></em>Maybe it’s a first meeting with some senior managers at your company. Maybe it’s with an attractive person you meet at a social gathering…</p><p>You freeze up and don’t know what to do. You get stuck in your own head, or worse, say something stupid which just makes them go, “Who the heck is this person?”</p><p>If so, you’re not alone.</p><p><strong>I used to do that on a daily basis.</strong></p><p>I’d be fine with close friends and people I knew well. But give me an opportunity to meet someone that I wanted to connect with and my nerves would get the best of me. I’d shut down, blow it, and never get another chance with them.</p><p>And it wasn’t just me…</p><p><strong>FACT: FIRST IMPRESSIONS “STIC</strong><strong>K</strong> </p><p>Sociologists studying first impressions found that <strong>first impressions become “bound” in people’s memories.</strong></p><p>What does that mean? Well, lets say you mess up the second or third meeting…</p><p>Studies show people are likely to think it was just situational. They think, “Oh he was just having an off moment.”</p><p>But If you do the same exact thing in your first meeting, that impression becomes bound to YOU. Not the situation. <strong>So if you screw up the first meeting, people are likely to think YOU are a screw up.</strong></p><p>On the other hand, if you make an amazing impression, you get the benefit of people thinking highly of you in future interactions…</p><p>Now do you see why those first few minutes of interaction are so important?</p><p>And yet, nobody talks about how to master them!</p><p>You’re supposed to be on all the time.</p><p>And you probably are pretty often, but <strong>it’s in those high pressure situations where first impressions really count.</strong></p><p>So rather than just accept that we were doomed to be hit or miss in our impressions, I got to work.</p><p>I started breaking down everything the most charismatic people were doing when they met other people. I studied the kind of people that others seem to like instantly.</p><p>What I found is that if you want to make an impression like these people you’re going to have to do some things differently.</p><p>(But don’t worry…it’s not like anything they are doing is immoral or super difficult. In fact, if you do it right, you’ll actually find that all of your first interactions go better — not just the high pressure ones.)</p><p>It’s not very complicated either. <strong>There are just 4 emotions you need to hit on to make an incredible impression EVERY time.</strong></p><p>Here’s a quick example of the power of those emotions in action.</p><p><strong>CASE STUDY: FREE SCHOLARSHIP MONEY</strong></p><p><strong></strong>Paul is one of those guys people just like.</p><p>I’ve known him since I was young. Almost every time I introduce him to someone, they come back to me gushing: “Oh my god, your friend Paul is amazing!”</p><p>Guys and girls alike, he just has it.</p><p>So when he was applying to law school, I went with him to visit one of the top 10 in the nation.</p><p>While walking around he struck up a conversation with a student. She happened to moonlight as a tour guide so she showed him around.</p><p>She led him around the building and finally took him to the Dean of Admissions’ office.</p><p>The Dean was in, so naturally Paul started a conversation with him. Five minutes later the Dean invited Paul into his office.</p><p>Paul talked to the Dean about wiffle ball and the Philadelphia Eagles and his time at the prosecutor’s office. After 20 minutes the Dean pulled out the application Paul had submitted weeks earlier.</p><p>“Hmmmm…I remember your application. Looks like you were right in the middle of the pack. We have you on wait list…let’s take care of that right now.”</p><p>He went into the computer. Hammered out a few keystrokes, and boom: Paul was accepted. With a $20,000/year scholarship to boot.</p><p><strong>That’s $60,000 over 3 years, earned in 20 minutes of conversation!</strong> At a school that may not have even accepted him.</p><p>That’s why I sat down to figure out first impressions! The power to unlock the potential of any situation is incredible when you can consistently make an amazing first impression on people.</p><p><strong>Enter: First Impression Mastery</strong></p><p><strong></strong>To crack the code, I studied what the best of the best do.</p><p>Yes, I am talking hundreds of hours spent watching the worlds most charismatic people.</p><p>I’m talking people like Will Smith, Bill Clinton, and Jennifer Lawrence…</p><p>And when I finished, I was left with an hour long course on nailing the first impression every single time, no matter who you’re with.</p>Here’s a sampling of what’s covered in this course<ul><li>How you may be thinking about first impressions in a way that sabotages you before you speak a word</li><li>The four emotions that will guarantee an amazing first impression, regardless of who you’re meeting</li><li>How to speak (and what to speak about) so that you command respect from the beginning of the interaction</li><li>Body language tips to exude positive energy so people love talking to you</li><li>How to answer common questions like, “Where are you from?” and “What do you do?” in a way that gets people intrigued</li><li>The specifics of body language to make a great impression in just a few seconds</li><li>An action guide to make sure you have a concrete plan for putting everything into practice day by day</li></ul><p><br></p><p>By the end you will:</p><ul><li>Learn how to master first impressions for the rest of your life</li><li>Put yourself at a serious advantage every time you make a pitch, whether you’re selling a product or selling yourself</li><li>Make people want to stay in touch after interacting with you for just a few minutes</li><li>Turn those passing acquaintances you meet every day into friends, business partners, or maybe even a boyfriend or girlfriend</li></ul><p><br></p><p>So if you want to make leaving an amazing first impression your superpower, click the “add to cart” button and get started today!</p>", 
    "end_date": null, 
    "title": "First Impression Mastery: 4 Steps To Connecting With Anyone", 
    "price": "35.00", 
    "instructors": "Charlie Houpert", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/647532_4f60_2.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-good-first-impression/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-22T03:58:51Z"
}