{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>            THIS COURSE WILL PAY FOR ITSELF, OVER AND OVER AGAIN</em>.</strong></p><p><strong><em></em>                  Don't be one of those people that always pays RETAIL.</strong></p><p><em>---------------------------------------------------------------------------------------------------------------------------</em></p><p><em></em>If you like giving away your hard earned money, then this course is probably not for you. Of course If you do like learning new ways to put some money back in your pocket, then this will give you some tried and tested techniques that I have used and refined for many years.</p><p>Are you interested in knowing how much you could save by learning some simple techniques? </p><p>My name is Manny Fiteni and as a senior manager who has worked in large corporates, you get used to having to negotiate your way around the board <span></span>table, but in real life these same skills can be effectively used to get cars, watches and even electrical appliances at a reduced price.</p><p>I use these techniques all the time and have done so for over 25 years. Let me show you how I save on some items, up to thousands of dollars that most people would pay the full retail price.</p><p>Im not cheap, just astute. <strong>Do you think the wealthy always pay full price? NO, they negotiate and so should you.</strong><span></span></p><p>Some items that you pay for have fairly large margins, that only takes money out of your pocket. Instead of getting into a get rich scheme, why not get into what the smart people do and influence others to give you a <em>fair </em>price. </p><p>---------------------------------------------------------------------------------------------------------------------------</p><p><strong>iN THIS COURSE I WILL REVEAL HOW TO:</strong></p><ul><li><strong>Reduce the price of a Rolex watch by $3,100 using the 'Play Offs' technique</strong></li><li><strong>Use two great killer questions that will enhance your </strong><strong>chance</strong><strong> of paying less</strong></li><li><strong>Prepare, so that you have the upper hand when negotiating</strong></li><li><strong><strong>Use 6 great techniques that i use over and over again to get great bargains</strong></strong></li><li><strong><strong>Master the skills of negotiating a better deal on almost any item by using my </strong></strong><strong><strong>step-    </strong></strong><strong><strong>by-step system</strong></strong></li></ul><p><strong>---------------------------------------------------------------------------------------------------------------------------</strong></p><p><strong><strong>30 DAY MONEY BACK GUARANTEE</strong></strong><strong><br></strong></p>", 
    "end_date": null, 
    "title": "Haggle King: How to pay less for ALMOST everything", 
    "price": "20.00", 
    "instructors": "Mr Manny Fiteni", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/623360_d1eb_2.jpg", 
    "course_url": "https://www.udemy.com/haggle-king-how-to-pay-less-for-almost-everything/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-26T22:55:59Z"
}