{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Seguramente ya te habrás dado cuenta de lo difícil que puede ser aprender hipnosis sin un método paso a paso, e incluso cuando hablas de ello, puede que te miren con cara rara.</p><p>Pero la hipnosis no es nada más que<strong><u>  una habilidad para conectar con los demás y ayudarles a cambiar las partes más profundas de su ser</u></strong>.</p><p><strong>¿Qué voy a aprender en este curso?</strong><strong>:</strong></p><ul><li>Un método que te asegura que podrás usar la hipnosis con total soltura con casi cualquier persona siempre que quieras.</li><li>Un programa de formación cuidado al milimetro, donde se mima cada detalle y donde la dinámica de aprendizaje es:</li></ul><p>1 - Ves una demostración real en vídeo.</p><p>2 - Aprendes los pasos explicados detalladamente por mi.</p><ul><li>Mi apoyo, o el de mi equipo, cuando lo necesites.</li></ul><p><br></p><p><strong>¿A quién va dirigido este curso?</strong></p><ul><li>Terapeutas que deseen mejorar su aptitudes</li><li>Profesores, personal sanitario</li><li>cualquier persona que desee ayudar a los demás a través de la hipnosis</li></ul><p><span></span></p><p><strong>Después de hacer este programa de formación serás capaz de </strong><u><strong>entre otras cosas:</strong></u></p><ul><li>Realizar Una Sesión De Hipnosis Completa Con Total Soltura y Seguridad </li><li>Hipnotizar A Casi Cualquier Persona en menos de 5 minutos</li><li>Tendrás En Tus Manos Una Herramienta Para Ayudar A Los Demás De Una Manera Rápida y Permanente Accediendo a Su Inconsciente.</li></ul><p>Y además,  un bono en formato audio para realizar <strong><em>\"Autohipnosis para hablar en público!.</em></strong></p><p>Apúntate al curso, mira todos los vídeos, imprime los apuntes, disfruta de cada sesión guiada por mi, y ¡disfruta de tu curso!<br></p><p><br></p>", 
    "end_date": null, 
    "title": "Hipnosis Rápida en 60 minutos", 
    "price": "20.00", 
    "instructors": "Ignacio Muñoz Campano", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/644698_b32d_2.jpg", 
    "course_url": "https://www.udemy.com/hipnosis-rapida-en-60-minutos/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-19T13:01:21Z"
}