{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Have you ever wanted to be able to hypnotise anyone?</strong></p>\n\n<p><strong>Would you like to know how to do hypnosis without needing hypnosis scripts?</strong></p>\n\n<p><strong>Are you new to hypnosis, perhaps with no experience and wondering where to start?</strong></p>\n\n<p>If you answer yes to any of these questions then this course may well be for you.</p>\n\n<p>This <em>How to do Hypnosis </em>course from Dan Jones, one of the UK's leading hypnotherapists and author of many best-selling hypnosis &amp; hypnotherapy books teaches you what you need to know to be able to hypnotise anyone without the need for hypnosis scripts. </p>\n\n<p>The course comprises of video lectures and demonstrations of hypnotic inductions with real subjects - you can preview some of the lectures and demonstration videos below before you decide whether this course is right for you. The course is broken down into the stages which are important to consider when doing hypnotic inductions and therapeutic hypnosis. </p>\n\n\n\n<p>This hypnosis course teaching you how to do hypnosis should take a few hours to complete, but you are likely to want to spend a little time re-watching some of the lectures and hypnosis demonstrations and practice with family and friends to fully absorb and learn all the material. </p>\n\n\n\n<p>The main sections all end with a quiz to test your knowledge of what you have learnt about doing hypnosis in that section of the course. </p>\n\n\n\n<p>This course is ideal for beginners to the field of hypnosis who are perhaps just starting out and wanting to get the best start at how to do hypnosis on others, or those with perhaps limited prior hypnosis experience, or only experience doing hypnosis using hypnosis scripts who would like to take their skill to the next level and be able to hypnotise people without the need for hypnosis scripts.</p>", 
    "end_date": null, 
    "title": "How to do Hypnosis", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/813672_7e9e.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-05T16:48:16Z"
}