{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course uncovers how we can and MUST IMMEDIATELY start a DIY or Do-It-Yourself Democracy.  Recent polls have shown that more than 80% of the American people want technology to improve our political system. However our leaders will never admit that they are doing anything wrong.  They think they know better than the vast majority of Americans - calling us the \"Silent Majority.\"  In a DIY Democracy - we will never be silent again, but we will be the Majority that rules THEM instead of them, the corrupted and incompetent minority ruling us.  When Richard Nixon said we must fight and kill people in Viet Nam, we had no voice, and so the war raged on for almost a decade and at the cost of hundreds of billions.  When George W. Bush said that we should kill people in Iraq, we still had no voice and so the war in Iraq has expanded to almost all countries in the region and rages on to this day at a cost of over two TRILLION dollars and growing.  When Obama said he had no strategy to defeat ISIS - we still have no voice and the global displacement of millions will get worse and worse and at a cost that is as yet inestimable.  </p><p>Thus, we present the world with the most historic and profound change in our basic system of government - voting on the Internet not only for a wider range of people who run for office, but also a much wider range of solutions to our problems now threatening to destroy this country and the rest of the world.  Students should enroll to become part of the solution instead of part of the problem by keeping their heads firmly stuck in the sand.  Numerous common sense examples of how we can use the Internet to stop the constant flow of ill-advised, expensive, ineffective and criminal solutions imposed upon us by the Federal Government.  First, we will save this country and later the world.  Will you join those of us committed to a real democracy for the first time in history?  If you find yourself complaining about our situation more and more, then you need to take this course not only for yourself but especially for all future generations.</p>", 
    "end_date": null, 
    "title": "How we can and MUST begin the DIY (Do-It-Yourself) Democracy", 
    "price": "20.00", 
    "instructors": "Michael Mathiesen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618644_dd1a_4.jpg", 
    "course_url": "https://www.udemy.com/diydemocracy/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T23:53:13Z"
}