{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>“How to influence anybody” is designed for you to achieve your goals in influencing others to your point of view.   Learn how to develop ‘influencing skills’ with ease and use them in commercial and social settings.  Each video will take you through the key issues you need to practise and rehearse in order to become a master of influence.<br></p>\n\n<p><strong>Become a Master of Influence and Persuasion and Achieve your Dreams</strong>\n\n  </p>\n\n<ul><li>Learn key influencing strategies</li><li>Develop a fire proof methodology for winning business</li><li>Build rapport and rock solid relationships</li><li>Predict and handle objections to your proposals</li><li>Create a high degree of personal confidence and self esteem</li></ul>\n\n\n\n\n\n\n\n\n\n<p><strong>Purpose of Course</strong>\n\n  </p>\n\n<p>You will learn and create a unique and strong personal ‘brand’ by which you will create robust and profitable relationships by adhering to the course program.\n\n  </p>\n\n<p><strong>Course Topics</strong>\n\n  </p>\n\n<p>We focus on the most relevant research in applied psychology. We cover everything from confidence building to rehearsal, from examining the impact you have on others, to building your own personal brand.   You will develop your own structure and work carefully through your influencing objectives and outcomes.  You are provided with a host of tools to develop your persuasiveness in the shortest possible time.  Undertake the exercises and accelerate your learning.  You will quickly develop a robust ‘persona’ so that you will pursue your objectives with ease and enjoy the process.\n\n  </p>\n\n<p><strong>Overview of Course</strong>\n\n  </p>\n\n<p>We designed this as the ‘101 guide in Influence and Persuasion.  You have exercises to complete in the videos.  You also have a sequenced series of PDF downloads to reinforce the key messages.  These include: building your personal ‘Brand’, creating superior self-confidence, mastering body language, predicting and dealing with objectives, reading personality types.\n\n  </p>\n\n<p><strong>The course will:</strong>\n\n  </p>\n\n<ul><li>Provide a structure upon which to build rapport and relationships</li><li>Encourage you to develop your own strategies that fit with your ‘authentic self’</li><li>Build real ‘self-confidence’</li><li>Supply you with tactics and techniques to put you at ease with others</li><li>Give you confidence to deal with difficult ‘interpersonal’ issues and difficult people</li><li>Apply personality dynamics to building firm and lasting commercial and social relationships</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>What do you learn?</strong>\n\n  </p>\n\n<p>You can re-invent yourself. You will become a new, better you. You will walk away from the course with a new self-confidence and an arsenal of tools to prepare you for any encounter in both business and social contexts.</p>", 
    "end_date": null, 
    "title": "How to influence anyone anywhere - Mastering your Potential", 
    "price": "30.00", 
    "instructors": "Mr Philip Atkinson", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726896_5eb1.jpg", 
    "course_url": "https://www.udemy.com/how-to-influence-anyone-anywhere-mastering-your-potential/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-13T14:56:24Z"
}