{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t <strong style=\"\">Have you ever wondered what goes a person&rsquo;s mind when they meet you?</strong>  </p>  <p>  \t Human brains, like human bodies, are built according to specific laws.  When you understand those laws, you don&rsquo;t have to wait till days later to find out that you were a victim of them.  When you understand those laws, you can know instantly, in the moment where you went wrong and what to do about it.  And this goes not only for &ldquo;first impressions,&rdquo; but with the relationships that matter most &ndash; in your family, at work, and with your customers.  </p>  <p>  \t Have you ever &ndash;  </p>  <ul style=\"\">  \t<p>  \t\t -Approached potential business associates or customers will little to no success, time after time?  \t</p>  \t<p>  \t\t -Spent hours correcting a child, only to find that it made matters worse?  \t</p>  \t<p>  \t\t -Spoken to a partner who appeared to be listening, but in reality did not hear a word you said?  \t</p>  \t<p>  \t\t -Tried to manage a group of rowdy teenagers?  \t</p>  \t<p>  \t\t -Conducted a meeting at work that did not turn out the way you wanted it to?  \t</p>  \t<p>  \t\t -Miscommunicated with your spouse, parents, siblings, in-laws?  \t</p>  </ul>  <p>  \t Then this class is for you!  </p>  <p>  \t I will give you a play-by-play of what people may be thinking, and how you can use it to build relationships, expand your business, and gain the life you have always wanted!  </p>  <p>  \t You will learn:  </p>  <ul style=\"\">  \t<p>  \t\t &middot;The top &ldquo;doorways&rdquo; to a person&rsquo;s brain that you must go through to get their attention &ndash; including your own!  \t</p>  \t<p>  \t\t &middot;The order in which to go through the &ldquo;doorways&rdquo;  \t</p>  \t<p>  \t\t &middot;How to get people to stop judging you, and start listening to you  \t</p>  \t<p>  \t\t &middot;Why this works  \t</p>  \t<p>  \t\t &middot;How to avoid manipulation and start loving people  \t</p>  \t<p>  \t\t &middot;How your appearance and body language affects your results  \t</p>  \t<p>  \t\t &middot;And much more!  \t</p>  </ul>", 
    "end_date": null, 
    "title": "How to Make a Powerful First Impression that Lasts", 
    "price": "20.00", 
    "instructors": "Emily Watson", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/98124_0362_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-make-a-first-impression-that-lasts/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-09-27T01:38:40Z"
}