{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tInfluence is about having the capacity to effect the character, development or behavior of someone or something. We are being influenced and influencing others from the time we are small children. No where is the power of influence more pronounced then in advocacy. Advocacy involves speaking out about a cause, issue or people group with the intention of influencing others to support that cause.  </p>  <p>  \tIn this course you will learn:  </p>  <ul style=\"\">  \t<li>What advocacy is</li>  \t<li>The types of advocacy</li>  \t<li>How advocacy can be used to create political or social change</li>  \t<li>The components of a successful advocacy initiative</li>  \t<li>How advocacy differs from education</li>  \t<li>The types of personalities or gifts that are needed to be effective advocates</li>  \t<li>The different roles advocates play in an advocacy campaign or initiative</li>  \t<li>How to use social media and traditional media to get your message out to the world</li>  \t<li>How to develop an effective partnership</li>  \t<li>Learn about great political movements throughout history and why they were successful</li>  \t<li>Acquire the skills necessary to be an effectivde advocate in your workplace, family, community or legislature</li>  </ul>  <p>  \tIf you see things in society that need change and you don&#039;t know how to get there, this course is for you.  </p>  <p>  \tIf you work for a nonprofit, campaign, or within a business where you want to be an agent of change, this course is for you.  </p>  <p>  \tIf you are fascinated with politics and how political or social movements really happen, this course is for you.  </p>  <p>  \tThis course is done by video with powerpoint slides. It will take a couple hours to complete and can be done at your own pace.  </p>", 
    "end_date": null, 
    "title": "How to influence as an ADVOCATE", 
    "price": "20.00", 
    "instructors": "Lisa Gibson", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/389950_581a_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-influence-as-an-advocate/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-10T00:23:22Z"
}