{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \tIn a ten minute conversation you are likely to be lied to two to three times. You might not even realize how often the people in your life are being deceitful.  </p>  <p>  \t91% of people lie regularly at home and at work  </p>  <p>  \tIt&#039;s time you get the tools to better equip yourself. How to Be A Human Lie Detector will teach you how to spot lies as well as uncover hidden emotions in the people you are interacting with.  </p>  <p>  \tMost importantly,<em style=\"\"> it will help you have more honest interactions with the people in your life.</em>  </p>  <p>  \tWhat If It Doesn&#039;t Come Naturally?  </p>  <p>  \tYou do not have to be born with a natural inclination to read people. In fact, all people reading skills and lie detection abilities can be self-taught. Studies show that with beginner level training the average person can increase their accuracy at spotting deception from 54% to 90% accuracy.  </p>  <p>  \tThis course is based on scientifically backed research on the how to read people&#039;s nonverbal behavior and spot lies. If you have seen the TV show &quot;Lie to Me&quot; we actually will be teaching you many of the actual techniques the show is based on, which comes from Dr. Paul Ekman&#039;s research on lie detection.  </p>  <p>  \tLying Myths:  </p>  <p>  \tBecause this course is based in research backed science, it will debunk some popular myths about lying.  </p>  <ul style=\"\">  \t<li><em style=\"\">Lying Myth #1: If people look to the left, they are lying. If they look to the right they are telling the truth. </em>Although there is some science about eye direction, which we talk about in the course. It is not the most reliable form of lie detection. The course will show you more accurate (and easier) ways to spot lies.</li>  </ul>  <ul style=\"\">  \t<li><em style=\"\">Lying Myth #2: Liars can&#039;t look you in the eyes.</em> On average, honest people will make eye contact during conversations about 60% of the time–way less than you thought, right? Liars actually look you in the eye more because they want to see if you believe their lie or not.</li>  </ul>  <ul style=\"\">  \t<li><em style=\"\">Lying Myth #3: Emails and IM&#039;s are filled with lies because it is easier to lie when people can&#039;t see or hear you.</em> In the course, I will tell you which of the following have the most lies:</li>  </ul>  <p>  \t___Emails  </p>  <p>  \t___IM&#039;s  </p>  <p>  \t___Phone conversations  </p>  <p>  \t___Face to Face interactions  </p>  <p>  \tI&#039;ll give you a hint: Shockingly, we lie the LEAST in emails.  </p>  <p>  \tWhy is Lie Detection Important?  </p>  <p>  \tIt is important when we know we are being lied to because it can save us money, time and sometimes even our safety. This course can train you to get to the truth 80% to 90% of the time. That can save you money on a faulty house, from hiring a bad employee or making sure you know what is really going on with your child or significant other. Unfortunately, we are not good at detecting lies. We are only right about 54% of the time! That is a little better than a coin toss.  </p>  <p>  \tLet me teach you how to spot lies so you can have more honest interactions and connections with the people around you.  </p>  <p>  \tJoin me in How to Be A Human Lie Detector!  </p>", 
    "end_date": null, 
    "title": "How to Be A Human Lie Detector", 
    "price": "25.00", 
    "instructors": "Vanessa Van Edwards, Science of People", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/59935_17bb_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-be-a-human-lie-detector/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-13T21:33:32Z"
}