{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Welcome</p><p>We have to deal with people every single day and every single way. In fact, whatever you have so far and will have in your life, will come through other people only. In other words, your goal will be achieved by the agreement of other people only. Life is all about getting agreement from other people. Life is persuasion.</p><p>If you are business person, you can make more money with getting agreement from your customers to buy your product or services</p><p>If you are doing a job, your promotion or growth largely depends on your employer&#039;s agreement to promote you.</p><p>If you are a sales person, you know you are the best person to agree that no customer will help you to achieve your target if they are not comfortable with you and trust you.</p><p>In every relationship, we want our partner to agree with each other to enjoy the quality relationship.</p><p>No matter how confident or strong you are, you can not succeed without the support of your team members.</p><p>So ultimately, we all need agreement from others and also, we all want to grow our network and make better relationships with people around us.</p><p>We want to reach to more people and talk to them comfortably.</p><p>No matter what you are doing, if you want to make people listen to you, make people relaxed and comfortable, you should learn how to establish hypnotic rapport and make people comfortable and trust you.</p><p>After doing this course, You are going to notice a dramatic change in a way you talk to people and people accept you and love to talk to you.</p><p>You are going to learn what are the hot buttons to make people come to agreement which is good for both parties.</p><p>You will find out how you can generate good feelings in others</p><p>You will find exactly how you can make people listen to you happily.</p><p>You are also going to find out some of the hypnotic techniques to attract people to talk to you comfortably.</p><p>Have you ever had problem in approaching strangers? You will find how you can do it without hesitation.</p><p>All of these is possible once you know how to establish rapport and how to build a strong relationship.</p><p>Imagine what it would be like if you can connect with more people and make more friends.</p><p>What would happen if you know how to turn a harsh argument into the healthy discussion?</p><p>So now, we dive straight into how to build a harmonious relationship to understand each others&#039; feelings and ideas and communicate well.</p><p>I will see you in the course.</p>", 
    "end_date": null, 
    "title": "How to Build Hypnotic Rapport & Make people feel comfortable", 
    "price": "20.00", 
    "instructors": "Mayur Bardolia", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/547892_4b44_3.jpg", 
    "course_url": "https://www.udemy.com/how-to-establish-hypnotic-rapport-make-people-comfortable/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-07-07T13:36:07Z"
}