{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Are you new to the field of hypnosis and hypnotherapy, or not yet confident to do hypnotherapy without using scripts, but find yourself always on the look out for hypnotherapy scripts to use? Then this '<strong>How to Write Hypnotherapy Scripts</strong>' course is for you.</p>\n\n<p>This <strong class=\"redactor-inline-converted\">How to Write Hypnotherapy Scripts</strong> course teaches students about the different elements you will need to know to create your hypnotherapy scripts including: </p>\n\n\n\n\n\n\n\n<ul><li>Hypnotic language patterns</li><li>Hypnotherapy script structure</li><li>Hypnotherapy script length</li><li>What information to gather from the client to inform writing of the hypnotherapy script</li></ul>\n\n\n\n\n\n\n\n<p><br></p>\n\n<p>Through many of the lectures there are hypnotherapy script examples, and there is a whole section of example hypnotherapy scripts covering different types of inductions, and different common problems which hypnotherapists see in their practice. These scripts are more generic and not written for an individual client. There is also a hypnotherapy script example which is a complete hypnotherapy script written for use with a specific client to show what a tailor-made hypnotherapy script looks like in its entirety.<br></p>\n\n\n\n\n\n\n\n<p>This course consists of video lectures and PDF notes of the slides for the lectures.</p>\n\n\n\n\n\n\n\n<p>The course is structured to give you the information you need to definitely know before you start writing scripts first, then the information about how to write and structure your hypnotherapy scripts. Following this you will know how to write your own hypnotherapy scripts and will be ready to start writing your own hypnotherapy scripts, but you will still need one more piece of information if you are going to be writing tailor-made, client-centred hypnotherapy scripts, so you will then learn about the information you need to get from the client to ensure the script you write includes what is needed for them as an individual. Once you have this information there is a section of hypnotherapy scripts samples to help give you ideas and more examples of hypnotherapy scripts, including a script which was written for a genuine client.</p>\n\n\n\n\n\n\n\n<p>This course consists of over 5 hours of lectures and is ideal for anyone who uses hypnotherapy scripts in their practice but who perhaps doesn't currently write their own scripts, and those with an interest and basic knowledge of hypnosis who perhaps aren't yet confident enough to do hypnosis without a hypnotherapy script, or those who would like to learn how to write out hypnotherapy scripts as a way of coming up with a plan or ideas prior to client sessions.</p>\n\n\n\n\n\n\n\n<p><em>\"The world famous hypnotherapist Milton H Erickson MD spoke about how when he was new to hypnosis he would write out 100 pages of hypnotherapy script of everything he felt he needed to say to his client. He would then go through this script and see how he could get all that information into a 50 page hypnotherapy script, and then would go through this to see how he could get all that information into a 25 page hypnotherapy script, and he would keep doing this to make the hypnotherapy script as short as possible whilst still retaining all of the information that was in the 100 page hypnotherapy script.\"</em></p>", 
    "end_date": null, 
    "title": "Hypnosis - How To Write Hypnotherapy Scripts", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/872254_43e2.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-how-to-write-hypnotherapy-scripts/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-06-08T11:36:41Z"
}