{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><br></p><strong>Course Description</strong><strong></strong><p style=\"\">This course will teach you step by step how to do Rapid Hypnosis Inductions safely and confidently.</p><p style=\"\">You will learn everything you need to know to be able to Hypnotise people even if they are sceptical.</p><p style=\"\">Imagine being able to</p><ul><li> Hypnotise almost anyone instantly and easily<span style=\"\"></span></li></ul><ul><li>Be confident performing Instant and Rapid inductions</li></ul><ul><li>Be able to follow a simple process to create your own Rapid Induction</li></ul><ul><li>Be able to Hypnotise someone even if they are sceptical</li></ul><ul><li>Be able to Hypnotise people literally within seconds</li></ul><p><br></p><p>Being confident performing rapid inductions is one of the core principles of that will ensure a successful induction.  Fear on the other hand is the main obstacles that will stop you.  This course is designed to to teach the principles which make up a successful rapid induction so that you can build confidence and reach the level of being unconsciously competent whilst doing rapid hypnosis inductions. </p><p>Start feeling more confident and learn the steps in tis course that will guarantee you success.</p><p><strong>Contents and Overview</strong></p><p>This course was made for anyone that wishes to learn or improve their hypnosis skills. The only requirement is to follow a simple process and put it into practice.  </p><p>Enrollees in this course will have access to over twenty-five videos that teach you a step by step process and break each step down so you can even follow along to the videos whilst you practice. You will learn how to control the frame and be confident your rapid hypnosis induction will work every time. </p><p>The course also includes strategies for developing your own induction to impress friends and colleagues. You will also learn the so called secrets other hypnotists don't want you to know. </p><p>Students who complete this course will be much more confident in their ability to perform hypnosis effectively.</p><p><strong>What are the requirements?</strong></p><ul><li>An Open Mind and Commitment</li></ul><p>What am I going to get from this course?</p><ul><li>Over 25 lectures and hours of high content videos.</li><li>Develop Your Inner Confidence whilst performing rapid inductions</li><li>Perform powerful demonstrations of hypnosis</li><li>Practical Strategies, Techniques and Methods</li><li>Stop Seeking Approval</li><li>Eliminate Fear whilst performing rapid inductions.</li></ul><p><strong>What is the target audience?</strong></p><ul><li>Anybody who desires to rapidly build a high level of Confidence performing rapid hypnosis inductions. </li></ul>", 
    "end_date": null, 
    "title": "Hypnosis - How to do Instant and Rapid Hypnotic Inductions ", 
    "price": "50.00", 
    "instructors": "Biodun Ogunyemi", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/530664_bf7b_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-do-instant-and-rapid-hypnotic-inductions/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-17T20:13:55Z"
}