{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This hypnosis course will teach you twelve rapid hypnotic inductions which can all be used to hypnotise people in under 60 seconds plus an additional eight hypnotic inductions which take anywhere from a few seconds to a couple of minutes to induce hypnosis.</p>\n\n<p>Learn how the twelve rapid hypnotic inductions are done and the principles behind them which make them work and allows you to take those principles and create your own hypnotic inductions.</p>\n\n\n\n<p>You will learn about the role that focusing attention, using confusion, and interrupting patterns plays in rapid hypnotic inductions. You will also learn about the importance of confidence when doing the hypnotic inductions, and the role that context plays to make the inductions more effective.</p>\n\n\n\n<p>The twelve rapid hypnotic inductions you will learn are:</p>\n\n\n\n<ul><li>The Push Up Induction</li><li>Hands Stuck Together Shock Induction</li><li>Cal Banyan's 8-Word Shock Induction</li><li>Push Down On My Hand Shock Induction</li><li>Spinning Hands Rapid Induction</li><li>Richard Bandler's Handshake Induction</li><li>Eye Blinking Induction</li><li>Look Into My Eyes Induction</li><li>Imagining Picking Up &amp; Putting Down An Object Induction</li><li>Arm Lowering Induction</li><li>Breathing In &amp; Breathing Out Induction</li><li>Look At My Finger Induction</li></ul>\n\n\n\n\n\n<p><strong>This course also contains an additional eight hypnotic inductions which you can learn, bringing the total number of inductions you will learn on this course up to twenty</strong></p>\n\n<p>These inductions can induce hypnosis in subjects anywhere from within a few seconds to taking a couple of minutes. The additional eight hypnotic inductions are:</p>\n\n<ul><li>Dave Elman Induction</li><li>Subject Counting Backwards Induction</li><li>Hand Passes Induction</li><li>Ambiguous Arm Lift Induction</li><li>Ideomotor Energy Hands Induction</li><li>Uptime Downtime Induction</li><li>That's Right (That's It) Induction</li><li>Hypnotist Counting Down Induction</li></ul>\n\n<p>This course consists of video lectures about how what makes the inductions work, introducing and describing the rapid hypnotic inductions and demonstrations of the hypnotic inductions. This course covers how rapid inductions work before moving on to teaching you the actual hypnotic inductions to give you an underpinning of knowledge to help you have deeper understanding of the rapid hypnotic inductions and to be able to know how to create your own inductions.</p>\n\n\n\n<p>This course can be completed in a couple of hours, although you may well want to revisit different induction demonstrations as you practice them. </p>\n\n\n\n<p>You should take this course if you are interested in quickly and easily learning simple and effective ways of rapidly hypnotising people. </p>", 
    "end_date": null, 
    "title": "Hypnosis - How To Do Rapid Hypnotic Inductions", 
    "price": "20.00", 
    "instructors": "Daniel Jones", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/830090_4157.jpg", 
    "course_url": "https://www.udemy.com/hypnosis-how-to-do-rapid-hypnotic-inductions/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-23T16:14:08Z"
}