{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>How do you get someone to give you a ride to the airport? How can you get more people to buy your product? How can you get someone to donate money to your charity? </p><p>Influencing other people can be next to impossible if you don’t know how. Research in psychology, however, has developed a set of core principles that underlie people’s willingness to say “yes” to a request. In this course, you’ll learn these principles as well as how to apply them in everyday situations. Get ready to skyrocket your influence! </p>  <p><strong>Using the Science of Influence to its Full Potential</strong></p>  <p>Everything in this course is rooted in tested principles of influence, based on decades of rigorous research in psychological science. This isn’t NLP or other forms of folk wisdom—these are actual techniques that have been tested and assessed with solid research methods.</p>  <p>A few of the things we'll cover:</p>  <ul><li>How giving a gift that nobody wants can actually push people to help you</li><li>How it can be helpful to ask people to do something that you <em>know</em> they’ll say “no” to</li><li>How your birthday can have a more powerful effect on other people than you’d expect</li><li>How adding a single sentence to your request can double the chances that the other person will agree to it.</li><li>...and way more!</li></ul>            <p><strong><br></strong></p><p><strong>Course Overview</strong></p><p>Social influence is a huge part social psychology, and many people have begun to see its applications to the world of business, fundraising, advocacy, and even everyday interactions. In this course, you'll develop the skills needed to influence other people more effectively. You’ll not only learn a bunch of proven influence strategies; you’ll also learn why they work, which will help you develop your own techniques that have yet to be discovered by psychologists.</p><p>These tools and techniques apply no matter what your unique goals are. Once you understand the core principles of psychological influence, you'll be ready to get people to do just about anything for you. Whether that’s marketing, saving the environment, or just doing household chores, you'll have what it takes to get the job done.</p><p><br></p><p>Don't miss out on the chance to dive straight into the secrets of psychological influence. So enroll now--you'll be glad you did.<br></p>", 
    "end_date": null, 
    "title": "Influence People with Psychology and Neuroscience", 
    "price": "30.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/666956_da0f.jpg", 
    "course_url": "https://www.udemy.com/psychology-influence/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-11T17:03:45Z"
}