{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Descubre cómo utilizar la hipnosis de manera natural y conversacional, sin tener que mencionar el trance o la hipnosis, y descubre cómo puedes aprovechar los fenómenos del trance en tu vida cotidiana.</p><p>Soy Rogelio Consejo, hipnotista y coach de seducción, y te invito a revelar los secretos de la ingeniería hipnótica para transformar tu vida cotidiana de manera poderosa y positiva, inscribiéndote a este curso.</p><p>En este curso, aprenderás cómo puedes aplicar algunos principios de la ingeniería a la hipnosis y el trabajo con trance, aprenderás a entrar en trance y poner a otras personas en trance, además de que descubrirás para qué sirve y de qué maneras puedes usar este fenómeno de la mente.<br></p><p>Cambia de hábitos fácilmente, re-programa tu mente, mejora tu estado de ánimo y tu creatividad, comunicar con mayor facilidad, dormir mejor y más. </p><p>Además, aprenderás cómo adaptar tus conocimientos hipnóticos a cada situación, lo que significa que podrás improvisar inducciones hipnóticas en cualquier momento, fácil y rápidamente y podrás crear tus propias soluciones hipnóticas en lugar de tener que limitarte a las que ya existen y ya conoces.</p><p>No necesitas ningún conocimiento previo, ya que se trata de un curso para principiantes (aunque incluso si sabes algo de hipnosis, este curso te puede ser muy interesante para darte mayor flexibilidad en tus trabajos hipnóticos).</p>", 
    "end_date": null, 
    "title": "Ingeniería Hipnótica: Aprovecha tu Potencial Inconsciente", 
    "price": "20.00", 
    "instructors": "Rogelio Consejo", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/723410_e5ed_2.jpg", 
    "course_url": "https://www.udemy.com/ingenieria-hipnotica-par-la-vida-cotidiana/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-11T02:26:43Z"
}