{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This course is an introduction to conversational hypnosis. This introduction to conversational hypnosis isn't the same as many courses on conversational hypnosis. My view is that many courses overcomplicate how to do conversational hypnosis. I have over 20 years experience with conversational hypnosis, I can talk using all the impressive hypnotic language, but anyone who has heard a conversational hypnotist speak using all the Ericksonian hypnotic language patterns will know that it doesn't sound very conversational, it sounds like you are doing hypnosis, or at least that you are 'talking funny'. I have an Ericksonian Hypnotherapy course that teaches these skills for those that want them, but there is no need to learn most of the language pattern skills to be able to do conversational hypnosis, and in fact for beginners it can prevent being good at conversational hypnosis because people can focus too heavily on using hypnotic language, so they stop sounding like they are having a 'normal' conversation and instead sound like they are doing hypnosis.</p><p>Conversational hypnosis doesn't need the use of lots of complicated language patterns, it just needs an understanding of certain principles. What is needed is an understanding of what hypnosis is, both the state people call hypnosis and the act of doing hypnosis, and what trance is. Next people need to know what makes people go into trance states, and what deepens trance. Once you know these areas you know what you need to do to conversationally guide people into any trance state, not just hypnosis, but love, excitement, happiness, relaxation, or any other trance state you can think of. You will end up using many of the hypnotic language techniques, but these will be used in a natural way that fits with what you are saying. </p><p>This course on conversational hypnosis is structured into sections to help you get a good grounding to build on by learning what hypnosis is, what trance is, what the main theories are about what hypnosis is and a brief history about hypnosis. Then there is a section on the different ways trance and hypnosis get induced, and it is from learning about these different ways people naturally enter trance which allows you to know how to induce trance or hypnosis in others in a wide range of different ways.</p><p>As I am a therapist I have made this course targeted mainly at those that are learning these skills for therapy, counselling or coaching, so there is a section teaching a range of hypnotherapeutic techniques, and a section on how to help clients transfer changes from therapy sessions into their everyday life and carry those changes on into the future, and near the end of the course I cover how to use disassociation, and association therapeutically, and about abreactions and what to do if someone has an abreaction.</p><p>This conversational hypnosis course is made up of video lectures with PDF notes and a quiz at the end of each section. During the section on different ways of inducing trance there are video lecture of inductions for you to follow so that you can experience being hypnotised using the processes described in the course as well as re-listening to those lectures intentionally not following along and allowing yourself to be hypnotised and instead focusing on analysing what is being done. There is also lectures demonstrating some of the inductions. The course can be completed in about ten hours, but you are likely to want to review lectures again as you practice what you are learning.</p>", 
    "end_date": null, 
    "title": "Introduction to Conversational Hypnosis", 
    "price": "35.00", 
    "instructors": "Daniel Jones", 
    "commitment": "9.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/703598_a70f.jpg", 
    "course_url": "https://www.udemy.com/intro-to-conversational-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-12-22T07:51:26Z"
}