{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t       Everybody needs to <strong style=\"\"><em style=\"\">persuade others.</em></strong> It&#039;s one of the driving forces between all communication. Whether you&#039;re persuading your buddies to see an action movie instead of a SciFi flick or selling a million dollar product to a fortune 500 executive, being able to easily and effortlessly <strong style=\"\"><em style=\"\">persuade others</em></strong> to accept your ideas is essential.  </p>  <p>  \t       In this guide, you&#039;ll learn the basic concepts and language patterns of conversational hypnosis, which will allow you to conversationally and secretly slip your ideas into their mind.  </p>  <p>  \t       They will not only accept and agree with your ideas, but they&#039;ll do so for their own reasons, meaning you&#039;ll face very little resistance. You can <strong style=\"\"><em style=\"\">use these powerful patterns</em></strong> in all settings. Social, sales, romance, anywhere!  </p>  <p>  \t  This course includes some grammar terminology, but it will all be explained as we go along. You&#039;ll learn the basic structures of human communication, what vague language is, and how to use it more effectively get your ideas across.  </p>  <p>  \t  This course is perfect for anybody who needs to communicate with others and get theirs ideas accepted without resistance. Perfect for salespeople, parents, couples, anybody that uses language and needs to convince others of anything.  </p>  <p>  \t  This course also includes a worksheet that will let you practice the individual patterns to gain proficiency.  </p>  <p>  \t  This course will take about an hour total to go through,  however, the more you practice these patterns on your own, the more skilled you&#039;ll become at the art and science of covert hypnosis and persuasion.  </p>  <p>  \t  Even if you never intend on selling anything to anybody, the language patterns you&#039;ll learn in this course will help you to more easily get your ideas across to others in way that they&#039;ll get accepted.  </p>  <p>  \tThis course is ideal for salespeople, and anybody interested in increasing their social confidence and charisma.  </p>", 
    "end_date": null, 
    "title": "Introduction To Conversational Hypnosis", 
    "price": "20.00", 
    "instructors": "George Hutton", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/295605_0ec7_2.jpg", 
    "course_url": "https://www.udemy.com/introduction-to-conversational-hypnosis/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-09-07T03:21:07Z"
}