{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>According to a recent Barna study, 90% of Americans believe we are facing a crisis of leadership. To bring it a little closer to home, almost 60% of surveyed <em>Christians</em> consider themselves as “leaders,\" yet 82% of them <em>agree</em> that we are facing a leadership crisis. Did you know that <strong>38% of new chief executives fail in their first 18 month on the job? Surprisingly, their failures don't occur because they lack education, experience, skills or competencies. No, their failures come from more insidious issues like pride, ego and weak character.</strong> So what's the problem here? Exactly what is missing from the leadership development experience that makes it so vulnerable and failure prone? </p><p>We believe that the primary reason behind our current leadership crisis is the that leadership training most often is focused on changing tactics and management techniques rather than on the most important aspects of leadership, the actual leader, and his or her heart, character and integrity. </p><p><strong>In these 12 leadership development lessons developed for young leaders</strong> we tackle issues like purpose, confidence, self-worth, pride, fear, purpose and building strong relationships. We nurture leadership growth by teaching the importance of integrity and character, confidence, intermingled with accountability. We teach practical lessons dealing with change, peer pressure, and much more.</p><p>Participants will not only walk away with a strong understanding of the leadership principles derived from the greatest leader of all time, jesus, but they will also be able to apply those principles in real-life scenarios and through weekly application. </p><p>Since 12 out of America's 20 Most Promising Companies have CEOs younger than 35, our desire is to build confident and credible young men and women today so they can make a positive and lasting impact in the future. </p><p>Each of the 12 lessons contains the following components:</p><p>1. Reading assignment followed by a Q&amp;A which should be done BEFORE your group session. Be prepared to discuss one takeaway from the reading assignment when your group meets.</p><p>2. A 3-5 min inspirational video to be watched &amp; discussed right after your reading assignment group discussion.<br></p><p>3. Biblical Foundation built on our 4H framework: Heart, Head, Hand, Habits where you will gain understanding of Jesus' model of leadership.</p><p>4. Case Studies that provide a way for you to apply biblical principles to today's realities. </p><p>5. Self-Evaluation to help you identify gaps and build a plan for growing as an influence and a leader.</p><p>6. Practical Application to be done individually during the week to help you take practical steps and acquire tangible skills necessary to grow and succeed as a leader. </p><p><strong><em>*           If you're going through this course as a group, pick a group facilitator for each week whose job will be to read out loud questions, Scripture references and case studies, as well as make sure that everyone gets a chance to participate.   </em></strong><strong><em>At the end of each session ask for a volunteer facilitator for the following week.  </em></strong><strong><em></em></strong></p><p><strong>Weekly lesson flow:</strong></p><ul><li>Every session begins with a Reading Assignment to be done individually, before your group meets. As you go through this brief reading, be ready to discuss your biggest “ah-ha” moment or your most interesting takeaway from the assignment when your group meets. </li><li>As you meet with your group, spend the first 5 minutes briefly sharing that one take-away from your reading assignment.</li><li>Next, you’ll watch a 3-5 min video and take 10 minutes to discuss video-related questions, which can be located by clicking the “download” icon in the upper-right hand corner.</li><li>After your video discussion, the bulk of your time, about 35 minutes, will be spent diving into Biblical examples of leadership where you’ll look at Jesus and his leadership model as well as at other leaders in the Bible. You’ll work through two case studies to help you apply Biblical leadership principles in current, day-to-day settings, and finally you’ll end with questions focused on self-evaluation, designed to help you understand what changes you need to make in order to grow as an influencer.</li><li>Each weekly lesson ends with a practical application session to be done individually, on your own time throughout the week after your group session. Practical applications were designed to help you build self-awareness, understand your core strengths and weaknesses and how to articulate those to your future employers, and to give you practical tools to grow your network and to grow you as a person.</li><li>Anytime you want to jot down notes and insights during the session, you can do that right inside of the online lesson by simply clicking the icon in the upper right-hand corner or you can also use a personal journal to do so.</li></ul>", 
    "end_date": null, 
    "title": "Leadership, Character, Ethics: Building Effective Leaders ", 
    "price": "20.00", 
    "instructors": "Lead Like Jesus", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/609454_1deb_4.jpg", 
    "course_url": "https://www.udemy.com/ignitinginfluence/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-11T20:42:37Z"
}