{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\"><span></span>Course Description</strong></p><p><strong style=\"\">I once heard a car salesmen quote David Hunnam.\"There is a sucker born every minute.\"-David Hunnam </strong></p><p><strong style=\"\">Once you are finished with this course, the only sucker will be the car salesman that dares to sell you a car.</strong> <em style=\"\">In fact, I have included a full 30day, \"No Questions Asked\" Guarantee! Plus, you will have lifetime access to this course.</em></p><p>What if you could learn <strong style=\"\">Money and Time Saving Skills </strong>to purchase New Cars?</p><ul style=\"\"><li>Avoid the haggle and hassle at a dealership.</li><li>Get the most money for a traded vehicle. </li><li>Cut the painful time wasting car buying marathon down to a quick sprint.</li></ul><ul style=\"\"><li>Learn to save hundreds to thousands of dollars off a new vehicle purchase.</li><li>Don't like to negotiate, you won't have to.</li><li>Learn how to spot a good deal when you see one.</li><li>Be prepared to win the car buying war before you show up to the dealership</li></ul><p><strong style=\"\">As a #1 car salesman</strong>, for one of the largest car dealerships in northern California for several years, <strong style=\"\">I can give you all the secrets Ins-and-outs that dealerships don't want you to know.</strong> Upon completion of the course, you will be confident, empowered, and fully knowledgeable concerning a fair vehicle trade, new car purchasing, and financing the deal. <strong style=\"\">You will go into a car buying experience acting like a customer, but buying like a sales pro. </strong>Which means, you can save time &amp; hundreds to thousands of dollars, and leave the dealership knowing that you got a great deal! No Haggle, No Hassle!</p><p><strong style=\"\">Why should you take this course?</strong> The second biggest purchase most people make in their lifetime is a car purchase? <strong style=\"\">A car buying mistake could set you back hundreds to tens of thousands of dollars.</strong> Unfortunately, they don't teach car-buying 101 in schools, but thanks to Udemy I can teach you everything you need to know, so lets get started!</p><p><strong style=\"\">As a student, this course will teach you</strong><strong style=\"\"> expert car buying skills.</strong><strong style=\"\"></strong></p><p><strong style=\"\">Course Requirements<strong style=\"\"></strong></strong></p><ul style=\"\"><li><strong style=\"\"><strong style=\"\">No Major Requirements</strong></strong></li><li><strong style=\"\"><strong style=\"\">Internet </strong></strong></li><li><strong style=\"\"><strong style=\"\">Pen &amp; Paper for notes</strong></strong></li></ul><strong style=\"\"></strong><p><strong style=\"\">Upon Completion of this Course</strong></p><p><strong style=\"\"></strong><em style=\"\">21 lectures, 6 quiz, and plenty of content that will save you time and money!</em></p><ul style=\"\"><li>Understand the skills necessary to purchase new vehicles as if you were a (insider) car salesman.</li><li>Understand the car salesman's selling process.</li><li>Escape dealership pricing confusion.</li><li>Control the monthly payment plan or cash purchase price before arriving to the dealership.</li><li>Establish a fair trade value before you arrive at the dealership.</li><li>Escape deceptive dealerships and salesmen looking for suckers.</li><li>Ability to save hundreds to thousands of dollars of new vehicle purchases. </li></ul><strong style=\"\"></strong><p><strong style=\"\">Who is the target audience?</strong></p><p>Act like a customer, buy like a sales pro was engineered for car buyers that want to be educated and empowered. Buyers that want to avoid the pain, guess work, and deceptive practices that cause people to waste time and hundreds to thousands of dollars. </p>", 
    "end_date": null, 
    "title": "Learn - The EASY way to buy a car", 
    "price": "20.00", 
    "instructors": "Learn Now! Udemy #1 Best Selling", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/526180_bc75_4.jpg", 
    "course_url": "https://www.udemy.com/get-your-best-car-deal-now-learn-how-in-8-easy-sections/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-11T17:47:20Z"
}