{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Update February 25 2016: </strong></p><p><strong>New bonus added (printable first date \"cheat sheet\")</strong></p><p>============================================</p><p>My courses have sold 25,229 times as of October 2015 (that is mostly in Germany via my website). Besides, there are currently 100,775 men reading my German newsletter.</p><p>With this course, you can dramatically improve your chances with any woman who meets you for a first date – or even just for drinks after work.</p><ul><li>Do first dates make you nervous?</li><li>Are you perhaps not even having many dates, because you are afraid of \"screwing it up\"?</li><li>Are you the kind of guy who ends up being \"just friends\"?</li><li>Or do you, when you do talk to a woman that you like, sometimes feel like there's a \"glass wall\" between you and her, just like you're some lifeless robot who doesn't know what to say... (and, of course, once you're back home and alone, you'll suddenly think of all the things you should have said, but didn't)?</li></ul><p>If any of this applies to you, or if you simply want to have hotter dates with women, you will probably profit from this course.</p><p><strong>\"But How Can You Have A Formula For Human Interaction?\"</strong></p><p>It does sound a little bit ridiculous – \"The Date Formula\".</p><p>Of course people are unique.</p><p>So let me tell you a secret:</p><p>This isn't really a course about women. It's a course about YOU.</p><p>If a man has never tasted honey, it would be really difficult to describe it for him. Wouldn't it?</p><p>And in the same way, if a man has never experienced real \"butterfly\" sexual tension on a first date with a new woman, and if he's never seen how a turned-on woman looks and acts like, then it's really difficult to help him overcome this lack of experiences through some online course on his computer screen.</p><p>So what this course is designed to do is to give you your own reference experiences.</p><p>In the course, I will tell you exactly what to do, when to do it, and how to do it.</p><p>We will cover the entire timespan from asking the woman out, through the first date, through the time after the first date, through the second date… all the way to the point where the girl is at your place, you are making out heavily, and she is taking off her clothes.</p><p>(That is where the course will end. Once you have a beautiful woman at your place, who is turned on by your touch, who is breathing heavily, and who is ready to do with you what only grown ups do... well, you will know how to take it from there.)</p><p>And here's a promise to you:</p><p>You won't be following this \"formula\" much longer, once you've had two or three successful dates.</p><p>Once you have \"tasted the honey\" – once you have experienced how sexual tension feels like, and how women react when you behave in certain ways – then you no longer need to follow any steps. </p><p>You're no longer playing the saxophone by notes. You're now one with the instrument, and you're ready for the JAZZ.</p><p><strong>Here's What Students Have Said About the Course:</strong></p><p><em>\"Hey Leo. I really dig the Date Formula. I've gone through it, I took notes, and now any time I have a date, I read through my notes beforehand and let miracles happen =P Great course!\"</em></p><p><em>\"Hey Leo. I can't believe how effective this Date Formula is. I've tried it today for the first time, and I went so much farther than ever before. I had met the woman online. We did not chat a lot online, but we <em>spontaneously </em>decided to meet up today. We were outside, sitting on a park bench (next to each other, just as you recommend it in the course). From the beginning, I put my arm behind her back. And when I asked her what it was about her job that attracts her, she almost didn't stop talking anymore! That made it much easier for me to focus on listening and touching. The talking really took care of itself. Soon, we were holding hands, and after an hour or so we were making out.\"</em></p><p>(Note: Students of the course will quickly notice that this reviewer actually violated some of the rules from the course. He applied only a few parts of the formula, and he is still successful.) </p><p><em>\"I lost my virginity thanks to this course. It's really amazing how much touch matters. Since I have studied the Date Formula, it just 'clicked' for me.\"</em><br></p><p><em>\"I wanted to spend a nice evening with a really cute girl. I also wanted to try out the second part of the Date Formula. When she arrived at my place, I just introduced her quickly to my family, and then we went up to my room. My memory is fuzzy, because one thing led to the next. At one point I just lifted her chin gently and kissed her. Then we were making out. I couldn't get enough of her sweet strawberry lips. Then I started touching the more intimate parts of her body. I touched the sides of her breasts and stroked the area above her cleavage... We really had to laugh, because aufter 2 hours of talking and making out it had simply become obvious that the 'movie night' had just been a pretense all along. :)\"</em></p><p><em>\"I went out with Liliana for drinks before christmas. The same bar again, with a nice sofa where you can sit next to each other. She's an open, funny person which really impressed me. Soon, sparks were flying between us. All I did was look into her eyes and listen. Every now and then, I told her something about myself. Most of the time, though, I let her talk. She told me that she had never met a man like that before. A man who really listens to her and who looks into her eyes like that. It actually made her a little nervous. :) She also said that she was now telling me things which she usually would never tell on a first date. I then took her hand, and we joked a little – and then she kissed me. Afterwards, she apologized for having kissed me. She said that usually she isn't like that. Usually, she doesn't kiss a guy on the first date, and she actually thinks it's embarassing to be making out in front of all the other people. […] I also caressed the back of her neck. That gave her the goosebumps, and she almost couldn't focus on our conversation anymore. She only said, 'That's my weak spot, and you will soon regret that you turned me on that way\". ;) Leo, I can tell you, this girl really took my breath away. Two days later, I also received a text message from her. She asked me if I'd like to watch a movie with her, and she also wrote that she feel slightly embarassed to ask me something like that. I thought that was funny. A stunning, beautiful woman is embarassed about asking ME out!</em></p><p><strong>Guarantee<br></strong>This course is backed by udemy's 30 Day Money Back Guarantee. Watch the entire course, and if for any reason you are unhappy, or for no reason at all, you can get a complete refund.</p><p>And by the way...</p><p>If so far you have been spending $100, $200, $300 on expensive dinner dates that get you nowhere, then your investment in this course here now will pay off a hundred fold – both in money, and in results.</p><p><strong>Go ahead and make your dates hot and sexy!</strong> Watch and download the entire course, completely risk-free. Click the \"Take This Course\" button, and we'll get started right away…</p><p><span></span></p>", 
    "end_date": null, 
    "title": "Leos Step-By-Step Guide To A Sizzling Hot First Date", 
    "price": "20.00", 
    "instructors": "Leonard Baumgardt", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/635722_6233_3.jpg", 
    "course_url": "https://www.udemy.com/the-date-formula-that-makes-women-want-to-kiss-you/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-09T08:47:25Z"
}