{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong></strong>In this course I explain, how modern rational people can still hold hidden beliefs in magic while being unaware of this at the same time.I show how, in the modern world, people of power use these hidden beliefs in magic for manipulation and mind control and how a person can protect himself or herself from magical manipulation.</p><p>In our daily life, we a frequently targeted by various individuals, which offer to us their services with the aim of extracting political, financial, or social profits for themselves. These individuals come from all walks of life: This can be a political candidate, who promises to relieve us from taxes if elected, a religious cult leader, who offers to bring us to heaven if we join the cult, a businessman, who wants us to buy their product, a private medical doctor, who cures for money, a psychotherapist, who suggests that he or she can solve our psychological problems.</p><p>While in some cases accepting these offers can be useful, in other cases it can make us an object for magical manipulation without us being aware of that. In this course, I will explain, what magical manipulation is, how it works in traditional and modern industrial societies, and how modern educated adults can easily and unintentionally succumb to magical manipulation. Finally, I will explain how, by following certain rules, you can protect yourself against this hidden danger.</p><p>I based this course on my experimental studies of magical thinking and magical behavior in modern people, to which I gave over 30 years of my research. The course contains four sections, eight lectures supplied with appropriate references, four quizzes and a practice exercise.<strong></strong></p>", 
    "end_date": null, 
    "title": "Magic in Therapy: Mind Control and Protection", 
    "price": "20.00", 
    "instructors": "Eugene Subbotsky", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/616480_66e7_3.jpg", 
    "course_url": "https://www.udemy.com/magic-in-therapy-mind-control-and-protection/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-19T08:21:45Z"
}