{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>It can be difficult to persuade people to adopt the opinion you'd like them to have. Maybe you're a marketer trying to convince people that your product is right for them. Maybe you're an activist trying to convince people to conserve water. Whatever your persuasion goals might be, this course will show you how to be smart about influencing other people's opinions.</p><p><strong>Using Persuasion Science to its Full Potential</strong><br></p><p>Everything in this course is rooted in tested persuasion strategies. I'm not just making things up like a lot of persuasion \"gurus.\" You'll learn practical tips taken from rigorous research in psychological science, and you'll discover when those strategies will be most effective.</p><p>A few of the things we'll cover:</p><ul><li>How to get people to pay attention to what you have to say.</li><li>How to construct captivating persuasive arguments.</li><li>How to employ simple tricks to make your message more convincing.</li><li>How to decide between emotional and rational appeals.</li><li>How to tailor your message to the needs of a particular audience.</li><li>...and way more!</li></ul><p><strong></strong></p><p><strong><br></strong></p><p><strong>Course Overview</strong><br></p><p>Persuasion is one of the most studied topics in social psychology, and its insights have extended to business, political science, communications, and personal development. In this course, you'll understand one of the most prominent and well-tested models of persuasion. Once you have a grasp on that, you'll start to see how all of the elements of a persuasive message come together.</p><p>By the end of this course, you'll be able to make smart decisions about how you deliver your message, who delivers it, how to tailor it to a particular audience, and more. Best of all, this course will always be there for you, and you can review the material anytime it's time to craft a compelling message that will captivate and influence your audience.</p><p>These tools and techniques also apply <em>no matter what your unique message is</em>. Once you understand the core principles of persuasive influence, you'll become a persuasion master, ready to influence people's opinions about anything, whether your message is presented in writing, in person, or through audio-visual media.<em></em></p><p><br></p><p><strong>And You Can Trust Your Teacher!</strong></p><p>I'm a trained social psychologist. Not only do I have more than 13,000 students on Udemy, but I also teach classes in social psychology at the university level. Moreover, I conduct my own psychological research in persuasion science, so I know a thing or two about the thousands of studies that exist in this field and what the latest experiments reveal.</p><p>Don't miss out on the chance to dive straight into the secrets of persuasion that have until now remained locked in dense academic journals. So enroll now--you'll be glad you did.</p>", 
    "end_date": null, 
    "title": "Master Persuasion Psychology", 
    "price": "35.00", 
    "instructors": "Andrew Luttrell", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/650794_8d6d.jpg", 
    "course_url": "https://www.udemy.com/persuasion-psychology-influence/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-26T01:30:40Z"
}