{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Do you want to learn how salesmen, advertisers, the media, society, and the government unconsciously influence and persuade you to do things you don't want to do?</p><p>That is the <em>exact</em> level you'll be at when you<strong> discover how others are biologically programmed to take action</strong>.</p><p>This course will teach you how to <em>manipulate</em> the existing programming in other people's mind and body so you can get them to take the action you want them to take today and begin to achieve the goals you've been dreaming of for a while.</p><ol><li>Are you looking to <strong>increase sales?</strong></li><li>Maybe you are an <strong>entrepreneur</strong><span> or <strong>advertiser</strong><span> who wants to increase conversion rates and experience more success?</span></span></li><li><span><span>What if you could easily attract the person you've been wanting to date for a while now?</span></span></li></ol><p><strong>What are of your life are you looking influence and persuade others with?</strong></p><p>This course will take anyone, regardless of their background or current life situation and teach them the most powerful and effective influence techniques that our out there today.</p><p>I went from an everyday person to building a publishing company with 865,000 readers, quit my job, and live the life of my dreams, because of the information you are learning in this course.</p><p><strong>Topics covered:</strong></p><ul><li>Metaphors.</li><li>Open Loops.</li><li>Embedded Commands.</li><li>Hypnotic Language Patterns.</li><li>The Law of Reciprocity.</li><li>Unconscious Influence &amp; Communication.</li><li>Quantum Influence Techniques (exclusive to this course).</li></ul><p><span><span>This stuff should not be legal.</span></span></p><p>I first became aware that anybody can learn and put these techniques to use when I met a multi-millionaire who sold his fist company for $50 million and is making $20 million with his current business.</p><p>When I asked him the key to his success, he taught me what I am teaching you today.</p><p>99% of the people on this planet don't know what you're going to learn in this course, and when you learn this information, it's like you discovered magic.</p><p>You will have the power over people to get them to do the things you want to do.</p>", 
    "end_date": null, 
    "title": "Mind Control: Unconscious Influence & Persuasion", 
    "price": "20.00", 
    "instructors": "Andrew Alexander", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/659480_461b.jpg", 
    "course_url": "https://www.udemy.com/mind-control-unconscious-influence-persuasion/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-03T23:16:30Z"
}