{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this political year - we see the first time in history where there is someone who is NOT a professional politician running to attain the highest office in the land, the leader of the Free World - Donald Trump.  Because Mr. Trump is already a billionaire, he doesn't need to take money from the special interests to get elected and so he has stated that he will owe no favors to anyone.  Bush and Clinton owed the banks for their campaign donations - so the banks were allowed to administer the worst financial disaster in history and they even got BAIL-OUTS for committing the most horrendous banking crimes in history - whereas in a real democracy, they would have been given jail time.  Obama was no better and owed the health insurance companies for their support of his campaign so he gave them Obamacare where every American citizen is now forced to buy their products at inflated prices or face time in jail.  These are examples of people who were and still are professional politicians and the kinds of things they can and will continue to do to us if we don't take action.  </p><p>Trump not being of this profession - may be the only President in history to deliver REAL CHANGE.  We are calling on every American citizen to learn about how Donald Trump may give us a Real Democracy once and for all in which We The People - make some of the biggest decisions and actually create the laws of the land on the Internet.  We call this the TRUMPOCRACY and we demonstrate here all the nuts and bolts of how it can and must be delivered to the American people NOW - in this election cycle or else we're all doomed to remain - their slaves.<br></p>", 
    "end_date": null, 
    "title": "On Donald Trump", 
    "price": "30.00", 
    "instructors": "Michael Mathiesen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/606170_d94c_4.jpg", 
    "course_url": "https://www.udemy.com/ondonaldtrump/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-08T18:10:13Z"
}