{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>Updates:</strong>  </p>\n\n<ul>  \t<li><strong>over 1434 students</strong> have enrolled since the initial launch (in 70 days!)</li>  \t<li>latest update: <strong>June, 8th</strong> with 2 new lectures: \"<strong>Your life partner</strong><strong> - the DISC way</strong>\" and \"<strong>How to change your personality type</strong>\"</li>  </ul>\n\n<p>  \t<strong>Why should you become a student?</strong>  </p>\n\n<ul>  \t<li>to <strong>directly apply a world renowned test and identify your personality</strong> (Fortune 500 companies use DISC to screen their employees for specific hiring traits)</li>  \t<li>to access a practical tool that has real world applications in:  \t<ul>  \t\t<li><strong>influencing and motivating others</strong></li>  \t\t<li><strong></strong><strong>winning friends</strong></li>  \t\t<li><strong></strong><strong>improving relationships</strong> (you will understand your spouse's secret language especially when she looks strange at you and says the ubiquitous “nothing\" or when he is hyper aggressive with his own quality time)</li>  \t</ul>  \t</li>  \t<li>to apply an <strong><em>experiential, step-by-step, action plan</em></strong> specifically designed to <strong>DISCover your strengths</strong> and <strong>tackle your weaknesses</strong></li>  \t<li><strong></strong>it's targeted to students that <strong>want to get hired</strong></li>  \t<li><strong></strong>… and to the <strong>business people that do the hiring</strong></li>  \t<li><strong></strong>because it helps you understand what your prospective employer or employee wants from you, how he thinks and why he acts and reacts the way he does</li>  \t<li>the course features content specific to <strong>leadership, sales, relationships</strong> and more; it's a <strong>holistic course</strong> with applications in your everyday life.</li>  </ul>\n\n<p>  \t                  Do you want a successful career?  </p>\n\n<p>  \t                  Excellent communication skills?  </p>\n\n<p>  \t                  A deeper knowledge of what makes you … you?  </p>\n\n<p>  \t                  .. And all of this packaged in a comprehensive, step-by-step, action-by-action course?  </p>\n\n<p>  \t                  Then enroll now! and get the skills that bring the deal!  </p>\n\n<p>  \t                  Trust me .. actually don't trust me,<strong> I'll prove it to you</strong>!  </p>\n\n<p>  \t                  Take advantage of the 30-day money back guarantee and try it out. If, for any reason, you aren't satisfied, you can request a full refund within those 30 days.  </p>\n\n<p>  \t<strong>More about the trainer</strong>  </p>\n\n<p>  \t                  My name is Vaida Bogdan and I'm an experiential trainer with a long history in online education. My motto is: “<em>I teach students how to become their own teachers!</em>\" and I live by it. In my courses, I create the conditions for students to learn by themselves.  With over 3000 satisfied students and hundreds of 5-star reviews, I believe that you can get more from this course than from any other online.  </p>\n\n<p>  \t                  And I truly believe that by better understanding yourself and others you can increase the quality of your life and experience it in a more fulfilling way.  </p>\n\n<p>  \t<strong>After going through this course you will look at the world in a totally different light  \t</strong>  </p>\n\n<p>  \t                  This course puts people in boxes…  </p>\n\n<p>  \t                  And takes <strong>you</strong> out of them.  </p>\n\n<p>  \t                  This is not a 3-page personality test.  </p>\n\n<p>  \tThis course contains an extremely rich, detailed and comprehensive content that catches your attention for more than one hour and keeps you watching thanks to its fun quizzes and daily assignments for each typology. And that's not all! The course comes with an all-encompassing workbook, so that you will have everything you need and truly BE empowered in unlocking your true self.  </p>\n\n<p>  \tBecome a better you.. a super you!  </p>\n\n<p>  \t                  .. by gaining deep insight into how and why you and your peers think, feel and act.  </p>\n\n<p>  \t                  Start learning today, before the course's price increases and I'll see you on the other side.  </p>\n\n<p>  \t<strong>WARNING:</strong> Don't lose this opportunity! DISC is more than just a test. Its uses cover diverse areas such as <strong>leadership, employment, sales, social skills, persuasion and self-knowledge</strong>.  </p>\n\n<p>  \t  \t<strong>PS:</strong> To fully benefit from the course you must practice the assignments in the second part of the material. Only after going through this part of the content you'll fully realize the benefits of the course and the reason why it was delivered the way it was.  </p>", 
    "end_date": null, 
    "title": "Personality Boost", 
    "price": "30.00", 
    "instructors": "Bogdan Vaida", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/312700_0469_2.jpg", 
    "course_url": "https://www.udemy.com/free-disc-assessment/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-03T06:19:01Z"
}