{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong><em>***Updated For <strong>June </strong>2016***</em></strong></p>\n\n<p><strong>The world is loud. It’s difficult for your voice to be heard above the crowds when everyone is shouting out their truth and their beliefs. But persuasion is not about being the loudest but about being the smartest. If you are willing I will push you forward to become a more influential you! That it is what I am offering to you.</strong></p>\n\n\n\n\n\n<p>This is not a course on how you can be the loudest; this is a course created for the sole purpose of teaching and transforming you into a person that others believe in. You will learn the techniques of persuasion that will allow you to perceive, adapt, and control the social environment so that you can influence individuals and large groups. In addition you will learn how to stay calm under pressure and how you can show conviction and charm without appearing false.</p>\n\n\n\n\n\n<p><strong>Guarantee: By the end of this course you will learn how to persuade &amp; influence anyone in any social situation.</strong></p>\n\n\n\n\n\n<p><strong>FREE BONUS INCLUDED WITH THIS COURSE: Shopping Dominance</strong><br>As\n an additional\nbonus for taking this course you will also receive the \"Shopping Dominance\" bonus video which will instruct you how on how you can spread your influence to shop owners and their staff. You will love this bonus! <br></p>\n\n\n\n\n\n<p><strong>Zero Risk</strong><br>There is a 30 day\nmoney back guarantee so you literally have no risk in taking this course.\nSeriously, the 30 refund is even done automatically so there is no hassle on your end.\nIf this course sounds like it is for you then give it a go! </p>\n\n\n\n\n\n<p><em>\"I think the power of persuasion would be the greatest superpower of all time\"</em> - Jenny Mollen</p>\n\n\n\n\n\n<p>I will see you on the inside once you are ready to truly master persuasion!</p>\n\n\n\n\n\n<p><strong>Ben</strong><br></p>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Persuasion Mastery: How To Persuade & Influence Anyone", 
    "price": "25.00", 
    "instructors": "Benjamin Hero", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/654946_2e18.jpg", 
    "course_url": "https://www.udemy.com/persuasion-mastery-how-to-persuade-influence-anyone/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-29T21:06:22Z"
}