{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong class=\"redactor-inline-converted\">Persuasion</strong> is effective communication.  The fact is that we influence each other all the time whether we like it or not.  Communication is a like a thread that runs through every area of your life.</p>\n\n<p><em>When you <em><strong class=\"redactor-inline-converted\">watch the video above</strong></em>, you will understand why it's so important to learn how to communicate effectively.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em><em>Not only for being more persuasive and getting your way more of the time, but also for improving your relationships!</em><br></em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>*Course up to date as of 4/19/16*</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p> This course will allow you to understand those around you better, communicate more effectively and influentially and present your ideas in a more engaging, persuasive way.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p><em>People will like you, respect you and want to follow along with you, far more often, when you use these skills.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong>Here's Some of What You'll Be Able to Do When You Enroll in This Course:</strong></p>\n\n<ul><li>Skillfully Capture and Lead Your Audience's Attention (Become \"The Center of Attention\")</li><li>Create Deep Levels of Rapport Quickly</li><li>Consistently Establish Trust and Respect</li><li>Speak More Persuasively</li><li>Establish the Correct Frame of Mind for Persuasion and Effective Communication</li><li>Persuade People to Accept Your Ideas and/or Outcome(s)</li><li>Use Your Body Language to Increase Your Presence</li><li>Influence People to Take Action on Your Ideas</li><li>Communicate with Authority and High Status</li><li>Use Your Voice To Create Deeper Impact of Your Message</li><li>Avoid Objections and Resistance to Your Ideas</li><li>Create a Practical Plan for Mastering the Skills in This Course</li></ul><p><br></p><p>Why else would someone want to learn these skills and become an effective communicator? </p>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Why should <em>you</em> care about being more influential and persuasive?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Here's a <em>Brief</em> List of Reasons:</p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>Make More Money</li><li>More Respect/Greater Prestige</li><li>Be at Cause Instead of at Effect</li><li>Recognize When Someone Is Trying to Influence You and Protect Yourself Against Negative Influence</li><li>Be Liked and Trusted By Others</li><li>Have Greater Choice in Your Work and Your Personal Life</li><li>Have The Ability to Effectively Lead People</li><li>Win People Over to Your Way of Thinking</li><li>Influence People to Take Action on Your Ideas</li><li>More Social Influence - Think Dating, Friends, etc.</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">Here is <em>Some</em> of What You Will Learn:</strong><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<ul><li>\"The Best Way to Establish Rapport Quickly\"</li><li>\"How to See Inside Other People's Minds\"</li><li>\"Understanding the Communication Dance\"</li><li>\"How to Package Your Message for Maximum Impact\"</li><li>\"The Counterintuitive Nature of Influence\"</li><li>\"How to Get People to Go Along with Your Ideas\"</li><li>\"How to Communicate That You Are an Authority Figure with High Status\"</li><li>\"Authenticity: The Magic Background of Persuasion\"</li><li>\"How to Speak and Behave with Authority\"</li><li>\"How to Signal Authority Without Saying a Word\"</li><li>\"How to Avoid Sending Signals of Weakness\"</li><li>\"How to Influence How People Receive Your Message\"</li><li>\"How to Infuse Your Words with Life and Emotion for Greater Impact\"</li><li>\"Using Your Voice to Capture and Focus Your Listener's Attention\"</li><li>\"A Powerful Way to Re-Engage Your Audience\"</li><li>\"A Simple Way to Lead Someone's Attention\"</li><li>\"How to Powerfully Lead People to Your Outcome\"</li><li>\"How to Use Pre-Framing to Control the Communication Dance\"</li><li>\"How to Avoid Objections and Resistance\"</li><li>\"The 4 Stages of Learning on Your Path to Mastery\"</li></ul><p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course is about more than just how to influence others. It's going to give you a fresh perspective on what persuasion is and provide powerful, <strong class=\"redactor-inline-converted\">direct methods </strong>that will show you <strong class=\"redactor-inline-converted\">how to communicate more effectively </strong>and<strong class=\"redactor-inline-converted\"> understand other people more fully</strong> starting today. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This is a <em><strong class=\"redactor-inline-converted\">Complete Persuasion and Communication Skills Course</strong></em> that will teach you <em>exactly</em> how to influence others, get what you want and experience more choice and better relationships.<br></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>All with a <strong class=\"redactor-inline-converted\">small time investment</strong>, starting with as little as 5-10 minutes per day and gradually building to about 30 minutes per day.</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>This course will walk you through specifically <em>why, what, when, where and exactly how to persuade others and move through the world with greater influence and presence.</em></p>\n\n<p><strong>Some of the Questions answered in this course:</strong></p>\n\n<ul><li>How can you improve your communication skills?</li><li>Why do I easily run out of things to say in conversations?  How can I avoid this?</li><li>What are some tricks for having an interesting conversation with someone you just met?</li><li>Why are communication skills so vital?</li><li>Do I have to pretend or \"be someone I'm not\" to be persuasive?</li><li>Isn't persuasion inherently manipulative?</li><li>Can you be influential and persuasive and still have integrity?</li><li>How can you reasonably practice these skills with a busy life?</li><li>Is it worth it to take the time to learn these skills?</li><li>Can you really build deep levels of rapport with people you just met?</li><li>How do you get people to like you fast?</li><li>How do you quickly develop trust with other people?</li><li>What makes people make decisions that seem irrational?</li><li>Can someone who is an introvert be a powerful and influential communicator?</li></ul>\n\n\n\n\n\n\n\n\n\n\n\n<p><strong class=\"redactor-inline-converted\">What Should I Do Now?</strong></p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Give the course a chance to help you become a better communicator and increase your ability to persuade and engage others by enrolling today. <strong class=\"redactor-inline-converted\">Effective Communication can truly change your life</strong>, it did mine. I'm looking forward to seeing you on the inside if you <strong class=\"redactor-inline-converted\">choose to enroll</strong>.</p>", 
    "end_date": null, 
    "title": "Persuasion Power & Influence Vol. 1: Effective Communication", 
    "price": "25.00", 
    "instructors": "Ken Wells", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/762874_afce_4.jpg", 
    "course_url": "https://www.udemy.com/persuasion-power/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-15T05:43:52Z"
}