{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong style=\"\">Welcome!<em style=\"\"> Latest: Course Updated on March 2015</em><br style=\"\"></strong></p><p><strong style=\"\">What makes a person  compelling</strong>?  In this chaotic,  over-stimulated environment, what makes people stop in their tracks, perk up  their ears, and <strong style=\"\">hunger for more</strong>?  If you&#039;re interested in <strong style=\"\">selling your organization</strong>, the art of communication is  critical.  I will teach you how to grab  the listener&#039;s attention so they<strong style=\"\"> stay  engaged and curious</strong>. </p><p>Your marketing campaign begins with your ability to speak with confidence, <strong style=\"\">pitching yourself and your business</strong>.  While it may be uncomfortable at first to  promote yourself with passion and enthusiasm,<em style=\"\"> this one act alone will fuel your business success</em>.  Do you have a <strong style=\"\">dynamic and compelling</strong> <strong style=\"\">elevator  pitch </strong>at a moment&#039;s notice?  Once you  take the time to learn how to communicate confidently, you will shine brightly  and ignite curiosity in everyone you meet.</p><p>In  this course about how to speak with confidence, I will teach you:</p><p>1.  How to <strong style=\"\">connect to the passion</strong> you feel for your business or organization.</p><p>2.  How to i<strong style=\"\">dentify and remove negative thoughts</strong> that have been holding you  back.</p><p>3.  How to <strong style=\"\">find the spark of your story</strong> so you can ignite the curiosity of the  listener.</p><p>4.  How to craft <strong style=\"\">a dynamic elevator pitch</strong>.</p><p>5.  How to <strong style=\"\">seek opportunities to connect</strong> with new prospects.</p><p>6.  How to <strong style=\"\">capture the hearts and minds of your audience</strong> at any presentation.</p><p>Who should attend?</p><p>This presentation training course is ideal for anyone who has ever answered the  question, &quot;So, what do<em style=\"\"> you </em>do?&quot;.  If you have ever experienced the slightest  bit of hesitation, then you are missing the single biggest marketing  opportunity to sell yourself and your business.   <strong style=\"\">Learning how to LOVE sharing your  vision with the world is easy</strong>.  Learn  how today.</p><p>These video tutorials help you transform yourself from reluctant  promoter to passionate communicator and teach you how to speak with  confidence. </p><p>You were born to shine brightly, the trick is learning how! </p><p>Dive in.  Explore the free lectures and ENROLL NOW.  <strong style=\"\">You have a 100% money-back guarantee for 30 days.  No risk, huge rewards.  Learn to pitch yourself brilliantly today.</strong></p>", 
    "end_date": null, 
    "title": "Pitch Yourself! Learn to Ignite Curiosity + Inspire Action.", 
    "price": "20.00", 
    "instructors": "Alexa Fischer", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/19645_ef6a_11.jpg", 
    "course_url": "https://www.udemy.com/market-your-message-ignite-curiosity-inspire-action/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-06-17T05:47:37Z"
}