{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">The <strong style=\"\">Professional Voice Warm-Up for Actor&#039;s, Performers, Voice Over Artists and Presenters </strong>is a comprehensive series of exercises designed to warm up your voice safely, effectively and efficiently putting you in a power position in your chosen field. </p><p style=\"\">By working on your voice on a regular basis you develop a professional edge as an artist. It helps you connect to a deeper truth, opening your instrument putting you in a state ready to work. You develop greater access to the full range of your voice. </p><p style=\"\">The exercises are ordered and separated into two different, dynamic warm ups; The first, <strong style=\"\">Voice Be Resonant</strong>, has been designed to tap into your left brain and the second, <strong style=\"\">Voice Be Free</strong>, is designed to tap into your right brain. Together they give you the tools you need to create a grounded, rich, resonant, authentic voice. No artists should be without these tools. They&#039;re invaluable and fun to do. They will contribute to your <strong style=\"\">weekly creative workout</strong>. </p><p style=\"\">Ultimately you gain greater confidence as an artist after doing these warm-ups on a regular basis. You will certainly notice the difference in connection to your instrument. </p><p style=\"\">These warm ups a designed for actors and presenter (as well as performers and voice-over artists) rather than singers. This is not a singers&#039; vocal warm up, although singers too could benefit from doing these exercises. </p><p style=\"\">From <strong style=\"\">beginners to professional</strong>, these exercises serve each and every one of you. These are tools you will keep with you for the entirety of your career. </p><p style=\"\">Each warm up is outlined and there&#039;s a video demonstration of how to implement each exercise. Following this you can download your own audio of the warm ups and a complete transcript of each warm up. You can work at your own pace when and how best suits you and your professional requirements from the rehearsal space, to your home studio, to your car. </p>", 
    "end_date": null, 
    "title": "Professional Voice Warm-Up for Actors Performers Presenters ", 
    "price": "20.00", 
    "instructors": "Leanne Mauro", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/502578_ace1_2.jpg", 
    "course_url": "https://www.udemy.com/voicewarmup/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-15T04:31:22Z"
}