{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>In this course titled 'Psychic Power- Know Others Well When You Meet For First Time' By Pradeep Aggarwal , you will learn -</p><p>By understanding someone in the first meet itself, you can improve your ability to relate to them and increase your chances for success too. For example, in a job interview, the more you know about how your interviewer thinks, the better you can present yourself.<br> <br> This course is designed to help you discover how to use mind power techniques to get valid insights about people and to be able to identify people in the first meet itself.<br> <br> Learning the physic ability to quickly get an insight about anyone when you first meet them, will help you identify the people who make empty promises and discover the people who are genuine and sincere. </p><p>This course is designed to help you know someone when you first meet them and develop a rapport with them by understanding their mindset and their thinking to establish a long term relationship with them using psychic power techniques , psychometry and advance impression techniques.</p><p>It is ideal for students who are looking out to venture into the corporate world and meet people for the first time. Also helpful for students who are giving job interviews to understand the mindset of the interviewer.</p><p>You will be able to relax instantly and establish a confidence trigger to feel confident anytime you wish to.</p><p>This\n course contains a lot of psychic exercises and more than 35 minutes of \nlive video content designed over 8 lectures in English including bonus \ne-books.</p>", 
    "end_date": null, 
    "title": "Psychic Power- Know Others Well When You Meet For First Time", 
    "price": "20.00", 
    "instructors": "Pradeep Aggarwal", 
    "commitment": "38 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/648598_22a5.jpg", 
    "course_url": "https://www.udemy.com/psychic-power-know-others-well-when-you-meet-for-first-time/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-23T06:19:07Z"
}