{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Public Speaking from A to Z is a great course for the beginner or the intermediate. I will share with you over 11 years of experience. If I wanted to fill this course with a lot of fluff, I could have made it a lot longer, but that is not my style. I believe in getting right to the point and given you the information you need to get started to give powerful speeches quickly.</p>  <p>While this course is just a little over an hour long, it's full of great information that will teach you how to write a speech by brainstorming and what you need to focus on to make your audience want to hear what you have to say. If you don’t make your speech relevant to them, then you are going to lose their attention. I will show you how to hook them from the beginning and keep them hooked all the way to the end. </p>  <p>You will learn the basics about using visual aids, and how to go through your speech to polish it up to make it sound great. You will also learn about your body language, lots of Dos and Don’ts, and how to overcome nervousness. I will teach you how to answer questions, tell you things you need to know about your audience, and even teach you how to speak at a funeral. </p>  <p>I believe everyone who is interested in speaking publicly will benefit from this course and will enjoy it. I look forward to having you as a student. </p>", 
    "end_date": null, 
    "title": "Public speaking from A to Z ", 
    "price": "20.00", 
    "instructors": "Cougan Collins", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/774928_4172_4.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-from-a-to-z/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-26T09:54:27Z"
}