{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Public Speaking: Deliver Successful Presentations</strong></p>\n\n<p><strong>JOIN OVER 1900 STUDENTS IN MY PUBLIC SPEAKING COURSES!</strong></p>\n\n<p>---------------------------------------------------------------------------------------------------------------------------<br><strong>Making effective presentations is a skill that can make or break careers and is crucial to spread messages and ideas </strong>(even if you don't buy this course keep it in mind).<br>This <em>Public Speaking </em>courses helps you deliver better communication by focusing on what matters and avoid common mistakes. There is no schoolbook to follow to be a better presenter but we can take a page from the great communicators.<br>Almost 50 video lectures and extra available to address public speaking in an engaging and fun way. Those 4 <em>Public Speaking </em>courses covering all the key factors like:</p>\n\n\n\n\n\n\n\n<ul><li><strong>Preparation</strong>. Check how do you prepare a presentation against the rotated square framework.</li><li><strong>Delivery.</strong> Improve your communication and avoid common pitfalls that can damage your credibility or effectiveness. (THIS MODULE)</li><li><strong>Visual aids.</strong> The vast majority of them hinders speakers rather than support them. Learn why, how to design and use them to your advantage.</li><li><strong>Engaging, Q&amp;A and Feedback.</strong> Get your audience involved from different perspectives, including the emotional one, fundamental for moving people. </li></ul>\n\n\n\n\n\n\n\n<p>After taking this course you will know exactly what is important to be credible in front of your audience. You will learn how to deliver your message in the best way, using your tension to your advantage and which is the greatest weapon a speaker can use.<br>This course can be followed as part of the whole Public Speaking series or as a standalone (you don't need the other three modules). Just before the end take the test to see if you are now mastering the secret of preparing a presentation. The follow the extra lecture on what to read or watch or enrol in one of the other courses.<br>If you want to move audiences and improve a terrific asset for you and your messages then this is your course!</p>\n\n\n\n\n\n\n\n<p>You will get:</p>\n\n\n\n\n\n\n\n<ul><li><em>Full, free lifetime access</em></li><li><em>11 lectures and over 1.5 hours of video</em></li><li><em>Downloadable extras to support you in the preparation process</em></li><li><em>All future extra lectures and upgrades are always included for free</em></li><li><em>Unconditional Udemy 30 day money-back guarantee - that's my personal promise of your success!</em></li></ul>\n\n\n\n\n\n\n\n<p><strong>Effective public speaking boosts your message and your career, don't waste opportunities: enrol now!</strong></p>", 
    "end_date": null, 
    "title": "Public Speaking: Deliver Successful Presentations", 
    "price": "25.00", 
    "instructors": "Paolo Pelloni", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/814420_dc48_2.jpg", 
    "course_url": "https://www.udemy.com/public-speaking-deliver-successful-presentations/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-06T12:57:11Z"
}