{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>  \t<strong>&quot;Individual commitment to a group effort - that is what makes a team work, a company work, a society work, a civilization work.&quot;  </strong>  </p>  <p>  \t<strong>      - Vince Lombardi  </strong>  </p>  <p>  \t            All of society is divided into groups in one form or another.  Starting out as a family group and forming different group as we progress in the world.  Understanding groups and how they function most effectively will <strong>get you ahead of the game</strong>.  No more getting caught off guard.  You will be able to use the skills in this course to instantly <strong>recognize the movers and shakers</strong> in a group by where they sit, how they talk and what they say.  </p>  <p>  \t            By understanding how groups think, you can effectively <strong>improve any group you encounter</strong> and turn it around for the better.  Knowing the roles that individuals play in the group as well as understanding the distinctions and nuances in task based and social based groups, <strong>you will be better equipped to help the group</strong> meet its needs and perform its goals.  </p>  <p>  \t                Groups are more than a collection of individuals they take on a life of their own and work in different ways because of that.  Having the foundations of group dynamics theory, <strong>any group will make more sense</strong> and can be easier to fit into and work with.  </p>  <br>  <p>  \tStart understanding groups today so that you can shape you future interactions and get ahead in any group you encounter.  </p>", 
    "end_date": null, 
    "title": "Reading a Group: Using Group dynamics to get ahead in life ", 
    "price": "20.00", 
    "instructors": "John Boyle", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/321080_1bed_2.jpg", 
    "course_url": "https://www.udemy.com/group-dynamics/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-16T19:31:46Z"
}