{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>A sense of humor can be a person's greatest asset. This skill can help you interact easily with others and  establish new relationships. It improve your health while motivating you, and even help you diffuse difficult situations. </p><p>People are not meant to be alone. As much as we enjoy the presence of our own company, there is no denying that we still look towards spending time with the people we cherish and seek to meet new people whether if it is to increase our network, work or for companionship.</p><p>One factor that people seek out when trying to meet new friends or maintaining friendships is that they wish to be surrounded by people who can make them laugh and have a good time. Of course, this is not the only thing we look for but it is a major factor.</p><p>A sense of humor is often sought after because we look as friendships as people we can surround ourselves during the good times in our lives and especially the bad and what better cure is there to rough times than a good laugh? We want to be around people who will not make us feel worse than we are already feeling and will distract us or lighten our load during difficult times in our life.</p>  For those who don’t know me, my name is Bob Francis and I’m the Co-Founder of YourLifeDesigners team. Our mission is to change people’s lives by providing them the tools and the motivation they need. We already have 7 top rated courses that bring together over 5 thousands of satisfied students from all over the world.", 
    "end_date": null, 
    "title": "Reveal Your Humor: Social Life & Communication Skills", 
    "price": "25.00", 
    "instructors": "Bob Francis", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/739744_76c8_3.jpg", 
    "course_url": "https://www.udemy.com/reveal-your-humor-social-life-communication-skills/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-24T09:28:57Z"
}