{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><em></em></p><p>You are about to learn a powerful tool that will give you the ability to speed read people in real time, decode their sentiments, understand their behaviours and get an immediate insight into their mindset.</p><p><strong>Understanding the personality type of any individual who crosses your path will make your perceptions clear, your judgements sound and your ability to connect with others effortless</strong>.</p><p>Have you ever wished you could understand people better? Have you ever wondered, what invisible strings of their mind make them react in a certain way and whether this can be changed?</p><p><strong>Think of the advantages you could have</strong> if you could glimpse a part of their inner world and be able to truly comprehend (and predict!) their responses.</p><p>On the other hand, how wonderful it would be to become yourself a person who can instantly adapt to any circumstances and have an upper hand in every situation! Wouldn’t it be a great skill to have?</p><p><em><strong>The secret is – to understand others, you must first learn to understand yourself. </strong></em></p><p>This course is going to teach you the principles of human personality, as seen through the prism of the four Elements we all know – Fire, Earth, Air and Water, and how to use them to empower yourself.</p><p>Too many people are trying to shape their lives without understanding their real nature - or even going against it! - which obviously creates struggle and unhappiness. <strong>Learning your natural rhythm and living in alignment with it will set you mentally and emotionally free</strong>, transform both your interaction with the world and the quality of your life.</p><p><strong>If you run a business or your job involves a lot of personal interaction with clients</strong> – such as in coaching, counselling, sales, marketing or customer service, you may find the information you find here to be your secret key to a greater success, which will transform your results from good to outstanding.</p><p>If you simply want to find a way of <strong>empowering yourself</strong>, discover your own unique niche and build better relationships – this is the course you've been looking for.</p><p>But it's not all.....<br></p><p><strong>HERE ARE YOUR ADDITIONAL BENEFITS!</strong><br></p><p>Taking this course is an important step on your self-development journey, and you are going to discover a lot of new information. I believe though that the full learning process needs to be multichannel and interactive to provide the best value for the students - and I did my best to help you achieve the best results.</p><p>Here's what you can enjoy completely <strong>FREE </strong>when you enroll on this course:</p><p>* An adapted version of my book, 'The Master Of The Elements', that has been created especially for my students - 98 pages - <strong>$15</strong> <strong>value</strong></p><p>* A complete set of the highest quality HD video meditations for each Element - a powerful mix of binaural beats, NLP and hypnosis for a greater effect -<strong> $40 value</strong><br></p><p>* A chance to win a FREE PERSONAL SESSION with me through Skype, (Q&amp;A or coaching, your choice. 60 minutes) - <strong>$250</strong><strong> value</strong></p><p>* 35% OFF (more than a quarter of a price!) entry ticket to ANY of my events for a year - minimum <strong>$500 </strong>value</p><p>* <strong>Lifetime VIP access</strong> to ALL my learning resources, including paid webinars, podcasts, books and future courses discounts!</p><p><br></p><p><strong>WHAT OTHERS ARE SAYING ABOUT THIS COURSE:</strong></p><p><em>\"I've just won a contract with the biggest financial services company in the world, to design their brand new product. This task involves me using the skills of all 4 Elements. I wouldn't have achieved it without the solid foundations of this course.\"</em> <strong>- Michael D.</strong></p><p><em>\"I went through the Master of Elements course again. It is such a gold mine! I get richer and richer every time I go through it. Seriously…your principles allow me to read people lightning fast and profile prospective clients before they’ve even said a word. Eye-opening, practical and effective techniques for any leader.\"</em> <strong>- Marcus O.</strong></p><p><em>\"Loved this course, it's concise and intense, and gives excellent value. It helped me see my relationships, both business and private, in a new light. I can't emphasise enough, what a massive difference it has made in my life.\"</em> <strong>- Anthony T.</strong></p><p><strong></strong></p><em></em><p>~</p><p>Why not make TODAY the day you start transforming your life?:)<br></p><p><br></p><p><br></p><p> <br></p>", 
    "end_date": null, 
    "title": "Social Superpowers: Become A Leader Through Knowing Yourself", 
    "price": "50.00", 
    "instructors": "Jane H. Tepley", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/630436_707f_2.jpg", 
    "course_url": "https://www.udemy.com/social-superpowers-become-a-leader/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-10-04T14:55:27Z"
}