{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t<strong style=\"\">  How come some people so easily manage to persuade to others while you struggle? What&#039;s the secret to effective influential communication?</strong>  </p>  <p style=\"\">  \t     With The Art Of Persuasion you&#039;re getting all the answers you need.  </p>  <p style=\"\">  \t     You will discover <strong style=\"\">secrets about human behavior</strong> and learn <strong style=\"\">why people behave the way they do</strong>. If you ever observed anybody losing control of their behavior, now you will now why. You will learn about the true reason why people do what they do and what really drives their behavior (hint: it&#039;s never their logic!).  </p>  <p style=\"\">  \t     And then we will move on to the second part, in which you will get hands-on, <strong style=\"\">ready-to-use tips and techniques to persuade others.</strong>  </p>  <p style=\"\">  \t     We will look at 3 groups of techniques: based on human nature, social triggers and psychological triggers.  </p>  <p style=\"\">  \t     And finally you will get a list of the <strong style=\"\">secret words that control mind</strong>. The words that will make your persuasive communication 3 times more effective!  </p>  <p style=\"\">  \t    This content was first presented to the audience of almost 100 people by the invitation of The University of Nottingham Malaysia and UNMC Psychology Society . Here is what some of the students told me after attending it:  </p>  <p style=\"\">  \t<em style=\"\">&quot;It was a fantastic one!! I&#039;ve learn a lot and what impress me the most is that I am able to apply was taught immediately for my work.<br style=\"\">  \t  Example was really simple and easy to understand, and most importantly, it&#039;s very practical to be used in daily practice!! Well done!&quot;</em>  </p>  <p style=\"\">  \t<em style=\"\">&quot;I love the talk especially when you talked about the technique to persuade. Through that, I learnt how to persuade people slowly and let them accept my view.&quot;</em>  </p>", 
    "end_date": null, 
    "title": "The Art Of Persuasion", 
    "price": "45.00", 
    "instructors": "Magda Kay", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/121108_553c_5.jpg", 
    "course_url": "https://www.udemy.com/the-art-of-persuasion/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-17T08:29:37Z"
}