{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is the Ultimate How To Self-Publish Like A Pro Course. It includes four distinct courses, each designed to help you publish and launch your book for maximum impact.</p><p>In this Ultimate How To Self-Publish Like A Pro Course you will follow the instructor step-by-step through the self-publishing process from start to finish. You'll also learn how to create a Kindle ebook and how to connect your Kindle ebook to your physical book on Amazon.<br></p><p>In addition to this you'll receive my Author's Platform Building course that will show you how to build an author's platform to launch your book and you'll receive a bonus module that will give you a strategy for launching your book to increase you chances of landing on a bestsellers list.</p><p>Finally you'll receive my two other social media mini courses. How to reach more people on Facebook organically with my Facebook organic reach course. And learn to grow a powerful Twitter platform and increase your influence online with my powerful Twitter Impact Strategy course.</p><p>This whole course is broken down into approximately 30 modules between 5 to 15 minutes in length each and is packed rich with practical content to get your book published and to turn you into an influential author.</p><p>If you've ever dreamed of being a published author, this course is absolutely for you.</p>", 
    "end_date": null, 
    "title": "The Ultimate How To Self-Publish Like A Pro Course", 
    "price": "50.00", 
    "instructors": "Derek Ouellette", 
    "commitment": "6.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/664310_6e77_4.jpg", 
    "course_url": "https://www.udemy.com/ultimate-self-publish-course/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-09T02:54:13Z"
}