{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>2 FREE BONUSES WHEN YOU JOIN TODAY...</strong></p><p><strong></strong>As soon as you purchase The Willpower Secret, I will send you two extraordinary bonuses.</p><p><strong>One</strong>. The complete eBook of The Willpower Secret (Extended Edition)<br></p><p><strong>Two</strong>. The complete audio book of The Willpower Secret (Extended Edition: 6 hours)</p><p>The extended editions includes 2+ hours of additional content, stories and exercises for you to use to create incredible change in your life.</p><p><strong></strong>I look forward to seeing you on the inside.</p><p>Dean<br></p><p><strong>HOW THIS COURSE CHANGED MY LIFE (and how it can change yours as well)...<br></strong></p><p>Hi. My name is Dean Dwyer. I recently turned 50 (I know I'm old) and I can honestly say that my life has never been better.</p><p>I have lost 40 lbs and kept it off for 4+ years. I wrote and traditionally published my first book even though English was always my worst subject in school. And I was finally able to quit my teaching job (I was a teacher for 17 years) to form my own business.</p><p>What is more startling however, is that all of this happened after the age of 45 - an age where you might think it would be way too late for someone to change their lot in life.</p><p>I am proof that it is never TOO late to flip life's plan on its head and create something truly spectacular for yourself; something beyond your own imagination.</p><p>And while most people fear turning 50, I am absolutely thrilled because I <strong>KNOW</strong> the next 50 years of my life are going to be exponentially better than the first 50.</p><p>So how was I able to accomplish these things so late in my life?</p><p>It came down to finally understanding how to build remarkable willpower. I used the habits I share in this course to do all of those things I mentioned above and more.</p><p><strong>AND THAT IS GREAT NEWS FOR YOU!</strong></p><p>You see I wasn't born with any special skills in the willpower department that make me unique to the world. I was just a regular guy working hard and doing a lot of the popular stuff people said I shoud be doing to create change, yet getting virtually no return for my efforts.</p><p>That finally changed when I began to study how successful people got results. And what I discovered might surprise you. It turns out they are just like you and I except for this one thing that they do differently.</p><p>And it is not what you might think.</p><p>The biggest myth out there about successful people is that they DO the things that the less successful don't. But that isn't actually true.</p><p>After researching and interviewing hundreds of these people I was finally able to crack their code.</p><p>They <strong>THINK</strong> differently so that when they do take action it is deliberate and intelligent. As a result, they accomplish things most people can only dream about doing.</p><p>So lets go back to why this insight is <strong>GREAT</strong> news for you. That thought process they use is not something they were born with. It was something they learned.</p><p>And I am going to teach it to you.</p><p>Picture for a moment how your life will change once you learn to master the habits I teach in this course. Never again will you have to worry about a lack of willpower in any area of your life because you will know how to create it at will (pun most definitely intended) whether you are looking to choose...</p><ul><li>discipline over indulgence (very powerful when it comes to weight loss)</li><li>decision over indecision</li><li>vulnerability over shame</li><li>responsibility over blame</li><li>gratitude over disappointment/indifference</li><li>prosperity mindset over poverty mindset</li><li>action over procrastination</li><li>courage over silence/backing down</li><li>confidence over insecurity</li><li>understanding over ignorance</li><li>leading over following</li><li>forgiveness over bitterness (or as a friend once told me, \"Stewing in an angry froth.\")</li></ul><p>Hopefully you are surprised, if not shocked, at the list you just read. Willpower goes far beyond the simple things like becoming an early riser or writing 1000 words everyday. The traits that build our character are acts of will. And they are HARD to accomplish. That's why willpower is needed.</p><p>But imagine how different your life would be if you mastered the mindset of willpower.</p><p>Imagine what it would sound like to finally lose those stubborn pounds you have been carrying around for years and have friends and family constantly commenting on how great you look.</p><p>Or visualize how your life would change if you finally wrote that book or designed that course or created that app that would launch that side business you have been aching to start. How amazing would it be to earn enough money so you could escape 9 to 5, work from anywhere and be a part of what best selling author Tim Ferriss calls the <strong>NEW RICH</strong>.</p><p>How amazing would your life be if you learned how to manufacture willpower on demand in any area you desired?</p><ul><li>What would you create?</li><li>Who would you become?</li><li>What kind of people would you attract into your life?</li></ul><p>If you want to get the answers to those questions, then you are ready to get started with this course right now. You have absolutely nothing to lose and everything to gain.</p><p>See you on the inside.</p><p>Dean</p><p><strong>Course details...</strong></p><ul><li>over 8800+ satisfied students </li><li>less that 0.1% refund rate</li><li>a bunch of 5-star reviews</li><li>4+ hours of content</li><li>total of 20 BIG IDEAS with each idea broken down into 3 main lessons</li><li>content delivered in multi-learning modality format (studies show that reading and listening to the words at the same time increase retention and comprehension of the material)</li><li>entire course also available in eBook and audio format for FREE ($50 value)</li></ul><p><strong>A rock solid 30-day money back guarantee...</strong></p><p>There is absolutely ZERO risk for you to try the course as uDemy offers a no questions asked 30-day money back guarantee. </p><p><strong>Testimonials...</strong></p><p>Here is some really honest and authentic praise for the course.</p><p>\"<em>Dean's</em> <em>course was comprehensive, full of innovative — and yet simple — ideas, and enjoyable. Dean's personality is pretty hilarious, and he's not afraid to share some of his own humbling experiences to get his points across. He also effectively utilizes the experiences of others to illustrate key points. Between that, his sense of humor and the multitude of tips and tools this course provided, it was worth every penny. I finished the course feeling like I had a shot at rewriting the history that kept repeating itself, and also an understanding of why I'd failed in certain areas. Moreover, the course reinforced tools I already have, and allowed me to think about how I had used them to succeed in the past. I didn't put those things together until I took the course and could see with clarity what worked and why. I have no doubt I will reference this course material for years to come and that it will continue my personal \"Katholution.\" </em></p><p>-Katherine Cobb</p><p>Best ever course I have done </p><p>I am only half way through the course but can't wait till the end to write this review. I came across this course when I was desperately trying to overcome a decade old habit - which was not good for my long term health and my current plans to lose weight. I thought I lacked willpower and did not know how to have a stronger self to do what I really wanted instead of what I was doing.</p><p>I came across this course on udemy, read a few reviews and decided to give this course a try! I am very very happy with the results. I have been able to overcome such a chronic habit in a matter of 7 days. I am literally off it. I love this course. All the advice, tips and techniques taught are very very practical and can be used in any area of life you are struggling in. I think I will keep coming back to it. Thanks Dean!</p><p>-Shalu</p>", 
    "end_date": null, 
    "title": "The Willpower Mindset: Success starts with state of mind", 
    "price": "30.00", 
    "instructors": "Dean Dwyer", 
    "commitment": "4 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/117100_536e_123.jpg", 
    "course_url": "https://www.udemy.com/building-incredible-willpower/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-11-08T18:21:55Z"
}