{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>This is a Train the Trainer. YOU will be GUIDED through the course to EQUIP you with the ESSENTIAL SKILLS that will enable you to tap from your POTENTIAL and make you an EFFECTIVE WORLD CLASS trainer.</p><p>This course is suitable for those in a position to train others for example teachers, trainers, lecturers, managers, mentors, motivational speakers and you. </p><p>It is applicable in Further and Higher Education, Community Learning and Human Resource (HR) among other settings.  </p><p>It is great for beginners as well as experienced trainers who want to refresh skills. you are welcome to share your ideas to make this successful for all of us. </p><p>You need basic and functional skills in English, Maths and ICT. You also need a specialist subject or vocation or a topic you are passionate about.</p><p><strong>Structure</strong></p><p>The introductory part of the course is mainly knowledge-based. </p><p>The set tasks will deal with showing an understanding of principles of delivering learning. The course will be divided into sections.</p><p>The introductory part will be looking at what is required at the initial stages of delivery. This will cover initial assessments/skills check, icebreakers and their purpose, ground rules and the teaching and learning cycle.</p><p>This part will also include the roles and responsibilities of a trainer and how people learn, individual and group learning needs, learning styles and types of learners</p><p>It will then focus on planning and designing training, aims, SMART learning outcomes, scheme of work and session plans.</p><p>The attention will then  shift on selecting suitable resources.</p><p>To complete the introductory part, the course will move on to the preparation for delivery and practical considerations including legislative requirements, timing, procedures and how to keep records.<br></p><p>The practical part of the course follows through a personal journey as shown on course GOALS. </p><p>1. Rediscover your potential </p><p>2. Be empowered </p><p>3. Unleashed your potential</p><p>4. Apply the specifics</p><p>5. Maximize your potential. </p><p>The teaching strategies used will include video, audio, presentations, text, and a hybrid of video with slides.</p><p>You are free to complete at your own pace.</p><p>Let's get started.</p><p><span></span></p>", 
    "end_date": null, 
    "title": "Train the Trainer", 
    "price": "20.00", 
    "instructors": "Social Scientist, Teacher, Esther Nduta", 
    "commitment": "30 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/538668_f35d_6.jpg", 
    "course_url": "https://www.udemy.com/train-the-trainer23/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-06-27T15:25:21Z"
}