{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\">  \t    Your voice is the most important thing that you have. When you know how to use  it then it gives your message power. If you don&#039;t know how to use it you end up  sabotaging yourself.<br style=\"\">  \t<br style=\"\">  \t    I have seen so many people have a great message only  to have it weakened by their inability to use their voice in a way to correctly  deliver it.<br style=\"\">  \t<br style=\"\">  \t    Did you know that you can accidentally create doubt and  confuse people just by using the wrong tone of voice?<br style=\"\">  \t<br style=\"\">  \t    Did you also know  that by using your voice correctly you can be perceived as confident and  powerful?<br style=\"\">  \t<br style=\"\">  \t    It doesn&#039;t matter if you are in sales, running a business,  wanting to date, or going on a job interview, your voice is the most powerful  thing that you have because it is your voice that delivers the message that you  want them to remember.  </p>  <p>  \t                  Each video build on the skills of the previous one in an easy to use 10 minutes a day style. You are only nine days away from a more persuasive life of getting what you want.  <br style=\"\">  \t<br style=\"\">  \t                Goals:<br style=\"\">  \t<br style=\"\">  \t        1 Have more influence as a speaker  </p>  <p>  \t        2 Get more sales  </p>  <p>  \t        3 Speak with precision and direction  </p>  <p>  \t                At the end of this course you will be able to completely transform they way you have been using your voice, vocabulary and emotions. You will start having the impact and influence you have always desired. <br style=\"\">  \t<br style=\"\">  \t                All you need is a way to record your voice in order to listen to what you are doing now and to be able to track your progress.  </p>", 
    "end_date": null, 
    "title": "Unleash The Persuasive Power Of Your Voice ", 
    "price": "50.00", 
    "instructors": "Tom Vizzini", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/103108_c2ab_8.jpg", 
    "course_url": "https://www.udemy.com/influencial-and-persuasive-power-of-your-voice/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-10-08T15:17:46Z"
}