{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p>Understanding  what makes people pay attention is the <strong style=\"\">key  to communicating</strong>. Whether you&#039;re <strong style=\"\">pitching</strong>  or <strong style=\"\">speaking</strong> at events, or <strong style=\"\">giving presentations</strong> at work, knowing  what you need to say and how you need to say it are critical. If you want to  have your audiences remember your pitch and take your advice you need to <strong style=\"\">understand how influence and persuasion  work.</strong><br style=\"\"></p>    <p>This Effective Communication Skills Training  course is designed to teach you easy ways to <strong style=\"\">persuade</strong> better and have long lasting <strong style=\"\">influence</strong>. This short video based effective communication skills  training will give you information and the interactive activities will lock  them in your brain so you can <strong style=\"\">use them  any time!</strong> This isn&#039;t  just a recording of me speaking to a group, it&#039;s an online course designed  specifically for the Udemy platform.</p><p>Learn to influence people without being manipulative or &quot;salesy&quot;. Get others to see you point of view and listen to you so they will follow you lead... at work and at home.</p>    <p>So don&#039;t  wait! Sign up for  Effective Communication Skills Training course NOW and start on the path to  more influence and be a successful super hero!</p>&lt;/p&gt;", 
    "end_date": null, 
    "title": "Using Influence and Persuasion for Effective Leadership", 
    "price": "20.00", 
    "instructors": "Eric Byrd", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/24531_77b8_5.jpg", 
    "course_url": "https://www.udemy.com/pitch-for-success-influence-and-persuasion/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2012-09-11T00:07:49Z"
}