{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p><strong>Yo, ¿enfadarme?</strong></p><p>Tal vez no gritas o lanzas objetos cuando te enfadas sino que te distancias o criticas a otros. Son todas formas de expresar el enfado y no estás solo/a. Este curso lo he impartido a decenas de profesionales desde ejecutivos a empleados de fábrica, a padres y en organizaciones no lucrativas... Y todos tenemos esto en común: no siempre sabemos qué pasó para enfadarnos, pero no queremos que se repita porque nos afecta al estado de ánimo, molesta a las relaciones o nos puede costar el puesto de trabajo. Es un tema actual y muy real.</p><p><strong>Algunos Contenidos</strong></p><ul><li>Neurociencia del enfado</li><li>Ciclo del Enfado</li><li>Técnica de las Invitaciones</li><li>Técnica de los Objetivos</li><li>Técnica Date un Respiro</li><li>Soluciones, ejemplos, ejercicios y pruebas</li></ul><p><strong>Vuelve la Calma</strong></p><p>Cuando practiques las nuevas técnicas y completes los ejercicios que te propongo durante el curso podrás enfrentar el próximo enfado con calma y perspectiva y evitarás los comportamientos destructivos típicos del enfado como son alzar la voz en una reunión de trabajo, hablarle mal a alguien, impacientarse con otros, o en algunos casos insultar y agredir. A mis alumnos siempre les digo “Toma lo que oyes y aplícalo, haz algo con ello y practica.” De esa forma le sacarás el mayor partido a tu inversión de tiempo y dinero.</p><p><strong>Antes y Después</strong></p><p>Una alumna me dijo que este curso había significado para ella un “antes y un después”. Le pregunté más y me dijo que no pensaba que necesitara estas técnicas, pero cuando las aplicó se vio mucho más relajada y concentrada en el trabajo, más paciente con sus hijos y en general más feliz.</p><p>Pronto me podrás contar tu ‘antes y después’ con lo que estás a punto de aprender.</p><p><strong>¡Apúntate ya! ¡No esperes!</strong></p><p><strong></strong></p>", 
    "end_date": null, 
    "title": "¡Controla tus enfados antes de que te controlen a ti!  ", 
    "price": "25.00", 
    "instructors": "Emma Judge", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/757926_ee6d_2.jpg", 
    "course_url": "https://www.udemy.com/controla-tus-enfados-antes-de-que-te-controlen-a-ti/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-10T02:46:12Z"
}