{
    "selfpaced": true, 
    "topic_name": [
        "Personal Development"
    ], 
    "description": "<p style=\"\"><strong style=\"\"></strong>В этом курсе я объясню, как современные рациональные люди, не осознавая этого,могут по прежнему верить в магию. Я покажу, как в современном мире люди власти используют эту скрытую веру людей в магию для манипуляции и контроля над сознанием, и как человек может защитить себя от манипуляции.</p><p style=\"\">В повседневной жизни, мы нередко встречаемся с ситуацией, когда разные люди предлагают нам свои услуги с целью извлечения политических, финансовых или социальных выгод для себя. Этим человеком может быть политик, обещающий нам освободить нас от налогов, если мы за него проголосуем, лидер религиозного культа, обещающий нам рай после смерти если мы присоединимся к его вере, бизнесмен, желающий продать нам свой продукт, врач, который лечит за деньги, психотерапевт, предлагающий нам решить наши психологические проблемы.</p><p style=\"\">Если в одних случаях принятие таких предложений может оказаться полезным для нас, то в других мы, не осознавая этого, можем оказаться объектом магической манипуляции. В этом курсе я расскажу, что такое магическая манипуляция, как она работает в традиционных и современных индустриальных обществах, и как современные образованные взрослые могут легко и не осознавая этого поддаться магической манипуляции. Наконец, я объясню, как, следуя определенным правилам, вы можете защитить себя от этой скрытой опасности.</p><p style=\"\">Этот курс базируется на экспериментальном изучении магического мышления и поведения у современных людей, которым я посвятил более 30 лет своих исследований. Курс состоит из четырех секций, восьми лекций, снабженных соответствующей литературой, четырех тестов и практического упражнения.<strong style=\"\"></strong></p>", 
    "end_date": null, 
    "title": "Магия в терапии: Контроль над сознанием и защита", 
    "price": "20.00", 
    "instructors": "Eugene Subbotsky", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618020_20a5_3.jpg", 
    "course_url": "https://www.udemy.com/mzjkuesw/", 
    "currency": "USD", 
    "subject_name": [
        "Influence"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T11:47:22Z"
}