{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                    \n                    Psychosis conditions, including schizophrenia, are treatable mental health problems that can affect anyone although very few people talk about the conditions and their impact on families. Millions of people across the globe find themselves thrust unexpectedly into a role providing support and care when a relative develops psychosis. Carers can play a major role in supporting their relative’s progress and recovery.\n\nThis two-week course will explore some of the key issues and questions relevant to a carer who is supporting a relative with psychosis such as:\n\n\n  Why is schizophrenia described as psychosis?\n  How can we best understand psychosis and its key symptoms such as hearing voices?\n  What are the links between cannabis use and developing psychosis?\n  Can psychosis affect physical health?\n  How do medications in psychosis work and what effects can they have?\n  In what ways are siblings of people with psychosis affected?\n  How can psychosis affect a carer’s health and their relationships?\n\n\nThis free online course will provide opportunities to share your views and experiences with carers from around the world.\n\nYou can find out more in Dr Juliana Onwumere’s post for the FutureLearn blog: “How online educational approaches can support the families of people with psychosis.”\n\n\n                                    ", "end_date": "2016-06-20T00:00:00Z", "title": "Caring for People with Psychosis and Schizophrenia", "price": 0, "instructors": "Dr Juliana Onwumere", "institution_name": ["King's College London"], "commitment": "3 hours", "subject_name": ["Health & Medicine"], "course_url": "http://www.futurelearn.com/courses/caring-psychosis-schizophrenia?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "2 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2016-06-06T00:00:00Z"}