{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                    \n                    Evidence forms the basis of modern medicine. Clinical research provides us with this evidence, guiding health professionals towards solutions to problems that they face in daily practice. Transferring existing problems in medical practice to a research setting is a challenging process that requires careful consideration. The practice of clinical epidemiology aims to address this through the application of established approaches for research in human populations, while at all times focussing on the problem at hand from a clinical perspective.\n\nThis course teaches the principles and practice of clinical epidemiology, drawing on real problems faced by medical professionals and elaborating on existing examples of clinical research. Medical researchers will lean how to translate real clinical problems into tangible research questions for investigation, gaining insight into some of the most important considerations when designing an epidemiological study along the way. \n\nCore concepts will be introduced along four key themes: diagnosis, prognosis, treatment and etiology. Followers of this course will develop their understanding of the topics addressed through lectures from experts, peer interaction and review assignments.\n\n                                            Syllabus\n                        About the courseWelcome! Here you will find general information about the course. The learning objectives, the structure, the format and the requirements of completion will be presented to you.Introduction to EpidemiologyThe course will kick off with a brief introduction to some of the key concepts in epidemiological research. We will warm up with two introductory lectures, followed by a small by assignment, before diving further into the field of epidemiology from a clinical context.Diagnostic ResearchThis week we begin at the start of the DEPTh model: Diagnosis and diagnostic research. Through a series of lectures, you will come across familiar challenges in the area of diagnosis and discover how these problems can be addressed by clinical research. Prognostic ResearchThis week you will be introduced to the challenges of evidence-based prognostication: how can we best predict the course of a patient's health? You will learn this week how this kind of question can be addressed through epidemiological research, becoming familiar with how prognostic tools can be developed for use in guiding clinical decisions.Intervention ResearchIn our final week of lectures, you will step into the world of intervention research, exploring the \"Therapeutic\" branch of the DEPTh model. We will focus on the study of intended and unintended effects, exploring a new kind of study design: the randomized controlled trial.The Online DebateThe task this week is in the form of an online debate in which you will study an existing piece of clinical research and contribute to a discussion of this research, forming both an objective assessment and using that to develop your own opinions.Exam and ConclusionThis is final assessment in the course: a quiz of 30 multiple choice questions that aim to test how well you can apply the knowledge you have gained throughout the course. Good luck!\n                                    ", "end_date": "2016-08-01T00:00:00Z", "title": "Clinical Epidemiology", "price": 0, "instructors": "Diederick E. Grobbee and Arno W. Hoes", "institution_name": ["Utrecht University"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/clinical-epidemiology", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-06-13T00:00:00Z"}