{"selfpaced": false, "topic_name": ["Disease & Disorders"], "description": "\n\n                    \n                    \n                    Welcome to an Introduction to Breast Cancer!  In this course, we’ll learn a bit about the leading cause of cancer in women worldwide – from the basic biology of the disease, to risk factors and prevention, to treatment modalities to survivorship.  We’ll talk to leading experts, explore some of the milestone studies that have pushed this field forward, and have interactive discussions on discussion boards and social media.  You’ll even have an opportunity to let us know what topics you want to cover on tweetchats, so we can try to make the content fit your interests.  \n\nThere is something in this course for everyone – if you’re a breast cancer survivor or the friend/family member of someone with this disease, this course will help you to better understand this disease, and give you ideas for questions you may want to ask your doctor.  Maybe you’re a healthcare provider or studying to be the same, this course is a great refresher on where the state of the science is, and we may even be able to offer continuing medical education credits for completion.  If you’re a healthcare administrator wondering about how the interdisciplinary components of breast cancer care fit together, or an entrepreneur thinking about unmet needs in this space, or someone in public health interested in prevention, this course is also for you!\n\nAre you ready to learn a lot, and have some fun while we’re at it?  If so, I hope you’ll join us!  Let’s get started!!!\n\n                                            Syllabus\n                        Welcome to the Course!Risks and PreventionJoin me as we start to learn about what breast cancer is, the epidemiology of this disease and the risks associated with it. In these lectures, we’ll talk about genetic mutations that predispose us to developing breast cancer.  As you’ll find out, this goes far beyond just BRCA!Under the MicroscopeWhat is cancer and how does it work? Want to learn the fundamentals of what breast cancer is?  The different “types” – what is in situ vs. invasive?  What is lobular vs. ductal?  What is grade vs. stage?  And what do molecular subtypes refer to?  Well, tune in! Learn about the hallmarks of cancer – what are the processes that actually lead to this disease?  Maybe this will give you some ideas about how we can stop cancers in their tracks!Making the Diagnosis Want to learn more about how to find breast cancers early, when they’re most treatable?  This is the lecture for you! “Tissue is the issue” – learn how we actually do the biopsies to make the diagnosis of breast cancer. How do we stage breast cancer?  Learn what tests we need to do and in whom in order to get this information!All About SurgeryHow do we actually remove breast cancer?  Is a lumpectomy just as good as a mastectomy?  Find out in this session. There are many different options for reconstructing a breast after a mastectomy – from tissue expanders and implants, to using your own tissue.  In this talk, we’ll explore some of these options. Why do we take out lymph nodes, and how?  What are the side effects?  Learn more about this in this session! Do you have questions about lymphedema?  How do you prevent it?  Can/should you lift weights after a lymph node dissection?  Should you wear a sleeve if you are going on a plane?  What about shaving, hand surgery, and having an iv placed?  We’ll answer all of these questions in this session.Beyond the Knife Learn all about radiation therapy – who needs it, when, what are the different types, and how do we minimize side effects. Who needs chemotherapy?  What about hormonal therapy?  What is targeted therapy?  We’ll learn all about the drugs we use to treat breast cancer in this session.PotpurriNot all breast cancers are the same.  Let’s learn a bit more about inflammatory breast cancer, Paget’s disease, Male breast cancer, breast cancer in pregnancy and metastatic disease. Let’s talk all about clinical trials – what they are, how they are monitored, and some of the trials that have really moved the field forward. So, you or your patients have gotten through diagnosis and active treatment, and you’re now in the survivorship period.  Great!  But this poses a whole new set of issues as people adjust to their “new normal”.  Learn about what these issues are, and a bit about survivorship care plans as well.\n                                    ", "end_date": "2016-07-18T00:00:00Z", "title": "Introduction to Breast Cancer", "price": 0, "instructors": "Anees B. Chagpar, MD, MSc, MPH, MA, MBA, FRCS(C), FACS", "institution_name": ["Yale University"], "commitment": "", "subject_name": ["Health & Medicine"], "course_url": "https://www.coursera.org/learn/breast-cancer-causes-prevention", "duration": "7 weeks", "language_name": ["English"], "provider_name": ["Coursera"], "start_date": "2016-05-30T00:00:00Z"}