{
    "selfpaced": false, 
    "topic_name": [
        "Higher Education"
    ], 
    "description": "\n\n                    \n                    \n                    If you’re interested in studying at university or college in an English-speaking country, you’ll need to learn how to write using academic English. Academic writing can be very different from other types of English writing you may have done in the past. We have developed this course to help you learn the basics of academic writing and develop your English skills for study in the UK, US, Australia or other countries where English is used.\n\nThis course will provide you with a brief introduction to academic writing, enabling you to gain an awareness and understanding of some key features of this kind of writing. You’ll learn using a mix of video, on-screen examples, discussions, and quizzes.\n\nYou will develop some proficiency in a few key areas of ‘academic’ grammar, learn about the stages in essay writing, and produce an essay of your own. We will teach you how to organise an essay, use academic writing style and cover key areas of grammar, so that by the end of the course you are able to write a good, basic academic essay.\n\nThroughout the course, we will analyse some examples of academic writing that have been produced by some of our former students, to show the improvements that can be made to an essay. These improvements are made by guiding and instructing the writer in the areas of content, organisation, language and the process of planning and drafting an essay.\n\nWe will provide you with the tools to evaluate your own writing and the writing of others, as well as clarifying some key language areas commonly used in academic writing.\n\nWhat’s in the course?\n\nThis course will run over five weeks, which will cover:\n\n\n  Features of academic writing\n  Essay organisation\n  Your first essay: language focus\n  Your first essay: focus on the writing stages\n  Your first essay: feedback and redrafting\n\n\n\n                                    ", 
    "end_date": "2016-06-13T00:00:00Z", 
    "title": "A Beginner's Guide to Writing in English for University Study", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "University of Reading"
    ], 
    "commitment": "", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/english-for-study?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-05-09T00:00:00Z"
}