{
    "selfpaced": true, 
    "topic_name": [
        "Higher Education"
    ], 
    "description": "\n\n                    \n                    \n                    “It depends.”  That is what you’ll hear when asking about the U.S. university admission process.  With over 4,000 universities in the United States and no standard application system, the U.S. admission process can be confusing for everyone, but especially for students applying from other countries.\n\nThis course will help international students (non-U.S. citizens) and non-native English speakers navigate the U.S. university admission process by offering practical information about the documents and pieces that make up a U.S. university application.  More importantly, admission officers will discuss how they use those pieces to decide who is accepted and who is denied, so that you can understand the process beyond the pieces.\n\nBy the end of this course, you will understand application basics that include researching schools, creating a school list, and establishing an application plan.  This course will not answer all of your application questions, but it will teach you to ask the right questions of yourself and the universities.  Ultimately, you will have all the information you need to start your process the right way, putting you on the path to acceptance.\n\n* Please note, while the English Language Programs are part of the University of Pennsylvania, this is not a course about applying to Penn.  Furthermore, this course is intended for international students educated in the national curriculum of their country.  While other students are welcome to enroll, the course is not intended for American students or students studying in an American, International Baccalaureate, or Advanced Placement curriculum.  The course is also intended for students who do not have access to university counseling – if you attend a school that offers university counseling, your counselor is the best source of information on applying to university.  Finally, this course is for undergraduate (Bachelors degree) freshmen (students who have not attended any university) applicants.  Undergraduate transfer applicants, students who have attended a university, will find some of the information helpful, but graduate (Masters and Doctoral) applicants will not.\n\n                                            Syllabus\n                        The U.S. Admissions ProcessThe first step to studying in the USA is to understand the application and admissions process in the U.S. How to apply to colleges and universities in the U.S. is probably very different than the university admissions process in your home country.  One big difference is the importance of “fit,” and how fit plays a different role among the 4,000+ U.S. colleges and universities. In this module, you will begin to learn about the U.S. admissions process, including how schools evaluate international applications, U.S. college admission requirements, and how schools decide who to accept (it is not all about SAT or ACT scores like many students think). You will also begin to explore yourself so that you can look beyond the \"top\" colleges and universities to identify schools based on “fit,” a big step toward being accepted into U.S. colleges and universities.Self-AssessmentThe most important part of your college application is you.  Before you apply to any U.S. universities, you have to know yourself – likes, dislikes, strengths, and weaknesses.  Once you know yourself, you can look at your application the way a U.S. admissions counselor will look at your application.  In this module you will learn how to use self-assessment to examine your application, identifying strengths and weaknesses in both your academic and non-academic qualifications.  You will also learn about EducationUSA, a college admissions assistance resource located in your home country.Research &amp; PlanningIt is time to use what you learned about yourself to start the college search and find the schools where you will apply. With 4,000+ colleges and universities in the U.S., picking the right schools for you takes time and strategy. This module will focus on three areas: (1) conducting your research, (2) building your school list, and (3) creating your college application plan.  To accomplish these goals you will learn everything from application deadlines to where you can research schools to what the information means and how to use that information to better ensure your success.The Pieces of Your ApplicationYour college “application” is made up of eight individual pieces, including essays, letter(s) of recommendation, test/exam scores (SAT, ACT, TOEFL, &amp; IELTS), and more.  In this module you will understand how each piece is viewed individually along with how that piece fulfills admission requirements and contributes to your application as a whole.  We will also discuss how to submit the pieces of your application, as well as the timing related to each piece.  Understanding the pieces of your application, along with the admission requirements, will help you assemble a stronger application overall.Admission Officials Interview SeriesWhile these interviews might be long, this information is some of the most valuable in the course.  Throughout the course you have learned that U.S. colleges and universities are all different – different environments, different personalities, and different admission processes.  In this module you will hear directly from admission counselors at five schools so that you can see the similarities and differences for yourself.  These five schools are from across the U.S. and range from small to large, highly selective to open admission, research focused to liberal arts, and more.  The previous parts of the course taught you the theories of U.S. admission, in these interviews you will learn the actual practice from the people who make the admission decisions.\n                                    ", 
    "end_date": "2016-07-18T00:00:00Z", 
    "title": "Applying to U.S. Universities", 
    "price": 0, 
    "instructors": "Erick Hyde", 
    "institution_name": [
        "University of Pennsylvania"
    ], 
    "commitment": "3-6 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/learn/study-in-usa", 
    "duration": "5 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2016-06-13T00:00:00Z"
}