{
    "selfpaced": false, 
    "topic_name": [
        "Higher Education"
    ], 
    "description": "\n\n                    \n                    \n                    L’objectif de ce MOOC est d’aider à comprendre pourquoi et comment transformer les formations dans l’enseignement supérieur, tant dans leur organisation que leur mise en œuvre, au regard des évolutions profondes qu’il subit depuis plusieurs années.\r\nLa conception originale de ce MOOC repose sur le parallèle qui est fait avec un journal et son organisation autour de rubriques :\r\n\r\nLes grands enjeux actuels de l’évolution de l’enseignement supérieur : processus de Bologne, les caractéristiques des nouveaux publics…\r\nLes recherches sur les formations supérieures : quelles sont leurs problématiques, comment elles les abordent, quels résultats ?\r\nLes grandes questions professionnelles sur la formation : la motivation de l’étudiant, quels leviers possibles, sur lesquels peut-on agir ? Les formes et modalités d’évaluation ? …\r\nMais aussi des débats, puisque le MOOC est un lieu de présentations et d’échanges.\r\n\r\nLa seconde originalité de ce Mooc est de s’appuyer sur un réseau de services TICE ou de pédagogie dans les établissements ainsi que des associations de conseillers et d’ingénieurs pédagogiques. Des actions de formation et d’échange autour des points présentés dans les différentes rubriques du Mooc seront proposées localement. Ce sont ces actions qui vous aideront à donner vie, dans vos établissements, aux formations que vous souhaitez construire.\n\n                                            Syllabus\n                        Semaine 0 :découverte de la plate-forme, présentation des instruments pour suivre le cours\r\nSemaine 1 :processus de Bologne, internationalisation de l’enseignement supérieurrecherches en information et communication sur l’enseignement supérieurmotivation de l’étudiant : comprendre et identifier les facteurs qui agissent sur la motivation et ceux sur lesquels on peut agir\r\nSemaine 2 :description des nouveaux publicsrecherches en didactique sur l’enseignement supérieurévaluation : sensibiliser au rôle de l’évaluation dans les apprentissages\r\nSemaine 3 :enseignements « basés » sur les données et leur traitementrecherches en psychologie sur l’enseignement supérieurrendre les étudiants actifs : activités possibles de l’étudiant\r\nSemaine 4 :nouvelles modalités de formation : exemples avec et sans le numériquerecherches sur les Mooc au plan internationalcomment construire un cours\r\nChaque semaine un débat sera organisé et une rubrique sera consacrée aux doctorants.\n                                    ", 
    "end_date": "2016-03-31T00:00:00Z", 
    "title": "Enseigner et Former dans le Supérieur", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "Université Paris-Saclay"
    ], 
    "commitment": "2 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.france-universite-numerique-mooc.fr/courses/ENSCachan/20012/session01/about", 
    "duration": "4 weeks", 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "France Université Numerique"
    ], 
    "start_date": "2016-03-03T00:00:00Z"
}