{
    "selfpaced": false, 
    "topic_name": [
        "Higher Education"
    ], 
    "description": "\n\n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                    You can enroll for the course here:\n                                    https://www.coursera.org/course/succeedincollege\n                                                            \n\n                            Chrome Plugin\n\n                                                            You can download the course materials for this course by visiting the following url (you need to be logged in):\n                                                                        https://class.coursera.org/succeedincollege-003/lecture\n                                \n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    succeedincollege-001\n                                                                    succeedincollege-002\n                                                                    succeedincollege-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    In How to Succeed in College, students interact and plan their transition to higher education and beyond. This multimedia course incorporates presentations, videos, and social media while focusing on strategies for student success. Various perspectives are introduced through interviews with faculty, staff, administrators, alumni, and current students to provide a holistic view of the college experience. Students in the course interact with each other via discussion forums, social media, and peer-review assignments. Topics include instructor expectations, social interaction, acclimating to new environments, strategies for studying, student resources, and basic issues in psychology. The course is designed for incoming college students of all backgrounds and interests. Join Dr. Jonathan Golding and Dr. Phil Kraemer in exploring the challenges and opportunities of the college experience.\n\n                                            Syllabus\n                        Week 1: Prepare for the college student experienceWeek 2: Learn about various types of college coursesWeek 3: Develop strategies for active listening, note taking, and exam takingWeek 4: Learn about memory recall and best practices for studyingWeek 5: Explore student resources that can help you succeed \n                                    ", 
    "end_date": "2015-08-31T00:00:00Z", 
    "title": "How to Succeed in College", 
    "price": 0, 
    "instructors": "", 
    "institution_name": [
        "University of Kentucky"
    ], 
    "commitment": "1-3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "https://www.coursera.org/course/succeedincollege", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2015-07-20T00:00:00Z"
}