{
    "selfpaced": false, 
    "topic_name": [
        "Higher Education"
    ], 
    "description": "\n\n                    \n                    \n                    This course has been designed by UCAS to help you better understand the study and training opportunities open to you. The wide range of subjects, universities and options available can be overwhelming.  Exploring your choices and making decisions can be quite daunting.  So, we’ve put together a set of materials to help shape your thinking.\n\nChoose the right subject and pathway for you\n\nBy signing up, you’ll discover more about your options and enhance your ability to make choices that are right for you.  We’ll provide insight into choosing subjects and the different pathways that can be taken after school, through higher education or other training routes, to your chosen career path.\n\nYou’ll find useful tips from students and hear from admissions tutors about what skills and aptitudes they look for in applicants, and the key things you need to consider in order to make the right decisions and choices for you.\n\nUnderstand study and career opportunities\n\nThe course includes short articles for you to read and videos to watch, plus activities and quizzes with tips to help you better understand the study and career opportunities. There is also the chance for you to learn from and support other learners through online discussions.\n\nOn completion, we believe you will be in a much stronger position to answer the question ‘What do I want to do next?’\n\n\n                                    ", 
    "end_date": "2016-10-10T00:00:00Z", 
    "title": "Smart Choices: Broadening Your Horizons", 
    "price": 0, 
    "instructors": "Mark W. Newman", 
    "institution_name": [
        "UCAS"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Education & Teaching"
    ], 
    "course_url": "http://www.futurelearn.com/courses/smart-choices?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "2 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-09-26T00:00:00Z"
}