{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">This course is about using Ableton Live to arrange your songs. You can use Ableton Live Lite, or other music software as well. </p><p style=\"\">The techniques you will learn, will help you in multiple areas of your recording career or journey. </p><p style=\"\">This course deals specifically with applying a method I call Sliding Plates to your compositions. However, I do more than that. I walk you through how to use Ableton more effectively, so you become more productive. </p><p style=\"\">I&#039;ve arranged over 400 songs in Ableton Live, and have been in the music industry since 1992. I have recorded and produced serval albums in many genres. I&#039;ve learned a lot of techniques that I want to share with you, which will help you write and complete songs faster than you have before. I have developed techniques and concepts that I will teach you, which will help you to utilize most of what Ableton Live offers. </p><p style=\"\">I go step by step, and mouse click by mouse click. I have divided up the lessons into small and bite sized pieces. My goal is to be quick and efficient not overwhelming. I give you tips along the way. I zoom in when you need to see some detail, and I help guide you around the interface, and walk you though complicated terms with analogies and simple things to remember. </p><p style=\"\">This course is designed for any one who is seriously frustrated with music arranging. </p><p style=\"\">Stepping into the computer software domain, can be overwhelming and daunting, and I have worked hard to make this course an easy transition.</p><p style=\"\">You might be and experienced musician, but when it comes to arranging a song, you might get frustrated or ask the question - What do I do now? I am here to help. This course is geared for you. </p><p style=\"\">You might be ok at arranging, but maybe you need more help, maybe your songs do not vary enough, so this course is going to help you see how to add variation, and help your songs pop. </p><p style=\"\">You might be using Protools, or Logic Pro, or CakeWalk, or Sonar, or another software program, yet this course is still of great value to you. You can apply the concepts and theory into those programs as well. </p><p style=\"\">So sign up, and take this course, and be on your way to a better professional. </p>", 
    "end_date": null, 
    "title": "Arranging Techniques for Ableton Live, Produce Better Music", 
    "price": "20.00", 
    "instructors": "Sam Gill", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/576202_3163_2.jpg", 
    "course_url": "https://www.udemy.com/professional-arranging-techniques-for-ableton-live/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-07T03:11:21Z"
}