{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t      Eq and compressors play a very important role in controlling and shaping music, movies, and TV shows. So it shouldn&#039;t be a surprise its the most used tools in audio engineering. Eq is widely used even outside of the audio world. Anything you do adjust the bass or treble of a sound is using eq. Car stereos, ipod, smart phones music player, computers, all have eq controls. Even when you adjust the sound presets on your TV you are using eq. With the EQ spread use of EQ in our everyday life you can see why its so important to get EQ right when we are engineering. After completing this course you will see just how powerful EQ can be.  </p>  <p>  \t      Compressors aren&#039;t widely used as EQ outside of audio engineering, but is still very important to learn. Using compression is the most understood tool used in audio. And because there are so many different compressors its no wonder they can be confusing.  </p>  <p>  \t      This course will teach you the basics of EQ and compression. Two tools vital to becoming a good audio engineer. With over 15 years of experience in audio I will share with ways to understand what eq and compression does, as well as how its used. After this course stay tuned as I will more courses coming soon. Since Compression is always a hot topic in audio I have a few more courses on compression planned out. This course is for beginners, but even if your past a the beginning stages of engineering I encourage you to still subscribe to this course. You may learn something you didn&#039;t already know. This course will take one hour to complete and will be followed by a quiz. If you want to further your knowledge about compression check out Basics of Compression course. Any questions my contact info will be provided in the course.  </p>", 
    "end_date": null, 
    "title": "audio engineering: EQ and Compression for beginners", 
    "price": 0, 
    "instructors": "Christopher \"Czar\" Smith", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/322818_1c12.jpg", 
    "course_url": "https://www.udemy.com/audio-engineering-eq-and-compression-for-beginners/", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-10-19T23:59:45Z"
}