{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Begin your ear training with this affordable, concise new class from Professor Kris Maloy. Using his 10 years of university teaching experience, he&#039;ll teach you to identify chords based on their sound, so you can play your favorite music by ear.</p><h5 style=\"\">A Better Way to Get Ear Training</h5><p style=\"\">Professor Maloy&#039;s new system of teaching ear training teaches you how to improve your own skills. Instead of repetitive drills, you can learn to teach yourself. With <strong style=\"\">How to Hear Chords in Music</strong>, you can now preview Professor Maloy&#039;s system without paying for a full college class.</p><h5 style=\"\">Who Should Take This Course?</h5><p style=\"\">How to Hear Chords in Music is great for students who want a gentle, accessible way to start to ear training.</p><h5 style=\"\">What Former Students Say</h5><p style=\"\">&quot;I thoroughly enjoyed studying with Dr. Kris Maloy because he cared enough to become aware of my personal musical background and found a common ground so that he could find the best ways to explain certain concepts and ideas.&nbsp;I would highly recommend studying any music course with Dr. Kris Maloy and would expect you to have the same positive results and experiences that I had.&quot;<br style=\"\"><strong style=\"\">--Maggie McClure, singer/songwriter with two albums and placements in film, TV and commercials</strong></p><p style=\"\">&quot;Dr. Maloy has a piercing ability to see through the murky, convoluted mess that is music theory and pull out all of the lowest common denominators – the fundamental building blocks of method. He shares this clairvoyance with students through a practical training that sidesteps the pretense.&quot;<br style=\"\"><strong style=\"\">--Bryan Mitschell, pro drummer and audio producer, now university faculty</strong></p><p style=\"\">&quot;I found Kris&#039; methods to be sound, informative, and practical. Studying with him gave me the skills, desire and enjoyment to continue working in the field of jazz arranging.&nbsp; I highly recommend Kris Maloy and his very skilled system of teaching.&quot;<br style=\"\">--<strong style=\"\">Mark Giammario,&nbsp;pro drummer, now university faculty</strong></p><p style=\"\">&quot;Dr. Maloy has the ability to effectively communicate complicated musical ideas and techniques to musicians of any level. &nbsp;Dr. Maloy’s familiarity with academic music as well as modern popular music has made his curriculum uniquely relevant. My experience with Dr. Maloy has been extremely enjoyable and enlightening and I would recommend his curriculum to any musician looking to dive deeper into important musical concepts.&quot;<br style=\"\"><strong style=\"\">--Nick Poss, pro singer/songwriter</strong></p>", 
    "end_date": null, 
    "title": "Basic Ear Training (Real College Course Preview)", 
    "price": "30.00", 
    "instructors": "Kris Maloy", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/60884_2f9c_4.jpg", 
    "course_url": "https://www.udemy.com/how-to-hear-chords/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2013-06-19T11:08:00Z"
}