{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>COURSE UPDATES:</strong></p>\n\n<ul><li><em>(05/28/16) </em>In order to more accurately reflect the value users get from our courses and to help us develop future content, MusicProfessor will adjust our prices from $20 to $30 on May 31, 2016. </li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>COURSE DESCRIPTION:</strong></p>\n\n<p>Learn how to pull every ounce of musicality from yourself and your ensemble with MusicProfessor's Conducting Foundations course. In this series, Dr. John Zastoupil covers numerous exercises that will help you master hand independence, phrasing, dynamic contrast, subdivision, and numerous other topics. </p>\n\n\n\n<p>No matter what type or size of ensemble you conduct, this course will truly help you perfect your conducting style and prowess.</p>\n\n\n\n<p><strong>COURSE FEATURES:</strong></p>\n\n\n\n<ul><li>Over 40 video lessons</li><li>Learn how to select and hold a baton</li><li>Cover relaxed but commanding posture</li><li>Learn how to control your entire range of motion, from your feet to your head</li><li>Discuss how all of your bodies hinges effect expression</li><li>Master multiple stylistic motions</li><li>Learn how to apply style and musicianship to any phrase or pattern</li><li>Cover numerous advanced techniques like dead beats, subdivision, pauses, releases, tempo changes, and more!</li></ul>\n\n\n\n<p>MusicProfessor's curriculum is used in nearly 100 schools and school districts throughout the United States and by more than 14,000 students and music teachers throughout the world. No where else can you find the level of detail and professional instruction of MusicProfessor's curriculum.  Plus, the course is backed by Udemy's 30 day full-refund guarantee. </p>\n\n\n\n<p><strong>ABOUT THE INSTRUCTOR:<br></strong></p>\n\n\n\n<p><strong>Dr. John Zastoupil</strong> is the Associate Director of Bands and lecturer in Music Education at the University of Texas Arlington. In this position, he conducts the Symphonic Band, Symphonic Winds, oversees aspects of the athletic band program and teaches courses in music education and conducting. John serves as an active guest clinician, adjudicator, and conductor for bands and orchestras throughout the United States.</p>\n\n\n\n<p>John earned his Doctor of Music in Wind Conducting from Northwestern University. In Evanston, he served as a conducting associate with the Symphonic Wind Ensemble, Symphonic Band, Concert Band, Contemporary Music Ensemble, and Brass Ensemble as well as assisting with conducting classes. In addition, he was an adjunct instructor in the School of Music.</p>\n\n\n\n<p>Prior to Northwestern, John served as the Associate Director of Bands and Director of the Marching Band at Eastern Michigan University. His responsibilities included conducting the Symphonic Band, teaching undergraduate courses in conducting and band arranging, as well as overseeing all aspects of the athletic band program. While at Eastern, he served as a three-time host to the Bands of America Regional Marching Contest, was inducted as an honorary member of the Michigan School Band and Orchestra Association, and was named Outstanding Lecturer in Classroom Instruction at EMU in 2009.</p>\n\n\n\n<p>A native Texan, John earned a Master of Music degree in Wind Conducting from the University of Michigan, and while in Ann Arbor, held the position of Music Director with the Michigan Pops Orchestra for the 2006 and 2007 seasons. Zastoupil received a Bachelor of Music Education degree from Baylor University, taught in Eanes ISD at Westlake High School and Hill Country Middle School in Austin, TX, andis a former student of the Aspen Music Festival and School.</p>\n\n\n\n<p>His professional affiliations include the College Music Society, College Band Directors National Association, Music Educators National Conference, Texas Music Educators Association, Michigan School Band and Orchestra Association, Phi Mu Alpha Sinfonia, and honorary membership in Kappa Kappa Psi.</p>\n\n\n\n<p>John, his wife Jennifer, and their daughter Jordan reside here in Arlington, TX.</p>\n\n\n\n<p>— </p>\n\n\n\n<p><em>This course has been provided by MusicProfessor, an online music education company.</em></p>", 
    "end_date": null, 
    "title": "Become a Master Conductor - Leading Musicians Made Simple", 
    "price": "30.00", 
    "instructors": "MusicProfessor Online Music Lessons", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/677652_9772.jpg", 
    "course_url": "https://www.udemy.com/conducting/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-22T23:56:49Z"
}