{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>\" Excellent Course</strong></p><p><strong></strong>Was able to play in the church after a month :) \"</p><p><strong>ROOKIE TO ROCK STAR? LEARN TO MASTER THE BASS GUITAR!!</strong></p><p><strong>Are you overwhelmed  with over complicated music books? Frustrated with confusing advert ridden carrot on the stick how to play the bass guitar videos? Getting nowhere fast?</strong></p><p><strong></strong><strong>That was me too...</strong></p><p><strong><br></strong></p><p><strong>My story</strong></p><p><strong></strong>\"I struggled to get motivated and commit basic bass principles to memory.  Unable to find a user friendly way to learn the bass I ended up putting it in the cupboard and not playing it for weeks at a time.  It took 5 teachers about a hundred books and years of frustration and money to get started playing the bass.\"</p><p>Hi,<br></p><p>My name is Danny Merriman, I've developed a simplified formula which uses step by step tutorials, which provides an exciting and engaging way to learn how to play the bass guitar. Each stage you will focus on easy to follow specific steps to master each key component throughout your learning experience</p><p><strong>You'll feel motivated and eager to learn as you progress through the course</strong><strong>.</strong><br></p><p>With 30 years of experience and my sincere willingness to help over 1500 students reach their goals, along with your willingness to succeed, you'll be happy you took a seat on the beginner bass formula and rise up from rookie to rockstar.<br></p><br><span></span><p><strong>With Over 1500 satisfied students and a n</strong><strong>o obligation 30 day money back guarantee give the beginner bass formula a try today.</strong></p><p><em>It's all about the bass eh...</em></p><p><br></p><p>\"When I first started playing with other musicians I didn't know where the notes were on the fret-board. I struggled to play anything and didn't feel confident enough. I'd feel embarrassed when I didn't know where an F# or the Bb was. The more I studied where the notes were on the bass fret-board, the easier I could interact with musicians and play music. When someone said lets play E, A &amp; then Bb I'd know where the notes were on the fret-board, and what to do.\"</p><p>\"It's important to say the notes out loud that you're playing so that they're committed to your memory.\"</p><p>\"Don't worry it does eventually sink in so keep practicing the exercises and you'll get there.\"</p><p>\"I found that learning the 12 bar blues pattern helped me to interact with other musicians, as there's a lot of songs out there that use that same pattern. Most rock and roll and blues songs use it so knowing it is a very useful tool to get you going and playing some cool stuff.\"</p><p><br></p><ul><li>This course is about how to play the bass guitar</li></ul><p><strong>materials included are</strong> </p><ul><li>video instructor exercises</li><li>slides</li><li>docs</li></ul><p>the course is ongoing as you can go back as many times as you like for practicing purposes </p><p><strong>The course is structured into progressive sections</strong> </p><ul><li>the basics</li><li>note recognition</li><li>playing arrangements</li></ul><p><strong>Reasons to take this course are</strong> </p><ul><li>to learn the bass technique </li><li>to improve bass playing</li><li>learn riffs </li><li>locate notes on the fretboard</li></ul>", 
    "end_date": null, 
    "title": "BEGINNER BASS FORMULA", 
    "price": "20.00", 
    "instructors": "Danny Merriman", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/472870_6d03_4.jpg", 
    "course_url": "https://www.udemy.com/beginner-bass-formula/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-04-10T15:30:38Z"
}