{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Do you want to take your playing to the next level? Do you want to learn some Chicken Pickin' Country Guitar in the style of Brad Paisley, Johnny Hiland &amp; Brent Mason? If you answered \"Yes\" to any of these questions, than the Country Guitar Essentials is perfect for you.</p><p><br>The Country Guitar Essentials Course is your Step-By-Step System for Learning Country Guitar.</p><p><br>It's important to have the right tools for learning. The Country Guitar Essentials Course will be the blueprint you follow as you develop and sharpen your new skills as a guitarist.</p><p><br>We’ll start at the basics, covering, tone, scales and techniques. Plus at the end of the course you will have a cool Country Rock Style Solo to Play-A-Long with. This course was designed to be fun while learning at the same time. </p><p><br>In this course you will learn:</p><p><br></p><ul><li>    How to get \"The Tone\"! We'll cover Guitars, Amps, Effects and even Fingernails. </li><li>    The common scales to use in Country Guitar</li><li>    Hybrid Picking Techniques &amp; Exercises</li><li>    Double Stops for Lead &amp; Rhythm playing</li><li>    Country Style Bends vs Blues Style Bends</li><li>    Chicken Pickin' Country Guitar Licks</li><li>    Chicken Pickin' Techniques</li><li>    Soloing Ideas</li><li>    Banjo Rolls</li><li>    Play A-Long with a Rockin' Country Style Solo</li></ul><p><br><br>The Country Guitar Essentials Course includes HD videos featuring both Right and Left Hand camera angles for easy learning. </p><p><br>In addition, you will also receive additional resources like: MP3 Backing Tracks and Printable PDF TAB sheets. </p><p><br>Play A-Long with the downloadable Backing Track (at Slow, Medium &amp; Fast tempos).</p><p><br>As a student, you will have lifelong access, so you can learn at your own pace.</p><p><br>You have a totally unconditional money back guarantee. Study the Country Guitar Essentials course. If you are in any way unhappy, you will get a full 100%, absolutely no conditions attached, no questions asked, refund direct from Udemy.</p><p><br><br>Don't wait. Click the \"Order This Course\" Button and get started Today!<br></p>", 
    "end_date": null, 
    "title": "Country Guitar Essentials: Chicken Pickin'", 
    "price": "30.00", 
    "instructors": "Vincent Denali", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/618634_9b1f.jpg", 
    "course_url": "https://www.udemy.com/country-guitar-lessons/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-09-21T23:41:59Z"
}