{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Have you ever wanted to play an extended guitar solo but you hands just weren't up to the task? These picking exercises should build that speed and flexibility you need.<br></p><p>The Country Guitar: Picking Exercises course  based on a 25 minute workout designed to build chops, endurance and accuracy over the next 30 days. </p>\n\n<p>This workout is based on a 25 minute routine (although if your short on time, you can <br>modify as needed). </p>\n\n\n\n\n\n<p>There's a series of 24 examples to be played along with the provided mp3 drum tracks. Use the Daily Practice Log to track your speed and playing time over the 30 day period. This easily allows you to see your progress as you move through the course. </p>\n\n\n\n\n\n<p>This course borrows concepts from fitness programs (consistency/tracking) as well as from productivity methods like the Pomodoro Technique to help you get the most out of this workout.  <br></p>\n\n\n\n\n\n<p>This is not a routine with just a bunch of boring scales, there are some really cool fun patterns that you can use to create your own licks and solos. </p>\n\n\n\n\n\n<p>This course focuses on 5 different techniques:</p>\n\n\n\n\n\n<ul><li>Alternate Picking</li></ul>\n\n\n\n\n\n<ul><li>Hybrid Picking</li></ul>\n\n\n\n\n\n<ul><li>Banjo Rolls</li></ul>\n\n\n\n\n\n<ul><li>Scales</li></ul>\n\n\n\n\n\n<ul><li>and Licks!</li></ul>\n\n\n\n\n\n<p><br></p>\n\n\n\n\n\n<ul><li><strong>1 Hour &amp; 21 Minutes:</strong> This course is packed full with Exercises and Licks you can be using by this weekends gig.</li></ul>\n\n\n\n\n\n<ul><li>S<strong>hows You the Step-by-Step Process:</strong> Examples shown for each Exercise &amp; Lick at Normal &amp; Slow Speeds.</li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>PLUS</strong> It's easy to follow along with the PDF printable TABS!</li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Right &amp; Left Hand Close-Ups in Picture-in Picture Format:</strong> Close-up Shots for Easy Learning. A total of 3 camera angles. Left, Right &amp; Center.</li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>Video Format</strong> \nfor Accelerated Learning: Unlike private lessons, the Video format lets \nyou Go at Your Own Pace and Allows You to watch as many times as it \ntakes for You to Get It Down!</li></ul>\n\n\n\n\n\n\n\n\n\n<ul><li><strong>MP3 Drum Tracks:</strong> Practice along with the included Drum Tracks at different tempos to help Build Speed and Improve Your Timing.<br></li><li><strong>PLUS</strong> I'll show you a simple 5 minute warm-up routine to help loosen the muscles.</li></ul><p><br></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n<p>And while this course is aimed at country guitar players, you don't have to be a chicken picker to get something from this course. Even if your a Blues Player or Rocker Guitarist, I'm confidant this course will help improve your right hand technique. <br></p>\n\n\n\n\n\n<p>In this course you will also get printable TABS in PDF format, MP3 drumtracks, and a printable Daily Tracking Log. <br></p>\n\n\n\n\n\n<p>You are backed by Udemy's 30 Day money back guarantee. \n</p>\n\n\n\n\n\n\n\n<p>Click the green <strong><em>\"Take This Course\"</em></strong> Button to Get Started Today!</p>", 
    "end_date": null, 
    "title": "Country Guitar: Picking Exercises", 
    "price": "20.00", 
    "instructors": "Vincent Denali", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/841484_2b5a_6.jpg", 
    "course_url": "https://www.udemy.com/guitar-picking-exercises/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-06T18:11:41Z"
}