{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t          This courses provides tuition in several diverse blues guitar finger pickijng styles, and also gives the opportunity to learn complete songs - advice is also given about singing at the same time.  </p>  <p>  \t          Artists covered - Lightnin&#039; Hopkins, John Loudermilk, Gary Davis, Sam Chatmon and Guy Davis.  </p>  <p>  \t       The acoustic blues guitar masters had an enormous influence on generations of modern guitarists - the acoustic swing blues of Broonzy, for example, became the electric style of Muddy Waters, then Buddy Guy and stevie Ray Vaughan.  </p>  <p>  \t       The starting point fo any guitar picker wanting to play any kind of blues is to study the techniques of the original bues guitar players, to see how they put their music together and to appreciate hoow their fingers produced so much rhythm and syncopation onj a relatively simple instrument like the acoustic guitar.  </p>  <p>  \t       This basi course covers several basic guitar finger picking styles, and my approach is to show you just one thing - anyone can play the blues guitar with the right tuition, time and practice - it&#039;s all up to you.  </p>  <p>  \t          Each guitar lesson includes in-video guitar tablature, discussion about technique and slow motion demonstrations of both hands. This course is a great primer for my other blues guitar lessons, which cover all of the major guitar  picking styles from most famous blues men of old.  </p>  <!-- Perfect Audience - Udemy Pixel - DO NOT MODIFY -->  <img src=\"http://ads.perfectaudience.com/seg?add=2465989&amp;t=2\" width=\"1\" height=\"1\" style=\" max-width:100%;\" />  <!-- End of Audience Pixel -->", 
    "end_date": null, 
    "title": "Guitar Lessons : Learn Guitar", 
    "price": 0, 
    "instructors": "Jim Bruce", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/205520_f919_4.jpg", 
    "course_url": "https://www.udemy.com/blues-guitar-finger-picking-basics-with-jim-bruce/", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-04-26T13:47:00Z"
}