{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>The purpose of this class is to teach you the basics of improvising on the guitar in the styles of blues/pop/rock. Playing the guitar is an ocean of infinite possibilities depending on what style you are playing and who you are playing with.I have taught professionally for many years and usually when people see me play solos and riffs they want to know how they can expand their own playing and improvise guitar solos. My goal is to teach you the concept of implementing tools of simple scales, root notes, and basic intuitive tricks to apply solos to your guitar playing. If you enjoy music, you can do this! </p><p>I have included videos of myself jamming along with some backing tracks that I have made. This class does not have much to memorize, but once you digest the material you will use it in some form or another the rest of your life as you play guitar. For me once I learned some of these concepts as a teenager I started to combine this knowledge as I watched and imitated my heroes. Suddenly playing like Eric Clapton and Jimi Hendrix was possible and I was able to create my own unique style of improvising. This is my goal for the students of this class.</p><p> Those that will get the most benefit from the course have probably played a little guitar already and know how to make some chords, jam some riffs, or play some songs. This is the level most hobbyist players achieve. My hope is that this class opens the door on how to use certain basic tools to add a new dimension to your playing. Enjoy!</p>", 
    "end_date": null, 
    "title": "Guitar Improvisation and Soloing: started with simple Solos", 
    "price": "20.00", 
    "instructors": "Robert Turrell", 
    "commitment": "33 mins", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/765140_86c2_2.jpg", 
    "course_url": "https://www.udemy.com/guitar-improvisation-and-soloing-get-started-w-simple-solos/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-02-17T06:19:00Z"
}