{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn to use all of your senses - touch, taste, smell, sight, sound, and movement - as springboards for creativity in writing amazing lyrics.  It could be you that writes the next number one song! <strong>Enroll Now!</strong>  <em>Course Created on April 26, 2016</em></p>\n\n<p>Over <strong>500 students</strong> enrolled in the first month!</p>\n\n<p><strong>Develop the time tested songwriting techniques that professionals use to create incredible lyrics while still maintaining your unique voice.</strong></p>\n\n<ul><li>Learn to connect with and create a memorable experience for your audience</li><li>Learn to write even when you're not initially inspired</li><li>Learn to streamline and accelerate your songwriting process</li><li>Learn to apply songwriting strategies to any new idea</li></ul>\n\n<p><br></p>\n\n<p><strong>Content and Overview</strong></p>\n\n<p>This course is different from any other course you will find on songwriting, because it is solely focused on the lyric.  It's so important in songwriting, to get the lyrics right.  A strong song needs strong lyrics.  How many hit songs do you know of that don't have lyrics?</p>\n\n<p>First, you'll learn how to get creative even when you're not really inspired.  I'll show you how you can use all of your senses and the world around you to spark your creativity and jumpstart your songwriting anytime!</p>\n\n<p>Next, you'll learn how to control the emotional impact that your listener is having through toggling - moving between details and sometimes pulling back for a broader picture.  You will learn how to intensify or diminish the experience of the listener with sound lyrical techniques.</p>\n\n<p>We'll also examine the different types of rhyme.  You'll learn the various ways to effectively use rhyme in your songwriting.  We'll also discuss tense and power positions...and a whole lot more.</p>\n\n<p><br></p>\n\n<p><strong>By the End of the Course You Will Be Able To:</strong></p>\n\n<ul><li>write lyrics that control the emotions of your audience</li><li>write lyrics that effectively communicate the message of the song</li><li>combine lyrics with music more effectively</li><li>generate better ideas more easily</li><li>create detailed and emotional lines that tell a story</li></ul>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>\n\n<p><br></p>", 
    "end_date": null, 
    "title": "Hit Songwriting: Learn to Write Lyrics! Be a Songwriting Pro", 
    "price": "45.00", 
    "instructors": "Pippin Jag", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/675050_be62_4.jpg", 
    "course_url": "https://www.udemy.com/hit-songwriting-learn-to-write-lyrics-be-a-songwriting-pro/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-11-19T22:18:13Z"
}