{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Learn how professional songwriters combine melody, harmony, and lyrics into hit songs!  Don't put your songwriting career off any longer!  <strong>Enroll Now!  </strong><em>Course Updated April 16, 2016</em></p>\n\n<p>Over <strong>8</strong><strong>00 students</strong> enrolled!</p>\n\n<p><strong>Develop the Songwriting Skills Needed to Produce Hits and to Make Money in the Music Industry.</strong><br></p>\n\n<ul><li>Learn to create memorable verses, choruses, and bridges</li><li>Learn to generate better ideas more quickly</li><li>Learn to craft song sections that connect, contrast, and flow together</li><li>Understand the structures behind the hits</li></ul>\n\n<p><strong><br></strong></p>\n\n<p><strong>Content and Overview</strong><br></p>\n\n<p>This songwriting course is unique, because in it, you'll learn the exact methods that professional songwriters use to create hit songs.  Whether you're someone with  budding skills or a mature songwriter, you'll understand how to express yourself better through words and music. </p>\n\n<p>Combining technical principles with pure creative expression, this course will help you find your voice, create songs listeners will remember, and ultimately assist you in your efforts to make money as a songwriter!</p>\n\n<p>First, you'll learn about one of the most common song forms in popular music - the verse/chorus song form.  You'll learn what it is that makes a great chorus.  The chorus is everything in songwriting!</p>\n\n<p>Then we'll explore other popular song forms like the AABA form and forms that use pre choruses.  You'll learn how to use structures, harmonies, and melodies to support and enhance the emotional intent of your lyric.</p>\n\n<p><br></p>\n\n<p><strong>By the End of the Course You Will Be Able To:</strong></p>\n\n<ul><li>write commercial songs that are more qualified to produce income</li><li>create memorable verses, prechoruses, choruses, and bridges</li><li>choose the most effective song form for every song you write</li><li>understand the structures behind the hits</li><li>generate better ideas more easily</li><li>use structures, harmonies, and melodies to support and enhance the emotional intent of your lyric</li><li>craft song sections that connect, contrast, and flow together into a unified whole</li></ul>", 
    "end_date": null, 
    "title": "Hit Songwriting: Learn to Write! Enjoy a Songwriting Career!", 
    "price": "50.00", 
    "instructors": "Pippin Jag", 
    "commitment": "3 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/574862_cd3b_18.jpg", 
    "course_url": "https://www.udemy.com/songwriting-hit-songwriting/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-08-05T18:32:48Z"
}