{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>In this course you will develop the skill set to freestyle rap in various styles without running out of bars, even if you have never rapped before. This is a bold promise, but like anything else, freestyle rhyming can be broken down into a few simple steps. I will explain the three components to rapping, then we will talk more about freestyle-specific skills. </p>\n\n<p>\n\n\n1. <strong>Rhythm</strong>: You will learn to catch any beat by tapping out the quarter notes, then create a simple percussion rhythm which you will then put words to.</p>\n\n<p>2. <strong class=\"redactor-inline-converted\">Lyrics</strong>: We will talk about polysyllabic rhyming, wordage (word choice).</p>\n\n\n\n\n\n\n\n\n\n\n\n<p>3. <strong class=\"redactor-inline-converted\">Delivery</strong>: In this lesson you will play around with your voice to see what it can do, and take a good look at how to hone your flow.</p>\n\n<p> After we cover the three fundamentals of freestyle rap, I will help you to develop multiple flows and improve your delivery, teach you tricks to come up with rhymes and always have subjects to rhyme about in cyphers. \n\n\n\nWe will cover: Cypher Etiquette, how to Never Run Out of Bars, Tools to Get Going, Finding Beats, Switching Flows, Entering a Flow State, and more. </p>\n\n\n\n\n\n\n\n\n\n\n\n<p>Relax, get into the vibe, and come with me on this journey through the components of freestyle rap. </p>", 
    "end_date": null, 
    "title": "How to Freestyle Rap: Rhythm, Lyrics, Delivery", 
    "price": "40.00", 
    "instructors": "Douglas Butner", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/825570_10e4_7.jpg", 
    "course_url": "https://www.udemy.com/how-to-freestyle-rap-rhythm-lyrics-delivery/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-04-19T01:49:00Z"
}