{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Pas de musique sans solfège !</strong></p>\n\n<p>Ce programme ravira tous ceux qui veulent passer très vite à la pratique d'un instrument et au plaisir de faire de la musique en bénéficiant d'une excellente formation musicale. D'une extrême simplicité, il rend en un temps record le langage musical accessible à tous sans exception, enfants comme adultes.</p>\n\n\n\n<p>La formation complète comprend 20 leçons, 75 cours et plus de 8 heures de vidéo ! Elle est présentée en 3 niveaux progressifs afin de vous permettre de choisir le niveau qui vous convient le mieux. Les 3 niveaux figurent sur Udemy ainsi que la méthode complète, cette dernière à un prix très avantageux.</p>\n\n\n\n<p>Chaque leçon traite d'un sujet spécifique qui contient un certain nombre de cours. </p>\n\n\n\n<p><strong>Niveau I \"Je débute\" : 6 leçons  (20 cours).</strong> Pour débutants/ ou si vous n’avez jamais fait de solfège/ou si vous en avez seulement gardé quelques vagues notions.</p>\n\n\n\n<p><strong>Niveau II \"Je progresse\" : 7 leçons (25 cours).</strong> Nécessite d’avoir assimilé les premiers rudiments du solfège et de savoir bien lire ses notes, de préférence dans les 2 clés principales. </p>\n\n\n\n<p><strong>Niveau III \"Je maîtrise\" 7 leçons (30 cours).</strong> Requiert un bon niveau de connaissance en particulier en lecture de notes et en lecture de rythmes. </p>\n\n\n\n<p>A la fin de chaque niveau un quizz vous permettra d'évaluer vos progrès et de savoir si vous pouvez sans problème passer au niveau suivant. </p>\n\n\n\n<p>A l'issue du 3ème niveau vous saurez votre solfège et ce sera pour la vie ! </p>\n\n\n\n<p><strong>Niveau III \"Je maîtrise\"</strong></p>\n\n\n\n<p>Le niveau III est approprié si vous avez terminé avec succès les niveaux précédents et/ou avez déjà de bonnes bases en solfège, en particulier en ce qui concerne  les notes et le rythme. Il vous permettra d’acquérir les dernières connaissances indispensables à une bonne formation musicale ainsi que des notions plus spécifiques d’écriture et de construction. Si vous voulez écrire votre propre musique ce niveau vous aidera à mettre le pied à l’étrier ! </p>\n\n\n\n<p>Vous trouverez les détails qui figurent dans ce niveau dans le résumé des cours.</p>\n\n\n\n<p>Vos cours sont présentés en vidéo sous forme de « fiches pédagogiques » agréables et faciles, la plupart avec coaching audio, et comportent un grand nombre d’exemples. Des exercices, des « devinettes » et des lectures guidées complètent la partie théorique. Un petit résumé est disponible à la fin de chaque leçon, ce qui la rend très facile à garder en mémoire. </p>\n\n\n\n<p><strong>Combien de temps devrai-je consacrer à mon apprentissage ?</strong></p>\n\n\n\n<p>Je vous recommande de consacrer environ 20/25 minutes par jour à votre apprentissage - un peu plus ou un peu moins suivant les leçons. </p>\n\n\n\n<p>Peu d’efforts de votre part sont requis : comme toujours il est important de vous laisser guider en me faisant confiance et en faisant confiance à ma pédagogie. Sa vocation est de vous soutenir en vous aidant à franchir facilement le cap indispensable du solfège tout en gardant et même en renforçant votre motivation. Je vais vous guider pas à pas et vous verrez comment il est possible de faire rimer « qualité » avec « facilité » et « rapidité ». Un peu de régularité et d’attention, ne pas sauter de leçons et bien les suivre dans l’ordre, faire les exercices demandés... tout cela fera merveille !</p>\n\n\n\n<p><strong> </strong></p>\n\n\n\n<p><strong> </strong></p>\n\n\n\n<p><strong>En savoir plus</strong></p>\n\n\n\n<p>Les 20 leçons de cette formation sont conçues pour que vous puissiez en étudier une par jour pendant 20 jours, mais ce n’est pas à un jour près car chacun avance à son propre rythme qu’il est important de respecter. Sachez cependant que si vous avez envie de relever ce challenge, vous pourrez avoir fini vos 3 niveaux en 20 jours – et même beaucoup plus vite si vous commencez votre formation au niveau III - grâce à ce programme !  </p>\n\n\n\n<p>Ne forcez jamais : dès que vous sentez que votre attention baisse, arrêtez-vous. Avancez à votre rythme et suivant vos possibilités. Certains d'entre vous ont déjà quelques notions musicales, d'autres ont besoin de renforcer leurs acquis. Certains sont des enfants, d'autres des adultes. Certains iront vite, d'autres plus lentement. Certains pourront y consacrer du temps, d'autres auront peu de disponibilités : comprenez que même si cela vous prend 2 mois au lieu de 20 jours cela reste extrêmement rapide comparé à ce qui se fait habituellement (souvent 8 ans dans un conservatoire ! Et il n'est pas rare de voir des élèves passer des années à acquérir les premières bases du solfège !).</p>\n\n\n\n<p><strong>Une grande professionnelle de musique classique vous guide et vous assiste intégralement dans votre formation musicale : une occasion rare !</strong></p>\n\n\n\n<p>En tant que musicienne et pédagogue professionnelle j'ai eu la volonté de créer une formation musicale accélérée qui rende le solfège simple et abordable sans pour autant sacrifier la qualité, car il n'est pas question ici de faire de « l'à peu près ». </p>\n\n\n\n<p>En effet vous devez  obtenir une bonne formation musicale sans vous encombrer de données inutiles qui ne serviront jamais à rien. Ce programme a été conçu dans cet esprit : bien loin des manuels compliqués et rébarbatifs habituels, il contient tout ce qu'il faut connaître en solfège pour être libre musicalement, sans rien d'abstrait ni d'inutile. Sa présentation simple et claire le rend agréable à lire et très facile à apprendre. Fini le solfège ingrat et vieillot aux exercices interminables ! </p>\n\n\n\n<p><strong>Est-il possible d'apprendre le solfège rapidement ?</strong></p>\n\n\n\n<p>Bien sûr ! C'est même assez facile J C'est essentiellement une question de pédagogie : contrairement à une idée reçue, il n'y a aucune raison de passer des années à apprendre le solfège car la véritable formation musicale vient de la pratique de la musique elle-même et non de la théorie. Par contre une bonne connaissance du solfège vous aidera énormément à progresser.</p>\n\n\n\n<p><strong>Musiciens, le solfège est une des clés de votre succès !</strong></p>\n\n\n\n<p>Cette formation musicale va vous permettre de progresser musicalement sans limite. Vous  constaterez qu'il n'est pas bien difficile d'apprendre le langage musical et vous avancerez tout à coup à pas de géant, comme si vous aviez chaussé des bottes de 7 lieux !</p>\n\n\n\n<p><strong>Le solfège est-il vraiment indispensable pour faire de la musique ?</strong></p>\n\n\n\n<p>Oui, je le confirme, le solfège est indispensable pour vous développer musicalement, tous les musiciens sérieux vous le diront. Pour faire de la musique vous avez intérêt à connaître le solfège qui est le point de référence de tous les musiciens. De plus, sans solfège, vous vous apercevrez bien vite que vous êtes considérablement  limité dans votre expression, ce qui est le contraire du but recherché dans une pratique artistique. Aucun danger que cela vous arrive avec cette formation !</p>\n\n\n\n<p><strong>Il y a pourtant des musiciens célèbres qui n’ont jamais fait de solfège…</strong></p>\n\n\n\n<p>C’est vrai, mais ce sont des exceptions qui confirment la règle et non des exemples. D’ailleurs presque tous le regrettent et reconnaissent qu'avec le solfège ils auraient pu aller encore plus loin en musique. Il n’est pas rare de voir des musiciens confirmés se mettre au solfège sur le tard pour combler leurs lacunes.</p>\n\n\n\n<p><strong>Pourrai-je composer et écrire ma propre musique après avoir fini cette formation ?</strong></p>\n\n\n\n<p>Le solfège est le premier palier qui va vous ouvrir les portes de la composition et le plus important, puisque c’est de lui que découle tout le reste. Il vous faudra sans doute aller plus loin et acquérir ensuite quelques notions d’harmonie (science des accords, rapport des sons entre eux, enchaînements etc.) ce qui du reste ne vous sera possible qu’en ayant déjà une bonne connaissance du solfège.</p>\n\n\n\n<p><strong>Est-ce que cette formation va me servir même si je ne fais pas de musique classique ?</strong></p>\n\n\n\n<p>Cette formation est adaptée à tous les styles de musique, autant - sinon plus – aux musiciens non classiques, car le solfège est universel, c’est la langue de toute musique dite « construite ».  Jamais comme à notre époque il n'y a eu autant de musique, de tous les styles, pour tous les goûts, du soir au matin le monde entier « baigne » littéralement dans la musique, c’est réjouissant ! Mon vœu est que tout le monde apprenne le langage musical comme on apprend à lire et à écrire afin de se donner la possibilité de faire de la musique un jour !</p>", 
    "end_date": null, 
    "title": "Le solfège facile et complet en 8 heures - Niveau III", 
    "price": "35.00", 
    "instructors": "Myriam Birger", 
    "commitment": "3.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/781120_e186_2.jpg", 
    "course_url": "https://www.udemy.com/le-solfege-facile-et-complet-en-8-heures-niveau-iii/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "Others"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-03-03T13:35:28Z"
}