{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>Learn Piano with Rosa -</strong><strong> </strong><strong>Rosa</strong><strong>'s Piano Online School\n-  Teaching 32 Courses!</strong></p><p><strong>OVER 10,000  </strong><span></span>Successful students\nhave already taken my piano online courses since  July\n2014 with  <strong>231 - 5 Star Reviews</strong></p><p><strong>Course Updated: </strong>November 15, 2015</p><p>----------------------------------------------------------------------------------------------------------<br></p>  <p>  \t                                              You can start playing <em>beautiful </em>music today using this <strong>Piano </strong><strong>Ballad Left Hand Nostalgic 10 with guided videos,</strong> just like having a teacher sitting right next to you.  </p>  <p>  \t                                  A student pays me $100 for 1/2 hour lesson, and now you are getting a super deal for 2+ hours lessons.  You always get life time access to my videos, a dream come true for all passionate piano students. <strong>Extra bonus service </strong><strong>for <em>each</em> student:</strong> a personal one-on-one feedback &amp; evaluation when you send me a recording of your playing in the course. This is a real experience of a live piano teacher beside you to take your piano playing to the next level!  </p>  <p><strong>Here's the Secret: </strong>Many professional musicians use this <strong>Piano Nosalgic 10</strong> technique in their performance.  They don't tell you.  This is why you need to take this course. I am telling you all the inside secrets of what we use - and they are unbelievably simple. <em>You do not need to go through years and years of piano lessons to play like a pro!</em></p>  <p>  \t                              My video lectures will show you the secrets and piano tips of using finger cross over to make that beautiful nostalgic sound that people love to listen to!  </p>  <p>  \t                              You are going to able to learn how to coordinate both right hand and left hand easily to play a song in the flow in C Key and F Key.  </p>  <p>  \t                                              *****************************************************************************  </p>  <p>  \t<strong>The Piano Lesson </strong>\"<em>Left Hand Piano Technique: Nostaligic 10th</em>\"  trains all pianists to learn to play the Nostalgic 10th into the song \"I've Got Peace Like A River\" in Key of C and Key of F.  </p>  <p>  \t<strong>  Day by day piano lessons</strong> are provided for 60 days so that you can focus on your practice everyday with a 1 to 2 minute video demonstration.  </p>  <p>  \t<strong>  Once you are able to play a song thoroughly in the Key of C</strong>, you can learn to play the song in another key.  This is to help students not to restrict their piano playing in the Key of C.  The problems with many students is that they get stuck in only the Key of C.  </p>  <p>  \t                                                      I show you a step by step process to play the song in Key of F<strong> EFFORTLESSLY.</strong>  You just need to have the piano tip to know what to concentrate so that you can practice very quickly and at ease.  </p>  <p>  \t<strong>The piano videos</strong>  are there to help you experience the 'quickness' of the hands, ie. to play the Nostalgic 10th with ease and in a flowing manner.  Once you understand the music theory and how to train your finger muscle memory in my guided piano lessons, you will 'drift into the flow' of piano playing that sounds professional in a very quick time.  </p>  <p>  \t<strong>   In the next 2 months</strong>, you will be able to learn the <strong>7 Easy Steps</strong> to playing Left Hand Nostalgic 10 in a flowing manner using my piano method.  </p>    <p>  \t<strong>The piano lessons are structured in the following way:</strong>  </p>  <ul>  \t<li>You learn the LH pattern of Nostalgic 10th to Chords C, F, G, D in C Key.</li>  </ul>  <ul>  \t<li>You learn the LH pattern of Nostalgic 10th to Chords F, Bb, C7, G7 in F Key.</li>  </ul>  <ul>  \t<li>In the beginning stage, I show you how to play I've Got Peace Like A River with music score sheet.  LH &amp; RH coordination.</li>  </ul>  <ul>  \t<li>Then you learn the Rhythm of Left Hand Nostalgic 10th to see how the 'counting' fits into the bar when you play a Nostalgic 10th chord.  LH &amp; RH coordination.</li>  </ul>  <ul>  \t<li>You learn to play the song following music score. </li>  </ul>  <ul>  \t<li>You learn to play the song using chords and rhythm.</li>  </ul>  <ul>  \t<li>Finally you get to the stage of playing the song by ear paying attention to the chord progression sounds.</li>  </ul>    <p>  \t<strong> As a Bonus</strong>:  You also learn how to end a song properly by using the <strong>Amen Chord Ending </strong>in the Key of C and in the Key of F.  </p>  <p>  \t                                        Join my students and <strong>Enroll i</strong>n my course today,  </p>  <p>  \t                                                    Rosa  </p><p>***************************************************************************</p><p><strong>About Rosa's Piano Online Course:</strong></p><p>    <em></em></p><ul><li><em>Over </em><strong><em>10,000</em></strong><em> </em><em>very happy students already in my classes</em></li><li><em>See the </em><strong><em>5 Star Reviews</em></strong><em> from VERY satisfied students</em></li><li><em>You get free lifetime access</em></li><li><em>All videos are at your finger tips to watch anytime &amp; anywhere</em></li><li><em>All future extra lectures and upgrades are </em><strong><em>always free</em></strong></li><li><em>Unconditional  </em><strong><em>30 day money-back guarantee</em></strong><em> and that's my personal promise to your success!</em></li><li><em>Join this happy family of students </em></li><li><strong><em>Enroll into this course</em></strong></li></ul>", 
    "end_date": null, 
    "title": "Learn Fun Piano Tips #2 - Play LH Ballad Piano in C & F Keys", 
    "price": "20.00", 
    "instructors": "Rosa Suen", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/249466_594d_7.jpg", 
    "course_url": "https://www.udemy.com/learn-to-play-piano-left-hand-nostalgic-10th-in-5-easy-steps/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-24T15:30:07Z"
}