{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Would you like to create meaningful songs about the things that really matter to you?    </p>\n\n\n\n<p>Did you know that you have a unique voice and perspective and that the world needs the songs that only you can write?\n\n  </p>\n\n\n\n\n\n<p>In this course, you will learn how to identify what is meaningful and important to you and put it into a song.</p>\n\n\n\n\n\n<p>There is a lot of information out there that emphasizes commercial songwriting, which is about writing a hit song. While it can be important and valuable to learn these skills, this course takes a different approach and teaches you how to develop and express your own voice. Whether your goal is personal or commercial songwriting, this will only help you grow stronger as a songwriter.\n\n  </p>\n\n\n\n\n\n<p>This course includes a number of exercises to help you determine the things that are meaningful to you so that you can generate a master list of meaningful song ideas. You’ll learn the Six Brainstorming Techniques to help access these ideas.\n\n  </p>\n\n\n\n\n\n<p>Please note that this is not a course that focuses on the fundamentals of how to write a song. While we’ll briefly look at song structure and the parts of the song, the emphasis will be on how to create and maintain meaning throughout the songwriting process.\n\n  </p>\n\n\n\n\n\n<p>There will be a number of songwriting resources if you are interested in furthering your study of songwriting.\n\n  </p>\n\n\n\n\n\n<p>You’ll also have the opportunity to share the meaningful song that you write in this course with the group.\n\n  </p><p>There will be examples of songs sprinkled throughout the course that help demonstrate how to express meaning through song.</p>\n\n\n\n\n\n<p>Mostly, you will learn that by expressing your story and original voice, you have the power to change the world, one song at a time,\n\n  </p>\n\n\n\n\n\n<p>Come and join us for Meaningful Songwriting! \n\n  </p>\n\n\n\n\n\n<p><strong><u>How to sign up:</u></strong>\n\n  </p>\n\n\n\n<p><strong>Simply click the green “Take this course” button on the top right-hand side of this page to start learning how to write meaningful songs.</strong>\n\n  </p>\n\n\n\n\n\n<p><strong><u>Other benefits:</u></strong>\n\n  </p>\n\n\n\n<p>This course is available <strong>on-demand </strong>– which means you can access it anytime.\n\n  </p>\n\n\n\n<p>This course is <strong>100% refundable</strong> for the first thirty days if for some reason you are not satisfied (and please let me know if you aren't - I am always open to feedback.)\n\n  </p>\n\n\n\n<p>You will have the opportunity to <strong>ask the instructor questions</strong> – either within the group or through a message.</p>", 
    "end_date": null, 
    "title": "Meaningful Songwriting: Write Songs That Matter To You", 
    "price": "20.00", 
    "instructors": "Lauren Lapointe", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/847652_9a53.jpg", 
    "course_url": "https://www.udemy.com/meaningful-songwriting/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-05-13T01:32:16Z"
}