{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t      Do you think it&#039;s possible to have a Piano Zen experience while practicing? Believe me, it can happen!  </p>  <p style=\"\">  \t      I realized 12 years ago that a slower, more mindful approach to  practicing the piano was not only a more effective, quicker way to learn  but also a more natural and musical way  as well.  </p>  <p style=\"\">  \t      Most people that try to learn the piano bring a lot of tension and  anxiety to the process.  However, it doesn&#039;t have to be that way.  In  fact, practicing the piano can be a wonderful, relaxing, and deeply  expressive experience. And, you&#039;ll find that is easier than you ever imagined!  </p>  <p style=\"\">  \t      The Stillpoint approach combines relaxing and mindful contemplative techniques to make learning the piano a calm, pleasant, stress-free  experience.  </p>  <p style=\"\">  \t      Stillpoint techniques help you to slow down the way you learn so that you can find a balance between mind and body.  </p>  <p style=\"\">  \t      If you have an interest or experience in Eastern disciplines like tai  chi, yoga, qi gong, or Zen meditation, you will find the Stillpoint techniques very familiar and engaging.  </p>  <p style=\"\">  \t However, you don&#039;t have to be a tai chi or yoga enthusiast to get benefits from the course.  You may just be interested in a musical activity that provides a little relief from the tension and stress of your busy day!  </p>  <p style=\"\">  \t      When you take a Stillpoint lesson, it is like having a Stillpoint instructor right there with you guiding every step of your piano lesson. All of the guess work about how to practice the piano is gone.  </p>  <p style=\"\">  \t      This program will encourage you to embrace mindfulness at the piano to unlock your true, unlimited musical  potential.  </p>  <p style=\"\">  \t Sign up today and let&#039;s get started together!  </p>", 
    "end_date": null, 
    "title": "Piano Zen: Experience Your True, Unlimited Musical Potential", 
    "price": "45.00", 
    "instructors": "Thomas Rheingans", 
    "commitment": "36 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/247390_e361_4.jpg", 
    "course_url": "https://www.udemy.com/piano-zen-relaxing-meditative-piano-lessons-for-beginners/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-06-20T21:50:57Z"
}