{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \tThis course will teach how to play scales in all keys all over the fretboard, and will focus on developing good technique so you can improve your playing. This course is more of a technical, practical kind of course, so I don&#039;t go into the theory of how scales are built (although you can always message me to ask any theory-related questions, I&#039;m always happy to talk about all that stuff with anyone who&#039;s interested.    Playing scales is the single best thing you can do to improve your technique and your over-all guitar playing. If you only do one kind of technical exercise as part of your practicing routine, make it scales (whether or not you enroll in this course)    We&#039;ll start by looking at some scale shapes that will get you playing all over the fretboard, then we&#039;ll look at left-hand technique, followed by right-hand technique. I think the most important section is the one on practicing strategies, this will help you make scale playing interesting (which makes it more likely that you&#039;ll actually stick with it).  hand  As always, the course is laid out so that you can follow the lectures in order and it should make sense and have a logical progression, but you can skip around if you like and work on a topic that&#039;s of particular interest to you.    The course is mostly made up of video lectures showing my hands from a variety of angles, and there are PDF files with the musical examples written out in guitar tablature (no note-reading is required).  </p>", 
    "end_date": null, 
    "title": "Playing Scales for Classical and Finger-Style Guitar", 
    "price": "20.00", 
    "instructors": "Brian Riggs", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/388874_301f_3.jpg", 
    "course_url": "https://www.udemy.com/guitar-scales/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-08T20:21:00Z"
}