{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>  \t<strong class=\"redactor-inline-converted\">\"I just learned in 2.5 hours what I have been shying away from for 15 years.\"</strong> - Aleister  </p>\n\n<p><strong>\"Don't even think about any other course, this is the one. I would gladly give more stars if available.\"</strong> - Adam Robson</p>\n\n<p><strong class=\"redactor-inline-converted\">\"WOW! The instructor's method and exercises meant I was nailing five octaves of note reading in just a day! ... Excellent production quality, excellent graphics, clear explanation. ... I'd give it ten stars if I could.\"</strong> - Mark S A Smith<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"After the course, I can assure you that you will not be seeing a music sheet the same way again.\"</strong> - Kathleen Rosario</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"I really can't say enough good things about this class.\"</strong> - Jim Thomason<br></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"Incredible.\"</strong> - Dadang Setiawan</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"... can't believe how easy that was!</strong><strong class=\"redactor-inline-converted\">\"</strong> - Bryan</p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">\"He makes it stupid easy\"</strong> - Alex Kilker  </p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"His technique works!</strong><strong class=\"redactor-inline-converted\">\"</strong> - Jason Cooksey</p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">\"10/10 would recommend to a friend.\"</strong> - Sheila Vega<br></p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">\"Helpful even for non beginners\"</strong> - Nikola  </p>\n\n\n\n<p>  \t                  Sight reading is one of the hardest aspects of learning to play the piano, and it's universally badly taught. This course uses a unique method to teach you how to read any note on the piano keyboard quickly and easily, so that you can then tackle any piano course with confidence. It will also help if you've already started learning piano but are struggling to read the notes (e.g in the bass clef).  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">5 problems with the traditional method</strong>  </p>\n\n\n\n<p>  \t                  Traditionally, students have been taught mnemonics to remember what note falls on every single line and space of the 2 clefs, e.g. \"Every Good Boys Deserves Favour\" for the lines of the treble clef (E, G, B, D, F). This has several problems:  </p>\n\n\n\n<ol>  \t<li><strong class=\"redactor-inline-converted\">It's a lot to remember</strong>. You have to memorise 4 phrases (\"Every Good Boy Deserves Favour\", \"F-A-C-E\", \"Good Boys Deserve Favour Always\", and \"All Cows Eat Grass\"), and then remember when to apply them, which doesn't follow any logical pattern.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It's slow</strong>, because you have to recite a phrase every time you want to play a note.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It's language-based rather than visual</strong>, and yet sight reading is a visual skill! It makes you translate every note on the page into a note name and then translate that note name into a note on the piano, but there are no note names on the page and no note names on the piano so you should just be able to see a note and then play it.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It doesn't tell you which note to play</strong>, it just tells you its note name. For example, \"Good Boys Deserve Favour Always\" might tell you that the note you're looking at is an F, but it doesn't tell you which F it is, and there are 8 on the piano!</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It doesn't even teach you all of the notes you're likely to play.</strong> What about Middle C, or D, or B, which are all in between the clefs? What if you go above the top of the treble clef, or below the bottom of the bass clef (both of which are really common)? The mnemonics won't help you.</li>  </ol>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">5 reasons why my method is better</strong>  </p>\n\n\n\n<ol>  \t<li><strong class=\"redactor-inline-converted\">There's less to remember.</strong> You'll just learn where the signs for the treble and bass clef came from, and how that helps you recognise the notes.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It's faster.</strong> By the end of the course you'll be able to see a note and just play it, without reciting anything.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It's visual.</strong> I use pictures and colour-coding to help you recognise notes.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It's specific</strong>. My method not only tells you that you should be playing, e.g., and F, it also tells you which F to play. However, most of the time you won't even be conscious of the name of the note you're playing, you'll just play it.</li>  \t<br>  \t<li><strong class=\"redactor-inline-converted\">It covers 211% more notes.</strong> It teaches you how to read 32 white notes quickly and easily, whereas the traditional method only teaches you how to read 18 slowly. Plus I'll also teach you and test you on the black notes, which comprise another 24 notes, a total of 211% more (14 white + 24 black notes).</li>  </ol>\n\n\n\n<p>  \t                  This course will not only save you a ton of time, it'll also make you feel better about an area of music that a lot of people feel that they're \"bad\" at because they've been badly taught. (That's not the teachers' fault, it's just that no-one's come up with a really good method of teaching sight reading before.) And if you're not convinced you can always take advantage of Udemy's 30-day no-questions-asked money back guarantee.  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">So how does it work?</strong>  </p>\n\n\n\n<p>  \t                  I'll teach you 9 \"reference\" notes in a visual and intuitive way, using HD videos with an overhead shot of my piano and lots of graphics. After each video I'll then test you on what you've just learned using interactive tests specially made for this course, which intelligently keep track of which notes you're finding difficult so that they can test you on those more. (I've also thrown in a mini-course on the best way to learn the note names, in case you're a complete beginner and don't know them yet!)  </p>\n\n\n\n<p>  \t                  All of these techniques have been developed over the course of 10 years of teaching, and have been tried and tested them on hundreds of students. One of them said that my sight reading method was \"so easy a monkey could learn it\". I teach freelance and charge one lesson at a time, so my teaching methods <em>have</em> to be good otherwise I wouldn't be able to make a living teaching (and I do make a living teaching).  </p>\n\n\n\n<p>  \t                  Whenever students have asked to recommend any good beginner resources, whether online or in book form, I've always been stuck because I've never found anything really good, despite looking, so I'm happy to finally be putting this online. Students have been pestering me for years to publish my teaching methods but this is the first time I've done so. If it proves popular I'll add more courses!  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">What this course isn't</strong>  </p>\n\n\n\n<p>  \t                  This is a note-reading course rather than a complete sight reading course - it's designed to kickstart your sight reading rather than teach you how to sight read complete pieces of music. So, for that reason:  </p>\n\n\n\n<ul>  \t<li>it doesn't teach you about rhythm,</li>  \t<li>it doesn't teach you about key signatures, and</li>  \t<li>it doesn't get you to sight read any complete pieces of music.</li>  </ul>\n\n\n\n<p>  \t                  Each of those things would require entire courses by themselves, which maybe I'll add if there's enough demand!  </p>\n\n\n\n<p>  \t                  This course just does one thing and it does it really well: it teaches you how to read individual notes on the piano keyboard. However, no matter what piano course you follow, whether it's online, or from a book, or with a teacher, this course will help you with your sight reading.  </p>\n\n\n\n<p>  \t                  One other thing: this course has been designed for and tested on people who are learning the piano or keyboard, not other instruments. It'll probably help if you're learning a non-keyboard instrument, just bear in mind that it wasn't made for you! If you are learning another instrument you can always try the course out and get a refund if it doesn't help.  </p>\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">In conclusion</strong>  </p>\n\n\n\n<p>  \t                  I really think my method is the best way to learn how to read the notes on the piano keyboard, and I'd love to see this become the new standard way of teaching it, so if you do try my course and find it useful please spread the word! If you don't like you can always get a no-questions-asked full refund within 30 days.  </p>\n\n\n\n<p>  \t                  Best of luck on your musical journey!  </p>\n\n\n\n<p>  \t                  Benedict  </p>", 
    "end_date": null, 
    "title": "Read Music FAST!", 
    "price": "20.00", 
    "instructors": "Benedict Westenra", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/355662_2977_14.jpg", 
    "course_url": "https://www.udemy.com/sight-reading/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-11-24T22:03:52Z"
}