{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">  \t              SAX FROM SCRATCH has created saxophone lessons for those who have always dreamed of being a sax player on YouTube or in a band, but didn&#039;t know where to start. This is also the perfect place to grow into a performance ready sax player learning edgy sax techniques and being immediately set apart from other sax players.  </p>  <p style=\"\">  \t    Individual students have paid me thousands of dollars in private lessons for what you are about to learn right here! You&#039;ll get approximately 40 lessons, easy to understand videos on all levels of instruction (beginner, intermediate, and advanced), pictures, charts, supplemental documents, music theory integration, MP3&#039;s for improvising, and I&#039;ll be available to help you through the course.  This course is not to be rushed.  Although the course can be completed in a couple of hours, each lessons encourages practicing to master each technique.  </p>  <p style=\"\">  \t    Some of the techniques you are encouraged to learn are the <strong style=\"\">grow</strong>l, playing super high <strong style=\"\">altissimo notes</strong>, <strong style=\"\">circular breathing</strong>, <strong style=\"\">stutter tonguing</strong>, and playing <strong style=\"\">jazz articulation</strong>.  </p>  <p style=\"\">  \t    So start from scratch, work through the basics, learn a bit of theory, master some advanced techniques, improvise on your favorite songs, and get yourself sounding and looking like a saxophone PRO in no time!  </p>  <p>  \t    &lt;/p&gt;  </p>", 
    "end_date": null, 
    "title": "Sax From Scratch: YouTube and Stage Performing", 
    "price": "20.00", 
    "instructors": "John Peterson", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/408562_9605_3.jpg", 
    "course_url": "https://www.udemy.com/sax-from-scratch-youtube-and-stage-performing/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-01-31T00:34:03Z"
}