{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>As a musician, I learned how to create websites out of pure necessity. I am not a professional programmer - <em>I learned through trial and error and studying on my own what works and what doesn't work</em>. I've now written hundreds of websites for artists, musicians, bands, galleries, and other organizations.</p><p>In 2009 I created this class, \"Web Design for Artists\" as a class I teacher in-person around my area. The class has been very successful, and I'm really excited to bring it to an online platform. My goal with this class is simple: I want all musicians to have a website, be able to manage their website, and to never, ever, have to pay someone to do it for them.</p><p>This is a hands-on class: I am going to make a website for myself during this class, and walk you through every step. Nearly every video is a \"walk through\" on how to do something. And because I'm not a technical web designer, we won't get bogged down with any abstract terminology - only what we need. Lets dive in!</p><p><em>Dr. Jason Allen is an Ableton Certified Trainer, and a PhD in Music Composition and master of Electronic Sounds. His music has been heard internationally in film, radio, video games, and industrial sound, as well as the concert hall and theater. His 2015 album, </em>Aniscorcia, <em>reaching the CMJ Top200 Charts and radio broadcasts nationwide. In 2014 he was named a semi-finalist for the Grammy Music Educator Award.</em></p><p><em>He currently as an adjunct professor of composition at the University of St. Thomas, and the CEO of Slam Academy in Minneapolis.</em></p><p><em><strong>Praise for classes by Dr. Jason Allen:</strong></em></p><ul><li><em>\"Without a doubt the best explanation and east of use that one can get. It leaves you enough room to go explore. The classes go by quick, so you can be on your way at being proficient. What are you wait for!\"<br><br></em></li><li><em>\"Amazing - Seriously Loved It! I took all his courses and have to say I'm so happy! Learnt loads! Jason is an awesome teacher!\"<br><br></em></li><li><em>\"I have never had any formal training in music at all. Trying to learn all the notes and how everything translated was a serious challenge. After going through this class, Dr. J has totally brought down the barriers. The content was very useful and was easy to grasp for me.\"<br><br></em></li><li><em>\"I like these courses because you can get up and running quickly without having to spend hours of time wading through TMI (too much information!). Jason hits the high points but shows you what you need to know. Thanks!\"<br><br></em></li><li><em>\"I've watched many other videos on scales and chords before, however, this one has been the best. I now understand minor scales and chords and even how to analyze songs. It really gave me the confidence to start producing music because I feel like I have some structure and guidelines to follow. AWESOME!\"<br><br></em></li><li><em>\"Clear and Informative - Jason has a clear uncluttered style (with the important dashes of humor) of presentation that is focused on the important key aspects of this course. Recommended for those starting out!\"<br><br></em></li><li><em>\"Dr. Allen does it again with his music theory series. This course really opened up everything I learned from the 1st section, and now I understand more about the composition side of things for music. I highly highly recommend this course to anyone!!! Really opened my eyes to many things I wasn't aware of.\"<br><br></em></li><li><em>\"The Best Teacher Ever, who makes you understand the ins &amp; outs of Music Theory by all means without giving what you don't want to know.\"</em></li></ul>", 
    "end_date": null, 
    "title": "Selling Your Music Online - Intro Class", 
    "price": "20.00", 
    "instructors": "Jason Allen", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/744074_87a8.jpg", 
    "course_url": "https://www.udemy.com/selling-your-music-online-intro-class/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-27T20:47:50Z"
}