{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p style=\"\">Welcome to my Ultimate Acoustic Blues course. </p><p style=\"\">Do you love playing guitar and love the Blues, but haven&#039;t been able to get your playing to the next level? Or maybe your stuck playing the same old things over and over….</p><p style=\"\">I&#039;m going to show you the secret to master the Blues and I&#039;ll do it in a way that&#039;s EASY and FUN!!!</p><p style=\"\">With my course you&#039;ll learn turnarounds, killer licks, passing chords , how to play with soul &amp; passion- and how to play from the heart. That&#039;s what the Blues is all about!</p><p style=\"\">Ive included 7 easy to follow 20+ minute lessons covering very aspect of Acoustic Blues. </p><p style=\"\">Are you ready to rip like Eric Clapton or get down and gritty like Taj Mahal? </p><p style=\"\">This course will ignite your playing like never before. You&#039;ll have a whole new bag of guitar tricks- and you&#039;ll be playing with confidence and skill.</p><p style=\"\">I ll show you how to master the 4 T&#039;s: Touch, Tone, Time and Taste. Without that you&#039;ve got nothing.</p><p style=\"\">This course is great for anyone interested in learning the ins and outs of Blues guitar playing, the patterns and scales used and the emotion and passion you need to be a great player.</p><p style=\"\">I ll be teaching both finger picking and flat-picking styles. Plus, Im going to walk you through some great guitar solos step by step.</p><p style=\"\">The best student for this course is an intermediate guitar player with a passion for learning the Blues.</p><p style=\"\">By the end of the course you&#039;ll be able to play some great Blues songs, have the tools to create your own licks, and improvise on the fly.</p><p style=\"\">I&#039;ve only got one requirement for this course -You want to rock out and become a great guitar player-So let&#039;s get to it!</p>", 
    "end_date": null, 
    "title": "Smokin' Acoustic Blues Guitar by Jimmy Dillion", 
    "price": "35.00", 
    "instructors": "Jimmy Dillon", 
    "commitment": "2.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/499016_d1d7.jpg", 
    "course_url": "https://www.udemy.com/ultimate-acoustic-blues-guitar/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-05-11T14:49:31Z"
}