{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><strong>As the artist \"Manafest\" I've sold over 300,000 Albums Worldwide over 1,000,000 singles and toured 20 different countries!</strong><br></p>\n\n<p><strong>Let me teach you how to build a successful brand and launch your career as an artist.</strong></p>\n\n\n\n<p><strong>This course gives you access to me to ask any question about your music or the industry.</strong></p>\n\n\n\n<p>  \t                Have you ever dreamed of touring the globe, performing for thousands of fans,  sharing your music and message as an artist?  </p>\n\n\n\n<p>  \t                        This could be YOU; you just need to start today, by writing and recording your songs!  </p>\n\n\n\n<p>  \t                        The perks from being an artist are endless - Brand Sponsorships (free stuff), performing on stage, signing autographs for adoring fans, selling merchandise, getting paid to tour the globe, hear your songs on the radio and being your own boss.  </p>\n\n\n\n<p>  \t                        I created this course to help you overcome your fears about the Music Industry. To help you choose a performance name, genre, write songs, record and have a finished product ready to sell.  I'm a 4 Time Juno Nominated Rock Artist &amp; Record Label Owner selling over 200,000 albums and hundreds of thousands of singles world wide.  This is not head knowledge. This is real life experience from the trenches of a 10 year plus career in the Music Industry.  </p>\n\n\n\n<p>  \t<strong>This course will teach you what you need to know t</strong><strong>o get you started off on the right path in your artist career.</strong>  </p>\n\n\n\n<p>  \t                        You will learn:  </p>\n\n\n\n<p>  \t                        How to overcome your fears and believe that you have a song to share with the world.  </p>\n\n\n\n<p>  \t                How to take action and stay committed while building your brand as an artist.  </p>\n\n\n\n<p>  \t      How to decide on a music genre, stage name and the audience that you want to play your songs for.  </p>\n\n\n\n<p>  \t                How to write and structure great songs for your audience as we dive into verses, choruses and lyrics that share your message.  </p>\n\n\n\n<p>  \t                        How to setup your home studio, record your demos, hire a Producer and have your songs mixed, mastered and ready for release.  </p>\n\n\n\n<p>  \t  Tour Smart and learn how to book shows in both churches and clubs plus how to market so you can sell it out.  </p>\n\n\n\n<p>  \t  Social Media Marketing:  Learn how to tell your story on social media building a real fan base and most importantly build your email list.  </p>\n\n\n\n<p>  \t                      Free Bonus Sections:  </p>\n\n\n\n<p>  \t               - 10 Ways To Make Real Money With Your Music  </p>\n\n\n\n<p>  \t               - My Technique For Writing Songs  </p>\n\n\n\n<p>  \t               - CD Baby vs TuneCore (choosing a digital distributor)  </p>\n\n\n\n<p>  \t               - Step by Step Tutorial: How To Upload Your Music Online  </p>", 
    "end_date": null, 
    "title": "Songwriting, Marketing, & Building Your Brand With Music", 
    "price": "25.00", 
    "instructors": "Christopher Greenwood", 
    "commitment": "6 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/157598_4c9a_3.jpg", 
    "course_url": "https://www.udemy.com/makemusic/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-02-04T04:57:00Z"
}