{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p><em class=\"redactor-inline-converted\"><strong class=\"redactor-inline-converted\">\"Kent, your course is really great! Please let me know if you are offering future or additional courses. Best, Joe\"</strong></em><br></p>\n\n<p><strong class=\"redactor-inline-converted\"><em>\"Kent,<br>Just finished your Blues Piano Crash Course and thoroughly enjoyed it. Am hoping you decide to add more courses soon. I'll definitely sign up if you do. Thank you very much!\"<br>-- Art C.</em></strong></p>\n\n<p>==========================================================================</p>\n\n<p><strong class=\"redactor-inline-converted\"></strong></p>\n\n\n\n<p><strong class=\"redactor-inline-converted\">  \t      NEWS!</strong> </p>\n\n\n\n\n\n<p>The supplemental lectures of this course now include a <strong class=\"redactor-inline-converted\">3-part study of general improvisation techniques</strong>, using Van Morrison's \"Moondance\" as a vehicle. Learn to use the blues scale and others, in a fresh context, outside of the traditional blues genre.</p>\n\n\n\n\n\n\n\n<p>  \t                                                      ***************  </p>\n\n\n\n\n\n\n\n<p><strong>  \t  CORE LECTURES:</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                                                  Learn the essential elements of playing blues piano, including the world-famous Blues Scale, the 12-bar Blues pattern, left-hand grooves, powerful coordination exercises, and plenty of hot licks! Best of all, my goal is for you to start IMPROVISING your own exciting blues solos, as well as be able to sit in on jam sessions.  </p>\n\n\n\n\n\n\n\n<p>You will need absolutely no ability to read music, and zero prior experience with musical improvisation. It will be very good, however, to have \"some\" basic piano experience. For example, I sometimes refer to the letter names of certain piano keys. I recommend using the preview feature for this course to get a feel for what you can understand and learn from these lessons.<br></p>\n\n\n\n\n\n\n\n<p>  \t                              In my private teaching practice, many of my piano students are very excited to learn blues improvisation, no matter what their main focus of study happens to be. Blues was the very first thing I learned to play on the piano. It hooked me so strongly to the piano that I soon began formal lessons in classical and jazz, ended up playing in lots of great bands, and earned a college degree in music.  </p>\n\n\n\n\n\n\n\n<p>  \t                    This course also includes two supplemental downloads: A visual catalog of the chords and scales used in the course, and a list of suggested listening.  </p>\n\n\n\n\n\n\n\n<p>  \t<strong class=\"redactor-inline-converted\">Here is a complete summary of the eleven core lectures (not including the supplemental lectures):</strong>  </p>\n\n\n\n\n\n\n\n<p>  \t                1. In this first of eleven Blues Piano lessons, discover how a simple six-note scale -- the famous \"Blues Scale\" -- is a musician's gold mine for creating original blues sounds. Immediately after this lecture, you can sit down at your piano and start creating bluesy licks and melodies that are all your own. Even more exciting, a player who knows only the Blues Scale can start sitting in on blues and rock jam sessions!  </p>\n\n\n\n\n\n\n\n<p>  \t                2. If you're going to play solo piano Blues, or you want to add a strong supporting groove to a band, then this lecture is for you. Learn to use your left hand to play a dance-able, foot-tapping chord rhythm, while freeing up your right hand to fire off licks and lay down supporting chords. (Later in this course, you'll master the art of putting both hands together as a dynamic duo.)  </p>\n\n\n\n\n\n\n\n<p>  \t                3. The Blues Piano tradition is full of tried-and-true \"stock\" licks, as well as many devices for creating endless original solos. In this lecture, you will learn to use five such \"must-know\" riffing devices.  </p>\n\n\n\n\n\n\n\n<p>  \t                4. By far the most common framework for a Blues song (and countless other songs) is the \"12-bar Blues,\" a repeating chord progression which is known and loved throughout the musical universe. In \"pure\" Blues, the 12-bar progression contains just THREE CHORDS! This lecture gives you a thorough grounding in these chords, and illustrates their fixed place within the 12-bar Blues progression.  </p>\n\n\n\n\n\n\n\n<p>  \t                5. It's time to overcome any fears and frustrations you may have about getting those blasted hands to work together! This is the first of a pair of lectures, in which you will run through a series of progressive drills to gain confidence and skill at two-handed synergy.  </p>\n\n\n\n\n\n\n\n<p>  \t                6. More drills to get your fiercely independent hands playing together as a dynamic duo.  </p>\n\n\n\n\n\n\n\n<p>  \t                7. Learn a new way to groove using a \"walking bass line\" for Blues piano. This lecture includes several more coordination drills, each one coupled with a toe-tapping walking bass line.  </p>\n\n\n\n\n\n\n\n<p>  \t                8. Learn how to approximate the sounds of Blues singers and other instruments who can \"bend\" their notes (slide between pitches). You'll learn all about \"blue notes,\" and also the \"slide off,\" a very popular device associated with blues, rock, and jazz piano.  </p>\n\n\n\n\n\n\n\n<p>  \t                9. Here you will learn a powerful technique for inventing licks and melodies on the fly, by using only the notes of the chord being played at any given moment. With this technique, your available notes will change with each new chord, which lends an \"automatic\" sense of order to the resulting solo. Of course, this device can and should be mixed with other sources of melody, like the Blues Scale.  </p>\n\n\n\n\n\n\n\n<p>  \t                10. You will learn how to maintain a level of excitement in a Blues jam, with a staple of songwriting called the \"turn-around.\" In addition, you'll learn how to use any turn-around pattern as a powerful ending.  </p>\n\n\n\n\n\n\n\n<p>  \t                11. So you've finished the Blues Piano Crash Course! Congratulations! You're all set to become a Master of Blues Piano. In this bonus lesson, you will learn how to transfer everything you've learned in the key of \"C Blues\" to any other key. For example, Blues in \"E\" is popular with guitarists. All the concepts are exactly the same, but you will need to move that C Blues Scale to another starting note, and move those blues chords to a new place as well. Here's how to do it!  </p>", 
    "end_date": null, 
    "title": "The Blues Piano Crash Course++", 
    "price": "35.00", 
    "instructors": "Kent Smith", 
    "commitment": "2 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/268310_4e6b_16.jpg", 
    "course_url": "https://www.udemy.com/the-blues-piano-crash-course/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2014-07-24T21:06:31Z"
}