{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>Chapters</p><p>I. 1-5 Exercise</p><p>An elementary exercise which begins to bring attention to playing on the finger tips, and will readily show you which finger sets are exhibiting tension at the level of lifting by the knuckle. This exercise will help in adding both hands together, and with maintaining 'mental' finger independence during playing once practiced in unison.</p><p>II. Independence</p><p>This is a modification of Unit I., focusing on broadening finger independence by using adjacent finger sets, inspired by Franz Liszt's Two-finger Technique. This new immersive exercise has become a great way to train the more acute controls of the finite flexor and extensor digitorium. </p><p>III. Tendinitis Stretch</p><p>This is a crucial stretch I designed myself for the top (extensor) and bottom (flexor) of the wrist. The goal of this stretch is to bring bodily awareness into play, and allow the wrist and arm to realize how much tension they are naturally carrying-- only once they become stretched in a way they most certainly have not been stretched before; with the new arm weight gained through bodily awareness the goal is to then practice dropping the weight under 'full' gravity, and throwing that new heavier weight across the keys, and rotating correctly to avoid all vertical playing motions. </p><p>IV. The Paper-sliding Touch</p><p>This technique is the pinnacle exercise which each of the previous exercises are applied directly into-- then immediately become simplified. This unit takes all of the previous units and simplifies them into a relaxing approach using \"mental\" bodily awareness to control a \"physical\" sensation. A more fluid, effortless, relaxed technique is what is produced.</p><p>V. Review &amp; Credits</p><p>A review of the basic concepts behind each of the 4 units is briefly discussed, and the credits for the production follow.</p><p>......................</p><p>This is the complete guide to the series. Take it in part, by section, or if you're daring, all the way through. The real goal comes from the practice of these techniques, with immediate results. </p><p>Full purchased video content duration: 1 hour</p><p>**A piano or keyboard of some sort is required to perform the demands of this course. </p><p><br></p><p>BONUS CONTENT: \"The Rock Star Stretch\" included with purchase!</p><p><br></p><p>-David Jefferson B.A., M.M.</p>", 
    "end_date": null, 
    "title": "The Paper-sliding Touch", 
    "price": "45.00", 
    "instructors": "Mr. David Jefferson B.A., M.M.", 
    "commitment": "1 hour", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/726026_3e6b_3.jpg", 
    "course_url": "https://www.udemy.com/the-paper-sliding-touch/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2016-01-12T19:53:45Z"
}