{
    "selfpaced": true, 
    "topic_name": [
        "Music"
    ], 
    "description": "<p>This course covers, explains and details how to write a song Hook and its' use. In a step by step process the student will be shown what the difference is between the hook and the chorus and the parts that make up a catchy Hook. </p><p>They will learn how to create a strong Title for their Hook, which includes; \"How to find Titles in Conversations\", \"How to find Titles in books and magazines\", in social media, TV commercials, movies, street signs, etc. </p><p>Examples are given on composing melodies for titles, creating a melody from a pre-recorded music track, writing a melody for a sad or melancholy track, and creating a Hook from a drum beat. There is also a session on, \"How to add a Tag Line to your Hook\". </p><p>As a bonus, students will receive pre-recorded music tracks to practice creating their own Hooks. I give them an audio version of me creating ideas to a pre-recorded track, then give them an opportunity to create their own Hook to the track. In some instances, I demonstrate how I created a song Hook from start to finished product; the professional studio recording.</p><p>This course is to not to be rushed through. It is to be gone over slowly, many times until it is internalized. Songwriting in any form is an art, and should be  not be treated like a speed reading course. It is for anyone who has the desire to understand the basics of writing a song Hook or for those who hunger to make songwriting a career.</p><p><br></p>", 
    "end_date": null, 
    "title": "The \"Hook\"", 
    "price": "20.00", 
    "instructors": "Clay Drayton", 
    "commitment": "1.5 hours", 
    "cover_url": "https://udemy-images.udemy.com/course/750x422/419936_5525_14.jpg", 
    "course_url": "https://www.udemy.com/the-hook-is-king/", 
    "currency": "USD", 
    "subject_name": [
        "Music Techniques"
    ], 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "udemy"
    ], 
    "start_date": "2015-02-12T06:13:43Z"
}