{
    "selfpaced": false, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                                            Class Central Course Rank  \n                                                    \n                                #1 in Subjects\n                                                                    &gt; Computer Science\n                                                                                                    &gt; Information Technology\n                                                            \n                            \n                                                \n                    \n                                            \n                            PSA: This Course will no longer be available June 30th 2016 onwards\n                            Coursera announced that they will be shutting off their old platform on June 30th. Over  400 courses that are part\n                                of the old stack will be no longer be available. You can find the  complete list here.\n                            \n                            \n\n                            \n                                Read this guide to learn how to download this course before the old platform shuts down. \n\n                                The guide provides two ways to download the courses - Chrome Plugin and Python Script. Depending on which method you use, check the appropriate sections below for further details.\n                            \n                            \n                            \n                                To download this course you need to be enrolled in the course.\n                                                                Unfortunately this course is closed for enrollment to new students. If you hadn't signed up before, you will not be able to download the course.\n                                \n\n                                                            \n\n                            Chrome Plugin\n\n                                                                If you had signed up for this course you will be able to download and save the course materials using the chrome plugin. Click on Go To Class and Log in to your Coursera account to do so.\n                            \n                            Python Script\n                            \n                                                                For the python script to work you will need a class name. Pick one from below:\n                                                                    comnetworks-2012-001\n                                                                    comnetworks-002\n                                                                    comnetworks-003\n                                \n                                \n                                If more than one class name below, pick the last one. If the script fails, pick the one above that and try again. Not all of these class names are guranteed to work.\n\n\n                            \n\n\n\n\n\n\n                        \n                    \n                    Computer networks from ISPs to WiFi and cellular networks are a key part\nof the information economy. These networks are the foundation for the Web,\nand they enable companies such as Google, Facebook and Amazon. This course\nintroduces the fundamental problems of computer networking, from sending\nbits over wires to running distributed applications. For each problem,\nwe explore the design strategies that have proven valuable in practice.\nTopics include error detection and correction, multiple-access, bandwidth\nallocation, routing, internetworking, reliability, quality of service,\nnaming, content delivery, and security. As we cover these topics, you will\nlearn how the internals of the Internet work to support the Web and other\nnetworked applications. You will develop a detailed understanding of widely-used\nnetworking technologies such as TCP/IP, HTTP, 802.11, Ethernet, and DNS.\n\n                                            Syllabus\n                        \n    Introduction, Protocols and Layering\n    Physical and Link layers\n    Retransmissions, Multiple access, Switching\n    Network layer, Internetworking\n    Intra- and Inter-domain Routing\n    Transport layer, Reliability\n    Congestion Control\n    DNS, Web/HTTP, Content Distribution\n    Quality of Service and Real-time Apps\n    Network Security\n\n                                    ", 
    "end_date": "1900-01-01T00:00:00Z", 
    "title": "Computer Networks", 
    "price": 0, 
    "instructors": "David Wetherall, Arvind Krishnamurthy and John Zahorjan", 
    "institution_name": [
        "University of Washington"
    ], 
    "commitment": "", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.coursera.org/course/comnetworks", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Coursera"
    ], 
    "start_date": "2014-01-06T00:00:00Z"
}