{
    "selfpaced": true, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    In this introductory course, learn how to measure an organization’s ICT accessibility and assess the importance of maintaining an inclusive workplace for both employees and customers with disabilities. This six-week course consists of modules detailing some of the primary ICT accessibility obstacles facing organizations today. Each module is taught by a subject matter expert – through content-rich videos, activities, and discussion forums.\n\nWhether you work in the corporate, government or non-profit sector, this course will enable you to identity ICT accessibility issues, analyze specific needs, and evaluate possible solutions. As the world becomes more technology driven, organizations of all sizes and sectors touch ICT accessibility, whether through website design, document creation, or multimedia utilization. Start outlining a plan to establish and maintain an accessible enterprise operation today.\n\nJoin our instructors as we explore why, what, and how to integrate accessibility design elements into your ICT organizational roadmap to support equal access for all.\n\nThis ICT accessibility course will consist of six modules over a six week term. Each module will consist of multiple video lessons. The lesson videos will include instructional content, resources, demonstrations, guest subject matter experts and personal interviews. There will be at least one weekly activity assignment, two discussion forum question postings and one graded ten question multiple-choice quiz at the end of each module.\n\n                                    ", 
    "end_date": "2017-03-06T00:00:00Z", 
    "title": "ICT100x: Information and Communication Technology (ICT) Accessibility", 
    "price": 0, 
    "instructors": "Christopher M. Lee, PhD, Arthur R. Murphy, Carolyn Patricia Phillips M.Ed., ATP, Sheryl Ballenger, PhD, Norah Sinclair, Todd Runkle and Bill Curtis-Davidson", 
    "institution_name": [
        "Georgia Institute of Technology"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/information-communication-technology-ict-gtx-ict100x", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-02-29T00:00:00Z"
}