{
    "selfpaced": false, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    Users expect to be productive across a variety of device types, with access to the applications they need. The phrase “work from anywhere” has evolved throughout the years and these days working from anywhere is the norm for many industries. So much so that “working anywhere and from any device” has become the new reality for most enterprises.\n\nBut it was only when companies set off understanding the value of cloud computing—particularly as it related to how they could leverage its resources to be more agile and to reduce costs—that they also discovered their users were already consuming cloud resources on their own devices.\n\nThis course will prepare you to use Microsoft Enterprise Mobility Suite (EMS) to solve the unique challenges your organization is facing today—and to plan ahead for your organization’s long-term success. Starting with enabling hybrid identity, you will quickly learn how to secure corporate data access, protect your employees’ personal information, and manage iOS, Android, and Windows devices. With this introduction to the EMS, you will be guided through the process of implementing EMS to support Mobile Device Management (MDM) of both company-owned devices and personally-owned devices in your enterprise environment.\n\nUsing a combination of MDM scenarios and, you will obtain a working knowledge of the independent technologies that make up EMS:\n\nMicrosoft Azure AD Premium\n\tAzure Rights Management Services (RMS)\n\tMicrosoft Intune\nModule 1 introduces you to the four elements (users, devices, apps, and data) involved in any enterprise mobility strategy. These basic elements are used as examples throughout the course. Knowing that the core of any enterprise mobility solution must include these elements will make it easier for you to understand how EMS can enable organizations to embrace a mobile workforce.\n\nThis course takes you through:\n\nModule 1: Understanding Enterprise Mobility Suite\n\tModule 2: Cloud Identity with Azure AD Premium\n\tModule 3: Directory Synchronization\n\tModule 4: Implementing Device Enrollment and Management\n\tModule 5: Data Access and Protection\nThe target audience for this course is comprised of enterprise IT Pros who are either tasked with implementing EMS for their organizations or just want to learn more about the technologies included in EMS. While it is not possible to cover every nuance of the technologies included in EMS in a single course, we have included content that will provide you with the solid foundation you will need as you embark on your own EMS implementation.\n\n                                    ", 
    "end_date": "2015-10-26T00:00:00Z", 
    "title": "INF202x: Microsoft Enterprise Mobility Suite", 
    "price": 0, 
    "instructors": "Rob Linsky", 
    "institution_name": [
        "Microsoft"
    ], 
    "commitment": "2-4 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/microsoft-enterprise-mobility-suite-microsoft-inf202x", 
    "duration": "6 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2015-09-14T00:00:00Z"
}