{
    "selfpaced": true, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    This course provides a one-semester overview of information security. It is designed to help students with\nprior computer and programming knowledge — both undergraduate and graduate — understand this important\npriority in society today. The technical content of the course gives a broad overview of essential concepts and\nmethods for providing and evaluating security in information processing systems (operating systems and\napplications, networks, protocols, and so on). \n\nIn addition to its technical content, the course touches on the\nimportance of management and administration, the place information security holds in overall business risk,\nsocial issues such as individual privacy, and the role of public policy.Why Take This Course?\n\n                                            Syllabus\n                        The course will be organized around a few broad themes:\n\n• Foundations: security mindset, essential concepts (policy, CIA, etc.)\n\n• Software security: vulnerabilities and protections, malware, program analysis\n\n• Practical cryptography: encryption, authentication, hashing, symmetric and asymmetric crypto\n\n• Networks: wired and wireless networks, protocols, attacks and countermeasures\n• Applications and special topics: databases, web apps, privacy and anonymity, voting, public policy\n\nThe course is divided into three parts:\nPart 1: \nPart 2:\nPart 3:\n                                    ", 
    "end_date": null, 
    "title": "Intro to Information Security", 
    "price": 0, 
    "instructors": "Mustaque Ahamad and Wenke Lee", 
    "institution_name": [
        "Georgia Institute of Technology", 
        "Georgia Tech Online Master of Science in Computer Science"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.udacity.com/course/intro-to-information-security--ud459?utm_medium=referral&utm_campaign=api", 
    "duration": null, 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-12-04T00:00:00Z"
}