{
    "selfpaced": true, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    The goal of this course is to take existing IT professionals, whether they come from software development or operations, and help them appreciate the challenges facing companies who are looking to embrace scalable software deployment as well as the architectures and thought processes they can use to address these challenges. \n\nStudents will start with a presentation of the problem as it stands today, then dive into the DevOps workflow and a survey of the system architectures currently being used to address this problem.Why Take This Course?Based on Puppetlab's \"State of DevOps\" report for 2013 and 2014,\nhigh-performing organizations are deploying code 30 times more frequently, with\n50 percent fewer failures than their lower-performing counterparts.\n\nThe report states:\n&gt;We can now assert with confidence that high IT performance correlates with strong business performance, helping to boost productivity, profitability and market.\n\nAdopting DevOps is the way most companies improve the performance of their IT organisations,  and this course will help you take the first steps towards that goal.\n\n                                            Syllabus\n                        ##Lesson 1\n- What is DevOps\n- Why DevOps is needed\n- CAMS (Culture, Automation, Measurement, Sharing) principles\n\n##Lesson 2\n- The different perspectives of Dev and Ops\n- Different perspectives can cause conflict\n- How to solve the problems with different approach and some tools\n- How the tools work\n\n##Lesson 3\n- Continuous Integration and Delivery workflows\n- Tools that enable these workflows\n- Measurement and the ways it helps IT and business\n- Tools that help with measurement\n                                    ", 
    "end_date": "2015-08-29T00:00:00Z", 
    "title": "Intro to DevOps", 
    "price": 0, 
    "instructors": "Dwayne Lessner and Karl Krueger", 
    "institution_name": [
        "Nutanix"
    ], 
    "commitment": "6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.udacity.com/course/intro-to-devops--ud611?utm_medium=referral&utm_campaign=api", 
    "duration": "3 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "Udacity"
    ], 
    "start_date": "2015-08-08T00:00:00Z"
}