{
    "selfpaced": false, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    We shop online. We work online. We play online. We live online. As our lives increasingly depend on digital services, the need to protect our information from being maliciously disrupted or misused is really important.\n\nThis free online course will help you to understand online security and start to protect your digital life, whether at home or work. You will learn how to recognise the threats that could harm you online and the steps you can take to reduce the chances that they will happen to you.\n\nWith cyber security often in the news today, the course will also frame your online safety in the context of the wider world, introducing you to different types of malware, including viruses and trojans, as well as concepts such as network security, cryptography, identity theft and risk management.\n\nYour guide for the course is Cory Doctorow, a visiting professor at The Open University.\n\n\n  “If you want an introduction to the subject that provides an overview or to improve your own personal information security, it is an excellent course - enjoyable, informative, engaging and authoritative.”\n- Tony Morbin, Editor-in-Chief, SC Magazine\n\n\nDouble accredited course\n\nThis GCHQ Certified Training course is also accredited by the Institute of Information Security Professionals (IISP).\n\nIt has been developed by The Open University with support from the UK Government’s National Cyber Security Programme and can be accessed free of charge.\n\n\n                                    ", 
    "end_date": "2016-11-28T00:00:00Z", 
    "title": "Introduction to Cyber Security", 
    "price": 0, 
    "instructors": "Arosha K. Bandara", 
    "institution_name": [
        "The Open University"
    ], 
    "commitment": "3 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "http://www.futurelearn.com/courses/introduction-to-cyber-security?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", 
    "duration": "8 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "FutureLearn"
    ], 
    "start_date": "2016-10-03T00:00:00Z"
}