{
    "selfpaced": false, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    New to the cloud and not sure where to begin? This introductory course, taught by cloud experts from The Linux Foundation, will help you grasp the basics of cloud computing and comprehend the terminology, tools and technologies associated with today’s top cloud platforms.\n\nUnderstanding cloud technologies tops the list of most important skills for any developer, system administrator or network computing professional seeking a lucrative career in technology. However, getting started and researching all things cloud can be complicated and time consuming. This course maps out the entire cloud landscape and explains how various tools and platforms fit together.\n\nExperts from The Linux Foundation can help guide you step-by-step as you begin to navigate the cloud. They host some of the world's leading open source cloud projects and provide training and networking opportunities to educate a talent pool to support those projects, and is a respected, neutral, non-profit education source to provide training for anyone learning how to build and manage cloud infrastructure.\n\nThis course gives you a primer on cloud computing and the use of open source software to maximize development and operations. Topics covered include:\n\nNext-generation cloud technologies: Learn about cloud and container technologies like Docker, CoreOS, Cloud Foundry, Kubernetes and OpenStack, as well as the tooling around them.\n\tScalable and performant compute, storage and network solutions: Get an overview of software defined storage and software defined networking solutions.\n\tSolutions employed by companies to meet their business demands: Study up on DevOps and continuous integration practices, as well as the deployment tools available to architects to meet and exceed their business goals.\nNo previous cloud experience is required for this course. \"Introduction to Cloud Infrastructure Technologies\" gives you the knowledge and tools to make smart decisions about which cloud services and applications to use depending on your needs.\n\n                                    ", 
    "end_date": "2017-06-07T00:00:00Z", 
    "title": "LFS151.x: Introduction to Cloud Infrastructure Technologies", 
    "price": 0, 
    "instructors": "Chip Childers and Neependra Khare", 
    "institution_name": [
        "Linux Foundation"
    ], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://www.edx.org/course/introduction-cloud-infrastructure-linuxfoundationx-lfs151-x", 
    "duration": "53 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "edX"
    ], 
    "start_date": "2016-06-01T00:00:00Z"
}