{
    "selfpaced": true, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    SAP Screen Personas 3.0 is a personalization framework integrated into the SAP GUI family. It allows IT professionals and SAP experts to simplify SAP GUI screens (built on SAP’s Dynpro rendering technology). Dynpro technology is used for the majority of classic SAP ERP screens.\r\nThis course provides you with training on how to create consumer-grade screens. Simpler screens allow users to streamline business processes quickly and easily, leading to improved end-user productivity and satisfaction. This course is eighty percent hands-on, so participants can see how to develop and maintain Screen Personas flavors. The course will also cover core administration tasks, including how to share flavors within their organizations.\r\nSAP Screen Personas allows you to:\r\n\r\nImprove the adoption of SAP software by making screens easier to use\r\nIncrease employee productivity by simplifying screens to reduce typing\r\nReduce training costs by making SAP more intuitive\r\nEnhance data quality by reducing free text entry\r\n\r\nTarget Audience\r\n\r\nAnyone interested in SAP´s UX strategy\r\nAnyone interested in simplifying SAP GUI screens\r\nAnyone interested in improving SAP usability\r\nUser Experience experts\r\nDevelopers working in implementation projects\r\nBusiness/data analysts\r\nSAP implementation partners\r\nConsultants\r\nArchitects\r\n\r\nCourse Requirements\r\n\r\nEssential: General knowledge of SAP ERP transactions and how to navigate them\r\nRecommended: None\r\n\r\nDevelopment Systems\r\nIf your primary interest in taking this course is simply to familiarize yourself with the technical development-related necessities and capabilities of SAP Screen Personas, you do not need access to a development system.However, we realize that many of you will be interested in developing your own scenarios, based on the instructions in the course. For the purpose of this course, we will deploy an SAP appliance onto an Amazon Web Service account, which will incur a charge. Your SAP appliance is provided as a free trial. We will provide a detailed guide with instructions on how to set up an account in week 1 as a precursor to the optional exercises. There are a few restrictions for this free account, but you’ll be able to follow the course without any issues, as the instructor will use the same system as you.\r\n \n\n                                            Syllabus\n                        \r\n\r\nWeek 1: Screen Personas Basics\r\nWeek 2: Building Simplified Screens\r\nWeek 3: Scripting and Troubleshooting\r\nWeek 4: Administration and Performance Tips\r\nFinal Exam: Good Luck!\r\n\r\n\n                                    ", 
    "end_date": "2015-04-28T00:00:00Z", 
    "title": "SAP Screen Personas", 
    "price": 0, 
    "instructors": "Sebastian Steinhauer and Peter Spielvogel", 
    "institution_name": [], 
    "commitment": "4-6 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://open.sap.com/courses/sps1", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2015-03-31T00:00:00Z"
}