{
    "selfpaced": true, 
    "topic_name": [
        "Information Technology"
    ], 
    "description": "\n\n                    \n                    \n                    The course is aimed at anyone interested in learning about SAP NetWeaver system upgrades. After completing this course, you will understand the technical background to SAP NetWeaver upgrades and be familiar with the tools and general steps needed to perform an upgrade from start to finish. You will understand the purpose behind SAP NetWeaver upgrades, how to check for supported platforms, and how to locate guides on SAP Service Marketplace. You will also know how to use the maintenance optimizer and Software Update Manager (SUM) tools and be able to describe the roadmap steps of an upgrade.\r\nThis is a special edition openSAP course; your total learning time will be just three to four hours and all the content is already available. The course is broken down into six units consisting of one video per unit, with self-tests for you to complete after each section. Your results will not be saved; they are just for your personal use. At the end of the course, there is a course assignment. You can complete the assignment at any time. If you complete the course assignment successfully, you will receive a record of achievement.\r\n \n\n                                            Syllabus\n                        \r\nUnit 1: Introduction\r\nUnit 2: Planning &amp; Preparation\r\nUnit 3: Software Update Manager Roadmap Steps\r\nUnit 4: Optimizing Upgrade Performance\r\nUnit 5: Database Migration Option\r\nUnit 6: Troubleshooting &amp; Wrap-Up\r\n\n                                    ", 
    "end_date": "2015-11-30T00:00:00Z", 
    "title": "SAP NetWeaver Upgrades in a Nutshell", 
    "price": 0, 
    "instructors": "Tomas Black and Arvin Chiu", 
    "institution_name": [], 
    "commitment": "3-4 hours", 
    "subject_name": [
        "Computer Science"
    ], 
    "course_url": "https://open.sap.com/courses/upnw1", 
    "duration": "4 weeks", 
    "language_name": [
        "English"
    ], 
    "provider_name": [
        "openSAP"
    ], 
    "start_date": "2015-11-02T00:00:00Z"
}