{"selfpaced": false, "topic_name": ["Algebra & Geometry"], "description": "\n\n                    \n                    \n                    What you'll learn\r\nFour weeks. 5-10 hours per week.You'll have the skills and knowledge necessary to cohesively create a logo, brand, and identity. You'll learn how to present the identity in various marketing, media, and production environments. By the end of the course, you'll be able to confidently take on new branding &amp; identity projects.\r\n\r\n14 Projects\r\nUnlimited Feedback\r\n4 Skype Sessions\r\n\r\n\r\nThe Branding &amp; Identity Design class will prepare students to design and establish visual identities and brand standards across a variety of mediums. The course will help the designer look beyond logo design and acquire a fundamental understanding of the aspects of designing a brand system that is scalable and replicable, regardless of application. In this 4-week online course, you'll:\r\n\r\nDesign a logo and apply the logo across a variety of platforms and applications.\r\nCreate a business overview, looking at your market competition and customers.\r\nDevelop a brand standards guide, in which you’ll define typographic, color, design and voice standards.\r\nHone your skills &amp; build your branding portfolio with a series of hands-on projects\r\nWork with your own expert mentor, with written feedback on all your work and 4 Skype sessions\r\n\r\nYou'll end the course with a certificate of completion, a portfolio of projects, and a strong foundational skillset in branding that you can use to work on branding and identity design projects.\r\n\r\n\r\nBranding is made for you\r\nThe course is tailor-made for busy professionals. Spend about 6 hours per week on readings, projects, and mentor work.\r\n\r\nDesigners or aspiring designers\r\nAny designer or aspiring designer wanting to develop their experience and knowledge of designing brands will find this course useful.\r\n\r\nMarketers and business leaders\r\nIf you're considering a brand update, working through the brand identity creation process will be a valuable exercise — even if you ultimately end up working with an expert!\r\n\r\n\r\n\n\n                                            Syllabus\n                        WEEK 1\r\nDefining BrandsWhat is a brand? You'll observe brands in the wild and discuss brand definition with your mentor.\r\n \r\nBusiness BasicsLearn how to speak the language of branding from a business perspective: executive summary, USP, target market, marketing plan, and more.\r\n \r\nCreative BriefsWhat is a creative brief? Practice writing your first one in this unit.\r\n \r\n\r\nWEEK 2\r\nConcept Generation\r\nIn this unit, you'll get the lay of the land. Topics include: reviewing logos in industry; Competitive analysis chart, color, shape, type, style, expectations; What is a concept?\r\nYou'll begin sketching logo ideas for your creative brief, review designs with your mentor, and pick several to move forward with.\r\nWEEK 3\r\nRefining a Concept\r\nTopics: The elements of a good logo, type and color; Where logos live; Considerations about execution and format.\r\nYou'll refine your sketches from the previous unit.\r\n\r\nColor / Application\r\nTopics: Moving from paper to pixels: formats, application and implications; Choosing type: for the logo, primary and secondary faces; Looking at color: develop a color pallet for logo, primary and secondary.\r\nWEEK 4\r\nCreating the Manual\r\nTopics: About brand standards; Brand DNA, expressing it simply: market, user, usp, beliefs, opportunities; How standards are expressed.\r\nYou'll create your own brand standards manual as a living document of the brand identity you just developed.\r\n\r\n\r\n\n                                    ", "end_date": "2016-07-08T00:00:00Z", "title": "Branding & Identity Design", "price": 299.0, "instructors": "", "institution_name": [], "commitment": "5-10 hours", "subject_name": ["Mathematics"], "course_url": "http://trydesignlab.com/branding-identity-course/?utm_source=classcentral", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["Designlab"], "start_date": "2016-06-10T00:00:00Z"}