{"selfpaced": false, "topic_name": ["Algebra & Geometry"], "description": "\n\n                    \n                    \n                    Did you know that two-thirds of teachers in the European Union learn about ICT in their own time, and almost all are positive about its impact on students, according to the Survey in schools: ICT and education (2013)? Despite this readiness however, many teachers in Europe still have a lack of competence in using ICT in their teaching and use it only to a small extent in their classrooms. In order to meet this challenge, the European project MENTEP (Mentoring Technology-Enhanced Teaching, managed by European Schoolnet and funded by the European Commission) is developing an online self-assessment tool to empower teachers to progress in their Technology-Enhanced Teaching (TET) competence at their own pace.This course, which is the first in the MENTEP MOOC series on improving Technology-Enhanced Teaching, is an integral part of the project. The MENTEP MOOC series will support the project’s goals to:- Boost teachers’ competence and confidence to use ICT in the classroom- Increase the number of teachers able to innovate using ICT- Enhance the uptake of ICT in teaching and learning- Strengthen the professional profile of the teaching profession- Improve data on teachers’ digital competence and training needs- Promote stronger coherence between EU and national approaches to the assessment of Technology-Enhanced Teaching competence\n\n                                    ", "end_date": "2015-11-02T00:00:00Z", "title": "Introducing Technology-Enhanced Teaching", "price": 0, "instructors": "Caroline Kearney and Reyhan Güneş", "institution_name": ["European Schoolnet Academy"], "commitment": "", "subject_name": ["Mathematics"], "course_url": "http://www.europeanschoolnetacademy.eu/web/introducing-technology-enhanced-teaching/", "duration": "5 weeks", "language_name": ["English"], "provider_name": ["Independent"], "start_date": "2015-09-28T00:00:00Z"}