{"selfpaced": false, "topic_name": ["Algebra & Geometry"], "description": "\n\n                    \n                    \n                    What’s the connection between the size of a city and the number of gas stations in it? How would you describe this relationship? How would you try to visualise and understand it?\n\nStudy real-world connections using algebra and geometry\n\nIn this free online course, we’ll look at a wide spectrum of interesting, and often surprising, mathematical relationships in our everyday world. These real-world interconnections can be studied using algebra and visualised concretely using graph paper and pencil, along with modern technologies such as graphing calculators and interactive graphing software.\n\nAlgebraic functions and their graphs allow us to make predictions, evaluate actions and test theories about many things - such as the trajectory of a football, the number of times the word “of”’ appears in a novel, scaling laws in biology and the relationship between supply and demand in economics.\n\nExplore linear, quadratic, inverse and power relationships\n\nOur journey begins with the fundamental idea of direct proportionality. In Week, 1 you’ll meet lots of examples of linear relationships in the world around us. You’ll learn to represent these relationships algebraically and graph them geometrically in the Cartesian plane to aid in visualisation.\n\nIn subsequent weeks, we’ll look at quadratic relations from Apollonius to Bezier; inverse relations and the associated geometry of hyperbolas; and finally power relationships, higher degree polynomials and rational functions. We’ll discuss the history, look at lots of examples, and show you how to solve an interesting variety of concrete problems.\n\nGain valuable skills for further study\n\nUnderstanding basic mathematical relationships is vital to many fields of study: biology, engineering, business, economics, political science and design. By the end of this course, you’ll have hands-on experience with a wide range of explicit examples, be familiar with a core area of pre-calculus mathematics, and be ready to go on to more advanced study of calculus or linear algebra.\n\nWhether you’re encountering these topics for the first time or brushing up on your high school mathematics, we hope you’ll actively join our community on this journey through some fascinating and practical topics that have contributed much to our understanding of the world around us.\n\n\n                                    ", "end_date": "2015-11-09T00:00:00Z", "title": "Maths for Humans: Linear, Quadratic & Inverse Relations", "price": 0, "instructors": "Daniel Mansfield and Norman Wildberger", "institution_name": ["University of New South Wales"], "commitment": "3 hours", "subject_name": ["Mathematics"], "course_url": "http://www.futurelearn.com/courses/maths-linear-quadratic?utm_campaign=Courses+feed&utm_medium=courses-feed&utm_source=courses-feed", "duration": "4 weeks", "language_name": ["English"], "provider_name": ["FutureLearn"], "start_date": "2015-10-12T00:00:00Z"}